<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 05 Nov 2025 17:38:29 GMT</lastBuildDate>
    <item>
      <title>This exclusive Norton VPN price means you don't have to wait until Black Friday for a great VPN deal</title>
      <link>https://www.techradar.com/vpn/vpn-services/this-exclusive-norton-vpn-price-means-you-dont-have-to-wait-until-black-friday-for-a-great-vpn-deal</link>
      <pubDate>Wed, 05 Nov 2025 17:34:33 +0000</pubDate>
      <guid isPermaLink="false">iWM7qNXP4Z4U3Nui5b2xdG</guid>
      <description>You can already save on Norton's premium VPN plans, meaning no need to wait around until Black Friday if you want online security and overseas streaming now.</description>
    </item>
    <item>
      <title>Google Maps is getting a big Gemini upgrade for drivers &#8211; here are 4 new features coming soon</title>
      <link>https://www.techradar.com/ai-platforms-assistants/google-maps-is-getting-a-big-gemini-upgrade-for-drivers-here-are-4-new-features-coming-soon</link>
      <pubDate>Wed, 05 Nov 2025 17:32:57 +0000</pubDate>
      <guid isPermaLink="false">NCocxQng3PwBEcdz8j7PMa</guid>
      <description>Google has announced several new Gemini-powered features that are coming to the Google Maps app &#8211;here's what they do and when they roll out.</description>
    </item>
    <item>
      <title>How to watch Club Brugge vs FC Barcelona: free streams, TV details for Champions League 2025/26 game as Marcus Rashford looks to extend his impressive form</title>
      <link>https://www.techradar.com/how-to-watch/football/club-brugge-vs-fc-barcelona-champions-league-2025-26-free</link>
      <pubDate>Wed, 05 Nov 2025 17:30:00 +0000</pubDate>
      <guid isPermaLink="false">srM88QyXst4Xs8KqyCXvyN</guid>
      <description>All the ways to watch Club Brugge vs FC Barcelona in the 2025/26 Champions League as the Catalonians aim for another three points.</description>
    </item>
    <item>
      <title>Someone Made the Ultimate Portable CD Player, and I Need It Right Now</title>
      <link>https://gizmodo.com/someone-made-the-ultimate-portable-cd-player-and-i-need-it-right-now-2000681903</link>
      <pubDate>Wed, 05 Nov 2025 17:25:50 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000681903</guid>
      <description>It has two headphone jacks, rips CDs in real time, and supports hi-fi wireless audio.</description>
    </item>
    <item>
      <title>Reddit and Kick added to Australia's social media ban as deadline looms &#8211; but critics are increasingly concerned</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/reddit-and-kick-added-to-australias-social-media-ban-as-deadline-looms-but-critics-are-increasingly-concerned</link>
      <pubDate>Wed, 05 Nov 2025 17:22:56 +0000</pubDate>
      <guid isPermaLink="false">Uib4JmGRPHYSFKg8DesE4L</guid>
      <description>Australia's eSafety Commissioner has added online forum Reddit and streaming service Kick to its list of platforms subject to an impending ban for under-16s. The law, which comes into effect soon, raises questions about online privacy and the effectiveness of such widespread restrictions</description>
    </item>
    <item>
      <title>Le nouveau format HDR de Samsung veut sauver le cin&#233;ma &#224; la maison</title>
      <link>https://www.01net.com/actualites/le-nouveau-format-hdr-de-samsung-veut-sauver-le-cinema-a-la-maison.html</link>
      <pubDate>Wed, 05 Nov 2025 17:16:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305518</guid>
      <description>Deux mois apr&#232;s la pr&#233;sentation du Dolby Vision 2, Samsung r&#233;plique avec une nouvelle version de sa technologie d&#8217;affichage qui en met plein les yeux. Le HDR10+ Advanced, qui fera ses premiers pas l'ann&#233;e prochaine, veut rendre l'image plus lumineuse et pr&#233;cise &#8212; il se propose surtout de r&#233;gler une bonne fois pour toute le probl&#232;me de l'affichage &#171; soap opera &#187; qui bousille les films....</description>
    </item>
    <item>
      <title>Astronomers Are Tracking a Giant Sunspot Cluster That&#8217;s Already Causing Problems</title>
      <link>https://gizmodo.com/astronomers-are-tracking-a-giant-sunspot-cluster-thats-already-causing-problems-2000681973</link>
      <pubDate>Wed, 05 Nov 2025 17:15:24 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000681973</guid>
      <description>The region has unleashed at least two powerful solar flares in the last 12 hours, and experts are certain there's more to come.</description>
    </item>
    <item>
      <title>Galaxy S26&#160;: la hausse de prix est &#171;&#160;in&#233;vitable&#160;&#187;</title>
      <link>https://www.01net.com/actualites/galaxy-s26-la-hausse-de-prix-est-inevitable.html</link>
      <pubDate>Wed, 05 Nov 2025 17:10:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305474</guid>
      <description>Samsung pourrait enfin briser deux ans de stabilit&#233; tarifaire. Selon ET News, le futur Galaxy&#8239;S26 pourrait co&#251;ter plus cher que ses pr&#233;d&#233;cesseurs, cons&#233;quence directe de la flamb&#233;e des prix des composants &#233;lectroniques.</description>
    </item>
    <item>
      <title>Cet outil tr&#232;s pratique va simplifier l&#8217;installation de vos applications sur Windows</title>
      <link>https://www.frandroid.com/marques/microsoft/2856963_cet-outil-tres-pratique-va-simplifier-linstallation-de-vos-applications-sur-windows</link>
      <pubDate>Wed, 05 Nov 2025 17:06:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2856963_cet-outil-tres-pratique-va-simplifier-linstallation-de-vos-applications-sur-windows</guid>
      <description>
Microsoft met en place un nouvel outil qui devrait devenir tr&#232;s pratique en cas de r&#233;installation de Windows.
</description>
    </item>
    <item>
      <title>Home Depot's 2025 Black Friday sale is live &#8211; 45% off Christmas decor, tools, appliances, and more</title>
      <link>https://www.techradar.com/seasonal-sales/home-depots-2025-black-friday-sale-is-live-45-percent-off-christmas-decor-tools-appliances-and-more</link>
      <pubDate>Wed, 05 Nov 2025 17:06:26 +0000</pubDate>
      <guid isPermaLink="false">Wkk5Z9Qn8EKTdYJaUBACvW</guid>
      <description>Home Depot's 2025 Black Friday sale is live, and I'm rounding up today's best deals, featuring up to 45% off appliances, tools, Christmas decor, and more.</description>
    </item>
    <item>
      <title>The Breville The Barista Express is down to its lowest price this year &#8211; and we adore it</title>
      <link>https://www.techradar.com/home/coffee-machines/the-breville-the-barista-express-is-down-to-its-lowest-price-this-year-and-we-adore-it</link>
      <pubDate>Wed, 05 Nov 2025 17:05:27 +0000</pubDate>
      <guid isPermaLink="false">NGzvkBHuAMysXaK4y5pELG</guid>
      <description>The Breville The Barista Express is one of the best coffee makers around, and it's back down to its lowest price this year for Black Friday</description>
    </item>
    <item>
      <title>Three of the biggest cybercrime gangs around appear to be teaming up - which could be bad news for all of us</title>
      <link>https://www.techradar.com/pro/security/three-of-the-biggest-cybercrime-gangs-around-appear-to-be-teaming-up-which-could-be-bad-news-for-all-of-us</link>
      <pubDate>Wed, 05 Nov 2025 17:04:00 +0000</pubDate>
      <guid isPermaLink="false">jxuPZu63ZsDy7QcB4oyrMX</guid>
      <description>Scattered Lapsus$ Hunters are making it official, and joining forces to terrorize organizations everywhere.</description>
    </item>
    <item>
      <title>Deux nouveaux modes arrivent sur Google traduction pour vous faciliter la vie</title>
      <link>https://www.01net.com/actualites/deux-nouveaux-modes-arrivent-sur-google-traduction-pour-vous-faciliter-la-vie.html</link>
      <pubDate>Wed, 05 Nov 2025 17:03:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304946</guid>
      <description>Google ajoute deux nouveaux modes de traduction rapide et avanc&#233;e &#224; son application Google Traduction. Ces deux nouvelles fonctionnalit&#233;s, dont une aliment&#233;e par l&#8217;intelligence artificielle, doivent permettre de s&#8217;adapter &#224; un grand nombre de situations pouvant &#234;tre rencontr&#233;es par l&#8217;utilisateur.</description>
    </item>
    <item>
      <title>Black Friday 2025 : les offres sont nombreuses chez Amazon &amp; Co, voici les meilleurs deals en avant-premi&#232;re</title>
      <link>https://www.frandroid.com/bons-plans/2849105_black-friday-2025-la-braderie-continue-chez-amazon-co-voici-les-meilleures-offres-en-avant-premiere</link>
      <pubDate>Wed, 05 Nov 2025 17:02:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849105_black-friday-2025-la-braderie-continue-chez-amazon-co-voici-les-meilleures-offres-en-avant-premiere</guid>
      <description>
&#192; peine novembre entam&#233; que le Black Friday pointe d&#233;j&#224; le bout de son nez chez certains e-commer&#231;ants fran&#231;ais. On vous a donc pr&#233;par&#233; une s&#233;lection des meilleures offres du moment, mise &#224; jour en temps r&#233;el, pour vous aider &#224; d&#233;nicher les bons plans tech sans prise de t&#234;te.
</description>
    </item>
    <item>
      <title>Replika&#160;founder raises $20M pre-seed for Wabi, the&#160;&#8216;YouTube&#160;of apps&#8217;</title>
      <link>https://techcrunch.com/2025/11/05/replika-founder-raises-20m-pre-seed-for-wabi-the-youtube-of-apps/</link>
      <pubDate>Wed, 05 Nov 2025 17:01:17 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3064875</guid>
      <description>Wabi, a startup from the founder of Replika, has just raised a $20 million pre-seed round. Wabi is like "YouTube for apps" -- a social platform where anyone can use prompts to instantly create&#160;mini apps and share them with friends.</description>
    </item>
    <item>
      <title>Nintendo is getting the Switch ready for retirement</title>
      <link>https://www.theverge.com/news/814273/nintendo-switch-2-console-primary-focus-pivot</link>
      <pubDate>2025-11-05T12:01:07-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814273</guid>
      <description>Nintendo is stepping further away from its original Switch console, with the company now planning to dedicate most of its attention to its successor. In a financial results briefing on Wednesday, Nintendo said that &#8220;going forward, we will shift our primary development focus to Nintendo Switch 2 and expand our business around this new platform.&#8221; [&#8230;]</description>
    </item>
    <item>
      <title>Discord now lets parents control who contacts their teens, but messages stay private</title>
      <link>https://www.theverge.com/news/814144/discord-family-center-dm-controls</link>
      <pubDate>2025-11-05T12:01:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814144</guid>
      <description>Discord is expanding the safety controls parents and guardians have access to in its Family Center, including increased visibility of their teens&#8217; activity, allowing guardians to control sensitive content filtering and data privacy settings, and giving them more control over who can DM their teens.&#160; New Social Permissions toggles will allow guardians to choose whether [&#8230;]...</description>
    </item>
    <item>
      <title>Remember, Remember, &#8216;V for Vendetta&#8217; Is Back in Theaters Next November</title>
      <link>https://gizmodo.com/v-for-vendetta-20th-anniversary-re-release-bonfire-night-2000681984</link>
      <pubDate>Wed, 05 Nov 2025 17:00:58 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000681984</guid>
      <description>The Hugo Weaving and Natalie Portman graphic novel adaptation will return to theaters November 5, 2026.</description>
    </item>
    <item>
      <title>Les produits Samsung sont d&#233;j&#224; &#224; prix cass&#233;s lors du pr&#233;-Black Friday : les 14 deals &#224; ne pas louper</title>
      <link>https://www.frandroid.com/bons-plans/2852851_les-produits-samsung-sont-deja-a-prix-casses-lors-du-pre-black-friday-les-11-deals-a-ne-pas-louper</link>
      <pubDate>Wed, 05 Nov 2025 17:00:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2852851_les-produits-samsung-sont-deja-a-prix-casses-lors-du-pre-black-friday-les-11-deals-a-ne-pas-louper</guid>
      <description>
Le pr&#233;-Black Friday d&#233;marre chez plusieurs e-commer&#231;ants avec de belles r&#233;ductions sur de nombreux produits tech. Samsung est aussi de la partie : t&#233;l&#233;viseurs, smartphones, tablettes&#8230; tout y passe. Voici notre s&#233;lection des meilleures offres de la marque.
</description>
    </item>
    <item>
      <title>The best laptop deals you can get right now</title>
      <link>https://www.theverge.com/good-deals/23161948/apple-macbook-lenovo-acer-deal-sale</link>
      <pubDate>2025-11-05T12:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/good-deals/23161948/apple-macbook-lenovo-acer-deal-sale</guid>
      <description>If you want a great laptop, you&#8217;re going to have to fork over a ton of money, right? Not necessarily. There are dozens of good laptops on the market at various price points. However, it can feel overwhelming to find the right one for your needs (some are better suited for, say, college students, whereas [&#8230;]</description>
    </item>
    <item>
      <title>Google makes it easier to access AI Mode in Chrome on iOS and Android</title>
      <link>https://techcrunch.com/2025/11/05/google-makes-it-easier-to-access-ai-mode-in-chrome-on-ios-and-android/</link>
      <pubDate>Wed, 05 Nov 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3065228</guid>
      <description>Users will now be able to access AI Mode via a new dedicated shortcut button under the search bar when opening a "New Tab" page in Chrome.</description>
    </item>
    <item>
      <title>Microsoft built a fake marketplace to test AI agents &#8212; they failed in surprising ways</title>
      <link>https://techcrunch.com/2025/11/05/microsoft-built-a-synthetic-marketplace-for-testing-ai-agents/</link>
      <pubDate>Wed, 05 Nov 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3065262</guid>
      <description>The research raises new questions about how well AI agents will perform when working unsupervised &#8212; and how quickly AI companies can make good on promises of an agentic future.</description>
    </item>
    <item>
      <title>You can keep using your iPad as an Apple Home hub until February</title>
      <link>https://www.theverge.com/news/814287/apple-home-new-architecture-update-delay</link>
      <pubDate>2025-11-05T11:56:44-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814287</guid>
      <description>If you&#8217;ve been reluctant to update to the new Apple Home architecture, you now have a few more months before Apple forces your hand. Apple has pushed back the deadline to February 10, 2026, rather than fall 2025.&#160; The refreshed version of Apple Home has been available for a couple of years now and adds [&#8230;]</description>
    </item>
    <item>
      <title>This AI smart ring lets you record voice notes with a whisper</title>
      <link>https://www.theverge.com/ai-artificial-intelligence/814329/sandbar-stream-ring-ai-wearable</link>
      <pubDate>2025-11-05T11:55:55-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814329</guid>
      <description>Another AI-powered wearable is coming to market. It&#8217;s not a pendant like Friend, nor a wristband like Amazon&#8217;s Bee. This time, it&#8217;s a smart ring called the Stream Ring from the company Sandbar founded by former employees of the neural interface startup CTRL-Labs that was acquired by Meta. Users can preorder the Stream Ring now [&#8230;]</description>
    </item>
    <item>
      <title>Chat Control isn&#8217;t dead, Denmark has a new proposal &#8722; here&#8217;s all we know</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/chat-control-isnt-dead-denmark-has-a-new-proposal-heres-all-we-know</link>
      <pubDate>Wed, 05 Nov 2025 16:50:06 +0000</pubDate>
      <guid isPermaLink="false">ENjn2gRhKtDFmfHgrqTY5b</guid>
      <description>Denmark withdraws the mandatory scanning of all our private chats in the EU. Yet, the Chat Control battle is still up and going.</description>
    </item>
    <item>
      <title>Google&#8217;s fantastic Pixel Buds Pro 2 are down to $169</title>
      <link>https://www.theverge.com/tech/814149/google-pixel-buds-pro-2-wireless-earbuds-deal-sale</link>
      <pubDate>2025-11-05T11:49:28-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/814149/googles-pixel-buds-pro-2-are-now-179-their-lowest-price-yet</guid>
      <description>Black Friday will bring huge discounts on all sorts of tech. But sometimes you just can&#8217;t wait, especially if you just lost your last pair of earbuds, or perhaps they no longer hold a charge. If you need a great set of noise-canceling wireless earbuds &#8212; and you use an Android phone &#8212; you may [&#8230;]</description>
    </item>
    <item>
      <title>Le Black Friday liquide les stocks de smartphones  : voici le meilleur des promos sur les iPhone d&#8217;Apple, Samsung Galaxy et Google Pixel</title>
      <link>https://www.frandroid.com/bons-plans/2848295_le-black-friday-liquide-les-stocks-de-smartphones-notre-top-10-des-promos-sur-les-iphone-dapple-samsung-galaxy-et-google-pixel</link>
      <pubDate>Wed, 05 Nov 2025 16:48:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848295_le-black-friday-liquide-les-stocks-de-smartphones-notre-top-10-des-promos-sur-les-iphone-dapple-samsung-galaxy-et-google-pixel</guid>
      <description>
Le Black Friday est bien en avance cette ann&#233;e, et de tous les produits tech, ce sont les smartphones qui en profitent le plus. Samsung Galaxy, iPhone d'Apple, Google Pixel, Xiaomi Redmi, de l'entr&#233;e au haut de gamme, voyons ce que r&#233;servent les e-commer&#231;ants en ce d&#233;but de Black November.
</description>
    </item>
    <item>
      <title>Les offres sont nombreuses chez Boulanger durant le pr&#233;-Black Friday, mais voici celles qui m&#233;ritent votre argent</title>
      <link>https://www.frandroid.com/bons-plans/2848955_boulanger-fait-le-plein-de-bonnes-affaires-pour-le-pre-black-friday-les-28-meilleurs-deals-a-ne-pas-manquer</link>
      <pubDate>Wed, 05 Nov 2025 16:47:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848955_boulanger-fait-le-plein-de-bonnes-affaires-pour-le-pre-black-friday-les-28-meilleurs-deals-a-ne-pas-manquer</guid>
      <description>
Boulanger a devanc&#233; la concurrence en lan&#231;ant son pr&#233;-Black Friday d&#232;s le 31 octobre. De nombreuses offres Tech sont d&#233;j&#224; disponibles &#224; des prix tr&#232;s attractifs. Voici les promotions les plus int&#233;ressantes propos&#233;es par l&#8217;un des leaders fran&#231;ais de la distribution high-tech.
</description>
    </item>
    <item>
      <title>Supreme Court hears case on Trump&#8217;s tariffs. What you need to know</title>
      <link>https://www.fastcompany.com/91435542/tariffs-trump-supreme-court-hearing</link>
      <pubDate>2025-11-05T16:46:25</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91435542/tariffs-trump-supreme-court-hearing</guid>
      <description>The stakes are enormous, both politically and financially.
Three lower courts have ruled illegal President Donald Trump&#8217;s use of emergency powers to impose&#160;worldwide tariffs. Now&#160;the Supreme Court, with three justices Trump appointed and generally favorable to muscular presidential power, will have the final word.</description>
    </item>
    <item>
      <title>Trump&#8217;s Billionaire Pick for NASA Is Back. So What Changed?</title>
      <link>https://gizmodo.com/trumps-billionaire-pick-for-nasa-is-back-so-what-changed-2000681966</link>
      <pubDate>Wed, 05 Nov 2025 16:45:24 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000681966</guid>
      <description>Wasn't Trump just calling Jared Isaacman a blue-blooded Democrat?</description>
    </item>
    <item>
      <title>Quels sont les meilleurs robots aspirateurs laveurs en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/2037272_quels-sont-les-meilleurs-aspirateurs-robots-laveur-notre-selection</link>
      <pubDate>Wed, 05 Nov 2025 16:40:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2037272_quels-sont-les-meilleurs-aspirateurs-robots-laveur-notre-selection</guid>
      <description>
De plus en plus d'aspirateurs robots proposent une fonction de nettoyage humide pour s'occuper &#224; fond des sols. Certes, il s'agit souvent de mod&#232;les plus chers, mais aussi plus performants et polyvalents. Apr&#232;s tests, voici notre s&#233;lection des meilleurs aspirateurs robots laveurs.
</description>
    </item>
    <item>
      <title>T-Mobile brings free 911 emergency texting to AT&amp;#038;T and Verizon customers</title>
      <link>https://www.theverge.com/news/814319/t-mobile-911-emergency-texting-att-verizon-free</link>
      <pubDate>2025-11-05T11:40:10-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814319</guid>
      <description>T-Mobile is opening up access to its Starlink-powered emergency texting service. The carrier announced on Wednesday that anyone with a compatible phone &#8212; even AT&amp;T and Verizon customers &#8212; can sign up to text 911 over satellite for free. In July, T-Mobile launched its &#8220;T-Satellite&#8221; service to customers across the US for $10 per month, [&#8230;]</description>
    </item>
    <item>
      <title>Cdiscount&#160;d&#233;voile ses meilleures&#160;offres du pr&#233;-Black Friday&#160;: les 11 offres qui m&#233;ritent votre argent</title>
      <link>https://www.frandroid.com/bons-plans/2850059_cdiscount-devoile-ses-meilleures-offres-du-pre-black-friday-les-10-offres-qui-meritent-votre-argent</link>
      <pubDate>Wed, 05 Nov 2025 16:39:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850059_cdiscount-devoile-ses-meilleures-offres-du-pre-black-friday-les-10-offres-qui-meritent-votre-argent</guid>
      <description>
Cdiscount fait aussi son pr&#233;-Black Friday avec une s&#233;rie de promotions sur des produits Tech. C&#8217;est l&#8217;occasion id&#233;ale pour s&#8217;&#233;quiper avant la fin de l&#8217;ann&#233;e 2025, que ce soit pour renouveler son smartphone, investir dans un ordinateur portable performant, ou pr&#233;parer ses cadeaux de No&#235;l &#224; l&#8217;avance. Voici les offres qui valent r&#233;ellement le d&#233;tour.
...</description>
    </item>
    <item>
      <title>Democrats Did Much Better Than Expected</title>
      <link>https://www.wired.com/story/democrats-did-way-better-than-expected-yesterday/</link>
      <pubDate>Wed, 05 Nov 2025 16:38:14 +0000</pubDate>
      <guid isPermaLink="false">6908c804b9ea5989f1467045</guid>
      <description>WIRED talked to NBC&#8217;s Steve Kornacki about Tuesday's election results. He thinks Trump didn't do Republicans any favors.</description>
    </item>
    <item>
      <title>Teenage Engineering pairs its reggae-themed sampler with a new voice-changing mic</title>
      <link>https://www.theverge.com/news/814300/teenage-engineering-pairs-its-reggae-themed-sampler-with-a-new-voice-changing-mic</link>
      <pubDate>2025-11-05T11:38:14-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814300</guid>
      <description>Teenage Engineering&#8217;s Riddim looks like just another take on the company&#8217;s EP&#8211;133 KO II sampler. But it actually has a lot more going on, especially when paired with the new EP&#8211;2350 Ting mic.&#160; The Ting has fun CB-radio vibes, and TE describes it as being &#8220;lo-fi by design.&#8221; It&#8217;s got four built-in voice-changing effects, including [&#8230;]</description>
    </item>
    <item>
      <title>Sacrifier la TV pour une fibre pas ch&#232;re ? Cette offre &#224; 26,99 &#8364;/mois va vous faire changer d&#8217;avis [Sponso]</title>
      <link>https://www.frandroid.com/telecom/forfait-internet/2854769_sacrifier-la-tv-pour-une-fibre-pas-chere-cette-offre-a-2699-e-mois-va-vous-faire-changer-davis</link>
      <pubDate>Wed, 05 Nov 2025 16:37:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/forfait-internet/2854769_sacrifier-la-tv-pour-une-fibre-pas-chere-cette-offre-a-2699-e-mois-va-vous-faire-changer-davis</guid>
      <description>
Les offres fibres pas ch&#232;res, &#231;a existe. Mais des offres fibres pas ch&#232;res qui comprennent aussi 160 cha&#238;nes de t&#233;l&#233;vision et une ligne fixe, &#231;a ne court pas les rues. Sauf chez SFR.
</description>
    </item>
    <item>
      <title>8 Best Cordless Vacuums for Your Whole House (2025)</title>
      <link>https://www.wired.com/gallery/best-cordless-vacuum/</link>
      <pubDate>Wed, 05 Nov 2025 16:36:00 +0000</pubDate>
      <guid isPermaLink="false">63e2b8987d87edd2f4f3500a</guid>
      <description>Clean your house without the restraint of a power cord with these cordless stick vacuums.</description>
    </item>
    <item>
      <title>This typeface is too elegant to ignore</title>
      <link>https://www.fastcompany.com/91435792/this-typeface-is-too-elegant-to-ignore</link>
      <pubDate>2025-11-05T16:33:13</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91435792/this-typeface-is-too-elegant-to-ignore</guid>
      <description>Porte Neue is the typeface of effortless sophistication, and that&#8217;s why the &#8216;Fast Company&#8217; design team chose it for the latest issue
Porte Neue is the typeface of effortless sophistication, and that&#8217;s why the &#8216;Fast Company&#8217; design team chose it for the latest issue</description>
    </item>
    <item>
      <title>Face au Tesla Optimus, XPeng d&#233;voile un robot humano&#239;de pr&#234;t &#224; travailler</title>
      <link>https://www.01net.com/actualites/face-au-tesla-optimus-xpeng-devoile-un-robot-humanoide-pret-a-travailler.html</link>
      <pubDate>Wed, 05 Nov 2025 16:28:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305303</guid>
      <description>XPeng a d&#233;voil&#233; sa nouvelle g&#233;n&#233;ration de robot humano&#239;de Iron. Elle marque une &#233;volution significative par rapport aux prototypes pr&#233;c&#233;dents. La firme vise une production de masse fin 2026 et arme son robot d'une batterie solide, ainsi que d'un &#171; cerveau &#187; &#224; 3 mod&#232;les d'IA.</description>
    </item>
    <item>
      <title>Recharger une Tesla devient encore plus facile en France et en Belgique gr&#226;ce au MultiPass</title>
      <link>https://www.frandroid.com/actualites-generales/2856855_recharger-une-tesla-devient-encore-plus-facile-en-france-et-en-belgique-grace-au-multipass</link>
      <pubDate>Wed, 05 Nov 2025 16:28:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2856855_recharger-une-tesla-devient-encore-plus-facile-en-france-et-en-belgique-grace-au-multipass</guid>
      <description>
En France et en Belgique, la recharge d'une Tesla devient encore plus simple qu'avant. Gr&#226;ce &#224; une nouvelle fonctionnalit&#233; lanc&#233;e par le constructeur am&#233;ricain.
</description>
    </item>
    <item>
      <title>Microsoft Teams really could be bad for your (security) health - hackers spoof bosses, send fake messages, and more</title>
      <link>https://www.techradar.com/pro/security/microsoft-teams-really-could-be-bad-for-your-security-health-hackers-spoof-bosses-send-fake-messages-and-more</link>
      <pubDate>Wed, 05 Nov 2025 16:23:00 +0000</pubDate>
      <guid isPermaLink="false">AndoXy32BaAPvGp9ezCFXo</guid>
      <description>Microsoft says it fixed the issue without needing any user action.</description>
    </item>
    <item>
      <title>Pour ne pas tomber en rade de batterie, Amazon brade &#224; 40% cette batterie externe de 25 000 mAh et 165 W pour le pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2856391_pour-ne-pas-tomber-en-rade-de-batterie-amazon-brade-a-40-cette-batterie-externe-de-25-000-mah-et-165-w-pour-le-pre-black-friday</link>
      <pubDate>Wed, 05 Nov 2025 16:23:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2856391_pour-ne-pas-tomber-en-rade-de-batterie-amazon-brade-a-40-cette-batterie-externe-de-25-000-mah-et-165-w-pour-le-pre-black-friday</guid>
      <description>
Avec ses quatre points de charge et une excellente puissance de recharge, la Ugreen Nexode peut vite devenir le compagnon id&#233;al de toutes vos sorties. D'autant plus qu'aujourd'hui, il revient &#224; 59 euros au lieu de 99 euros habituellement. 
</description>
    </item>
    <item>
      <title>TD Bank is closing more branches in 2025: See the full list of 51 doomed locations across 13 states</title>
      <link>https://www.fastcompany.com/91435492/td-bank-closing-branches-full-list-of-doomed-locations-in-2025</link>
      <pubDate>2025-11-05T16:21:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91435492/td-bank-closing-branches-full-list-of-doomed-locations-in-2025</guid>
      <description>The bank has been reimagining its physical footprint for an increasingly digital world. The new closures will impact states along the East Coast.
TD Bank is getting ready to implement a number of branch closures across more than a dozen states on the East Coast. Those closures come at a time when the bank is increasingly shifting its focus to online banking. Here&#8217;s what you need to know about TD Bank&#8217;s branch closures, including a list of closing locations....</description>
    </item>
    <item>
      <title>AMD&#8217;s New CPUs Might Just Kill Low-End GPUs Soon</title>
      <link>https://gizmodo.com/amd-ai-max-plus-388-and-ryzen-ai-max-plus-392-cpu-specs-leak-2000681922</link>
      <pubDate>Wed, 05 Nov 2025 16:16:16 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000681922</guid>
      <description>When the "affordable" graphics cards are so lacking, AMD's new, cheaper APUs sound a lot more enticing.</description>
    </item>
    <item>
      <title>Coca-Cola suscite la col&#232;re avec une publicit&#233; de No&#235;l faite par IA</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2856373_coca-cola-suscite-la-colere-avec-une-publicite-de-noel-faite-par-ia</link>
      <pubDate>Wed, 05 Nov 2025 16:12:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2856373_coca-cola-suscite-la-colere-avec-une-publicite-de-noel-faite-par-ia</guid>
      <description>
Un an apr&#232;s avoir cr&#233;&#233; la pol&#233;mique avec une publicit&#233; g&#233;n&#233;r&#233;e par IA, Coca-Cola r&#233;it&#232;re. La marque mise sur une magie de No&#235;l artificielle.
</description>
    </item>
    <item>
      <title>WEB WAR III</title>
      <link>https://www.theverge.com/tech/813944/browser-wars-chatgpt-gemini-chrome</link>
      <pubDate>2025-11-05T11:10:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=813944</guid>
      <description>OpenAI didn't plan to make a browser. Not at first, anyway. But ever since the company launched ChatGPT, it started to see lots of users do the same thing. "You'd have this tab open on chatgpt.com, and you'd be working on something else somewhere in your browser," says Adam Fry, a product lead on the [&#8230;]</description>
    </item>
    <item>
      <title>Skip the rest - these are the best early Black Friday gaming laptop deals, plus some solid advice to save you cash</title>
      <link>https://www.techradar.com/computing/gaming-laptops/skip-the-rest-these-are-the-best-early-black-friday-gaming-laptop-deals-plus-some-solid-advice-to-save-you-cash</link>
      <pubDate>Wed, 05 Nov 2025 16:09:56 +0000</pubDate>
      <guid isPermaLink="false">SUi62qn9AD2pFbAUdeSerY</guid>
      <description>Looking for a gaming laptop this Black Friday? Here are the 9 best early deals by far, as well as some unbiased buying tips from the experts.</description>
    </item>
    <item>
      <title>Fnac et Darty bradent de nombreux&#160;produits Tech lors du pr&#233;-Black Friday : les 18 offres &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2849237_fnac-et-darty-bradent-de-nombreux-produits-tech-lors-du-pre-black-friday-les-17-offres-a-retenir</link>
      <pubDate>Wed, 05 Nov 2025 16:02:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849237_fnac-et-darty-bradent-de-nombreux-produits-tech-lors-du-pre-black-friday-les-17-offres-a-retenir</guid>
      <description>
Apr&#232;s que Boulanger a lanc&#233; son Black Friday en avance, c&#8217;est au tour de la Fnac et Darty de riposter. Les deux enseignes baissent ainsi les prix sur plusieurs produits tech. Profitez-en d&#232;s maintenant pour faire de bonnes affaires !
</description>
    </item>
    <item>
      <title>Miss Piggy Will Bring &#8216;The Muppets&#8217; Back to the Movies</title>
      <link>https://gizmodo.com/miss-piggy-movie-jennifer-lawrence-emma-stone-cole-escola-muppets-2000681941</link>
      <pubDate>Wed, 05 Nov 2025 16:00:12 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000681941</guid>
      <description>Jennifer Lawrence revealed that she is working with Emma Stone and Cole Escola on a new 'Muppets' project.</description>
    </item>
    <item>
      <title>Disney and Fortnite show hints of budding metaverse with new Disneyland game</title>
      <link>https://www.theverge.com/games/813723/fortnite-disneyland-game-rush-launch-metaverse</link>
      <pubDate>2025-11-05T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=813723</guid>
      <description>Ever since Disney invested $1.5 billion in Epic Games to build a &#8220;persistent universe,&#8221; there&#8217;s been very little indication as to what that may eventually look like. But the latest collaboration between the two companies might be the biggest hint yet &#8212; and it looks a lot like Disneyland. On November 6th, Disney is launching [&#8230;]</description>
    </item>
    <item>
      <title>3 new Hulu movies worth streaming in November 2025 with over 90% on Rotten Tomatoes</title>
      <link>https://www.techradar.com/streaming/hulu/3-new-hulu-movies-worth-streaming-in-november-2025-with-over-90-percent-on-rotten-tomatoes</link>
      <pubDate>Wed, 05 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">FyAhqonGEQatFdDH2jVLsE</guid>
      <description>I&#8217;ve found three new Hulu movies in November 2025 that every romance fan should stream.</description>
    </item>
    <item>
      <title>Buyer&#8217;s or seller&#8217;s housing market? Zillow&#8217;s updated regional ratings for over 400 markets</title>
      <link>https://www.fastcompany.com/91435653/housing-market-buyers-or-sellers-zillow-updated-regional-ratings-for-400-markets</link>
      <pubDate>2025-11-05T16:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91435653/housing-market-buyers-or-sellers-zillow-updated-regional-ratings-for-400-markets</guid>
      <description>Where home sellers&#8212;and home buyers&#8212;have the most power right now, according to Zillow&#8217;s updated analysis released in October.
Want more housing market stories from Lance Lambert&#8217;s ResiClub&#160;in your inbox?&#160;Subscribe&#160;to the&#160;ResiClub&#160;newsletter.</description>
    </item>
    <item>
      <title>Microsoft strengthens its in-country data processing push with more sovereignty options</title>
      <link>https://www.techradar.com/pro/microsoft-strengthens-its-in-country-data-processing-push-with-more-sovereignty-options</link>
      <pubDate>Wed, 05 Nov 2025 15:53:38 +0000</pubDate>
      <guid isPermaLink="false">j7grvC58sKnnY5CBgfmgRf</guid>
      <description>Microsoft says 15 markets will have local Copilot processing by the end of 2026, with more to come.</description>
    </item>
    <item>
      <title>&#171;&#160;23 heures par jour&#160;&#187; : les faux streams de Drake au c&#339;ur d&#8217;une plainte contre Spotify</title>
      <link>https://www.01net.com/actualites/23-heures-par-jour-les-faux-streams-de-drake-au-coeur-dune-plainte-contre-spotify.html</link>
      <pubDate>Wed, 05 Nov 2025 15:50:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305481</guid>
      <description>Les faux streams sont une plaie pour les services de streaming musicaux, mais aussi pour les artistes l&#233;gitimes qui se font &#171; voler &#187; beaucoup d'argent par des &#233;coutes g&#233;n&#233;r&#233;es artificiellement, souvent &#224; l&#8217;aide de bots. Une nouvelle plainte vise directement Spotify, accus&#233; d&#8217;avoir laiss&#233; prosp&#233;rer ce syst&#232;me frauduleux dont aurait largement profit&#233; le rappeur Drake....</description>
    </item>
    <item>
      <title>Trump's tariffs have been 'distracting,' but they won't slow down the CES 2026 parade</title>
      <link>https://www.techradar.com/tech/trumps-tariffs-have-been-distracting-but-they-wont-slow-down-the-ces-2026-parade</link>
      <pubDate>Wed, 05 Nov 2025 15:47:24 +0000</pubDate>
      <guid isPermaLink="false">kEQ5KfTrM5LyxrQyrR9VWm</guid>
      <description>"It's been a challenging time," CTA head tells TechRadar</description>
    </item>
    <item>
      <title>Vous avez rat&#233; notre live Twitch Huawei ? Vous pouvez encore profiter de 12 % de remise sur toute la boutique en ligne [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2849129_decouvrez-les-nouveautes-huawei-et-repartez-avec-rendez-vous-sur-notre-live-twitch-le-4-novembre</link>
      <pubDate>Wed, 05 Nov 2025 15:47:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2849129_decouvrez-les-nouveautes-huawei-et-repartez-avec-rendez-vous-sur-notre-live-twitch-le-4-novembre</guid>
      <description>
Lors d'un live &#233;v&#232;nement, nous avons pr&#233;sent&#233; les nouveaut&#233;s Huawei de 2025 avec des invit&#233;s tr&#232;s sp&#233;ciaux. &#192; cette occasion, le constructeur vous permet de b&#233;n&#233;ficier d'une remise de 12 % sur toute sa boutique en ligne. 
</description>
    </item>
    <item>
      <title>Motion Picture Association hits Meta with cease-and-desist over use of &#8216;PG-13&#8217; label</title>
      <link>https://techcrunch.com/2025/11/05/motion-picture-association-hits-meta-with-cease-and-desist-over-use-of-pg-13-label/</link>
      <pubDate>Wed, 05 Nov 2025 15:46:58 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3065252</guid>
      <description>The MPA sent Meta a cease-and-desist over its use of the term 'PG-13' in Instagram teen ratings system.</description>
    </item>
    <item>
      <title>Invisible depuis des jours, l&#8217;objet interstellaire 3I/Atlas vient de r&#233;appara&#238;tre !</title>
      <link>https://www.futura-sciences.com/sciences/actualites/objet-interstellaire-invisible-depuis-jours-objet-interstellaire-3i-atlas-vient-reapparaitre-127216/#xtor%3DRSS-8</link>
      <pubDate>Wed, 05 Nov 2025 16:45:36 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/objet-interstellaire-invisible-depuis-jours-objet-interstellaire-3i-atlas-vient-reapparaitre-127216/#xtor%3DRSS-8</guid>
      <description>Durant plusieurs jours, la com&#232;te interstellaire&#160;3I/Atlas &#233;tait devenue invisible depuis la Terre. Mais quelques heures seulement apr&#232;s qu&#8217;elle est pass&#233;e au plus pr&#232;s de notre Soleil, elle est r&#233;apparue. Et les astronomes attendent beaucoup des images qui seront prises dans les jours qui...</description>
    </item>
    <item>
      <title>How to watch Qarabag vs Chelsea on Virgin Media Play &#8212; it's *FREE*</title>
      <link>https://www.techradar.com/how-to-watch/football/qarabag-vs-chelsea-champions-league-2025-26-free</link>
      <pubDate>Wed, 05 Nov 2025 15:45:00 +0000</pubDate>
      <guid isPermaLink="false">YQNiqpPy5KAUdAeguvBRkY</guid>
      <description>Qarabag face Chelsea in the 2025/26 Champions League &#8212; here is how you can watch from anywhere in the world for free.</description>
    </item>
    <item>
      <title>Snapdragon Elite Gen 6 : deux puces pour un m&#234;me nom, gare &#224; la confusion&#160;?</title>
      <link>https://www.frandroid.com/marques/qualcomm/2856715_snapdragon-elite-gen-6-deux-puces-pour-un-meme-nom-gare-a-la-confusion</link>
      <pubDate>Wed, 05 Nov 2025 15:39:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/qualcomm/2856715_snapdragon-elite-gen-6-deux-puces-pour-un-meme-nom-gare-a-la-confusion</guid>
      <description>
Vous pensiez que choisir un smartphone haut de gamme Android &#233;tait d&#233;j&#224; compliqu&#233;&#8239;? Attendez de voir la prochaine g&#233;n&#233;ration de puces Snapdragon. Qualcomm pr&#233;pare deux variantes distinctes pour son futur chip Elite Gen&#8239;6, et &#231;a risque de semer la zizanie chez les acheteurs comme chez les marques.
</description>
    </item>
  </channel>
</rss>
