<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 25 Dec 2025 10:27:11 GMT</lastBuildDate>
    <item>
      <title>La derni&#232;re venue de Garmin avec son &#233;cran Amoled profite de sa premi&#232;re baisse de prix</title>
      <link>https://www.frandroid.com/bons-plans/2919445_la-derniere-venue-de-garmin-avec-son-ecran-amoled-profite-de-sa-premiere-baisse-de-prix</link>
      <pubDate>Thu, 25 Dec 2025 10:17:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2919445_la-derniere-venue-de-garmin-avec-son-ecran-amoled-profite-de-sa-premiere-baisse-de-prix</guid>
      <description>
La Garmin Forerunner 570se d&#233;marque avec une luminosit&#233; &#233;clatante gr&#226;ce &#224; un &#233;cran AMOLED et chez Alltricks, elle conna&#238;t une premi&#232;re promo et passe de 549 euros &#224; 519 euros. 
</description>
    </item>
    <item>
      <title>How to watch 'The Scarecrow's Wedding' on BBC iPlayer (it's FREE)</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/the-scarecrows-wedding-bbc-iplayer-free</link>
      <pubDate>Thu, 25 Dec 2025 10:10:00 +0000</pubDate>
      <guid isPermaLink="false">EHUD5AAjjALqXtcLbJQyKT</guid>
      <description>Betty O&#8217;Barley and Harry O&#8217;Hay&#8217;s big day gets the BBC Christmas special treatment &#8212; here&#8217;s how to watch it for free wherever you are</description>
    </item>
    <item>
      <title>Prominent Canadian Musician Says Gig Was Cancelled After Google AI Overview Wrongly Branded Him Sex Pest</title>
      <link>https://gizmodo.com/prominent-canadian-musician-says-gig-was-cancelled-after-google-ai-overview-wrongly-branded-him-sex-pest-2000703286</link>
      <pubDate>Thu, 25 Dec 2025 10:00:48 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703286</guid>
      <description>What he describes is an ugly case of AI-generated mistaken identity.</description>
    </item>
    <item>
      <title>The best Nintendo Switch 2 games for 2026</title>
      <link>https://www.engadget.com/gaming/nintendo/best-nintendo-switch-2-games-070007467.html?src=rss</link>
      <pubDate>Thu, 25 Dec 2025 10:00:36 +0000</pubDate>
      <guid isPermaLink="false">04ca4219-d586-47e0-9cde-6aebabf1778d</guid>
      <description>One of the best things about the Switch 2 is how familiar it feels if you have used any previous Switch console. You can still move between handheld and TV play without thinking about it, and most of your favorite games come along for the ride. Nintendo&#8217;s compatibility page highlights the rare titles with quirks, while its transfer guide helps you bring over your data so you can pick up right where you left off.Once you are set up, the Switch 2&#8217;s library opens up fast. From cozy indie adventures to sprawling open-world games and couch-co-op staples, the system has something for every kind of p...</description>
    </item>
    <item>
      <title>Comment t&#233;l&#233;charger un e-book sur votre liseuse ?</title>
      <link>https://www.frandroid.com/comment-faire/2592711_comment-telecharger-un-e-book-sur-une-liseuse</link>
      <pubDate>Thu, 25 Dec 2025 10:00:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/comment-faire/2592711_comment-telecharger-un-e-book-sur-une-liseuse</guid>
      <description>
Vous voil&#224; heureux : vous venez d&#8217;acheter un e-book en ligne, et vous n&#8217;attendez qu&#8217;une chose : pouvoir le lire sur votre liseuse. Un probl&#232;me n&#233;anmoins : vous ne savez pas comment transf&#233;rer votre e-book depuis votre ordinateur sur votre liseuse. Pas de panique, on prend les choses en main.
</description>
    </item>
    <item>
      <title>&#8216;Wolf DNA&#8217; Lurks in Many Modern Dog Breeds</title>
      <link>https://www.wired.com/story/wolf-dna-lurks-in-many-modern-dog-breeds/</link>
      <pubDate>Thu, 25 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">694569cff0bcfce52787f83b</guid>
      <description>Although wolf-canine interbreeding has been considered extremely rare, the latest research shows that many present-day canines carry a small amount of wolf genes.</description>
    </item>
    <item>
      <title>Top 12 productivity books of 2025 to change your relationship with work and time</title>
      <link>https://www.fastcompany.com/91457658/best-productivity-books-2025-work-time</link>
      <pubDate>2025-12-25T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91457658/best-productivity-books-2025-work-time</guid>
      <description>These are the titles that helped people stay organized, focused, and finally finish what they started this year.
Somewhere between endless meetings and half-finished projects, we all went looking for better ways to get things done this year. These are the 2025 titles that helped people stay organized, focused, and finally finish what they started.</description>
    </item>
    <item>
      <title>Nintendo Switch 2 : nos conseils pour d&#233;buter et profiter de sa nouvelle console</title>
      <link>https://www.frandroid.com/produits-android/2914919_nintendo-switch-2-nos-conseils-pour-debuter-et-profiter-de-sa-nouvelle-console</link>
      <pubDate>Thu, 25 Dec 2025 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2914919_nintendo-switch-2-nos-conseils-pour-debuter-et-profiter-de-sa-nouvelle-console</guid>
      <description>
Vous venez de d&#233;baller et d'allumer votre toute nouvelle Nintendo Switch 2 et vous avez envie d'avoir la meilleure exp&#233;rience possible ? Voici nos conseils pour en profiter au maximum et choisir les jeux ad&#233;quats.
</description>
    </item>
    <item>
      <title>Steam and Valve's online games are partially down</title>
      <link>https://www.engadget.com/gaming/pc/steam-and-valves-online-games-are-partially-down-191033988.html?src=rss</link>
      <pubDate>Thu, 25 Dec 2025 09:22:50 +0000</pubDate>
      <guid isPermaLink="false">196d7c78-67a0-4b74-9074-f7b37a93758a</guid>
      <description>Starting at around 1PM ET on December 24, Steam experienced an outage that impacted users ability to access the game store and play games online. Valve didn&#8217;t acknowledge the outage publicly, but SteamDB&#8217;s unofficial Steam Status page reported that the Steam Store, Steam Community, and Steam Web APIs were all offline.DownDetector received over 6,000 outage reports around 1:15PM ET, and Steam was also inaccessible from Valve&#8217;s mobile apps. The outage appears to have affected APIs for Valve&#8217;s online games, like Team Fortress 2, Dota 2 and Counterstrike 2, as well.By around 4PM ET, Steam itself h...</description>
    </item>
    <item>
      <title>ChatGPT ressemblera-t-il bient&#244;t &#224; un panneau de pub&#160;?</title>
      <link>https://www.01net.com/actualites/chatgpt-ressemblera-t-il-bientot-a-un-panneau-de-pub.html</link>
      <pubDate>Thu, 25 Dec 2025 09:02:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317277</guid>
      <description>La publicit&#233; n'est plus une ligne rouge pour OpenAI, qui pr&#233;pare le lancement des r&#233;clames dans ChatGPT. Mais il faut la jouer fine, car un trop plein de pubs risque d'effrayer les utilisateurs.</description>
    </item>
    <item>
      <title>How to watch Royal Christmas Message 2025 &#8212; stream King Charles' broadcast free from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/royal-christmas-message-2025</link>
      <pubDate>Thu, 25 Dec 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">wbrT7wxcUxqChKNg4TkE8g</guid>
      <description>King Charles III will deliver the traditional festive broadcast for the fourth time. Here's how to watch Royal Christmas Message 2025.</description>
    </item>
    <item>
      <title>Are you a holiday hero or home alone? Test your Christmas movie knowledge with our 30-question quiz</title>
      <link>https://www.techradar.com/streaming/entertainment/are-you-a-holiday-hero-or-home-alone-test-your-christmas-movie-knowledge-with-our-30-question-quiz</link>
      <pubDate>Thu, 25 Dec 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">jMyJ6iw2d9HyMeLMPxnFJT</guid>
      <description>Do you know your Christmas movies well enough? Take our 30-question quiz on 30 festive flicks to find out.</description>
    </item>
    <item>
      <title>5 surprising ways to use AI</title>
      <link>https://www.fastcompany.com/91463205/5-surprising-ways-to-use-ai</link>
      <pubDate>2025-12-25T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463205/5-surprising-ways-to-use-ai</guid>
      <description>How one experimenter built 200-plus scripts and a pitch machine.
This article is republished with permission from Wonder Tools, a newsletter that helps you discover the most useful sites and apps.</description>
    </item>
    <item>
      <title>Beats Pill : not&#233;e 9/10, cette enceinte nomade &#233;tanche et ultra-endurante (24 h) est quasiment &#224; moiti&#233; prix</title>
      <link>https://www.frandroid.com/bons-plans/2918281_beats-pill-notee-9-10-cette-enceinte-nomade-etanche-et-ultra-endurante-24-h-est-quasiment-a-moitie-prix</link>
      <pubDate>Thu, 25 Dec 2025 08:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2918281_beats-pill-notee-9-10-cette-enceinte-nomade-etanche-et-ultra-endurante-24-h-est-quasiment-a-moitie-prix</guid>
      <description>
Design, performances audio, autonomie... L'enceinte Bluetooth Beats Pill a coch&#233; toutes les cases lors de notre test. Un excellent mod&#232;le qu'Amazon propose actuellement &#224; 90 euros au lieu de 169,95 euros. 
</description>
    </item>
  </channel>
</rss>
