<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 08 Dec 2025 11:23:17 GMT</lastBuildDate>
    <item>
      <title>Samsung Galaxy S26 et S26 Plus : design, photo, performances, fen&#234;tre de sortie, prix&#8230; Tout savoir sur les prochains smartphones</title>
      <link>https://www.frandroid.com/marques/samsung/2867815_samsung-galaxy-s26-et-s26-plus-design-photo-performances-fenetre-de-sortie-prix-tout-savoir-sur-les-prochains-smartphones</link>
      <pubDate>Mon, 08 Dec 2025 11:14:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2867815_samsung-galaxy-s26-et-s26-plus-design-photo-performances-fenetre-de-sortie-prix-tout-savoir-sur-les-prochains-smartphones</guid>
      <description>
Voici tout ce qu'on sait d&#233;j&#224; sur les Samsung Galaxy S26 et Galaxy S26 Plus qui arrivent d&#233;but 2026 (fen&#234;tre de sortie, design, prix, performances...).
</description>
    </item>
    <item>
      <title>Forget Android vs iOS &#8211; this new privacy-focused Linux phone promises to be the alternative we need, but it still runs Android apps</title>
      <link>https://www.techradar.com/phones/forget-android-vs-ios-this-new-privacy-focused-linux-phone-promises-to-be-the-alternative-we-need-but-it-still-runs-android-apps</link>
      <pubDate>Mon, 08 Dec 2025 11:12:35 +0000</pubDate>
      <guid isPermaLink="false">qUFhYZTKojZHWTZzhDtuR4</guid>
      <description>The Jolla Phone runs Sailfish OS 5 and puts privacy first, while still working with Android apps.</description>
    </item>
    <item>
      <title>Amazon fait chuter le prix de la Nintendo Switch 2 sous les 400 &#8364; pour No&#235;l</title>
      <link>https://www.frandroid.com/bons-plans/2850515_amazon-fait-chuter-le-prix-de-la-nintendo-switch-2-sous-les-400-euros-pour-noel</link>
      <pubDate>Mon, 08 Dec 2025 11:09:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850515_amazon-fait-chuter-le-prix-de-la-nintendo-switch-2-sous-les-400-euros-pour-noel</guid>
      <description>
Depuis sa sortie, la Nintendo Switch 2 a b&#233;n&#233;fici&#233; de nombreuses promotions, notamment lors du Black Friday. Si vous avez loup&#233; le coche, vous pouvez vous rattraper aujourd'hui avec cette offre de No&#235;l sur Amazon : la console seule passe &#224; 399,99 euros et le pack Mario Kart World &#224; 434,99 euros. 
</description>
    </item>
    <item>
      <title>Arnaque au faux num&#233;ro d&#8217;opposition bancaire&#160;: voici les SMS qui font des ravages en France</title>
      <link>https://www.01net.com/actualites/arnaque-faux-numero-opposition-bancaire-sms-ravages-france.html</link>
      <pubDate>Mon, 08 Dec 2025 11:02:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314188</guid>
      <description>Cybermalveillance alerte sur une recrudescence de l&#8217;arnaque au faux num&#233;ro d&#8217;opposition bancaire en France. Celle-ci consiste &#224; inciter la victime &#224; contacter d'urgence un faux conseiller pour prot&#233;ger son compte. La plateforme diffuse un exemple des SMS malveillants qui tentent actuellement de pi&#233;ger les Fran&#231;ais.</description>
    </item>
    <item>
      <title>Samsung Galaxy S26 Ultra : design, &#233;cran, fen&#234;tre de sortie, prix&#8230; Tout ce qu&#8217;on sait sur le futur smartphone</title>
      <link>https://www.frandroid.com/marques/samsung/2849839_samsung-galaxy-s26-ultra-design-ecran-fenetre-de-sortie-prix-tout-ce-quon-sait-sur-le-futur-smartphone</link>
      <pubDate>Mon, 08 Dec 2025 11:01:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2849839_samsung-galaxy-s26-ultra-design-ecran-fenetre-de-sortie-prix-tout-ce-quon-sait-sur-le-futur-smartphone</guid>
      <description>
Le Samsung Galaxy S26 Ultra approche petit &#224; petit, voici tout ce que l'on sait d&#233;j&#224; &#224; son sujet (fen&#234;tre de sortie, design, &#233;cran, performances, etc.).
</description>
    </item>
    <item>
      <title>Australia&#8217;s Social Media Ban Is Coming on Wednesday. Here&#8217;s What That Means</title>
      <link>https://gizmodo.com/australias-social-media-ban-is-coming-on-wednesday-heres-what-that-means-2000696594</link>
      <pubDate>Mon, 08 Dec 2025 11:00:46 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000696594</guid>
      <description>Several European countries are already working on their own versions.</description>
    </item>
    <item>
      <title>A Predator in &#8216;Alien: Earth&#8217;? Yeahhhhhhh, No, Says Noah Hawley</title>
      <link>https://gizmodo.com/a-predator-in-alien-earth-yeah-no-says-noah-hawley-2000696584</link>
      <pubDate>Mon, 08 Dec 2025 11:00:28 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000696584</guid>
      <description>'Alien vs. Predator' fans should never give up hope for another crossover, just don't expect it to go down in 'Alien: Earth.'</description>
    </item>
    <item>
      <title>The Best Cookbooks of 2025: Soju Party, Fat and Flour, Salsa Daddy, Italo Punk, and More</title>
      <link>https://www.wired.com/gallery/the-best-cookbooks-of-2025/</link>
      <pubDate>Mon, 08 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">6931e5be58015cfe52aa26b8</guid>
      <description>This year's bumper crop looks at salsa, noodles, drinking culture, and home baking.</description>
    </item>
    <item>
      <title>01net Awards&#160;: les meilleurs &#233;couteurs de l&#8217;ann&#233;e sont&#8230;</title>
      <link>https://www.01net.com/actualites/01net-awards-les-meilleurs-ecouteurs-de-lannee-sont.html</link>
      <pubDate>Mon, 08 Dec 2025 10:59:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314129</guid>
      <description>La r&#233;daction de 01net.com d&#233;signe les meilleurs produits de l&#8217;ann&#233;e. D&#233;couvrez tous les jours les vainqueurs de chaque cat&#233;gorie jusqu&#8217;&#224; la remise des prix le 10 d&#233;cembre, en live s&#8217;il vous plait !</description>
    </item>
    <item>
      <title>Billy Bob Thornton gave Landman season 3 away weeks ago: &#8216;I don&#8217;t know if there will be a moment this season where he finally snaps&#8217;</title>
      <link>https://www.techradar.com/streaming/paramount-plus/billy-bob-thornton-gave-landman-season-3-away-weeks-ago-i-dont-know-if-there-will-be-a-moment-this-season-where-he-finally-snaps</link>
      <pubDate>Mon, 08 Dec 2025 10:59:00 +0000</pubDate>
      <guid isPermaLink="false">ojmAtjCpX5MAXh3WXpNve5</guid>
      <description>Even Billy Bob Thornton &#8216;didn&#8217;t know&#8217; how Tommy&#8217;s season 2 would end &#8211; so Landman season 3 shouldn&#8217;t be a surprise.</description>
    </item>
    <item>
      <title>Cette petite console portable retrogaming ressemblant &#224; une GBA SP perd les deux tiers de son prix juste avant No&#235;l</title>
      <link>https://www.frandroid.com/bons-plans/2901577_cette-petite-console-portable-retrogaming-ressemblant-a-une-gba-sp-perd-les-deux-tiers-de-son-prix-juste-avant-noel</link>
      <pubDate>Mon, 08 Dec 2025 10:57:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2901577_cette-petite-console-portable-retrogaming-ressemblant-a-une-gba-sp-perd-les-deux-tiers-de-son-prix-juste-avant-noel</guid>
      <description>
Vous souhaitez d&#233;couvrir ou red&#233;couvrir des grands classiques sortis sur NES, Game Boy ou PlayStation 1 ? Vous pourrez totalement le faire sur la Miyoo Flip V2, une console retrogaming compacte qui permet de faire tourner des milliers de titres. La bonne nouvelle (qui tombe &#224; pic avant No&#235;l), c'est qu'AliExpress l'affiche &#224; 48,39 euros au lieu de 159,99 euros.
...</description>
    </item>
    <item>
      <title>Apple's AirPods Pro 3 are back to an all-time low price</title>
      <link>https://www.engadget.com/deals/apples-airpods-pro-3-are-back-to-an-all-time-low-price-222806220.html?src=rss</link>
      <pubDate>Mon, 08 Dec 2025 10:51:13 +0000</pubDate>
      <guid isPermaLink="false">42f7f263-d7c8-4a21-ad07-9121207a6244</guid>
      <description>If you haven't yet upgraded to Apple's AirPods Pro 3, you can pick up the company's latest model at a discount through a deal on Amazon right now. The AirPods Pro 3, which came out in September, are currently down from $249 to $220 &#8212; their Cyber Monday all-time low price. With the new AirPods Pro, Apple made some big improvements, including better battery life and sound quality, and introduced useful new features, such as Live Translation.


The AirPods Pro 3 are the best AirPods available today, with Apple's H2 chip, and earned a score of 90 out of 100 in Engadget's review this fall. Active n...</description>
    </item>
    <item>
      <title>Last chance to grab NordVPN at lowest price of 2025</title>
      <link>https://www.techradar.com/vpn/vpn-services/last-chance-to-grab-nordvpn-at-lowest-price-of-2025</link>
      <pubDate>Mon, 08 Dec 2025 10:45:19 +0000</pubDate>
      <guid isPermaLink="false">GehYP7iGjJ2BYGxrG4xqBH</guid>
      <description>It's the last day to pick up NordVPN for just $2.88 a month</description>
    </item>
    <item>
      <title>Quels sont les meilleurs appareils photos num&#233;riques hybrides en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-photo-et-video/1338125_selection-des-meilleurs-appareils-photos-hybrides</link>
      <pubDate>Mon, 08 Dec 2025 10:30:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-photo-et-video/1338125_selection-des-meilleurs-appareils-photos-hybrides</guid>
      <description>
Les appareils photo dits "hybrides" ont peu &#224; peu supplant&#233; les reflex sur le march&#233; des boitiers photo. Ils n&#233;cessitent un investissement financier important : autant bien choisir celui qui sera adapt&#233; &#224; vos besoins et ambitions. Nous avons test&#233;, s&#233;lectionn&#233; et rassembl&#233; pour vous les mod&#232;les les plus int&#233;ressants.
</description>
    </item>
    <item>
      <title>Disgruntled ChatGPT Users Think Ads Have Rolled Out. The Timing Couldn&#8217;t Be Worse</title>
      <link>https://gizmodo.com/disgruntled-chatgpt-users-think-ads-have-rolled-out-the-timing-couldnt-be-worse-2000696598</link>
      <pubDate>Mon, 08 Dec 2025 10:30:02 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000696598</guid>
      <description>Users think they see Target ads. Not "targeted ads." Ads for Target.</description>
    </item>
    <item>
      <title>Candylab rebranded its retro toy cars to reach  kids and &#8216;kidults&#8217;</title>
      <link>https://www.fastcompany.com/91452682/candylab-rebranded-its-retro-toy-cars-to-reach-kids-and-kidults</link>
      <pubDate>2025-12-08T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91452682/candylab-rebranded-its-retro-toy-cars-to-reach-kids-and-kidults</guid>
      <description>The new look includes three fresh logos inspired by vintage car fonts.
When Vlad Dr&#462;gu&#537;in founded his midcentury inspired toy car company, Candylab, in 2013, he had a Kickstarter page and a dream. His goal was to create wooden model cars inspired by hot rods and classic American car designs; toys that would be both durable enough for play and sleek enough for display. As it turns out, there&#8217;s a major growing market for that kind of thing&#8212;and Candylab just rebranded to capture it....</description>
    </item>
    <item>
      <title>The dramatic rise and spectacular fall of my ChatGPT investment portfolio</title>
      <link>https://www.fastcompany.com/91453602/chatgpt-investment-portfolio-dramatic-rise-fall</link>
      <pubDate>2025-12-08T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91453602/chatgpt-investment-portfolio-dramatic-rise-fall</guid>
      <description>Although October was a sea of green, November was nothing but blood red.
Three months ago, I fired up ChatGPT and asked it to design a highly aggressive, short-term investment portfolio, selecting five stocks that were most likely to make me fabulously wealthy in six month&#8217;s time.</description>
    </item>
    <item>
      <title>Marre des chutes de FPS ? Voici les cartes graphiques Nvidia RTX sign&#233;es ASUS id&#233;ales pour ARC Raiders et BF6 [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2900709_marre-des-chutes-de-fps-voici-les-cartes-graphiques-nvidia-asus-ideales-pour-arc-raiders-et-bf6</link>
      <pubDate>Mon, 08 Dec 2025 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2900709_marre-des-chutes-de-fps-voici-les-cartes-graphiques-nvidia-asus-ideales-pour-arc-raiders-et-bf6</guid>
      <description>
Fabricant embl&#233;matique de composants informatiques, ASUS dispose d&#8217;une gamme compl&#232;te de cartes graphiques embarquant les derni&#232;res puces Nvidia. Laquelle est faite pour vous, en fonction de votre budget et de vos besoins ?
</description>
    </item>
    <item>
      <title>+20% d&#232;s mi-d&#233;cembre ? Dell et Lenovo pr&#233;parent une hausse de prix brutale sur les PC</title>
      <link>https://www.frandroid.com/culture-tech/economie/2901509_20-des-mi-decembre-dell-et-lenovo-preparent-une-hausse-de-prix-brutale-sur-les-pc</link>
      <pubDate>Mon, 08 Dec 2025 10:24:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/economie/2901509_20-des-mi-decembre-dell-et-lenovo-preparent-une-hausse-de-prix-brutale-sur-les-pc</guid>
      <description>
La crise s'intensifie sur le march&#233; du PC. Apr&#232;s une hausse des prix de la RAM et du stockage, c'est maintenant au tour des PC d'&#234;tre touch&#233;s. Dell et Lenovo pourraient faire partie des premiers constructeurs &#224; augmenter leurs tarifs. 
</description>
    </item>
    <item>
      <title>Google Pixel&#160;: le retour de cette fonctionnalit&#233; va vous faire gagner un temps fou</title>
      <link>https://www.01net.com/actualites/google-pixel-retour-fonctionnalite-gagner-temps-fou.html</link>
      <pubDate>Mon, 08 Dec 2025 10:16:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314185</guid>
      <description>Une fonctionnalit&#233; tr&#232;s pratique fait son retour sur les Google Pixel r&#233;cents, apr&#232;s plusieurs disparitions &#233;tranges pendant sur les derni&#232;res versions b&#234;tas d&#8217;Android 16.</description>
    </item>
    <item>
      <title>Look out, the first teaser for Supergirl has arrived &#8211; and the DCU movie's actual trailer isn't far behind</title>
      <link>https://www.techradar.com/streaming/entertainment/look-out-the-first-teaser-for-supergirl-has-arrived-and-the-dcu-movies-actual-trailer-isnt-far-behind</link>
      <pubDate>Mon, 08 Dec 2025 10:10:43 +0000</pubDate>
      <guid isPermaLink="false">Rg4NJ7rgxXx52LcbwJfnc9</guid>
      <description>Supergirl's first teaser reveals when its full trailer will drop &#8211; and it could arrive on the same day as Avengers: Doomsday's trailer.</description>
    </item>
    <item>
      <title>Console sales surged over Black Friday, with PS5 taking the lion's share thanks to big discounts</title>
      <link>https://www.techradar.com/gaming/console-sales-surged-over-black-friday-with-ps5-taking-the-lions-share-thanks-to-big-discounts</link>
      <pubDate>Mon, 08 Dec 2025 10:10:10 +0000</pubDate>
      <guid isPermaLink="false">vFVASjzV66FUtaLje9uVaS</guid>
      <description>PS5 and Switch 2 prove immensely popular over Black Friday, with Xbox console sales trailing.</description>
    </item>
    <item>
      <title>Kick off the Holiday season with Battlefield 6&#8217;s next major update, adding a snow-covered Ice Lock variant of the Empire State map</title>
      <link>https://www.techradar.com/gaming/kick-off-the-holiday-season-with-battlefield-6s-next-major-update-adding-a-snow-covered-ice-lock-variant-of-the-empire-state-map</link>
      <pubDate>Mon, 08 Dec 2025 10:09:41 +0000</pubDate>
      <guid isPermaLink="false">M8GZ7XJzXKsNbSWP4hAD5C</guid>
      <description>Battlefield 6 Winter Offensive arrives December 9, adding new map conditions, and limited time modes. Here's what's being added.</description>
    </item>
    <item>
      <title>The 5 best Mint alternatives to replace the budgeting app that shut down</title>
      <link>https://www.engadget.com/apps/the-best-budgeting-apps-to-replace-mint-143047346.html?src=rss</link>
      <pubDate>Mon, 08 Dec 2025 10:01:27 +0000</pubDate>
      <guid isPermaLink="false">dd1282c3-99ed-4ddc-b8ab-c10c60d4e70c</guid>
      <description>It's been over one year since Intuit shut down the popular budgeting app Mint. I was a Mint user for many years; millions of other users like me enjoyed how easily Mint allowed us to track all accounts in one place and monitor credit scores. I also used it regularly to help me track spending, set goals like pay my mortgage down faster and with general money management.Ahead of Mint&#8217;s demise, I gave Credit Karma, Intuit&#8217;s other financial app, a try but found it to be a poor Mint alternative. So I set out to find a true replacement in another budgeting app. The following guide lays out my experi...</description>
    </item>
    <item>
      <title>Netflix Reportedly Greased the Skids for Its Warner Acquisition by Yukking It Up with Trump</title>
      <link>https://gizmodo.com/netflix-trump-2000696562</link>
      <pubDate>Mon, 08 Dec 2025 10:00:48 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000696562</guid>
      <description>How do you keep an antitrust-curious president from sinking your M&amp;E deal? This is reportedly how.</description>
    </item>
    <item>
      <title>The Longest Solar Eclipse for 100 Years Is Coming. Don&#8217;t Miss It</title>
      <link>https://www.wired.com/story/the-longest-solar-eclipse-for-100-years-is-coming-dont-miss-it/</link>
      <pubDate>Mon, 08 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">693038040b9a9057a4bf312a</guid>
      <description>NASA has announced when the longest total solar eclipse of the century will occur&#8212;and you won&#8217;t have to wait long. Here&#8217;s what you should know.</description>
    </item>
    <item>
      <title>My new employee is someone I fired at my last company</title>
      <link>https://www.fastcompany.com/91450408/work-questions-manager-fired-employee-emails-phone-calls</link>
      <pubDate>2025-12-08T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91450408/work-questions-manager-fired-employee-emails-phone-calls</guid>
      <description>And 2 other tricky workplace dilemmas.
Inc.com columnist Alison Green answers questions about workplace and management issues&#8212;everything from&#160;how to deal with a micromanaging boss&#160;to how to talk to someone on your team&#160;about body odor.</description>
    </item>
    <item>
      <title>Netflix kills casting from its mobile app to most TVs</title>
      <link>https://www.fastcompany.com/91454792/netflix-casting-mobile-app-tv</link>
      <pubDate>2025-12-08T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91454792/netflix-casting-mobile-app-tv</guid>
      <description>That&#8217;s bad news for travelers.
Netflix&#8217;s decision to quietly remove the ability to cast content from its mobile apps to smart TVs and streaming devices has caused a bit of an uproar on social media. The complaints are the usual ones you see when a company removes a feature. Some blame greed. Some are upset their method of end-running subscription sharing has been shut down. Some just jump on the opportunity to complain about Netflix....</description>
    </item>
    <item>
      <title>Mozilla is doing a delicate dance with AI</title>
      <link>https://www.fastcompany.com/91455128/mozilla-firefox-browser-ai</link>
      <pubDate>2025-12-08T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91455128/mozilla-firefox-browser-ai</guid>
      <description>Firefox&#8217;s parent firm doesn&#8217;t have to worry about losing its Google default-search royalties. But it does have other concerns.
Several weeks ago, Mozilla Firefox dodged a bullet aimed at its business model&#8212;a potential court-ordered cutoff of the Google search-default payments that constitute its primary course of income.&#160;But that escape from one feared outcome of the U.S. search-antitrust case against the web giant doesn&#8217;t change two other things: Firefox remains in an embattled position. That&#8217;s bad news for users. Without Firefox, web competition itself would be in a far more dire state. To a...</description>
    </item>
    <item>
      <title>On a vu les motos hydrog&#232;nes et hybrides de Honda, Yamaha, Suzuki et Kawasaki : le futur donne envie, mais questionne aussi</title>
      <link>https://www.frandroid.com/survoltes/moto/2901383_on-a-vu-les-motos-hydrogenes-et-hybrides-de-honda-yamaha-suzuki-et-kawasaki-le-futur-donne-envie-mais-questionne-aussi</link>
      <pubDate>Mon, 08 Dec 2025 09:53:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/moto/2901383_on-a-vu-les-motos-hydrogenes-et-hybrides-de-honda-yamaha-suzuki-et-kawasaki-le-futur-donne-envie-mais-questionne-aussi</guid>
      <description>
Et pourquoi pas des motos &#233;lectriques, hybrides ou m&#234;me&#8230; &#224; hydrog&#232;ne ? Les concepts des marques japonaises sont tous azimuts tourn&#233;s vers les &#233;nergies alternatives, levant le frein psychologique souvent constat&#233;. Revue des forces en pr&#233;sence au salon de Tokyo.
</description>
    </item>
    <item>
      <title>&#171;&#160;Une question de vie ou de mort&#160;&#187; : pourquoi Macron menace d&#233;sormais la Chine</title>
      <link>https://www.01net.com/actualites/une-question-de-vie-ou-de-mort-pourquoi-macron-menace-desormais-la-chine.html</link>
      <pubDate>Mon, 08 Dec 2025 09:52:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314163</guid>
      <description>De retour de P&#233;kin, Emmanuel Macron tape du poing sur la table. Il menace la Chine de droits de douane imminents pour sauver une industrie europ&#233;enne prise en &#233;tau.</description>
    </item>
    <item>
      <title>Plus d&#8217;appels, mais des SMS : cette panne Free Mobile touche des milliers d&#8217;abonn&#233;s</title>
      <link>https://www.frandroid.com/marques/free/2901671_plus-dappels-mais-des-sms-cette-panne-free-mobile-touche-des-milliers-dabonnes</link>
      <pubDate>Mon, 08 Dec 2025 09:51:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2901671_plus-dappels-mais-des-sms-cette-panne-free-mobile-touche-des-milliers-dabonnes</guid>
      <description>
Depuis plusieurs jours, de nombreux abonn&#233;s Free Mobile ne parviennent plus &#224; &#233;mettre ou recevoir des appels. Paradoxalement, les SMS continuent de fonctionner normalement. Face &#224; l&#8217;afflux de t&#233;moignages, l&#8217;op&#233;rateur a reconnu l'incident.
</description>
    </item>
    <item>
      <title>Nvidia fait moiti&#233; prix sur ses abonnements GeForce Now Performance et Ultime pour les f&#234;tes de fin d&#8217;ann&#233;e</title>
      <link>https://www.frandroid.com/marques/2624843_nvidia-fait-moitie-prix-sur-ses-abonnements-geforce-now-performance-et-ultime-pour-les-fetes-de-fin-dannee</link>
      <pubDate>Mon, 08 Dec 2025 09:49:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2624843_nvidia-fait-moitie-prix-sur-ses-abonnements-geforce-now-performance-et-ultime-pour-les-fetes-de-fin-dannee</guid>
      <description>
L'offre de Cloud gaming GeForce Now b&#233;n&#233;ficie des f&#234;tes de fin d'ann&#233;e pour afficher un prix mensuel in&#233;dit jusqu'&#224; maintenant. Que ce soit l'abonnement Performance pour jouer en 1440p ou l'Ultime pour de la 4K, ils sont &#224; -50 %. 
</description>
    </item>
    <item>
      <title>La fusion Netflix-Warner &#171;&#8201;pourrait poser des probl&#232;mes&#8201;&#187;, selon Donald Trump</title>
      <link>https://www.frandroid.com/services/svod/2901525_la-fusion-netflix-warner-pourrait-poser-des-problemes-selon-donald-trump</link>
      <pubDate>Mon, 08 Dec 2025 09:47:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2901525_la-fusion-netflix-warner-pourrait-poser-des-problemes-selon-donald-trump</guid>
      <description>
Une fusion &#224; 82&#160;milliards de dollars ne se fait jamais sans difficult&#233;. C&#8217;est la douloureuse r&#233;alit&#233; que s&#8217;est charg&#233; de rappeler le pr&#233;sident &#233;tasunien &#224; Netflix alors que le g&#233;ant du streaming tente de croquer Warner Bros.
</description>
    </item>
    <item>
      <title>Votre Google Pixel cachait une fonctionnalit&#233; secr&#232;te pour la Nintendo Switch 2</title>
      <link>https://www.frandroid.com/marques/google/2901425_votre-google-pixel-cachait-une-fonctionnalite-secrete-pour-la-nintendo-switch-2</link>
      <pubDate>Mon, 08 Dec 2025 09:45:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2901425_votre-google-pixel-cachait-une-fonctionnalite-secrete-pour-la-nintendo-switch-2</guid>
      <description>
Les smartphones Google Pixel sont maintenant compatibles avec la Nintendo Switch 2 qui peut les utiliser comme webcam via GameChat. 
</description>
    </item>
    <item>
      <title>Paramount aimerait piquer Warner Bros &#224; Netflix avec un rachat hostile</title>
      <link>https://www.frandroid.com/services/svod/2901597_paramount-aimerait-piquer-warner-bros-a-netflix-avec-un-rachat-hostile</link>
      <pubDate>Mon, 08 Dec 2025 09:44:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2901597_paramount-aimerait-piquer-warner-bros-a-netflix-avec-un-rachat-hostile</guid>
      <description>
Paramount n'a pas dig&#233;r&#233; l'accord de rachat entre Warner et Netflix. Le g&#233;ant de l'audiovisuel se verrait bien racheter Warner sans son consentement avec un rachat hostile.
</description>
    </item>
    <item>
      <title>Grande premi&#232;re pour Smart : 1 800 km d&#8217;autonomie avec la premi&#232;re berline de son histoire</title>
      <link>https://www.frandroid.com/marques/smart/2901535_grande-premiere-pour-smart-1-800-km-dautonomie-avec-la-premiere-berline-de-son-histoire</link>
      <pubDate>Mon, 08 Dec 2025 09:42:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/smart/2901535_grande-premiere-pour-smart-1-800-km-dautonomie-avec-la-premiere-berline-de-son-histoire</guid>
      <description>
Smart d&#233;voile les premi&#232;res images de sa nouvelle berline #6, qui a le droit &#224; une motorisation hybride rechargeable. Celle-ci offre une autonomie d&#233;passant les 1 800 kilom&#232;tres, dont 285 kilom&#232;tres en mode &#233;lectrique.
</description>
    </item>
    <item>
      <title>Pourquoi ce moteur r&#233;volutionnaire pourrait supprimer les freins des prochaines voitures &#233;lectriques de Mercedes</title>
      <link>https://www.frandroid.com/marques/mercedes-benz/2901493_pourquoi-ce-moteur-revolutionnaire-pourrait-supprimer-les-freins-des-prochaines-voitures-electriques-de-mercedes</link>
      <pubDate>Mon, 08 Dec 2025 09:37:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/mercedes-benz/2901493_pourquoi-ce-moteur-revolutionnaire-pourrait-supprimer-les-freins-des-prochaines-voitures-electriques-de-mercedes</guid>
      <description>
Mercedes vient de pr&#233;senter un moteur-roue, qui pourrait se retrouver dans ses prochaines voitures &#233;lectriques surpuissantes. Outre un immense gain de puissance, ses capacit&#233;s de r&#233;g&#233;n&#233;ration pourraient permettre de se passer compl&#232;tement de freins.
</description>
    </item>
    <item>
      <title>A new UK AI says it can beat ChatGPT &#8211; we tried it and here&#8217;s what we found</title>
      <link>https://www.techradar.com/ai-platforms-assistants/a-new-uk-ai-says-it-can-beat-chatgpt-we-tried-it-and-heres-what-we-found</link>
      <pubDate>Mon, 08 Dec 2025 09:34:31 +0000</pubDate>
      <guid isPermaLink="false">rLJQp5gqb6dvVAGokE8jEK</guid>
      <description>Locai Labs has launched the UK&#8217;s first homegrown AI assistant, claiming it outperforms GPT-5 and other global rivals in conversation, reasoning, and user preference.</description>
    </item>
    <item>
      <title>Down-ranking polarizing social media content can calm emotions, research shows</title>
      <link>https://www.fastcompany.com/91454767/down-ranking-polarizing-social-media-content-emotions-research</link>
      <pubDate>2025-12-08T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91454767/down-ranking-polarizing-social-media-content-emotions-research</guid>
      <description>The effects seen were similar across political affiliations, suggesting that the intervention benefits users regardless of their political party. 
Reducing the visibility of polarizing content in social media feeds can measurably lower partisan animosity. To come up with this finding, my colleagues and I developed a method that let us alter the ranking of people&#8217;s feeds, previously something only the social media companies could do....</description>
    </item>
    <item>
      <title>Meta reporte ses lunettes de r&#233;alit&#233; mixte pour &#171;&#160;peaufiner les d&#233;tails&#160;&#187;</title>
      <link>https://www.01net.com/actualites/meta-reporte-lunettes-realite-mixte-peaufiner-details.html</link>
      <pubDate>Mon, 08 Dec 2025 09:25:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314168</guid>
      <description>Meta revoit son calendrier de sortie. Pour limiter les d&#233;penses pr&#233;vues l'ann&#233;e prochaine, Meta a d&#233;cid&#233; de reporter la sortie de ses lunettes de r&#233;alit&#233; mixte taill&#233;es pour rivaliser avec le Vision Pro d'Apple. L'annonce donne plus de temps aux &#233;quipes du Reality Labs pour &#171; peaufiner les d&#233;tails&#160;&#187; du projet.</description>
    </item>
    <item>
      <title>The best Secret Santa gift ideas for 2025: Affordable gifts to give from Apple, Lego, Yeti and others</title>
      <link>https://www.engadget.com/the-best-secret-santa-gift-ideas-for-2025-affordable-gifts-to-give-from-apple-lego-yeti-and-others-130014197.html?src=rss</link>
      <pubDate>Mon, 08 Dec 2025 09:25:01 +0000</pubDate>
      <guid isPermaLink="false">d3419426-0b76-49ed-9322-bfc6839435ec</guid>
      <description>Secret Santa gift exchanges are supposed to be fun, but it&#8217;s easy to overthink it. You want a gift that feels thoughtful without being awkward, useful without being boring, and most importantly, affordable. The sweet spot is under $50, which is plenty to find something that fits your recipient&#8217;s personality. Whether you&#8217;re buying for a co-worker you only chat with at the coffee machine, a friend who already has everything or a cousin who never gives you ideas, there are clever options that will make them smile. These picks prove you don&#8217;t need to spend big to win at Secret Santa.
Best Secret S...</description>
    </item>
  </channel>
</rss>
