<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 15 Dec 2025 15:29:33 GMT</lastBuildDate>
    <item>
      <title>Forfaits B&amp;YOU : voici les offres mobile et internet de la filiale low cost de Bouygues Telecom</title>
      <link>https://www.frandroid.com/marques/bouygues-telecom/703983_avis-byou-que-valent-les-offres-et-le-reseau-bouygues-telecom</link>
      <pubDate>Mon, 15 Dec 2025 15:24:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bouygues-telecom/703983_avis-byou-que-valent-les-offres-et-le-reseau-bouygues-telecom</guid>
      <description>
B&amp;YOU repr&#233;sente la marque low cost et sans engagement de Bouygues T&#233;l&#233;com. &#192; l'instar de Sosh et de RED by SFR, on y trouve des forfaits mobiles ainsi qu'une offre internet unique, et cette derni&#232;re surclasse ais&#233;ment la concurrence. Mais globalement, voyons voir ce que vaut B&amp;YOU en 2025.
</description>
    </item>
    <item>
      <title>New Stranger Things trailer hints at what's next for our heroes</title>
      <link>https://www.engadget.com/entertainment/tv-movies/new-stranger-things-trailer-hints-at-whats-next-for-our-heroes-152327474.html?src=rss</link>
      <pubDate>Mon, 15 Dec 2025 15:23:27 +0000</pubDate>
      <guid isPermaLink="false">800400b7-0764-43d0-ac59-8aaf6d3d6259</guid>
      <description>Warning: the following contains spoilers for part one of Stranger Things season fiveWith just over a week to go until Netflix releases the next batch of Stranger Things episodes, the company has dropped a trailer for the second part of season five. The clip begins in the aftermath of the action-packed ending to the first bunch of episodes, with bodies and blazes surrounding Will as he says in a voiceover, "We failed. We never stood a chance." However, his mother Joyce tells him that, "This is not over. Not by a long shot."&#160;We learn in this trailer that some of the gang who were still in the Up...</description>
    </item>
    <item>
      <title>La Volkswagen Polo &#233;lectrique se d&#233;voile un peu plus : un coffre XXL et des autonomies sup&#233;rieures &#224; la R5</title>
      <link>https://www.frandroid.com/marques/volkswagen/2910301_la-volkswagen-polo-electrique-se-devoile-un-peu-plus-un-coffre-xxl-et-des-autonomies-superieures-a-la-r5</link>
      <pubDate>Mon, 15 Dec 2025 15:20:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2910301_la-volkswagen-polo-electrique-se-devoile-un-peu-plus-un-coffre-xxl-et-des-autonomies-superieures-a-la-r5</guid>
      <description>
Face &#224; la concurrence, notamment fran&#231;aise, sur le march&#233; des voitures &#233;lectriques abordables, Volkswagen contre-attaque avec l'ID. Polo, un mod&#232;le annonc&#233; &#224; moins de 25 000 euros. Cette nouvelle venue peut-elle inqui&#233;ter les Renault 5 E-Tech et autres Peugeot e-208 ?
</description>
    </item>
    <item>
      <title>Tesla starts testing robotaxis in Austin with no safety driver</title>
      <link>https://techcrunch.com/2025/12/15/tesla-starts-testing-robotaxis-in-austin-with-no-safety-driver/</link>
      <pubDate>Mon, 15 Dec 2025 15:16:26 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3075859</guid>
      <description>It's one of the last big steps before the company can truly claim it's operating a robotaxi service, and start to take on Waymo.</description>
    </item>
    <item>
      <title>Microsoft will expand bug bounties - even on programs without official payouts</title>
      <link>https://www.techradar.com/pro/security/microsoft-will-expand-bug-bounties-even-on-programs-without-official-payouts</link>
      <pubDate>Mon, 15 Dec 2025 15:15:00 +0000</pubDate>
      <guid isPermaLink="false">hWwdJ5SP6QtPbJjXXgHagM</guid>
      <description>Any dodgy code affecting Microsoft's products and services will now be covered under the 'In Scope by Default' bug bounty program.</description>
    </item>
    <item>
      <title>Snapchat rolls out its end-of-year Recaps</title>
      <link>https://techcrunch.com/2025/12/15/snapchat-rolls-out-its-end-of-year-recaps/</link>
      <pubDate>Mon, 15 Dec 2025 15:13:49 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3075869</guid>
      <description>The Recap is a short video that offers a personalized look at highlights from Snaps, Stories, and Chats, showing how users connected and expressed themselves throughout the year.</description>
    </item>
    <item>
      <title>Your email app isn't the weak link but your cloud configuration probably is</title>
      <link>https://www.techradar.com/pro/your-email-app-isnt-the-weak-link-but-your-cloud-configuration-probably-is</link>
      <pubDate>Mon, 15 Dec 2025 15:09:34 +0000</pubDate>
      <guid isPermaLink="false">bh6Uk2fd2RcDwm7A69nXTE</guid>
      <description>If you&#8217;re blaming email for breaches, you&#8217;re missing the misconfigurations attackers actually exploit.</description>
    </item>
    <item>
      <title>Comment quitter un groupe WhatsApp sans se faire remarquer</title>
      <link>https://www.frandroid.com/marques/meta/2910007_comment-quitter-un-groupe-whatsapp-sans-se-faire-remarquer</link>
      <pubDate>Mon, 15 Dec 2025 15:08:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2910007_comment-quitter-un-groupe-whatsapp-sans-se-faire-remarquer</guid>
      <description>
Meta fait &#233;voluer la gestion des groupes sur WhatsApp. La messagerie instantan&#233;e permettra aux membres de quitter un groupe sans en informer la totalit&#233; des membres. 
</description>
    </item>
    <item>
      <title>Spotify has stopped working for thousands of users</title>
      <link>https://www.engadget.com/entertainment/music/spotify-has-stopped-working-for-thousands-of-users-150453887.html?src=rss</link>
      <pubDate>Mon, 15 Dec 2025 15:04:53 +0000</pubDate>
      <guid isPermaLink="false">e8b7b749-0f07-4ffc-8e2e-1ec997298406</guid>
      <description>My boyfriend texted me those dreaded four words: "Is your Spotify down?" Sure enough his, mine and thousands of other users' Spotify accounts appear to be down and out at the moment, with Downdetector recording over 10,000 reports from users.&#160;
Spotify is apparently working on the problem. The account, Spotify Status, shared an update on X at 9:45 AM on Monday, "We&#8217;re aware of some issues right now and are checking them out!"&#160;
We're aware of some issues right now and are checking them out!&#8212; Spotify Status (@SpotifyStatus) December 15, 2025 
This is a developing story...This article originally a...</description>
    </item>
    <item>
      <title>La p&#233;nurie de m&#233;moire RAM pourrait durer bien plus longtemps que pr&#233;vu selon ce fabricant</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-fixes/2910357_la-penurie-de-memoire-ram-pourrait-durer-bien-plus-longtemps-que-prevu-selon-ce-fabricant</link>
      <pubDate>Mon, 15 Dec 2025 15:04:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-fixes/2910357_la-penurie-de-memoire-ram-pourrait-durer-bien-plus-longtemps-que-prevu-selon-ce-fabricant</guid>
      <description>
Alors que les consommateurs  font face &#224; une flamb&#233;e du prix des barrettes de m&#233;moire RAM, l'un des principaux fabricants pr&#233;voit que la p&#233;nurie va tra&#238;ner en longueur.
</description>
    </item>
    <item>
      <title>Smartphones Xiaomi&#160;: c&#8217;est quoi ce nouveau mode r&#233;paration dans HyperOS 3&#160;?</title>
      <link>https://www.01net.com/actualites/smartphones-xiaomi-cest-quoi-ce-nouveau-mode-reparation-dans-hyperos-3.html</link>
      <pubDate>Mon, 15 Dec 2025 15:01:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315356</guid>
      <description>Le syst&#232;me d&#8217;exploitation HyperOS 3 introduit sur les smartphones Xiaomi un &#171;&#160;mode r&#233;paration&#160;&#187; qui promet de prot&#233;ger vos donn&#233;es lorsque votre t&#233;l&#233;phone doit &#234;tre manipul&#233; par un professionnel.</description>
    </item>
    <item>
      <title>Blink and you'll miss it - the Galaxy S25 Ultra has just hit a new record-low price ahead of Christmas</title>
      <link>https://www.techradar.com/phones/samsung-galaxy-phones/blink-and-youll-miss-it-the-galaxy-s25-ultra-has-just-hit-a-new-record-low-price-ahead-of-christmas</link>
      <pubDate>Mon, 15 Dec 2025 15:01:03 +0000</pubDate>
      <guid isPermaLink="false">C84xTTHYgqoSD6mopoKkDQ</guid>
      <description>The stunning Galaxy S25 Ultra is currently listed for its lowest ever price at Amazon - a real Christmas treat.</description>
    </item>
    <item>
      <title>How the New &#8216;Tomb Raider&#8217; Games Want to Unite Lara&#8217;s Past and Future</title>
      <link>https://gizmodo.com/tomb-raider-catalyst-interview-legacy-of-atlantis-redesign-2000698426</link>
      <pubDate>Mon, 15 Dec 2025 15:00:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000698426</guid>
      <description>What's next for Lara Croft? Not just a new show, but also a pair of 'Tomb Raider' games that look back and forward on the franchise.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Tuesday, December 16 (game #1422)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-16-december-2025</link>
      <pubDate>Mon, 15 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">FRpd5vpNVqyLTXYB2w6izN</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Tuesday, December 16 (game #919)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-16-december-2025</link>
      <pubDate>Mon, 15 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">QNJuucqnTWEmNfKuadZdgK</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Tuesday, December 16 (game #653)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-16-december-2025</link>
      <pubDate>Mon, 15 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">Rfjjx9qjEuciCm5hTKoBNM</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Google smashes language barriers with live translation for any earbuds on Android &#8212; here&#8217;s how it works</title>
      <link>https://www.techradar.com/computing/software/google-smashes-language-barriers-with-live-translation-for-any-earbuds-on-android-heres-how-it-works</link>
      <pubDate>Mon, 15 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">A29HM9fhHzYpuGW5X9ZXhe</guid>
      <description>You no longer have to use Pixel Buds to take advantage of live translations in Google Translate - now all earbuds are compatible.</description>
    </item>
    <item>
      <title>Tokenization takes the lead in the fight for data security</title>
      <link>https://venturebeat.com/ai/tokenization-takes-the-lead-in-the-fight-for-data-security</link>
      <pubDate>Mon, 15 Dec 2025 15:00:00 GMT</pubDate>
      <guid isPermaLink="false">1jo0kcmZEmP6UqPNQwitYj</guid>
      <description>Presented by Capital One SoftwareTokenization is emerging as a cornerstone of modern data security, helping businesses separate the value of their data from its risk. During this VB in Conversation, Ravi Raghu, president, Capital One Software, talks about the ways tokenization can help reduce the value of breached data and preserve underlying data format and usability, including Capital One&#8217;s own experience leveraging tokenization at scale. Tokenization, Raghu asserts, is a far superior technology. It converts sensitive data into a nonsensitive digital replacement, called a token, that maps ba...</description>
    </item>
    <item>
      <title>On a fr&#244;l&#233; la catastrophe : une collision monumentale entre un satellite chinois et Starlink a &#233;t&#233; esquiv&#233;e de justesse !</title>
      <link>https://www.futura-sciences.com/sciences/actualites/espace-on-frole-catastrophe-collision-monumentale-satellite-chinois-starlink-ete-esquivee-justesse-128620/#xtor%3DRSS-8</link>
      <pubDate>Mon, 15 Dec 2025 15:59:51 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/espace-on-frole-catastrophe-collision-monumentale-satellite-chinois-starlink-ete-esquivee-justesse-128620/#xtor%3DRSS-8</guid>
      <description>Deux satellites ont failli entrer en collision &#224; 560 kilom&#232;tres au-dessus de nos t&#234;tes. L'accident, &#233;vit&#233; de justesse, aurait &#233;t&#233; provoqu&#233; par un simple manque de communication entre les diff&#233;rents responsables.</description>
    </item>
    <item>
      <title>La mythique Smart Fortwo &#233;lectrique est de retour : voici tout ce qu&#8217;on sait sur la future Smart #2</title>
      <link>https://www.frandroid.com/marques/smart/2910429_la-mythique-smart-fortwo-electrique-est-de-retour-voici-tout-ce-quon-sait-sur-la-future-smart-2</link>
      <pubDate>Mon, 15 Dec 2025 14:54:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/smart/2910429_la-mythique-smart-fortwo-electrique-est-de-retour-voici-tout-ce-quon-sait-sur-la-future-smart-2</guid>
      <description>
Apr&#232;s des ann&#233;es d'absence dans le segment des mini-citadines, Smart s'appr&#234;te &#224; raviver la flamme de son mod&#232;le le plus embl&#233;matique. La future #2, h&#233;riti&#232;re directe de la mythique Fortwo, a &#233;t&#233; annonc&#233;e. Mais depuis la fin de la Fortwo que nous connaissions, les choses ont bien chang&#233; chez Smart.
</description>
    </item>
    <item>
      <title>I tested a 5K monitor that&#8217;s over $1,000 less than Apple&#8217;s Studio Display: It&#8217;s good enough</title>
      <link>https://www.theverge.com/gadgets/842650/5k-monitor-ktc-h27p3-mac-os-review</link>
      <pubDate>2025-12-15T09:54:32-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=842650</guid>
      <description>Most people know at least two things about 5K monitors: they look great, and they're usually expensive. The Apple Studio Display is the most popular model, and it costs $1,599. But I've been testing one that's similar in some important ways and costs just $355 (!?) at its cheapest-ever price. Unsurprisingly, at a fraction of [&#8230;]</description>
    </item>
    <item>
      <title>Boulanger retire 100 &#8364; sur ce pack Xiaomi Redmi Note 14 Pro 5G + enceinte Bluetooth pour No&#235;l</title>
      <link>https://www.frandroid.com/bons-plans/2910307_boulanger-retire-100-e-sur-ce-pack-xiaomi-redmi-note-14-pro-5g-enceinte-bluetooth-pour-noel</link>
      <pubDate>Mon, 15 Dec 2025 14:52:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2910307_boulanger-retire-100-e-sur-ce-pack-xiaomi-redmi-note-14-pro-5g-enceinte-bluetooth-pour-noel</guid>
      <description>
Avec No&#235;l qui approche, Boulanger n'h&#233;site pas &#224; proposer des produits Tech populaires dans des packs &#224; prix cass&#233;s. C'est le cas par exemple du Xiaomi Redmi Note 14 Pro 5G (256 Go) propos&#233; avec une enceinte Bluetooth, pour 299 euros contre 399 euros habituellement.&#160;
</description>
    </item>
    <item>
      <title>Worried about internet connectivity during your holiday? Have your data secured with Ubigi eSIM</title>
      <link>https://www.techradar.com/pro/worried-about-internet-connectivity-during-your-holiday-have-your-data-secured-with-ubigi-esim</link>
      <pubDate>Mon, 15 Dec 2025 14:52:03 +0000</pubDate>
      <guid isPermaLink="false">8jbrZZa6iVuffBfskzyoYi</guid>
      <description>Global coverage, fast 5G speeds, and flexible data plans for travelers and remote workers.</description>
    </item>
    <item>
      <title>First Voyage raises $2.5M for its AI companion helps you build habits</title>
      <link>https://techcrunch.com/2025/12/15/first-voyage-raises-2-5m-for-its-ai-companion-helps-you-build-habits/</link>
      <pubDate>Mon, 15 Dec 2025 14:48:24 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3075846</guid>
      <description>First Voyage has raised $2.5 million in a seed funding round from a16z speed run, SignalFire, True Global, and other investors.</description>
    </item>
    <item>
      <title>New users can get half off one of our favorite budgeting apps right now</title>
      <link>https://www.engadget.com/deals/new-users-can-get-half-off-one-of-our-favorite-budgeting-apps-right-now-154056942.html?src=rss</link>
      <pubDate>Mon, 15 Dec 2025 14:46:26 +0000</pubDate>
      <guid isPermaLink="false">f9cd69a7-2172-4476-a391-04d87e530174</guid>
      <description>If you have a resolution in the new year to get more acquainted with your finances, a good budgeting app can help with that. One of our favorites is a bit cheaper to sign up for right now: Monarch Money is offering 50 percent off annual subscriptions for new users. Use the code MONARCHVIP at checkout to get half off, so you'll pay just $50 for one year of access.


Monarch Money was the runner-up in our guide to the best budgeting apps in 2025, and it was definitely a grower. Initially we found the experience of using the app to be needlessly complicated compared to some of its rivals, but get...</description>
    </item>
    <item>
      <title>The Meta Quest 3S is back down to its Cyber Monday all-time low of $250</title>
      <link>https://www.engadget.com/deals/the-meta-quest-3s-is-back-down-to-its-cyber-monday-all-time-low-of-250-144027382.html?src=rss</link>
      <pubDate>Mon, 15 Dec 2025 14:40:27 +0000</pubDate>
      <guid isPermaLink="false">27c788e3-f659-49ae-9ae9-78cf27b6c2d8</guid>
      <description>The Meta Quest 3S is back on sale at its all-time low price of $250. That's $50 off, or a discount of 17 percent, and matches a deal we saw on Cyber Monday.
The 3S is the more affordable model in the company's current VR headset lineup. It features the same Snapdragon XR2 processor as the more expensive Meta Quest 3, but with lower resolution per eye and a slightly narrower field of view. 


In our hands-on review, we gave the Meta Quest 3S a score of 90, noting how impressive the tech was compared to its price. The headset was comfortable to wear during longer gaming periods, and the performa...</description>
    </item>
    <item>
      <title>&#171;&#160;L&#8217;OLED consomme moins&#160;&#187; : le gros mensonge qu&#8217;on vous sert depuis 10 ans sur les PC portables</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2910499_loled-consomme-moins-le-gros-mensonge-quon-vous-sert-depuis-10-ans-sur-les-pc-portables</link>
      <pubDate>Mon, 15 Dec 2025 14:32:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2910499_loled-consomme-moins-le-gros-mensonge-quon-vous-sert-depuis-10-ans-sur-les-pc-portables</guid>
      <description>
Vous h&#233;sitez entre le mod&#232;le IPS "classique" et la version OLED "premium" de votre futur Dell, Asus ou Lenovo ? La r&#233;ponse semble &#233;vidente. Et pourtant. Si vous tenez &#224; votre autonomie, vous allez &#234;tre surpris. La diff&#233;rence ne se compte pas en minutes, mais en heures. Et pas dans le sens que vous croyez.
</description>
    </item>
    <item>
      <title>Nvidia reportedly weighs ramping up H200 production to meet surging demand in China</title>
      <link>https://techcrunch.com/2025/12/15/nvidia-is-reportedly-weighs-ramping-up-h200-production-to-meet-surging-demand-in-china/</link>
      <pubDate>Mon, 15 Dec 2025 14:28:20 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3075844</guid>
      <description>After successfully lobbying the Trump administration to approve the sales of its H200 chips to China, Nvidia is now thinking of adding capacity to produce more of the chips.</description>
    </item>
    <item>
      <title>Spotify is down &#8211;here's what we know about the outage so far</title>
      <link>https://www.techradar.com/news/live/spotify-down-december-2025</link>
      <pubDate>Mon, 15 Dec 2025 14:25:06 +0000</pubDate>
      <guid isPermaLink="false">rC4KSQEG3JKAZHo69vpFtg</guid>
      <description>Is Spotify down for you? You're not alone &#8211;many users are reporting problems with the app today.</description>
    </item>
    <item>
      <title>Samsung's P9 microSD Express card for Switch 2 is 40 percent off right now</title>
      <link>https://www.engadget.com/deals/samsungs-p9-microsd-express-card-for-switch-2-is-40-percent-off-right-now-141947128.html?src=rss</link>
      <pubDate>Mon, 15 Dec 2025 14:19:48 +0000</pubDate>
      <guid isPermaLink="false">50325636-eafa-42d9-b1ab-c62966fc036d</guid>
      <description>It was a big day in gaming history when Nintendo finally released its Switch sequel. But the Nintendo Switch 2 lacked many options for microSD Express cards. Samsung helped change that this fall, with the release of its P9 Express series of microSD Express cards, and now one of them is on sale.
Currently, you can pick up the 256GB Samsung P9 Express microSD Express Card for $33, down from $55. The 40 percent discount brings the microSD down to a new all-time low price. That means your new Nintendo Switch 2 gets a lot more memory with transfer speeds reaching 800MB/s. The specs are on par with ...</description>
    </item>
    <item>
      <title>How Trump&#8217;s tariffs are impacting prices and purchases this holiday shopping season</title>
      <link>https://www.fastcompany.com/91460393/how-trumps-tariffs-impacting-prices-purchases-holiday-shopping-season</link>
      <pubDate>2025-12-15T14:18:23</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91460393/how-trumps-tariffs-impacting-prices-purchases-holiday-shopping-season</guid>
      <description>From games to electronics to jewelry, Trump&#8217;s sweeping tariffs are having an uneven impact. 
The Ah Louis Store in San Luis Obispo, California, turns into a winter wonderland every holiday season.Green garlands, giant nutcrackers, baubles and bows go up in early November on the historic downtown building that houses the gift shop. Inside, customers can choose from over 500 different types of ornaments and a variety of holiday gift baskets.&#8220;We really just make it a magical spot,&#8221; co-owner Emily Butler said. &#8220;Whether you come in or not, we want to make sure that we&#8217;re spreading that holiday joy....</description>
    </item>
    <item>
      <title>&#171; Courir nu sur le Golden Gate &#187; : le patron de Xpeng veut rattraper Tesla et fait un &#233;tonnant pari avec ses &#233;quipes</title>
      <link>https://www.frandroid.com/marques/xpeng/2910009_courir-nu-sur-le-golden-gate-le-patron-de-xpeng-veut-rattraper-tesla-et-fait-un-etonnant-pari-avec-ses-equipes</link>
      <pubDate>Mon, 15 Dec 2025 14:11:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2910009_courir-nu-sur-le-golden-gate-le-patron-de-xpeng-veut-rattraper-tesla-et-fait-un-etonnant-pari-avec-ses-equipes</guid>
      <description>
He Xiaopeng, PDG et fondateur de Xpeng, est reparti essayer le syst&#232;me de conduite autonome de Tesla (le fameux FSD) aux &#201;tats-Unis. De quoi constater les progr&#232;s en un an, et de motiver ses &#233;quipes pour d&#233;velopper un syst&#232;me performant.
</description>
    </item>
    <item>
      <title>Amazons $9.99 Fire TV Stick 4K Select deal is back &#8212; make the most of this wild coupon code</title>
      <link>https://mashable.com/article/dec-15-amazon-fire-tv-stick-4k-select-deal</link>
      <pubDate>Mon, 15 Dec 2025 14:07:54 +0000</pubDate>
      <guid isPermaLink="false">06p0RG5ElErKXvvCLZlsAID</guid>
      <description>The Amazon Fire TV Stick 4K Select is back down to its $9.99 Black Friday price with a coupon code. Grab it before the deal disappears.</description>
    </item>
    <item>
      <title>Home Depot reportedly left internal systems at risk for over a year</title>
      <link>https://www.techradar.com/pro/security/home-depot-reportedly-left-internal-systems-at-risk-for-over-a-year</link>
      <pubDate>Mon, 15 Dec 2025 14:05:00 +0000</pubDate>
      <guid isPermaLink="false">arfqdNN6vpnc2MoNVEWcdV</guid>
      <description>Security researcher finds Home Depot GitHub token left behind by mistake for more than a year.</description>
    </item>
    <item>
      <title>Rob Reiner, famed director of &#8216;When Harry Met Sally,&#8217; is dead at 78</title>
      <link>https://www.fastcompany.com/91460444/rob-reiner-filmmaker-american-classics-dies-78</link>
      <pubDate>2025-12-15T14:01:28</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91460444/rob-reiner-filmmaker-american-classics-dies-78</guid>
      <description>Authorities are investigating an &#8216;apparent homicide,&#8217; after Reiner and his wife, Michele Singer, were found dead at their home in Los Angeles. 
Rob Reiner, the son of a comedy giant who became one himself as one of the preeminent filmmakers of his generation with movies such as &#8220;The Princess Bride,&#8221; &#8220;When Harry Met Sally &#8230;&#8221; and &#8220;This Is Spinal Tap,&#8221; has died. He was 78.Reiner and his wife, Michele Singer, were found dead Sunday at their home in the Brentwood neighborhood of Los Angeles. A law enforcement official briefed on the investigation confirmed their identities but could not publicly di...</description>
    </item>
    <item>
      <title>Snapchat Recap 2025: Here&#8217;s how and when to see your memories and &#8216;year-end&#8217; story</title>
      <link>https://www.fastcompany.com/91460430/snapchat-recap-2025-wrapped-style-memories-how-to-see-year-end-story</link>
      <pubDate>2025-12-15T14:01:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91460430/snapchat-recap-2025-wrapped-style-memories-how-to-see-year-end-story</guid>
      <description>Now that Spotify Wrapped has stopped dominating headlines, Snapchat users will get their chance to relive the past 12 months.
Platforms from Amazon to YouTube&#8212;and, of course, the headline-dominating Spotify Wrapped&#8212;have spent much of December rolling out year-end recaps that show users how they engaged with the platforms&#8217; services throughout 2025. </description>
    </item>
    <item>
      <title>The First Trailer for &#8216;Stranger Things 5&#8217; Part 2 Wants to Flip the Upside Down&#8230; Upside Down</title>
      <link>https://gizmodo.com/stranger-things-season-5-volume-2-trailer-upside-down-vecna-2000699679</link>
      <pubDate>Mon, 15 Dec 2025 14:00:30 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000699679</guid>
      <description>Netflix has given us our first proper look at the climactic episodes of 'Stranger Things', teasing plenty of mystery and death.</description>
    </item>
    <item>
      <title>Nvidia Becomes a Major Model Maker With Nemotron 3</title>
      <link>https://www.wired.com/story/nvidia-becomes-major-model-maker-nemotron-3/</link>
      <pubDate>Mon, 15 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">693c57b0e61ec37a59554be3</guid>
      <description>The world&#8217;s top chipmaker wants open source AI to succeed&#8212;perhaps because closed models increasingly run on its rivals&#8217; silicon.</description>
    </item>
    <item>
      <title>Musicians are getting really tired of this AI clone &#8216;bullshit&#8217;</title>
      <link>https://www.theverge.com/report/844454/musicians-tired-of-ai-clones</link>
      <pubDate>2025-12-15T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=844454</guid>
      <description>"Not ideal." "Completely unacceptable." "Shameless." "Predatory." "Some bullshit." "Total bullshit." This is how musicians, producers, and others in the industry are describing the relentless spread of AI clones. Of course, AI fakes aren't new, but as the scammers have gotten more brazen, artists are responding with increasing furor. We got a taste back in 2023 [&#8230;]...</description>
    </item>
    <item>
      <title>What is the release date for Fallout season 2 episode 1 on Prime Video?</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/what-is-the-release-date-for-fallout-season-2-episode-1-on-prime-video</link>
      <pubDate>Mon, 15 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">FjyYzdgjz4JUyL4piTvvJ</guid>
      <description>The first episode of Fallout season 2 will be out shortly &#8211; find out when you can watch it where you live.</description>
    </item>
    <item>
      <title>Starlink fr&#244;le la catastrophe : une collision &#233;vit&#233;e avec un satellite chinois</title>
      <link>https://www.frandroid.com/telecom/2910393_starlink-frole-la-catastrophe-une-collision-evitee-avec-un-satellite-chinois</link>
      <pubDate>Mon, 15 Dec 2025 13:57:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2910393_starlink-frole-la-catastrophe-une-collision-evitee-avec-un-satellite-chinois</guid>
      <description>
La situation devient intenable l&#224;-haut. La semaine derni&#232;re, un satellite Starlink et un satellite chinois se sont crois&#233;s &#224; 200 m&#232;tres de distance. Une paille dans l'espace. Le probl&#232;me ? SpaceX affirme n'avoir re&#231;u aucune donn&#233;e de position. C'est un miracle qu'il n'y ait pas eu d'impact.
</description>
    </item>
    <item>
      <title>Ces lunettes AR taill&#233;es pour le streaming et le gaming nomade sont brad&#233;es &#224; moins de 200 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2910041_ces-lunettes-ar-taillees-pour-le-streaming-et-le-gaming-nomade-sont-bradees-a-moins-de-200-e</link>
      <pubDate>Mon, 15 Dec 2025 13:47:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2910041_ces-lunettes-ar-taillees-pour-le-streaming-et-le-gaming-nomade-sont-bradees-a-moins-de-200-e</guid>
      <description>
Les RayNeo Air 3s sont des lunettes &#224; r&#233;alit&#233; augment&#233;e capables de d&#233;ployer un immense &#233;cran virtuel de 201 pouces en Full HD &#224; 120 Hz. Cette paire est nettement plus int&#233;ressante maintenant qu'elle passe de 299 euros &#224; 199 euros. 
</description>
    </item>
    <item>
      <title>Resident Evil Requiem's Leon will make zombies cower 'with adrenaline-pumping action' while 'scaredy-cat' Grace will fight for survival</title>
      <link>https://www.techradar.com/gaming/resident-evil-requiems-leon-will-make-zombies-cower-with-adrenaline-pumping-action-while-scaredy-cat-grace-will-fight-for-survival</link>
      <pubDate>Mon, 15 Dec 2025 13:45:36 +0000</pubDate>
      <guid isPermaLink="false">gdvzyJymv6KXwJJcRGawpg</guid>
      <description>Capcom is doing exactly what I hoped for with Resident Evil Requiem, and it may lead to the best title in the franchise.</description>
    </item>
    <item>
      <title>The Samsung Galaxy Z Trifold could be the perfect mobile movie machine &#8211; and I can&#8217;t wait to try it out</title>
      <link>https://www.techradar.com/phones/samsung-galaxy-phones/the-samsung-galaxy-z-trifold-could-be-the-perfect-mobile-movie-machine-and-i-cant-wait-to-try-it-out</link>
      <pubDate>Mon, 15 Dec 2025 13:31:40 +0000</pubDate>
      <guid isPermaLink="false">k8p2DeEeBFvsTSZnX62Lqj</guid>
      <description>The Samsung Galaxy Z Trifold could become the device of choice for watching movies on the go, with a larger screen than any tablet-style folding phone before it</description>
    </item>
  </channel>
</rss>
