<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 11 Feb 2026 11:02:44 GMT</lastBuildDate>
    <item>
      <title>The four-star Fitbit Inspire 3 will kickstart your exercise goals &#8212; and it's down to a fantastic low price right now</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/the-four-star-fitbit-inspire-3-will-kickstart-your-exercise-goals-and-its-down-to-a-fantastic-low-price-right-now</link>
      <pubDate>Wed, 11 Feb 2026 11:00:43 +0000</pubDate>
      <guid isPermaLink="false">22SsETgpLfgp36oHxhuTiK</guid>
      <description>The Fitbit Inspire 3 is one of the best budget fitness trackers around. It's on sale now at Amazon for an excellent price.</description>
    </item>
    <item>
      <title>&#8216;Shut up and focus on the mission&#8217;: Tech workers are frustrated by their companies&#8217; silence about ICE</title>
      <link>https://www.theverge.com/ai-artificial-intelligence/876558/tech-workers-ice-resistance-google-microsoft-clear-abbott</link>
      <pubDate>2026-02-11T06:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=876558</guid>
      <description>Keep your head down. Compartmentalize. Don't make trouble. That's what many tech workers are taking their CEOs' strategic silence to mean, amid an immigration crackdown across the US by the Trump administration's Department of Homeland Security. Widespread violence by federal agents has sparked protests in Minneapolis and across the country. One month after an ICE [&#8230;]...</description>
    </item>
    <item>
      <title>Vie num&#233;rique | R&#233;veillez l&#8217;athl&#232;te olympique qui sommeille en vous</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-02-11/vie-numerique/reveillez-l-athlete-olympique-qui-sommeille-en-vous.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 11 Feb 2026 06:00:00 -0500</pubDate>
      <guid isPermaLink="false">26092a316bb43ee5b3a627b24be50611</guid>
      <description>Plusieurs athl&#232;tes olympiques ont d&#233;j&#224; affirm&#233; qu&#8217;ils ne pouvaient se passer de leurs accessoires connect&#233;s. Personne n&#8217;ira jusqu&#8217;&#224; attribuer une pr&#233;sence sur le podium &#224; ces accessoires qui se portent au poignet, au visage ou ailleurs, mais la plupart semblent s&#8217;entendre pour leur accorder une utilit&#233; pour suivre leur &#233;tat de sant&#233; au quotidien. Est-ce suffisant pour l&#8217;athl&#232;te olympique qui sommeille en vous&#160;?...</description>
    </item>
    <item>
      <title>AI Industry Rivals Are Teaming Up on a Startup Accelerator</title>
      <link>https://www.wired.com/story/ai-industry-rivals-are-teaming-up-on-a-startup-accelerator/</link>
      <pubDate>Wed, 11 Feb 2026 10:55:24 +0000</pubDate>
      <guid isPermaLink="false">698a0bf9219581fd8b0f35cf</guid>
      <description>OpenAI, Anthropic, Google, and a host of other major tech companies have found common ground in F/ai, a new startup accelerator based out of Paris.</description>
    </item>
    <item>
      <title>Abandon de Windows : les Fran&#231;ais passent un cap historique</title>
      <link>https://www.frandroid.com/os/gnu-linux/2973453_abandon-de-windows-les-francais-passent-un-cap-historique</link>
      <pubDate>Wed, 11 Feb 2026 10:52:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/gnu-linux/2973453_abandon-de-windows-les-francais-passent-un-cap-historique</guid>
      <description>
En France, la part de march&#233; de Linux d&#233;passe pour la premi&#232;re fois les 5 %. La croissance de cette alternative &#224; Windows continue de cro&#238;tre.
</description>
    </item>
    <item>
      <title>Mon jeu mobile pr&#233;f&#233;r&#233; est devenu gratuit sur iPhone et Android : ne ratez pas cette p&#233;pite</title>
      <link>https://www.frandroid.com/produits-android/console/2973641_mon-jeu-mobile-prefere-est-devenu-gratuit-sur-iphone-et-android-alors-foncez</link>
      <pubDate>Wed, 11 Feb 2026 10:45:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2973641_mon-jeu-mobile-prefere-est-devenu-gratuit-sur-iphone-et-android-alors-foncez</guid>
      <description>
Game Dev Story n'est plus tout jeune, mais reste une p&#233;pite du jeu vid&#233;o sur mobile. Il est d&#233;sormais gratuit sur le Google Play Store et l'App Store d'Apple.
</description>
    </item>
    <item>
      <title>Sommeil : oubliez les montres connect&#233;es, ces &#233;couteurs utilisent la science pour vraiment analyser vos nuits</title>
      <link>https://www.frandroid.com/produits-android/audio/ecouteurs-true-wireless/2973339_sommeil-oubliez-les-montres-connectees-ces-ecouteurs-utilisent-la-science-pour-vraiment-analyser-vos-nuits</link>
      <pubDate>Wed, 11 Feb 2026 10:43:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/audio/ecouteurs-true-wireless/2973339_sommeil-oubliez-les-montres-connectees-ces-ecouteurs-utilisent-la-science-pour-vraiment-analyser-vos-nuits</guid>
      <description>
Alors que le suivi du sommeil sur les montres repose essentiellement sur la fr&#233;quence cardiaque ou les mouvements, les &#233;couteurs NextSense Smartbuds promettent un suivi plus pr&#233;cis gr&#226;ce &#224; une mesure des ondes c&#233;r&#233;brales. 
</description>
    </item>
    <item>
      <title>Mazzer Philos Review (2026): Sweet, Zero-Retention Grinds</title>
      <link>https://www.wired.com/review/mazzer-philos-coffee-grinder/</link>
      <pubDate>Wed, 11 Feb 2026 10:38:00 +0000</pubDate>
      <guid isPermaLink="false">696f7b0e1dd2ae4ac17da753</guid>
      <description>Mazzer Philos is a commercial-caliber coffee grinder made for the home countertop. And it made for some of the most delicious espresso I pulled this year.</description>
    </item>
    <item>
      <title>Nouveau coup dur pour Stellantis sur les batteries des voitures &#233;lectriques : un divorce avec Samsung &#224; l&#8217;horizon</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2973479_nouveau-coup-dur-pour-stellantis-sur-les-batteries-des-voitures-electriques-un-divorce-avec-samsung-a-lhorizon</link>
      <pubDate>Wed, 11 Feb 2026 10:35:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2973479_nouveau-coup-dur-pour-stellantis-sur-les-batteries-des-voitures-electriques-un-divorce-avec-samsung-a-lhorizon</guid>
      <description>
Suite &#224; son r&#233;cent &#171; reset &#187; sur la voiture &#233;lectrique chiffr&#233; &#224; 22 milliards d'euros, Stellantis chercherait &#224; sortir de sa coentreprise avec Samsung SDI, focalis&#233;e sur les batteries. Une nouvelle preuve de la p&#233;riode critique que traverse le groupe.
</description>
    </item>
    <item>
      <title>Google a une solution pour supprimer vos informations sensibles d&#8217;Internet</title>
      <link>https://www.frandroid.com/marques/google/2973359_google-a-une-solution-pour-supprimer-vos-informations-sensibles-dinternet</link>
      <pubDate>Wed, 11 Feb 2026 10:35:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2973359_google-a-une-solution-pour-supprimer-vos-informations-sensibles-dinternet</guid>
      <description>
Les &#233;quipes de Google ont mis &#224; jour les outils permettant aux internautes de demander le retrait d&#8217;informations confidentielles ou explicites pr&#233;sentes dans son moteur. &#160;
</description>
    </item>
    <item>
      <title>Pourquoi votre prochain smartphone &#171;&#160;pas cher&#160;&#187; pourrait repasser au LCD</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2973583_pourquoi-votre-prochain-smartphone-pas-cher-pourrait-repasser-au-lcd</link>
      <pubDate>Wed, 11 Feb 2026 10:30:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2973583_pourquoi-votre-prochain-smartphone-pas-cher-pourrait-repasser-au-lcd</guid>
      <description>
On pensait le LCD enterr&#233; sur le milieu de gamme. Pourtant, les derni&#232;res fuites concernant la s&#233;rie iQOO Z11 et les futurs plans de Redmi sugg&#232;rent tout le contraire. Pour garder des prix bas malgr&#233; l'inflation du mat&#233;riel, les constructeurs s'appr&#234;tent &#224; faire une marche arri&#232;re technologique majeure.
</description>
    </item>
    <item>
      <title>This designer bootstrapped her way to building a cool-girl fashion brand</title>
      <link>https://www.fastcompany.com/91487818/nili-lotan-bootstrapped-cool-girl-fashion-brand</link>
      <pubDate>2026-02-11T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91487818/nili-lotan-bootstrapped-cool-girl-fashion-brand</guid>
      <description>After two decades, designer Nili Lotan is ready to scale. Her new denim-only store is part of her growing reach.
Nili Lotan&#8217;s Tribeca flagship has been a fixture in the neighborhood for 20 years. It&#8217;s an austere space that brings her aesthetic universe to life, one that blends silk slip dresses with military-inspired jackets, and crisp button-down shirts with utilitarian pants. ...</description>
    </item>
    <item>
      <title>ChatGPT now includes ads &#8212; and that subtle shift could reshape the emotional bond users have with the world&#8217;s favorite AI chatbot</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt-now-includes-ads-and-that-subtle-shift-could-reshape-the-emotional-bond-users-have-with-the-worlds-favorite-ai-chatbot</link>
      <pubDate>Wed, 11 Feb 2026 10:25:24 +0000</pubDate>
      <guid isPermaLink="false">R8qFQ5KsRZ7ZSVCPACtrw6</guid>
      <description>ChatGPT&#8217;s introduction of ads may subtly erode user trust and attention at the exact moment Gemini&#8217;s ad-light, deeply integrated approach is making it easier for people to drift toward Google&#8217;s AI instead.</description>
    </item>
    <item>
      <title>Amazon teste discr&#232;tement Alexa+ en France avant un lancement attendu</title>
      <link>https://www.frandroid.com/marques/amazon/2973567_amazon-teste-discretement-alexa-en-france-avant-un-lancement-attendu</link>
      <pubDate>Wed, 11 Feb 2026 10:24:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazon/2973567_amazon-teste-discretement-alexa-en-france-avant-un-lancement-attendu</guid>
      <description>
Apr&#232;s plusieurs mois de d&#233;veloppement et un d&#233;ploiement progressif outre-Atlantique, Amazon propose &#224; une poign&#233;e d&#8217;utilisateurs fran&#231;ais de tester Alexa+ en version b&#234;ta.
</description>
    </item>
    <item>
      <title>Le rachat de SFR avance&#160;: Orange, Free et Bouygues n&#233;gocient une nouvelle offre</title>
      <link>https://www.01net.com/actualites/le-rachat-de-sfr-avance-orange-free-et-bouygues-negocient-une-nouvelle-offre.html</link>
      <pubDate>Wed, 11 Feb 2026 10:23:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325323</guid>
      <description>Le rachat de SFR est entr&#233; dans une nouvelle phase d&#233;cisive. Apr&#232;s une p&#233;riode de due diligence &#233;clair, Free, Orange et Bouygues Telecom ont repris les n&#233;gociations dans l'espoir de boucler la transaction avant la pr&#233;sidentielle de 2027, avec la b&#233;n&#233;diction de l&#8217;&#201;lys&#233;e.</description>
    </item>
    <item>
      <title>Elegoo fait -36 % sur son imprimante 3D Centauri Carbon au rapport qualit&#233;/prix excellent</title>
      <link>https://www.frandroid.com/bons-plans/2973281_elegoo-fait-36-sur-son-imprimante-3d-centauri-carbon-au-rapport-qualite-prix-excellent</link>
      <pubDate>Wed, 11 Feb 2026 10:23:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2973281_elegoo-fait-36-sur-son-imprimante-3d-centauri-carbon-au-rapport-qualite-prix-excellent</guid>
      <description>
L'Elegoo Centauri Carbon fait partie de notre top 3 des meilleures imprimantes 3D, cat&#233;gorie rapport qualit&#233;/prix. Alors quand elle passe de 437 &#224; 279 euros sur le site de la marque, on s'y int&#233;resse de pr&#232;s.
</description>
    </item>
    <item>
      <title>The NordVPN birthday sale just launched &#8212; free Amazon gift cards up to $50 now available across all of our favorite plans</title>
      <link>https://www.techradar.com/vpn/vpn-services/the-nordvpn-birthday-sale-just-launched-free-amazon-gift-cards-up-to-usd50-now-available-across-my-favorite-plans</link>
      <pubDate>Wed, 11 Feb 2026 10:14:05 +0000</pubDate>
      <guid isPermaLink="false">UF2DPD2osocQpyHVzQHppL</guid>
      <description>NordVPN is celebrating its 14th year with the return of a fan-favorite deal</description>
    </item>
    <item>
      <title>MrBeast&#8217;s business empire stretches far beyond viral YouTube videos</title>
      <link>https://www.fastcompany.com/91490295/mrbeast-business-empire-step-banking-app</link>
      <pubDate>2026-02-11T10:11:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91490295/mrbeast-business-empire-step-banking-app</guid>
      <description>Banking apps, snack foods, streaming hits, and data tools are all part of Jimmy Donaldson&#8217;s growing $5 billion portfolio under Beast Industries.
Jimmy Donaldson might have made his fortune on YouTube, but the man better known as MrBeast has plans for a much wider financial empire&#8212;and he&#8217;s well on his way to achieving it.</description>
    </item>
    <item>
      <title>Best Presidents&#8217; Day Mattress Sales of 2026</title>
      <link>https://www.wired.com/story/best-presidents-day-mattress-sales-2026/</link>
      <pubDate>Wed, 11 Feb 2026 10:01:00 +0000</pubDate>
      <guid isPermaLink="false">698b72f8d8d7dbeeaad637ef</guid>
      <description>Some of the best sales of the year are happening right now&#8212;we&#8217;ll help you save on our all-time favorite mattresses and bedding.</description>
    </item>
    <item>
      <title>Employees are wasting thousands of hours a month on admin - so is AI the answer?</title>
      <link>https://www.techradar.com/pro/employees-are-wasting-thousands-of-hours-a-month-on-admin-so-is-ai-the-answer</link>
      <pubDate>Wed, 11 Feb 2026 10:00:49 +0000</pubDate>
      <guid isPermaLink="false">Gzx7ifswUKcpZk77gvUX5</guid>
      <description>Workers are wasting 5.6 hours/week on average doing admin (mostly responding to emails) &#8211; so doi we need more suitable AI tools?</description>
    </item>
    <item>
      <title>Pourquoi vous devriez (encore) pr&#233;f&#233;rer le Wi-Fi &#224; la 5G sur votre iPhone 17 Pro</title>
      <link>https://www.frandroid.com/os/ios/2973487_pourquoi-vous-devriez-encore-preferer-le-wi-fi-a-la-5g-sur-votre-iphone-17-pro</link>
      <pubDate>Wed, 11 Feb 2026 10:00:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/ios/2973487_pourquoi-vous-devriez-encore-preferer-le-wi-fi-a-la-5g-sur-votre-iphone-17-pro</guid>
      <description>
L'iPhone 17 Pro Max est une b&#234;te d'autonomie, sauf quand vous activez la 5G. Un nouveau comparatif montre que l'&#233;cart avec le Wi-Fi est massif.
</description>
    </item>
    <item>
      <title>The best MacBook accessories for 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-macbook-accessories-150014737.html?src=rss</link>
      <pubDate>Wed, 11 Feb 2026 10:00:35 +0000</pubDate>
      <guid isPermaLink="false">442f16bb-2aa3-40cf-8119-d82f86c3f71e</guid>
      <description>Apple&#8217;s MacBooks don&#8217;t need much help out of the box, but the right accessories can make a noticeable difference in how you use them day to day. Whether that means adding more ports, creating a cleaner desk setup or making your laptop easier to travel with, there&#8217;s a growing ecosystem of gear designed to fill in the gaps Apple leaves behind. A good accessory should feel like an extension of your MacBook, not a workaround.The picks below are meant to work smoothly with macOS and today&#8217;s USB-C-only reality, whether you&#8217;re using a lightweight MacBook Air or a higher-end MacBook Pro. From practica...</description>
    </item>
    <item>
      <title>&#8216;Truly Beyond Words!&#8217;: Tesla&#8217;s Conflict with a German Labor Union Is Getting Out of Hand</title>
      <link>https://gizmodo.com/truly-beyond-words-teslas-conflict-with-a-german-labor-union-is-getting-out-of-hand-2000719975</link>
      <pubDate>Wed, 11 Feb 2026 10:00:12 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000719975</guid>
      <description>One can't help but wonder if Elon Musk even enjoys having a factory in Germany anymore.</description>
    </item>
    <item>
      <title>Astronomers Are Closing In on the Kuiper Belt&#8217;s Secrets</title>
      <link>https://www.wired.com/story/astronomers-are-closing-in-on-the-kuiper-belts-secrets/</link>
      <pubDate>Wed, 11 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">698a0b2b8c799dc912dfef13</guid>
      <description>As next-generation telescopes map this outer frontier, astronomers are bracing for discoveries that could reveal hidden planets, strange structures, and clues to the solar system&#8217;s chaotic youth.</description>
    </item>
    <item>
      <title>AI tools that are actually useful</title>
      <link>https://www.fastcompany.com/91486878/ai-tools-for-solopreneurs-that-are-actually-useful</link>
      <pubDate>2026-02-11T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91486878/ai-tools-for-solopreneurs-that-are-actually-useful</guid>
      <description>These easy-to-use solutions address real problems and save solopreneurs time.
Ever feel like your solo business is running you into the ground? Solopreneurs don&#8217;t have the luxury of handing off tasks to a team. Everything lands on your plate, and there&#8217;s never enough time.&#160;</description>
    </item>
    <item>
      <title>Here&#8217;s why the Olympics drones fly so fast</title>
      <link>https://www.fastcompany.com/91489499/heres-why-the-olympics-drones-fly-so-fast</link>
      <pubDate>2026-02-11T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91489499/heres-why-the-olympics-drones-fly-so-fast</guid>
      <description>The custom drones are designed to capture winter sports&#8217; aerial moves.
The 2026 Milan Cortina Olympics are giving people at home a first-of-its-kind, first-person view of the Winter Games, all thanks to a fleet of custom-built drones.</description>
    </item>
    <item>
      <title>Une application pour cr&#233;er sa propre app&#160;: l&#8217;id&#233;e g&#233;niale de Nothing pour r&#233;inventer Android</title>
      <link>https://www.01net.com/actualites/une-application-pour-creer-sa-propre-app-lidee-geniale-de-nothing-pour-reinventer-android.html</link>
      <pubDate>Wed, 11 Feb 2026 09:57:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325304</guid>
      <description>Nothing lance un Apps Builder qui promet de g&#233;n&#233;rer des micro-apps personnalisables, pilot&#233;es par une IA et cadr&#233;es par la charte graphique de Nothing. L'objectif : une exp&#233;rience plus personnalis&#233;e avec des widgets en page d'accueil.</description>
    </item>
    <item>
      <title>L&#8217;iPhone 18 Pro pr&#233;pare une surprise de taille malgr&#233; l&#8217;explosion de la RAM</title>
      <link>https://www.frandroid.com/marques/apple/2973357_liphone-18-pro-prepare-une-surprise-de-taille-maglre-lexplosion-de-la-ram</link>
      <pubDate>Wed, 11 Feb 2026 09:51:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2973357_liphone-18-pro-prepare-une-surprise-de-taille-maglre-lexplosion-de-la-ram</guid>
      <description>
La hausse des prix des composants, et notamment de la m&#233;moire vive, ne touchera pas les iPhone 18 Pro et Pro Max, laissent entendre deux analystes renomm&#233;s. Une nouvelle rassurante pour les tarifs de ces deux-l&#224;.
</description>
    </item>
    <item>
      <title>England vs West Indies Free Streams: How to watch T20 World Cup match online from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/cricket/england-vs-west-indies-t20-world-cup-match-free</link>
      <pubDate>Wed, 11 Feb 2026 09:45:00 +0000</pubDate>
      <guid isPermaLink="false">daVbji6b9peNDY7WBqRixP</guid>
      <description>Here's how to watch England vs West Indies T20 World Cup streams as Harry Brook's side look to make it two from two.</description>
    </item>
    <item>
      <title>iPhone 17e, Pixel 10a, le Xiaomi 17 Ultra en Europe et un hack pas comme les autres : Unlock Talk vous donne rendez-vous &#224; 17h !</title>
      <link>https://www.frandroid.com/humanoid/emissions/2973431_iphone-17e-pixel-10a-le-xiaomi-17-ultra-en-europe-et-un-hack-pas-comme-les-autres-unlock-talk-vous-donne-rendez-vous-a-17h</link>
      <pubDate>Wed, 11 Feb 2026 09:44:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/emissions/2973431_iphone-17e-pixel-10a-le-xiaomi-17-ultra-en-europe-et-un-hack-pas-comme-les-autres-unlock-talk-vous-donne-rendez-vous-a-17h</guid>
      <description>
La 43e d&#8217;Unlock Talk, qui sera diffus&#233;e en Home Page de Twitch, aura lieu ce mercredi 11 f&#233;vrier 2026 &#224; partir de 17h sur notre cha&#238;ne FrandroidLive.
</description>
    </item>
    <item>
      <title>Windows 11 : attention, Microsoft cr&#233;e un v&#233;ritable casse-t&#234;te avec ses mises &#224; jour pour 2026</title>
      <link>https://www.frandroid.com/marques/microsoft/2973381_windows-11-attention-microsoft-cree-un-veritable-casse-tete-avec-ses-mises-a-jour-pour-2026</link>
      <pubDate>Wed, 11 Feb 2026 09:43:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2973381_windows-11-attention-microsoft-cree-un-veritable-casse-tete-avec-ses-mises-a-jour-pour-2026</guid>
      <description>
&#192; l'occasion du lancement de Windows 26H1 pour les PC compatibles, Microsoft a d&#233;taill&#233; sa strat&#233;gie de mises &#224; jour pour l'ann&#233;e 2026. Et il faut avouer que celle-ci porte &#224; confusion.
</description>
    </item>
    <item>
      <title>&#8216;ChatGPT is done&#8217;: OpenAI is rolling out ads to free and paying users, and not everyone is happy</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt-is-done-openai-is-rolling-out-ads-to-free-and-paying-users-and-not-everyone-is-happy</link>
      <pubDate>Wed, 11 Feb 2026 09:43:11 +0000</pubDate>
      <guid isPermaLink="false">etXc55YvxaQwvuYgMaTCvR</guid>
      <description>ChatGPT&#8217;s Free and Go tiers are getting ads, prompting a backlash from some unhappy users.</description>
    </item>
    <item>
      <title>Xiaomi Electric Scooter 4 Ultra : cette trottinette haut de gamme est presque &#224; moiti&#233; prix</title>
      <link>https://www.frandroid.com/bons-plans/2710429_xiaomi-electric-scooter-4-ultra-cette-trottinette-haut-de-gamme-est-presque-a-moitie-prix</link>
      <pubDate>Wed, 11 Feb 2026 09:38:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2710429_xiaomi-electric-scooter-4-ultra-cette-trottinette-haut-de-gamme-est-presque-a-moitie-prix</guid>
      <description>
Depuis l&#8217;arriv&#233;e des Scooter 5, la Xiaomi Electric Scooter 4 Ultra voit son tarif fortement brad&#233; : on parle ici d&#8217;une remise de pr&#232;s de 50 % sur une trottinette pens&#233;e pour avaler les kilom&#232;tres avec confort et puissance. 
</description>
    </item>
    <item>
      <title>Galaxy S26&#160;: Samsung officialise la date de sa conf&#233;rence Unpacked (et c&#8217;est pour tr&#232;s bient&#244;t)</title>
      <link>https://www.01net.com/actualites/galaxy-s26-samsung-officialise-la-date-de-sa-conference-unpacked-et-cest-pour-tres-bientot.html</link>
      <pubDate>Wed, 11 Feb 2026 09:37:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325295</guid>
      <description>C&#8217;est officiel : Samsung donne rendez-vous aux fans de tech le 25 f&#233;vrier prochain. Au menu de cette keynote tr&#232;s attendue ? L&#8217;av&#232;nement de l&#8217;&#232;re &#171; AI Phone &#187; et la pr&#233;sentation des Galaxy S26.</description>
    </item>
    <item>
      <title>Apple AirPods Pro 3 are now under $210 at Amazon &#8212; score this rare $40 discount</title>
      <link>https://mashable.com/article/feb-11-apple-airpods-pro-3-deal</link>
      <pubDate>Wed, 11 Feb 2026 09:36:57 +0000</pubDate>
      <guid isPermaLink="false">07wSBWHXBdQCgU3YenJAcex</guid>
      <description>Find the best AirPods deal. Save 16% on the Apple AirPods Pro 3 at Amazon.</description>
    </item>
    <item>
      <title>Wix Studio review 2026</title>
      <link>https://www.techradar.com/pro/website-building/wix-studio-review</link>
      <pubDate>Wed, 11 Feb 2026 09:36:43 +0000</pubDate>
      <guid isPermaLink="false">sxH7NhoF9z7dM7gFzYpSPE</guid>
      <description>Wix Studio is a professional web development platform designed for agencies and consultants &#8212; offering advanced design tools, team collaboration, and client management.</description>
    </item>
    <item>
      <title>Riot Games remercie la moiti&#233; de l&#8217;&#233;quipe de 2XKO, le jeu inspir&#233; de LoL</title>
      <link>https://www.frandroid.com/culture-tech/economie/2973233_riot-games-remercie-la-moitie-de-lequipe-de-2xko-le-jeu-inspire-de-lol</link>
      <pubDate>Wed, 11 Feb 2026 09:36:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/economie/2973233_riot-games-remercie-la-moitie-de-lequipe-de-2xko-le-jeu-inspire-de-lol</guid>
      <description>
Le succ&#232;s de 2XKO n&#8217;aurait pas atteint les esp&#233;rances de Riot Games qui d&#233;cide de se s&#233;parer de la moiti&#233; des employ&#233;s impliqu&#233;s sur le titre quelques semaines apr&#232;s sa sortie officielle.
</description>
    </item>
    <item>
      <title>La nouvelle MG4 &#233;lectrique arrive officiellement en France : voici toutes les nouveaut&#233;s</title>
      <link>https://www.frandroid.com/marques/mg/2973331_la-nouvelle-mg4-electrique-arrive-officiellement-en-france-voici-toutes-les-nouveautes</link>
      <pubDate>Wed, 11 Feb 2026 09:30:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/mg/2973331_la-nouvelle-mg4-electrique-arrive-officiellement-en-france-voici-toutes-les-nouveautes</guid>
      <description>
Apr&#232;s quelques indiscr&#233;tions, MG annonce l'arriv&#233;e officielle de sa MG4 restyl&#233;e en France. Si le style de la voiture &#233;lectrique n'&#233;volue gu&#232;re, les am&#233;liorations se portent surtout sur l'habitacle et les batteries.
</description>
    </item>
    <item>
      <title>TikTok users&#8217; reactions to policy changes point to a bigger problem in the tech&#160;industry</title>
      <link>https://www.fastcompany.com/91488619/tiktok-policy-changes-point-to-a-bigger-problem-tech-industry</link>
      <pubDate>2026-02-11T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91488619/tiktok-policy-changes-point-to-a-bigger-problem-tech-industry</guid>
      <description>Most tech policies aren&#8217;t made to be read.
A little over a year after TikTok temporarily went dark in the United States and users were greeted with a message explaining that &#8220;a law banning TikTok has been enacted,&#8221; those same U.S. users opened the app to find a pop-up message requiring them to agree to new terms before they could continue scrolling....</description>
    </item>
    <item>
      <title>Save over $100 on the Asus ROG Strix monitor &#8212; now at its best-ever price at Amazon</title>
      <link>https://mashable.com/article/feb-11-asus-rog-strix-4k-gaming-monitor-deal</link>
      <pubDate>Wed, 11 Feb 2026 09:29:42 +0000</pubDate>
      <guid isPermaLink="false">04FNHhsccJB4Wjp6ouixiHV</guid>
      <description>The Asus ROG Strix (XG27UCG) 4K gaming monitor drops to $337.99 at Amazon, marking its lowest price yet with dual-mode 160Hz and 320Hz support.</description>
    </item>
    <item>
      <title>The Logitech G435 Lightspeed wireless gaming headset is half price at Amazon &#8212; save over $30</title>
      <link>https://mashable.com/article/feb-11-logitech-g435-lightspeed-wireless-gaming-headset-deal</link>
      <pubDate>Wed, 11 Feb 2026 09:23:48 +0000</pubDate>
      <guid isPermaLink="false">040x8lEN2jans4u0h1v2WuJ</guid>
      <description>Logitech G435 Lightspeed wireless gaming headset drops to $39.99 at Amazon, marking its lowest price this year.</description>
    </item>
    <item>
      <title>Microsoft met en garde&#160;: des millions de PC pourraient devenir vuln&#233;rables d&#232;s juin 2026</title>
      <link>https://www.01net.com/actualites/microsoft-met-en-garde-des-millions-de-pc-pourraient-devenir-des-vulnerables-a-partir-de-juin-2026.html</link>
      <pubDate>Wed, 11 Feb 2026 09:19:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325301</guid>
      <description>Apr&#232;s 15 ans de bons et loyaux services, les certificats du d&#233;marrage s&#233;curis&#233; Secure Boot de Windows vont expirer. S&#8217;ils ne sont pas mis &#224; jour par leurs utilisateurs, des millions de machines pourraient devenir vuln&#233;rables.</description>
    </item>
    <item>
      <title>How to watch Australia vs. Ireland online for free</title>
      <link>https://mashable.com/article/australia-ireland-t20-world-cup-2026-live-stream-for-free</link>
      <pubDate>Wed, 11 Feb 2026 09:19:19 +0000</pubDate>
      <guid isPermaLink="false">036kUUqDsyOgrQU2UuUF2YH</guid>
      <description>How to watch T20 World Cup for free. Live stream Australia vs. Ireland in the 2026 T20 World Cup for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Une faille de Claude permet &#224; un simple &#233;v&#233;nement Google Agenda de pirater votre PC</title>
      <link>https://www.01net.com/actualites/une-faille-de-claude-permet-a-un-simple-evenement-google-agenda-de-pirater-votre-pc.html</link>
      <pubDate>Wed, 11 Feb 2026 09:18:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325279</guid>
      <description>Une vuln&#233;rabilit&#233; critique dans les extensions officielles de Claude a &#233;t&#233; d&#233;couverte par des chercheurs en s&#233;curit&#233;. La faille transforme un simple &#233;v&#233;nement Google Agenda en vecteur d'attaque. En exploitant la faille avec des instructions cach&#233;es, un pirate peut prendre le contr&#244;le d'un ordinateur sans la moindre entrave.</description>
    </item>
    <item>
      <title>Sex Toys for Every Type of Body and Ability (2026)</title>
      <link>https://www.wired.com/gallery/best-accessible-sex-toys/</link>
      <pubDate>Wed, 11 Feb 2026 09:09:00 +0000</pubDate>
      <guid isPermaLink="false">696fdac0e416a8d0125713d5</guid>
      <description>From app-controlled toys to mounts and wearables, I tested a variety of sex toys for every type of body and ability.</description>
    </item>
    <item>
      <title>Dunkin is giving away free iced coffee &#8212; use this promo code to qualify</title>
      <link>https://mashable.com/article/dunkin-free-coffee-promo-code</link>
      <pubDate>Wed, 11 Feb 2026 09:03:52 +0000</pubDate>
      <guid isPermaLink="false">01AjsKIsywfBtQ5zKIEGJJp</guid>
      <description>How to get free coffee from Dunkin' &#8212; get a free iced coffee with this promo code on Feb. 9.</description>
    </item>
    <item>
      <title>Stuff Your Kindle Day is live &#8212; download 100s of free romance books for your Kindle</title>
      <link>https://mashable.com/article/stuff-your-kindle-day-free-romance-book-blast-be-my-valentine</link>
      <pubDate>Wed, 11 Feb 2026 09:03:37 +0000</pubDate>
      <guid isPermaLink="false">06jqk3yhsUc0i4uepZ0EhMr</guid>
      <description>The latest Stuff Your Kindle Day is live. Download free romance books for your Kindle in the new Romance Book Blast.</description>
    </item>
  </channel>
</rss>
