<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 02 Jan 2026 08:35:17 GMT</lastBuildDate>
    <item>
      <title>Samsung adds much needed brightness to its Freestyle projector</title>
      <link>https://www.theverge.com/news/852545/samsung-adds-much-needed-brightness-to-its-freestyle-projector</link>
      <pubDate>2026-01-02T03:30:17-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=852545</guid>
      <description>The Freestyle Plus all-in-one portable projector features 430 ISO Lumens, or "nearly twice the brightness of the previous generation," according to Samsung. Great! But also a little strange since both the original and second generation Freestyle projectors listed "550 lumens" on their respective spec sheets. See, projector makers are notorious for playing fast and loose [&#8230;]...</description>
    </item>
    <item>
      <title>BYD, MG, Xpeng : la part de march&#233; r&#233;elle des voitures chinoises en France va vous surprendre</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2925223_byd-mg-xpeng-la-part-de-marche-reelle-des-voitures-chinoises-en-france-va-vous-surprendre</link>
      <pubDate>Fri, 02 Jan 2026 08:25:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2925223_byd-mg-xpeng-la-part-de-marche-reelle-des-voitures-chinoises-en-france-va-vous-surprendre</guid>
      <description>
Il va falloir arr&#234;ter de se faire peur. On nous annon&#231;ait un tsunami de voitures chinoises sur nos routes, une d&#233;ferlante qui allait balayer Peugeot et Renault. On a les chiffres 2025 sous les yeux et la r&#233;alit&#233; est cruelle : le raz-de-mar&#233;e est une flaque d'eau.
</description>
    </item>
    <item>
      <title>Hack de la PS5&#160;? La console de Sony vient de d&#233;voiler son plus grand secret, plus rien ne sera comme avant</title>
      <link>https://www.01net.com/actualites/hack-de-la-ps5-la-console-de-sony-vient-de-devoiler-son-plus-grand-secret-plus-rien-ne-sera-comme-avant.html</link>
      <pubDate>Fri, 02 Jan 2026 08:06:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317789</guid>
      <description>La fuite des cl&#233;s ROM est un &#233;norme probl&#232;me pour la console de Sony et probablement le plus grand hack de son histoire.</description>
    </item>
    <item>
      <title>The best laptops for gaming and schoolwork in 2026</title>
      <link>https://www.engadget.com/computing/laptops/best-laptops-for-gaming-and-school-132207352.html?src=rss</link>
      <pubDate>Fri, 02 Jan 2026 08:00:35 +0000</pubDate>
      <guid isPermaLink="false">c44e3a73-1758-3e29-8212-bf6cf9045a41</guid>
      <description>A good laptop for both gaming and schoolwork strikes a balance that goes beyond raw power. It should handle essays and research during the day, then jump into your favorite games when you are ready to take a break. That mix is easier to find now, with more laptops offering capable GPUs, solid battery life and designs that do not look out of place in a classroom.Whether you want a budget gaming laptop for lighter titles or a more powerful system that can run demanding games, there is something that fits just about every schedule and workload. We rounded up the best laptops for gaming and school...</description>
    </item>
    <item>
      <title>Petkit&#8217;s first automatic wet food feeder keeps track of how much your pet eats</title>
      <link>https://www.theverge.com/news/850992/petkit-ai-camera-yumshare-daily-feast-automatic-wet-food-feeder-eversweet-ultra-fountain</link>
      <pubDate>2026-01-02T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=850992</guid>
      <description>Petkit has announced two new automated machines at CES 2026 designed to feed and care for your pets using AI-powered cameras that track their behavior and provide health insights that may otherwise go unnoticed. Launching sometime in April 2026, the Petkit Yumshare Daily Feast is one of the first automatic dispensers that works with wet [&#8230;]</description>
    </item>
    <item>
      <title>Test du Bosch Spotless Max : que vaut le robot aspirateur laveur du g&#233;ant allemand de l&#8217;&#233;lectrom&#233;nager ?</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/robot-aspirateur/2920937_test-du-bosch-spotless-max-que-vaut-le-robot-aspirateur-laveur-du-geant-allemand-de-lelectromenager</link>
      <pubDate>Fri, 02 Jan 2026 07:55:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/robot-aspirateur/2920937_test-du-bosch-spotless-max-que-vaut-le-robot-aspirateur-laveur-du-geant-allemand-de-lelectromenager</guid>
      <description>
Bosch se lance enfin s&#233;rieusement dans la bataille des aspirateurs robots tout-en-un. Pour ce faire, le g&#233;ant allemand a choisi une strat&#233;gie pragmatique : plut&#244;t que de r&#233;inventer la roue, il s'est associ&#233; au savoir-faire d'Ecovacs. Le r&#233;sultat ? La gamme Spotless Max, qui reprend l'excellente base technique du Deebot T30S, mais l'int&#232;gre dans l'&#233;cosyst&#232;me de Bosch. Une alliance prometteuse sur le papier, mais qu'en est-il &#224; l'usage ?
...</description>
    </item>
    <item>
      <title>Samsung Galaxy Fit 3 et Buds FE : le pack des bonnes r&#233;solutions sportives revient &#224; moins de 50 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2924755_samsung-galaxy-fit-3-et-buds-fe-le-pack-des-bonnes-resolutions-sportives-revient-a-moins-de-50-e</link>
      <pubDate>Fri, 02 Jan 2026 07:43:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2924755_samsung-galaxy-fit-3-et-buds-fe-le-pack-des-bonnes-resolutions-sportives-revient-a-moins-de-50-e</guid>
      <description>
Pour reprendre le sport, SFR sort un coup malin avec un pack r&#233;unissant le Samsung Galaxy Fit 3 et les Samsung Galaxy Buds FE : le tout passe de 129,99 &#8364; &#224; 99,99 &#8364;, et gr&#226;ce &#224; une ODR, les clients box RED by SFR et SFR peuvent m&#234;me repartir avec le bundle &#224; 49,99 &#8364;.
</description>
    </item>
    <item>
      <title>Samsung d&#233;voile The Freestyle+ : un projecteur portable dop&#233; &#224; l&#8217;IA pour optimiser l&#8217;image</title>
      <link>https://www.frandroid.com/marques/samsung/2925159_samsung-devoile-the-freestyle-un-projecteur-portable-dope-a-lia-pour-optimiser-limage</link>
      <pubDate>Fri, 02 Jan 2026 07:22:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2925159_samsung-devoile-the-freestyle-un-projecteur-portable-dope-a-lia-pour-optimiser-limage</guid>
      <description>
Samsung Electronics pr&#233;sente son nouveau projecteur portable Freestyle+ avant le salon CES 2026 &#224; Las Vegas. Il succ&#232;de au The Freestyle 2 avec une luminosit&#233; sup&#233;rieure, des fonctions automatiques d&#8217;optimisation de l&#8217;image pour &#234;tre utilis&#233; partout ou presque.
</description>
    </item>
    <item>
      <title>Even as global crop prices fall, India&#8217;s Arya.ag is attracting investors &#8212; and staying profitable</title>
      <link>https://techcrunch.com/2026/01/01/even-as-global-crop-prices-fall-indias-arya-ag-is-attracting-investors-and-staying-profitable/</link>
      <pubDate>Fri, 02 Jan 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3079406</guid>
      <description>Arya.ag, an Indian agritech company offering storage facilities near farms and offering lending services to hundreds of thousands of farmers, has drawn investor interest and remained profitable even as global crop prices continue to fall in a volatile commodities market. The investor interest has taken shape in the latest all-equity Series D round from GEF [&#8230;]...</description>
    </item>
    <item>
      <title>'They're as robust as they can be while being comfortable for most users': a Dyson engineer reveals the brand's vacuum design ethos</title>
      <link>https://www.techradar.com/home/vacuums/theyre-as-robust-as-they-can-be-while-being-comfortable-for-most-users-a-dyson-engineer-reveals-the-brands-vacuum-design-ethos</link>
      <pubDate>Fri, 02 Jan 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">NXErxe5djGkmtAao8madgN</guid>
      <description>Dyson vacuums consistently disappoint when it comes to comfort &#8211; I wanted to know why that is.</description>
    </item>
    <item>
      <title>How to get your dream job in 2026</title>
      <link>https://www.fastcompany.com/91462330/how-to-get-your-dream-job-in-2026</link>
      <pubDate>2026-01-02T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91462330/how-to-get-your-dream-job-in-2026</guid>
      <description>The road may be full of twists and turns, but it&#8217;s worth it. Four success stories share insight.
Work consumes around a third of our waking hours during the weekday. Yet, according to Gallup, nearly a third of employees are disengaged.&#160;</description>
    </item>
    <item>
      <title>20% Off Brooks Promo Code &amp; Deals for January 2026</title>
      <link>https://www.wired.com/story/brooks-promo-code/</link>
      <pubDate>Fri, 02 Jan 2026 06:40:00 +0000</pubDate>
      <guid isPermaLink="false">673bb0142598c31aeeee086e</guid>
      <description>Enjoy 20% off your first order with a Brooks coupon code, plus top discounts and deals on our favorite Brooks running shoes.</description>
    </item>
  </channel>
</rss>
