<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 15 Nov 2025 11:25:35 GMT</lastBuildDate>
    <item>
      <title>Amazon continue les offres pendant le week-end du pr&#233;-Black Friday : voici le TOP des deals</title>
      <link>https://www.frandroid.com/bons-plans/2860071_amazon-brade-deja-un-tas-de-produits-tech-pour-le-pre-black-friday-les-14-offres-a-retenir</link>
      <pubDate>Sat, 15 Nov 2025 11:17:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860071_amazon-brade-deja-un-tas-de-produits-tech-pour-le-pre-black-friday-les-14-offres-a-retenir</guid>
      <description>
Amazon lance d&#233;j&#224; ses premi&#232;res promotions avant le Black Friday et baisse fortement les prix sur de nombreux produits Tech. D&#233;couvrez d&#232;s maintenant les meilleures offres &#224; ne pas manquer.
</description>
    </item>
    <item>
      <title>Nintendo Switch 2&#160;: mais o&#249; est pass&#233; le mode souris&#160;?</title>
      <link>https://www.01net.com/actualites/nintendo-switch-2-mais-ou-est-passe-le-mode-souris.html</link>
      <pubDate>Sat, 15 Nov 2025 11:03:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1307296</guid>
      <description>Lors de la prise en main et le test de la Nintendo Switch 2, le mode souris s'est impos&#233; comme une des nouveaut&#233;s les plus impressionnantes. Cependant, &#224; l&#8217;approche de Metroid Prime 4 : Beyond, ce mode r&#233;v&#232;le un bilan mitig&#233;, notamment en raison de la faible int&#233;gration dans les jeux et des difficult&#233;s rencontr&#233;es par les d&#233;veloppeurs pour en tirer pleinement parti....</description>
    </item>
    <item>
      <title>Whatever Happened to String Theory?</title>
      <link>https://gizmodo.com/whatever-happened-to-string-theory-2000686064</link>
      <pubDate>Sat, 15 Nov 2025 11:00:44 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000686064</guid>
      <description>At the turn of the century, it sounded as if string theory could give us big answers about the universe. Well&#8230; has it?</description>
    </item>
    <item>
      <title>Gear News of the Week: Steam Makes a Home Console, and Apple Debuts a $230 Pouch for Your iPhone</title>
      <link>https://www.wired.com/story/gear-news-of-the-week-steam-makes-a-home-console-and-apple-debuts-a-dollar230-pouch-for-your-iphone/</link>
      <pubDate>Sat, 15 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">69165169f6777eeb084e1cea</guid>
      <description>Plus: Apple rolls out Digital IDs, Samsung&#8217;s new monitor has wheels, DJI&#8217;s latest drone has a display, and Insta360&#8217;s action camera gets an add-on that turns it into an instant camera.</description>
    </item>
    <item>
      <title>Double savings: not 1 but 2 top deals on outstanding VPNs with antivirus built in</title>
      <link>https://www.techradar.com/vpn/vpn-services/double-savings-not-1-but-2-top-deals-on-outstanding-vpns-with-antivirus-built-in</link>
      <pubDate>Sat, 15 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">t2BCacdS5U3G9o7AvPK8jR</guid>
      <description>Looking for the best VPN and antivirus bundles? These are the deals you won't want to miss</description>
    </item>
    <item>
      <title>ICYMI: the week's 7 biggest tech stories from iPhone Pockets to Steam's new hardware</title>
      <link>https://www.techradar.com/tech/icymi-the-weeks-7-biggest-tech-stories-from-iphone-pockets-to-steams-new-hardware</link>
      <pubDate>Sat, 15 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">C5YCC2vGgGHsDB2BaDTuWP</guid>
      <description>The week's biggest tech news stories from Apple, DJI, Valve, and more for November 15, 2025.</description>
    </item>
    <item>
      <title>Windows n&#8217;a jamais &#233;t&#233; aussi en danger</title>
      <link>https://www.frandroid.com/marques/microsoft/2869645_windows-na-jamais-ete-aussi-en-danger</link>
      <pubDate>Sat, 15 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2869645_windows-na-jamais-ete-aussi-en-danger</guid>
      <description>
Un MacBook &#224; moins de 800 euros, des appareils Steam sous Linux et un Windows qui d&#233;pla&#238;t de plus en plus &#224; ses utilisateurs : la place de Microsoft dans l'avenir du PC n'est plus assur&#233;e.
</description>
    </item>
    <item>
      <title>DJI Mini 3 : ce petit drone 4K est encore plus abordable lors de ce Black Friday en avant-premi&#232;re</title>
      <link>https://www.frandroid.com/bons-plans/2071338_dji-mini-3-ce-petit-drone-4k-est-encore-plus-abordable-lors-de-ce-black-friday-en-avant-premiere</link>
      <pubDate>Sat, 15 Nov 2025 10:56:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2071338_dji-mini-3-ce-petit-drone-4k-est-encore-plus-abordable-lors-de-ce-black-friday-en-avant-premiere</guid>
      <description>
Si vous d&#233;butez dans la vid&#233;o a&#233;rienne, rien de mieux qu'un drone de chez DJI : son mod&#232;le Mini 3 est un bon engin pour vous lancer, d'autant plus qu'il pr&#233;sente un tr&#232;s bon rapport qualit&#233;-prix aujourd'hui. Il ne co&#251;te plus que 273,16 euros au lieu de 379 euros gr&#226;ce &#224; un code promo.
</description>
    </item>
    <item>
      <title>&#171; La clart&#233; audio et la qualit&#233; du micro sont d&#8217;un niveau sup&#233;rieur &#187; : et si vous mettiez un Razer BlackShark V3 Pro au pied du sapin [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/audio/casque-audio/2862745_la-clarte-audio-et-la-qualite-du-micro-sont-dun-niveau-superieur-et-si-vous-mettiez-un-razer-blackshark-v3-pro-au-pied-du-sapin</link>
      <pubDate>Sat, 15 Nov 2025 10:47:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/audio/casque-audio/2862745_la-clarte-audio-et-la-qualite-du-micro-sont-dun-niveau-superieur-et-si-vous-mettiez-un-razer-blackshark-v3-pro-au-pied-du-sapin</guid>
      <description>
La gamme BlackShark de Razer &#233;volue : cet &#233;t&#233;, le constructeur a d&#233;voil&#233; la V3 de son casque audio gaming pens&#233; pour l&#8217;esport (mais pas que). Une nouvelle version revue et corrig&#233;e avec l&#8217;appui de joueurs professionnels, pour une exp&#233;rience quotidienne qui vise l&#8217;excellence.
</description>
    </item>
    <item>
      <title>Automated Holiday Party Ideas (2025): Ninja, HP Sprocket, Cricut</title>
      <link>https://www.wired.com/story/automated-holiday-party-ideas/</link>
      <pubDate>Sat, 15 Nov 2025 10:34:00 +0000</pubDate>
      <guid isPermaLink="false">69125e79f7639f2898bc41c1</guid>
      <description>I&#8217;m testing smart home gear and high-tech party gadgets at every holiday party I host and attend. Here&#8217;s how to automate the little things so you can actually enjoy the seasonal vibes this year.</description>
    </item>
    <item>
      <title>Tetris, Pictionary, Lego&#160;: Netflix ouvre sa salle de jeux pour la t&#233;l&#233;</title>
      <link>https://www.01net.com/actualites/tetris-pictionary-lego-netflix-ouvre-sa-salle-de-jeux-pour-la-tele.html</link>
      <pubDate>Sat, 15 Nov 2025 10:30:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308342</guid>
      <description>Netflix veut que ses abonn&#233;s restent scotch&#233;s devant la t&#233;l&#233;, que ce soit pour regarder un film, une s&#233;rie, ou&#8230; pour un jeu. La plateforme de streaming a lanc&#233; une nouvelle collection de jeux &#171; Party Games &#187; &#224; pratiquer &#224; plusieurs, chacun arm&#233; d'un smartphone.</description>
    </item>
    <item>
      <title>Fluance's chic powered bookshelf speakers offer impressively detailed, almost neutral sound &#8211; with very few drawbacks</title>
      <link>https://www.techradar.com/audio/speakers/fluance-ri71-review</link>
      <pubDate>Sat, 15 Nov 2025 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">zMiceHpXW9VZmHkg6GVBTS</guid>
      <description>The Fluance Ri71 are great for mid-range powered bookshelf speakers, offering detailed sound with an almost neutral, polite quality.</description>
    </item>
    <item>
      <title>Disney is back on YouTube TV after a new deal is agreed &#8211; and subscribers should see live channels coming back now</title>
      <link>https://www.techradar.com/streaming/entertainment/disney-is-back-on-youtube-tv-after-a-new-deal-is-agreed-and-subscribers-should-see-live-channels-coming-back-now</link>
      <pubDate>Sat, 15 Nov 2025 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">aMQBGrPqnyCoBKi2PeDJ9o</guid>
      <description>YouTube TV and Disney have made up and decided to be friends again, and channels are returning.</description>
    </item>
    <item>
      <title>Singles Day : les 11 offres incontournables du 11.11, le c&#233;l&#232;bre Black Friday chinois</title>
      <link>https://www.frandroid.com/bons-plans/2868103_singles-day-voici-les-11-offres-incontournables-du-black-friday-chinois</link>
      <pubDate>Sat, 15 Nov 2025 10:29:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2868103_singles-day-voici-les-11-offres-incontournables-du-black-friday-chinois</guid>
      <description>
&#192; c&#244;t&#233; du pr&#233;-Black Friday se tient le Singles Day, un &#233;v&#233;nement commercial venu de Chine qui nous fait profiter des prix bas sur les meilleurs produits Tech du moment. 
</description>
    </item>
    <item>
      <title>Ce TV QD Mini-LED Pro XXL de 216 cm avec du 144 Hz, ALLM et VRR retire 1 200 &#8364; de son prix de base pour le pr&#233;quel du Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2865137_ce-tv-qd-mini-led-pro-xxl-de-216-cm-avec-du-144-hz-allm-et-vrr-retire-1-200-e-de-son-prix-de-base-pour-le-prequel-du-black-friday</link>
      <pubDate>Sat, 15 Nov 2025 10:27:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2865137_ce-tv-qd-mini-led-pro-xxl-de-216-cm-avec-du-144-hz-allm-et-vrr-retire-1-200-e-de-son-prix-de-base-pour-le-prequel-du-black-friday</guid>
      <description>
Le Black Friday joue les prolongations avant l&#8217;heure. Et dans la cat&#233;gorie poids lourd, TCL sort l&#8217;artillerie : 85 pouces de diagonale, et une dalle QD-Mini LED. Le 85C79K passe de 1 599 &#224; 1 299 euros sur Darty et la Fnac, loin des 2 499 euros affich&#233;s &#224; lors de son lancement en avril dernier.
</description>
    </item>
    <item>
      <title>Black Friday : les meilleurs smartphones aux prix les plus int&#233;ressants (Apple, Samsung, Google&#8230;)</title>
      <link>https://www.frandroid.com/bons-plans/2848295_black-friday-smartphones-meme-les-derniers-iphone-dapple-sont-a-prix-casse-dans-ce-top-10-des-meilleures-offres</link>
      <pubDate>Sat, 15 Nov 2025 10:08:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848295_black-friday-smartphones-meme-les-derniers-iphone-dapple-sont-a-prix-casse-dans-ce-top-10-des-meilleures-offres</guid>
      <description>
Cela commence &#224; devenir une tradition chez les e-commer&#231;ants, le Black Friday commence t&#244;t, et m&#234;me tr&#232;s t&#244;t. Depuis deux semaines, les promotions pleuvent sur les Samsung Galaxy, iPhone, Xiaomi et Google Pixel et &#231;a ne se calme pas ! Voici les meilleures offres sur les smartphones premium.
</description>
    </item>
    <item>
      <title>Cyberattaques en France&#160;: les derni&#232;res fuites de donn&#233;es et entreprises touch&#233;es</title>
      <link>https://www.01net.com/actualites/cyberattaques-france-dernieres-fuites-donnees-entreprises-touchees.html</link>
      <pubDate>Sat, 15 Nov 2025 10:03:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1235307</guid>
      <description>Les cyberattaques continuent de se multiplier en France. De nombreuses entreprises se sont retrouv&#233;es dans le viseur des cybercriminels. Ces attaques ont abouti au vol des donn&#233;es personnelles de la plupart des Fran&#231;ais. Ci-dessous, on fait le point sur les derni&#232;res victimes et l'&#233;volution de la situation.</description>
    </item>
    <item>
      <title>&#171;&#160;On r&#232;gle un probl&#232;me pour toute l&#8217;industrie automobile&#160;&#187; : comment Volkswagen et Rivian pourraient r&#233;volutionner les voitures &#233;lectriques concurrentes</title>
      <link>https://www.frandroid.com/marques/rivian/2870329_on-regle-un-probleme-pour-toute-lindustrie-automobile-comment-volkswagen-et-rivian-pourraient-revolutionner-les-voitures-electriques-concurrentes</link>
      <pubDate>Sat, 15 Nov 2025 10:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/rivian/2870329_on-regle-un-probleme-pour-toute-lindustrie-automobile-comment-volkswagen-et-rivian-pourraient-revolutionner-les-voitures-electriques-concurrentes</guid>
      <description>
Rivian, l'un des plus grands concurrents de Tesla, aid&#233; par Volkswagen, pourrait bien r&#233;volutionner les logiciels embarqu&#233;s des voitures &#233;lectriques. L'objectif : devenir le Google de l'automobile, comme Android pour les smartphones.
</description>
    </item>
    <item>
      <title>When Will the US Finally Get $15K EVs?</title>
      <link>https://www.wired.com/story/when-will-the-us-finally-get-dollar15k-evs/</link>
      <pubDate>Sat, 15 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">69132b161ec2ec3613daf21d</guid>
      <description>Super-cheap EVs exist in other parts of the world, as advances in battery tech and manufacturing are making new cars significantly cheaper. But the US market presents unique challenges for automakers.</description>
    </item>
    <item>
      <title>This free image toolbox is the perfect Google Photos power-up</title>
      <link>https://www.fastcompany.com/91437703/online-free-image-software-whiteboard-excalidraw</link>
      <pubDate>2025-11-15T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91437703/online-free-image-software-whiteboard-excalidraw</guid>
      <description>Go beyond the standard image adjustment options with Excalidraw, a fantastic web-based markup machine.
While I&#8217;m happy to extol the powers of the written word, sometimes you need a little something extra to get your point across.</description>
    </item>
    <item>
      <title>3 SeatGuru alternatives for finding the best airline seats</title>
      <link>https://www.fastcompany.com/91438164/seatguru-what-happened-tripadvisor-ai-best-airline-seats-alternatives-airplane-seatlink-seatmap-aerolopa</link>
      <pubDate>2025-11-15T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91438164/seatguru-what-happened-tripadvisor-ai-best-airline-seats-alternatives-airplane-seatlink-seatmap-aerolopa</guid>
      <description>Here&#8217;s why Tripadvisor shuttered the beloved seat-rating site last month, and what to use instead if you want to travel comfortably.
Frequent flyers and travel hackers who visited SeatGuru on October 31 were met with an unpleasant surprise: a shuttered website directing them to Tripadvisor&#8217;s homepage. After nearly a quarter-century in operation, the beloved website that helped fliers determine which seats to grab, and which to avoid, is gone. Here&#8217;s why, and three SeatGuru alternatives to try now....</description>
    </item>
    <item>
      <title>What Ken Burns learned by making &#8216;The American Revolution&#8217;</title>
      <link>https://www.fastcompany.com/91441305/what-ken-burns-learned-by-making-the-american-revolution</link>
      <pubDate>2025-11-15T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91441305/what-ken-burns-learned-by-making-the-american-revolution</guid>
      <description>As he prepares to release his latest series on the Revolutionary War, the filmmaker reflects on the history of the U.S. and his quest for truth.
After a decade in development, legendary documentarian Ken Burns is set to release his long-awaited series, The American Revolution. In the lead up to the premiere, Burns shares key lessons he gleaned from the founding of the United States&#8212;and the parallels between the revolutionary era and today. He also reflects on his admiration for Lin-Manuel Miranda&#8217;s Hamilton, and the obstacles he faces in his ongoing quest for truth....</description>
    </item>
    <item>
      <title>Can AI unlock a new generation of human creativity?</title>
      <link>https://www.fastcompany.com/91441395/can-ai-unlock-a-new-generation-of-human-creativity</link>
      <pubDate>2025-11-15T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91441395/can-ai-unlock-a-new-generation-of-human-creativity</guid>
      <description>Pocket FM CEO and cofounder Rohan Nayak argues that the tech doesn&#8217;t replace artists&#8217; work&#8212;it complements it.
When the camera was invented in 1826, many people thought painting would die. But it&#160;didn&#8217;t. Instead, painters found new ways to express themselves. Painters reinvented expressionism, impressionism, and abstract art. Monet, Munch, and later Picasso, all thrived after the camera arrived.&#160;...</description>
    </item>
    <item>
      <title>5 things we want from the iPhone 18 and iPhone 18 Pro</title>
      <link>https://www.techradar.com/phones/iphone/5-things-we-want-from-the-iphone-18-and-iphone-18-pro</link>
      <pubDate>Sat, 15 Nov 2025 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">zveHrQ4JVT4LFGRM4pEkCC</guid>
      <description>There's a lot Apple could do to make the iPhone 18 series better than the iPhone 17 line, including battery, camera, and AI improvements.</description>
    </item>
  </channel>
</rss>
