<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 29 Jan 2026 10:41:48 GMT</lastBuildDate>
    <item>
      <title>Ce laptop gamer OLED MSI avec Ryzen AI 9 + RTX 5080 est vendu &#224; perte pendant les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2959429_ce-laptop-gamer-oled-msi-avec-ryzen-ai-9-rtx-5080-est-vendu-a-perte-pendant-les-soldes</link>
      <pubDate>Thu, 29 Jan 2026 10:34:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2959429_ce-laptop-gamer-oled-msi-avec-ryzen-ai-9-rtx-5080-est-vendu-a-perte-pendant-les-soldes</guid>
      <description>
La configuration du PC portable MSI Stealth A16 AI+ est tellement solide qu'on s'attend forc&#233;ment &#224; un prix d&#233;mesur&#233;. Pourtant, en cette fin de soldes d'hiver, Cdiscount le propose &#224; 2 999 euros au lieu de 3 848 euros.
</description>
    </item>
    <item>
      <title>Elon Musk Made Tesla Fans Think Unsupervised Robotaxis Had Arrived. They Can&#8217;t Find Them</title>
      <link>https://gizmodo.com/elon-musk-made-tesla-fans-think-unsupervised-robotaxis-had-arrived-they-cant-find-them-2000715299</link>
      <pubDate>Thu, 29 Jan 2026 10:30:26 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715299</guid>
      <description>If you're in Austin and you're trying to ride in a truly driverless Tesla robotaxi, you may be on a wild goose chase.</description>
    </item>
    <item>
      <title>Sony really, really, wants PS4 players to switch to the PS5 &#8212; 'Now's the perfect time to upgrade your PS5 console'</title>
      <link>https://www.techradar.com/gaming/sony-really-really-wants-ps4-players-to-switch-to-the-ps5-nows-the-perfect-time-to-upgrade-your-ps5-console</link>
      <pubDate>Thu, 29 Jan 2026 10:30:21 +0000</pubDate>
      <guid isPermaLink="false">cQP4hvohxd95zDiULWGp7N</guid>
      <description>PS4 users are receiving messages from Sony, encouraging them to upgrade to the PS5, and it could be tied to a PS6 launch delay.</description>
    </item>
    <item>
      <title>Une &#171;&#160;m&#233;connaissance des principes essentiels de s&#233;curit&#233;&#160;&#187; : France Travail devra payer une amende sal&#233;e apr&#232;s le hack de mars 2024</title>
      <link>https://www.01net.com/actualites/une-meconnaissance-des-principes-essentiels-de-securite-france-travail-devra-payer-une-amende-salee-apres-le-hack-de-mars-2024.html</link>
      <pubDate>Thu, 29 Jan 2026 10:24:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323219</guid>
      <description>5 millions d'euros, et des obligations de renforcement de sa cybers&#233;curit&#233; : voici &#224; quoi France Travail vient d'&#234;tre condamn&#233; apr&#232;s la cyberattaque de mars 2024 qui avait concern&#233; pr&#232;s de 37 millions de Fran&#231;ais.</description>
    </item>
    <item>
      <title>Connexion satellite et &#233;cran microLED : Amazfit attaquerait Garmin frontalement avec sa nouvelle T-Rex Ultra 2</title>
      <link>https://www.frandroid.com/marques/amazfit/2959689_connexion-satellite-et-ecran-microled-amazfit-attaquerait-garmin-frontalement-avec-sa-nouvelle-t-rex-ultra-2</link>
      <pubDate>Thu, 29 Jan 2026 10:21:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazfit/2959689_connexion-satellite-et-ecran-microled-amazfit-attaquerait-garmin-frontalement-avec-sa-nouvelle-t-rex-ultra-2</guid>
      <description>
D'apr&#232;s une fuite, Amazfit pourrait lancer tr&#232;s prochainement sa nouvelle montre de sport haut de gamme, l'Amazfit T-Rex Ultra 2. Un mod&#232;le qui viendrait s'attaquer directement &#224; la Garmin Fenix 8 Pro microLED. 
</description>
    </item>
    <item>
      <title>Tesla : la vraie raison du retour des batteries &#171;&#160;maison&#160;&#187; dans son Model Y</title>
      <link>https://www.frandroid.com/marques/tesla/2959451_tesla-la-vraie-raison-du-retour-des-batteries-maison-dans-son-model-y</link>
      <pubDate>Thu, 29 Jan 2026 10:19:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2959451_tesla-la-vraie-raison-du-retour-des-batteries-maison-dans-son-model-y</guid>
      <description>
Si Tesla avait abandonn&#233; la production de sa Model Y dot&#233;e de ses cellules 4680, le constructeur change encore de strat&#233;gie. La voiture &#233;lectrique y a &#224; nouveau droit, pour une raison tr&#232;s simple.
</description>
    </item>
    <item>
      <title>Google Pixel : une faille critique supprime une fonctionnalit&#233; historique</title>
      <link>https://www.frandroid.com/marques/google/2959719_google-pixel-une-faille-critique-supprime-une-fonctionnalite-historique</link>
      <pubDate>Thu, 29 Jan 2026 10:18:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2959719_google-pixel-une-faille-critique-supprime-une-fonctionnalite-historique</guid>
      <description>
Google a pris la d&#233;cision radicale de d&#233;sactiver la fonctionnalit&#233; &#171; Prendre un message &#187; sur ses Pixel 4 et Pixel 5. En cause, une faille de s&#233;curit&#233; majeure qui transforme cette option en un v&#233;ritable espion de poche.
</description>
    </item>
    <item>
      <title>Need to keep your home office warm and toasty? I can't live without this Dreo heater - and it's currently cheaper than ever</title>
      <link>https://www.techradar.com/pro/need-to-keep-your-home-office-warm-and-toasty-i-cant-live-without-this-dreo-heater-and-its-currently-cheaper-than-ever</link>
      <pubDate>Thu, 29 Jan 2026 10:13:50 +0000</pubDate>
      <guid isPermaLink="false">BbALFnnUqc9bUKKV87n6MS</guid>
      <description>The Dreo Solaris 718 space heater is proving invaluable for me right now - and it's currently cheaper than ever,</description>
    </item>
    <item>
      <title>9 millions d&#8217;Android compromis&#160;: Google d&#233;mant&#232;le l&#8217;un des plus grands r&#233;seaux pirates du monde</title>
      <link>https://www.01net.com/actualites/cyberattaque-android-google-demantele-lun-des-plus-grands-reseaux-pirates-du-monde.html</link>
      <pubDate>Thu, 29 Jan 2026 10:11:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323189</guid>
      <description>Google vient de neutraliser Ipidea, un g&#233;ant chinois des proxys r&#233;sidentiels. Accus&#233; d&#8217;avoir enr&#244;l&#233; en douce des millions de smartphones, PC et TV connect&#233;es pour les louer &#224; des cybercriminels, le groupe chinois est aussi impliqu&#233; dans la cr&#233;ation de plusieurs botnets d'envergure. Google indique avoir lib&#233;r&#233; environ 9 millions d&#8217;appareils Android au cours de l'op&#233;ration....</description>
    </item>
    <item>
      <title>Malgr&#233; les critiques, Windows 11 franchit un cap historique, bien devant Windows 10</title>
      <link>https://www.frandroid.com/marques/microsoft/2959563_malgre-les-critiques-windows-11-franchit-un-cap-historique-bien-devant-windows-10</link>
      <pubDate>Thu, 29 Jan 2026 10:05:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2959563_malgre-les-critiques-windows-11-franchit-un-cap-historique-bien-devant-windows-10</guid>
      <description>
Windows 11 a atteint le milliard d'utilisateurs plus rapidement que Windows 10. Un succ&#232;s dont se f&#233;licite grandement Microsoft malgr&#233; les critiques faites &#224; son OS.
</description>
    </item>
    <item>
      <title>The best ereaders for 2026</title>
      <link>https://www.engadget.com/mobile/tablets/best-ereader-130013808.html?src=rss</link>
      <pubDate>Thu, 29 Jan 2026 10:01:26 +0000</pubDate>
      <guid isPermaLink="false">51dccbcd-ac65-4fc0-99d3-6d9cd389acb1</guid>
      <description>Color is the buzziest feature in ereaders right now, but is it necessary? It makes the covers more fun, and readers of comics and graphic novels will appreciate the added hues (though they may be happier with an E Ink tablet for better image detail). Color is just one factor to consider when picking out the best ereader. The lights, screen quality, housing and buttons make a difference too. Then there&#8217;s the software: Do you want to stay in the Kindle ecosystem or get a device that can handle lots of apps? We tested more than a dozen ereaders to come up with our recommendations. This guide also...</description>
    </item>
    <item>
      <title>Microsoft&#8217;s AI Spend Is Starting To Spook Investors</title>
      <link>https://gizmodo.com/microsofts-ai-spend-is-starting-to-spook-investors-2000715208</link>
      <pubDate>Thu, 29 Jan 2026 10:00:56 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715208</guid>
      <description>Microsoft showed record spending but slowing cloud growth and a big reliance on OpenAI</description>
    </item>
    <item>
      <title>Vous ne devinerez jamais sur quoi se base le nouveau plan de Mark Zuckerberg pour d&#233;velopper ses r&#233;seaux</title>
      <link>https://www.frandroid.com/marques/meta/2959285_vous-ne-devinerez-jamais-sur-quoi-se-base-le-nouveau-plan-de-mark-zuckerberg-pour-developper-ses-reseaux</link>
      <pubDate>Thu, 29 Jan 2026 09:54:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2959285_vous-ne-devinerez-jamais-sur-quoi-se-base-le-nouveau-plan-de-mark-zuckerberg-pour-developper-ses-reseaux</guid>
      <description>
Le m&#233;tavers semble loin dans l&#8217;esprit de Mark Zuckerberg. Le patron de Meta affiche une nouvelle vision strat&#233;gique en misant sur l&#8217;intelligence artificielle comme levier de croissance.
</description>
    </item>
    <item>
      <title>Nintendo Switch 2 en f&#233;vrier 2026 : l&#8217;une des plus grandes sagas du jeu d&#8217;horreur arrive ! Voici les jeux &#224; ne pas manquer</title>
      <link>https://www.frandroid.com/marques/nintendo/2959397_nintendo-switch-2-en-fevrier-2026-lune-des-plus-grandes-sagas-du-jeu-dhorreur-arrive-voici-les-jeux-a-ne-pas-manquer</link>
      <pubDate>Thu, 29 Jan 2026 09:48:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nintendo/2959397_nintendo-switch-2-en-fevrier-2026-lune-des-plus-grandes-sagas-du-jeu-dhorreur-arrive-voici-les-jeux-a-ne-pas-manquer</guid>
      <description>
Fans de Nintendo et de Resident Evil ? L'heure est venue de retrouver les derniers jeux de la saga horrifique de Capcom sur la Nintendo Switch 2 dont le tr&#232;s attendu Requiem. Pour ceux moins adeptes des jeux d'horreur, il y a la version remasteris&#233;e de Dragon Quest VII.
</description>
    </item>
    <item>
      <title>Encore plus d&#8217;autonomie et une charge en 12 minutes&#160;: la nouvelle Xpeng X9 &#233;lectrique frappe tr&#232;s fort</title>
      <link>https://www.frandroid.com/marques/xpeng/2959363_encore-plus-dautonomie-et-une-charge-en-12-minutes-la-nouvelle-xpeng-x9-electrique-frappe-tres-fort</link>
      <pubDate>Thu, 29 Jan 2026 09:47:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2959363_encore-plus-dautonomie-et-une-charge-en-12-minutes-la-nouvelle-xpeng-x9-electrique-frappe-tres-fort</guid>
      <description>
D&#233;voil&#233; en 2024, le Xpeng X9 s&#8217;offre une nouvelle version qui &#233;volue sur plusieurs points. La voiture &#233;lectrique familiale revoit son autonomie &#224; la hausse et n&#8217;a besoin que de 12 minutes pour se recharger. Reste &#224; savoir quand elle arrivera en Europe.
</description>
    </item>
    <item>
      <title>Une trottinette &#233;lectrique Xiaomi &#224; moins de 300 &#8364;, c&#8217;est aussi &#231;a la magie des soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2953109_une-trottinette-electrique-xiaomi-a-moins-de-300-e-cest-aussi-ca-la-magie-des-soldes-dhiver</link>
      <pubDate>Thu, 29 Jan 2026 09:46:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2953109_une-trottinette-electrique-xiaomi-a-moins-de-300-e-cest-aussi-ca-la-magie-des-soldes-dhiver</guid>
      <description>
La Xiaomi Electric Scooter 4 n'est pas la plus jeune du catalogue de la marque chinoise, mais elle a l'avantage d'&#234;tre toujours aussi agr&#233;able en ville, et surtout bien moins ch&#232;re qu'&#224; sa sortie. Pendant les soldes d'hiver 2026, Darty l'affiche &#224; 279,99 euros au lieu de 402,99 euros.
</description>
    </item>
    <item>
      <title>Smartphones plus fins, nouveaux pliants, lunettes AR&#160;: voici ce que pr&#233;pare Samsung pour 2026</title>
      <link>https://www.01net.com/actualites/smartphones-plus-fins-nouveaux-pliants-lunettes-ar-ce-que-prepare-samsung-2026.html</link>
      <pubDate>Thu, 29 Jan 2026 09:45:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323175</guid>
      <description>Samsung d&#233;voile une feuille de route ambitieuse pour 2026 avec pas mal de nouveaut&#233;s au programme.</description>
    </item>
    <item>
      <title>Face aux vols, cette grande enseigne am&#233;ricaine d&#233;pouille ses PC en exposition de leurs barrettes de RAM</title>
      <link>https://www.frandroid.com/produits-android/hardware/memoire/2959409_face-aux-vols-cette-grande-enseigne-americaine-depouille-ses-pc-en-exposition-de-leurs-barrettes-de-ram</link>
      <pubDate>Thu, 29 Jan 2026 09:44:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/memoire/2959409_face-aux-vols-cette-grande-enseigne-americaine-depouille-ses-pc-en-exposition-de-leurs-barrettes-de-ram</guid>
      <description>
Devenue tr&#232;s co&#251;teuse, la m&#233;moire vive fait l'objet d'une recrudescence de vols dans certains magasins distribuant des produits informatiques. Confront&#233;e au probl&#232;me, l'enseigne am&#233;ricaine Costco semble avoir pris une mesure radicale.
</description>
    </item>
    <item>
      <title>Immatriculation, permis, taxe &#224; 50 dollars : le r&#234;ve du VAE est-il en train de d&#233;railler aux &#201;tats-Unis ?</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2959515_immatriculation-permis-taxe-a-50-dollars-le-reve-du-vae-est-il-en-train-de-derailler-aux-etats-unis</link>
      <pubDate>Thu, 29 Jan 2026 09:44:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2959515_immatriculation-permis-taxe-a-50-dollars-le-reve-du-vae-est-il-en-train-de-derailler-aux-etats-unis</guid>
      <description>
Aux &#201;tats-Unis, plusieurs &#201;tats revoient en profondeur leur r&#233;glementation sur les v&#233;los &#233;lectriques. Entre obligations d&#8217;immatriculation, assurances et nouvelles taxes, ces projets de loi interrogent directement les conditions d&#8217;acc&#232;s et d&#8217;usage du v&#233;lo &#233;lectrique.
</description>
    </item>
    <item>
      <title>Cr&#233;er des clients &#171; pour toute la vie &#187; : voici le plan de Google avec les Chromebook &#224; l&#8217;&#233;cole</title>
      <link>https://www.frandroid.com/marques/google/2959381_creer-des-clients-pour-toute-la-vie-voici-le-plan-de-google-avec-les-chromebook-a-lecole</link>
      <pubDate>Thu, 29 Jan 2026 09:42:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2959381_creer-des-clients-pour-toute-la-vie-voici-le-plan-de-google-avec-les-chromebook-a-lecole</guid>
      <description>
Alors que Google tente d&#8217;imposer ses Chromebook dans les salles de classe partout sur le globe, l&#8217;intention derri&#232;re cette initiative pourrait &#234;tre bien plus autocentr&#233;e que pr&#233;vu selon de r&#233;cents documents.
</description>
    </item>
    <item>
      <title>This robot snow blower is trending &#8212; and its $400 off right now at Amazon</title>
      <link>https://mashable.com/article/jan-27-yarbo-robot-snow-blower</link>
      <pubDate>Thu, 29 Jan 2026 09:41:25 +0000</pubDate>
      <guid isPermaLink="false">05ue5GBdARhxaX5Zn2HvLFC</guid>
      <description>The Yarbo Snow Blower Robot will clear your driveway, walkway, and yard of snow so you never have to shovel again.</description>
    </item>
    <item>
      <title>Clawdbot users are snapping up the Mac Mini &#8212; buy now for under $550 at Amazon</title>
      <link>https://mashable.com/article/jan-28-apple-mac-mini-deal</link>
      <pubDate>Thu, 29 Jan 2026 09:37:46 +0000</pubDate>
      <guid isPermaLink="false">06uSgcPuSkch3GbcvSpHI0K</guid>
      <description>The M4 Mac Mini is on sale at Amazon for $549, down from the normal price of $599.</description>
    </item>
    <item>
      <title>Duda's new feature tackles the biggest issues of AI-generated websites</title>
      <link>https://www.techradar.com/pro/website-building/dudas-new-feature-tackles-the-biggest-issues-of-ai-generated-websites</link>
      <pubDate>Thu, 29 Jan 2026 09:32:11 +0000</pubDate>
      <guid isPermaLink="false">EWVoS8ZpKoBYMND8iGkAnc</guid>
      <description>"Populate Template with AI" is Duda's take on repetitive content and poorly optimized sites.</description>
    </item>
    <item>
      <title>Le pari r&#233;ussi de Volkswagen gr&#226;ce &#224; la Chine : une voiture &#233;lectrique cr&#233;&#233;e &#224; la vitesse de l&#8217;&#233;clair avec Xpeng</title>
      <link>https://www.frandroid.com/marques/volkswagen/2959343_le-pari-reussi-de-volkswagen-grace-a-la-chine-une-voiture-electrique-creee-a-la-vitesse-de-leclair-avec-xpeng</link>
      <pubDate>Thu, 29 Jan 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2959343_le-pari-reussi-de-volkswagen-grace-a-la-chine-une-voiture-electrique-creee-a-la-vitesse-de-leclair-avec-xpeng</guid>
      <description>
La premi&#232;re voiture &#233;lectrique de Volkswagen con&#231;ue avec Xpeng vient de sortir d'usine, 18 mois apr&#232;s le d&#233;but du d&#233;veloppement. L'ID. Unyx 07 inaugure une nouvelle g&#233;n&#233;ration faite &#171; par et pour la Chine &#187;, qui doit permettre &#224; Volkswagen de regagner des parts de march&#233;.
</description>
    </item>
    <item>
      <title>How to watch Pegula vs. Rybakina online for free</title>
      <link>https://mashable.com/article/pegula-rybakina-australian-open-2026-live-stream-for-free</link>
      <pubDate>Thu, 29 Jan 2026 09:28:08 +0000</pubDate>
      <guid isPermaLink="false">04BE5lXNnx58uY2r4DCUyzy</guid>
      <description>Watch Australian Open for free. Live stream Pegula vs. Rybakina in the 2026 Australian Open online for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Amazon liquide une avalanche de produits Tech juste avant la fin des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2933045_amazon-casse-les-prix-a-la-derniere-demarque-voici-les-promos-a-ne-pas-louper-avant-la-fin-des-soldes</link>
      <pubDate>Thu, 29 Jan 2026 09:27:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933045_amazon-casse-les-prix-a-la-derniere-demarque-voici-les-promos-a-ne-pas-louper-avant-la-fin-des-soldes</guid>
      <description>
Les soldes d&#8217;hiver touchent bient&#244;t &#224; leur fin, mais il reste encore quelques jours pour profiter des derni&#232;res offres Amazon. Pour vous aider &#224; ne rien manquer, nous avons s&#233;lectionn&#233; les meilleures promotions Tech &#224; saisir avant la cl&#244;ture de l&#8217;&#233;v&#233;nement.
</description>
    </item>
    <item>
      <title>Leaked photos suggest the Samsung Galaxy S26 could be missing a major rumored upgrade</title>
      <link>https://www.techradar.com/phones/samsung-galaxy-phones/leaked-photos-suggest-the-samsung-galaxy-s26-could-be-missing-a-major-rumored-upgrade</link>
      <pubDate>Thu, 29 Jan 2026 09:26:35 +0000</pubDate>
      <guid isPermaLink="false">jMuaX4C42qk8E7kjmWu47Q</guid>
      <description>It now looks likely that the Samsung Galaxy S26 series won't have magnets built in, but it could at least get a charging power boost.</description>
    </item>
    <item>
      <title>Mashable will send the best deals directly to your phone daily &#8212; how it works</title>
      <link>https://mashable.com/article/text-best-daily-deals-for-free</link>
      <pubDate>Thu, 29 Jan 2026 09:24:46 +0000</pubDate>
      <guid isPermaLink="false">01vEnaTpVXJ99OFhwqLVvXy</guid>
      <description>Get access to the best daily deals for free as a Mashable text subscriber.</description>
    </item>
    <item>
      <title>Face &#224; l&#8217;explosion des cyberattaques, la France change de strat&#233;gie</title>
      <link>https://www.01net.com/actualites/face-a-lexplosion-des-cyberattaques-la-france-change-de-strategie.html</link>
      <pubDate>Thu, 29 Jan 2026 09:13:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323034</guid>
      <description>Faire monter le niveau g&#233;n&#233;ral de la population sur la cybers&#233;curit&#233;, lancer un label pour les PME, cr&#233;er un observatoire des cyberattaques... Le gouvernement pr&#233;sente ce jeudi 29 janvier sa nouvelle strat&#233;gie pour contrer les attaques informatiques et les tentatives d'ing&#233;rence qui touchent autant les particuliers que les structures priv&#233;es et publiques....</description>
    </item>
    <item>
      <title>Les meilleures tablettes tactiles en 2026, du premier prix au haut de gamme</title>
      <link>https://www.frandroid.com/guide-dachat/guide-tablettes/320702_guide-dachat-tablette-choisir-noel</link>
      <pubDate>Thu, 29 Jan 2026 09:12:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-tablettes/320702_guide-dachat-tablette-choisir-noel</guid>
      <description>
La bonne vieille tablette tactile trouve toujours sa place dans nos foyers. Pour savoir laquelle choisir, de la petite tablette pas ch&#232;re aux iPad Pro les plus puissants, vous &#234;tes au bon endroit. Voici notre s&#233;lection des meilleures tablettes du march&#233;. 
</description>
    </item>
    <item>
      <title>'We have some exciting news to share' &#8212; Wordle will enter new era next week with 'magical' change that will completely shake up the game, and it's much needed</title>
      <link>https://www.techradar.com/gaming/we-have-some-exciting-news-to-share-wordle-will-enter-new-era-next-week-with-magical-change-that-will-completely-shake-up-the-game-and-its-much-needed</link>
      <pubDate>Thu, 29 Jan 2026 09:06:34 +0000</pubDate>
      <guid isPermaLink="false">QNXCTtcHeCKdcZEWbUym4Q</guid>
      <description>Wordle is about to start repeating answers &#8211; here's why it's doing it, and why I'm delighted.</description>
    </item>
    <item>
      <title>This is how Gen Z is rewriting the parenting playbook at work</title>
      <link>https://www.fastcompany.com/91478884/how-gen-z-is-rewriting-the-parenting-playbook-at-work</link>
      <pubDate>2026-01-29T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91478884/how-gen-z-is-rewriting-the-parenting-playbook-at-work</guid>
      <description>Family life is a priority rather than a source of guilt. Instead of asking, &#8216;How do I survive this?&#8217; they&#8217;re asking, &#8216;Why is the system built this way?&#8217; That shift in mindset could potentially change everything.
Let me set a scene for you: A manager at a tech company pings his team at 6:01 p.m., asking for a &#8220;quick favor before morning?&#8221;</description>
    </item>
    <item>
      <title>Voici comment un imposteur a r&#233;ussi &#224; prendre les commandes d&#8217;Airbus A320</title>
      <link>https://www.futura-sciences.com/sciences/actualites/avion-voici-imposteur-reussi-prendre-commandes-airbus-a320-k2m6-130512/#xtor%3DRSS-8</link>
      <pubDate>Thu, 29 Jan 2026 10:00:00 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/avion-voici-imposteur-reussi-prendre-commandes-airbus-a320-k2m6-130512/#xtor%3DRSS-8</guid>
      <description>En Europe, un pilote sans les qualifications requises a pris les commandes d'Airbus A320 pendant plusieurs mois avant que la supercherie ne soit d&#233;couverte. Comment une telle falsification a-t-elle pu tromper les syst&#232;mes de contr&#244;le d'une compagnie a&#233;rienne ? Cette affaire r&#233;v&#233;l&#233;e en novembre...</description>
    </item>
    <item>
      <title>Malgr&#233; le &#171;&#160;succ&#232;s&#160;&#187; de Windows 11, Windows 10 ne veut pas mourir</title>
      <link>https://www.01net.com/actualites/malgre-le-succes-de-windows-11-windows-10-ne-veut-pas-mourir.html</link>
      <pubDate>Thu, 29 Jan 2026 08:52:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323192</guid>
      <description>Windows 11 vient de franchir la barre symbolique du milliard d&#8217;utilisateurs. Mais paradoxalement, le syst&#232;me d'exploitation de Microsoft a perdu des parts de march&#233; au profit de Windows 10 depuis la fin officielle du support de celui-ci.</description>
    </item>
  </channel>
</rss>
