<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 22 Feb 2026 10:31:02 GMT</lastBuildDate>
    <item>
      <title>Bon plan Arlo : la cam&#233;ra Floodlight 2K avec projecteurs perd 60 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2983225_bon-plan-arlo-la-camera-floodlight-2k-avec-projecteurs-perd-60-e</link>
      <pubDate>Sun, 22 Feb 2026 10:25:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2983225_bon-plan-arlo-la-camera-floodlight-2k-avec-projecteurs-perd-60-e</guid>
      <description>
L'Arlo Floodlight est une cam&#233;ra de surveillance ext&#233;rieure filaire qui non seulement filme en 2K, mais propose aussi deux vid&#233;oprojecteurs puissants pour &#233;clairer et dissuader, &#224; 139,99 euros au lieu de 199,99 euros.
</description>
    </item>
    <item>
      <title>Here's a sneaky way to watch the A Knight of the Seven Kingdoms finale for free</title>
      <link>https://www.techradar.com/how-to-watch/heres-a-sneaky-way-to-watch-the-a-knight-of-the-seven-kingdoms-finale-for-free</link>
      <pubDate>Sun, 22 Feb 2026 10:10:00 +0000</pubDate>
      <guid isPermaLink="false">ASL8GmkDw5iCYbbjEwHAEE</guid>
      <description>Here's how to watch YouTube ad-free from anywhere in the world, without coughing up for a Premium subscription.</description>
    </item>
    <item>
      <title>Flock Cameras Have a People-Love-Smashing-Them Problem</title>
      <link>https://gizmodo.com/flock-cameras-have-a-people-love-smashing-them-problem-2000725063</link>
      <pubDate>Sun, 22 Feb 2026 10:00:23 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000725063</guid>
      <description>People just aren't being very nice to these mass surveillance devices.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs vid&#233;oprojecteurs pas chers &#224; choisir en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/1978676_quels-sont-les-meilleurs-videoprojecteurs-pas-chers-en-2024</link>
      <pubDate>Sun, 22 Feb 2026 10:00:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1978676_quels-sont-les-meilleurs-videoprojecteurs-pas-chers-en-2024</guid>
      <description>
Envie d'un vid&#233;oprojecteur, mais vous constatez que les prix s'envolent vite ? Pas de souci, voici six mod&#232;les de vid&#233;oprojecteurs pas chers, &#224; moins de 600 euros, avec les meilleurs rapports qualit&#233;/prix actuellement.
</description>
    </item>
    <item>
      <title>How to View the &#8216;Blood Moon&#8217; Total Lunar Eclipse on March 3</title>
      <link>https://www.wired.com/story/how-to-view-the-blood-moon-total-lunar-eclipse-on-march-3/</link>
      <pubDate>Sun, 22 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">699872691000ec039efd25b2</guid>
      <description>Next month, the Earth will come between the sun and the moon, causing the moon to take on an eerie reddish hue.</description>
    </item>
    <item>
      <title>Best Electric Toothbrush, Backed by Real-Life Testing (2026)</title>
      <link>https://www.wired.com/story/the-best-electric-toothbrush-for-healthier-teeth-and-gums/</link>
      <pubDate>Sun, 22 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">698b6dd7946803254653e9ad</guid>
      <description>How to choose a toothbrush that protects your smile and gum health.</description>
    </item>
    <item>
      <title>&#171;&#160;Hey Plex &#187;, Samsung ajoute cette intelligence artificielle sur ses Galaxy S26 pour concurrencer Google Gemini</title>
      <link>https://www.frandroid.com/marques/2985553_hey-plex-samsung-ajoute-cette-intelligence-artificielle-sur-ses-galaxy-s26-pour-concurrencer-google-gemini</link>
      <pubDate>Sun, 22 Feb 2026 09:43:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2985553_hey-plex-samsung-ajoute-cette-intelligence-artificielle-sur-ses-galaxy-s26-pour-concurrencer-google-gemini</guid>
      <description>
Vous utilisez combien d'IA par jour ? Selon Samsung, 8 utilisateurs sur 10 en jonglent d&#233;j&#224; avec deux ou plus. Pour simplifier ce chaos, le g&#233;ant d&#233;ploie une int&#233;gration profonde de Perplexity au sein de One UI. L'id&#233;e ? Ne plus switcher d'application, mais laisser le syst&#232;me piloter vos requ&#234;tes.
</description>
    </item>
    <item>
      <title>How to watch India vs South Africa: Free Streams, TV Channels &amp; Preview for T20 World Cup 2026 match</title>
      <link>https://www.techradar.com/how-to-watch/cricket/india-vs-south-africa-t20-world-cup-2026-free</link>
      <pubDate>Sun, 22 Feb 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">EfX2Wt9xzZCtvjQCw4yBt7</guid>
      <description>Here's how to watch India vs South Africa T20 World Cup streams as two heavyweights collide in high-stakes Super 8 action.</description>
    </item>
    <item>
      <title>To protect their businesses, corporate leaders need to speak out about the events in Minnesota and beyond</title>
      <link>https://www.fastcompany.com/91495660/protect-their-businesses-corporate-leaders-need-to-speak-out-about-the-events-in-minnesota-and-beyond</link>
      <pubDate>2026-02-22T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91495660/protect-their-businesses-corporate-leaders-need-to-speak-out-about-the-events-in-minnesota-and-beyond</guid>
      <description>Good corporate stewardship requires more than just operating a business and managing a balance sheet. It requires being effective leaders of your community.
Corporate leaders today are stuck between a rock and a hard place. Nobody can see events playing out in the streets in Minnesota and elsewhere and not be moved in some way. At the same time, they have a fiduciary responsibility to act in the best interests of their stakeholders, regardless of their personal feelings.&#160;...</description>
    </item>
    <item>
      <title>Avis Mullvad VPN en 2026 : Le VPN qui se rapproche le plus du vrai anonymat en ligne, mais &#224; quel prix ?</title>
      <link>https://www.frandroid.com/services/vpn/2975371_avis-mullvad-vpn</link>
      <pubDate>Sun, 22 Feb 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/vpn/2975371_avis-mullvad-vpn</guid>
      <description>
Dans le monde des VPN, Mullvad est un peu le discret de la bande, l'homme de l'ombre qui fait bien son travail et dispara&#238;t sans un mot, et c'est plut&#244;t bon signe dans ce milieu. Cela n'emp&#234;che pas non plus le VPN su&#233;dois de se tailler une r&#233;putation d'ayatollah de la protection des donn&#233;es. Voici ce que nous en pensons dans ce test.
</description>
    </item>
    <item>
      <title>Bient&#244;t le clap de fin pour la Dacia Spring &#233;lectrique : voici la voiture qui la remplacera sur les lignes de production chinoises</title>
      <link>https://www.frandroid.com/marques/dacia/2985431_bientot-le-clap-de-fin-pour-la-dacia-spring-electrique-voici-la-voiture-qui-la-remplacera-sur-les-lignes-de-production-chinoises</link>
      <pubDate>Sun, 22 Feb 2026 09:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dacia/2985431_bientot-le-clap-de-fin-pour-la-dacia-spring-electrique-voici-la-voiture-qui-la-remplacera-sur-les-lignes-de-production-chinoises</guid>
      <description>
La Dacia Spring telle que nous la connaissons s'appr&#234;te &#224; faire ses adieux. Pour la remplacer sur ses lignes de production chinoises, le constructeur roumain pr&#233;pare un projet radical : le Dacia Hipster. Un micro-v&#233;hicule &#233;lectrique &#224; moins de 15 000 euros qui pourrait voir le jour fin 2027.
</description>
    </item>
    <item>
      <title>Move over, Apple: Meet the alternative app stores available in the EU and elsewhere</title>
      <link>https://techcrunch.com/2026/02/22/move-over-apple-meet-the-alternative-app-stores-available-in-the-eu-and-elsewhere/</link>
      <pubDate>Sun, 22 Feb 2026 09:00:21 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=2838099</guid>
      <description>A list of some of the alternative app stores iPhone users in the EU can try today.</description>
    </item>
    <item>
      <title>Why the greatest risk of AI in higher education is the erosion of learning</title>
      <link>https://www.fastcompany.com/91495498/why-the-greatest-risk-of-ai-in-higher-education-is-the-erosion-of-learning</link>
      <pubDate>2026-02-22T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91495498/why-the-greatest-risk-of-ai-in-higher-education-is-the-erosion-of-learning</guid>
      <description>As machines become more capable of doing the labor of research and learning, what happens to higher education? What purpose does the university serve?
Public debate about artificial intelligence in higher education has largely orbited a familiar worry: cheating. Will students use chatbots to write essays? Can instructors tell? Should universities ban the tech? Embrace it?...</description>
    </item>
    <item>
      <title>Bon plan : le pack Samsung Galaxy A56 et la montre Fit 3 chute &#224; 419 euros</title>
      <link>https://www.frandroid.com/bons-plans/2982853_bon-plan-le-pack-samsung-galaxy-a56-et-la-montre-fit-3-chute-a-419-euros</link>
      <pubDate>Sun, 22 Feb 2026 08:34:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2982853_bon-plan-le-pack-samsung-galaxy-a56-et-la-montre-fit-3-chute-a-419-euros</guid>
      <description>
Derri&#232;re la gamme des Galaxy S, les Galaxy A ont trouv&#233; leur place sur le march&#233; du milieu de gamme gr&#226;ce &#224; des smartphones offrant des performances correctes au quotidien. Boulanger l'accompagne de la montre connect&#233;e, la Samsung Galaxy Fit 3 et l'ensemble chute &#224; 419 euros.
</description>
    </item>
  </channel>
</rss>
