<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 31 Dec 2025 12:52:35 GMT</lastBuildDate>
    <item>
      <title>Microsoft in 2025: year in review</title>
      <link>https://www.techradar.com/computing/windows/microsoft-in-2025-year-in-review</link>
      <pubDate>Wed, 31 Dec 2025 12:45:00 +0000</pubDate>
      <guid isPermaLink="false">uBKvK5hHARQFhhMu7rWyg</guid>
      <description>Microsoft doubled-down on AI this year, and the resulting backlash marked one of the biggest stumbles for the company.</description>
    </item>
    <item>
      <title>Ce grand t&#233;l&#233;viseur de 75&#8243; QLED sign&#233; Xiaomi avec du Dolby Audio, HDR10+ et du 120 Hz pour le jeu perd plus de 300 &#8364; de son prix</title>
      <link>https://www.frandroid.com/bons-plans/2924215_ce-grand-televiseur-de-75-qled-signe-xiaomi-avec-du-dolby-audio-hdr10-et-du-120-hz-pour-le-jeu-perd-plus-de-300-e-de-son-prix</link>
      <pubDate>Wed, 31 Dec 2025 12:41:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2924215_ce-grand-televiseur-de-75-qled-signe-xiaomi-avec-du-dolby-audio-hdr10-et-du-120-hz-pour-le-jeu-perd-plus-de-300-e-de-son-prix</guid>
      <description>
Si l&#8217;envie d&#8217;agrandir s&#233;rieusement l&#8217;&#233;cran qui rythme vos soir&#233;es se fait sentir sans faire exploser le budget, le Xiaomi QLED A Pro 75" coche beaucoup de cases. Une fiche technique solide, une dalle de qualit&#233; et un tarif qui fait mal &#224; la concurrence : 639 euros sur PC Componentes, contre 999 euros &#224; son lancement.
</description>
    </item>
    <item>
      <title>Factor Meal Delivery Promo: Free $200 Withings Body-Scan Scale</title>
      <link>https://www.wired.com/story/factor-withings-deal/</link>
      <pubDate>Wed, 31 Dec 2025 12:31:00 +0000</pubDate>
      <guid isPermaLink="false">6949ad42d9e065212f7d60cb</guid>
      <description>Factor meal kits offer a free $200 Withings body-scanning scale after a three-week subscription. I was afraid, then maybe a little motivated?</description>
    </item>
    <item>
      <title>The Samsung Galaxy S26 design may have leaked in a new hands-on video &#8212; with a price hike also rumored</title>
      <link>https://www.techradar.com/phones/samsung-galaxy-phones/the-samsung-galaxy-s26-design-may-have-leaked-in-a-new-hands-on-video-with-a-price-hike-also-rumored</link>
      <pubDate>Wed, 31 Dec 2025 12:30:00 +0000</pubDate>
      <guid isPermaLink="false">ia3LKRmQxyuWPRSVrJWziT</guid>
      <description>We've got some fresh leaks around the Galaxy S26 handsets, which are expected around February time.</description>
    </item>
    <item>
      <title>The Best Over-the-Counter Sleep Aids (2025), Tested and Reviewed</title>
      <link>https://www.wired.com/gallery/best-over-the-counter-sleep-aid/</link>
      <pubDate>Wed, 31 Dec 2025 12:08:00 +0000</pubDate>
      <guid isPermaLink="false">66db752b667dbf063f229510</guid>
      <description>I tested an array of alternative sleep aids, from gummies to wearable patches, to see if they would help my chronic insomnia.</description>
    </item>
    <item>
      <title>2025 Was the Year AI Slopified All Our Gadgets</title>
      <link>https://gizmodo.com/2025-was-the-year-ai-slopified-all-our-gadgets-2000704461</link>
      <pubDate>Wed, 31 Dec 2025 12:00:22 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000704461</guid>
      <description>"Slop" was the word of the year, and it's not just AI-generated images we have to groan about.</description>
    </item>
    <item>
      <title>From 'Dick Clark's New Year's Rockin' Eve' to 'Nashville's Big Bash,' here's how to watch this year's biggest New Year's Eve TV specials</title>
      <link>https://www.engadget.com/entertainment/streaming/from-dick-clarks-new-years-rockin-eve-to-nashvilles-big-bash-heres-how-to-watch-this-years-biggest-new-years-eve-tv-specials-120016871.html?src=rss</link>
      <pubDate>Wed, 31 Dec 2025 12:00:16 +0000</pubDate>
      <guid isPermaLink="false">a64fbe75-4a17-4e24-883f-a7978d76058f</guid>
      <description>


  Here are some of this year's biggest, most star-studded TV specials you can watch to help you ring in 2026. (CHARLY TRIBALLEAU / AFP via Getty Images)
 

  CHARLY TRIBALLEAU via Getty Images
 

This year, it seems like there are more ways than ever to celebrate New Year's Eve... from the comfort of your couch, that is. Whether you want to catch the enduring Dick Clark's New Year's Rockin' Eve hosted by Ryan Seacrest and filmed live out of Times Square in New York City, or check out of one the many other live specials filled with music performances, comedy and celebrity guests, you've got ...</description>
    </item>
    <item>
      <title>Poor Sleep Quality Accelerates Brain Aging</title>
      <link>https://www.wired.com/story/poor-sleep-quality-accelerates-brain-aging/</link>
      <pubDate>Wed, 31 Dec 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">69459059e1786614c923cb69</guid>
      <description>Research shows that people who sleep poorly tend to have brain age that is older than their actual age. Chronic inflammation in the body caused by poor sleep likely plays a part.</description>
    </item>
    <item>
      <title>Spartacus: House of Ashur episode 6 is delayed &#8212; here's when you can stream it on Starz</title>
      <link>https://www.techradar.com/streaming/entertainment/spartacus-house-of-ashur-episode-6-release-date-time-starz</link>
      <pubDate>Wed, 31 Dec 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">DwiaZXy6HrorBVWDH3qtdY</guid>
      <description>Caesar has shifted something in Ashur, and hopefully, we'll see the consequences in Spartacus: House of Ashur episode 6.</description>
    </item>
    <item>
      <title>Bo&#238;te de r&#233;ception | Un Excel gratuit, la tablette ou le PC, l&#8217;authentification gouvernementale</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-12-31/boite-de-reception/un-excel-gratuit-la-tablette-ou-le-pc-l-authentification-gouvernementale.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 31 Dec 2025 07:00:00 -0500</pubDate>
      <guid isPermaLink="false">d38236f4f1e23473b66bfc2ecd162088</guid>
      <description>Chaque mercredi, notre journaliste r&#233;pond &#224; vos questions en lien avec le num&#233;rique et les nouvelles technologies. Cette semaine, on cherche un tableur gratuit, on compare une tablette &#224; un PC et on scrute la s&#233;curit&#233; du service gouvernemental d&#8217;authentification.</description>
    </item>
    <item>
      <title>iOS 27&#160;: sept nouveaut&#233;s qui pourraient arriver sur votre iPhone en 2026</title>
      <link>https://www.01net.com/actualites/ios-27-sept-nouveautes-pourraient-arriver-iphone-2026.html</link>
      <pubDate>Wed, 31 Dec 2025 11:48:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317745</guid>
      <description>iOS 27 s&#8217;annonce comme une mise &#224; jour importante, articul&#233;e autour de l&#8217;arriv&#233;e du premier iPhone pliable et d'un gros focus sur l&#8217;intelligence artificielle. Voici les 7 grands chantiers d'Apple pour cette prochaine version.</description>
    </item>
    <item>
      <title>US cybersecurity professionals plead guilty to Blackcat ransomware attacks</title>
      <link>https://www.techradar.com/pro/security/us-cybersecurity-professionals-plead-guilty-to-blackcat-ransomware-attacks</link>
      <pubDate>Wed, 31 Dec 2025 11:45:00 +0000</pubDate>
      <guid isPermaLink="false">5pGYF2n4SAMfnTdZdJyxhP</guid>
      <description>Ryan Clifford Goldberg and Kevin Tyler Martin could end up in prison for years after extorting one, and trying to extort four more companies.</description>
    </item>
    <item>
      <title>See 2025 New Year&#8217;s Eve fireworks, 2026 countdown livestreams around the world</title>
      <link>https://mashable.com/article/2025-new-years-eve-fireworks-live-streams-around-world</link>
      <pubDate>Wed, 31 Dec 2025 11:35:40 +0000</pubDate>
      <guid isPermaLink="false">06AbbrXUCrhNNju5vdnclNn</guid>
      <description>Ring in 2026 with New Year's Eve countdown livestreams around the globe.</description>
    </item>
    <item>
      <title>6 political design trends that defined the chaos of 2025</title>
      <link>https://www.fastcompany.com/91463073/political-design-trends-2025</link>
      <pubDate>2025-12-31T11:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463073/political-design-trends-2025</guid>
      <description>&#8216;I consider myself an important designer,&#8217; president Donald Trump said.
The year 2025 was one in which political and government design broke through to the mainstream. That&#8217;s thanks in large part to the new U.S. president, who fancies himself something of a designer-in-chief.</description>
    </item>
    <item>
      <title>NYT Connections hints today: Clues, answers for December 31, 2025</title>
      <link>https://mashable.com/article/nyt-connections-hint-answer-today-december-31-2025</link>
      <pubDate>Wed, 31 Dec 2025 11:28:02 +0000</pubDate>
      <guid isPermaLink="false">02vdC6P3lOklk5CYRpcUb5I</guid>
      <description>Connections is a New York Times word game that's all about finding the "common threads between words." How to solve the puzzle.</description>
    </item>
    <item>
      <title>NYT Strands hints, answers for December 31, 2025</title>
      <link>https://mashable.com/article/strands-nyt-hint-december-31-2025</link>
      <pubDate>Wed, 31 Dec 2025 11:27:56 +0000</pubDate>
      <guid isPermaLink="false">02x6E3oFd8JIOqNRFh0qs20</guid>
      <description>The NYT Strands hints and answers you need to make the most of your puzzling experience.</description>
    </item>
    <item>
      <title>Wordle today: Answer, hints for December 31, 2025</title>
      <link>https://mashable.com/article/wordle-today-answer-december-31-2025</link>
      <pubDate>Wed, 31 Dec 2025 11:27:48 +0000</pubDate>
      <guid isPermaLink="false">07do9ATBSFOu2LzETlO5V6h</guid>
      <description>Here's the answer for "Wordle" #1655 on December 31 as well as a few hints, tips, and clues to help you solve it yourself.</description>
    </item>
    <item>
      <title>Meta Quest 3 512 Go : Amazon casse son prix comme jamais avant la nouvelle ann&#233;e</title>
      <link>https://www.frandroid.com/bons-plans/2586223_meta-quest-3-512-go-amazon-casse-son-prix-comme-jamais-avant-la-nouvelle-annee</link>
      <pubDate>Wed, 31 Dec 2025 11:22:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2586223_meta-quest-3-512-go-amazon-casse-son-prix-comme-jamais-avant-la-nouvelle-annee</guid>
      <description>
Le Meta Quest 3 dans sa version 512 Go n&#8217;en finit plus de baisser : affich&#233; &#224; 549 euros &#224; son lancement, le casque de r&#233;alit&#233; mixte de Meta tombe aujourd&#8217;hui &#224; 469 euros sur Amazon gr&#226;ce &#224; un coupon de r&#233;duction, une offre encore plus g&#233;n&#233;reuse qu&#8217;avant No&#235;l pour s&#8217;&#233;quiper (ou se rattraper) &#224; bon prix.
</description>
    </item>
    <item>
      <title>New Year&#8217;s Eve livestream 2025: How to watch the NYC ball drop, Times Square performances for free</title>
      <link>https://www.fastcompany.com/91467578/nyc-ball-drop-live-stream-2025-watch-new-years-eve-performances-free</link>
      <pubDate>2025-12-31T11:15:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91467578/nyc-ball-drop-live-stream-2025-watch-new-years-eve-performances-free</guid>
      <description>From free official webcasts to cable alternatives for cord-cutters, here&#8217;s how to ring in 2026 without freezing in Midtown.
There are two sorts of people in this world: Those who think it sounds like fun to brave the elements for hours on end to watch the ball drop at midnight in Times Square on New Year&#8217;s Eve, and then there&#8217;s the rest of us.</description>
    </item>
    <item>
      <title>AI-Powered Dating Is All Hype. IRL Cruising Is the Future</title>
      <link>https://www.wired.com/story/expired-tired-wired-ai-powered-dating/</link>
      <pubDate>Wed, 31 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">691b9d9c99c8fc79e19fd3d7</guid>
      <description>Dating apps and AI companies have been touting bot wingmen for months. But the future might just be good old-fashioned meet-cutes.</description>
    </item>
    <item>
      <title>Fears Mount That US Federal Cybersecurity Is Stagnating&#8212;or Worse</title>
      <link>https://www.wired.com/story/expired-tired-wired-federal-cybersecurity/</link>
      <pubDate>Wed, 31 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">691ba508981359ffe511ae45</guid>
      <description>Government staffing cuts and instability, including this year&#8217;s prolonged shutdown, could be hindering US digital defense and creating vulnerabilities.</description>
    </item>
    <item>
      <title>The 4 best waterfront parks of 2025 transform shorelines into civic centerpieces</title>
      <link>https://www.fastcompany.com/91458276/best-waterfront-parks-2025</link>
      <pubDate>2025-12-31T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91458276/best-waterfront-parks-2025</guid>
      <description>Four standout waterfront parks have turned stretches of river and shoreline into thriving new public spaces. 
In cities across North America, the best and most exciting public spaces can increasingly be found near the water. Park spaces on and along seashores and riverfronts are in a kind of renaissance right now, with large and small cities alike opening major waterfront parks over the past few years. ...</description>
    </item>
    <item>
      <title>Vie num&#233;rique | 2026, l&#8217;ann&#233;e o&#249; l&#8217;humain est devenu un service non essentiel</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-12-31/vie-numerique/2026-l-annee-ou-l-humain-est-devenu-un-service-non-essentiel.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 31 Dec 2025 06:00:00 -0500</pubDate>
      <guid isPermaLink="false">a9ecf3e80b2033a09379f762659ad7dd</guid>
      <description>Tesla. Hyundai. Unitree. En voil&#224; trois, mais ils sont au moins une vingtaine de fabricants dans le monde qui r&#234;vent de mettre en march&#233; au moins un robot humano&#239;de. En 2026, on a enfin trouv&#233; le mod&#232;le d&#8217;affaires&#160;: les offrir en location &#224; un taux horaire fixe. Autrement dit&#160;: leur offrir un salaire. De l&#224; &#224; remplacer un travailleur humain&#8230;</description>
    </item>
    <item>
      <title>Panneaux solaires chinois sur les toits des maisons : l&#8217;Europe redoute un blackout provoqu&#233; &#224; distance</title>
      <link>https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2923963_panneaux-solaires-chinois-sur-les-toits-des-maisons-leurope-redoute-un-blackout-provoque-a-distance</link>
      <pubDate>Wed, 31 Dec 2025 10:54:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2923963_panneaux-solaires-chinois-sur-les-toits-des-maisons-leurope-redoute-un-blackout-provoque-a-distance</guid>
      <description>
Les onduleurs chinois sont une nouvelle fois dans le viseur des autorit&#233;s europ&#233;ennes. La Commission europ&#233;enne consid&#232;re d&#233;sormais la d&#233;pendance &#224; ces &#233;quipements comme un risque &#233;nerg&#233;tique, &#233;conomique et cyber.
</description>
    </item>
    <item>
      <title>Meilleur smartphone Samsung Galaxy : pour quel mod&#232;le opter en 2025&#8201;?</title>
      <link>https://www.frandroid.com/guide-dachat/386688_quels-smartphone-samsung-choisir-parmi-les-differentes-gammes-galaxy</link>
      <pubDate>Wed, 31 Dec 2025 10:53:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/386688_quels-smartphone-samsung-choisir-parmi-les-differentes-gammes-galaxy</guid>
      <description>
La firme cor&#233;enne propose l'une des gammes de smartphones les plus compl&#232;tes sur le march&#233; de la t&#233;l&#233;phonie. Quel est le t&#233;l&#233;phone Samsung qui est fait pour vous ? Vous trouverez ici les d&#233;tails de leur catalogue et surtout nos conseils pour choisir le plus adapt&#233;.
</description>
    </item>
  </channel>
</rss>
