<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 12 Jan 2026 11:25:12 GMT</lastBuildDate>
    <item>
      <title>Your mobile browser counts &#8211; and these three are putting your privacy at risk, warns Surfshark</title>
      <link>https://www.techradar.com/vpn/vpn-services/your-mobile-browser-counts-and-these-three-are-putting-your-privacy-at-risk-warns-surfshark</link>
      <pubDate>Mon, 12 Jan 2026 11:19:58 +0000</pubDate>
      <guid isPermaLink="false">jYjEpC9YYZViixEGojfQs7</guid>
      <description>Yandex, Edge, and Chrome are the most data-hungry mobile browsers, new research from Surshark has found. Here's all you need to know.</description>
    </item>
    <item>
      <title>How AI, digital sovereignty and data localization are reshaping European data strategies</title>
      <link>https://www.techradar.com/pro/how-ai-digital-sovereignty-and-data-localization-are-reshaping-european-data-strategies</link>
      <pubDate>Mon, 12 Jan 2026 11:17:57 +0000</pubDate>
      <guid isPermaLink="false">kxZbCgpz45jxwjMFJWjFAG</guid>
      <description>For true compliance, AI needs local, high-performance data storage to match the European standards.</description>
    </item>
    <item>
      <title>Been asked to reset your Instagram password? Company denies data breach reports after users bombarded with request emails</title>
      <link>https://www.techradar.com/pro/security/been-asked-to-reset-your-instagram-password-company-denies-data-breach-reports-after-users-bombarded-with-request-emails</link>
      <pubDate>Mon, 12 Jan 2026 11:05:40 +0000</pubDate>
      <guid isPermaLink="false">jkk8AtLNL45CnhVq8Ffvni</guid>
      <description>Instagram says it isn't a data breach, but users should still be on their guard.</description>
    </item>
    <item>
      <title>Nouvelle fuite de donn&#233;es chez BreachForums&#160;: le forum pirate expose plus de 300&#160;000 comptes</title>
      <link>https://www.01net.com/actualites/nouvelle-fuite-donnees-breachforums-forum-pirate-expose-plus-300-000-cybercriminels.html</link>
      <pubDate>Mon, 12 Jan 2026 11:01:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319404</guid>
      <description>Une nouvelle fuite de donn&#233;es expose au grand jour les coulisses de BreachForums, le grand supermarch&#233; des donn&#233;es vol&#233;es. Une sauvegarde mal s&#233;curis&#233;e a permis de r&#233;cup&#233;rer les informations de pr&#232;s de 324&#8239;000 comptes. La br&#232;che met en p&#233;ril l'anonymat de certains des pirates qui fr&#233;quentent la plateforme.</description>
    </item>
    <item>
      <title>Hyte X50 PC Case Review: Computers Should Be Cute</title>
      <link>https://www.wired.com/review/hyte-x50/</link>
      <pubDate>Mon, 12 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">695c00dcb8d433ee584443bc</guid>
      <description>Hyte&#8217;s rounded glass case brings a fun, bubbly aesthetic to your desk.</description>
    </item>
    <item>
      <title>Votre PC actuel est-il d&#233;j&#224; obsol&#232;te ? Microsoft continue de miser sur Copilot malgr&#233; les protestations</title>
      <link>https://www.frandroid.com/marques/microsoft/2938747_votre-pc-actuel-est-il-deja-obsolete-microsoft-continue-de-miser-sur-copilot-malgre-les-protestations</link>
      <pubDate>Mon, 12 Jan 2026 10:58:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2938747_votre-pc-actuel-est-il-deja-obsolete-microsoft-continue-de-miser-sur-copilot-malgre-les-protestations</guid>
      <description>
La firme de Redmond continue d&#8217;investir dans l&#8217;intelligence artificielle en mettant en avant plus que jamais les PC &#233;quip&#233;s de Copilot. &#160;
</description>
    </item>
    <item>
      <title>Boulanger d&#233;gaine d&#233;j&#224; ses meilleures offres avant la 2e d&#233;marque des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2931541_boulanger-degaine-deja-ses-meilleures-offres-avant-la-2e-demarque-des-soldes</link>
      <pubDate>Mon, 12 Jan 2026 10:57:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931541_boulanger-degaine-deja-ses-meilleures-offres-avant-la-2e-demarque-des-soldes</guid>
      <description>
Les soldes d&#8217;hiver battent leur plein depuis mercredi dernier. Durant cette p&#233;riode, Boulanger brade un tas de produits Tech. On trouve des remises importantes sur des cat&#233;gories tr&#232;s vari&#233;es, smartphones, PC portables, TV... D&#233;couvrez celles qui m&#233;ritent votre argent. 
</description>
    </item>
    <item>
      <title>On a vu quelques produits IKEA pas trop chers capables de donner un gros coup de pouce &#224; votre maison</title>
      <link>https://www.frandroid.com/marques/ikea/2938879_on-a-vu-quelques-produits-ikea-pas-trop-chers-capables-de-donner-un-gros-coup-de-pouce-a-votre-maison</link>
      <pubDate>Mon, 12 Jan 2026 10:57:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/ikea/2938879_on-a-vu-quelques-produits-ikea-pas-trop-chers-capables-de-donner-un-gros-coup-de-pouce-a-votre-maison</guid>
      <description>
IKEA lanc&#233; divers produits &#224; prix attractifs pour la maison connect&#233;e et ils sont compatibles Matter. On en a vu quelques-uns au CES 2026.
</description>
    </item>
    <item>
      <title>La Nasa a tranch&#233; : la date du retour anticip&#233; des astronautes pour raison m&#233;dicale est fix&#233;e, des questions restent</title>
      <link>https://www.futura-sciences.com/sciences/actualites/nasa-nasa-tranche-date-retour-anticipe-astronautes-raison-medicale-fixee-questions-restent-130049/#xtor%3DRSS-8</link>
      <pubDate>Mon, 12 Jan 2026 11:47:12 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/nasa-nasa-tranche-date-retour-anticipe-astronautes-raison-medicale-fixee-questions-restent-130049/#xtor%3DRSS-8</guid>
      <description>En raison d'un probl&#232;me m&#233;dical&#160;d'un des astronautes de Crew-11, la Nasa a annonc&#233; que les quatre astronautes de cette mission devraient quitter la Station spatiale internationale ce mercredi. Ils devraient atterrir sur Terre jeudi matin.</description>
    </item>
    <item>
      <title>La derni&#232;re Xiaomi Box S sous Google TV chute &#224; un prix in&#233;dit pour les soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2738247_la-derniere-xiaomi-box-s-sous-google-tv-chute-a-un-prix-inedit-pour-les-soldes-dhiver</link>
      <pubDate>Mon, 12 Jan 2026 10:47:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2738247_la-derniere-xiaomi-box-s-sous-google-tv-chute-a-un-prix-inedit-pour-les-soldes-dhiver</guid>
      <description>
La Xiaomi TV Box S de 3&#7497; g&#233;n&#233;ration est un bo&#238;tier multim&#233;dia qui transforme tout &#233;cran dot&#233; d'un port HDMI en TV connect&#233;e avec l'acc&#232;s &#224; toutes les plateformes de streaming. Vous la retrouvez aujourd'hui &#224; 42,89 euros sur AliExpress, au lieu de 69,99 euros, gr&#226;ce &#224; un code promo lors des soldes.
</description>
    </item>
    <item>
      <title>Le roi du mini PC s&#8217;attaque s&#233;rieusement aux PC portables</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2939059_le-roi-du-mini-pc-sattaque-serieusement-aux-pc-portables</link>
      <pubDate>Mon, 12 Jan 2026 10:46:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2939059_le-roi-du-mini-pc-sattaque-serieusement-aux-pc-portables</guid>
      <description>
Geekom, la marque que vous connaissez pour ses mini PC, change de dimension.
</description>
    </item>
    <item>
      <title>La nouvelle voiture &#233;lectrique abordable de Dacia arrive bient&#244;t, avec une bonne surprise pour la Spring</title>
      <link>https://www.frandroid.com/marques/dacia/2938783_la-nouvelle-voiture-electrique-abordable-de-dacia-arrive-bientot-avec-une-bonne-surprise-pour-la-spring</link>
      <pubDate>Mon, 12 Jan 2026 10:41:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dacia/2938783_la-nouvelle-voiture-electrique-abordable-de-dacia-arrive-bientot-avec-une-bonne-surprise-pour-la-spring</guid>
      <description>
Dacia travaille actuellement sur une nouvelle voiture &#233;lectrique abordable, bas&#233;e sur la nouvelle Renault Twingo E-Tech. Surprise : elle ne devrait pas remplacer l&#8217;actuelle Spring, du moins dans un premier temps.
</description>
    </item>
    <item>
      <title>OnePlus has canceled two of its most anticipated phones of 2026, new rumors claim &#8211; here's why</title>
      <link>https://www.techradar.com/phones/oneplus-phones/oneplus-has-canceled-two-of-its-most-anticipated-phones-of-2026-new-rumors-claim-heres-why</link>
      <pubDate>Mon, 12 Jan 2026 10:37:04 +0000</pubDate>
      <guid isPermaLink="false">VK4ZaW7CGpK8Z3pojA4LNE</guid>
      <description>The OnePlus Open 2 and OnePlus 15s could both be canceled, but you might be able to get similar phones under different names.</description>
    </item>
    <item>
      <title>Change is a choice: Embrace your power to transform</title>
      <link>https://www.fastcompany.com/91460715/change-is-a-choice-embrace-your-power-to-transform-overcoming-fear-of-change</link>
      <pubDate>2026-01-12T10:35:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91460715/change-is-a-choice-embrace-your-power-to-transform-overcoming-fear-of-change</guid>
      <description>It&#8217;s time to think about change differently, perhaps more positively.
The majority of us see change as a blind scary leap into the unknown&#8212;a scary evolution that demands we give up on everything we know. But what if we reframed change, not as something that happens to us, but as something we actively choose?&#160;</description>
    </item>
    <item>
      <title>Logiciels espions sur iPhone : Apple confirme une menace s&#233;rieuse pour ceux qui n&#8217;ont pas install&#233; iOS 26</title>
      <link>https://www.frandroid.com/marques/2938967_logiciels-espions-sur-iphone-apple-confirme-une-menace-serieuse-pour-ceux-qui-nont-pas-installe-ios-26</link>
      <pubDate>Mon, 12 Jan 2026 10:32:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2938967_logiciels-espions-sur-iphone-apple-confirme-une-menace-serieuse-pour-ceux-qui-nont-pas-installe-ios-26</guid>
      <description>
Alors qu'une large partie des utilisateurs d'iPhone conserve d'anciennes versions d'iOS, Apple tire la sonnette d'alarme. La firme de Cupertino a confirm&#233; que les appareils ne disposant pas de la mise &#224; jour iOS 26 sont vuln&#233;rables &#224; des attaques de logiciels espions sophistiqu&#233;s, sans qu'un correctif simple ne soit envisageable pour les versions ant&#233;rieures.
...</description>
    </item>
    <item>
      <title>How to build an AI innovation pipeline that creates real long-term value</title>
      <link>https://www.fastcompany.com/91469340/ai-innovation-pipeline-long-term-value</link>
      <pubDate>2026-01-12T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91469340/ai-innovation-pipeline-long-term-value</guid>
      <description>Here&#8217;s a practical playbook for lasting technological transformation.
As 2026 begins, many organizations are launching AI transformation initiatives. The new year brings with it fresh budgets, renewed strategic focus, and mounting pressure to capture value from artificial intelligence. Yet studies consistently show that most AI projects fail to generate meaningful returns. Companies pour resources into promising experiments that never scale, accumulate tools that are never integrated, and watch initial enthusiasm curdle into skepticism....</description>
    </item>
    <item>
      <title>These $1,000 bamboo homes survived a major earthquake</title>
      <link>https://www.fastcompany.com/91471193/these-1000-bamboo-homes-survived-a-major-earthquake</link>
      <pubDate>2026-01-12T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91471193/these-1000-bamboo-homes-survived-a-major-earthquake</guid>
      <description>Built from a simple bamboo structure, these one-room homes provide a new blueprint for resilient disaster housing.
When a 7.7-magnitude earthquake hit Myanmar last year, roads buckled and thousands of buildings collapsed. But a group of small, ultra-low-cost homes made from bamboo survived without any damage.</description>
    </item>
    <item>
      <title>What is the release date for Tell Me Lies season 3 episodes 1-2 on Hulu and Disney+?</title>
      <link>https://www.techradar.com/streaming/hulu/tell-me-lies-season-3-episodes-1-2-release-date-time-disney-plus</link>
      <pubDate>Mon, 12 Jan 2026 10:27:48 +0000</pubDate>
      <guid isPermaLink="false">dXFrASrBwuHJF5zX9wT7VA</guid>
      <description>It's been two years since season 2 was on our screens, but now Tell Me Lies season 3 is back with a vengeance. Here's when episodes 1-2 premiere on Hulu and Disney+.</description>
    </item>
    <item>
      <title>Valve pr&#233;pare un changement interne majeur pour SteamOS : voici ce que cela va changer pour vos jeux sur console portable</title>
      <link>https://www.frandroid.com/marques/valve/2938875_valve-prepare-un-changement-interne-majeur-pour-steamos-voici-ce-que-cela-va-changer-pour-vos-jeux-sur-console-portable</link>
      <pubDate>Mon, 12 Jan 2026 10:20:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/valve/2938875_valve-prepare-un-changement-interne-majeur-pour-steamos-voici-ce-que-cela-va-changer-pour-vos-jeux-sur-console-portable</guid>
      <description>
Dans la derni&#232;re version b&#234;ta de SteamOS, Valve annonce le support du pilote ntsync, une nouveaut&#233; qui devrait am&#233;liorer sensiblement le support et la stabilit&#233; des jeux Windows sur le syst&#232;me.
</description>
    </item>
    <item>
      <title>5 shifts every modern leader must make to build trust in the age of skepticism</title>
      <link>https://www.fastcompany.com/91459159/5-shifts-every-modern-leader-must-make-to-build-trust-in-the-age-of-skepticism</link>
      <pubDate>2026-01-12T10:20:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91459159/5-shifts-every-modern-leader-must-make-to-build-trust-in-the-age-of-skepticism</guid>
      <description>With institutional trust in free fall, it&#8217;s not enough for leaders to quietly support their company&#8217;s mission. It&#8217;s time to get visible, vocal, and aligned.
Trust used to be the benefit of the doubt. Now it is the battle to be won.</description>
    </item>
    <item>
      <title>Tineco has released a wet-dry vacuum that's as nimble as a stick vac</title>
      <link>https://www.techradar.com/home/vacuums/tineco-has-released-a-wet-dry-vacuum-thats-as-nimble-as-a-stick-vac</link>
      <pubDate>Mon, 12 Jan 2026 10:15:55 +0000</pubDate>
      <guid isPermaLink="false">kpnAGDQcnyoo4HDTw62Kw6</guid>
      <description>The FLOOR ONE i7 Fold maneuvers like a dream.</description>
    </item>
    <item>
      <title>The Division 3 developer shares plans for the upcoming mega-sequel &#8212; &#8216;I think it will be as big an impact as Division 1 was&#8217;</title>
      <link>https://www.techradar.com/gaming/gaming-industry/the-division-3-developer-shares-plans-for-the-upcoming-mega-sequel-i-think-it-will-be-as-big-an-impact-as-division-1-was</link>
      <pubDate>Mon, 12 Jan 2026 10:09:58 +0000</pubDate>
      <guid isPermaLink="false">sV5tV7fwCwsVXN7G3EKrDE</guid>
      <description>The executive producer of The Division has provided an update on the production of The Division 3. He's betting that the sequel will have as much impact as the first game.</description>
    </item>
    <item>
      <title>Microsoft va tuer son appli de scan Microsoft Lens</title>
      <link>https://www.01net.com/actualites/microsoft-va-tuer-son-appli-de-scan-microsoft-lens.html</link>
      <pubDate>Mon, 12 Jan 2026 10:02:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319412</guid>
      <description>Microsoft Lens, l&#8217;application de Microsoft pour num&#233;riser des documents &#224; l&#8217;aide d&#8217;un smartphone, va dispara&#238;tre.</description>
    </item>
    <item>
      <title>Une naine blanche produit une sorte de bang supersonique qui d&#233;fie l'astrophysique !</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-naine-blanche-produit-sorte-bang-supersonique-defie-astrophysique-129985/#xtor%3DRSS-8</link>
      <pubDate>Mon, 12 Jan 2026 11:01:30 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-naine-blanche-produit-sorte-bang-supersonique-defie-astrophysique-129985/#xtor%3DRSS-8</guid>
      <description>Le XXe si&#232;cle nous a r&#233;v&#233;l&#233; un extraordinaire zoo d'&#233;toiles et de galaxies dont nous n'avons pas encore saisi toute l'&#233;tendue, ni compris toute la physique op&#233;rant avec ses arcanes dans les coulisses de ces astres. On vient d'en avoir une nouvelle preuve avec une d&#233;couverte rendue possible par...</description>
    </item>
    <item>
      <title>The best laptop power banks for 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-laptop-power-bank-120040388.html?src=rss</link>
      <pubDate>Mon, 12 Jan 2026 10:01:26 +0000</pubDate>
      <guid isPermaLink="false">c803d2c4-bcfe-4f4a-8b7d-1f390c4e3c3d</guid>
      <description>Laptop power banks come in handy if you often travel or work away from your desk. These larger batteries have enough capacity to refill your computer to around 75 percent, giving you many more productive hours. Of course, they can also charge smaller devices like your phone, camera or tablet a few times over. Nearly all portable laptop chargers fall below the 100-watt-hour mark so you can bring them in your carry-on when you fly. Additional features, like built-in cables and digital displays make these battery banks easier to use, too. We tested over a dozen options and put our thoughts below,...</description>
    </item>
    <item>
      <title>This Dead Star With a Glowing Shock Wave Shouldn&#8217;t Exist</title>
      <link>https://gizmodo.com/this-dead-star-with-a-glowing-shock-wave-shouldnt-exist-2000708244</link>
      <pubDate>Mon, 12 Jan 2026 10:00:11 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000708244</guid>
      <description>The recent discovery has left astronomers dumbfounded.</description>
    </item>
    <item>
      <title>Google Maps : l&#8217;application s&#8217;offre un nouveau look bien plus simple &#224; utiliser</title>
      <link>https://www.frandroid.com/android/applications/2938835_google-maps-lapplication-soffre-un-nouveau-look-bien-plus-simple-a-utiliser</link>
      <pubDate>Mon, 12 Jan 2026 10:00:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/applications/2938835_google-maps-lapplication-soffre-un-nouveau-look-bien-plus-simple-a-utiliser</guid>
      <description>
Google a lanc&#233; une nouvelle interface pour les param&#232;tres de son application de cartographie, Google Maps, permettant de profiter d'une meilleure lisibilit&#233; via diff&#233;rentes rubriques. 
</description>
    </item>
    <item>
      <title>Trump&#8217;s fundraisers asked Microsoft for its White House ballroom donation</title>
      <link>https://www.theverge.com/news/859578/trump-white-house-ballroom-microsoft-amazon-donations</link>
      <pubDate>2026-01-12T05:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=859578</guid>
      <description>The Trump administration approached Microsoft for its donation to fund the White House's $300 million ballroom, documents released by Sen. Elizabeth Warren's (D-MA) office reveal. In response to a Democrat-led letter questioning Big Tech's involvement in the ballroom's construction, Microsoft counsel Karen Christian writes that the company "was contacted by a fundraiser for the effort [&#8230;]...</description>
    </item>
    <item>
      <title>Here&#8217;s how to design meetings around how human brains actually work, not how we wish they would</title>
      <link>https://www.fastcompany.com/91468623/meetings-design-human-brains-actually-work</link>
      <pubDate>2026-01-12T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91468623/meetings-design-human-brains-actually-work</guid>
      <description>Stop stacking your meetings like dominoes. Build them like systems.
Every organization believes it&#8217;s in the productivity business. Every executive thinks faster, longer, more densely packed meetings equal better results. They&#8217;re wrong.</description>
    </item>
    <item>
      <title>The maker of Pebble thinks way beyond than watches</title>
      <link>https://www.fastcompany.com/91472461/pebble-watch-gadget-ces</link>
      <pubDate>2026-01-12T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91472461/pebble-watch-gadget-ces</guid>
      <description>Core Devices is making fun gadgets that scratch specific itches.
A few of the neatest gadgets at the Consumer Electronics Show (CES) 2026 weren&#8217;t anywhere near the Las Vegas Convention Center trade show venue.</description>
    </item>
    <item>
      <title>Adieu l&#8217;hybride rechargeable : pourquoi Stellantis fait marche arri&#232;re sur ce march&#233; crucial</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2938653_adieu-lhybride-rechargeable-pourquoi-stellantis-fait-marche-arriere-sur-ce-marche-crucial</link>
      <pubDate>Mon, 12 Jan 2026 09:58:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2938653_adieu-lhybride-rechargeable-pourquoi-stellantis-fait-marche-arriere-sur-ce-marche-crucial</guid>
      <description>
Face &#224; la baisse de la demande, le groupe Stellantis annonce vouloir abandonner ses hybrides rechargeables aux &#201;tats-Unis. L&#8217;entreprise franco-italienne pr&#233;f&#232;re d&#233;sormais vouloir mettre l&#8217;accent sur les voitures &#233;lectriques &#224; prolongateur d&#8217;autonomie. Mais qu'en est-il en Europe ?
</description>
    </item>
    <item>
      <title>Amazon a attendu les soldes d&#8217;hiver 2026 pour casser le prix de l&#8217;Apple Watch Series 11</title>
      <link>https://www.frandroid.com/bons-plans/2925695_amazon-a-attendu-les-soldes-dhiver-2026-pour-casser-le-prix-de-lapple-watch-series-11</link>
      <pubDate>Mon, 12 Jan 2026 09:58:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2925695_amazon-a-attendu-les-soldes-dhiver-2026-pour-casser-le-prix-de-lapple-watch-series-11</guid>
      <description>
Lanc&#233;e en fin d'ann&#233;e derni&#232;re, l'Apple Watch Series 11 est arriv&#233;e avec quelques nouveaut&#233;s int&#233;ressantes et elle est d&#233;j&#224; en promotion pour les soldes sur Amazon.
</description>
    </item>
    <item>
      <title>Dreo's new fan blasts out an ultra-refreshing, fine mist &#8211; I could have stood in front of it all morning</title>
      <link>https://www.techradar.com/home/air-quality/dreos-new-fan-blasts-out-an-ultra-refreshing-fine-mist-i-could-have-stood-in-front-of-it-all-morning</link>
      <pubDate>Mon, 12 Jan 2026 09:56:12 +0000</pubDate>
      <guid isPermaLink="false">Gw6rtz4GLP79iroP2AwevM</guid>
      <description>The TurboCool series of misting fans achieved the impossible: it perked me right up on day four of CES.</description>
    </item>
    <item>
      <title>SVS lance sa premi&#232;re barre de son et renouvelle ses caissons de basses au CES 2026</title>
      <link>https://www.frandroid.com/produits-android/audio/barre-de-son/2938909_svs-lance-sa-premiere-barre-de-son-et-renouvelle-ses-caissons-de-basses-au-ces-2026</link>
      <pubDate>Mon, 12 Jan 2026 09:48:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/audio/barre-de-son/2938909_svs-lance-sa-premiere-barre-de-son-et-renouvelle-ses-caissons-de-basses-au-ces-2026</guid>
      <description>
SVS, fabricant am&#233;ricain r&#233;put&#233; pour ses syst&#232;mes audio home cin&#233;ma haut de gamme, a pr&#233;sent&#233; au CES 2026 sa toute premi&#232;re barre de son baptis&#233;e R|Evolution. Accompagn&#233;e d'une nouvelle g&#233;n&#233;ration de caissons de basses 3000 R|Evolution, cette gamme marque l'entr&#233;e du sp&#233;cialiste sur le segment en forte expansion des solutions audio compactes tout-en-un.
...</description>
    </item>
    <item>
      <title>iPhone 17e&#160;: Apple corrigerait ces 5 d&#233;fauts de l&#8217;iPhone 16e</title>
      <link>https://www.01net.com/actualites/iphone-17e-apple-corrigerait-defauts-iphone-16e.html</link>
      <pubDate>Mon, 12 Jan 2026 09:48:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319392</guid>
      <description>L'iPhone 17e pourrait corriger les principaux d&#233;fauts de son pr&#233;d&#233;cesseur. On fait le point sur le futur smartphone le moins cher d'Apple, attendu cette ann&#233;e.</description>
    </item>
    <item>
      <title>I can't stop thinking about these affordable IKEA speakers that look like art</title>
      <link>https://www.techradar.com/home/i-cant-stop-thinking-about-these-affordable-ikea-speakers-that-look-like-art</link>
      <pubDate>Mon, 12 Jan 2026 09:44:43 +0000</pubDate>
      <guid isPermaLink="false">Z78QtLkjWzT5Z3Fjigxixa</guid>
      <description>Of everything I saw at CES, it's these speakers that I want the most.</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : voici les meilleures offres en DIRECT avant la fin de la premi&#232;re d&#233;marque</title>
      <link>https://www.frandroid.com/bons-plans/2931731_soldes-dhiver-2026-voici-les-meilleures-offres-en-direct-avant-la-fin-de-la-premiere-demarque</link>
      <pubDate>Mon, 12 Jan 2026 09:35:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931731_soldes-dhiver-2026-voici-les-meilleures-offres-en-direct-avant-la-fin-de-la-premiere-demarque</guid>
      <description>
Les soldes d'hiver 2026 ont d&#233;but&#233; la semaine derni&#232;re et les offres continuent de tomber sur Amazon, Fnac, Darty ou encore Cdiscount et Boulanger. Smartphones, PC portables, t&#233;l&#233;viseurs, tablettes ou encore casques et &#233;couteurs sans fil&#8230; Voici les meilleures offres Tech s&#233;lectionn&#233;es par la r&#233;daction pour l'occasion.
</description>
    </item>
    <item>
      <title>Fnac et Darty vendent au rabais de nombreux produits Tech lors des soldes d&#8217;hiver 2026</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-vendent-au-rabais-de-nombreux-produits-tech-lors-des-soldes-dhiver-2026</link>
      <pubDate>Mon, 12 Jan 2026 09:34:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-vendent-au-rabais-de-nombreux-produits-tech-lors-des-soldes-dhiver-2026</guid>
      <description>
Fnac et Darty n'h&#233;sitent pas &#224; brader de nombreux produits Tech pendant les soldes d'hiver 2026. Les deux enseignes pratiquent des prix bien bas sur des produits populaires. Pour vous y retrouver, voici les offres qui valent r&#233;ellement le coup. 
</description>
    </item>
    <item>
      <title>BYD va lancer une nouvelle marque de voitures &#233;lectriques et hybrides pour une raison bien pr&#233;cise</title>
      <link>https://www.frandroid.com/marques/byd/2938683_byd-va-lancer-une-nouvelle-marque-de-voitures-electriques-et-hybrides-pour-une-raison-bien-precise</link>
      <pubDate>Mon, 12 Jan 2026 09:34:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2938683_byd-va-lancer-une-nouvelle-marque-de-voitures-electriques-et-hybrides-pour-une-raison-bien-precise</guid>
      <description>
Apr&#232;s Denza, Yangwang et Fangchenbao, BYD va cr&#233;er une nouvelle marque de voitures &#233;lectriques. Le but&#160;? Renforcer sa position du march&#233; des taxis et VTC, sans influer sur les ventes et l'image de ses autres filiales.
</description>
    </item>
  </channel>
</rss>
