<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 09 Feb 2026 11:51:00 GMT</lastBuildDate>
    <item>
      <title>Don&#8217;t cancel yet &#8211; YouTube TV is giving some subscribers an $80 saving to stop a post-Super Bowl exodus, and here&#8217;s how to find it</title>
      <link>https://www.techradar.com/streaming/dont-cancel-yet-youtube-tv-is-giving-some-subscribers-an-usd80-saving-to-stop-a-post-super-bowl-exodus-and-heres-how-to-find-it</link>
      <pubDate>Mon, 09 Feb 2026 11:43:10 +0000</pubDate>
      <guid isPermaLink="false">HBEcWBuhehYLWXME9VzX9H</guid>
      <description>YouTube TV is offering a huge deal for existing subscribers, but the catch is that it's only available for a handful of lucky subscribers.</description>
    </item>
    <item>
      <title>'This is not the way': Unimpressed Star Wars fans react to 'terrible' new Super Bowl TV spot for The Mandalorian and Grogu movie</title>
      <link>https://www.techradar.com/streaming/entertainment/this-is-not-the-way-unimpressed-star-wars-fans-react-to-terrible-new-super-bowl-tv-spot-for-the-mandalorian-and-grogu-movie</link>
      <pubDate>Mon, 09 Feb 2026 11:37:51 +0000</pubDate>
      <guid isPermaLink="false">fEmbNnCjZB3PNGogEa8QZ4</guid>
      <description>A new teaser for The Mandalorian and Grogu has been revealed &#8211; and Star Wars fans are struggling to see what the point of it is.</description>
    </item>
    <item>
      <title>1 140 chevaux et version hybride : la fiche technique d&#233;mente de la nouvelle Denza Z9 GT</title>
      <link>https://www.frandroid.com/marques/denza/2970775_1-140-chevaux-et-version-hybride-la-fiche-technique-demente-de-la-nouvelle-denza-z9-gt</link>
      <pubDate>Mon, 09 Feb 2026 11:37:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/denza/2970775_1-140-chevaux-et-version-hybride-la-fiche-technique-demente-de-la-nouvelle-denza-z9-gt</guid>
      <description>
Alors que l'Europe attend encore de voir d&#233;barquer la Denza Z9 GT sur ses routes, BYD ne ch&#244;me pas en Chine. Le constructeur vient de faire certifier une version mise &#224; jour de son immense break de chasse &#233;lectrique et hybride. Au programme : une puissance qui d&#233;passe l'entendement et, surtout, une batterie d'hybride rechargeable de la taille de celle d'une Tesla.
...</description>
    </item>
    <item>
      <title>L&#8217;iPhone 17e arrive bient&#244;t : date de sortie, encoche, A19, MagSafe, voici tout ce que l&#8217;on sait</title>
      <link>https://www.frandroid.com/marques/apple/2970489_liphone-17e-arrive-bientot-date-de-sortie-encoche-a19-magsafe-voici-tout-ce-que-lon-sait</link>
      <pubDate>Mon, 09 Feb 2026 11:34:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2970489_liphone-17e-arrive-bientot-date-de-sortie-encoche-a19-magsafe-voici-tout-ce-que-lon-sait</guid>
      <description>
L'iPhone 17e ne se contenterait pas de corriger les errances ergonomiques de son a&#238;n&#233;. Il devrait enfin adopter la Dynamic Island ainsi qu'une charge MagSafe.
</description>
    </item>
    <item>
      <title>Le &#171;&#160;premier hardware ChatGPT&#160;&#187; : une pub OpenAI compl&#232;tement bidon enflamme Internet</title>
      <link>https://www.01net.com/actualites/premier-hardware-chatgpt-pub-openai-completement-bidon-enflamme-internet.html</link>
      <pubDate>Mon, 09 Feb 2026 11:33:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324824</guid>
      <description>Quelques jours avant le Super Bowl, une myst&#233;rieuse publicit&#233; OpenAI a &#233;t&#233; diffus&#233;e sur Internet. La vid&#233;o, montrant le &#171; premier hardware ChatGPT &#187;  con&#231;u avec Jony Ive, a enflamm&#233; les r&#233;seaux sociaux. Il s'av&#232;re finalement qu'il s'agissait d'un canular savamment orchestr&#233;.</description>
    </item>
    <item>
      <title>Best Buy's Presidents' Day sale is a return to Black Friday &#8212; shop my expert picks, including 50% off appliances, TVs, AirPods, and more</title>
      <link>https://www.techradar.com/live/news/best-buy-presidents-day-sale-live-2026</link>
      <pubDate>Mon, 09 Feb 2026 11:33:15 +0000</pubDate>
      <guid isPermaLink="false">uuKwPoDFrgkDioN7wixX5Q</guid>
      <description>My top Presidents' Day deal picks starting at just $17.99</description>
    </item>
    <item>
      <title>AI Is Here to Replace Nuclear Treaties. Scared Yet?</title>
      <link>https://www.wired.com/story/satellites-ai-nuclear-treaties/</link>
      <pubDate>Mon, 09 Feb 2026 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">6985f39bb028fff37d1b080d</guid>
      <description>The last major nuclear arms treaty between the US and Russia just expired. Some experts believe a combination of satellite surveillance, AI, and human reviewers can take its place. Others, not so much.</description>
    </item>
    <item>
      <title>Oticon Zeal Review: A High Bar (and Price) for Hearing Aids</title>
      <link>https://www.wired.com/review/oticon-zeal/</link>
      <pubDate>Mon, 09 Feb 2026 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">69850ae95109724bd9905828</guid>
      <description>These ultra-tiny hearing aids push the boundary for high-quality audio in a minuscule prescription package.</description>
    </item>
    <item>
      <title>Google Pixel 10 Pro Fold : ce r&#233;cent smartphone pliant blind&#233; d&#8217;IA est d&#233;j&#224; &#224; prix cass&#233;</title>
      <link>https://www.frandroid.com/bons-plans/2924727_google-pixel-10-pro-fold-ce-recent-smartphone-pliant-blinde-dia-est-deja-a-prix-casse</link>
      <pubDate>Mon, 09 Feb 2026 11:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2924727_google-pixel-10-pro-fold-ce-recent-smartphone-pliant-blinde-dia-est-deja-a-prix-casse</guid>
      <description>
Le Google Pixel 10 Pro Fold est le smartphone le plus cher du catalogue de la firme de Mountain View. Mais en ce moment, la facture est un peu moins douloureuse puisque ce r&#233;cent mod&#232;le pliant est propos&#233; &#224; 1 499 euros au lieu de 1 899 euros.
</description>
    </item>
    <item>
      <title>What is the release date for School Spirits season 3 episode 5 on Paramount+?</title>
      <link>https://www.techradar.com/streaming/paramount-plus/school-spirits-season-3-episode-5-release-date-time</link>
      <pubDate>Mon, 09 Feb 2026 11:26:46 +0000</pubDate>
      <guid isPermaLink="false">wG2VSspNdgiEwhBMDKpVWg</guid>
      <description>Last week finally started to give us answers about the dark entity &#8211; but when does School Spirits season 3 episode 5 drop on Paramount+?</description>
    </item>
    <item>
      <title>&#171; &#199;a me fait flipper &#187; : on a &#233;t&#233; voir les robots que vous allez croiser dans votre Carrefour ou McDo</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/robot-aspirateur/2970011_ca-me-fait-flipper-pourquoi-vous-allez-croiser-les-robots-de-pudu-robotics-dans-votre-carrefour-ou-mcdo</link>
      <pubDate>Mon, 09 Feb 2026 11:24:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/robot-aspirateur/2970011_ca-me-fait-flipper-pourquoi-vous-allez-croiser-les-robots-de-pudu-robotics-dans-votre-carrefour-ou-mcdo</guid>
      <description>
On nous bassine avec l'Optimus de Tesla, mais la r&#233;alit&#233; du terrain est ailleurs. &#192; Shenzhen, chez Pudu Robotics, on ne vend pas du r&#234;ve humano&#239;de pour 2030. On fabrique des machines &#224; roulettes qui nettoient d&#233;j&#224; les sols de McDo et livrent des plateaux chez Carrefour avec une efficacit&#233; redoutable.
</description>
    </item>
    <item>
      <title>Quelle montre connect&#233;e Huawei choisir ? Tout comprendre &#224; la gamme</title>
      <link>https://www.frandroid.com/guide-dachat/2832955_quelle-montre-connectee-huawei-choisir-tout-comprendre-a-la-gamme</link>
      <pubDate>Mon, 09 Feb 2026 11:20:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2832955_quelle-montre-connectee-huawei-choisir-tout-comprendre-a-la-gamme</guid>
      <description>
Sur le march&#233; des smartwatchs, derri&#232;re Apple et Samsung, on retrouve Huawei. Le constructeur chinois propose un catalogue vari&#233; de wearables. Voici quelle montre connect&#233;e Huawei choisir.
</description>
    </item>
    <item>
      <title>Batterie au sodium et solide : BYD contre-attaque avec 2 annonces spectaculaires face &#224; CATL</title>
      <link>https://www.frandroid.com/marques/byd/2970511_batterie-au-sodium-et-solide-byd-contre-attaque-avec-2-annonces-spectaculaires-face-a-catl</link>
      <pubDate>Mon, 09 Feb 2026 11:18:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2970511_batterie-au-sodium-et-solide-byd-contre-attaque-avec-2-annonces-spectaculaires-face-a-catl</guid>
      <description>
BYD annonce une avanc&#233;e spectaculaire dans le d&#233;veloppement de batteries au sodium pour voitures &#233;lectriques, capables d'encaisser jusqu'&#224; 10 000 cycles de charge. Une performance bien &#233;videmment tr&#232;s int&#233;ressante, &#224; condition que le march&#233; suive.
</description>
    </item>
    <item>
      <title>Les iPhone 16 et 16 Pro maintenant officiellement propos&#233;s par Apple en reconditionn&#233;</title>
      <link>https://www.frandroid.com/marques/apple/2970211_les-iphone-16-et-16-pro-maintenant-officiellement-proposes-par-apple-en-reconditionne</link>
      <pubDate>Mon, 09 Feb 2026 11:14:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2970211_les-iphone-16-et-16-pro-maintenant-officiellement-proposes-par-apple-en-reconditionne</guid>
      <description>
Depuis quelques jours, les iPhone 16, 16 Plus, 16 Pro et 16 Pro Max sont officiellement disponibles au catalogue de produits reconditionn&#233;s Apple. &#192; la cl&#233;, des tarifs r&#233;duits et l'assurance d'appareils vraiment remis &#224; neuf.
</description>
    </item>
    <item>
      <title>PlayStation va lancer sa DualSense en version PC</title>
      <link>https://www.frandroid.com/marques/sony/2970327_playstation-va-lancer-sa-dualsense-en-version-pc</link>
      <pubDate>Mon, 09 Feb 2026 11:12:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2970327_playstation-va-lancer-sa-dualsense-en-version-pc</guid>
      <description>
Sony fait sensation au Japon en d&#233;voilant la sortie d&#8217;une manette sans fil DualSense dans une version &#171; PC-First &#187;. Une distinction &#224; l&#8217;image de la nouvelle politique hybride de Sony. &#160;
</description>
    </item>
    <item>
      <title>WhatsApp bient&#244;t oblig&#233; d&#8217;ouvrir sa messagerie &#224; ses concurrents&#160;?</title>
      <link>https://www.01net.com/actualites/whatsapp-bientot-oblige-douvrir-sa-messagerie-a-ses-concurrents.html</link>
      <pubDate>Mon, 09 Feb 2026 11:09:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324811</guid>
      <description>Dans un avis pr&#233;liminaire de ce lundi 9 f&#233;vrier, la Commission europ&#233;enne a estim&#233; que le groupe de Mark Zuckerberg violait les lois antitrust europ&#233;ennes en emp&#234;chant d&#8217;autres agents IA d&#8217;int&#233;grer WhatsApp. Sur la messagerie depuis le 15 janvier 2026, seul Meta AI, l'outil d'intelligence artificielle de la soci&#233;t&#233; am&#233;ricaine, est disponible.</description>
    </item>
    <item>
      <title>Les t&#233;l&#233;viseurs 8K signent leur arr&#234;t de mort face au d&#233;sint&#233;r&#234;t des consommateurs</title>
      <link>https://www.frandroid.com/produits-android/tv-connectee-produits/2970531_les-televiseurs-8k-signent-leur-arret-de-mort-face-au-desinteret-des-consommateurs</link>
      <pubDate>Mon, 09 Feb 2026 11:06:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/tv-connectee-produits/2970531_les-televiseurs-8k-signent-leur-arret-de-mort-face-au-desinteret-des-consommateurs</guid>
      <description>
Apr&#232;s moins d'une d&#233;cennie sur le march&#233;, la technologie 8K s'&#233;teint progressivement. LG, Sony et TCL ont abandonn&#233; la production, laissant Samsung seul sur un segment qui repr&#233;sente &#224; peine 0,1% des ventes mondiales de t&#233;l&#233;viseurs.
</description>
    </item>
    <item>
      <title>Ever heard of 'quishing'? NordVPN warns the future of scams lies in QR codes &#8211; and shares some tips on how to stay safe</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/ever-heard-of-quishing-nordvpn-warns-the-future-of-scams-lies-in-qr-codes-and-shares-some-tips-on-how-to-stay-safe</link>
      <pubDate>Mon, 09 Feb 2026 11:03:44 +0000</pubDate>
      <guid isPermaLink="false">YnbRS83MCvrcjwCBYRHHCL</guid>
      <description>NordVPN warns that QR code attacks are escalating, with a staggering 26 million individuals already potentially exposed to 'quishing.' Here's how to stay safe.</description>
    </item>
    <item>
      <title>Galaxy S26&#160;: la charge sans fil acc&#233;l&#232;rerait, mais oublierait le meilleur du Qi2</title>
      <link>https://www.01net.com/actualites/galaxy-s26-la-charge-sans-fil-accelererait-mais-oublierait-le-meilleur-du-qi2.html</link>
      <pubDate>Mon, 09 Feb 2026 11:02:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324813</guid>
      <description>Une fuite du consortium WPC officialise la mont&#233;e en gamme du standard Qi sur les Galaxy S26. Si la vitesse promet de grimper, l&#8217;ergonomie reste brid&#233;e par une contrainte technique.</description>
    </item>
    <item>
      <title>Strava simplifie enfin vos entra&#238;nements : exportez vos s&#233;ances en un clic vers votre montre</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2970509_strava-simplifie-enfin-vos-entrainements-exportez-vos-seances-en-un-clic-vers-votre-montre</link>
      <pubDate>Mon, 09 Feb 2026 11:01:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2970509_strava-simplifie-enfin-vos-entrainements-exportez-vos-seances-en-un-clic-vers-votre-montre</guid>
      <description>
Apr&#232;s avoir propos&#233; la suggestion d'entra&#238;nement de course &#224; pied ou de cyclisme en fonction du niveau des utilisateurs, Strava rend enfin cette fonction pratique en permettant d'exporter les s&#233;ances vers une montre Garmin ou Apple. 
</description>
    </item>
    <item>
      <title>Lyft rolls out teen accounts with enhanced safety protections</title>
      <link>https://www.engadget.com/apps/lyft-rolls-out-teen-accounts-with-enhanced-safety-protections-110002761.html?src=rss</link>
      <pubDate>Mon, 09 Feb 2026 11:00:02 +0000</pubDate>
      <guid isPermaLink="false">51f4c2e7-f1a2-4ab4-9f5b-afa58b0016c9</guid>
      <description>Lyft has officially introduced teen accounts for ages 13 to 17. This is a rideshare feature in which teenagers can request their own rides, which is similar to Uber's pre-existing platform.
Teens request the rides on their own, but parents can keep an eye on things every step of the way. Lyft says that parents or guardians can see every ride in real time and manage the account. They also get updates at pickup and drop-off and the app allows communication with the driver when needed.
This is a rideshare service for teens, so there are several new safety features. The drivers must "meet the high...</description>
    </item>
    <item>
      <title>How Curling Became the Winter Olympics&#8217; Favorite Fixation</title>
      <link>https://www.wired.com/story/everything-you-need-to-know-curling/</link>
      <pubDate>Mon, 09 Feb 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">6984a595cdd03108a2c0d78a</guid>
      <description>If throwing stones and sweeping ice seem strange to you, the centuries-old history of the sport explains why it became so beloved.</description>
    </item>
    <item>
      <title>Iran&#8217;s Digital Surveillance Machine Is Almost Complete</title>
      <link>https://www.wired.com/story/irans-digital-surveillance-machine-is-almost-complete/</link>
      <pubDate>Mon, 09 Feb 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">698214da8ea882e1b01b5cfd</guid>
      <description>After more than 15 years of draconian measures, culminating in an ongoing internet shutdown, the Iranian regime seems to be staggering toward its digital surveillance endgame.</description>
    </item>
    <item>
      <title>This whistle fights fascists</title>
      <link>https://www.theverge.com/policy/874959/3d-printed-whistles-for-ice-minneapolis-chicago-renee-good-alex-pretti</link>
      <pubDate>2026-02-09T06:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=874959</guid>
      <description>Kit Rocha and Courtney Milan have a knack for drawing attention to a cause. The bestselling romance novelists helped raise half a million dollars for Georgia voting rights in 2020. Now, their cause is whistles, because whistles let neighbors alert each other when they see ICE agents abducting people. They've helped create a group that's [&#8230;]</description>
    </item>
    <item>
      <title>Biggest ever website domain deal sees AI.com bought by Crypto.com founder</title>
      <link>https://www.techradar.com/pro/biggest-ever-website-domain-deal-sees-ai-com-bought-by-crypto-com-founder</link>
      <pubDate>Mon, 09 Feb 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">NRdRfto5XVwQPrLi7kY5gR</guid>
      <description>Kris Marszalek just bought AI.com for $70 million in crypto, right before the Super Bowl.</description>
    </item>
    <item>
      <title>Analogue 3D gets a fresh batch of stock with these vibrant limited-edition colorways &#8212; but 'highly limited quantities' means you'll need to be quick to order one for yourself</title>
      <link>https://www.techradar.com/gaming/analogue-3d-gets-a-fresh-batch-of-stock-with-these-vibrant-limited-edition-colorways-but-highly-limited-quantities-means-youll-need-to-be-quick-to-order-one-for-yourself</link>
      <pubDate>Mon, 09 Feb 2026 10:58:57 +0000</pubDate>
      <guid isPermaLink="false">Mjndj4D9UgYAQf8TohYR5Y</guid>
      <description>Analogue 3D goes translucent with these limited edition variants of its modernized retro gaming console.</description>
    </item>
    <item>
      <title>'We&#8217;ve never stopped developing Fallout' says Todd Howard on Fallout 5, but the game is still a long way off with the 'majority' of the team working on The Elder Scrolls 6</title>
      <link>https://www.techradar.com/gaming/weve-never-stopped-developing-fallout-says-todd-howard-on-fallout-5-but-the-game-is-still-a-long-way-off-with-the-majority-of-the-team-working-on-the-elder-scrolls-6</link>
      <pubDate>Mon, 09 Feb 2026 10:58:36 +0000</pubDate>
      <guid isPermaLink="false">qbKtzXwH25R9NBkx2egN9k</guid>
      <description>Todd Howard has spoken on the Fallout series, including the upcoming fifth entry.</description>
    </item>
    <item>
      <title>The Pok&#233;mon TCG Phantasmal Flames Triple Pack Weavile is down to its best-ever price at Amazon &#8212; save over $10</title>
      <link>https://mashable.com/article/feb-9-pokemon-tcg-phantasmal-flames-3-pack-blister-deal</link>
      <pubDate>Mon, 09 Feb 2026 10:56:07 +0000</pubDate>
      <guid isPermaLink="false">05VZcdpFx1BAAvzPEaPWMtq</guid>
      <description>The Pok&#233;mon TCG Phantasmal Flames 3-Pack Blister drops to $34.99 at Amazon, its lowest price ever for the Mega Evolution set.</description>
    </item>
    <item>
      <title>Don't buy a new iPad just yet &#8212; two new models are set to launch soon with future-proofing upgrades</title>
      <link>https://www.techradar.com/tablets/ipad/dont-buy-a-new-ipad-just-yet-two-new-models-are-set-to-launch-soon-with-future-proofing-upgrades</link>
      <pubDate>Mon, 09 Feb 2026 10:51:32 +0000</pubDate>
      <guid isPermaLink="false">4yvskr2KshvdyWpos3aqzP</guid>
      <description>The iPad (2026) and iPad Air (2026) are both apparently coming soon, complete with new chipsets for both and an AI upgrade for one of them.</description>
    </item>
    <item>
      <title>Sony ULT Wear headphones are over $100 off at Amazon &#8212; score these stellar headphones for under $150</title>
      <link>https://mashable.com/article/feb-9-sony-ult-wear-headphones-deal</link>
      <pubDate>Mon, 09 Feb 2026 10:48:58 +0000</pubDate>
      <guid isPermaLink="false">04vHuu5Qfe0mEXZGL96zFPH</guid>
      <description>As of Feb. 9, the Sony Ult Wear headphones are on sale at Amazon for $148, 41% off their list price of $249.99.</description>
    </item>
    <item>
      <title>Make the most of Stuff Your Kindle Day with this discounted Kindle Paperwhite bundle at Amazon</title>
      <link>https://mashable.com/article/feb-9-kindle-paperwhite-bundle-deal</link>
      <pubDate>Mon, 09 Feb 2026 10:44:48 +0000</pubDate>
      <guid isPermaLink="false">06YOB43OYhY4QEzp4r4qQ8b</guid>
      <description>Find the best Kindle deal at Amazon. Save 12% on the Kindle Paperwhite Bundle at Amazon.</description>
    </item>
    <item>
      <title>The Amazon Fire TV Stick 4K Select is almost half off at Amazon &#8212; save $18 right now</title>
      <link>https://mashable.com/article/feb-9-fire-stick-4k-select-deal</link>
      <pubDate>Mon, 09 Feb 2026 10:40:25 +0000</pubDate>
      <guid isPermaLink="false">06FTNjZFtv3DDN5xFBaHxFg</guid>
      <description>Get the best Fire Stick deal at Amazon. Save 45% on the Amazon Fire TV Stick 4K Select at Amazon.</description>
    </item>
    <item>
      <title>Leapmotor B05 Ultra : pourquoi la nouvelle voiture &#233;lectrique chinoise de Stellantis nous d&#233;&#231;oit d&#233;j&#224;</title>
      <link>https://www.frandroid.com/marques/leapmotor/2970435_leapmotor-b05-ultra-pourquoi-la-nouvelle-voiture-electrique-chinoise-de-stellantis-nous-decoit-deja</link>
      <pubDate>Mon, 09 Feb 2026 10:38:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/leapmotor/2970435_leapmotor-b05-ultra-pourquoi-la-nouvelle-voiture-electrique-chinoise-de-stellantis-nous-decoit-deja</guid>
      <description>
D&#233;j&#224; annonc&#233;e, la Leapmotor B05 Ultra vient de laisser &#233;chapper quelques informations. Version performante de cette voiture &#233;lectrique chinoise, elle veut rivaliser avec les Volkswagen ID.3 GTX et Cupra Born &#224; son arriv&#233;e en Europe... mais ses caract&#233;ristiques laissent songeurs.
</description>
    </item>
    <item>
      <title>Amazon divise par 2 le prix de la Huawei Watch 5 en titane, une montre premium qui valait 649 &#8364; au d&#233;part</title>
      <link>https://www.frandroid.com/bons-plans/2970225_amazon-divise-par-2-le-prix-de-la-huawei-watch-5-en-titane-une-montre-premium-qui-valait-649-e-au-depart</link>
      <pubDate>Mon, 09 Feb 2026 10:38:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2970225_amazon-divise-par-2-le-prix-de-la-huawei-watch-5-en-titane-une-montre-premium-qui-valait-649-e-au-depart</guid>
      <description>
Difficile de recommander les yeux ferm&#233;s la Huawei Watch 5 en version titane avec son prix de d&#233;part de 649 euros. Actuellement en promotion &#224; 299 euros sur Amazon, elle devient nettement plus recommandable. 
</description>
    </item>
    <item>
      <title>Pourquoi Stellantis et Volkswagen r&#233;clament un bonus in&#233;dit en Europe que les fran&#231;ais connaissent bien</title>
      <link>https://www.frandroid.com/marques/volkswagen/2970119_pourquoi-stellantis-et-volkswagen-reclament-une-aide-inedite-en-europe-que-les-francais-connaissent-bien</link>
      <pubDate>Mon, 09 Feb 2026 10:36:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2970119_pourquoi-stellantis-et-volkswagen-reclament-une-aide-inedite-en-europe-que-les-francais-connaissent-bien</guid>
      <description>
Stellantis et Volkswagen proposent la cr&#233;ation d&#8217;un nouveau coup de pouce pour les voitures &#233;lectriques produites en Europe. Il s&#8217;agit du &#171;&#160;bonus CO2&#160;&#187;, qui permettrait de compenser les co&#251;ts &#233;lev&#233;s de cette derni&#232;re.
</description>
    </item>
    <item>
      <title>Bryte Balance Pro Smart Mattress Review: Sleeping Is Believing</title>
      <link>https://www.wired.com/review/bryte-balance-pro-smart-mattress/</link>
      <pubDate>Mon, 09 Feb 2026 10:32:00 +0000</pubDate>
      <guid isPermaLink="false">698363c1de54049d905192b7</guid>
      <description>The Bryte Balance Pro takes smart mattresses to the next level with adjustable coils and programmable massage settings.</description>
    </item>
    <item>
      <title>Google r&#233;v&#232;le qu&#8217;un milliard de smartphones Android sont vuln&#233;rables aux cyberattaques</title>
      <link>https://www.01net.com/actualites/google-revele-milliard-smartphones-android-sont-vulnerables-cyberattaques.html</link>
      <pubDate>Mon, 09 Feb 2026 10:31:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324810</guid>
      <description>Pr&#232;s d&#8217;un smartphone Android sur deux ne re&#231;oit plus aucun correctif de s&#233;curit&#233;. Plus d&#8217;un milliard d&#8217;appareils dans le monde sont vuln&#233;rables et se retrouvent &#224; la merci des cybercriminels. Explications.</description>
    </item>
    <item>
      <title>The Launch of the iPhone 17e Is Reportedly Imminent</title>
      <link>https://gizmodo.com/the-launch-of-the-iphone-17e-is-reportedly-imminent-2000719375</link>
      <pubDate>Mon, 09 Feb 2026 10:30:06 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000719375</guid>
      <description>The new bargain iPhone can, it seems, be yours soon&#8212;probably in a matter of weeks.</description>
    </item>
    <item>
      <title>This Startup Thinks It Can Make Rocket Fuel From Water. Stop Laughing</title>
      <link>https://www.wired.com/story/general-galactic-water-rocket-fuel-test/</link>
      <pubDate>Mon, 09 Feb 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">69861ebfb845608c2949e9ff</guid>
      <description>General Galactic, cofounded by a former SpaceX engineer, plans to test its water-based propellant this fall. If successful, it could help usher in a new era of space travel. That's a big &#8220;if.&#8221;</description>
    </item>
    <item>
      <title>Machine-made snow at the Winter Olympics makes ski racing riskier</title>
      <link>https://www.fastcompany.com/91487798/winter-olympics-machine-made-snow-ski-racing-riskier</link>
      <pubDate>2026-02-09T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91487798/winter-olympics-machine-made-snow-ski-racing-riskier</guid>
      <description>Athletes describe a sport increasingly defined by the reliability of industrialized snowmaking.
When viewers tune in to the 2026 Winter Olympics, they will see pristine, white slopes, groomed tracks, and athletes racing over snow-covered landscapes, thanks in part to a storm that blanketed the mountain venues of the Italian Alps with fresh powder just in time....</description>
    </item>
    <item>
      <title>Copenhagen wants to  cement itself as a sustainable fashion mecca</title>
      <link>https://www.fastcompany.com/91488620/copenhagen-wants-to-cement-itself-as-a-sustainable-fashion-mecca</link>
      <pubDate>2026-02-09T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91488620/copenhagen-wants-to-cement-itself-as-a-sustainable-fashion-mecca</guid>
      <description>Copenhagen Fashion Week has struggled with keeping talent, but the Scandinavian city is increasingly becoming  a stronghold of fashion.
Fashion weeks around the world are dominated by four main shows: New York, Paris, Milan, and London. But in 2020, Copenhagen Fashion Week (CPHFW) made a bold move that helped it garner attention. It launched a framework with nearly 20 sustainability standards that fashion brands must meet to participate. ...</description>
    </item>
    <item>
      <title>Ce qui cloche avec le VPN gratuit de Free Mobile</title>
      <link>https://www.frandroid.com/marques/free/2970055_ce-qui-cloche-avec-le-vpn-gratuit-de-free-mobile</link>
      <pubDate>Mon, 09 Feb 2026 10:22:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2970055_ce-qui-cloche-avec-le-vpn-gratuit-de-free-mobile</guid>
      <description>
Annonc&#233; en grande pompe, mVPN, le VPN gratuit de Free int&#233;gr&#233; &#224; ses forfaits mobiles se confronte &#224; un probl&#232;me commercial coupant une partie de ses abonn&#233;s du service.
</description>
    </item>
    <item>
      <title>Vers un lancement r&#233;duit ? Comment les smartphones Sony pr&#233;pareraient leur retour</title>
      <link>https://www.frandroid.com/marques/sony/2970049_vers-un-lancement-reduit-comment-les-smartphones-sony-prepareraient-leur-retour</link>
      <pubDate>Mon, 09 Feb 2026 10:20:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2970049_vers-un-lancement-reduit-comment-les-smartphones-sony-prepareraient-leur-retour</guid>
      <description>
Le retour de Sony et de ses smartphones Xperia se fera-t-il pudiquement, sur certains march&#233;s seulement ? C'est en tout cas ce que l'on peut d&#233;duire d'une trouvaille du m&#233;dia japonais S-Max sur la base de donn&#233;es GSMA IMEI, o&#249; deux nouveaux mod&#232;les Xperia ont d&#233;j&#224; laiss&#233; une trace.
</description>
    </item>
    <item>
      <title>Le rapport sur le Dark Web de Google ferme ses portes dans une semaine</title>
      <link>https://www.01net.com/actualites/le-rapport-sur-le-dark-web-de-google-ferme-ses-portes-dans-une-semaine.html</link>
      <pubDate>Mon, 09 Feb 2026 10:14:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324821</guid>
      <description>L&#8217;outil de surveillance du dark web de Google va fermer ses portes. Lanc&#233; il y a un peu plus d&#8217;un an, le service cessera d&#233;finitivement de fonctionner dans quelques jours.</description>
    </item>
    <item>
      <title>YouTube Music starts limiting lyrics for free users</title>
      <link>https://www.engadget.com/entertainment/music/youtube-music-starts-limiting-lyrics-for-free-users-101258311.html?src=rss</link>
      <pubDate>Mon, 09 Feb 2026 10:12:58 +0000</pubDate>
      <guid isPermaLink="false">5dfad31a-9a1d-4bf3-a049-e9f8bddba42b</guid>
      <description>YouTube Music has started putting lyrics &#8212; a previously free feature introduced in 2020 &#8212; behind a paywall, according to multiple users and  9to5Google. In the latest update, the &#8220;Lyrics&#8221; tab in the Now Playing screen displays a warning message: &#8220;You have [x] views remaining. Unlock lyrics with Premium.&#8221; Free users get lyrics for five songs, then after that, will only see a few lines before the rest of the song is blurred.Google has been testing the feature since at least September with a limited number of users, according to previous reports. It&#8217;s been speculated that YouTube may have made th...</description>
    </item>
    <item>
      <title>A Knight of the Seven Kingdoms episode 5 trailer teases a tense, misty battle</title>
      <link>https://mashable.com/video/knight-of-the-seven-kingdoms-episode-5-trailer</link>
      <pubDate>Mon, 09 Feb 2026 10:08:36 +0000</pubDate>
      <guid isPermaLink="false">07aP3DZXkuXfcb9aEYbkLyl</guid>
      <description>HBO Max has released the trailer for "A Knight of the Seven Kingdoms" episode 5.</description>
    </item>
    <item>
      <title>Apples iPhone 17e to launch imminently, report claims</title>
      <link>https://mashable.com/article/apple-iphone17e-launch-soon</link>
      <pubDate>Mon, 09 Feb 2026 10:03:23 +0000</pubDate>
      <guid isPermaLink="false">03NFLqspeL8IXHYXEgxrrWa</guid>
      <description>Apple is about to launch a new version of its "affordable" iPhone.</description>
    </item>
    <item>
      <title>L&#8217;iPhone 17e est juste au coin de la rue, avec un nouvel iPad et un iPad Air</title>
      <link>https://www.01net.com/actualites/liphone-17e-est-juste-au-coin-de-la-rue-avec-un-nouvel-ipad-et-un-ipad-air.html</link>
      <pubDate>Mon, 09 Feb 2026 10:02:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324808</guid>
      <description>F&#233;vrier &#233;tait d&#233;j&#224; bien charg&#233; en gros lancements de smartphones, entre les tr&#232;s attendus Pixel 10a et Galaxy S26, et voil&#224; que Bloomberg annonce une pr&#233;sentation &#171; imminente &#187; de l&#8217;iPhone 17e. Positionn&#233; dans la continuit&#233; de l&#8217;iPhone 16e, ce nouveau mod&#232;le d&#8217;entr&#233;e de gamme conserverait son ch&#226;ssis fa&#231;on iPhone 14 mais gagnerait une puce A19 et surtout la charge sans fil MagSafe, sans augmenter le ticket d&#8217;entr&#233;e....</description>
    </item>
    <item>
      <title>The best Apple AirTag accessories for 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-apple-airtag-cases-holders-accessories-123036404.html?src=rss</link>
      <pubDate>Mon, 09 Feb 2026 10:00:36 +0000</pubDate>
      <guid isPermaLink="false">aea1250f-fbc3-4936-91b0-e91b46e44afb</guid>
      <description>Apple&#8217;s AirTag makes it easy to keep tabs on everyday items like keys, wallets and bags, but the tracker itself is only part of the equation. The best AirTag accessories help you attach it securely, protect it from wear and tear and fit it naturally into how you carry your stuff. A good holder can make the difference between an AirTag that&#8217;s always with you and one that&#8217;s easy to forget.Accessories range from slim wallet inserts and low-profile key rings to more rugged mounts designed for bikes, luggage or pet collars. Materials vary just as widely, from leather and silicone to hard plastic sh...</description>
    </item>
    <item>
      <title>For Some Reason, Someone Who Generates AI Slop Books Has Unmasked Herself</title>
      <link>https://gizmodo.com/for-some-reason-someone-who-generates-ai-slop-books-has-unmasked-herself-2000719325</link>
      <pubDate>Mon, 09 Feb 2026 10:00:11 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000719325</guid>
      <description>Someone who calls herself "Coral Hart" is telling the world all her tricks.</description>
    </item>
    <item>
      <title>This venture capital firm believes investing in climate is &#8216;Obvious&#8217;&#8212;and just raised another $360 million to prove it</title>
      <link>https://www.fastcompany.com/91485490/this-venture-capital-firm-believes-investing-in-climate-is-obvious-and-just-raised-another-360-million-to-prove-it</link>
      <pubDate>2026-02-09T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91485490/this-venture-capital-firm-believes-investing-in-climate-is-obvious-and-just-raised-another-360-million-to-prove-it</guid>
      <description>Obvious Ventures managing director Andrew Beebe tells Fast Company why now&#8217;s a great time to be backing climate tech, the trendy idea he&#8217;s glad the Trump administration is killing and why he&#8217;s still optimistic for the future of the planet.
When Obvious Ventures launched 12 years ago with a focus on &#8220;world positive&#8221; companies, the idea was a contrarian bet: that startups tackling climate, health, and economic resilience could deliver big returns, not just feel-good impact. Founded by Twitter cofounder Ev Williams and others, the firm backed companies like Beyond Meat, the&#160;AI&#160;drug discovery comp...</description>
    </item>
    <item>
      <title>MacKenzie Scott says everyone should heed this book&#8212;if not read it</title>
      <link>https://www.fastcompany.com/91486935/mackenzie-scott-says-everyone-should-heed-this-book-if-not-read-it</link>
      <pubDate>2026-02-09T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91486935/mackenzie-scott-says-everyone-should-heed-this-book-if-not-read-it</guid>
      <description>Scott turned Annie Dillard&#8217;s lessons in writing into lessons in philanthropy.
MacKenzie Scott helped build one of the most recognizable companies in modern history&#8212;all while writing her first novel. As Amazon scaled from a fledging&#160;startup&#160;to a global force, Scott was simultaneously cultivating a literary life.&#160;</description>
    </item>
    <item>
      <title>TikTok&#8217;s endless scroll is under threat in Europe</title>
      <link>https://www.fastcompany.com/91488579/tiktoks-endless-scroll-is-under-threat-in-europe</link>
      <pubDate>2026-02-09T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91488579/tiktoks-endless-scroll-is-under-threat-in-europe</guid>
      <description>EU regulators argue the app&#8217;s design encourages addiction, a finding that could force TikTok to change its feed and put other platforms on notice.
Time could be up for TikTok&#8217;s metronomic For You feed, which pushes videos to users with clock-like accuracy. The endless scroll that defines the TikTok experience has been flagged as part of a broader set of features that make the app addictive by design, according to the European Commission. The regulator has issued a preliminary decision under the Digital Services Act, a sweeping piece of tech regulation, arguing that TikTok has not done enough t...</description>
    </item>
    <item>
      <title>Turn your ideas into a book without the spiral with this tool</title>
      <link>https://mashable.com/article/feb-9-youbooks-ai-non-fiction-book-generator</link>
      <pubDate>Mon, 09 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">04bjLsh0zQ2pDUQfdm8QRm4</guid>
      <description>Create polished, research-backed non-fiction books faster with lifetime access to the Youbooks AI book generator.</description>
    </item>
    <item>
      <title>Digital freedom is 100TB of cloud storage for a single payment</title>
      <link>https://mashable.com/article/feb-9-internxt-cloud-storage-lifetime-subscription-100tb</link>
      <pubDate>Mon, 09 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">07pdx9vZ7LhYCZlTZYO85cn</guid>
      <description>Get lifetime access to 100TB of private, encrypted Internxt cloud storage with a single payment through Feb. 22.</description>
    </item>
    <item>
      <title>Good Luck, Have Fun, Dont Die review: An earnest f*ck you to AI</title>
      <link>https://mashable.com/article/good-luck-have-fun-dont-die-review</link>
      <pubDate>Mon, 09 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">0305Rngv0ZO3aw425oraTRW</guid>
      <description>"Good Luck, Have Fun, Don't Die" review: Sam Rockwell and Haley Lu Richardson star in anti-AI comedy from Gore Verbinski.</description>
    </item>
    <item>
      <title>Stuff Your Kindle Day just went live &#8212; download 100s of free romance books for your Kindle</title>
      <link>https://mashable.com/article/stuff-your-kindle-day-free-romance-book-blast-be-my-valentine</link>
      <pubDate>Mon, 09 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">06jqk3yhsUc0i4uepZ0EhMr</guid>
      <description>The latest Stuff Your Kindle Day is live. Download free romance books for your Kindle in the new Romance Book Blast.</description>
    </item>
    <item>
      <title>How to watch South Africa vs. Canada online for free</title>
      <link>https://mashable.com/article/south-africa-canada-t20-world-cup-2026-live-stream-for-free</link>
      <pubDate>Mon, 09 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">05GbmoxMOhAkeGcCD7zJbdd</guid>
      <description>How to watch T20 World Cup for free. Live stream South Africa vs. Canada in the 2026 T20 World Cup for free from anywhere in the world.</description>
    </item>
    <item>
      <title>How to watch the T20 World Cup 2026 online for free</title>
      <link>https://mashable.com/article/icc-t20-world-cup-2026-live-stream-for-free</link>
      <pubDate>Mon, 09 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">010mD3LD7s8maSwiQCoK0Tw</guid>
      <description>How to watch T20 World Cup for free. Live stream the 2026 T20 World Cup for free from anywhere in the world.</description>
    </item>
    <item>
      <title>How to watch Love Island: All Stars online for free</title>
      <link>https://mashable.com/article/love-island-all-stars-2026-live-stream-for-free</link>
      <pubDate>Mon, 09 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00RCOsIX4Py7DEAmq6se65E</guid>
      <description>How to watch Love Island: All Stars for free. Live stream Love Island: All Stars in 2026 for free from anywhere in the world.</description>
    </item>
  </channel>
</rss>
