<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 28 Feb 2026 07:31:16 GMT</lastBuildDate>
    <item>
      <title>Pourquoi le Volvo EX30 le moins cher n&#8217;arrivera pas en France</title>
      <link>https://www.frandroid.com/marques/volvo/2994743_pourquoi-le-volvo-ex30-le-moins-cher-narrivera-pas-en-france</link>
      <pubDate>Sat, 28 Feb 2026 07:21:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volvo/2994743_pourquoi-le-volvo-ex30-le-moins-cher-narrivera-pas-en-france</guid>
      <description>
Volvo vient de mettre &#224; jour son EX30 pour le mill&#233;sime 2027. Au programme : une motorisation plus modeste, l&#8217;arriv&#233;e du V2L pour brancher votre cafeti&#232;re sur la batterie, et une petite d&#233;ception tarifaire r&#233;serv&#233;e au march&#233; fran&#231;ais.
</description>
    </item>
    <item>
      <title>Google's Aluminium-merged OS brings familiar vibes - but I have a lot of lingering questions</title>
      <link>https://www.techradar.com/pro/googles-aluminium-merged-os-brings-familiar-vibes-but-i-have-a-lot-of-lingering-questions</link>
      <pubDate>Sat, 28 Feb 2026 07:15:00 +0000</pubDate>
      <guid isPermaLink="false">qusqdwhmE8GbdFss86XB5L</guid>
      <description>"Good job, Chrome OS. You can log yourself out."</description>
    </item>
    <item>
      <title>Harry Potter, Mission Impossible et Batman sous le m&#234;me toit : un nouveau rival &#224; Netflix et Disney est n&#233;</title>
      <link>https://www.frandroid.com/services/svod/2994681_harry-potter-mission-impossible-et-batman-sous-le-meme-toit-un-nouveau-rival-a-netflix-et-disney-est-ne</link>
      <pubDate>Sat, 28 Feb 2026 07:14:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2994681_harry-potter-mission-impossible-et-batman-sous-le-meme-toit-un-nouveau-rival-a-netflix-et-disney-est-ne</guid>
      <description>
Le feuilleton est termin&#233; et le vainqueur n'est pas celui qu'on attendait il y a six mois. Paramount Skydance vient de confirmer le rachat de Warner Bros Discovery pour 110 milliards de dollars. Port&#233; par la fortune de Larry Ellison (Oracle), David Ellison r&#233;alise un coup de force historique apr&#232;s le retrait d&#233;finitif de Netflix.
</description>
    </item>
    <item>
      <title>Pendant qu&#8217;Anthropic (Claude) dit non aux robots tueurs, OpenAI signe avec le Pentagone</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/anthropic-claude-ai/2994677_pendant-quanthropic-claude-dit-non-aux-robots-tueurs-openai-signe-avec-le-pentagone</link>
      <pubDate>Sat, 28 Feb 2026 06:59:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/anthropic-claude-ai/2994677_pendant-quanthropic-claude-dit-non-aux-robots-tueurs-openai-signe-avec-le-pentagone</guid>
      <description>
Dario Amodei vient de d&#233;couvrir le prix r&#233;el de l'&#233;thique en 2026. Pour avoir refus&#233; de transformer Claude en outil de surveillance de masse, Anthropic se retrouve bannie des serveurs du Pentagone. 
</description>
    </item>
    <item>
      <title>Cette petite cam&#233;ra de surveillance connect&#233;e filme en HD, peut fonctionner avec Alexa et ne co&#251;te pas plus de 15 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2991743_cette-petite-camera-de-surveillance-connectee-filme-en-hd-peut-fonctionner-avec-alexa-et-ne-coute-pas-plus-de-15-e</link>
      <pubDate>Sat, 28 Feb 2026 06:16:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2991743_cette-petite-camera-de-surveillance-connectee-filme-en-hd-peut-fonctionner-avec-alexa-et-ne-coute-pas-plus-de-15-e</guid>
      <description>
Compacte et discr&#232;te, la Blink Mini d'Amazon propose toutes les fonctionnalit&#233;s que l'on est en droit d'attendre d'une cam&#233;ra de surveillance connect&#233;e. Elle est en plus l'une des moins ch&#232;res du moment : elle est affich&#233;e &#224; 14,99 euros au lieu de 34,99 euros sur le site du g&#233;ant am&#233;ricain.
</description>
    </item>
    <item>
      <title>Tesla Model 3 code suggests it could get an upgrade soon &#8212; but were the Model S and Model X axed too soon?</title>
      <link>https://www.techradar.com/vehicle-tech/hybrid-electric-vehicles/tesla-model-3-code-suggests-it-could-get-an-upgrade-soon-but-were-the-model-s-and-model-x-axed-too-soon</link>
      <pubDate>Sat, 28 Feb 2026 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">R8qfRhFFxikup3omq6Ghv9</guid>
      <description>The Tesla Model 3 could get two big upgrades soon, according to code hints &#8212; meanwhile, used Model S and X prices are on the rise.</description>
    </item>
    <item>
      <title>OpenAI strikes a deal with the Defense Department to deploy its AI models</title>
      <link>https://www.engadget.com/ai/openai-strikes-a-deal-with-the-defense-department-to-deploy-its-ai-models-054441785.html?src=rss</link>
      <pubDate>Sat, 28 Feb 2026 05:44:41 +0000</pubDate>
      <guid isPermaLink="false">85cc2c5f-22a9-48df-8b44-00d676cb8e54</guid>
      <description>OpenAI has reached an agreement with the Defense Department to deploy its models in the agency&#8217;s network, company chief Sam Altman has revealed on X.  In his post, he said two of OpenAI&#8217;s most important safety principles are &#8220;prohibitions on domestic mass surveillance and human responsibility for the use of force, including for autonomous weapon systems.&#8221; Altman claimed the company put those principles in its agreement with the agency, which he called by the government&#8217;s preferred name of Department of War (DoW), and that it had agreed to honor them. The agency has closed the deal with OpenAI,...</description>
    </item>
  </channel>
</rss>
