<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 11 Dec 2025 15:30:35 GMT</lastBuildDate>
    <item>
      <title>Alpine A390 ou Porsche Macan &#233;lectrique : on compare ces deux voitures ultra performantes</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2631047_alpine-a390-ou-porsche-macan-electrique-on-compare-ces-deux-voitures-ultra-performantes</link>
      <pubDate>Thu, 11 Dec 2025 15:28:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2631047_alpine-a390-ou-porsche-macan-electrique-on-compare-ces-deux-voitures-ultra-performantes</guid>
      <description>
Alpine vient tout juste de pr&#233;senter le plus grand v&#233;hicule de son histoire avec l'A390, une voiture &#233;lectrique avec pas moins de trois moteurs. Il s'attaque de front au Porsche Macan, un SUV clairement assum&#233; et qui est r&#233;cemment pass&#233; au 100 % &#233;lectrique.
</description>
    </item>
    <item>
      <title>Apple's AirPods Pro 3 drop to a new record low of $199</title>
      <link>https://www.engadget.com/deals/apples-airpods-pro-3-drop-to-a-new-record-low-of-199-222806888.html?src=rss</link>
      <pubDate>Thu, 11 Dec 2025 15:27:57 +0000</pubDate>
      <guid isPermaLink="false">42f7f263-d7c8-4a21-ad07-9121207a6244</guid>
      <description>No need to fret if you missed out on some of the best Black Friday deals this year &#8212; some of them have returned already. Case in point: Apple's AirPods Pro 3, which came out in September this year, are on sale for a new record low of $199. That's 20 percent off and better than the discount we saw during Black Friday and Cyber Monday. With the new AirPods Pro, Apple made some big improvements, including better battery life and sound quality, and introduced useful new features, such as Live Translation.


The AirPods Pro 3 are the best AirPods available today, with Apple's H2 chip, and earned a ...</description>
    </item>
    <item>
      <title>Cette r&#233;cente montre connect&#233;e avec plus de 10 jours d&#8217;autonomie connait sa premi&#232;re baisse de prix int&#233;ressante sur Amazon</title>
      <link>https://www.frandroid.com/marques/2836437_cette-recente-montre-connectee-avec-plus-de-10-jours-dautonomie-connait-sa-premiere-baisse-de-prix-interessante-sur-amazon</link>
      <pubDate>Thu, 11 Dec 2025 15:25:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2836437_cette-recente-montre-connectee-avec-plus-de-10-jours-dautonomie-connait-sa-premiere-baisse-de-prix-interessante-sur-amazon</guid>
      <description>
Loin derri&#232;re les prix des Garmin, Polar et autres montres sportives premium, l'Amazfit Balance 2 nous a bluff&#233;s lors de notre prise en main. Sur Amazon, elle entame m&#234;me ses premi&#232;res baisses de prix et passe &#224; 269 euros au lieu de 299 euros.
</description>
    </item>
    <item>
      <title>HPC and AI converging infrastructures</title>
      <link>https://www.techradar.com/pro/hpc-and-ai-converging-infrastructures</link>
      <pubDate>Thu, 11 Dec 2025 15:22:56 +0000</pubDate>
      <guid isPermaLink="false">MhbGKCXD8iGPZHWPQBwD9Y</guid>
      <description>The modern data center is undergoing a significant transformation driven by increasing complexity and widespread integration of artificial intelligence.</description>
    </item>
    <item>
      <title>Disney signs deal with OpenAI to allow Sora to generate AI videos featuring its characters</title>
      <link>https://techcrunch.com/2025/12/11/disney-signs-deal-with-openai-to-allow-sora-to-generate-ai-videos-featuring-its-characters/</link>
      <pubDate>Thu, 11 Dec 2025 15:21:05 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3075142</guid>
      <description>Disney says that alongside the agreement, it will "become a major customer of OpenAI," as it will use&#160;its APIs to build new products, tools, and experiences, including for Disney+.</description>
    </item>
    <item>
      <title>Against the Federal Moratorium on State-Level Regulation of AI</title>
      <link>https://gizmodo.com/against-the-federal-moratorium-on-state-level-regulation-of-ai-2000698390</link>
      <pubDate>Thu, 11 Dec 2025 15:20:50 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000698390</guid>
      <description>The common refrain that a patchwork of regulations would kill innovation doesn't pass the smell test.</description>
    </item>
    <item>
      <title>Oracle shares drop after $15bn higher AI spending revealed</title>
      <link>https://www.techradar.com/pro/oracle-shares-drop-after-usd15bn-higher-ai-spending-revealed</link>
      <pubDate>Thu, 11 Dec 2025 15:20:00 +0000</pubDate>
      <guid isPermaLink="false">3MAiNXwJKSBmcUdZVobWfF</guid>
      <description>Oracle investors aren't happy with higher-than-anticipated Capex, despite healthy revenue growth.</description>
    </item>
    <item>
      <title>&#171;&#160;&#199;a permet de voir la peau de quelqu&#8217;un plus en d&#233;tail ?&#160;&#187; : Donald Trump parle de la 6G sans avoir la moindre id&#233;e de ce dont il s&#8217;agit</title>
      <link>https://www.frandroid.com/telecom/2906647_ca-permet-de-voir-la-peau-de-quelquun-plus-en-detail-donald-trump-parle-de-la-6g-sans-avoir-la-moindre-idee-de-ce-dont-il-sagit</link>
      <pubDate>Thu, 11 Dec 2025 15:13:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2906647_ca-permet-de-voir-la-peau-de-quelquun-plus-en-detail-donald-trump-parle-de-la-6g-sans-avoir-la-moindre-idee-de-ce-dont-il-sagit</guid>
      <description>
Lors d'une r&#233;union film&#233;e, le pr&#233;sident des &#201;tats-Unis s'est mis &#224; parler de la 6G sans savoir ce que c'est. La preuve en images.
</description>
    </item>
    <item>
      <title>Alerte rouge sur Google Chrome&#160;: une myst&#233;rieuse faille de s&#233;curit&#233; est exploit&#233;e par des pirates</title>
      <link>https://www.01net.com/actualites/alerte-rouge-google-chrome-mysterieuse-faille-securite-exploitee-pirates.html</link>
      <pubDate>Thu, 11 Dec 2025 15:12:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314979</guid>
      <description>Google vient de d&#233;ployer une mise &#224; jour d&#8217;urgence de Chrome. Le correctif vise &#224; colmater une faille de s&#233;curit&#233; d&#233;j&#224; exploit&#233;e par des cybercriminels. L'&#233;diteur n'a pas communiqu&#233; beaucoup d'informations sur la vuln&#233;rabilit&#233; par mesure de pr&#233;caution.</description>
    </item>
    <item>
      <title>Over 200,000 power banks sold on Amazon are being recalled for a fire risk</title>
      <link>https://www.theverge.com/news/842385/uscpsc-recall-iniu-power-bank-overheat-rire-risk-amazon</link>
      <pubDate>2025-12-11T10:08:33-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=842385</guid>
      <description>A company called INIU has issued a recall for its BI-B41 10,000mAh power banks because the lithium-ion batteries they use "can overheat and ignite, posing fire and burn hazards to consumers." The company has received 15 reports of the power banks overheating resulting in 11 fires causing over $380,000 in property damage and three minor [&#8230;]</description>
    </item>
    <item>
      <title>On Me raises $6M to shake up the gift card industry</title>
      <link>https://techcrunch.com/2025/12/11/on-me-raises-6m-to-shake-up-the-gift-card-industry/</link>
      <pubDate>Thu, 11 Dec 2025 15:08:21 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3074810</guid>
      <description>On Me raises $6 million for its digital gift card platform that lets users purchase cards categorized by interests rather than being restricted to specific retailers.</description>
    </item>
    <item>
      <title>Quantifying the hidden costs of cloud sovereignty gaps</title>
      <link>https://www.techradar.com/pro/quantifying-the-hidden-costs-of-cloud-sovereignty-gaps</link>
      <pubDate>Thu, 11 Dec 2025 15:07:42 +0000</pubDate>
      <guid isPermaLink="false">TWVCg4GzYQhPoqe3aA4udf</guid>
      <description>Recent outages are symptoms of an over-reliance on US based hyperscalers.</description>
    </item>
    <item>
      <title>Disney&#8217;s AI Slop Era Is Here</title>
      <link>https://gizmodo.com/disney-openai-sora-deal-slop-2000698409</link>
      <pubDate>Thu, 11 Dec 2025 15:01:02 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000698409</guid>
      <description>The studio has announced a landmark deal and $1 billion investment with OpenAI to bring hundreds of Disney characters to its generative AI platforms.</description>
    </item>
    <item>
      <title>AT&amp;T&#8217;s Connected Life Platform Is a Second Try in the Smart-Home Space</title>
      <link>https://www.wired.com/story/att-connected-life-platform-launches-nationwide/</link>
      <pubDate>Thu, 11 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">6938a7a64663f89a0f38c7ed</guid>
      <description>The carrier&#8217;s Connected Life platform, now available nationwide, lets AT&amp;T customers easily set up a smart-home security system.</description>
    </item>
    <item>
      <title>AT&amp;#038;T&#8217;s new home security system is powered by Google Home and Abode</title>
      <link>https://www.theverge.com/news/842307/att-connected-life-smart-home-security-google-price</link>
      <pubDate>2025-12-11T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=842307</guid>
      <description>AT&amp;T is launching Connected Life, a new smart home security offering built around Google Home that keeps working during power or internet outages. Connected Life can be self-installed and features smart home cameras from Google Nest and security hardware from Abode, as well as professional monitoring. This follows Google launching APIs for its smart home [&#8230;]...</description>
    </item>
    <item>
      <title>Quordle hints and answers for Friday, December 12 (game #1418)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-12-december-2025</link>
      <pubDate>Thu, 11 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">k8n7qyqxooWrYwRkRBC3PU</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Friday, December 12 (game #915)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-12-december-2025</link>
      <pubDate>Thu, 11 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">v3xTtPa4fvGZRcogaq7ji6</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Friday, December 12 (game #649)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-12-december-2025</link>
      <pubDate>Thu, 11 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">JJ3CagxZE8itNDsjFwoLeK</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Plus de 100 marques chinoises de voitures &#233;lectriques mais seulement 3 sont rentables : voici lesquelles</title>
      <link>https://www.frandroid.com/marques/lucid/2906609_plus-de-100-marques-chinoises-de-voitures-electriques-mais-seulement-3-sont-rentables-voici-lesquelles</link>
      <pubDate>Thu, 11 Dec 2025 14:58:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lucid/2906609_plus-de-100-marques-chinoises-de-voitures-electriques-mais-seulement-3-sont-rentables-voici-lesquelles</guid>
      <description>
En Chine, il existe plus de 100 constructeurs automobile de voitures &#233;lectriques. Mais seulement 3 d'entre eux sont rentables &#224; l'heure actuelle. Voici lesquels.
</description>
    </item>
    <item>
      <title>S&#233;isme dans le monde de l&#8217;IA : ChatGPT obtient les droits sur 200 personnages Disney</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2906795_seisme-dans-le-monde-de-lia-chatgpt-obtient-les-droits-sur-200-personnages-disney</link>
      <pubDate>Thu, 11 Dec 2025 14:53:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2906795_seisme-dans-le-monde-de-lia-chatgpt-obtient-les-droits-sur-200-personnages-disney</guid>
      <description>
C'est un grand coup que vient de marquer OpenAI dans le monde de l'IA. La firme a sign&#233; un accord historique avec Disney pour avoir acc&#232;s &#224; 200 personnages du g&#233;ant du cin&#233;ma.
</description>
    </item>
    <item>
      <title>MCON Review: You Won&#8217;t Find a More Compact Mobile Controller</title>
      <link>https://gizmodo.com/mcon-review-you-wont-find-a-more-compact-mobile-controller-2000697987</link>
      <pubDate>Thu, 11 Dec 2025 14:50:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000697987</guid>
      <description>Despite slighly odd ergonomics, the MCON will turn your phone into the handheld you want it to be.</description>
    </item>
    <item>
      <title>Voici les 3 voitures &#233;lectriques les plus vendues au monde : deux Tesla et une Chinoise qui arrive bient&#244;t en Europe</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2906639_voici-les-3-voitures-electriques-les-plus-vendues-au-monde-deux-tesla-et-une-chinoise-qui-arrive-bientot-en-europe</link>
      <pubDate>Thu, 11 Dec 2025 14:45:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2906639_voici-les-3-voitures-electriques-les-plus-vendues-au-monde-deux-tesla-et-une-chinoise-qui-arrive-bientot-en-europe</guid>
      <description>
Avec un bond de 32 % des ventes de voitures &#233;lectriques au 3e trimestre 2025, une nouvelle hi&#233;rarchie &#233;merge : BYD conforte sa premi&#232;re place et Geely s'impose en troisi&#232;me position. Bien que d&#233;fi&#233; par la concurrence chinoise, Tesla r&#233;siste solidement et place son Model Y &#224; la t&#234;te des ventes.
</description>
    </item>
    <item>
      <title>Best Buy has a massive end-of-year sale on its best-selling TVs &#8212; cheap 4K TVs from $59.99</title>
      <link>https://www.techradar.com/seasonal-sales/best-buy-has-a-massive-end-of-year-sale-on-its-best-selling-tvs-cheap-4k-tvs-from-usd59-99</link>
      <pubDate>Thu, 11 Dec 2025 14:44:01 +0000</pubDate>
      <guid isPermaLink="false">m96DmdT4j3oVaPFhFyTAcF</guid>
      <description>Best Buy's massive end-of-year TV sale is live, and I'm rounding up the best deals on 4K, QLED, and OLED TVs, with clearance prices starting at $59.99.</description>
    </item>
    <item>
      <title>OpenAI signs deal to bring Disney characters to Sora and ChatGPT</title>
      <link>https://www.engadget.com/ai/openai-signs-deal-to-bring-disney-characters-to-sora-and-chatgpt-144344820.html?src=rss</link>
      <pubDate>Thu, 11 Dec 2025 14:43:44 +0000</pubDate>
      <guid isPermaLink="false">cb1377cc-8db3-4931-8cd1-04f31b1995b4</guid>
      <description>It looks like Disney wasted no time delivering on CEO Bob Iger&#8217;s promise to bring AI-generated content to Disney+. On Thursday, the company announced the start of a three-year licensing agreement with OpenAI to bring more than 200 of its beloved characters, including those from Star Wars and Pixar, to the Sora app and ChatGPT.  With the deal in place, OpenAI users will be able to prompt ChatGPT to generate images that tap into Disney&#8217;s intellectual property, with costumes, props, vehicles and environments covered. The agreement does not include voices or &#8220;talent likenesses,&#8221; meaning Sora users...</description>
    </item>
    <item>
      <title>Appels d&#8217;urgence&#160;: Google active la vid&#233;o en direct sur Android pour rattraper l&#8217;iPhone</title>
      <link>https://www.01net.com/actualites/appels-durgence-google-active-la-video-en-direct-sur-android-pour-rattraper-liphone.html</link>
      <pubDate>Thu, 11 Dec 2025 14:43:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315039</guid>
      <description>Google d&#233;ploie enfin la vid&#233;o en direct pour les appels d'urgence sur Android. Une fonction vitale pour guider les secours, mais pas encore disponible en France.</description>
    </item>
    <item>
      <title>The kid-friendly console that outsold Xbox during Black Friday is $50 off</title>
      <link>https://www.theverge.com/gadgets/841831/nex-playground-console-deal-holiday-sale</link>
      <pubDate>2025-12-11T09:42:15-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=841831</guid>
      <description>The Nex Playground is a motion-controlled, cube-shaped console for ages five and up that&#8217;s selling like hotcakes. It came in third for home console sales during Black Friday week, according to sales data shared on Bluesky from Mat Piscatella of Circana, falling behind only Nintendo&#8217;s Switch 2 and Sony&#8217;s PlayStation 5. That&#8217;s an impressive feat [&#8230;]</description>
    </item>
    <item>
      <title>Philips Hue : comment bien d&#233;buter avec ces ampoules connect&#233;es ?</title>
      <link>https://www.frandroid.com/guide-dachat/550919_les-meilleures-offres-philips-hue-pour-le-black-friday-2018</link>
      <pubDate>Thu, 11 Dec 2025 14:40:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/550919_les-meilleures-offres-philips-hue-pour-le-black-friday-2018</guid>
      <description>
Vous avez envie d'&#233;quiper votre maison avec un &#233;clairage intelligent&#8201;? Philips propose avec sa gamme Hue la plus grande gamme d'ampoules connect&#233;es. Comment choisir ses ampoules connect&#233;es Philips Hue et comment bien d&#233;buter&#8201;? Retrouvez les meilleurs kits de d&#233;marrage Philips Hue ainsi que nos explications.
</description>
    </item>
    <item>
      <title>TIME names &#8216;Architects of AI&#8217; its Person of the Year</title>
      <link>https://techcrunch.com/2025/12/11/time-names-architects-of-ai-its-person-of-the-year/</link>
      <pubDate>Thu, 11 Dec 2025 14:38:06 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3075129</guid>
      <description>TIME Magazine has named the 'Architects of AI' its Person of the Year, who include Jensen Huang, Elon Musk, Sam Altman, Mark Zuckerberg,  Lisa Su,  Dario Amodei, Demis Hassabis, and Fei-Fei Li</description>
    </item>
    <item>
      <title>Coca-Cola announces its new CEO, company veteran Henrique Braun</title>
      <link>https://www.fastcompany.com/91458767/coca-cola-announces-its-new-ceo-company-veteran-henrique-braun</link>
      <pubDate>2025-12-11T14:36:11</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91458767/coca-cola-announces-its-new-ceo-company-veteran-henrique-braun</guid>
      <description>Henrique Braun, who has worked at Coca-Cola for three decades, will take over as CEO on March 31, 2026. 
Coca-Cola said Wednesday that its chief operating officer will become its next CEO in the first quarter of 2026.The Atlanta beverage giant said its board elected Henrique Braun as CEO effective March 31. James Quincey, Coke&#8217;s current chairman and CEO, will transition to executive chairman of the company.Braun, 57, has worked at Coca-Cola for three decades. Prior to assuming the COO role earlier this year, he led operations in Brazil, Latin America, Greater China and South Korea. He has held...</description>
    </item>
    <item>
      <title>6 Best Smart Christmas Lights (2025): Twinkly, Govee, Cync</title>
      <link>https://www.wired.com/gallery/best-smart-christmas-lights/</link>
      <pubDate>Thu, 11 Dec 2025 14:36:00 +0000</pubDate>
      <guid isPermaLink="false">65721994e01e123944f765f8</guid>
      <description>Control these smart lights with a voice command or a tap on your phone. Now that&#8217;s a Christmas miracle.</description>
    </item>
    <item>
      <title>OpenAI&#8217;s billion-dollar Disney deal puts Mickey Mouse and Marvel in Sora</title>
      <link>https://www.theverge.com/news/842348/disney-openai-sora-chatgpt-images</link>
      <pubDate>2025-12-11T09:32:21-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=842348</guid>
      <description>A new three-year licensing agreement announced between Disney and ChatGPT operator OpenAI will allow the Sora video generator to create "user-prompted social videos" that feature more than 200 characters from Disney, Marvel, Pixar, and Star Wars. "The rapid advancement of artificial intelligence marks an important moment for our industry, and through this collaboration with OpenAI [&#8230;]...</description>
    </item>
    <item>
      <title>Regardez bien la Une du Time 2025 : deux absences majeures en disent long sur l&#8217;&#233;tat de la Tech</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2906693_regardez-bien-la-une-du-time-2025-deux-absences-majeures-en-disent-long-sur-letat-de-la-tech</link>
      <pubDate>Thu, 11 Dec 2025 14:32:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2906693_regardez-bien-la-une-du-time-2025-deux-absences-majeures-en-disent-long-sur-letat-de-la-tech</guid>
      <description>
Le magazine Time a choisi sa &#171; personne de l'ann&#233;e &#187; et en 2025, le magazine d&#233;die le prix aux architectes de l'IA. Microsoft et Apple sont notoirement absents.
</description>
    </item>
    <item>
      <title>Hackers distribute thousands of phishing attacks through Mimecast's secure-link feature</title>
      <link>https://www.techradar.com/pro/security/hackers-distribute-thousands-of-phishing-attacks-through-mimecasts-secure-link-feature</link>
      <pubDate>Thu, 11 Dec 2025 14:20:00 +0000</pubDate>
      <guid isPermaLink="false">vpXrATBcWg59vicEj5dHPN</guid>
      <description>A legitimate feature is being abused to hide phishing emails and have them land in inboxes.</description>
    </item>
    <item>
      <title>Xiaomi casse d&#233;j&#224; le prix de son nouveau smartphone haut de gamme, le surpuissant Poco F8 Ultra</title>
      <link>https://www.frandroid.com/bons-plans/2887243_xiaomi-casse-deja-le-prix-de-son-nouveau-smartphone-haut-de-gamme-le-surpuissant-poco-f8-ultra</link>
      <pubDate>Thu, 11 Dec 2025 14:10:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2887243_xiaomi-casse-deja-le-prix-de-son-nouveau-smartphone-haut-de-gamme-le-surpuissant-poco-f8-ultra</guid>
      <description>
Alors qu'il vient &#224; peine d'&#234;tre lanc&#233;, le Xiaomi Poco F8 Ultra s'offre d&#233;j&#224; une baisse drastique de prix sur le site officiel de la marque, avec une premi&#232;re remise imm&#233;diate de 200 euros et une deuxi&#232;me de 50 euros via un coupon, passant de 899 euros &#224; 649 euros. 
</description>
    </item>
    <item>
      <title>Open AI poaches Slack CEO as its chief revenue officer</title>
      <link>https://www.techradar.com/pro/open-ai-poaches-slack-ceo-as-its-chief-revenue-officer</link>
      <pubDate>Thu, 11 Dec 2025 14:10:00 +0000</pubDate>
      <guid isPermaLink="false">JvkjA7t3tXrxrug242DubS</guid>
      <description>Slack's CEO has just moved over to a new role in OpenAI, but it's not as CEO.</description>
    </item>
    <item>
      <title>Online safety debate: peer claims kids' VPNs 'expose devices to viruses'</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/online-safety-debate-peer-claims-kids-vpns-expose-devices-to-viruses</link>
      <pubDate>Thu, 11 Dec 2025 14:05:30 +0000</pubDate>
      <guid isPermaLink="false">2i9qCC3kCyu2NpxAygHx6P</guid>
      <description>A Lib Dem peer has raised concerns about unsafe VPN apps in a debate in the House of Lords.</description>
    </item>
    <item>
      <title>The Third &#8217;28 Years Later&#8217; Movie Is Actually Happening</title>
      <link>https://gizmodo.com/28-years-later-3-cillian-murphy-2000698389</link>
      <pubDate>Thu, 11 Dec 2025 14:00:37 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000698389</guid>
      <description>Danny Boyle directs, Alex Garland writes, and Cillian Murphy is likely to star.</description>
    </item>
    <item>
      <title>Marvel Rivals Season 5.5 launch: our live coverage of the Rogue update, including downtime and release date</title>
      <link>https://www.techradar.com/news/live/marvel-rivals-season-5-5-launch-downtime-and-release-time</link>
      <pubDate>Thu, 11 Dec 2025 14:00:17 +0000</pubDate>
      <guid isPermaLink="false">9GLWtGfkuJHbrNgA5jpPdb</guid>
      <description>Here's our coverage of the launch of Marvel Rivals Season 5.5 as it happens. This includes a look at the release date, and the new Hero Rogue.</description>
    </item>
    <item>
      <title>The Best Samsung Phones of 2025, Tested and Reviewed</title>
      <link>https://www.wired.com/gallery/best-samsung-phones/</link>
      <pubDate>Thu, 11 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">64dbd481eb3f06fa8140d241</guid>
      <description>From flagship and budget to flipping and folding, Samsung&#8217;s Galaxy range spans the breadth of the smartphone cosmos. WIRED&#8217;s here to help you make your choice.</description>
    </item>
    <item>
      <title>Unapologetically crass and filled with Gen Z slang &#8212; why this Prime Video anime is my latest obsession</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/unapologetically-crass-and-filled-with-gen-z-slang-heres-why-this-prime-video-anime-is-my-latest-obsession</link>
      <pubDate>Thu, 11 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">Ht4f2bNRUH4L2pvwUACbFC</guid>
      <description>New Panty &amp; Stocking with Garterbelt is a Prime Video anime that should be at the top of your watch list.</description>
    </item>
    <item>
      <title>WiiM just unveiled the ultimate Sonos Era 100 rival &#8212; meet the hi-res Sound Lite</title>
      <link>https://www.techradar.com/audio/wireless-bluetooth-speakers/wiim-just-unveiled-the-ultimate-sonos-era-100-rival-meet-the-hi-res-sound-lite</link>
      <pubDate>Thu, 11 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">SnS9KyXyALN9gk7d6BTJe8</guid>
      <description>The WiiM Sound Lite is a stylish hi-res smart speaker for whole-home audio</description>
    </item>
    <item>
      <title>How to watch Luke Littler at the 2026 PDC World Darts Championship online: FREE darts live streams, schedule</title>
      <link>https://www.techradar.com/how-to-watch/sport/luke-littler-2026-pdc-world-darts-championship-online-free-darts</link>
      <pubDate>Thu, 11 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">udAq2bJcfS4hAyvT3vdjCh</guid>
      <description>Luke Littler defends his title at Ally Pally, here's how to watch the Nuke at the 2026 World Darts Championship live streams online from anywhere in the world.</description>
    </item>
    <item>
      <title>The goverment is vibe coding now</title>
      <link>https://www.fastcompany.com/91458333/federal-government-figma-make</link>
      <pubDate>2025-12-11T14:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91458333/federal-government-figma-make</guid>
      <description>Figma is bringing its AI prototyping tool, Figma Make, to U.S. government agencies.
Vibe coding has come to Washington.</description>
    </item>
    <item>
      <title>What the Fed&#8217;s rate cut means for your mortgage, credit cards, and more</title>
      <link>https://www.fastcompany.com/91458713/what-fed-s-rate-cut-means-your-mortgage-credit-cards-more</link>
      <pubDate>2025-12-11T13:58:01</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91458713/what-fed-s-rate-cut-means-your-mortgage-credit-cards-more</guid>
      <description>The Federal Reserve slashed its key rate to nearly 3.6%, the lowest in almost three years.
The Federal Reserve cut its benchmark interest rate by a quarter point Wednesday for the third time since September, bringing its key rate to about 3.6%, the lowest in nearly three years. Before September, it had gone nine months without a cut.The benchmark rate is the rate at which banks borrow and lend to one another, and the Fed has two goals when it sets the rate: one, to manage prices for goods and services, and two, to encourage full employment. The benchmark rate also affects the interest rates co...</description>
    </item>
    <item>
      <title>The DJI Power 2000 portable power station is down to its lowest-ever price &#8212; almost half off</title>
      <link>https://mashable.com/article/dec-11-dji-power-2000-deal</link>
      <pubDate>Thu, 11 Dec 2025 13:58:01 +0000</pubDate>
      <guid isPermaLink="false">02clXJw9W5KF04dIGW7O8ns</guid>
      <description>The DJI Power 2000 is on sale at Amazon for $699, down from the list price of $1,299. That's a 46% discount.</description>
    </item>
    <item>
      <title>Gemini Space Station stock price skyrockets as Winklevoss crypto firm wins prediction market approval</title>
      <link>https://www.fastcompany.com/91458707/gemini-space-station-stock-soars-prediction-markets-approval</link>
      <pubDate>2025-12-11T13:57:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91458707/gemini-space-station-stock-soars-prediction-markets-approval</guid>
      <description>With platforms like Kalshi and Polymarket gaining in popularity, Gemini Titan will offer users contracts as yes-or-no questions about future events.
Tyler and Cameron Winklevoss are taking Gemini Space Station Inc. into the prediction market space.&#160;</description>
    </item>
    <item>
      <title>Xiaomi a sorti l&#8217;&#233;cran parfait pour combiner gaming et travail</title>
      <link>https://www.01net.com/actualites/xiaomi-a-sorti-lecran-parfait-pour-combiner-gaming-et-travail.html</link>
      <pubDate>Thu, 11 Dec 2025 13:46:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315037</guid>
      <description>Xiaomi enrichit son catalogue avec un nouvel &#233;cran PC, le Monitor A27i 2026. Ce moniteur de 27 pouces en Full HD joue la carte de la polyvalence, promettant une fluidit&#233; de 144 Hz et une excellente calibration d&#8217;usine pour s&#233;duire aussi bien les travailleurs de jour que les joueurs du soir. Sans OLED ni HDR, il vise surtout l&#8217;entr&#233;e de gamme efficace, &#224; mi-chemin entre bureautique et gaming....</description>
    </item>
    <item>
      <title>Security flaws in Freedom Chat app exposed users&#8217; phone numbers and PINs</title>
      <link>https://techcrunch.com/2025/12/11/security-flaws-in-freedom-chat-app-exposed-users-phone-numbers-and-pins/</link>
      <pubDate>Thu, 11 Dec 2025 13:35:08 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3074994</guid>
      <description>The founder of Freedom Chat said the company has reset user PINs and released a new version to app stores.</description>
    </item>
    <item>
      <title>Zeekr 007 GT : on a essay&#233; le break &#233;lectrique chinois de 646 ch qui arrive en Europe et qui veut faire de l&#8217;ombre &#224; l&#8217;Audi E5</title>
      <link>https://www.frandroid.com/marques/zeekr/2846927_zeekr-007-gt-on-a-essaye-le-break-electrique-chinois-de-646-ch-qui-arrive-en-europe-et-qui-veut-faire-de-lombre-a-laudi-e5</link>
      <pubDate>Thu, 11 Dec 2025 13:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/zeekr/2846927_zeekr-007-gt-on-a-essaye-le-break-electrique-chinois-de-646-ch-qui-arrive-en-europe-et-qui-veut-faire-de-lombre-a-laudi-e5</guid>
      <description>
On a eu la chance d'essayer la nouvelle Zeekr 007 GT. Une voiture &#233;lectrique chinoise pr&#233;vue pour l'Europe, qui se recharge en 10 minutes et dot&#233;e de 646 ch. Voici notre premier avis.
</description>
    </item>
  </channel>
</rss>
