<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 14 Nov 2025 16:51:22 GMT</lastBuildDate>
    <item>
      <title>Man Dies From Burger in First Death Linked to Meat Allergy Spread by Ticks</title>
      <link>https://gizmodo.com/man-dies-from-burger-in-first-death-linked-to-meat-allergy-spread-by-ticks-2000686031</link>
      <pubDate>Fri, 14 Nov 2025 16:50:52 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000686031</guid>
      <description>The healthy 47-year-old man from New Jersey developed a fatal allergic reaction hours after attending a barbeque in summer 2024.</description>
    </item>
    <item>
      <title>Best Buy drops early Black Friday doorbusters &#8211; I've got the 12 best deals on TVs, laptops, appliances, headphones, and more</title>
      <link>https://www.techradar.com/seasonal-sales/best-buy-drops-early-black-friday-doorbusters-ive-got-the-12-best-deals-on-tvs-laptops-appliances-headphones-and-more</link>
      <pubDate>Fri, 14 Nov 2025 16:48:18 +0000</pubDate>
      <guid isPermaLink="false">hqwW5BrRYgsEHWoY5NRpwH</guid>
      <description>I've looked through the latest set of deals in the early Black Friday sale at Best Buy and picked out the 12 top offers that I recommend buying now.</description>
    </item>
    <item>
      <title>The Data Center Resistance Has Arrived</title>
      <link>https://www.wired.com/story/the-data-center-resistance-has-arrived/</link>
      <pubDate>Fri, 14 Nov 2025 16:43:03 +0000</pubDate>
      <guid isPermaLink="false">6914be20d3a82eaf6ebb2179</guid>
      <description>A new report finds that local opposition to data centers skyrocketed in the second quarter of this year.</description>
    </item>
    <item>
      <title>Apple&#8217;s last-gen AirPods Pro 2 are down to their lowest price to date</title>
      <link>https://www.theverge.com/gadgets/821049/apple-airpods-pro-2-walmart-black-friday-deal-sale</link>
      <pubDate>2025-11-14T11:42:27-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=821049</guid>
      <description>Walmart on Friday officially kicked off its early Black Friday deals, with the first wave of discounts lasting from November 14th to November 16th. One of the best deals we&#8217;ve spotted is on the last-gen AirPods Pro 2 with USB-C charging case, which are currently $139 ($110 off). That&#8217;s even lower than the discount we [&#8230;]</description>
    </item>
    <item>
      <title>Black Friday 2025 : quelles sont les offres encore disponibles ce week-end ?</title>
      <link>https://www.frandroid.com/bons-plans/2864479_black-friday-2025-meilleures-offres-week-end-en-direct-amazon</link>
      <pubDate>Fri, 14 Nov 2025 16:41:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2864479_black-friday-2025-meilleures-offres-week-end-en-direct-amazon</guid>
      <description>
Avant le coup d'envoi officiel du vendredi noir &#224; la fin du mois, les offres se multiplient et deviennent de plus en plus int&#233;ressantes. D'un c&#244;t&#233;, il y a le pr&#233;-Black Friday chez la majorit&#233; des e-commer&#231;ants fran&#231;ais comme Boulanger, Fnac Darty, Amazon et Cdiscount, et de l'autre c&#244;t&#233;, il y a aussi le Singles Day, ou 11.11, chez AliExpress et consorts. Vous retrouverez les meilleures offres des deux &#233;v&#233;nements dans cet article. 
...</description>
    </item>
    <item>
      <title>Black Friday en avance : envie d&#8217;une tablette ? Le top des offres pour s&#8217;offrir un iPad, Galaxy Tab, Redmi Tab&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2850637_pre-black-friday-meilleures-offres-tablettes-tactiles-a-choisir</link>
      <pubDate>Fri, 14 Nov 2025 16:40:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850637_pre-black-friday-meilleures-offres-tablettes-tactiles-a-choisir</guid>
      <description>
Les tablettes tactiles ne sont certes plus totalement les stars qu&#8217;elles &#233;taient, mais elles conservent un r&#233;el int&#233;r&#234;t, notamment pour le dessin num&#233;rique avec un stylet. &#192; l&#8217;occasion du pr&#233;-Black Friday qui dure jusqu'&#224; la fin du mois, plusieurs mod&#232;les de grandes marques profitent de belles r&#233;ductions.
</description>
    </item>
    <item>
      <title>Belkin is recalling its iPhone tracking stand and two power banks due to fire risks</title>
      <link>https://www.theverge.com/news/821016/belkin-recall-auto-tracking-iphone-stand-pro-boostcharge-power-bank</link>
      <pubDate>2025-11-14T11:39:05-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=821016</guid>
      <description>Belkin has issued a recall for its Auto-Tracking Stand Pro for the iPhone and two versions of its 20,000mAh BoostCharge USB-C PD Power Bank because a &#8220;manufacturing defect may cause the products&#8217; lithium-ion cell components to overheat,&#8221; posing a fire and burn risk to users. While there&#8217;s been just one report of a fire in [&#8230;]</description>
    </item>
    <item>
      <title>Intel Panther Lake CPU leak suggests integrated GPUs are getting a potentially game-changing leap in performance</title>
      <link>https://www.techradar.com/computing/cpu/intel-panther-lake-cpu-leak-suggests-integrated-gpus-are-getting-a-potentially-game-changing-leap-in-performance</link>
      <pubDate>Fri, 14 Nov 2025 16:36:30 +0000</pubDate>
      <guid isPermaLink="false">fvsWi7h6Wm7257TP3fB46R</guid>
      <description>Intel Core Ultra X7 358H leak shows just how good this CPU might be for handhelds and budget gaming laptops.</description>
    </item>
    <item>
      <title>Get the Ultimate PC Upgrade with Snapdragon</title>
      <link>https://www.techradar.com/tech/get-the-ultimate-pc-upgrade-with-snapdragon</link>
      <pubDate>Fri, 14 Nov 2025 16:35:53 +0000</pubDate>
      <guid isPermaLink="false">ffugLFtJVGtc72opDTCweM</guid>
      <description>Choose from the fastest PCs with multi-day battery life</description>
    </item>
    <item>
      <title>Why we&amp;#8217;re going to keep talking about the Trump phone</title>
      <link>https://www.theverge.com/news/820887/why-we-keep-writing-about-trump-phone-t1</link>
      <pubDate>2025-11-14T11:34:19-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=820887</guid>
      <description>For the past couple of weeks, I&#8217;ve been asking &#8212; repeatedly &#8212; where the promised Trump phone is, whether it exists, and what happened to all the money people have already paid for deposits. And I&#8217;m going to keep doing that every week for the foreseeable future.&#160; Not everyone thinks I should. I&#8217;ve been told [&#8230;]</description>
    </item>
    <item>
      <title>Amazon multiplie les offres pour le week-end du pr&#233;-Black Friday : le TOP 20 des deals</title>
      <link>https://www.frandroid.com/bons-plans/2860071_amazon-brade-deja-un-tas-de-produits-tech-pour-le-pre-black-friday-les-14-offres-a-retenir</link>
      <pubDate>Fri, 14 Nov 2025 16:32:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860071_amazon-brade-deja-un-tas-de-produits-tech-pour-le-pre-black-friday-les-14-offres-a-retenir</guid>
      <description>
Amazon lance d&#233;j&#224; ses premi&#232;res promotions avant le Black Friday et baisse fortement les prix sur de nombreux produits Tech. D&#233;couvrez d&#232;s maintenant les meilleures offres &#224; ne pas manquer.
</description>
    </item>
    <item>
      <title>La technologie se met au service du plaisir : voici les innovations qui rendent les sextoys LELO uniques [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/2864203_la-technologie-se-met-au-service-du-plaisir-voici-les-innovations-qui-rendent-les-sextoys-lelo-uniques</link>
      <pubDate>Fri, 14 Nov 2025 16:32:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2864203_la-technologie-se-met-au-service-du-plaisir-voici-les-innovations-qui-rendent-les-sextoys-lelo-uniques</guid>
      <description>
En misant autant sur le design que sur la technologie, LELO veut faire entrer les objets de plaisir dans le quotidien. Des sextoys que l'on retrouve justement en promotion pour le Black Friday.
</description>
    </item>
    <item>
      <title>Need cheap noise-canceling over-ear headphones now? My favorite JLabs just got a huge 38% discount &#8211;here's why they're $49 well spent</title>
      <link>https://www.techradar.com/seasonal-sales/need-cheap-noise-canceling-over-ear-headphones-now-my-favorite-jlabs-just-got-a-huge-38-percent-discount-heres-why-theyre-usd49-well-spent</link>
      <pubDate>Fri, 14 Nov 2025 16:31:50 +0000</pubDate>
      <guid isPermaLink="false">DdwCevT54DkiSCcZfBkuNM</guid>
      <description>I loved these JLab headphones at their original MSRP, and now, they're a stone cold steal</description>
    </item>
    <item>
      <title>These Wooden Wireless Earbuds Claim to Self-Heal Small Scratches</title>
      <link>https://gizmodo.com/jvc-kenywood-wireless-earbuds-self-heal-small-scratches-2000686027</link>
      <pubDate>Fri, 14 Nov 2025 16:30:08 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000686027</guid>
      <description>JVC Kenwood's Wood Master wireless earbuds are looking like stiff competition.</description>
    </item>
    <item>
      <title>Samsung The Frame 2025 : ce beau TV-tableau de 55 pouces est &#224; un super prix pour le pr&#233;-Black Friday chez Fnac et Darty</title>
      <link>https://www.frandroid.com/bons-plans/2869427_samsung-the-frame-2025-ce-beau-tv-tableau-de-55-pouces-est-a-un-super-prix-pour-le-pre-black-friday-chez-fnac-et-darty</link>
      <pubDate>Fri, 14 Nov 2025 16:29:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2869427_samsung-the-frame-2025-ce-beau-tv-tableau-de-55-pouces-est-a-un-super-prix-pour-le-pre-black-friday-chez-fnac-et-darty</guid>
      <description>
La star des salons arty revient en 2025 avec une dalle QLED qui envoie du 144 Hz, un processeur boost&#233; &#224; l&#8217;IA et, Black Friday oblige, un prix presque artistique. Le Samsung The Frame TQ55LS03F tombe &#224; 899 euros au lieu de 1 499 euros sur la Fnac et m&#234;me chez Darty.
</description>
    </item>
    <item>
      <title>Netflix&#8217;s first TV party games including Pictionary are now available to play for free, but we&#8217;ll have to wait for the Knives Out spin-off</title>
      <link>https://www.techradar.com/streaming/netflix/netflixs-first-tv-party-games-including-pictionary-are-now-available-to-play-for-free-but-well-have-to-wait-for-the-knives-out-spin-off</link>
      <pubDate>Fri, 14 Nov 2025 16:20:31 +0000</pubDate>
      <guid isPermaLink="false">C3jQb3LuQZ65yymGUgFtnN</guid>
      <description>Netflix games gets huge refresh with six new party challenges to play on your TV &#8211; but the best of the bunch has set no release date.</description>
    </item>
    <item>
      <title>Fnac et Darty se montrent bien g&#233;n&#233;reux pour le week-end du pr&#233;-Black Friday avec ces 23 offres</title>
      <link>https://www.frandroid.com/bons-plans/2849237_top-promo-fnac-darty-la-selection-pre-black-friday</link>
      <pubDate>Fri, 14 Nov 2025 16:11:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849237_top-promo-fnac-darty-la-selection-pre-black-friday</guid>
      <description>
Le pr&#233;-Black Friday bat son plein chez les diff&#233;rents e-commer&#231;ants fran&#231;ais. &#201;videmment, la Fnac et Darty sont de la partie pour vous faire de belles &#233;conomies. Voici les meilleurs produits Tech en promotion que l&#8217;on recommande &#224; cette occasion.
</description>
    </item>
    <item>
      <title>The Steam Machine Is Not Built for Hardcore PC Gamers</title>
      <link>https://gizmodo.com/steam-machine-not-for-hardcore-pc-gamers-2000686047</link>
      <pubDate>Fri, 14 Nov 2025 16:10:57 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000686047</guid>
      <description>And that&#8217;s totally okay.</description>
    </item>
    <item>
      <title>Weight-Loss Drug Zepbound Is Being Tested as a Treatment for Long Covid</title>
      <link>https://www.wired.com/story/weight-loss-drug-zepbound-is-being-tested-as-a-treatment-for-long-covid/</link>
      <pubDate>Fri, 14 Nov 2025 16:10:09 +0000</pubDate>
      <guid isPermaLink="false">6914fa40012b7ad400825776</guid>
      <description>GLP-1s are being studied for a wide range of conditions. Now, scientists will test whether their anti-inflammatory properties can help alleviate symptoms of long Covid.</description>
    </item>
    <item>
      <title>DoorDash confirms serious data breach - customer names, addresses, emails are more all leaked, here's what we know</title>
      <link>https://www.techradar.com/pro/security/doordash-confirms-serious-data-breach-customer-names-addresses-emails-are-more-all-leaked-heres-what-we-know</link>
      <pubDate>Fri, 14 Nov 2025 16:01:00 +0000</pubDate>
      <guid isPermaLink="false">MzQDXjFLrSrXRXQBK6iskS</guid>
      <description>It's playing down the importance of the breach but victims are speaking out.</description>
    </item>
    <item>
      <title>Carol&#8217;s Rant on This Week&#8217;s &#8216;Pluribus&#8217; Suggests Yet Another Meaning Behind the Show</title>
      <link>https://gizmodo.com/pluribus-episode-3-spoilers-carol-influencers-2000684414</link>
      <pubDate>Fri, 14 Nov 2025 16:00:55 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000684414</guid>
      <description>Apple TV&#8217;s sci-fi hit explores a world where (nearly) everyone shares the same brain.</description>
    </item>
    <item>
      <title>Oldest RNA Ever Recovered Captures a Woolly Mammoth&#8217;s Dying Moments</title>
      <link>https://gizmodo.com/oldest-rna-ever-recovered-captures-a-woolly-mammoths-dying-moments-2000686048</link>
      <pubDate>Fri, 14 Nov 2025 16:00:43 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000686048</guid>
      <description>A new study opens the door to a whole new world of ancient genome research.</description>
    </item>
    <item>
      <title>9 reasons why you should consider onsite LLM training and inferencing</title>
      <link>https://www.techradar.com/pro/9-reasons-why-you-should-consider-onsite-llm-training-and-inferencing</link>
      <pubDate>Fri, 14 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">nYCLSUrEsTEqZHCXcbWSdY</guid>
      <description>Onsite LLM deployment isn't cheap, but there are many reasons to it beats a third-party service.</description>
    </item>
    <item>
      <title>Databricks: 'PDF parsing for agentic AI is still unsolved' &#8212; new tool replaces multi-service pipelines with single function</title>
      <link>https://venturebeat.com/data-infrastructure/databricks-pdf-parsing-for-agentic-ai-is-still-unsolved-new-tool-replaces</link>
      <pubDate>Fri, 14 Nov 2025 16:00:00 GMT</pubDate>
      <guid isPermaLink="false">5wPa2TJ8y4x8UZ0f4AEm3g</guid>
      <description>There is a lot of enterprise data trapped in PDF documents. To be sure, gen AI tools have been able to ingest and analyze PDFs, but accuracy, time and cost have been less than ideal. New technology from Databricks could change that.The company this week detailed its "ai_parse_document" technology, now integrated with Databricks' Agent Bricks platform. The technology addresses a critical bottleneck in enterprise AI adoption: Approximately 80% of enterprise knowledge remains locked in PDFs, reports and diagrams that AI systems struggle to accurately process and understand."It's a common assumpti...</description>
    </item>
    <item>
      <title>Boulanger liquide ses stocks pour le week-end du pr&#233;-Black Friday : les 23 deals &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2859523_boulanger-multiplie-deja-les-promotions-au-pre-black-friday-les-16-deals-a-retenir</link>
      <pubDate>Fri, 14 Nov 2025 15:56:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2859523_boulanger-multiplie-deja-les-promotions-au-pre-black-friday-les-16-deals-a-retenir</guid>
      <description>
Depuis fin octobre, Boulanger lance ses offres pr&#233;-Black Friday avec jusqu&#8217;&#224; 40&#8239;% de r&#233;duction sur de nombreux produits tech, dont smartphones, TV, ordinateurs portables et appareils audio. D&#233;couvrez celles qui valent le d&#233;tour. 
</description>
    </item>
    <item>
      <title>ChatGPT Group Chats are here... but not for everyone (yet)</title>
      <link>https://venturebeat.com/ai/chatgpt-group-chats-are-here-but-not-for-everyone-yet</link>
      <pubDate>Fri, 14 Nov 2025 15:54:00 GMT</pubDate>
      <guid isPermaLink="false">2myBuzWETDDmiEclFY89gZ</guid>
      <description>It was originally found in leaked code and publicized by AI influencers on X, but OpenAI has made it official: ChatGPT now offers Group Chats, allowing multiple users to join the same, single ChatGPT conversation and send messages to each other and the underlying large language model (LLM), online and via its mobile apps. Imagine adding ChatGPT as another member of your existing group chats, allowing you to text it as you would one of your friends or family members and have them respond as well, and you'll have an idea of the intriguing power and potential of this feature.However, the feature ...</description>
    </item>
    <item>
      <title>Souverainet&#233; europ&#233;enne&#160;: ces 40 organisations appellent &#224; miser sur l&#8217;IA open source</title>
      <link>https://www.01net.com/actualites/souverainete-europeenne-ces-40-organisations-appellent-a-miser-sur-lia-open-source.html</link>
      <pubDate>Fri, 14 Nov 2025 15:49:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308181</guid>
      <description>45 organisations dont Mozilla et Mistral AI demandent aux dirigeants fran&#231;ais, allemand et europ&#233;en de miser sur l'intelligence artificielle open source pour r&#233;duire leur d&#233;pendance aux mod&#232;les d'IA propri&#233;taires et favoriser la construction d'une souverainet&#233; num&#233;rique.</description>
    </item>
    <item>
      <title>Netflix change la donne&#8239;: jouez sur votre t&#233;l&#233; sans console gr&#226;ce &#224; votre smartphone, voici comment faire</title>
      <link>https://www.frandroid.com/services/2870051_netflix-change-la-donne-jouez-sur-votre-tele-sans-console-grace-a-votre-smartphone-voici-comment-faire</link>
      <pubDate>Fri, 14 Nov 2025 15:44:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/2870051_netflix-change-la-donne-jouez-sur-votre-tele-sans-console-grace-a-votre-smartphone-voici-comment-faire</guid>
      <description>
Jusqu&#8217;ici le service Netflix Gaming &#233;tait uniquement disponible sur les smartphones mais depuis peu, il est possible de jouer aussi directement sur votre t&#233;l&#233;viseur, sans avoir besoin de console ou de manettes sp&#233;cifiques. On vous explique tout.
</description>
    </item>
    <item>
      <title>&#171; C&#8217;est dangereux en soi &#187; : le patron de Perplexity AI met en garde contre les compagnons IA</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2869865_cest-dangereux-en-soi-le-patron-de-perplexity-ai-met-en-garde-contre-les-compagnons-ia</link>
      <pubDate>Fri, 14 Nov 2025 15:42:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2869865_cest-dangereux-en-soi-le-patron-de-perplexity-ai-met-en-garde-contre-les-compagnons-ia</guid>
      <description>
Alors que de plus en plus d'internautes d&#233;veloppent des relations fortes avec les chatbots, le PDG de Perplexity AI tire la sonnette d'alarme.
</description>
    </item>
    <item>
      <title>German court rules Google must pay &#8364;572M for violating antitrust rules in price comparison sector</title>
      <link>https://techcrunch.com/2025/11/14/german-court-rules-google-must-pay-e572m-for-violating-antitrust-rules-in-price-comparison-sector/</link>
      <pubDate>Fri, 14 Nov 2025 15:40:13 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3067942</guid>
      <description>A German court has found that Google has abused its dominant market position in the price comparison sector, ruling that the company must pay a total of &#8364;572 million ($665.6 million) in damages to two German price comparison companies.</description>
    </item>
    <item>
      <title>Global mining giant BHP is found liable in Brazil&#8217;s worst environmental disaster</title>
      <link>https://www.fastcompany.com/91442151/global-mining-giant-bhp-found-liable-brazils-worst-environmental-disaster</link>
      <pubDate>2025-11-14T15:37:46</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91442151/global-mining-giant-bhp-found-liable-brazils-worst-environmental-disaster</guid>
      <description>High Court Justice Finola O&#8217;Farrell said that Australia-based BHP was responsible, despite not owning the dam at the time, finding its negligence, carelessness, or lack of skill led to the collapse.
A London judge ruled Friday that global mining company BHP Group is liable in Brazil&#8217;s worst environmental disaster when a dam collapse a decade ago unleashed tons of toxic waste into a major river, killing 19 people and devastating villages downstream.High Court Justice Finola O&#8217;Farrell said that Australia-based BHP was responsible, despite not owning the dam at the time, finding its negligence, c...</description>
    </item>
    <item>
      <title>Project Kuiper devient Amazon Leo, la riposte satellitaire d&#8217;Amazon face &#224; Starlink</title>
      <link>https://www.frandroid.com/marques/amazon/2870029_project-kuiper-devient-amazon-leo-la-riposte-satellitaire-damazon-face-a-starlink</link>
      <pubDate>Fri, 14 Nov 2025 15:34:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazon/2870029_project-kuiper-devient-amazon-leo-la-riposte-satellitaire-damazon-face-a-starlink</guid>
      <description>
Changement de cap strat&#233;gique chez Amazon : le concurrent de Starlink quitte le nom de code &#171;&#160;Project Kuiper&#160;&#187; et s&#8217;appelle d&#233;sormais Amazon Leo. Cette nouvelle &#233;tape n&#8217;intervient pas n&#8217;importe quand, mais juste avant que le g&#233;ant am&#233;ricain s&#8217;appr&#234;te &#224; lancer son service internet par satellite en orbite basse.
</description>
    </item>
    <item>
      <title>WhatsApp to launch third-party chat integration in Europe soon</title>
      <link>https://techcrunch.com/2025/11/14/whatsapp-to-launch-third-party-chat-integration-in-europe-soon/</link>
      <pubDate>Fri, 14 Nov 2025 15:32:50 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3067947</guid>
      <description>Users in Europe who have opted in to the third-party integration will be able to share messages, images, voice messages,&#160;videos,&#160;and&#160;files.</description>
    </item>
    <item>
      <title>CISA warns exploited Cisco flaws are a serious risk, so patch now</title>
      <link>https://www.techradar.com/pro/security/cisa-warns-exploited-cisco-flaws-are-a-serious-risk-so-patch-now</link>
      <pubDate>Fri, 14 Nov 2025 15:32:00 +0000</pubDate>
      <guid isPermaLink="false">PcKXzSS2BtJu4poLLptmiG</guid>
      <description>Some agencies failed to properly apply Cisco patch and thought they were safe, CISA warns.</description>
    </item>
    <item>
      <title>In Ancient Egypt, Opium Was a &#8216;Fixture of Daily Life,&#8217; Study Suggests</title>
      <link>https://gizmodo.com/in-ancient-egypt-opium-was-a-fixture-of-daily-life-study-suggests-2000685737</link>
      <pubDate>Fri, 14 Nov 2025 15:30:27 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000685737</guid>
      <description>Researchers analyzed brown residue in an incredibly rare alabaster vase.</description>
    </item>
    <item>
      <title>8 Best MagSafe Phone Grips (2025), Tested and Reviewed</title>
      <link>https://www.wired.com/gallery/best-magsafe-grips/</link>
      <pubDate>Fri, 14 Nov 2025 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">67e431d2c92dedbbb76ae8e0</guid>
      <description>Take the strain off with these comfortable, durable, and lightweight smartphone grips.</description>
    </item>
    <item>
      <title>Picture this: A DTC-era company that&#8217;s thriving</title>
      <link>https://www.fastcompany.com/91430312/picture-this-a-dtc-era-company-thats-thriving</link>
      <pubDate>2025-11-14T15:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91430312/picture-this-a-dtc-era-company-thats-thriving</guid>
      <description>Framebridge, the custom framing company, survived the DTC winter by not chasing the cool kids. An object lesson in survival from one of the last market bubbles. 
In the late 2010s, at the height of the direct-to-consumer boom, Framebridge founder Susan Tynan was green with envy. Many other venture-backed startups from the era&#8212;like Casper, Away, and Glossier&#8212;were growing much faster than her custom framing business. ...</description>
    </item>
    <item>
      <title>All MAGA Wanted Was the Epstein Files. Now They're Ignoring Them</title>
      <link>https://www.wired.com/story/maga-wanted-epstein-files-now-theyre-ignoring-them/</link>
      <pubDate>Fri, 14 Nov 2025 15:19:59 +0000</pubDate>
      <guid isPermaLink="false">6915dfd0c4788638a6e2e848</guid>
      <description>For years, MAGA influencers demanded the release of the Epstein files. Now that 20,000 documents have been released, many raising questions about Donald Trump, they're shrugging.</description>
    </item>
    <item>
      <title>Pine Labs gets warm market welcome on $440M India IPO despite a valuation trim</title>
      <link>https://techcrunch.com/2025/11/14/pine-labs-gets-warm-market-welcome-on-440m-india-ipo-despite-a-valuation-trim/</link>
      <pubDate>Fri, 14 Nov 2025 15:17:27 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3067939</guid>
      <description>Pine Labs, backed by PayPal and Mastercard, gained 14% on its market debut.</description>
    </item>
    <item>
      <title>Photoshop ou Excel sur un Chromebook&#160;? Google a une arme pour (enfin) faire tourner les apps Windows</title>
      <link>https://www.01net.com/actualites/photoshop-ou-excel-sur-un-chromebook-google-a-une-arme-pour-enfin-faire-tourner-les-apps-windows.html</link>
      <pubDate>Fri, 14 Nov 2025 15:16:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308227</guid>
      <description>Google relance Cameyo, sa solution pour &#171; streamer &#187; les apps Windows sur ChromeOS. L'objectif : faire sauter le &#171; verrou applicatif &#187; qui emp&#234;che les entreprises de quitter Windows.</description>
    </item>
    <item>
      <title>What you see is how you feel: how smarter displays shape the way we work and feel</title>
      <link>https://www.techradar.com/pro/what-you-see-is-how-you-feel-how-smarter-displays-shape-the-way-we-work-and-feel</link>
      <pubDate>Fri, 14 Nov 2025 15:15:11 +0000</pubDate>
      <guid isPermaLink="false">VLkzpktqNnCbDouTNyWsS7</guid>
      <description>The role of smarter monitors in reducing strain and supporting wellness in today&#8217;s digital-first workplaces.</description>
    </item>
    <item>
      <title>Black Friday PC portables : la s&#233;lection des 12 meilleures offres sur les laptops bureautiques et gaming d&#8217;Apple, Asus, MSI&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2848587_black-friday-pc-portable-la-selection-des-11-meilleures-offres-sur-les-laptops-bureautiques-et-gaming-dapple-msi-lenovo</link>
      <pubDate>Fri, 14 Nov 2025 15:14:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848587_black-friday-pc-portable-la-selection-des-11-meilleures-offres-sur-les-laptops-bureautiques-et-gaming-dapple-msi-lenovo</guid>
      <description>
Besoin d&#8217;un nouvel ordinateur portable ? Que vous recherchiez une machine bureautique ou un mod&#232;le taill&#233; pour le gaming, il y en a pour tous les go&#251;ts durant l&#8217;avant-premi&#232;re du Black Friday. Les marques phares comme Apple, Asus, HP, Lenovo ou encore MSI affichent d&#233;j&#224; de belles r&#233;ductions, pour tous les budgets et tous les usages.
</description>
    </item>
    <item>
      <title>Pixel 10 Pro Fold review: Google&#8217;s bet to make foldables sturdy</title>
      <link>https://techcrunch.com/2025/11/14/pixel-10-pro-fold-review-googles-bet-to-make-foldables-sturdy/</link>
      <pubDate>Fri, 14 Nov 2025 15:13:22 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3064182</guid>
      <description>Google&#8217;s Pixel 10 Pro Fold improves durability with a tighter hinge, IP68 rating, a bigger battery and brighter display, but its weaker camera system compared to the Pixel 10 Pro muddy its &#8220;Pro&#8221; branding.</description>
    </item>
    <item>
      <title>The UK&#8217;s broken energy system could burst its AI bubble</title>
      <link>https://www.techradar.com/pro/the-uks-broken-energy-system-could-burst-its-ai-bubble</link>
      <pubDate>Fri, 14 Nov 2025 15:09:25 +0000</pubDate>
      <guid isPermaLink="false">VdfXNv8jupZ5cmP9swtGtF</guid>
      <description>Outdated energy infrastructure threatens to pull the plug on Britain&#8217;s AI dream.</description>
    </item>
    <item>
      <title>Ne mettez pas &#224; jour votre Switch 2 si vous avez un dock non officiel</title>
      <link>https://www.frandroid.com/marques/nintendo/2869677_ne-mettez-pas-a-jour-votre-switch-2-si-vous-avez-un-dock-non-officiel</link>
      <pubDate>Fri, 14 Nov 2025 15:08:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nintendo/2869677_ne-mettez-pas-a-jour-votre-switch-2-si-vous-avez-un-dock-non-officiel</guid>
      <description>
La derni&#232;re mise &#224; jour de la Nintendo Switch 2, num&#233;rot&#233;e 21.0.0, semble emp&#234;cher les docks non officiels de fonctionner. De nombreux mod&#232;les sont impact&#233;s.
</description>
    </item>
    <item>
      <title>Xiaomi profite du pr&#233;-Black Friday pour brader ses produits les plus populaires : les 16 offres &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2858733_xiaomi-profite-du-pre-black-friday-pour-brader-ses-produits-les-plus-populaires-les-8-offres-a-saisir</link>
      <pubDate>Fri, 14 Nov 2025 15:01:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2858733_xiaomi-profite-du-pre-black-friday-pour-brader-ses-produits-les-plus-populaires-les-8-offres-a-saisir</guid>
      <description>
Xiaomi n&#8217;a pas attendu longtemps pour casser les prix lors du pr&#233;-Black Friday. De nombreux mod&#232;les phares de la marque sont concern&#233;s, m&#234;me les plus r&#233;centes, comme le 15T. &#160;Dans cette s&#233;lection, vous trouverez les meilleurs produits du constructeur chinois aux meilleurs prix. 
</description>
    </item>
    <item>
      <title>Why You&#8217;ve Seen Way Less &#8216;Wicked: For Good&#8217; Press Memes and Way More Merch</title>
      <link>https://gizmodo.com/wicked-for-good-marketing-collabs-universal-2000686026</link>
      <pubDate>Fri, 14 Nov 2025 15:00:42 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000686026</guid>
      <description>Holding space has given up space for a lot more bizarre brand collaborations.</description>
    </item>
    <item>
      <title>Akira ransomware is now targeting Nutanix VMs - and scoring big rewards</title>
      <link>https://www.techradar.com/pro/security/akira-ransomware-is-now-targeting-nutanix-vms-and-scoring-big-rewards</link>
      <pubDate>Fri, 14 Nov 2025 15:00:26 +0000</pubDate>
      <guid isPermaLink="false">BaZqUcXKKJJtYuboEtAFUA</guid>
      <description>Akira ransomware hackers are expanding their reach - and increasing their profits.</description>
    </item>
    <item>
      <title>11 Best Android Phones of 2025, Tested and Reviewed</title>
      <link>https://www.wired.com/gallery/best-android-phones/</link>
      <pubDate>Fri, 14 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">5ad9f8845ac0d714a1b64321</guid>
      <description>Shopping for a phone can be an ordeal. That&#8217;s why we&#8217;ve tested almost every Android phone, from the smartest to the cheapest&#8212;even phones that fold&#8212;to find the ones worth your money.</description>
    </item>
    <item>
      <title>The Running Man is a propulsive tribute to &amp;#8217;80s action movies</title>
      <link>https://www.theverge.com/entertainment/820502/the-running-man-review</link>
      <pubDate>2025-11-14T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=820502</guid>
      <description>When The Running Man was first published in 1982 under Stephen King's Richard Bachman pseudonym, the United States was just beginning to feel the impacts of then-president Ronald Reagan's neoliberal economic policies. Under Reaganomics, massive tax breaks for the wealthy and deep cuts to social safety programs like food stamps and Medicaid drastically intensified income [&#8230;]...</description>
    </item>
    <item>
      <title>Counting Renaissance butts in Rome with the Meta Ray-Ban Display</title>
      <link>https://www.theverge.com/column/820894/optimizer-meta-ray-ban-display-enterprise-wearables-tourism-renaissance-art</link>
      <pubDate>2025-11-14T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=820894</guid>
      <description>This is Optimizer, a weekly newsletter sent every Friday from Verge senior reviewer Victoria Song that dissects and discusses the latest phones, smartwatches, apps, and other gizmos that swear they're going to change your life. Optimizer arrives in our subscribers' inboxes at 10AM ET. Opt in for Optimizer here. It's a truth universally acknowledged that [&#8230;]...</description>
    </item>
    <item>
      <title>7 new movies and TV shows to watch on Netflix, Prime Video, HBO Max and more this weekend (November 14)</title>
      <link>https://www.techradar.com/streaming/7-new-movies-and-tv-shows-to-watch-on-netflix-prime-video-hbo-max-and-more-this-weekend-november-14</link>
      <pubDate>Fri, 14 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">bH4h2UCdwxBU9kqgsxMiGG</guid>
      <description>The weekend has arrived, and these are the new movies and shows you'll want to watch before Monday rolls around.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Saturday, November 15 (game #1391)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-15-november-2025</link>
      <pubDate>Fri, 14 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">UxommJ2Tu5WVU3rvBNL6Vm</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Saturday, November 15 (game #888)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-15-november-2025</link>
      <pubDate>Fri, 14 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">4opXzhdfyTvNQRHk7hXMBC</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Saturday, November 15 (game #622)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-15-november-2025</link>
      <pubDate>Fri, 14 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">3TakBvjgKGkwtBsEEKeX66</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>This simple map can help New Yorkers in need find food</title>
      <link>https://www.fastcompany.com/91440453/this-simple-map-can-help-new-yorkers-in-need-find-food</link>
      <pubDate>2025-11-14T15:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91440453/this-simple-map-can-help-new-yorkers-in-need-find-food</guid>
      <description>Dora.nyc turns a labyrinthine system of community fridges, shelters, and more into an easy-to-read resource. 
As a community organizer in New York City, Sharifa Khan spends a lot of time visiting food distribution hubs, community gardens, and local shelters. While speaking with community members, she often encounters the same issue: people want to get involved in volunteering, but they&#8217;re not sure where to start. So, Khan decided to make a tool to address that&#8212;and it couldn&#8217;t have come at a more important moment....</description>
    </item>
    <item>
      <title>Black Friday audio : les &#233;couteurs sans fil, casques, barres de son et enceintes montent le volume et baissent leur prix dans ce top des offres</title>
      <link>https://www.frandroid.com/bons-plans/2849763_le-pre-black-friday-est-la-meilleure-excuse-pour-changer-decouteurs-ou-de-barre-de-son-voici-notre-top-10-des-meilleures-offres-sur-laudio</link>
      <pubDate>Fri, 14 Nov 2025 14:56:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849763_le-pre-black-friday-est-la-meilleure-excuse-pour-changer-decouteurs-ou-de-barre-de-son-voici-notre-top-10-des-meilleures-offres-sur-laudio</guid>
      <description>
Apple AirPods, Sony, JBL Charge, Marshall, Nothing, Bowers &amp; Wilkins... Les grandes marques de l'audio bradent leurs &#233;couteurs, casques, enceintes, barres de son et autres pendant l'avant-premi&#232;re du Black Friday. Voici notre s&#233;lection des meilleures offres pour vous faire plaisir.
</description>
    </item>
    <item>
      <title>Bbox fit&#160;: tout ce qu&#8217;il faut savoir sur la box internet pas ch&#232;re de Bouygues Telecom</title>
      <link>https://www.frandroid.com/marques/bouygues-telecom/1885727_bbox-fit-tout-ce-quil-faut-savoir-sur-la-box-dentree-de-gamme-de-bouygues-telecom</link>
      <pubDate>Fri, 14 Nov 2025 14:53:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bouygues-telecom/1885727_bbox-fit-tout-ce-quil-faut-savoir-sur-la-box-dentree-de-gamme-de-bouygues-telecom</guid>
      <description>
&#201;ligible &#224; la fibre de Bouygues Telecom sans pour autant vouloir d&#233;penser des mille et des cents dans l'abonnement internet ? La Bbox fit est l'offre fibre la moins ch&#232;re de l'op&#233;rateur, elle s'accompagne d'une box internet en Wi-Fi 6. Voici tout ce qu'il faut savoir &#224; son sujet.
</description>
    </item>
    <item>
      <title>&#8216;This is the right time to retire&#8217;: Walmart CEO Doug McMillon steps down. Retail giant names new boss</title>
      <link>https://www.fastcompany.com/91442194/walmart-ceo-doug-mcmillion-steps-down-stock-slips-new-boss</link>
      <pubDate>2025-11-14T14:53:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91442194/walmart-ceo-doug-mcmillion-steps-down-stock-slips-new-boss</guid>
      <description>The change in leadership follows a similar sequence of past transitions at the company, with McMillon saying on for a while in an advisory capacity.  
There&#8217;s a new sheriff in Bentonville.</description>
    </item>
    <item>
      <title>These are the only early Black Friday earbuds and headphones deals worth buying &#8211; and I know because I tested them all (and rated them highly) in 2025</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/these-are-the-only-early-black-friday-earbuds-and-headphones-deals-worth-buying-and-i-know-because-i-tested-them-all-and-rated-them-highly-in-2025</link>
      <pubDate>Fri, 14 Nov 2025 14:52:22 +0000</pubDate>
      <guid isPermaLink="false">2joSJCLjEDcgtGR8dzZ57G</guid>
      <description>On Black Friday, there are earbuds deals that save you a bit of money, and there are genuine bargains &#8211;so let's go for option two, shall we?</description>
    </item>
  </channel>
</rss>
