<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 14 Nov 2025 14:39:40 GMT</lastBuildDate>
    <item>
      <title>Le Single Day AliExpress se poursuit, mais plus pour longtemps : voici les meilleures offres high-tech &#224; saisir [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2857195_le-single-day-aliexpress-se-poursuit-mais-plus-pour-longtemps-voici-les-meilleures-offres-high-tech-a-saisir</link>
      <pubDate>Fri, 14 Nov 2025 14:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2857195_le-single-day-aliexpress-se-poursuit-mais-plus-pour-longtemps-voici-les-meilleures-offres-high-tech-a-saisir</guid>
      <description>
Connaissez-vous le Single Day ? Venue de Chine, cette f&#234;te propuls&#233;e en France par AliExpress est une occasion r&#234;v&#233;e pour faire le plein de bonnes affaires. D&#233;couvrez les meilleurs bons plans tech de cette journ&#233;e devenue iconique.
</description>
    </item>
    <item>
      <title>Black Friday : la cr&#232;me des offres sur les smartphones premium (Apple, Samsung, Google&#8230;)</title>
      <link>https://www.frandroid.com/bons-plans/2848295_black-friday-smartphones-meme-les-derniers-iphone-dapple-sont-a-prix-casse-dans-ce-top-10-des-meilleures-offres</link>
      <pubDate>Fri, 14 Nov 2025 14:30:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848295_black-friday-smartphones-meme-les-derniers-iphone-dapple-sont-a-prix-casse-dans-ce-top-10-des-meilleures-offres</guid>
      <description>
Cela commence &#224; devenir une tradition chez les e-commer&#231;ants, le Black Friday commence t&#244;t, et m&#234;me tr&#232;s t&#244;t. Depuis deux semaines, les promotions pleuvent sur les Samsung Galaxy, iPhone, Xiaomi et Google Pixel et &#231;a ne se calme pas ! Voici les meilleures offres sur les smartphones premium.
</description>
    </item>
    <item>
      <title>15 Best Camera Accessories for Phones (2025): Tripods, Mics, and Lights</title>
      <link>https://www.wired.com/gallery/best-photo-video-accessories-for-phones/</link>
      <pubDate>Fri, 14 Nov 2025 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">5da0e4a75e69b80009416282</guid>
      <description>From mobile lenses to wireless mics, here&#8217;s everything you need for your portable, pro-grade photo or video studio.</description>
    </item>
    <item>
      <title>The Meta Quest 3S is $50 off and comes with a $50 gift card and a game</title>
      <link>https://www.theverge.com/gadgets/820921/meta-quest-3s-black-friday-deal-sale</link>
      <pubDate>2025-11-14T09:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=820921</guid>
      <description>You don&#8217;t have to wait two more weeks to pick up a great gadget as a gift; early Black Friday deals are in full swing. Case in point: Best Buy is offering the 128GB Meta Quest 3S for $249 ($50 off) along with a $50 gift card and a copy of The Walking Dead: Saints [&#8230;]</description>
    </item>
    <item>
      <title>Samsung casse les prix de ses meilleurs produits Galaxy durant le pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2852851_samsung-nhesite-pas-a-casser-le-prix-de-ses-produits-galaxy-et-autres-durant-le-pre-black-friday</link>
      <pubDate>Fri, 14 Nov 2025 14:27:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2852851_samsung-nhesite-pas-a-casser-le-prix-de-ses-produits-galaxy-et-autres-durant-le-pre-black-friday</guid>
      <description>
Le pr&#233;-Black Friday a d&#233;but&#233; il y a plus d&#8217;une semaine et les produits Samsung n&#8217;ont pas &#233;t&#233; &#233;pargn&#233;s. Des r&#233;f&#233;rences r&#233;centes telles que le Galaxy S25 Ultra profite de remises in&#233;dites, ce qui permet de s&#8217;&#233;quiper avec la derni&#232;re g&#233;n&#233;ration &#224; moindre co&#251;t pendant toute cette p&#233;riode promotionnelle.
</description>
    </item>
    <item>
      <title>Incroyable mais vrai&#160;: si vous recevez un mail de Taylor Swift, c&#8217;est probablement une arnaque</title>
      <link>https://www.01net.com/actualites/incroyable-mais-vrai-si-vous-recevez-un-mail-de-taylor-swift-cest-probablement-une-arnaque.html</link>
      <pubDate>Fri, 14 Nov 2025 14:24:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308188</guid>
      <description>Le g&#233;ant des antivirus McAfee d&#233;voile son classement 2025 des c&#233;l&#233;brit&#233;s les plus exploit&#233;es par les pirates pour vous pi&#233;ger et vous soutirer de l&#8217;argent.</description>
    </item>
    <item>
      <title>Verizon reportedly set to cut as many as 15,000 jobs</title>
      <link>https://www.techradar.com/pro/verizon-reportedly-set-to-cut-as-many-as-15-000-jobs</link>
      <pubDate>Fri, 14 Nov 2025 14:03:00 +0000</pubDate>
      <guid isPermaLink="false">xhrYrnc6uXCvPM9cDDFUxk</guid>
      <description>Thousands could lose their jobs as Verizon stores turn into franchise stores and management departs.</description>
    </item>
    <item>
      <title>Bad Bunny wins album of the year and more at the 2025 Latin Grammys</title>
      <link>https://www.fastcompany.com/91442144/bad-bunny-wins-album-year-more-2025-latin-grammys</link>
      <pubDate>2025-11-14T14:01:50</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91442144/bad-bunny-wins-album-year-more-2025-latin-grammys</guid>
      <description>Bad Bunny&#8217;s landmark release &#8216;Deb&#237; Tirar M&#225;s Fotos&#8217; won album of the year. 
It should come as a shock to no one: The 2026 Latin Grammy Awards were all about Bad Bunny. The Puerto Rican superstar won album of the year for his landmark release &#8220;Deb&#237; Tirar M&#225;s Fotos.&#8221; After thanking his family and all those who worked on the album, he ended his speech with &#8220;Puerto Rico, I love you, thank you.&#8221;Those are powerful words honoring a record that doubles as a love letter for his island.The artist born Benito Antonio Mart&#237;nez Ocasio was destined to dominate from the jump. He also won the first award of t...</description>
    </item>
    <item>
      <title>&#8216;Metroid Prime 4: Beyond&#8217; Puts the Switch 2&#8217;s Controls to its Biggest Test</title>
      <link>https://gizmodo.com/metroid-prime-4-hands-on-switch-2-mouse-controls-2000685682</link>
      <pubDate>Fri, 14 Nov 2025 14:00:42 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000685682</guid>
      <description>Psychic Samus in 'Metroid Prime 4' isn't nearly as interesting as mouse mode.</description>
    </item>
    <item>
      <title>I Can&#8217;t Stop Staring at the Hilariously Horrifying Moopsy Death Animation From &#8216;Star Trek Online&#8217;</title>
      <link>https://gizmodo.com/star-trek-online-moopsy-death-animation-lower-decks-2000685854</link>
      <pubDate>Fri, 14 Nov 2025 14:00:30 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000685854</guid>
      <description>In MMORPG space, no one can hear your bones get schlorped out by a cute little critter. But they *can* hear said critter say 'Moopsy.'</description>
    </item>
    <item>
      <title>Amazon&#8217;s Fire Tablets, Tested, So You Don&#8217;t Have To (2025)</title>
      <link>https://www.wired.com/gallery/best-amazon-fire-tablet/</link>
      <pubDate>Fri, 14 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">64e377517b25a434b1f3c081</guid>
      <description>Whether you need a travel-friendly slate or something affordable for the kids, we tested every model to find the right one for every occasion.</description>
    </item>
    <item>
      <title>TikTok users can now share tracks and more from Amazon Music</title>
      <link>https://techcrunch.com/2025/11/14/tiktok-users-can-now-share-tracks-and-more-from-amazon-music/</link>
      <pubDate>Fri, 14 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3067733</guid>
      <description>With a new "Share to TikTok" button, Amazon Music users can share songs, albums, playlists, and personal listening highlights from their Insights on Amazon Music directly to TikTok.</description>
    </item>
    <item>
      <title>The Seduction debuts on HBO Max today &#8211; but one star is already worried that you won't tune in after episode 1</title>
      <link>https://www.techradar.com/streaming/hbo-max/the-seduction-debuts-on-hbo-max-today-but-one-star-is-already-worried-that-you-wont-tune-in-after-episode-1</link>
      <pubDate>Fri, 14 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">JhRiVkXfKjPo2r6HouE5rK</guid>
      <description>The Seduction is the new French historical drama dropping on HBO Max on a weekly basis, but one star is convinced nobody will tune in after episode 1.</description>
    </item>
    <item>
      <title>After years of waiting, I&#8217;ve finally tried Metroid Prime 4: Beyond &#8211; and after just two hours of play, I&#8217;m seriously excited for release day</title>
      <link>https://www.techradar.com/gaming/metroid-prime-4-beyond-preview</link>
      <pubDate>Fri, 14 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">HEHS2p8qNkZNbVDryAL2VP</guid>
      <description>I spent a couple of hours with Metroid Prime 4: Beyond and its hypnotic atmosphere, smooth combat, and rewarding puzzles had me hooked.</description>
    </item>
    <item>
      <title>How to watch BBC Children in Need 2025 online from anywhere for free</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/bbc-children-in-need-2025-online</link>
      <pubDate>Fri, 14 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">7NZF4hRjgeVjLdBrUfyiET</guid>
      <description>Star-studded sketches, shocks and surprises and show-stopping performances. Here's how to watch Children in Need 2025 online, on TV and from anywhere in the world.</description>
    </item>
    <item>
      <title>Metroid Prime 4 looks and feels great, but Im nervous about one little thing</title>
      <link>https://mashable.com/article/metroid-prime-4-nintendo-switch-2-hands-on-preview</link>
      <pubDate>Fri, 14 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">05ppAyGGg2kDyL5AHEYlFao</guid>
      <description>The first 'Metroid Prime' game in nearly two decades is as exciting a prospect as ever, but after playing it, I have questions.</description>
    </item>
    <item>
      <title>Rejoice! Jack Dorsey (Who Killed Vine) Is Resurrecting Vine</title>
      <link>https://gizmodo.com/rejoice-jack-dorsey-who-killed-vine-is-resurrecting-vine-2000685863</link>
      <pubDate>Fri, 14 Nov 2025 13:55:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000685863</guid>
      <description>The fun is back.</description>
    </item>
    <item>
      <title>En France, le navigateur Opera cartonne sur iOS gr&#226;ce au DMA</title>
      <link>https://www.01net.com/actualites/en-france-le-navigateur-opera-cartonne-sur-ios-grace-au-dma.html</link>
      <pubDate>Fri, 14 Nov 2025 13:54:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308221</guid>
      <description>Le DMA, &#231;a marche. C'est du moins le point de vue d'Opera, en contrepoint total d'Apple qui continue sa guerre de tranch&#233;e contre le r&#232;glement sur les march&#233;s num&#233;riques. Le navigateur alternatif a enregistr&#233; une forte croissance en Europe ces deux derni&#232;res ann&#233;es.</description>
    </item>
    <item>
      <title>JBL Clip 5 : cette excellente mini-enceinte not&#233;e 9/10 est &#224; moiti&#233; prix pendant le pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2490242_jbl-clip-5-cette-excellente-mini-enceinte-notee-9-10-est-a-moitie-prix-pendant-le-pre-black-friday</link>
      <pubDate>Fri, 14 Nov 2025 13:51:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2490242_jbl-clip-5-cette-excellente-mini-enceinte-notee-9-10-est-a-moitie-prix-pendant-le-pre-black-friday</guid>
      <description>
Apr&#232;s une quatri&#232;me it&#233;ration de sa mini-enceinte &#224; mousqueton tr&#232;s r&#233;ussie, JBL a d&#233;voil&#233; l'an dernier sa Clip 5, une r&#233;f&#233;rence qui offre notamment une puissance acoustique presque doubl&#233;e. Un mod&#232;le que l'on a beaucoup appr&#233;ci&#233;, et que l'on trouve, pendant le pr&#233;-Black Friday, &#224; 37,10 euros au lieu de 69,99 euros sur Amazon. 
</description>
    </item>
    <item>
      <title>Hot tech stocks are tumbling: Why Tesla, Palantir, Nvidia, and others are leading a market selloff today</title>
      <link>https://www.fastcompany.com/91442171/hot-tech-stocks-are-tumbling-why-tesla-palantir-nvidia-and-others-are-leading-a-market-selloff-today</link>
      <pubDate>2025-11-14T13:49:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91442171/hot-tech-stocks-are-tumbling-why-tesla-palantir-nvidia-and-others-are-leading-a-market-selloff-today</guid>
      <description>After emerging from the government shutdown unscathed, some of the most high-profile technology and AI stocks are taking a hit on Friday.
The stock market survived the longest government shutdown in U.S. history with minimal impact. But it tumbled on Thursday, November 13, amid a sell-off of tech stocks as worries about overinflated values and interest rate cuts grew.&#160;...</description>
    </item>
    <item>
      <title>&#171;&#160;Une facture &#224; z&#233;ro euro&#160;&#187; : cette offre d&#8217;&#233;lectricit&#233; in&#233;dite arrive en France</title>
      <link>https://www.frandroid.com/survoltes/2869527_une-facture-a-zero-euro-cette-offre-delectricite-inedite-arrive-en-france</link>
      <pubDate>Fri, 14 Nov 2025 13:47:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2869527_une-facture-a-zero-euro-cette-offre-delectricite-inedite-arrive-en-france</guid>
      <description>
Qui refuserait une facture d&#8217;&#233;lectricit&#233; annuelle r&#233;duite &#224;&#8230; z&#233;ro euro&#8201;? C&#8217;est pourtant ce que promet Octopus Energy avec sa nouvelle offre, qui garantit au moins cinq ann&#233;es sans facture d&#8217;&#233;lectricit&#233;. Des conditions sont &#224; remplir cependant pour en profiter.
</description>
    </item>
    <item>
      <title>Valve made Microsoft&amp;#8217;s dream console</title>
      <link>https://www.theverge.com/podcast/820889/vergecast-steam-machines-neo-robot-fire-tv-piracy</link>
      <pubDate>2025-11-14T08:45:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=820889</guid>
      <description>Microsoft keeps describing this model for the future of a game console that sounds great for players: it's as easy as a console, it can play a huge library of PC titles, and it even supports third-party stores. That'd be a wonderful product if someone could build it, and it sure looks like Valve has [&#8230;]</description>
    </item>
    <item>
      <title>Woman Marries ChatGPT-Generated Groom Through Breach in the Metaverse</title>
      <link>https://gizmodo.com/woman-marries-chatgpt-generated-groom-through-breach-in-the-metaverse-2000685878</link>
      <pubDate>Fri, 14 Nov 2025 13:35:00 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000685878</guid>
      <description>More and more people want to make it official with their computer-generated lovers.</description>
    </item>
    <item>
      <title>Mise &#224; jour d&#8217;urgence de Chrome&#160;: Google corrige une &#233;ni&#232;me faille du moteur Javascript</title>
      <link>https://www.01net.com/actualites/mise-a-jour-durgence-de-chrome-google-corrige-une-enieme-faille-du-moteur-javascript.html</link>
      <pubDate>Fri, 14 Nov 2025 13:33:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308204</guid>
      <description>Google vient de publier une mise &#224; jour d&#8217;urgence pour Chrome. Le correctif doit colmater une faille critique dans le moteur JavaScript du navigateur. La faille fait suite aux nombreuses vuln&#233;rabilit&#233;s identifi&#233;es dans le moteur cette ann&#233;e.</description>
    </item>
    <item>
      <title>What&#8217;s the Best Hair Straightener for You? It Depends (2025)</title>
      <link>https://www.wired.com/gallery/best-hair-straighteners/</link>
      <pubDate>Fri, 14 Nov 2025 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">604697e118dc939ad9553992</guid>
      <description>Our team tested 30 hair straighteners, from luxe brands like GHD and Dyson to inexpensive models like Conair, to help you find your hair&#8217;s perfect match.</description>
    </item>
    <item>
      <title>Blink cameras are less than half price in Amazon's early Black Friday sale, so don't miss out</title>
      <link>https://www.techradar.com/seasonal-sales/blink-cameras-are-less-than-half-price-in-amazons-early-black-friday-sale-so-dont-miss-out</link>
      <pubDate>Fri, 14 Nov 2025 13:28:52 +0000</pubDate>
      <guid isPermaLink="false">Q3DJsjgHRjgzpP4nBS3Q7J</guid>
      <description>There's never been a better time to upgrade your home security, with epic deals on cameras and video doorbells.</description>
    </item>
    <item>
      <title>LG&#8217;s 34-Inch Curved Monitor (OLED, 240Hz, WQHD) Down to Peanuts, Amazon Reaches an All-Time Low</title>
      <link>https://gizmodo.com/lgs-34-inch-curved-monitor-oled-240hz-wqhd-down-to-peanuts-amazon-reaches-an-all-time-low-2000685938</link>
      <pubDate>Fri, 14 Nov 2025 13:25:40 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000685938</guid>
      <description>This 34-inch curved OLED with 240Hz refresh and 0.03ms response is at a record low price.</description>
    </item>
    <item>
      <title>How to watch Spurs vs. Warriors online for free</title>
      <link>https://mashable.com/article/spurs-warriors-nba-cup-2025-live-stream-for-free</link>
      <pubDate>Fri, 14 Nov 2025 13:23:51 +0000</pubDate>
      <guid isPermaLink="false">05UPZudZMwTimZPyxF9Lti2</guid>
      <description>How to watch NBA for free. Live stream San Antonio Spurs vs. Golden State Warriors in the NBA Cup for free from anywhere in the world.</description>
    </item>
    <item>
      <title>The Lego Botanicals Mini Bonsai Trees set has dropped to its best-ever price at Amazon</title>
      <link>https://mashable.com/article/nov-14-lego-botanicals-mini-bonsai-trees-deal</link>
      <pubDate>Fri, 14 Nov 2025 13:20:31 +0000</pubDate>
      <guid isPermaLink="false">07001Vp5YcgnlcMyDExzzAG</guid>
      <description>As of Nov. 14, the Lego Botanicals Mini Bonsai Trees set is discounted at Amazon to $44.99, 31% off its list price of $64.99.</description>
    </item>
    <item>
      <title>If you say yes to any of these 5 questions, science says you&#8217;re more emotionally intelligent than you think</title>
      <link>https://www.fastcompany.com/91442157/if-you-say-yes-to-any-of-these-5-questions-science-says-youre-more-emotionally-intelligent-than-you-think</link>
      <pubDate>2025-11-14T13:17:08</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91442157/if-you-say-yes-to-any-of-these-5-questions-science-says-youre-more-emotionally-intelligent-than-you-think</guid>
      <description>You may discover you&#8217;re more self-aware, empathetic, and emotionally intelligent than you assume.
Emotional intelligence&#160;matters, and not just on a personal level. Research shows developing greater emotional intelligence can lead to&#160;higher performance and&#160;pay,&#160;as well as&#160;better professional and personal&#160;relationships.</description>
    </item>
    <item>
      <title>Anthropic claims Chinese hackers hijacked Claude to launch AI-orchestrated and automated cyberattacks</title>
      <link>https://www.techradar.com/pro/security/anthropic-claims-chinese-hackers-hijacked-claude-to-launch-ai-orchestrated-and-automated-cyberattacks</link>
      <pubDate>Fri, 14 Nov 2025 13:09:00 +0000</pubDate>
      <guid isPermaLink="false">RDvHAt5qLxxdstvbgDnNSk</guid>
      <description>Around 30 organizations were targeted in the &#8216;highly sophisticated&#8217; campaign, Anthropic says.</description>
    </item>
    <item>
      <title>Bitcoin price crash: Why did it sink to a 6-month low today? What&#8217;s happening with crypto markets?</title>
      <link>https://www.fastcompany.com/91442132/bitcoin-price-crash-today-why-crypto-markets-sinking-low</link>
      <pubDate>2025-11-14T13:06:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91442132/bitcoin-price-crash-today-why-crypto-markets-sinking-low</guid>
      <description>The world&#8217;s most popular cryptocurrency is tumbling this week, a decline that coincides with broader concerns about risk assets. Here&#8217;s what to know.
Investors in Bitcoin are waking up to another bad morning for the world&#8217;s preeminent cryptocurrency. As of the time of this writing, the price of one token is down 6.55% in the last 24 hours to just above $95,000 per coin....</description>
    </item>
    <item>
      <title>The &#8216;Tales of the TMNT&#8217; Are No More</title>
      <link>https://gizmodo.com/tales-of-the-tmnt-cancelled-paramount-mutant-mayhem-2-2000685544</link>
      <pubDate>Fri, 14 Nov 2025 13:00:52 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000685544</guid>
      <description>Plus, 'Creep' director Patrick Brice talks about his hopes for a new sequel.</description>
    </item>
    <item>
      <title>Razer Cobra HyperSpeed: A Basic Gaming Mouse With All You Need</title>
      <link>https://www.wired.com/review/razer-cobra-hyperspeed/</link>
      <pubDate>Fri, 14 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">690e5c5d6092b7e724eae082</guid>
      <description>A plain design belies a lightweight, wireless gaming mouse that delivers a satisfying session.</description>
    </item>
    <item>
      <title>Valve is making microSD cards the next game cartridges</title>
      <link>https://www.theverge.com/games/818602/valve-steam-deck-machine-frame-microsd-card-game-cartridges</link>
      <pubDate>2025-11-14T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=818602</guid>
      <description>The Steam Deck changed the way I buy and play games. Just like how the Nintendo Switch blew me away with how it let me play the latest and greatest Nintendo games on the go and on a TV, the Steam Deck has drawn me in with how it offers a vast catalog of PC [&#8230;]</description>
    </item>
    <item>
      <title>The Pok&#233;mon TCG Phantasmal Flames Elite Trainer Box is at market value on Amazon right now</title>
      <link>https://mashable.com/article/nov-14-phantasmal-flames-elite-trainer-box-deal</link>
      <pubDate>Fri, 14 Nov 2025 12:58:26 +0000</pubDate>
      <guid isPermaLink="false">058fyp5b4bi0kstoUGDYY4Z</guid>
      <description>As of Nov. 14, get Pok&#233;mon TCG Phantasmal Flames Booster Box is at market value at Amazon.</description>
    </item>
    <item>
      <title>The Pok&#233;mon TCG Phantasmal Flames Booster Box is below market value at Amazon</title>
      <link>https://mashable.com/article/nov-14-phantasmal-flames-booster-box-below-market-value-amazon-deal</link>
      <pubDate>Fri, 14 Nov 2025 12:53:44 +0000</pubDate>
      <guid isPermaLink="false">03F9yxbbke4FQLZRAaXYsaT</guid>
      <description>As of Nov. 14, get Pok&#233;mon TCG Phantasmal Flames Booster Box near market value at Amazon.</description>
    </item>
    <item>
      <title>Spotify will now use AI to recap your audiobooks for you &#8211; and I really need this for my Kindle</title>
      <link>https://www.techradar.com/audio/audio-streaming/spotify-will-now-use-ai-to-recap-your-audiobooks-for-you-and-i-really-need-this-for-my-kindle</link>
      <pubDate>Fri, 14 Nov 2025 12:53:22 +0000</pubDate>
      <guid isPermaLink="false">4xmvAJgY22Yzm475WtRyYE</guid>
      <description>Spotify is testing a new feature where you can get audiobook summaries of everything you've heard so far.</description>
    </item>
    <item>
      <title>Pluribus episode 3's ending raises a big question about The Joining, but I don't want the answer to be as obvious as it seems</title>
      <link>https://www.techradar.com/streaming/apple-tv-plus/pluribus-episode-3s-ending-raises-a-big-question-about-the-joining-but-i-dont-want-the-answer-to-be-as-obvious-as-it-seems</link>
      <pubDate>Fri, 14 Nov 2025 12:50:39 +0000</pubDate>
      <guid isPermaLink="false">n32cTWy8xz4SjBM9vXdBCV</guid>
      <description>The third episode of Pluribus drops a big clue about what Carol's new plan of action might be.</description>
    </item>
    <item>
      <title>Save &#163;150 on the new Samsung Galaxy S25 FE with this early Amazon Black Friday deal</title>
      <link>https://www.techradar.com/seasonal-sales/save-gbp150-on-the-new-samsung-galaxy-s25-fe-with-this-early-amazon-black-friday-deal</link>
      <pubDate>Fri, 14 Nov 2025 12:49:40 +0000</pubDate>
      <guid isPermaLink="false">287dN6Rp4PvqK4GYWL37Q</guid>
      <description>The Samsung Galaxy S25 FE is &#163;150 off at Amazon, meaning you can get the drop on sales season and pick up a great Android phone in the process</description>
    </item>
    <item>
      <title>Cette avanc&#233;e sign&#233;e SK Hynix transformerait comment nos smartphones g&#232;rent l&#8217;IA</title>
      <link>https://www.frandroid.com/produits-android/hardware/memoire/2869199_cette-avancee-signee-sk-hynix-transformerait-comment-nos-smartphones-gerent-lia</link>
      <pubDate>Fri, 14 Nov 2025 12:47:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/memoire/2869199_cette-avancee-signee-sk-hynix-transformerait-comment-nos-smartphones-gerent-lia</guid>
      <description>
Le cor&#233;en SK Hynix semble avoir r&#233;ussi &#224; combiner des puces DRAM et NAND en un seul et m&#234;me module m&#233;moire hyper efficace. Cette perc&#233;e dans le domaine de la m&#233;moire vive pourrait doper significativement les performances de nos smartphones et tablettes en IA.
</description>
    </item>
    <item>
      <title>Vine, le r&#233;seau social star, revient sous le nom de Divine</title>
      <link>https://www.frandroid.com/culture-tech/web/2869255_vine-le-reseau-social-star-revient-sous-le-nom-de-divine</link>
      <pubDate>Fri, 14 Nov 2025 12:44:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/web/2869255_vine-le-reseau-social-star-revient-sous-le-nom-de-divine</guid>
      <description>
Pr&#232;s de 10 ans apr&#232;s son arr&#234;t, le c&#233;l&#232;bre r&#233;seau social sp&#233;cialis&#233; dans les courtes vid&#233;os fait son retour. Pour l'occasion, Vine devient Divine et veut pr&#233;server la cr&#233;ativit&#233; humaine. 
</description>
    </item>
    <item>
      <title>Robots &#171;&#160;intelligents&#160;&#187; | L&#8217;ambitieuse qu&#234;te de l&#8217;IA mat&#233;rielle</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-11-14/robots-intelligents/l-ambitieuse-quete-de-l-ia-materielle.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Fri, 14 Nov 2025 07:40:58 -0500</pubDate>
      <guid isPermaLink="false">682b5a11f87130f6b00da895b71b192a</guid>
      <description>Des machines humano&#239;des faisant la vaisselle et la lessive&#160;? C&#8217;est ce que d&#233;veloppe l&#8217;entreprise tokyo&#239;te Enactic, illustrant le nouveau Graal technologique&#160;: introduire l&#8217;intelligence artificielle (IA) dans le monde mat&#233;riel sous forme de robots, voitures autonomes et autres gadgets.</description>
    </item>
  </channel>
</rss>
