<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 19 Jan 2026 13:00:11 GMT</lastBuildDate>
    <item>
      <title>So you got a new robot vacuum &#8211; here are 7 things to do first</title>
      <link>https://www.techradar.com/home/robot-vacuums/so-you-got-a-new-robot-vacuum-here-are-7-things-to-do-first</link>
      <pubDate>Mon, 19 Jan 2026 12:53:03 +0000</pubDate>
      <guid isPermaLink="false">G5ZhYEKDYG8eAN3V2PdgQ</guid>
      <description>Not sure where to start with your new robovac? Follow these 7 steps and you'll be well on your way.</description>
    </item>
    <item>
      <title>D&#233;but de p&#233;nurie sur les MacBook Pro ? Ce que l&#8217;on peut d&#233;duire des d&#233;lais observ&#233;s sur certains mod&#232;les</title>
      <link>https://www.frandroid.com/marques/apple/2947287_debut-de-penurie-sur-les-macbook-pro-ce-que-lon-peut-deduire-des-delais-observes-sur-certains-modeles</link>
      <pubDate>Mon, 19 Jan 2026 12:43:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2947287_debut-de-penurie-sur-les-macbook-pro-ce-que-lon-peut-deduire-des-delais-observes-sur-certains-modeles</guid>
      <description>
Aux &#201;tats-Unis, certains mod&#232;les de MacBook Pro command&#233;s en ligne ne sont plus livr&#233;s qu'apr&#232;s deux mois d'attente. Un d&#233;lai important qui n'augure peut-&#234;tre pas d'une si mauvaise nouvelle.
</description>
    </item>
    <item>
      <title>Why AI skills are the new gold standard for job seekers</title>
      <link>https://www.fastcompany.com/91462113/why-ai-skills-are-the-new-gold-standard-for-job-seekers-ai-skills-hiring-job-hunting</link>
      <pubDate>2026-01-19T12:29:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91462113/why-ai-skills-are-the-new-gold-standard-for-job-seekers-ai-skills-hiring-job-hunting</guid>
      <description>How developing AI capabilities can unlock career opportunities.
Artificial intelligence capabilities have rapidly shifted from nice-to-have extras to essential requirements across industries and job levels. Employers now prioritize candidates who can harness AI tools to multiply productivity, accelerate innovation, and solve complex problems with lean resources. In this article, experts reveal how mastering AI skills can unlock career opportunities, faster promotions, and competitive advantages in today&#8217;s job market....</description>
    </item>
    <item>
      <title>Got a new Garmin watch? One hidden gesture control can return you to home and even lock your touchscreen</title>
      <link>https://www.techradar.com/health-fitness/got-a-new-garmin-watch-one-hidden-gesture-control-can-return-you-to-home-and-even-lock-your-touchscreen</link>
      <pubDate>Mon, 19 Jan 2026 12:28:50 +0000</pubDate>
      <guid isPermaLink="false">9fDmH5QA2ywi5npKcTpP6V</guid>
      <description>Deep in your Garmin watch&#8217;s maze of menus? One quick gesture should get you back to home on most watches.</description>
    </item>
    <item>
      <title>'A great TV for sports' &#8212; Amazon currently has $500 off a TV that we'd highly recommend for the Super Bowl</title>
      <link>https://www.techradar.com/televisions/a-great-tv-for-sports-amazon-currently-has-usd500-off-a-tv-that-wed-highly-recommend-for-the-super-bowl</link>
      <pubDate>Mon, 19 Jan 2026 12:24:23 +0000</pubDate>
      <guid isPermaLink="false">r5whcuAcRvr8tiuGLochNn</guid>
      <description>On the lookout for a decent TV for the big game? The TCL QM8K is an amazing choice, especially with today's massive discount at Amazon.</description>
    </item>
    <item>
      <title>The MacBook Air M4 is portable and powerful &#8212; and our favourite laptop is now at its lowest-ever price</title>
      <link>https://www.techradar.com/computing/macbooks/the-macbook-air-m4-is-portable-and-powerful-and-our-favourite-laptop-is-now-at-its-lowest-ever-price</link>
      <pubDate>Mon, 19 Jan 2026 12:24:17 +0000</pubDate>
      <guid isPermaLink="false">2yXqyqbxzfoP855vVEd3yZ</guid>
      <description>Amazon has surprised us with a record-low price for the super-impressive 13-inch MacBook Air (M4).</description>
    </item>
    <item>
      <title>A fresh Spider-Man: Brand New Day trailer release rumor is gathering pace online &#8212; and Marvel fans think it could be unveiled very soon</title>
      <link>https://www.techradar.com/streaming/entertainment/a-fresh-spider-man-brand-new-day-trailer-release-rumor-is-gathering-pace-online-and-marvel-fans-think-it-could-be-unveiled-very-soon</link>
      <pubDate>Mon, 19 Jan 2026 12:17:53 +0000</pubDate>
      <guid isPermaLink="false">9wKduwb68Ghq3bVNY39csR</guid>
      <description>A new rumor about the release of Spider-Man 4's first trailer has whipped MCU fans into a frenzy.</description>
    </item>
    <item>
      <title>Tempted to join YouTube TV? This limited deal gives you an extended free-trial period, but that's not even the best part</title>
      <link>https://www.techradar.com/streaming/tempted-to-join-youtube-tv-this-limited-deal-gives-you-an-extended-free-trial-period-but-thats-not-even-the-best-part</link>
      <pubDate>Mon, 19 Jan 2026 12:15:04 +0000</pubDate>
      <guid isPermaLink="false">956NZjyNXmWZo8n76LLLwE</guid>
      <description>As well as a 10-day free YouTube TV trial, you'll also save $46 on your first two months as a new subscriber with this deal.</description>
    </item>
    <item>
      <title>PS5, Xbox et Switch 2 fusionnent enfin gr&#226;ce &#224; une cr&#233;atrice de g&#233;nie</title>
      <link>https://www.01net.com/actualites/ps5-xbox-et-switch-2-fusionnent-enfin-grace-a-une-creatrice-de-genie.html</link>
      <pubDate>Mon, 19 Jan 2026 12:14:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320921</guid>
      <description>Une moddeuse de Hong Kong, connue sous le nom de XNZ, a r&#233;ussi l&#8217;exploit de fusionner une PS5, une Xbox Series X et une Nintendo Switch&#8239;2 dans un seul bo&#238;tier triangulaire. Sa cr&#233;ation, baptis&#233;e &#171;&#8239;Ningtendo PXBOX&#8239;5&#8239;&#187;, repousse les limites du modding et de l&#8217;ing&#233;nierie artisanale.</description>
    </item>
    <item>
      <title>C&#8217;est fini&#160;: ASUS confirme l&#8217;arr&#234;t des smartphones pour tout miser sur l&#8217;IA</title>
      <link>https://www.01net.com/actualites/cest-fini-asus-confirme-larret-des-smartphones-pour-tout-miser-sur-lia.html</link>
      <pubDate>Mon, 19 Jan 2026 12:09:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320961</guid>
      <description>Le pr&#233;sident d'ASUS, Jonney Shih, a confirm&#233; que la marque ne produirait plus de nouveaux mod&#232;les de smartphones. Plut&#244;t que des Zenfone et ROG Phone, le futur du g&#233;ant ta&#239;wanais s'&#233;crit d&#233;sormais avec des robots et des lunettes connect&#233;es.</description>
    </item>
    <item>
      <title>&#8216;Fallout&#8217; Season 2&#8217;s Weekly Drops May Not Be Working</title>
      <link>https://gizmodo.com/fallout-season-2s-weekly-drops-may-not-be-working-2000711306</link>
      <pubDate>Mon, 19 Jan 2026 12:00:48 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711306</guid>
      <description>Reception to the new 'Fallout' season is good, but the audience just ain't there on a week-by-week basis.</description>
    </item>
    <item>
      <title>Hand Off Your Floor Cleaning Chores to Roborock&#8217;s Qrevo Curv 2 Flow Robot Vacuum, Now at Its Lowest Price Since Launch</title>
      <link>https://gizmodo.com/hand-off-your-floor-cleaning-chores-to-roborocks-qrevo-curv-2-flow-robot-and-save-150-2000706938</link>
      <pubDate>Mon, 19 Jan 2026 12:00:30 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000706938</guid>
      <description>This next-level robot vacuum and mop works hard so you don't have to, and leaves your carpeted and hard-surfaced floors cleaner than ever.</description>
    </item>
    <item>
      <title>Which Wild Animals Could Humans Domesticate Into the Next Great Pet?</title>
      <link>https://gizmodo.com/which-wild-animals-could-humans-domesticate-into-the-next-great-pet-2000711195</link>
      <pubDate>Mon, 19 Jan 2026 12:00:11 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711195</guid>
      <description>Could raccoons eventually become the latest trendy pet to have?</description>
    </item>
    <item>
      <title>Surfshark adds post-quantum encryption on Mac, Linux, and Android &#8211; more support coming soon</title>
      <link>https://www.techradar.com/vpn/vpn-services/surfshark-adds-post-quantum-encryption-on-mac-linux-and-android-more-support-coming-soon</link>
      <pubDate>Mon, 19 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">4DmHFt82K59PzjsDs2TyAC</guid>
      <description>Surfshark has introduced a new PQC layer on WireGuard, providing extra security against quantum threats. Here's why it matters.</description>
    </item>
    <item>
      <title>Lyft CEO: &#8216;Let&#8217;s stop doing that, please&#8217;</title>
      <link>https://www.fastcompany.com/91474071/lyft-ceo-lets-stop-doing-that-please</link>
      <pubDate>2026-01-19T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91474071/lyft-ceo-lets-stop-doing-that-please</guid>
      <description>With a sharp focus on customer service, Lyft CEO David Risher is writing the ridesharing company&#8217;s comeback story.
Hello and welcome to Modern CEO! I&#8217;m Stephanie Mehta, CEO and chief content officer of Mansueto Ventures. Each week this newsletter explores inclusive approaches to leadership drawn from conversations with executives and entrepreneurs, and from the pages of Inc. and Fast Company. If you received this newsletter from a friend, you can sign up to get it yourself every Monday morning....</description>
    </item>
    <item>
      <title>A prominent Resident Evil leaker claims that a Code: Veronica remake will be announced this year</title>
      <link>https://www.techradar.com/gaming/a-prominent-resident-evil-leaker-claims-that-a-code-veronica-remake-will-be-announced-this-year</link>
      <pubDate>Mon, 19 Jan 2026 11:55:52 +0000</pubDate>
      <guid isPermaLink="false">to3SMdX2rf8gTUsiUoKcvZ</guid>
      <description>A leaker claims that the next Resident Evil remake will be a fresh version of an underrated spin-off.</description>
    </item>
    <item>
      <title>Cette option pratique de Google Gemini va vous faire gagner du temps</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2947291_cette-option-pratique-de-google-gemini-va-vous-faire-gagner-du-temps</link>
      <pubDate>Mon, 19 Jan 2026 11:54:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2947291_cette-option-pratique-de-google-gemini-va-vous-faire-gagner-du-temps</guid>
      <description>
Les &#233;quipes de Google ont d&#233;ploy&#233; un bouton &#171;&#160;R&#233;pondre maintenant &#187; dans l'application Gemini pour obtenir une r&#233;ponse plus rapide en interrompant son processus de raisonnement.
</description>
    </item>
    <item>
      <title>Threads overtakes X on mobile, but still lags far behind</title>
      <link>https://www.theverge.com/news/864099/threads-overtakes-x-daily-mobile-ios-android-users</link>
      <pubDate>2026-01-19T06:53:33-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864099</guid>
      <description>After launching almost three years ago, Meta's Threads is now reportedly attracting more daily mobile users than rival platform X. According to Similarweb data shared by TechCrunch, Threads has 141.5 million daily active iOS and Android global app users as of January 7th, compared to 125 million users for Elon Musk's mobile platform. Similarweb reports [&#8230;]...</description>
    </item>
    <item>
      <title>The Ozone 3K could be the iPhone Air battery pack you&#8217;ve been waiting for</title>
      <link>https://www.techradar.com/phones/iphone/the-ozone-3k-could-be-the-iphone-air-battery-pack-youve-been-waiting-for</link>
      <pubDate>Mon, 19 Jan 2026 11:53:22 +0000</pubDate>
      <guid isPermaLink="false">NLHK75qq2VbzVwsXFeLQoh</guid>
      <description>The Ozone 3K and Ozone 5K are super slim, very light, and compatible with both iPhones and Android devices.</description>
    </item>
    <item>
      <title>This iPhone 17 Pro Max rival could soon steal its crown as the world&#8217;s best camera phone, thanks to a unique sensor and 35mm Zeiss lens</title>
      <link>https://www.techradar.com/phones/this-iphone-17-pro-max-rival-could-soon-steal-its-crown-as-the-worlds-best-camera-phone-thanks-to-a-unique-sensor-and-35mm-zeiss-lens</link>
      <pubDate>Mon, 19 Jan 2026 11:48:53 +0000</pubDate>
      <guid isPermaLink="false">k6sXLqwVj6gZirePggrq54</guid>
      <description>The Vivo X300 Ultra could have the industry's largest multispectral sensor, plus an assortment of other high-end camera specs.</description>
    </item>
    <item>
      <title>Pixel 10a : voici les prix et la date de sortie du prochain smartphone de Google</title>
      <link>https://www.frandroid.com/marques/google/2947459_pixel-10a-voici-les-prix-et-la-date-de-sortie-du-prochain-smartphone-de-google</link>
      <pubDate>Mon, 19 Jan 2026 11:38:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2947459_pixel-10a-voici-les-prix-et-la-date-de-sortie-du-prochain-smartphone-de-google</guid>
      <description>
Le c&#233;l&#232;bre leaker billbil-kun vient de lever le voile sur le futur Google Pixel 10a. Date de commercialisation avanc&#233;e, maintien des tarifs et nouveaux coloris : voici ce que nous r&#233;serve le g&#233;ant de Mountain View pour 2026.
</description>
    </item>
    <item>
      <title>ChatGPT&#160;: pourquoi vous devriez arr&#234;ter d&#8217;&#234;tre poli avec l&#8217;IA</title>
      <link>https://www.01net.com/actualites/chatgpt-pourquoi-vous-devriez-arreter-etre-poli-avec-ia.html</link>
      <pubDate>Mon, 19 Jan 2026 11:36:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320922</guid>
      <description>Des chercheurs r&#233;v&#232;lent qu'&#234;tre malpoli avec ChatGPT pourrait paradoxalement am&#233;liorer ses r&#233;ponses.</description>
    </item>
    <item>
      <title>How to Clean Your Keurig (and When)</title>
      <link>https://www.wired.com/story/how-to-clean-keurig/</link>
      <pubDate>Mon, 19 Jan 2026 11:33:00 +0000</pubDate>
      <guid isPermaLink="false">6966af3e5b3d008e7671c0c6</guid>
      <description>Your pod coffee maker can get gross over time. Here&#8217;s how to clean it up.</description>
    </item>
    <item>
      <title>Dumbphone Owners Have Lost Their Minds</title>
      <link>https://www.wired.com/story/dumbphone-owners-have-literally-lost-their-minds/</link>
      <pubDate>Mon, 19 Jan 2026 11:30:15 +0000</pubDate>
      <guid isPermaLink="false">6967b96d2be92cf562ad3ea3</guid>
      <description>All my Gen Z friends want to ditch their smartphones. It&#8217;s cool. They&#8217;re cool. But there&#8217;s more at stake than they think.</description>
    </item>
    <item>
      <title>Amazon fait le plein de bonnes affaires durant les soldes : le TOP 16 des offres</title>
      <link>https://www.frandroid.com/bons-plans/2933045_amazon-fait-le-plein-de-bonnes-affaires-durant-les-soldes-le-top-16-des-offres</link>
      <pubDate>Mon, 19 Jan 2026 11:26:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933045_amazon-fait-le-plein-de-bonnes-affaires-durant-les-soldes-le-top-16-des-offres</guid>
      <description>
Les soldes d&#8217;hiver battent encore leur plein chez Amazon, et tout le monde peut en profiter &#8212; m&#234;me sans &#234;tre membre Prime&#8239;! Alors que la 3&#7497; d&#233;marque approche, le g&#233;ant am&#233;ricain propose encore une large s&#233;lection de remises &#224; ne pas manquer. C&#8217;est le moment id&#233;al pour faire de bonnes affaires avant la prochaine vague de r&#233;ductions.
</description>
    </item>
    <item>
      <title>IT spending set to hit $1.4 trillion in 2026 - but what exactly are we spending it on?</title>
      <link>https://www.techradar.com/pro/it-spending-set-to-hit-usd1-4-trillion-in-2026-but-what-exactly-are-we-spending-it-on</link>
      <pubDate>Mon, 19 Jan 2026 11:25:00 +0000</pubDate>
      <guid isPermaLink="false">CpHfnPBngnKToqAQEm52UA</guid>
      <description>Garner projects an 11% rise in IT spend for 2026, but geopolitical trends and rising costs could be skewing figures.</description>
    </item>
    <item>
      <title>Disney+ d&#233;voile sa feuille de route pour l&#8217;ann&#233;e 2026 lors de son Showcase : voici les s&#233;ries, films et autres nouveaut&#233;s attendues</title>
      <link>https://www.frandroid.com/services/svod/2946917_disney-devoile-sa-feuille-de-route-pour-lannee-2026-lors-de-son-showcase-voici-les-series-films-et-autres-nouveautes-attendues</link>
      <pubDate>Mon, 19 Jan 2026 11:23:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2946917_disney-devoile-sa-feuille-de-route-pour-lannee-2026-lors-de-son-showcase-voici-les-series-films-et-autres-nouveautes-attendues</guid>
      <description>
Lors de son showcase annuel organis&#233; ce 15 janvier, les &#233;quipes de Disney sont revenues sur une ann&#233;e riche tout en d&#233;voilant une programmation charg&#233;e pour 2026. Un bilan, et des projets pour la franchise qui compte &#234;tre un acteur majeur du petit et du grand &#233;cran en France.
</description>
    </item>
    <item>
      <title>Adobe refuse de le faire, mais ce d&#233;veloppeur a r&#233;ussi : voici comment installer Photoshop sur Linux</title>
      <link>https://www.frandroid.com/os/gnu-linux/2947337_adobe-refuse-de-le-faire-mais-ce-developpeur-a-reussi-voici-comment-installer-photoshop-sur-linux</link>
      <pubDate>Mon, 19 Jan 2026 11:20:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/gnu-linux/2947337_adobe-refuse-de-le-faire-mais-ce-developpeur-a-reussi-voici-comment-installer-photoshop-sur-linux</guid>
      <description>
Grande nouvelle pour les cr&#233;atifs sur Linux : l'installation de la suite Adobe Creative Suite est enfin possible gr&#226;ce &#224; l'outil Wine.
</description>
    </item>
    <item>
      <title>Photoshop sur Linux&#160;? Un d&#233;veloppeur aurait trouv&#233; la solution</title>
      <link>https://www.01net.com/actualites/photoshop-sur-linux-un-developpeur-aurait-trouve-la-solution.html</link>
      <pubDate>Mon, 19 Jan 2026 11:18:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320923</guid>
      <description>Un d&#233;veloppeur a r&#233;ussi &#224; trouver une parade pour lever l'incompatibilit&#233; de Wine et installer les logiciels de la Creative Suite d&#8217;Adobe sur les machines sous Linux.</description>
    </item>
    <item>
      <title>Save over $20 on the Soundcore Q30 by Anker headphones at Amazon</title>
      <link>https://mashable.com/article/jan-19-soundcore-q30-headphones-deal</link>
      <pubDate>Mon, 19 Jan 2026 11:17:05 +0000</pubDate>
      <guid isPermaLink="false">001wrzwgJfLM5SKzrpQZu59</guid>
      <description>As of Jan. 19, the Soundcore Q30 by Anker headphones in Absolute Black are on sale at Amazon for $53.99, 33% off their list price of $79.99.</description>
    </item>
    <item>
      <title>What&#8217;s open and closed on MLK Day 2026? Banks, stock markets, parks, Walmart, Costco holiday hours</title>
      <link>https://www.fastcompany.com/91476200/whats-open-and-closed-on-mlk-day-2026-banks-stock-markets-parks-walmart-costco-holiday-hours</link>
      <pubDate>2026-01-19T11:16:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91476200/whats-open-and-closed-on-mlk-day-2026-banks-stock-markets-parks-walmart-costco-holiday-hours</guid>
      <description>Today is a federal holiday that commemorates the legacy of civil rights leader Martin Luther King Jr. Here&#8217;s what services will be operational.
To an outside observer (honestly even to the average American), the jurisdiction of the United States government appears convoluted&#8212;it&#8217;s a collection of states with one set of rules that can be overturned by the larger federal government. ...</description>
    </item>
    <item>
      <title>Jet combat and ladder fixes will come to Battlefield 6 tomorrow as part of a smaller patch focused on game stability and extra polish</title>
      <link>https://www.techradar.com/gaming/jet-combat-and-ladder-fixes-will-come-to-battlefield-6-tomorrow-as-part-of-a-smaller-patch-focused-on-game-stability-and-extra-polish</link>
      <pubDate>Mon, 19 Jan 2026 11:14:17 +0000</pubDate>
      <guid isPermaLink="false">7FcyrUnsQYe8EH9ZBECfP3</guid>
      <description>Battlefield 6 will get a new patch on January 20. It's a smaller update that aims to improve melee responsiveness and jet combat.</description>
    </item>
    <item>
      <title>The Magic: The Gathering Avatar The Last Airbender Beginner Box is down to its best-ever price on Amazon</title>
      <link>https://mashable.com/article/jan-19-magic-the-gathering-avatar-the-last-airbender-beginner-box-deal</link>
      <pubDate>Mon, 19 Jan 2026 11:11:40 +0000</pubDate>
      <guid isPermaLink="false">04fJyY2QucUvNXoqOhMSJ4b</guid>
      <description>Avatar: The Last Airbender fans can try out its Magic: The Gathering Beginner Box for an amazingly low price of $26.99.</description>
    </item>
    <item>
      <title>Avec 12 000 &#8364; de r&#233;duction, la voiture &#233;lectrique embl&#233;matique de Ford devient enfin int&#233;ressante</title>
      <link>https://www.frandroid.com/marques/ford/2947185_avec-12-000-e-de-reduction-la-voiture-electrique-emblematique-de-ford-devient-enfin-interessante</link>
      <pubDate>Mon, 19 Jan 2026 11:06:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/ford/2947185_avec-12-000-e-de-reduction-la-voiture-electrique-emblematique-de-ford-devient-enfin-interessante</guid>
      <description>
Ford profite du d&#233;but de l&#8217;ann&#233;e 2026 pour proposer une r&#233;duction g&#233;n&#233;reuse sur sa Mustang Mach-E. La voiture &#233;lectrique d&#233;marre &#224; partir de 43 490 euros seulement, avec une remise pouvant atteindre 12 000 euros.
</description>
    </item>
    <item>
      <title>You can now turn off the Google Chrome AI model behind the scam detection tool &#8211; Google confirms AI model was hosted on your device</title>
      <link>https://www.techradar.com/pro/security/you-can-now-turn-off-the-google-chrome-ai-model-behind-the-scam-detection-tool-google-confirms-ai-model-was-hosted-on-your-device</link>
      <pubDate>Mon, 19 Jan 2026 11:04:10 +0000</pubDate>
      <guid isPermaLink="false">jigm42kNEcRRrspgXWQfW9</guid>
      <description>You can now reduce some of the Chrome burden on your device by disabling the AI model behind the enhanced protection mode of Chrome's scam detection tool.</description>
    </item>
    <item>
      <title>D&#233;sinstallez vite ces 17 extensions Chrome, Edge et Firefox, ce sont des mouchards chinois</title>
      <link>https://www.01net.com/actualites/desinstallez-vite-17-extensions-chrome-edge-firefox-sont-mouchards-chinois.html</link>
      <pubDate>Mon, 19 Jan 2026 11:02:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320903</guid>
      <description>Un vaste r&#233;seau d&#8217;espionnage chinois s&#8217;est infiltr&#233; dans Chrome, Edge et Firefox par le biais de 17 extensions malveillantes. D&#233;j&#224; install&#233;es plus de 840 000 fois, elles sont taill&#233;es pour siphonner vos donn&#233;es et espionner tout ce que vous faites sur Internet. On vous invite &#224; les d&#233;sinstaller de toute urgence pour &#233;viter les mauvaises surprises.</description>
    </item>
    <item>
      <title>The Pok&#233;mon TCG Scarlet &amp; Violet 151 Booster Bundle is below market price at Amazon</title>
      <link>https://mashable.com/article/jan-19-pokemon-tcg-151-booster-bundle-deal</link>
      <pubDate>Mon, 19 Jan 2026 11:01:55 +0000</pubDate>
      <guid isPermaLink="false">05u9A44zpfpqCPfRlHHfTex</guid>
      <description>A rare sight in the modern Pok&#233;mon TCG, you can now score the 151 Booster Bundle at 10% off &#8212; meaning $12 off six booster packs</description>
    </item>
    <item>
      <title>Faire tourner un vrai bureau Linux sur smartphone Android devient facile avec cette application</title>
      <link>https://www.frandroid.com/os/gnu-linux/2947417_faire-tourner-un-vrai-bureau-linux-sur-smartphone-android-devient-facile-avec-cette-application</link>
      <pubDate>Mon, 19 Jan 2026 11:01:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/gnu-linux/2947417_faire-tourner-un-vrai-bureau-linux-sur-smartphone-android-devient-facile-avec-cette-application</guid>
      <description>
On nous promet le smartphone-ordinateur depuis des ann&#233;es, mais entre Samsung DeX un peu brid&#233; et les solutions Linux instables, on restait sur notre faim. L'application Local Desktop change la donne en permettant de lancer Arch Linux sur n'importe quel smartphone moderne, sans bidouille complexe ni acc&#232;s root.
</description>
    </item>
    <item>
      <title>Le Google Pixel 9 Pro Fold &#224; -800 &#8364; pendant les Soldes : ses &#233;crans OLED plient, mais ne rompent pas</title>
      <link>https://www.frandroid.com/bons-plans/bons-plans-smartphone/2947233_le-google-pixel-9-pro-fold-a-800-e-pendant-les-soldes-ses-ecrans-oled-plient-mais-ils-ne-rompent-pas</link>
      <pubDate>Mon, 19 Jan 2026 11:00:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/bons-plans-smartphone/2947233_le-google-pixel-9-pro-fold-a-800-e-pendant-les-soldes-ses-ecrans-oled-plient-mais-ils-ne-rompent-pas</guid>
      <description>
Face aux Samsung Galaxy Z Fold, Google r&#233;torque avec son Google Pixel 9 Pro Fold qui prend de l'avance avec les soldes puisque la version 256 Go passe de 1 899 euros &#224; 1 099 euros.
</description>
    </item>
  </channel>
</rss>
