<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 21 Jan 2026 08:38:10 GMT</lastBuildDate>
    <item>
      <title>&#171;&#160;Coachs de suicide&#160;&#187; : le patron de Salesforce appelle &#224; une r&#233;gulation de l&#8217;IA</title>
      <link>https://www.01net.com/actualites/coachs-de-suicide-le-patron-de-salesforce-appelle-a-une-regulation-de-lia.html</link>
      <pubDate>Wed, 21 Jan 2026 08:30:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321389</guid>
      <description>Les dirigeants de Microsoft, de Google, de Meta, de Nvidia, d&#8217;OpenAI et de l&#8217;ensemble des grands acteurs de l&#8217;IA vantent sans rel&#226;che les promesses de la technologie. &#192; Davos, Marc Benioff fait figure d&#8217;exception en appelant &#224; une r&#233;gulation plus ferme, et alerte sur des d&#233;rives d&#233;j&#224; bien r&#233;elles.</description>
    </item>
    <item>
      <title>Publicit&#233;s dans Gemini : Google prend le contre-pied total d&#8217;OpenAI et de ChatGPT, du moins pour l&#8217;instant</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2949739_publicites-dans-gemini-google-prend-le-contre-pied-total-dopenai-et-de-chatgpt-du-moins-pour-linstant</link>
      <pubDate>Wed, 21 Jan 2026 08:23:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2949739_publicites-dans-gemini-google-prend-le-contre-pied-total-dopenai-et-de-chatgpt-du-moins-pour-linstant</guid>
      <description>
Interrog&#233; par le m&#233;dia Sources, le patron de Google DeepMind, Demis Hassabis, a confirm&#233; que Google ne comptait pas mon&#233;tiser Gemini par l'int&#233;gration de publicit&#233;.
</description>
    </item>
    <item>
      <title>Windows 11&#160;: la mise &#224; jour de janvier est une catastrophe</title>
      <link>https://www.01net.com/actualites/windows-11-la-mise-a-jour-de-janvier-est-une-catastrophe.html</link>
      <pubDate>Wed, 21 Jan 2026 08:18:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321429</guid>
      <description>La premi&#232;re mise &#224; jour de Windows 11 pour 2026 est un vrai d&#233;sastre. Depuis son d&#233;ploiement, les utilisateurs n&#8217;ont cess&#233; de remonter des bugs, obligeant Microsoft &#224; proposer des correctifs d&#8217;urgence.</description>
    </item>
    <item>
      <title>C&#8217;est pendant les soldes que le DJI Osmo Mobile 8 profite de sa premi&#232;re baisse de prix (-15 %)</title>
      <link>https://www.frandroid.com/bons-plans/2948463_cest-pendant-les-soldes-que-le-dji-osmo-mobile-8-profite-de-sa-premiere-baisse-de-prix-15</link>
      <pubDate>Wed, 21 Jan 2026 08:05:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2948463_cest-pendant-les-soldes-que-le-dji-osmo-mobile-8-profite-de-sa-premiere-baisse-de-prix-15</guid>
      <description>
Stabilisation efficace, suivi de sujet pr&#233;cis, perche &#224; selfie... Le DJI Osmo Mobile 8, lanc&#233; quelques mois apr&#232;s le 7P, est un gimbal polyvalent encore plus abouti que ses a&#238;n&#233;s. Pendant les soldes d'hiver, Amazon le propose pour la premi&#232;re fois en promotion : il est ainsi affich&#233; &#224; 134,99 euros au lieu de 159 euros.
</description>
    </item>
    <item>
      <title>Quand la tech rencontre la mode&#160;: Huawei d&#233;voile les FreeClip 2 en collaboration avec Les N&#233;r&#233;ides</title>
      <link>https://www.01net.com/actualites/quand-la-tech-rencontre-la-mode-huawei-devoile-les-freeclip-2-avec-en-collaboration-avec-les-nereides.html</link>
      <pubDate>Wed, 21 Jan 2026 08:02:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321289</guid>
      <description>La mode et la tech peuvent parfois se rencontrer, c&#8217;est le cas aujourd&#8217;hui. Huawei annonce une collaboration in&#233;dite avec la marque fran&#231;aise de bijoux fantaisie Les N&#233;r&#233;ides pour accompagner ses nouveaux &#233;couteurs FreeClip 2 de trois charms d&#233;coratifs en forme de fleurs.</description>
    </item>
    <item>
      <title>Sauv&#233;e de la faillite, Brekr revient avec un v&#233;lo cargo &#233;lectrique au look unique</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2949547_sauvee-de-la-faillite-brekr-revient-avec-un-velo-cargo-electrique-au-look-unique</link>
      <pubDate>Wed, 21 Jan 2026 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2949547_sauvee-de-la-faillite-brekr-revient-avec-un-velo-cargo-electrique-au-look-unique</guid>
      <description>
Moins d&#8217;un an apr&#232;s sa reprise, la marque n&#233;erlandaise Brekr pr&#233;sente son futur Brekr L250 au salon Velofollies 2026. Il s'agit d'un v&#233;lo cargo &#233;lectrique dot&#233; d'un moteur-bo&#238;te automatique, qui donne le choix entre deux porte-bagages.
</description>
    </item>
    <item>
      <title>J&#8217;ai achet&#233; un vid&#233;oprojecteur &#224; 50 &#8364; sur Amazon : pourquoi je regrette de ne pas avoir pay&#233; plus cher</title>
      <link>https://www.frandroid.com/test/prises-en-main/2947359_jai-achete-un-videoprojecteur-a-50-e-sur-amazon-pourquoi-je-regrette-de-ne-pas-avoir-paye-plus-cher</link>
      <pubDate>Wed, 21 Jan 2026 07:55:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/test/prises-en-main/2947359_jai-achete-un-videoprojecteur-a-50-e-sur-amazon-pourquoi-je-regrette-de-ne-pas-avoir-paye-plus-cher</guid>
      <description>
Amazon est inond&#233; de copies carbone de petits vid&#233;oprojecteurs sur pied, projetant &#224; 180 degr&#233;s, tous &#224; moins de 100 euros. J'en ai test&#233; un... et n'ai pas &#233;t&#233; d&#233;&#231;ue du voyage.
</description>
    </item>
    <item>
      <title>Des avions immortels ? Des chercheurs ont fabriqu&#233; un composite qui se r&#233;pare &#224; la demande</title>
      <link>https://www.futura-sciences.com/sciences/actualites/aeronautique-avions-immortels-chercheurs-ont-fabriques-composite-repare-demande-130298/#xtor%3DRSS-8</link>
      <pubDate>Wed, 21 Jan 2026 08:47:58 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/aeronautique-avions-immortels-chercheurs-ont-fabriques-composite-repare-demande-130298/#xtor%3DRSS-8</guid>
      <description>Des chercheurs am&#233;ricains ont cr&#233;&#233; un composite qui est capable de se r&#233;parer plus de 1&#8239;000 fois et qui est plus r&#233;sistant que les mat&#233;riaux actuellement utilis&#233;s dans l'a&#233;ronautique.</description>
    </item>
    <item>
      <title>Xiaomi 18 : la version standard recevrait enfin cette fonctionnalit&#233; photo r&#233;serv&#233;e aux mod&#232;les Pro</title>
      <link>https://www.frandroid.com/marques/xiaomi/2949711_xiaomi-18-la-version-standard-recevrait-enfin-cette-fonctionnalite-photo-reservee-aux-modeles-pro</link>
      <pubDate>Wed, 21 Jan 2026 07:31:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2949711_xiaomi-18-la-version-standard-recevrait-enfin-cette-fonctionnalite-photo-reservee-aux-modeles-pro</guid>
      <description>
Avant m&#234;me la pr&#233;sentation officielle du Xiaomi 18, il semblerait que le futur fleuron de la marque chinoise soit dot&#233; d'une belle am&#233;lioration en photo gr&#226;ce &#224; un nouveau t&#233;l&#233;objectif.
</description>
    </item>
    <item>
      <title>Bbox Wi-Fi 7&#160;: Bouygues Telecom lance discr&#232;tement une nouvelle box fibre</title>
      <link>https://www.01net.com/actualites/bbox-wi-fi-7-bouygues-telecom-lance-discretement-une-nouvelle-box-fibre.html</link>
      <pubDate>Wed, 21 Jan 2026 07:28:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321398</guid>
      <description>Bouygues Telecom n'avait pas tout d&#233;ball&#233; hier. Le fournisseur d'acc&#232;s avait en effet une autre box internet dans ses cartons. La nouvelle Bbox Wi-Fi 7 a fait l'objet d'un lancement tr&#232;s discret.</description>
    </item>
    <item>
      <title>OnePlus d&#233;ment les rumeurs de d&#233;mant&#232;lement, sans vraiment convaincre</title>
      <link>https://www.frandroid.com/marques/oneplus/2949729_oneplus-dement-les-rumeurs-de-demantelement-sans-vraiment-convaincre</link>
      <pubDate>Wed, 21 Jan 2026 07:23:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/oneplus/2949729_oneplus-dement-les-rumeurs-de-demantelement-sans-vraiment-convaincre</guid>
      <description>
Apr&#232;s des affirmations explosives qui pr&#233;disaient la fin de l&#8217;aventure OnePlus dans un avenir proche, un responsable de la marque a officiellement pris la parole pour contredire tout &#231;a.
</description>
    </item>
    <item>
      <title>Snap reaches settlement in social media addiction lawsuit</title>
      <link>https://techcrunch.com/2026/01/20/snap-reaches-settlement-in-social-media-addiction-lawsuit/</link>
      <pubDate>Wed, 21 Jan 2026 07:21:32 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3084374</guid>
      <description>Snap is still a defendant in similar cases related to social media addiction.</description>
    </item>
    <item>
      <title>Le tout r&#233;cent Xiaomi Redmi Note 15 Pro+ profite d&#233;j&#224; d&#8217;une pluie de r&#233;ductions pendant les soldes d&#8217;hiver (et un bracelet connect&#233; est offert)</title>
      <link>https://www.frandroid.com/bons-plans/2949177_le-tout-recent-xiaomi-redmi-note-15-pro-profite-deja-dune-pluie-de-reductions-pendant-les-soldes-dhiver-et-un-bracelet-connecte-est-offert</link>
      <pubDate>Wed, 21 Jan 2026 07:16:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2949177_le-tout-recent-xiaomi-redmi-note-15-pro-profite-deja-dune-pluie-de-reductions-pendant-les-soldes-dhiver-et-un-bracelet-connecte-est-offert</guid>
      <description>
La s&#233;rie Redmi Note s'est enrichie cette ann&#233;e avec l'arriv&#233;e des Redmi Note 15. Le plus haut de gamme est le mod&#232;le 15 Pro Plus, que l'on trouve d'ores et d&#233;j&#224; en promotion : pendant les soldes, Xiaomi le propose en effet &#224; 429,90 euros au lieu de 553 euros, avec en prime un Xiaomi Smart Band 9 Active offert.
</description>
    </item>
    <item>
      <title>Netflix sort son joker (et son portefeuille) pour racheter Warner Bros</title>
      <link>https://www.frandroid.com/services/svod/2949705_netflix-sort-son-joker-et-son-portefeuille-pour-racheter-warner-bros</link>
      <pubDate>Wed, 21 Jan 2026 07:14:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2949705_netflix-sort-son-joker-et-son-portefeuille-pour-racheter-warner-bros</guid>
      <description>
Dans la saga &#233;conomique qui oppose Netflix &#224; Paramount pour le rachat de Warner Bros, le g&#233;ant du streaming vient d&#8217;annoncer une offre tout en cash pour assurer sa prise de contr&#244;le du studio.
</description>
    </item>
    <item>
      <title>Cyberattaque contre l&#8217;&#201;ducation nationale&#160;: les donn&#233;es de 5 millions de personnes pirat&#233;es</title>
      <link>https://www.01net.com/actualites/cyberattaque-contre-education-nationale-donnees-5-millions-personnes-piratees.html</link>
      <pubDate>Wed, 21 Jan 2026 07:01:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321411</guid>
      <description>Une cyberattaque massive contre la plateforme GAEL de l'&#201;ducation nationale a expos&#233; les donn&#233;es personnelles de 5 millions de fran&#231;ais. Le vol d&#8217;informations d&#233;coule de la compromission de plusieurs comptes d&#8217;utilisateurs, visiblement non prot&#233;g&#233;s par la double authentification.</description>
    </item>
    <item>
      <title>Les cartes graphiques victimes de la flamb&#233;e des prix de la m&#233;moire</title>
      <link>https://www.01net.com/actualites/les-cartes-graphiques-victimes-de-la-flambee-des-prix-de-la-memoire.html</link>
      <pubDate>Wed, 21 Jan 2026 07:01:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321381</guid>
      <description>L'explosion des prix de la m&#233;moire a un impact sur les cartes graphiques, qui encaissent de s&#233;rieuses hausses de prix, en particulier sur le haut de gamme. En toile de fond, une flamb&#233;e du co&#251;t de la VRAM et une strat&#233;gie pour le moins ambigu&#235; des fabricants de GPU, qui pr&#233;f&#232;rent laisser leurs partenaires prendre de plein fouet la col&#232;re des acheteurs....</description>
    </item>
    <item>
      <title>Here&#8217;s how to use AI to fuel creativity instead of destroy it</title>
      <link>https://www.fastcompany.com/91473539/how-to-use-ai-to-power-creativity-instead-of-destroy-it</link>
      <pubDate>2026-01-21T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91473539/how-to-use-ai-to-power-creativity-instead-of-destroy-it</guid>
      <description>The rise of AI has sparked fear that it will replace creativity. But the real opportunity lies in using it to amplify imagination, not automate it.
A few years ago, I discovered a tomato sauce recipe that was surprisingly simple: just canned tomatoes, butter, salt, and an onion. It inspired me to experiment, adding this and that each time to see how the flavor changed. Today, I&#8217;d call myself an amateur sauce expert. I know exactly how long it needs to simmer, what shade of red signals it&#8217;s ready, and how to improvise with whatever&#8217;s in the fridge....</description>
    </item>
    <item>
      <title>Three habits undermining your executive presence</title>
      <link>https://www.fastcompany.com/91475805/three-habits-undermining-your-executive-presence</link>
      <pubDate>2026-01-21T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91475805/three-habits-undermining-your-executive-presence</guid>
      <description>These three small changes in how you communicate can create an outsize impact on how you&#8217;re perceived. 
As we move into 2026, it&#8217;s time to examine the subtle behaviors that undermine our professional impact. As someone who works with mid- to senior-level leaders, I see and hear the ways in which communication behaviors and patterns get in their way. Small changes can create influential outcomes!...</description>
    </item>
    <item>
      <title>Solopreneurship can be dream come true for many. But there&#8217;s a hidden cost</title>
      <link>https://www.fastcompany.com/91476779/solopreneurship-can-be-a-dream-come-true-but-theres-a-growing-cost</link>
      <pubDate>2026-01-21T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91476779/solopreneurship-can-be-a-dream-come-true-but-theres-a-growing-cost</guid>
      <description>AI has made it possible for more people to become solopreneurs, but at what cost to society?
From greater flexibility to a sense of ownership and the hope of financial gain, solopreneurship feels like the new American dream. However, there&#8217;s a hidden cost to that dream that has nothing to do with the unending hustle that comes with being both a business owner and that business&#8217;s sole employee. It&#8217;s the undeniable cost to the planet....</description>
    </item>
    <item>
      <title>&#171;&#160;Le v&#233;ritable d&#233;fi n&#8217;est pas d&#8217;am&#233;liorer la connaissance de l&#8217;IA&#160;&#187; : pour le patron de Samsung, l&#8217;intelligence artificielle doit devenir invisible</title>
      <link>https://www.frandroid.com/marques/samsung/2949687_le-veritable-defi-nest-pas-dameliorer-la-connaissance-de-lia-pour-le-patron-de-samsung-lintelligence-artificielle-doit-devenir-invisible</link>
      <pubDate>Wed, 21 Jan 2026 06:50:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2949687_le-veritable-defi-nest-pas-dameliorer-la-connaissance-de-lia-pour-le-patron-de-samsung-lintelligence-artificielle-doit-devenir-invisible</guid>
      <description>
Dans un &#233;ditorial publi&#233; par le Wall Street Journal, TM Roh, patron de Samsung, a fait part de son avis autour de l'intelligence artificielle qui devrait &#234;tre transparente pour les utilisateurs. 
</description>
    </item>
    <item>
      <title>Android Auto 16.0 est l&#224; : le nouveau lecteur multim&#233;dia va bousculer vos habitudes</title>
      <link>https://www.01net.com/actualites/android-auto-16-nouveau-lecteur-multimedia-bousculer-vos-habitudes.html</link>
      <pubDate>Wed, 21 Jan 2026 06:45:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321401</guid>
      <description>Google est en train de d&#233;ployer la version 16.0 d'Android Auto, et avec elle une refonte importante du lecteur m&#233;dia. Voici &#224; quoi cela ressemble.</description>
    </item>
  </channel>
</rss>
