<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 18 Feb 2026 15:56:49 GMT</lastBuildDate>
    <item>
      <title>Google Pixel 10A preorders come with a $100 gift card</title>
      <link>https://www.theverge.com/gadgets/880610/google-pixel-10a-preorder-deal-sale</link>
      <pubDate>2026-02-18T10:43:53-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=880610</guid>
      <description>As promised, Google opened preorders for its Pixel 10A midrange phone, and it&#8217;ll launch on March 4th. We already published a hands-on with the device, and I encourage you to check it out (we think it&#8217;s more like a better Pixel 9A than a slightly worse Pixel 10). If you decide that you want to [&#8230;]</description>
    </item>
    <item>
      <title>Apr&#232;s le solaire, l&#8217;automobile ? Ce rapport officiel met en garde contre un crash industriel de l&#8217;Europe face &#224; la Chine</title>
      <link>https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2981891_apres-le-solaire-lautomobile-ce-rapport-officiel-met-en-garde-contre-un-crash-industriel-de-leurope-face-a-la-chine</link>
      <pubDate>Wed, 18 Feb 2026 15:42:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2981891_apres-le-solaire-lautomobile-ce-rapport-officiel-met-en-garde-contre-un-crash-industriel-de-leurope-face-a-la-chine</guid>
      <description>
Dans un rapport intitul&#233; "l'industrie europ&#233;enne face au rouleau compresseur chinois", la France revient sur un &#233;pisode douloureux des ann&#233;es 2010. Quand la Chine est devenue maitresse des panneaux solaires, loin devant l'Europe, pourtant &#224; la pointe sur le sujet, au d&#233;but des ann&#233;es 2000. Un &#233;pisode qui pourrait se reproduire dans le domaine automobile.
...</description>
    </item>
    <item>
      <title>Cette r&#233;f&#233;rence des VAE, not&#233;e 9/10 et propos&#233;e avec 1 000 &#8364; de r&#233;duction, s&#233;duit toujours autant avec sa transmission automatique</title>
      <link>https://www.frandroid.com/bons-plans/2981777_cette-reference-des-vae-notee-9-10-et-proposee-avec-1-000-e-de-reduction-seduit-toujours-autant-avec-sa-transmission-automatique</link>
      <pubDate>Wed, 18 Feb 2026 15:39:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2981777_cette-reference-des-vae-notee-9-10-et-proposee-avec-1-000-e-de-reduction-seduit-toujours-autant-avec-sa-transmission-automatique</guid>
      <description>
Le mod&#232;le BTWIN LD 920 E est un v&#233;lo &#233;lectrique de grande qualit&#233; qui brille par sa transmission automatique tr&#232;s agr&#233;able et sa tenue de route exemplaire, &#224; retrouver aujourd'hui pour 1 999,99 euros au lieu de 2 999,99 euros chez Decathlon.
</description>
    </item>
    <item>
      <title>Waymo denies using remote drivers after Senate testimony goes viral</title>
      <link>https://www.theverge.com/transportation/880583/waymo-remote-assistance-senate-letter-robotaxi-philippines</link>
      <pubDate>2026-02-18T10:35:33-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=880583</guid>
      <description>Waymo defended its use of remote assistants for its robotaxis after the testimony of one of its top executives during a Senate hearing went viral. In a letter to Sen. Ed Markey (D-MA) on Tuesday, Waymo's head of global operations Ryan McNamara provided a detailed description of the company's remote assistance operations, including the number [&#8230;]</description>
    </item>
    <item>
      <title>Nevada sues to block Kalshi&amp;#8217;s prediction betting market</title>
      <link>https://www.theverge.com/policy/880658/nevada-kalshi-prediction-market-lawsuit</link>
      <pubDate>2026-02-18T10:35:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=880658</guid>
      <description>Nevada is suing to block the prediction market platform Kalshi from allowing residents to place bets on the outcomes of events, including elections and sports games, as reported earlier by Business Insider. The lawsuit adds to a growing number of legal battles across the country, claiming that Kalshi is harming the state's gambling market by [&#8230;]</description>
    </item>
    <item>
      <title>'Consumers are far outstripping enterprise for the moment, but we expect enterprise will surely and slowly get on that bandwagon': Palo Alto CEO says adoption of AI is still an ongoing process for many firms</title>
      <link>https://www.techradar.com/pro/consumers-are-far-outstripping-enterprise-for-the-moment-but-we-expect-enterprise-will-surely-and-slowly-get-on-that-bandwagon-palo-alto-ceo-says-adoption-of-ai-is-still-an-ongoing-process-for-many-firms</link>
      <pubDate>Wed, 18 Feb 2026 15:35:00 +0000</pubDate>
      <guid isPermaLink="false">PhjxVHZssBdAcEZZNM7gvi</guid>
      <description>Palo Alto isn't worried about slower enterprise AI adoption compared with consumers &#8211; after all, it was the same with cloud adoption.</description>
    </item>
    <item>
      <title>Quelles sont les meilleures berlines &#233;lectriques &#224; acheter en 2026&#8201;?</title>
      <link>https://www.frandroid.com/guide-dachat/1172583_quelles-sont-les-meilleures-berlines-electriques-a-acheter-en-2022</link>
      <pubDate>Wed, 18 Feb 2026 15:31:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1172583_quelles-sont-les-meilleures-berlines-electriques-a-acheter-en-2022</guid>
      <description>
Bien que peu populaire, la berline est une voiture polyvalente. Elle s'adapte aux familles, &#224; la ville ou aux d&#233;placements plus longs. Nous avons s&#233;lectionn&#233; les meilleures berlines &#233;lectriques que nous avons test&#233;es.
</description>
    </item>
    <item>
      <title>I've looked through hundreds of gaming laptops today &#8212; this highly-rated model with an RTX 5070 for &#163;1,199 is the obvious pick</title>
      <link>https://www.techradar.com/computing/gaming-laptops/ive-looked-through-hundreds-of-gaming-laptops-today-this-highly-rated-model-with-an-rtx-5070-for-gbp1-199-is-the-obvious-pick</link>
      <pubDate>Wed, 18 Feb 2026 15:30:10 +0000</pubDate>
      <guid isPermaLink="false">KXM3DMjTfj5n7D3xMqVhjZ</guid>
      <description>Want a powerful gaming laptop without breaking the bank? This Acer Nitro V16 at Very is the best buy currently.</description>
    </item>
    <item>
      <title>The Best Google Pixel Phones of 2026, Tested and Reviewed</title>
      <link>https://www.wired.com/story/best-google-pixel-phone/</link>
      <pubDate>Wed, 18 Feb 2026 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">5f7b6765126693e1dc256c36</guid>
      <description>Here&#8217;s a guide to all the models&#8212;plus Pixel case recommendations and smart software tricks to try.</description>
    </item>
    <item>
      <title>The AI inflection point: How to turn supply chain volatility into foresight</title>
      <link>https://www.techradar.com/pro/the-ai-inflection-point-how-to-turn-supply-chain-volatility-into-foresight</link>
      <pubDate>Wed, 18 Feb 2026 15:28:14 +0000</pubDate>
      <guid isPermaLink="false">gRNMXRSHQ2GpCt27vtXhpD</guid>
      <description>As volatility rises, agentic AI embedded in workflows turns disruption into foresight.</description>
    </item>
    <item>
      <title>&#171;&#160;Qui va fabriquer les batteries des voitures europ&#233;ennes&#160;?&#160;&#187; : le g&#233;ant fran&#231;ais g&#232;le ses usines et lance un appel &#224; l&#8217;aide</title>
      <link>https://www.01net.com/actualites/qui-va-fabriquer-les-batteries-des-voitures-europeennes-le-geant-francais-gele-ses-usines-et-lance-un-appel-a-laide.html</link>
      <pubDate>Wed, 18 Feb 2026 15:21:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326677</guid>
      <description>Pris en &#233;tau entre des co&#251;ts qui explosent et un march&#233; qui ralentit, le fabricant de batteries ACC tire la sonnette d'alarme. Yan Vincent, son patron, pr&#233;vient : sans ch&#232;que massif de l'Europe, l'avenir industriel s'&#233;crit en pointill&#233;s.</description>
    </item>
    <item>
      <title>Big Tech Says Generative AI Will Save the Planet. It Doesn't Offer Much Proof</title>
      <link>https://www.wired.com/story/big-tech-says-generative-ai-will-save-the-planet-it-doesnt-offer-much-proof/</link>
      <pubDate>Wed, 18 Feb 2026 15:17:31 +0000</pubDate>
      <guid isPermaLink="false">69947316e8ce4dcb7c18d0a3</guid>
      <description>A new report finds that of 154 specific claims about how AI will benefit the climate, just a quarter cited academic research. A third included no evidence at all.</description>
    </item>
    <item>
      <title>'Absurd GPU pricing update': new report shows painful reality of graphics card price hikes, particularly for Nvidia models</title>
      <link>https://www.techradar.com/computing/gpu/absurd-gpu-pricing-update-new-report-shows-painful-reality-of-graphics-card-price-hikes-particularly-for-nvidia-models</link>
      <pubDate>Wed, 18 Feb 2026 15:16:08 +0000</pubDate>
      <guid isPermaLink="false">RLFtR5kQwth8LkMpCtc7y4</guid>
      <description>If you needed any confirmation that GPUs are getting a lot more expensive, these stats make it painfully clear.</description>
    </item>
    <item>
      <title>These 6 quotes from OpenClaw creator Peter Steinberger hint at the future of personal computing</title>
      <link>https://www.fastcompany.com/91494326/openclaw-peter-steinberger-openai-meta-lex-fridman</link>
      <pubDate>2026-02-18T15:16:07</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91494326/openclaw-peter-steinberger-openai-meta-lex-fridman</guid>
      <description>The Austrian developer created a massively successful AI agent platform, which he has agreed to sell to OpenAI.
The AI boom began with ChatGPT and chatbots. Now chatbots are starting to &#8220;grow arms and legs,&#8221; as developers say, meaning they can use digital tools and work independently on a human&#8217;s behalf. The open-source platform OpenClaw is notable because it lets people build agents with far more autonomy than those offered by big tech....</description>
    </item>
    <item>
      <title>PS5&#160;: face &#224; l&#8217;explosion du prix de la m&#233;moire, Sony veut vous faire d&#233;penser plus d&#8217;argent</title>
      <link>https://www.frandroid.com/marques/sony/2981785_ps5-face-a-lexplosion-du-prix-de-la-memoire-sony-veut-vous-faire-depenser-plus-dargent</link>
      <pubDate>Wed, 18 Feb 2026 15:15:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2981785_ps5-face-a-lexplosion-du-prix-de-la-memoire-sony-veut-vous-faire-depenser-plus-dargent</guid>
      <description>
M&#234;me si PlayStation 5 continue de se vendre par palettes, Sony doit faire face &#224; un ennemi invisible mais redoutable : la flamb&#233;e des prix de la m&#233;moire. Pour compenser ces co&#251;ts de fabrication qui grimpent, le constructeur japonais a une strat&#233;gie bien rod&#233;e. Plut&#244;t que de toucher au prix de la console, l'objectif est d&#233;sormais de vous faire consommer plus de jeux et de services.
...</description>
    </item>
    <item>
      <title>Comparatif 2026 : on a test&#233; les enceintes Bluetooth les plus abordables du moment</title>
      <link>https://www.frandroid.com/guide-dachat/guide-audio/1570249_quelles-sont-les-meilleures-enceintes-bluetooth-pas-cheres</link>
      <pubDate>Wed, 18 Feb 2026 15:15:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-audio/1570249_quelles-sont-les-meilleures-enceintes-bluetooth-pas-cheres</guid>
      <description>
Envie de profiter d&#8217;un bon son sans vous ruiner ? Bienvenur sur notre s&#233;lection des meilleures enceintes Bluetooth &#224; moins de 100 euros : des mod&#232;les abordables, robustes et faciles &#224; transporter, pour combler votre budget comme vos oreilles.
</description>
    </item>
    <item>
      <title>Kana emerges from stealth with $15M to build flexible AI agents for marketers</title>
      <link>https://techcrunch.com/2026/02/18/kana-emerges-from-stealth-with-15m-to-build-flexible-ai-agents-for-marketers/</link>
      <pubDate>Wed, 18 Feb 2026 15:08:40 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3093896</guid>
      <description>Kana, a new AI marketing startup from the founders of Rapt and Krux, has raised $15 million to build customizable, agent-based marketing tools.</description>
    </item>
    <item>
      <title>RAM prices are through the roof, but you can save $30 on 16GB of G.SKILL Ripjaws M5 Neo DDR5-6000 right now</title>
      <link>https://www.techradar.com/pro/ram-prices-are-through-the-roof-but-you-can-save-usd30-on-16gb-of-g-skill-ripjaws-m5-neo-ddr5-6000-right-now</link>
      <pubDate>Wed, 18 Feb 2026 15:08:18 +0000</pubDate>
      <guid isPermaLink="false">Jd7ymys5mH8iHW9awPBodh</guid>
      <description>Save $30 on 16GB of G.SKILL Ripjaws M5 Neo DDR5-6000 right now &#8212; a big discount in today&#8217;s volatile memory market.</description>
    </item>
    <item>
      <title>NotebookLM&#160;: Google va enfin r&#233;gler le plus gros d&#233;faut de son outil d&#8217;IA</title>
      <link>https://www.01net.com/actualites/notebooklm-google-va-regler-plus-gros-defaut-outil-ia.html</link>
      <pubDate>Wed, 18 Feb 2026 15:04:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326694</guid>
      <description>Google vient de confirmer travailler sur une nouveaut&#233; que les utilisateurs de NotebookLM attendent depuis longtemps.</description>
    </item>
    <item>
      <title>Amazfit Balance 2 review: An outstanding fitness tracker, but so-so smart features</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/amazfit-balance-2-review</link>
      <pubDate>Wed, 18 Feb 2026 15:02:46 +0000</pubDate>
      <guid isPermaLink="false">uL764HWc4o8dC3rMv2poq</guid>
      <description>The Amazfit Balance 2 delivers outstanding battery performance alongside excellent tracking, as well as a capable AI assistant.</description>
    </item>
    <item>
      <title>Voici le Pixel 10a&#160;: est-il un Pixel 9a avec une moustache&#160;? Ce qui change, ce qui manque</title>
      <link>https://www.01net.com/actualites/voici-le-pixel-10a-est-il-un-pixel-9a-avec-une-moustache-ce-qui-change-ce-qui-manque.html</link>
      <pubDate>Wed, 18 Feb 2026 15:00:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326446</guid>
      <description>Google vient tout juste d&#8217;officialiser le lancement de son Pixel 10a, le smartphone milieu de gamme qui d&#233;mocratise les avanc&#233;es de la gamme Pixel. Voici un r&#233;sum&#233; complet des nouveaut&#233;s, des fondamentaux conserv&#233;s par rapport au Pixel 9a, et une premi&#232;re analyse de la proposition de Google pour 2026.</description>
    </item>
    <item>
      <title>The Future of &#8216;Star Trek&#8217; Comics Is Ready for a New Next Generation (Exclusive)</title>
      <link>https://gizmodo.com/star-trek-idw-comics-2026-seven-of-nine-legacy-2000723368</link>
      <pubDate>Wed, 18 Feb 2026 15:00:25 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000723368</guid>
      <description>Welcome Captain Seven of Nine aboard the 'Enterprise' with IDW's new 'Star Trek' comic.</description>
    </item>
    <item>
      <title>Google&#8217;s Pixel 10a Is the Same Damn Phone as the Pixel 9a</title>
      <link>https://gizmodo.com/google-pixel-10a-is-the-same-damn-phone-as-pixel-9a-2000722838</link>
      <pubDate>Wed, 18 Feb 2026 15:00:16 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000722838</guid>
      <description>The Pixel 10a is flatter without any hint of a camera bump. No, really. That&#8217;s it.</description>
    </item>
    <item>
      <title>Prise en main du Pixel 10a&#160;: il est plus plat, et on ne va pas en faire tout un plat</title>
      <link>https://www.01net.com/actualites/prise-en-main-du-pixel-10a-il-est-plus-plat-et-on-ne-va-pas-en-faire-tout-un-plat.html</link>
      <pubDate>Wed, 18 Feb 2026 15:00:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326498</guid>
      <description>Nous avons pu prendre en main le Pixel 10a en amont de sa pr&#233;sentation officielle. Voici notre premier ressenti sur les choix de design effectu&#233;s par Google.</description>
    </item>
    <item>
      <title>The Google Pixel 10a Is Barely Different From the Pixel 9a</title>
      <link>https://www.wired.com/story/google-pixel-10a/</link>
      <pubDate>Wed, 18 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">698a12f5c2e8a5cd16364109</guid>
      <description>With specs nearly identical to last year&#8217;s Pixel 9a, the new Pixel 10a doesn&#8217;t pack as much of a punch as prior A-series smartphones.</description>
    </item>
    <item>
      <title>Toyota&#8217;s C-HR electric hatchback starts at $38,135</title>
      <link>https://www.theverge.com/transportation/880395/toyota-chr-ev-price-range-specs</link>
      <pubDate>2026-02-18T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=880395</guid>
      <description>Toyota is on an EV roll these days, introducing the newly all-electric, three-row Highlander SUV, and giving us a fuller picture of the bZ Woodland wagon. Now, the Japanese auto giant is completing the triumvirate with a full detail breakdown of the upcoming C-HR hatchback. We already knew that the C-HR won't be as affordable [&#8230;]</description>
    </item>
    <item>
      <title>The Pixel 10A is a little too much like last year&#8217;s phone</title>
      <link>https://www.theverge.com/tech/880400/pixel-10a-hands-on-a-little-too-much-like-pixel-9a</link>
      <pubDate>2026-02-18T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=880400</guid>
      <description>Google's midrange Pixels have been our top pick for budget Android phones for a while. They offer good cameras and most of what you need at a budget-friendly price. But this year's upgrade feels so minimal, I'd liken it more to a Pixel 9A+. Or a Pixel 9B. The $499 Pixel 10A is supposed to [&#8230;]</description>
    </item>
    <item>
      <title>This former Microsoft PM thinks she can unseat CyberArk in 18 months</title>
      <link>https://techcrunch.com/2026/02/18/the-former-microsoft-pm-who-thinks-she-can-unseat-cyberark-in-18-months/</link>
      <pubDate>Wed, 18 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3093001</guid>
      <description>Though crowded, the identity management market seems eager for new solutions, and Venice is finding traction.</description>
    </item>
    <item>
      <title>The Pixel 10 and the glory of the affordable flat phone</title>
      <link>https://www.techradar.com/phones/google-pixel-phones/the-pixel-10-and-the-glory-of-the-affordable-flat-phone</link>
      <pubDate>Wed, 18 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">tScZSYmtBNupdJSzLC4FvB</guid>
      <description>Google Pixel 10a won't be the fastest or most full-featured Android, but it might be the flattest, and its capabilities could surprise you.</description>
    </item>
    <item>
      <title>I had high hopes for this cheap, well-designed vlogging camera &#8211; but then I reviewed the footage</title>
      <link>https://www.techradar.com/cameras/action-cameras/sjcam-c400-review</link>
      <pubDate>Wed, 18 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">6os3UcjyUekJv5X6TzFPTX</guid>
      <description>The SJCAM C400 has a pleasingly versatile design, but its performance leaves a lot to be desired</description>
    </item>
    <item>
      <title>Exclusive: WWE 2K26 MyRise lead talks this year's campaign and why fan-favorite Jordynne Grace is taking on the role of a villain: &#8216;We work so far ahead from WWE&#8217;</title>
      <link>https://www.techradar.com/gaming/wwe-2k26-myrise-lead-talks-this-years-campaign-and-why-fan-favorite-jordynne-grace-is-taking-on-the-role-of-a-villain-we-work-so-far-ahead-from-wwe</link>
      <pubDate>Wed, 18 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">wgF42yWaLUwQJA8hz2dcxX</guid>
      <description>WWE 2K26 lead talks MyRise and confirms this year's campaign will fix my two biggest issues with the mode.</description>
    </item>
    <item>
      <title>Google Pixel 10a vs. Pixel 9a: What's changed and which one should you buy?</title>
      <link>https://www.engadget.com/mobile/smartphones/google-pixel-10a-vs-pixel-9a-whats-changed-and-which-one-should-you-buy-150000786.html?src=rss</link>
      <pubDate>Wed, 18 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">9f2186ef-f17b-44de-9011-35b69b2137bf</guid>
      <description>Now that pre-orders are open for the Google Pixel 10a, it&#8217;s time to see how it stacks up against last year&#8217;s Pixel 9a. At first glance, the two phones look very similar, and that&#8217;s not a bad thing. Google hasn&#8217;t tried to reinvent its budget-friendly formula this year, sticking to the same compact design, clean software experience and camera-first approach that made the 9a such a good value.Both phones share a lot in common, including 120Hz OLED displays, Google&#8217;s Tensor G4 chip, strong computational photography and seven years of OS and security updates. The actual differences are more increme...</description>
    </item>
    <item>
      <title>Google's $500 Pixel 10a smartphone arrives on March 5</title>
      <link>https://www.engadget.com/mobile/smartphones/googles-500-pixel-10a-smartphone-arrives-on-march-5-150000489.html?src=rss</link>
      <pubDate>Wed, 18 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">089a374f-74d6-4c2d-8eed-caf3cc4181fe</guid>
      <description>Google debuted the Pixel 10a phone today. Pre-orders are open now and the smartphone will be available starting March 5. Although it's the new 2026 addition to the A series lineup, the Pixel 10a invites many comparisons with last year's Pixel 9a. For starters, the price is identical at $499.
Design-wise, not much as changed. The back of the phone can lay flat, which has become a hallmark of the Pixel A collection, rather than wobbling around on a bulky camera housing. The screen is still 6.3 inches with an Actua display. The phone's insides are also the same; the 10a comes with the same Tensor...</description>
    </item>
    <item>
      <title>Pixel 10a hands-on: Google locks down the midrange phone game</title>
      <link>https://www.engadget.com/mobile/smartphones/pixel-10a-hands-on-google-locks-down-the-midrange-phone-game-150000513.html?src=rss</link>
      <pubDate>Wed, 18 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">3113f21d-e070-467c-8e52-282518d6b5c3</guid>
      <description>Google's A-series phones have offered some of the best value among midrange handsets for years, and after checking out the new Pixel 10a, I don't see that trend stopping anytime soon.Let's start with the specs. Starting at just $499, you get a vivid 6.3-inch OLED screen with a 120Hz refresh rate and 3,000 nits of peak brightness, 8GB of RAM and either 128GB or 256GB of onboard storage. The phone also features a durable aluminum frame along with a stronger Corning Gorilla Glass 7i panel in front and a composite plastic back with a lovely matte finish. As a nod towards sustainability, Google say...</description>
    </item>
    <item>
      <title>On a pris en main le Pixel 10a de Google et on est reparti avec une impression bizarre</title>
      <link>https://www.frandroid.com/marques/google/2971637_on-a-pris-en-main-le-pixel-10a-de-google-et-on-est-parti-avec-une-impression-bizarre</link>
      <pubDate>Wed, 18 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2971637_on-a-pris-en-main-le-pixel-10a-de-google-et-on-est-parti-avec-une-impression-bizarre</guid>
      <description>
Google lance son Pixel 10a, son nouveau smartphone milieu de gamme qui mise tout sur l&#8217;intelligence artificielle et un design revu. Vendu 549 &#8364;, il succ&#232;de au Pixel 9a avec quelques arguments, mais aussi un choix technique qui fait d&#233;j&#224; grincer des dents.
</description>
    </item>
    <item>
      <title>Entering the post-speed era: when everyone can ship fast, control becomes the real advantage</title>
      <link>https://www.techradar.com/pro/entering-the-post-speed-era-when-everyone-can-ship-fast-control-becomes-the-real-advantage</link>
      <pubDate>Wed, 18 Feb 2026 14:58:37 +0000</pubDate>
      <guid isPermaLink="false">yM2xXLN6Rj7PLaM4cVsYxX</guid>
      <description>While software delivery has sped up in recent years, and unlocked rapid progression for DevOps teams, it has also introduced new forms of risk.</description>
    </item>
    <item>
      <title>Microsoft has finally started its campaign to 'make Windows 11 better' &#8212; here's what's getting fixed in the next update</title>
      <link>https://www.techradar.com/computing/windows/microsoft-has-finally-started-its-campaign-to-make-windows-11-better-heres-whats-getting-fixed-in-the-next-update</link>
      <pubDate>Wed, 18 Feb 2026 14:57:41 +0000</pubDate>
      <guid isPermaLink="false">kLkkXUUirrGGPJueeSWYhD</guid>
      <description>We should see Windows 11 start to improve on the reliability front from next month &#8212; or here's hoping, anyway.</description>
    </item>
    <item>
      <title>If you're running local AI, this MSI Vector 16 HX deal is the one to beat &#8212; get 16GB of VRAM and a Core Ultra 9 for $599 off at Newegg</title>
      <link>https://www.techradar.com/pro/if-youre-a-data-science-professional-running-local-ai-this-msi-vector-16-hx-deal-is-the-one-to-beat-get-16gb-of-vram-and-a-core-ultra-9-for-usd599-off-at-newegg</link>
      <pubDate>Wed, 18 Feb 2026 14:52:08 +0000</pubDate>
      <guid isPermaLink="false">DBPLJT8HiLDepYxyWEedXm</guid>
      <description>The laptop boasts Core Ultra 9, RTX 5080, 16GB RAM, and 1TB SSD, with a free games bundle worth $268 - add accident protection and get a $115 electric food sealer system free, too (for some reason).</description>
    </item>
    <item>
      <title>Real-Life Pok&#233;mon Pinball Is the Most Visceral Way to Catch &#8216;Em All</title>
      <link>https://gizmodo.com/real-life-pokemon-pinball-is-the-most-visceral-way-to-catch-em-all-2000723147</link>
      <pubDate>Wed, 18 Feb 2026 14:45:03 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000723147</guid>
      <description>You'll have to pay a hefty chunk of change for Stern Pinball's version of the classic Game Boy game.</description>
    </item>
    <item>
      <title>Qarabag vs Newcastle Free Streams: How to watch Champions League 2025/26 1st leg from anywhere in the world</title>
      <link>https://www.techradar.com/how-to-watch/football/qarabag-vs-newcastle-champions-league-2025-26-1st-leg-free</link>
      <pubDate>Wed, 18 Feb 2026 14:45:00 +0000</pubDate>
      <guid isPermaLink="false">sMCnQGv9HkJt3f3b3wLWQe</guid>
      <description>All the ways to watch Qarabag vs Newcastle live streams from anywhere and for free, as the minnows look to upset the Magpies in this Champions League 1st leg match.</description>
    </item>
    <item>
      <title>Microsoft says Office bug exposed customers&#8217; confidential emails to Copilot AI</title>
      <link>https://techcrunch.com/2026/02/18/microsoft-says-office-bug-exposed-customers-confidential-emails-to-copilot-ai/</link>
      <pubDate>Wed, 18 Feb 2026 14:44:28 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3093970</guid>
      <description>Microsoft said the bug meant that its Copilot AI chatbot was reading and summarizing paying customers' confidential emails, bypassing data protection policies.</description>
    </item>
    <item>
      <title>Resident Evil Requiem sort tr&#232;s bient&#244;t et voici o&#249; le pr&#233;commander au plus bas prix sur PS5</title>
      <link>https://www.frandroid.com/bons-plans/2981673_resident-evil-requiem-sort-tres-bientot-et-voici-ou-le-precommander-au-plus-bas-prix-sur-ps5</link>
      <pubDate>Wed, 18 Feb 2026 14:42:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2981673_resident-evil-requiem-sort-tres-bientot-et-voici-ou-le-precommander-au-plus-bas-prix-sur-ps5</guid>
      <description>
Resident Evil Requiem est le 9e opus canonique de la c&#233;l&#232;bre franchise horrifique de Capcom. Disponible sur toutes les plateformes &#224; partir du 27 f&#233;vrier 2026, vous pouvez le pr&#233;commander d&#232;s aujourd'hui pour 53,72 euros au lieu de 79,99 euros.
</description>
    </item>
    <item>
      <title>Polestar unveils a station wagon version of the 4</title>
      <link>https://www.engadget.com/transportation/evs/polestar-unveils-a-station-wagon-version-of-the-4-144025505.html?src=rss</link>
      <pubDate>Wed, 18 Feb 2026 14:40:25 +0000</pubDate>
      <guid isPermaLink="false">b30c6d43-2393-4345-83ac-682f43464047</guid>
      <description>Polestar is gearing up to launch three new models in the next two years, including a station wagon (estate or shooting brake) version of the Polestar 4 that harkens back to the company's Volvo roots. The Geely-owned Swedish company sold a record 61,000 EVs in 2025, but hopes that the new models will help it take an even bigger bite out of the market. "We want to get more volume out of a bigger cake," CEO Michael Lohscheller said.&#160;
Polestar currently offers two models in the US, the Polestar 3 and Polestar 4, both SUVs. However, the new Polestar 4 will come in two variants, one a traditional SU...</description>
    </item>
    <item>
      <title>Epstein files fallout: The growing list of business leaders who have faced consequences after being mentioned</title>
      <link>https://www.fastcompany.com/91494059/epstein-files-list-business-leaders-mentioned-grows-consequences-faced</link>
      <pubDate>2026-02-18T14:34:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91494059/epstein-files-list-business-leaders-mentioned-grows-consequences-faced</guid>
      <description>The severity of the fallout has ranged widely, with some prominent figures stepping down from big jobs and others taking the wait-and-see approach.
The consequences from being associated with Jeffrey Epstein are mostly playing out behind closed doors rather than in courtrooms.</description>
    </item>
    <item>
      <title>Nothing Phone (4a) : une mauvaise nouvelle &#224; en croire cette fuite</title>
      <link>https://www.frandroid.com/marques/nothing/2981775_nothing-phone-4a-une-mauvaise-nouvelle-a-en-croire-cette-fuite</link>
      <pubDate>Wed, 18 Feb 2026 14:33:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nothing/2981775_nothing-phone-4a-une-mauvaise-nouvelle-a-en-croire-cette-fuite</guid>
      <description>
Nothing pr&#233;sentera tr&#232;s prochainement son Nothing Phone (4a). Malheureusement, la facture serait plus sal&#233;e cette ann&#233;e.
</description>
    </item>
    <item>
      <title>Sandisk stock price stalls amid secondary public share offering. Is the 2026 memory chip rally about to end?</title>
      <link>https://www.fastcompany.com/91494527/sandisk-stock-price-secondary-public-share-offering-rally-over</link>
      <pubDate>2026-02-18T14:33:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91494527/sandisk-stock-price-secondary-public-share-offering-rally-over</guid>
      <description>Western Digital Corporation (WDC), Sandisk&#8217;s former parent, currently owns the almost 6 million shares, which have risen tremendously this year.
Sandisk Corporation has announced plans for a secondary public offering.&#160;</description>
    </item>
    <item>
      <title>OpenAI pushes into higher education as India seeks to scale AI skills</title>
      <link>https://techcrunch.com/2026/02/18/openai-pushes-into-higher-education-as-india-seeks-to-scale-ai-skills/</link>
      <pubDate>Wed, 18 Feb 2026 14:32:42 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3093899</guid>
      <description>OpenAI says its India education partnerships aim to reach more than 100,000 students, faculty and staff over the next year.</description>
    </item>
    <item>
      <title>'A spectacularly bad idea' &#8212; Digital rights advocates call on Wisconsin lawmakers to reject VPN ban bill</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/a-spectacularly-bad-idea-digital-rights-advocates-call-on-wisconsin-lawmakers-to-reject-vpn-ban-bill</link>
      <pubDate>Wed, 18 Feb 2026 14:29:47 +0000</pubDate>
      <guid isPermaLink="false">hdup6Fz5bqqXC6GUJU8gtB</guid>
      <description>Wisconsin's controversial age verification proposal is expected to be discussed today (February 18). The Electronic Frontier Foundation warns that provisions to block VPN users are "unworkable."</description>
    </item>
    <item>
      <title>Les secrets de la Chine pour produire ses voitures 40 % moins cher qu&#8217;en Europe r&#233;v&#233;l&#233; par ce rapport officiel</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2981555_les-secrets-de-la-chine-pour-produire-ses-voitures-40-moins-cher-quen-europe-revele-par-ce-rapport-officiel</link>
      <pubDate>Wed, 18 Feb 2026 14:26:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2981555_les-secrets-de-la-chine-pour-produire-ses-voitures-40-moins-cher-quen-europe-revele-par-ce-rapport-officiel</guid>
      <description>
C&#8217;est un document qui a l&#8217;effet d&#8217;une douche froide pour l'Europe. Un rapport officiel fran&#231;ais met des chiffres pr&#233;cis sur ce que tout le monde pressentait : la Chine produit ses voitures &#233;lectriques &#224; des co&#251;ts qui d&#233;fient toute concurrence occidentale. Et on sait d&#233;sormais comment cela est possible, et ce qu'il faut faire pour s'en prot&#233;ger.
</description>
    </item>
    <item>
      <title>Les Nothing Phone (4a) et (4a) Pro seraient un peu mieux &#233;quip&#233;s, mais ils co&#251;teraient aussi beaucoup plus cher</title>
      <link>https://www.01net.com/actualites/les-nothing-phone-4a-et-4a-pro-seraient-un-peu-mieux-equipes-mais-ils-couteraient-aussi-beaucoup-plus-cher.html</link>
      <pubDate>Wed, 18 Feb 2026 14:17:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326701</guid>
      <description>Chose promise, chose due (h&#233;las) : les futurs smartphones de Nothing subiront bien une hausse de leurs prix, d'apr&#232;s un fuiteur tr&#232;s fiable. Pas de surprise ici puisque Carl Pei, le patron du constructeur, avait pr&#233;par&#233; les esprits d&#233;but janvier.</description>
    </item>
    <item>
      <title>A simple hack gave the owner of a brand new DJI Romo access to a global army of 7,000 robovacs &#8212; and the security flaw isn&#8217;t fully fixed</title>
      <link>https://www.techradar.com/home/robot-vacuums/a-simple-hack-gave-the-owner-of-a-brand-new-dji-romo-access-to-a-global-army-of-robovacs</link>
      <pubDate>Wed, 18 Feb 2026 14:16:31 +0000</pubDate>
      <guid isPermaLink="false">NKsazjm4mqf7YdUYDt2k94</guid>
      <description>Robovac user gets a lot more than he bargained for after connecting his PS5 controller to a DJI Romo.</description>
    </item>
    <item>
      <title>Votre montre Garmin va s&#8217;am&#233;liorer : cette mise &#224; jour majeure d&#233;ploie de nouvelles fonctionnalit&#233;s tr&#232;s attendues</title>
      <link>https://www.frandroid.com/marques/garmin/2981325_votre-montre-garmin-va-sameliorer-cette-mise-a-jour-majeure-deploie-de-nouvelles-fonctionnalites-tres-attendues</link>
      <pubDate>Wed, 18 Feb 2026 14:12:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/garmin/2981325_votre-montre-garmin-va-sameliorer-cette-mise-a-jour-majeure-deploie-de-nouvelles-fonctionnalites-tres-attendues</guid>
      <description>
Garmin a lanc&#233; le d&#233;ploiement d'une mise &#224; jour cons&#233;quente pour ses montres haut de gamme Fenix 8, Fenix 8 Pro, Enduro 3 et Fenix E, avec de nouvelles fonctions li&#233;es au poids, &#224; la batterie ou &#224; l'heure de coucher. 
</description>
    </item>
    <item>
      <title>iOS 26.4 will bring these 5 upgrades to your iPhone, but there&#8217;s still no sign of the new Siri</title>
      <link>https://www.techradar.com/phones/ios/ios-26-4-will-bring-these-5-upgrades-to-your-iphone-but-theres-still-no-sign-of-the-new-siri</link>
      <pubDate>Wed, 18 Feb 2026 14:08:34 +0000</pubDate>
      <guid isPermaLink="false">s89Hr3Eh4yJqVV23AMR6e8</guid>
      <description>The iOS 26.4 beta has plenty of new features, but the new Apple Intelligence-powered Siri isn&#8217;t one of them.</description>
    </item>
    <item>
      <title>A worrying Dell zero-day flaw has reportedly gone unpatched for nearly two years - and Chinese hackers are taking advantage</title>
      <link>https://www.techradar.com/pro/security/a-dell-zero-day-flaw-has-reportedly-gone-unpatched-for-nearly-two-years-and-chinese-hackers-are-taking-advantage</link>
      <pubDate>Wed, 18 Feb 2026 14:05:00 +0000</pubDate>
      <guid isPermaLink="false">UPsFZ5xukW4CU4HKgxRMEC</guid>
      <description>Login credentials were left hardcoded in a tool, which went undetected for more than a year.</description>
    </item>
    <item>
      <title>NordVPN deal: Get two years of the Complete plan for 70 percent off</title>
      <link>https://www.engadget.com/deals/nordvpn-deal-get-two-years-of-the-complete-plan-for-70-percent-off-123000517.html?src=rss</link>
      <pubDate>Wed, 18 Feb 2026 14:05:00 +0000</pubDate>
      <guid isPermaLink="false">7a83093a-241d-4ab0-89f9-72538e1530fc</guid>
      <description>NordVPN is offering a significant discount on its two-year plans, with 70 percent off its Complete tier and up to 74 percent off overall. For the Complete tier, the deal brings the total cost down to $130 for 24 months.
NordVPN regularly appears on Engadget&#8217;s list of the best VPN services thanks to its wide server network, strong security tools and consistent performance across devices. NordVPN&#8217;s latest promotion puts one of its most comprehensive plans at a price that undercuts many competing premium VPN subscriptions.


The Complete tier includes full access to NordVPN&#8217;s core VPN service, wh...</description>
    </item>
    <item>
      <title>Chris Hemsworth Has High Hopes for Thor&#8217;s MCU Future</title>
      <link>https://gizmodo.com/chris-hemsworth-thor-marvel-future-avengers-doomsday-2000722991</link>
      <pubDate>Wed, 18 Feb 2026 14:00:29 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000722991</guid>
      <description>Plus, Keith David promises his presidential 'Rick and Morty' spinoff is still coming this year.</description>
    </item>
    <item>
      <title>Canva gets to $4B in revenue as LLM referral traffic rises</title>
      <link>https://techcrunch.com/2026/02/18/canva-gets-to-4b-in-revenue-as-llm-referral-traffic-rises/</link>
      <pubDate>Wed, 18 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3090294</guid>
      <description>The creative company's monthly active users increased 20%, growth that was partially propelled by adoption of its AI tools.</description>
    </item>
    <item>
      <title>World Labs lands $200M from Autodesk to bring world models into 3D workflows</title>
      <link>https://techcrunch.com/2026/02/18/world-labs-lands-200m-from-autodesk-to-bring-world-models-into-3d-workflows/</link>
      <pubDate>Wed, 18 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3093950</guid>
      <description>The partnership will see the two companies exploring how World Labs&#8217; models can work alongside Autodesk&#8217;s tools, and vice versa, starting with a focus on entertainment use cases.</description>
    </item>
    <item>
      <title>I tested GHD's pricey new hair dryer against Dyson's Supersonic &#8211; and for ultra-fast drying, there was one clear winner</title>
      <link>https://www.techradar.com/home/hair-care/ghd-speed-vs-dyson-supersonic-nural-dryer</link>
      <pubDate>Wed, 18 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">awepEe6Qxp3q8zFyrx5hWW</guid>
      <description>If you want to splash out on a premium hair dryer, Dyson and GHD are both well worth considering. Here's how their top models compare.</description>
    </item>
    <item>
      <title>How to Make a Killing review: Glen Powell stars in A24s eat-the-rich comedy</title>
      <link>https://mashable.com/article/how-to-make-a-killing-review</link>
      <pubDate>Wed, 18 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">01Hw7zjhc93yNeSOzNj03pz</guid>
      <description>Margaret Qualley, Jessica Henwick, and Ed Harris co-star in John Patton Ford's follow-up to "Emily the Criminal," "How to Make a Killing" with Glen Powell. Review.</description>
    </item>
    <item>
      <title>Bo&#238;te de r&#233;ception | TikTok l&#8217;addictif, l&#8217;itin&#233;rance s&#233;curis&#233;e et l&#8217;IA pour vos finances</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-02-18/boite-de-reception/tiktok-l-addictif-l-itinerance-securisee-et-l-ia-pour-vos-finances.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 18 Feb 2026 09:00:00 -0500</pubDate>
      <guid isPermaLink="false">acea2d3bbdfe3696974d69a6b4d4ca9e</guid>
      <description>Chaque mercredi, notre journaliste r&#233;pond &#224; vos questions en lien avec le num&#233;rique et les nouvelles technologies. Cette semaine, on se penche sur la d&#233;pendance cr&#233;&#233;e par TikTok, on compare WiFi et cellulaire en itin&#233;rance, et on se demande si l&#8217;IA est un bon conseiller financier.</description>
    </item>
    <item>
      <title>Can't wait for the God of War Trilogy remake? Me neither &#8212; here are the best books, games, and merch to help tide you over</title>
      <link>https://www.techradar.com/gaming/cant-wait-for-the-god-of-war-trilogy-remake-me-neither-here-are-the-best-books-games-and-merch-to-help-tide-you-over</link>
      <pubDate>Wed, 18 Feb 2026 13:58:55 +0000</pubDate>
      <guid isPermaLink="false">KfAGtAEDUrCf5eEMAyE3ZT</guid>
      <description>If the God of War Trilogy remake announcement has got you thirsty for more from the series, then these God of War games, books, and bits of merch will hit the spot.</description>
    </item>
  </channel>
</rss>
