<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 10 Nov 2025 09:43:46 GMT</lastBuildDate>
    <item>
      <title>&#171; Arr&#234;t&#233; ou rendu inutilisable &#187; : les v&#233;hicules &#233;lectriques chinois pourraient &#234;tre contr&#244;l&#233;s &#224; distance par la Chine</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2861715_arrete-ou-rendu-inutilisable-les-vehicules-electriques-chinois-pourraient-etre-controles-a-distance-par-la-chine</link>
      <pubDate>Mon, 10 Nov 2025 09:39:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2861715_arrete-ou-rendu-inutilisable-les-vehicules-electriques-chinois-pourraient-etre-controles-a-distance-par-la-chine</guid>
      <description>
Les v&#233;hicules &#233;lectriques chinois peuvent-ils &#234;tre contr&#244;l&#233;s et d&#233;sactiv&#233;s &#224; distance par la Chine ? Ce n'est pas une simple id&#233;e loufoque, c'est une vraie r&#233;alit&#233;, dont sont en train de prendre conscience le Royaume-Unis et le Danemark.
</description>
    </item>
    <item>
      <title>Pour voler des voitures en moins de 2 minutes, des criminels se servent d&#8217;enceintes connect&#233;es</title>
      <link>https://www.01net.com/actualites/voler-voitures-moins-2-minutes-criminels-servent-enceintes-connectees.html</link>
      <pubDate>Mon, 10 Nov 2025 09:33:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306581</guid>
      <description>Un r&#233;seau international de voleurs de voitures a &#233;t&#233; d&#233;mantel&#233; par la justice fran&#231;aise. Les malfaiteurs utilisaient des enceintes connect&#233;es reprogramm&#233;es pour prendre le contr&#244;le des v&#233;hicules en moins de deux minutes. Vendues plusieurs milliers d'euros sur Telegram, les enceintes trafiqu&#233;es sont l'&#339;uvre d'un sp&#233;cialiste de l'&#233;lectronique automobile de l&#8217;Eure-et-Loir....</description>
    </item>
    <item>
      <title>Pr&#233;-Black Friday 2025 : voici les meilleures offres en DIRECT d&#8217;Amazon, Boulanger, Fnac, Darty&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2849105_black-friday-2025-les-offres-pleuvent-chez-amazon-co-nous-avons-retenir-les-meilleures-offres-en-avant-premiere</link>
      <pubDate>Mon, 10 Nov 2025 09:31:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849105_black-friday-2025-les-offres-pleuvent-chez-amazon-co-nous-avons-retenir-les-meilleures-offres-en-avant-premiere</guid>
      <description>
De nombreux e-commer&#231;ants ont pris de l'avance sur le Black Friday. On trouve d&#233;j&#224; de belles remises sur de nombreux produits Tech. Nous suivons les offres les plus int&#233;ressantes en temps r&#233;el pour vous pr&#233;senter une s&#233;lection des meilleures promotions tech du moment, incluant smartphones, ordinateurs, t&#233;l&#233;viseurs, objets connect&#233;s et accessoires.
...</description>
    </item>
    <item>
      <title>&#171; Suspicion d&#8217;exc&#232;s de vitesse &#187; : la police peut appliquer cette nouvelle r&#232;gle contre les fatbikes &#233;lectriques aux Pays-Bas</title>
      <link>https://www.frandroid.com/actualites-generales/2861747_suspicion-dexces-de-vitesse-la-police-peut-appliquer-cette-nouvelle-regle-contre-les-fatbikes-electriques-aux-pays-bas</link>
      <pubDate>Mon, 10 Nov 2025 09:20:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2861747_suspicion-dexces-de-vitesse-la-police-peut-appliquer-cette-nouvelle-regle-contre-les-fatbikes-electriques-aux-pays-bas</guid>
      <description>
Les autorit&#233;s n&#233;erlandaises durcissent leur position face au d&#233;bridage des fatbikes &#233;lectriques. Une r&#233;cente s&#233;rie de d&#233;cisions judiciaires permet d&#233;sormais &#224; la police d&#8217;intervenir sur simple suspicion d&#8217;exc&#232;s de vitesse.
</description>
    </item>
    <item>
      <title>Windows 11 : l&#8217;ic&#244;ne de batterie prend des couleurs, voici son nouveau look</title>
      <link>https://www.frandroid.com/marques/microsoft/2861647_windows-11-licone-de-batterie-prend-des-couleurs-voici-son-nouveau-look</link>
      <pubDate>Mon, 10 Nov 2025 09:14:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2861647_windows-11-licone-de-batterie-prend-des-couleurs-voici-son-nouveau-look</guid>
      <description>
Windows 11 enrichit sa barre de t&#226;ches et ajoute de la couleur pour mieux rep&#233;rer ses diff&#233;rents niveaux de batterie. 
</description>
    </item>
    <item>
      <title>Ce virus a pu infecter les Samsung Galaxy pendant 1 an sans &#234;tre d&#233;couvert</title>
      <link>https://www.01net.com/actualites/ce-virus-a-pu-infecter-les-samsung-galaxy-pendant-1-an-sans-etre-decouvert.html</link>
      <pubDate>Mon, 10 Nov 2025 09:14:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306595</guid>
      <description>Landfall est un spyware particuli&#232;rement d&#233;vastateur qui agit sur les smartphones Samsung Galaxy. Il a pu op&#233;rer pendant un an avant d&#8217;&#234;tre r&#233;v&#233;l&#233; au grand jour.</description>
    </item>
    <item>
      <title>The 13 Best Sexy Gifts for Lovers (2025)</title>
      <link>https://www.wired.com/gallery/best-sexy-gift/</link>
      <pubDate>Mon, 10 Nov 2025 09:11:00 +0000</pubDate>
      <guid isPermaLink="false">61b398f493c301c027def12b</guid>
      <description>Spice things up with our favorite sex toys, date-night boxes, and lingerie for every type of couple.</description>
    </item>
    <item>
      <title>Pourquoi l&#8217;UE s&#8217;appr&#234;te &#224; lancer un d&#233;bat enflamm&#233; : vie priv&#233;e vs IA ?</title>
      <link>https://www.frandroid.com/culture-tech/politique/2861667_pourquoi-lue-sapprete-a-lancer-un-debat-enflamme-vie-privee-vs-ia</link>
      <pubDate>Mon, 10 Nov 2025 09:08:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/politique/2861667_pourquoi-lue-sapprete-a-lancer-un-debat-enflamme-vie-privee-vs-ia</guid>
      <description>
Face &#224; la vague de l&#8217;IA, le Vieux Continent est-il &#224; la tra&#238;ne&#8201;? C&#8217;est ce que semblent penser certains &#233;lus &#224; Bruxelles qui tentent de modifier le RGPD pour permettre un usage moine restrictif des ChatGPT et consorts.
</description>
    </item>
    <item>
      <title>Seuls ces MacBook Pro auront droit &#224; l&#8217;&#233;cran Oled tant attendu</title>
      <link>https://www.frandroid.com/marques/apple/2861681_seuls-ces-macbook-pro-auront-droit-a-lecran-oled-tant-attendu</link>
      <pubDate>Mon, 10 Nov 2025 09:06:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2861681_seuls-ces-macbook-pro-auront-droit-a-lecran-oled-tant-attendu</guid>
      <description>
Le nouveau design des MacBook Pro avec &#233;cran Oled ne concernera que quelques mod&#232;les au lancement.
</description>
    </item>
    <item>
      <title>Windows 11&#160;: Microsoft supprime l&#8217;acc&#232;s aux photos de votre smartphone dans Mobile connect&#233;</title>
      <link>https://www.01net.com/actualites/windows-11-microsoft-supprime-lacces-aux-photos-de-votre-smartphone-dans-mobile-connecte.html</link>
      <pubDate>Mon, 10 Nov 2025 09:01:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306597</guid>
      <description>L&#8217;application mobile connect&#233;, qui permet d&#8217;acc&#233;der au contenu de votre smartphone sur Windows, va perdre l&#8217;acc&#232;s aux photos de votre mobile.</description>
    </item>
    <item>
      <title>Courage can help you take bold action in your life and at work. Here&#8217;s how</title>
      <link>https://www.fastcompany.com/91435299/courage-bold-action-life-work</link>
      <pubDate>2025-11-10T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91435299/courage-bold-action-life-work</guid>
      <description>We make the biggest difference when we infuse teams and organizations with courage.
Below, Ranjay Gulati shares five key insights from his new book,&#160;How to Be Bold: The Surprising Science of Everyday Courage.</description>
    </item>
    <item>
      <title>How to build a career that survives market cycles</title>
      <link>https://www.fastcompany.com/91435818/how-to-build-a-career-that-survives-market-cycles</link>
      <pubDate>2025-11-10T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91435818/how-to-build-a-career-that-survives-market-cycles</guid>
      <description>Adaptability is one of the most crucial skills a leader can possess&#8230; especially in this economy.
Every professional faces cycles consisting of booms, busts, restructurings, and reinventions. The difference between those who endure and those who fade isn&#8217;t luck or timing; it&#8217;s adaptability. In volatile economies, careers built on curiosity and agility thrive long after others stall....</description>
    </item>
    <item>
      <title>&#171; Tesla et les entreprises chinoises vont dominer le march&#233; &#187; : pourquoi Elon Musk f&#233;licite l&#8217;un de ses plus grands concurrents</title>
      <link>https://www.frandroid.com/marques/xpeng/2861643_tesla-et-les-entreprises-chinoises-vont-dominer-le-marche-pourquoi-elon-musk-felicite-lun-de-ses-plus-grands-concurrents</link>
      <pubDate>Mon, 10 Nov 2025 08:39:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2861643_tesla-et-les-entreprises-chinoises-vont-dominer-le-marche-pourquoi-elon-musk-felicite-lun-de-ses-plus-grands-concurrents</guid>
      <description>
Elon Musk ne m&#226;che pas ses mots, et pour une fois, il f&#233;licite l'un de ses plus grands concurrents : Xpeng. L'entreprise chinoise, qui fabrique des voitures &#233;lectriques, vient de d&#233;voiler un robot. Et le patron de Tesla semble surpris.
</description>
    </item>
    <item>
      <title>&#171; Boules de feu, des d&#233;bris et des champignons atomiques &#187; : voici comment l&#8217;Ukraine utilise les voitures &#224; hydrog&#232;ne dans la guerre contre la Russie</title>
      <link>https://www.frandroid.com/marques/toyota/2861613_boules-de-feu-des-debris-et-des-champignons-atomiques-voici-comment-lukraine-utilise-les-voitures-a-hydrogene-dans-la-guerre-contre-la-russie</link>
      <pubDate>Mon, 10 Nov 2025 08:30:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/toyota/2861613_boules-de-feu-des-debris-et-des-champignons-atomiques-voici-comment-lukraine-utilise-les-voitures-a-hydrogene-dans-la-guerre-contre-la-russie</guid>
      <description>
Si les ventes de la Toyota Mirai sont en chute libre, la voiture &#233;lectrique &#224; hydrog&#232;ne semble s&#233;duire un autre type d&#8217;utilisateurs. Et pour cause, l&#8217;arm&#233;e ukrainienne s&#8217;en sert d&#233;sormais comme bombe dans le conflit qui l&#8217;oppose &#224; la Russie.
</description>
    </item>
    <item>
      <title>MacBook Pro M6&#160;: Apple r&#233;serverait l&#8217;&#233;cran OLED aux &#233;ditions plus ch&#232;res</title>
      <link>https://www.01net.com/actualites/macbook-pro-m6-apple-reserverait-ecran-oled-editions-plus-cheres.html</link>
      <pubDate>Mon, 10 Nov 2025 08:01:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306568</guid>
      <description>Apple pr&#233;parerait une refonte s&#233;lective de son MacBook Pro. Selon un informateur r&#233;put&#233;, seuls les mod&#232;les M6 Pro et M6 Max auraient droit au nouveau design plus fin et &#224; l&#8217;&#233;cran OLED tactile. Sur l'&#233;dition standard, on trouverait &#224; nouveau un &#233;cran LCD.</description>
    </item>
    <item>
      <title>Caroline Flack&#8217;s truth finally comes out in new Disney+ documentary &#8211; and it&#8217;s the most harrowing watch of the year</title>
      <link>https://www.techradar.com/streaming/disney-plus/caroline-flacks-truth-finally-comes-out-in-new-disney-documentary-and-its-the-most-harrowing-watch-of-the-year</link>
      <pubDate>Mon, 10 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">x7ALWzcKCqYFcxh9rcvdCN</guid>
      <description>Caroline Flack: Search for the Truth on Disney+ and Hulu is a heartbreaking watch, but it reminds us we all need to face a lot of harsh truths.</description>
    </item>
    <item>
      <title>Scared for your career&#8217;s future? Try the &#8216;GPS method&#8217;</title>
      <link>https://www.fastcompany.com/91437633/scared-for-your-careers-future-try-the-gps-method</link>
      <pubDate>2025-11-10T08:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91437633/scared-for-your-careers-future-try-the-gps-method</guid>
      <description>It&#8217;s a grounding practice to help you plot your next move strategically.
The job market is rough right now. Mass layoffs have people desperately clinging to their current positions. The Great Flattening has more and more workers competing for a dwindling number of roles as entry-level roles dry up and AI potentially rendering entire career paths obsolete.&#160;...</description>
    </item>
    <item>
      <title>La nouvelle Renault Twingo prouve que les voitures &#233;lectriques sont plus &#233;cologiques que les essence</title>
      <link>https://www.frandroid.com/marques/renault/2861603_la-nouvelle-renault-twingo-prouve-que-les-voitures-electriques-sont-plus-ecologiques-que-les-essence</link>
      <pubDate>Mon, 10 Nov 2025 07:58:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2861603_la-nouvelle-renault-twingo-prouve-que-les-voitures-electriques-sont-plus-ecologiques-que-les-essence</guid>
      <description>
Tout juste d&#233;voil&#233;e, la nouvelle Renault Twingo fait de gros progr&#232;s par rapport &#224; la pr&#233;c&#233;dente g&#233;n&#233;ration, et notamment sur un point. Car la petite voiture &#233;lectrique affiche une empreinte carbone particuli&#232;rement basse.
</description>
    </item>
    <item>
      <title>9 data-driven ways to finalize your post&#8209;Windows 10 strategy</title>
      <link>https://www.techradar.com/pro/9-data-driven-ways-to-finalize-your-post-windows-10-strategy</link>
      <pubDate>Mon, 10 Nov 2025 07:56:13 +0000</pubDate>
      <guid isPermaLink="false">tJnmHSCPrwWaecD9ZVHqKE</guid>
      <description>As the Windows 10 deadline looms, here are 9 strategies on how to use precise data to upgrade, extend, or repurpose endpoints effectively.</description>
    </item>
    <item>
      <title>Android&#160;16 va mieux masquer votre adresse, particuli&#232;rement si vous habitez &#224; la campagne</title>
      <link>https://www.frandroid.com/marques/google/2861609_android-16-va-mieux-masquer-votre-adresse-particulierement-si-vous-habitez-a-la-campagne</link>
      <pubDate>Mon, 10 Nov 2025 07:55:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2861609_android-16-va-mieux-masquer-votre-adresse-particulierement-si-vous-habitez-a-la-campagne</guid>
      <description>
Petit &#224; petit, Android offre de plus en plus d&#8217;outils pour tenter de limiter le partage des donn&#233;es personnelles avec des tiers. La derni&#232;re en date vise tout particuli&#232;rement celles et ceux qui habitent dans les zones rurales.
</description>
    </item>
    <item>
      <title>Il pense battre Apple et Samsung &#224; leur propre jeu : voici le Motorola Edge 70, on l&#8217;a pris en main</title>
      <link>https://www.frandroid.com/marques/motorola/2853417_il-pense-battre-apple-et-samsung-a-leur-propre-jeu-voici-le-motorola-edge-70-on-la-pris-en-main</link>
      <pubDate>Mon, 10 Nov 2025 07:51:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/motorola/2853417_il-pense-battre-apple-et-samsung-a-leur-propre-jeu-voici-le-motorola-edge-70-on-la-pris-en-main</guid>
      <description>
Le Motorola Edge 70 vient d'&#234;tre officialis&#233; en exclusivit&#233; chez Orange et nous avons d&#233;j&#224; pris en main ce nouveau smartphone ultra fin. Est-il capable de faire trembler Apple et Samsung ?
</description>
    </item>
  </channel>
</rss>
