<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 25 Nov 2025 14:46:30 GMT</lastBuildDate>
    <item>
      <title>The geek&amp;#8217;s guide to running faster</title>
      <link>https://www.theverge.com/podcast/828616/running-tech-gear-motion-smoothing-vergecast</link>
      <pubDate>2025-11-25T09:42:17-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=828616</guid>
      <description>One thing we talk a lot about on The Vergecast is how to engage with technology without losing your mind. One version of that discussion has to do with fitness, and the so-called quantified self: what does it take to make use of the tools and trackers available to you, without letting exercise take over [&#8230;]</description>
    </item>
    <item>
      <title>Comment v&#233;rifier la qualit&#233; du r&#233;seau 4G et 5G pr&#232;s de chez vous (Orange, SFR, Bouygues, Free) avec ces cartes de couverture mobile</title>
      <link>https://www.frandroid.com/telecom/2885113_comment-verifier-la-qualite-du-reseau-4g-et-5g-pres-de-chez-vous-orange-sfr-bouygues-free-avec-ces-cartes-de-couverture-mobile</link>
      <pubDate>Tue, 25 Nov 2025 14:38:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2885113_comment-verifier-la-qualite-du-reseau-4g-et-5g-pres-de-chez-vous-orange-sfr-bouygues-free-avec-ces-cartes-de-couverture-mobile</guid>
      <description>
Les op&#233;rateurs affichent tous fi&#232;rement &#171; 99 % de la population couverte &#187;. Super, mais cela ne veut pas dire 99 % du territoire. Et encore moins l'int&#233;rieur de votre appartement. Pour savoir si vous allez vraiment capter la 4G ou la 5G, il faut arr&#234;ter de regarder les publicit&#233;s et se tourner vers des donn&#233;es techniques et ind&#233;pendantes.
</description>
    </item>
    <item>
      <title>Liquid Web Black Friday Sale! Save up to 77% on "exceptional" hosting</title>
      <link>https://www.techradar.com/seasonal-sales/liquid-web-black-friday-sale-save-up-to-77-percent-on-exceptional-hosting</link>
      <pubDate>Tue, 25 Nov 2025 14:32:09 +0000</pubDate>
      <guid isPermaLink="false">dYmSQ5G6Y5wkofqxhxZZai</guid>
      <description>Liquid Web Black Friday Sale! Save up to 77% on "exceptional" hosting</description>
    </item>
    <item>
      <title>Forget about Microsoft Surface - Dell unleashes incredible XPS 13 Snapdragon Elite deal for less than &#163;1,000</title>
      <link>https://www.techradar.com/computing/windows-laptops/forget-about-microsoft-surface-dell-unleashes-incredible-xps-13-snapdragon-elite-deal-for-less-than-gbp1-000</link>
      <pubDate>Tue, 25 Nov 2025 14:30:27 +0000</pubDate>
      <guid isPermaLink="false">qj8sng8ALGUWPmvDqi3QNm</guid>
      <description>This Dell XPS 13 deal for just &#163;999 should tempt even the most hardcore of Surface laptop fans</description>
    </item>
    <item>
      <title>Comment changer son code PIN sur iPhone</title>
      <link>https://www.frandroid.com/comment-faire/tutoriaux/tutoriels-smartphones/628206_comment-modifier-le-code-pin-sur-iphone</link>
      <pubDate>Tue, 25 Nov 2025 14:28:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/comment-faire/tutoriaux/tutoriels-smartphones/628206_comment-modifier-le-code-pin-sur-iphone</guid>
      <description>
Le code PIN de votre iPhone est r&#233;gl&#233; sur 0000 ou 1234 ? Pour des raisons de s&#233;curit&#233;, vous feriez bien de le modifier ! Voici notre tutoriel pas &#224; pas pour modifier son code PIN sur iPhone.
</description>
    </item>
    <item>
      <title>On n&#8217;envoie pas un vaisseau vide par hasard : la Chine reconna&#238;t un probl&#232;me s&#233;rieux &#224; bord de sa station spatiale</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronautique-on-nenvoie-pas-vaisseau-vide-hasard-chine-reconnait-probleme-serieux-bord-station-spatiale-127919/#xtor%3DRSS-8</link>
      <pubDate>Tue, 25 Nov 2025 15:27:46 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronautique-on-nenvoie-pas-vaisseau-vide-hasard-chine-reconnait-probleme-serieux-bord-station-spatiale-127919/#xtor%3DRSS-8</guid>
      <description>La mission Shenzhou 22 a d&#233;coll&#233; &#224; vide t&#244;t ce matin &#224; la rencontre de la Station spatiale chinoise. Elle pourra remplacer le v&#233;hicule endommag&#233; pour le retour prochain des astronautes en s&#233;jour en orbite.</description>
    </item>
    <item>
      <title>Apple menace de nouveau de retirer sa fonction contre le suivi publicitaire en Europe</title>
      <link>https://www.01net.com/actualites/apple-menace-de-nouveau-de-retirer-sa-fonction-contre-le-suivi-publicitaire-en-europe.html</link>
      <pubDate>Tue, 25 Nov 2025 14:24:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311081</guid>
      <description>Apple agite une fois de plus la menace de retirer la fonction anti-suivi publicitaire en Europe. Une enqu&#234;te lanc&#233;e par l'autorit&#233; de la concurrence polonaise vise en effet l'App Tracking Transparency (ATT), soup&#231;onn&#233; de restreindre la concurrence dans le secteur de la publicit&#233; mobile au profit du constructeur.</description>
    </item>
    <item>
      <title>Cdiscount casse les prix de nombreux produits Tech pour la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2850059_cdiscount-degaine-de-belles-offres-pour-la-black-friday-week-les-11-offres-a-ne-pas-louper-ce-week-end</link>
      <pubDate>Tue, 25 Nov 2025 14:24:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850059_cdiscount-degaine-de-belles-offres-pour-la-black-friday-week-les-11-offres-a-ne-pas-louper-ce-week-end</guid>
      <description>
&#192; l&#8217;approche du Black Friday, Cdiscount d&#233;voile de nouvelles r&#233;ductions sur de nombreux produits Tech. Retrouvez ci-dessous notre s&#233;lection des offres les plus attractives actuellement disponibles chez le marchand.
</description>
    </item>
    <item>
      <title>Apple is cutting jobs: these teams will be impacted by layoffs</title>
      <link>https://www.fastcompany.com/91448862/apple-cutting-jobs-teams-impacted-layoffs</link>
      <pubDate>2025-11-25T14:14:48</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448862/apple-cutting-jobs-teams-impacted-layoffs</guid>
      <description>According to Bloomberg News, the impacted employees include account managers serving major businesses, schools, and government agencies.
Apple said on Monday it is cutting jobs across its sales teams to strengthen its customer engagement efforts, noting that only a small number of roles will be impacted by the layoffs.</description>
    </item>
    <item>
      <title>Is Bitcoin going back up? BTC price watchers might be a bit less &#8216;fearful&#8217; this week</title>
      <link>https://www.fastcompany.com/91448825/bitcoin-price-going-back-up-btc-sentiment-still-fearful</link>
      <pubDate>2025-11-25T14:13:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448825/bitcoin-price-going-back-up-btc-sentiment-still-fearful</guid>
      <description>After tumbling 35% from its recent highs, the cryptocurrency is showing hints of a rebound this week as investor sentiment has slightly improved.
Only a week after experiencing a dreaded &#8220;death cross,&#8221; and subsequently seeing its value fall to less than $81,000, Bitcoin is showing some signs of recovering. </description>
    </item>
    <item>
      <title>Crypto Founder Defends FBI Involvement After Developer Accidentally Causes Blockchain Split</title>
      <link>https://gizmodo.com/crypto-founder-defends-fbi-involvement-after-developer-accidentally-causes-blockchain-split-2000690899</link>
      <pubDate>Tue, 25 Nov 2025 14:10:46 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000690899</guid>
      <description>Innocent pen testing mistake or premeditated attack?</description>
    </item>
    <item>
      <title>60+ Black Friday Target deals: We found super solid discounts on Apple, Sony, Keurig, and Legos</title>
      <link>https://mashable.com/article/best-early-black-friday-target-deals-2025</link>
      <pubDate>Tue, 25 Nov 2025 14:06:25 +0000</pubDate>
      <guid isPermaLink="false">00q03lnhk9TuIOJuw1D7Tti</guid>
      <description>Target's Black Friday sale officially went live on Nov. 23. The best deals include Sony headphones, Keurig coffee makers, and Uber gift cards.</description>
    </item>
    <item>
      <title>Harvard University reveals data breach hitting alumni and donors</title>
      <link>https://www.techradar.com/pro/security/harvard-university-reveals-data-breach-hitting-alumni-and-donors</link>
      <pubDate>Tue, 25 Nov 2025 14:03:00 +0000</pubDate>
      <guid isPermaLink="false">UPCLCijeCie5Zk9QoPKDKR</guid>
      <description>Personal information of Harvard students, alumni, donors, and faculty members all exposed.</description>
    </item>
    <item>
      <title>Black Friday Week : de l&#8217;enceinte connect&#233;e &#224; l&#8217;airfryer, nos offres favorites sur la maison connect&#233;e</title>
      <link>https://www.frandroid.com/bons-plans/2858095_black-friday-airfryers-cameras-ampoules-meilleures-promos</link>
      <pubDate>Tue, 25 Nov 2025 14:00:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2858095_black-friday-airfryers-cameras-ampoules-meilleures-promos</guid>
      <description>
Air fryer, ampoules connect&#233;es ou cam&#233;ras de surveillance&#8230; Les essentiels de la maison connect&#233;e s&#8217;affichent d&#233;j&#224; &#224; prix r&#233;duit avant le Black Friday. C&#8217;est l&#8217;occasion parfaite de se lancer dans la domotique ou d&#8217;enrichir votre &#233;quipement gr&#226;ce &#224; notre s&#233;lection des meilleures offres du moment.
</description>
    </item>
    <item>
      <title>Olaf Has Been Added to the List of Disney Animatronics We&#8217;d Fear in a Robot Uprising</title>
      <link>https://gizmodo.com/olaf-has-been-added-to-the-list-of-disney-animatronics-wed-fear-in-a-robot-uprising-2000691141</link>
      <pubDate>Tue, 25 Nov 2025 14:00:22 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000691141</guid>
      <description>Imagineering's entertainment robots get cuter and cuddlier as they become more advanced, so surely there's nothing to worry about.</description>
    </item>
    <item>
      <title>8 Best Cheap Phones (2025), Tested and Reviewed</title>
      <link>https://www.wired.com/story/best-cheap-phones/</link>
      <pubDate>Tue, 25 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">5a8f727d213ac83aca7f0a36</guid>
      <description>There&#8217;s little reason to pay top dollar for a smartphone. These iPhones and Android devices&#8212;ranging from $100 to $600&#8212;stood up to WIRED&#8217;s testing.</description>
    </item>
    <item>
      <title>One of our favorite Switch 2 controllers is 20 percent off right now</title>
      <link>https://www.theverge.com/gadgets/827225/8bitdo-ultimate-2-bluetooth-controller-black-friday-deal-sale-2025</link>
      <pubDate>2025-11-25T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=827225</guid>
      <description>If you&#8217;re going to prove to your siblings that you&#8217;re still the family&#8217;s Mario Kart champion, you&#8217;re going to need an extra controller to make sure it&#8217;s a fair race. Fortunately, 8BitDo&#8217;s Ultimate 2 Bluetooth Controller &#8212; which is compatible with the Nintendo Switch, Switch 2, and Windows machines &#8212; is marked down to a [&#8230;]</description>
    </item>
    <item>
      <title>Rian Johnson doesn&amp;#8217;t have a plan for Knives Out</title>
      <link>https://www.theverge.com/report/827712/rian-johnson-interview-knives-out-wake-up-dead-man</link>
      <pubDate>2025-11-25T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=827712</guid>
      <description>Three movies in, Knives Out is really showing its range. After starting out with a mystery on a cozy New England estate, followed by a sequel set on a Greek island owned by an Elon Musk-style tech bro, the series gets much darker with Wake Up Dead Man. This time, director Rian Johnson crafted a [&#8230;]</description>
    </item>
    <item>
      <title>Valve casse le prix de son Steam Deck pendant la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2395268_valve-casse-le-prix-de-son-steam-deck-pendant-la-black-friday-week</link>
      <pubDate>Tue, 25 Nov 2025 13:59:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2395268_valve-casse-le-prix-de-son-steam-deck-pendant-la-black-friday-week</guid>
      <description>
En allant directement sur le site de Valve, vous retrouvez le mod&#232;le LCD du Steam Deck, en version 256 Go, avec une belle petite baisse de prix pendant la Black Friday Week : 335,20 euros au lieu de 419 euros. 
</description>
    </item>
    <item>
      <title>Black Friday iPad deals have arrived &#8211; get record-low prices on Apple's top models</title>
      <link>https://www.techradar.com/tablets/ipad/black-friday-ipad-deals-have-arrived-get-record-low-prices-on-apples-top-models</link>
      <pubDate>Tue, 25 Nov 2025 13:58:57 +0000</pubDate>
      <guid isPermaLink="false">PzuUkbYvarzkW3jJXMXiNJ</guid>
      <description>We've rounded up the best Black Friday iPad deals at retailers across the US and UK.</description>
    </item>
    <item>
      <title>P&#233;nurie RAM : ce kit Corsair 16 Go est l&#8217;un des derniers &#224; prix correct</title>
      <link>https://www.frandroid.com/bons-plans/bons-plans-hardware/2885009_penurie-ram-ce-kit-corsair-16-go-est-lun-des-derniers-a-prix-correct</link>
      <pubDate>Tue, 25 Nov 2025 13:57:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/bons-plans-hardware/2885009_penurie-ram-ce-kit-corsair-16-go-est-lun-des-derniers-a-prix-correct</guid>
      <description>
Ce n'est pas la promo du si&#232;cle en pourcentage. Mais dans le contexte actuel de hausse g&#233;n&#233;ralis&#233;e des composants, trouver de la bonne RAM Corsair &#224; ce prix, c'est devenu une victoire. Profitez-en avant que &#231;a flambe.
</description>
    </item>
    <item>
      <title>xTool lance le F2 Ultra UV et d&#233;voile son initiative &#8220;Make It Here&#8221; en Europe</title>
      <link>https://www.01net.com/actualites/xtool-lance-le-f2-ultra-uv-et-devoile-son-initiative-make-it-here-en-europe.html</link>
      <pubDate>Tue, 25 Nov 2025 13:56:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309634</guid>
      <description>xTool rend la puissance industrielle accessible aux petits cr&#233;ateurs et aux passionn&#233;s de DIY.</description>
    </item>
    <item>
      <title>ChatGPT&#8217;s Agent feature lets you assign tasks and walk away &#8211; here&#8217;s how it works</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/chatgpts-agent-feature-lets-you-assign-tasks-and-walk-away-heres-how-it-works</link>
      <pubDate>Tue, 25 Nov 2025 13:55:41 +0000</pubDate>
      <guid isPermaLink="false">ARckck3F3j5mwjx8o8AKCf</guid>
      <description>ChatGPT Agent is like a background assistant that gets things done while you&#8217;re busy doing life</description>
    </item>
    <item>
      <title>The 30+ best Black Friday Apple deals: Record-low prices on MacBooks and $69 AirPods</title>
      <link>https://mashable.com/article/best-early-black-friday-apple-best-ever-deals-airpods-macbooks-2025</link>
      <pubDate>Tue, 25 Nov 2025 13:50:41 +0000</pubDate>
      <guid isPermaLink="false">00W2PwvebT2o0bXAOveXkIb</guid>
      <description>Mashable's shopping reporters dug up the best Black Friday Apple deals, including year-round lows on AirPods and MacBooks.</description>
    </item>
    <item>
      <title>This Black Friday why not invest in your kids' safety? Bark has some major discounts on phones and smartwatches available right now</title>
      <link>https://www.techradar.com/pro/this-black-friday-why-not-invest-in-your-kids-safety-bark-has-some-major-discounts-on-phones-and-smartwatches-available-right-now</link>
      <pubDate>Tue, 25 Nov 2025 13:49:54 +0000</pubDate>
      <guid isPermaLink="false">pWQATFMCQargtUAczn9WU7</guid>
      <description>Save $75 on a Bark Phone or $20 on a Bark Smartwatch</description>
    </item>
    <item>
      <title>La Nintendo Switch 2, la PS5 et le Steam Deck sont les vedettes du Black Friday ! Notre s&#233;lection des meilleurs offres sur les consoles et le gaming</title>
      <link>https://www.frandroid.com/bons-plans/2853043_black-friday-week-switch-2-voici-les-meilleures-promo-sur-les-consoles-jeux-manettes-et-accessoires-nintendo-playstation-et-xbox</link>
      <pubDate>Tue, 25 Nov 2025 13:49:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2853043_black-friday-week-switch-2-voici-les-meilleures-promo-sur-les-consoles-jeux-manettes-et-accessoires-nintendo-playstation-et-xbox</guid>
      <description>
L'ann&#233;e 2025 a &#233;t&#233; particuli&#232;rement riche du c&#244;t&#233; des jeux vid&#233;o. La Black Friday Week sur l'univers consoles et jeux vid&#233;o ne pouvait donc &#234;tre que passionnante. La toute r&#233;cente Nintendo Switch 2 est bien s&#251;r la grande vedette cette ann&#233;e, mais la PS5 n'a pas non plus dit son dernier mot...
</description>
    </item>
    <item>
      <title>The best turntables for all budgets, tested and selected by TechRadar's audio experts</title>
      <link>https://www.techradar.com/audio/turntables/the-best-turntables</link>
      <pubDate>Tue, 25 Nov 2025 13:49:01 +0000</pubDate>
      <guid isPermaLink="false">5EHn8d3kGr8ZQJkcsUXLRX</guid>
      <description>The best record player is just a few clicks away, whether you're a vinyl veteran or a turntable newbie &#8211; and every one is TechRadar tested and approved.</description>
    </item>
    <item>
      <title>HMV is having a huge Black Friday sale on 4K Blu-ray &#8211; here are the 6 discs I'd pick</title>
      <link>https://www.techradar.com/televisions/blu-ray/hmv-is-having-a-huge-black-friday-sale-on-4k-blu-ray-here-are-the-6-discs-id-pick</link>
      <pubDate>Tue, 25 Nov 2025 13:46:47 +0000</pubDate>
      <guid isPermaLink="false">Ca9p7aGnYhYitMtDpbmg5</guid>
      <description>4K Blu-ray fans, be sure to check out HMV's Black Friday sale where you can save 20% on thousands of discs.</description>
    </item>
    <item>
      <title>The best earbuds I recommend for every budget, all TechRadar tested</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/the-best-earbuds</link>
      <pubDate>Tue, 25 Nov 2025 13:42:23 +0000</pubDate>
      <guid isPermaLink="false">v6KhHtp4uqZNoCs2w9vZhh</guid>
      <description>My carefully considered pick of the best earbuds in the business &#8211; including one or two new models you might not be familiar with.</description>
    </item>
    <item>
      <title>Aluminium OS&#160;: le projet de Google pour rivaliser avec Windows, macOS et l&#8217;iPad</title>
      <link>https://www.01net.com/actualites/aluminium-os-le-projet-de-google-pour-rivaliser-avec-windows-macos-et-lipad.html</link>
      <pubDate>Tue, 25 Nov 2025 13:39:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311071</guid>
      <description>En coulisses, Google continue de travailler sur le rapprochement de ChromeOS et d'Android, un projet cens&#233; concurrencer les deux cadors du secteur &#8212;&#160;Windows et macOS&#160;&#8212; ainsi que l'iPad plus efficacement qu'avec la version actuelle de ChromeOS. Les pi&#232;ces du puzzle commencent &#224; se mettre en place.</description>
    </item>
    <item>
      <title>I&#8217;ve tested 30 Bluetooth speakers this year, here are the only 5 Black Friday deals I&#8217;d buy</title>
      <link>https://www.techradar.com/audio/wireless-bluetooth-speakers/ive-tested-30-bluetooth-speakers-this-year-here-are-the-only-5-black-friday-deals-id-buy</link>
      <pubDate>Tue, 25 Nov 2025 13:38:48 +0000</pubDate>
      <guid isPermaLink="false">BDr2gbjyWMqhuJTpFDYwW7</guid>
      <description>After testing more than 30 Bluetooth speakers this year, these are the 5 models I&#8217;d buy in the Black Friday sales.</description>
    </item>
    <item>
      <title>Mise &#224; jour Waze : la limitation la plus aga&#231;ante d&#8217;Android Auto dispara&#238;t</title>
      <link>https://www.frandroid.com/survoltes/2884959_mise-a-jour-waze-la-limitation-la-plus-agacante-dandroid-auto-disparait</link>
      <pubDate>Tue, 25 Nov 2025 13:37:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2884959_mise-a-jour-waze-la-limitation-la-plus-agacante-dandroid-auto-disparait</guid>
      <description>
Google Maps le fait depuis 2023. Il aura fallu attendre fin 2025 pour que Waze se d&#233;cide enfin. L'application GPS communautaire fait sauter son verrouillage d'&#233;cran lorsque vous &#234;tes connect&#233; &#224; Android Auto. Une mise &#224; jour silencieuse, mais qui change tout au quotidien.
</description>
    </item>
    <item>
      <title>Boulanger fait sa grande braderie pendant la Black Friday Week : les 16 offres qui m&#233;ritent votre argent</title>
      <link>https://www.frandroid.com/bons-plans/2859523_boulanger-fait-son-destockage-durant-la-black-friday-week-les-17-deals-immanquables-du-week-end</link>
      <pubDate>Tue, 25 Nov 2025 13:35:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2859523_boulanger-fait-son-destockage-durant-la-black-friday-week-les-17-deals-immanquables-du-week-end</guid>
      <description>
Avec la Black Friday Week, une nouvelle vague de promotions a d&#233;ferl&#233; chez les grands sites de e-commerce. Pour l'occasion, Boulanger n&#8217;h&#233;site pas &#224; baisser les prix de nombreuses r&#233;f&#233;rences Tech. Voici les offres qui valent le coup. 
</description>
    </item>
    <item>
      <title>Du jamais vu dans l&#8217;histoire de l&#8217;humanit&#233; : une sonde va &#224; entrer dans un territoire que seule notre imagination visitait</title>
      <link>https://www.futura-sciences.com/sciences/actualites/voyager-1-jamais-vu-histoire-humanite-sonde-va-entrer-territoire-seule-notre-imagination-visitait-127916/#xtor%3DRSS-8</link>
      <pubDate>Tue, 25 Nov 2025 14:35:40 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/voyager-1-jamais-vu-histoire-humanite-sonde-va-entrer-territoire-seule-notre-imagination-visitait-127916/#xtor%3DRSS-8</guid>
      <description>Le rendez-vous est fix&#233; en novembre 2026. Voyager 1 aura alors mis presque 50&#160;ans &#224; accomplir ce que la lumi&#232;re peut faire en seulement un jour !&#160;La mission ira-t-elle au-del&#224; ?</description>
    </item>
    <item>
      <title>The Best Samsung Phones of 2025, Tested and Reviewed</title>
      <link>https://www.wired.com/gallery/best-samsung-phones/</link>
      <pubDate>Tue, 25 Nov 2025 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">64dbd481eb3f06fa8140d241</guid>
      <description>From flagship and budget to flipping and folding, Samsung&#8217;s Galaxy range spans the breadth of the smartphone cosmos. WIRED&#8217;s here to help you make your choice.</description>
    </item>
    <item>
      <title>You can save up to 44% on the Echo Spot in Amazon's Black Friday sale &#8211; get your new smart alarm clock while you can</title>
      <link>https://www.techradar.com/seasonal-sales/you-can-save-up-to-44-percent-on-the-echo-spot-in-amazons-black-friday-sale-get-your-new-smart-alarm-clock-while-you-can</link>
      <pubDate>Tue, 25 Nov 2025 13:29:09 +0000</pubDate>
      <guid isPermaLink="false">BZZEyWWkBdnZQhQqzrRuY6</guid>
      <description>Amazon's flagship smart alarm is almost half off this Black Friday, and it's become a fan-favorite.</description>
    </item>
    <item>
      <title>Leaker claims Xbox Series X and Series S consoles could see another price hike due to global RAM shortage</title>
      <link>https://www.techradar.com/gaming/xbox/leaker-claims-xbox-series-x-and-series-s-consoles-could-see-another-price-hike-due-to-global-ram-shortage</link>
      <pubDate>Tue, 25 Nov 2025 13:27:51 +0000</pubDate>
      <guid isPermaLink="false">nfzMawbcimn6qfEaJvC9u5</guid>
      <description>Microsoft will reportedly have to increase the price of Xbox consoles yet again "very soon" due to a potential global RAM shortage.</description>
    </item>
    <item>
      <title>Global stocks rise after Wall Street gets a boost from hopes for interest rate cuts</title>
      <link>https://www.fastcompany.com/91448806/global-stocks-rise-after-wall-street-gets-boost-hopes-interest-rate-cuts</link>
      <pubDate>2025-11-25T13:24:38</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448806/global-stocks-rise-after-wall-street-gets-boost-hopes-interest-rate-cuts</guid>
      <description>The CAC 40 in Paris added 0.1% to 7,965.77 while Britain&#8217;s FTSE 100 gained 0.1%, to 9,542.55.
European and Asian shares mostly gained on Tuesday after U.S. stocks rallied on hopes the Federal Reserve will cut interest rates soon.The futures for the S&amp;P 500 and the Dow Jones Industrial Average slipped 0.1%.Germany&#8217;s DAX edged 0.1% lower to 23,216.76 and the CAC 40 in Paris added 0.1% to 7,965.77. Britain&#8217;s FTSE 100 likewise gained 0.1%, to 9,542.55.In Asian trading, Tokyo&#8217;s Nikkei 225 picked up 0.1% to 48,659.52 as a plunge in technology giant SoftBank&#8217;s shares weighed on the market. It fell 10...</description>
    </item>
    <item>
      <title>Skyscanner Rolls Out a Triple Wave of Travel Deals for Black Friday, Cyber Monday, and Travel Tuesday</title>
      <link>https://gizmodo.com/skyscanner-rolls-out-a-triple-wave-of-travel-deals-for-black-friday-cyber-monday-and-travel-tuesday-2000690001</link>
      <pubDate>Tue, 25 Nov 2025 13:23:38 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000690001</guid>
      <description>Visiting all your favorite destinations this holiday season doesn't have to put a dent in your wallet.</description>
    </item>
    <item>
      <title>Aluminium OS will be Google&#8217;s take on Android for PC</title>
      <link>https://www.theverge.com/news/828595/google-aluminium-os-android-pc-chromeos-ai</link>
      <pubDate>2025-11-25T08:23:20-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=828595</guid>
      <description>We know a little more about Google&#8217;s long-gestating plans to combine the best parts of Android and ChromeOS into a single OS thanks to a job listing for a product manager to work on &#8220;Aluminium OS.&#8221; The job ad describes it as &#8220;a new operating system built with Artificial Intelligence (AI) at the core.&#8221; Android [&#8230;]</description>
    </item>
    <item>
      <title>Chrome sur Android change pour vous aider &#224; retrouver vos sites pr&#233;f&#233;r&#233;s</title>
      <link>https://www.frandroid.com/marques/google/2884503_chrome-sur-android-change-pour-vous-aider-a-retrouver-vos-sites-preferes</link>
      <pubDate>Tue, 25 Nov 2025 13:21:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2884503_chrome-sur-android-change-pour-vous-aider-a-retrouver-vos-sites-preferes</guid>
      <description>
Google va d&#233;ployer sur la version Android de Chrome&#160;une fonction tr&#232;s appr&#233;ci&#233;e sur PC. Le navigateur de Google va permettre &#224; ses utilisateurs de ne jamais perdre de vue leurs sites pr&#233;f&#233;r&#233;s. 
</description>
    </item>
    <item>
      <title>Google stock price is surging today as AI sets it up to become next $4 trillion giant. Here&#8217;s why</title>
      <link>https://www.fastcompany.com/91448795/google-stock-price-today-goog-surges-on-ai-wins-4-trillion-near</link>
      <pubDate>2025-11-25T13:05:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448795/google-stock-price-today-goog-surges-on-ai-wins-4-trillion-near</guid>
      <description>Boosted by rave reviews of Gemini 3 and a rumored chip deal with Meta, Alphabet is performing better than any tech giant in the Magnificent 7.
Shares in Alphabet Inc (Nasdaq: GOOG), the company better known as Google, are rising again in premarket trading today. </description>
    </item>
    <item>
      <title>Apples iPhone Fold is on track, but it might be pricier than we thought</title>
      <link>https://mashable.com/article/apple-iphone-fold</link>
      <pubDate>Tue, 25 Nov 2025 13:03:22 +0000</pubDate>
      <guid isPermaLink="false">00q8O7nv4lDGMIxAgejzeqE</guid>
      <description>New reports on iPhone's upcoming foldable phone say it's progressing well, but the price might be higher than we previously thought.</description>
    </item>
    <item>
      <title>Get $500 off a stunning HP Omen gaming laptop in Best Buy's Black Friday gaming sale</title>
      <link>https://www.techradar.com/computing/gaming-laptops/get-usd500-off-a-stunning-hp-omen-gaming-laptop-in-best-buys-black-friday-gaming-sale</link>
      <pubDate>Tue, 25 Nov 2025 13:02:49 +0000</pubDate>
      <guid isPermaLink="false">yh8JFFCZizdvR4XEkrh56W</guid>
      <description>Best Buy's huge Black Friday sale includes massive discounts of up to $500 on HP gaming laptops and great discounts on HyperX peripherals &#8211; everything a budding gamer needs this November.</description>
    </item>
    <item>
      <title>Watch out - that Amazon page offering amazing Black Friday deals could be a dodgy spoof site, and could leave you seriously out of pocket</title>
      <link>https://www.techradar.com/pro/watch-out-that-amazon-page-offering-amazing-black-friday-deals-could-be-a-dodgy-spoof-site-and-could-leave-you-seriously-out-of-pocket</link>
      <pubDate>Tue, 25 Nov 2025 13:02:00 +0000</pubDate>
      <guid isPermaLink="false">WGLpHBinS7N9NhFnxsVgQX</guid>
      <description>Black Friday phishing attacks rise sharply, targeting unprepared shoppers with fake retailer sites, malicious emails, and rapidly scaled AI-driven scams.</description>
    </item>
    <item>
      <title>Volvo prend une d&#233;cision radicale pour ses voitures &#233;lectriques et la conduite autonome</title>
      <link>https://www.frandroid.com/marques/volvo/2884629_volvo-prend-une-decision-radicale-pour-ses-voitures-electriques-et-la-conduite-autonome</link>
      <pubDate>Tue, 25 Nov 2025 13:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volvo/2884629_volvo-prend-une-decision-radicale-pour-ses-voitures-electriques-et-la-conduite-autonome</guid>
      <description>
La firme su&#233;doise Volvo annonce rompre son contrat avec Luminar, charg&#233; de fournir le capteur LiDAR de ses voitures &#233;lectriques. Une d&#233;cision forte, qui risque de faire du mal &#224; l&#8217;&#233;quipementier, d&#233;j&#224; en mauvaise posture.
</description>
    </item>
    <item>
      <title>Sadie Sink Deflects All Those Wild &#8216;Spider-Man: Brand New Day&#8217; Rumors</title>
      <link>https://gizmodo.com/sadie-sink-spider-man-brand-new-day-rumors-jean-grey-2000691143</link>
      <pubDate>Tue, 25 Nov 2025 13:00:22 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000691143</guid>
      <description>Plus, the 'Odyssey' may feature some massive animatronic creatures.</description>
    </item>
    <item>
      <title>9 Best Speakers for Kids (2025): Smart, Bluetooth, and Offline Speakers</title>
      <link>https://www.wired.com/gallery/best-kids-speakers/</link>
      <pubDate>Tue, 25 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">61b89f715d74af6a6a505e1b</guid>
      <description>Play music, audiobooks, and more for your children with one of these WIRED-tested gadgets.</description>
    </item>
    <item>
      <title>Car influencers love Chinese EVs &#8212; and China loves them back</title>
      <link>https://www.theverge.com/transportation/828155/car-influencer-china-ev-youtube-influencer-pay-play</link>
      <pubDate>2025-11-25T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=828155</guid>
      <description>The first Chinese-made car Omar Rana ever drove was a gas-powered SUV that he rented while on a trip overseas in 2015. To say it didn't leave much of an impression would be an understatement. "It sucked really bad," Rana, aka OmarDrives, tells me. "A horrible experience." Flash forward nearly a decade to last year, [&#8230;]</description>
    </item>
    <item>
      <title>Heres the only Stranger Things recap you need to prepare for Season 5</title>
      <link>https://mashable.com/video/stranger-things-recap-to-prepare-for-season-5</link>
      <pubDate>Tue, 25 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">00CTH2ngEjrIXWFHc5jek7z</guid>
      <description>Need to prepare for "Stranger Things" Season 5 but don't have time for a rewatch? Our one-minute recap is all you'll need.</description>
    </item>
    <item>
      <title>Dreame's stair-climbing, pet hair-sucking and floor-mopping robot vacuum just saw a major Black Friday discount</title>
      <link>https://www.techradar.com/seasonal-sales/dreames-stair-climbing-pet-hair-sucking-and-floor-mopping-robot-vacuum-just-saw-a-major-black-friday-discount</link>
      <pubDate>Tue, 25 Nov 2025 12:58:20 +0000</pubDate>
      <guid isPermaLink="false">Mp5gtUACoxn8F4AGVPaGZ</guid>
      <description>This stair-climbing, mopping and pet hair-busting robot vacuum should go straight in your shopping basket.</description>
    </item>
    <item>
      <title>Black Friday 2025: Live updates on the latest deals from Amazon, Target, Walmart, and more</title>
      <link>https://mashable.com/live/black-friday-live-deals-2025</link>
      <pubDate>Tue, 25 Nov 2025 12:58:06 +0000</pubDate>
      <guid isPermaLink="false">03tp2JNOQKRcB69tUBVVrSJ</guid>
      <description>Get live updates on Black Friday sales. We found savings of $150 on Dyson Supersonic hair dryers and $300 on Samsung TVs.</description>
    </item>
    <item>
      <title>16+ unmissable Black Friday floorcare deals from Shark, Tineco, and more</title>
      <link>https://www.techradar.com/home/small-appliances/black-friday-floorcare-deals-2025-from-shark-tineco-and-more</link>
      <pubDate>Tue, 25 Nov 2025 12:57:55 +0000</pubDate>
      <guid isPermaLink="false">FDcDGsNyvPrgD4aQDCatgg</guid>
      <description>Clean up in the Black Friday sales with up to 50% off wet-dry vacuums, spot cleaners, and steam mops from leading brands.</description>
    </item>
    <item>
      <title>85 Black Friday deals: We found record-low prices on AirPods, MacBooks, TCL TVs, Kindles, and Ninja</title>
      <link>https://mashable.com/article/best-early-black-friday-deals-macbooks-airpods-kindles-ninja-2025</link>
      <pubDate>Tue, 25 Nov 2025 12:56:45 +0000</pubDate>
      <guid isPermaLink="false">04ohZNnyLyLTHLkre7fGfm7</guid>
      <description>Get the latest Black Friday deals on Apple products, vacuums, headphones, power stations, and Legos. Save $250 on a new Apple laptop and 27% on a new Kindle.</description>
    </item>
    <item>
      <title>I've tested more than a hundred laptops and this is the Black Friday deal I'd recommend: a huge $420 discount on the HP Omnibook X Flip</title>
      <link>https://www.techradar.com/computing/laptops/ive-tested-more-than-a-hundred-laptops-and-this-is-the-black-friday-deal-id-recommend-a-huge-usd420-discount-on-the-hp-omnibook-x-flip</link>
      <pubDate>Tue, 25 Nov 2025 12:54:51 +0000</pubDate>
      <guid isPermaLink="false">w8mpJY8yojvqa7ZWhQNZ79</guid>
      <description>Save almost half off the HP Omnibook X Flip &#8211; this is a Black Friday laptop deal you won't want to miss.</description>
    </item>
    <item>
      <title>Sort out your streaming with the best Black Friday deals on Amazon Fire TV Sticks</title>
      <link>https://mashable.com/article/best-black-friday-fire-tv-stick-deals-live-2025</link>
      <pubDate>Tue, 25 Nov 2025 12:54:49 +0000</pubDate>
      <guid isPermaLink="false">05qC98y19CK3BvLnSoYDXhc</guid>
      <description>The Black Friday deals live now include discounts of the Amazon Fire TV Stick range. Save on the Fire TV Stick 4K Max, Fire TV Stick 4K Plus, and more.</description>
    </item>
    <item>
      <title>The YouTube Music Recap for 2025 is rolling out now with new AI tricks &#8211; here's how to get it</title>
      <link>https://www.techradar.com/audio/audio-streaming/the-youtube-music-recap-for-2025-is-rolling-out-now-with-new-ai-tricks-heres-how-to-get-it</link>
      <pubDate>Tue, 25 Nov 2025 12:54:34 +0000</pubDate>
      <guid isPermaLink="false">J5yJrCGdDwCL7rL6eQXnUi</guid>
      <description>If you're a YouTube Music user, you can now look up your most listened to tracks and artists.</description>
    </item>
    <item>
      <title>La Black Friday Week des smartphones premium : de beaux prix cass&#233;s sur les t&#233;l&#233;phones d&#8217;Apple, Samsung, Google, Nothing&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2848295_black-friday-week-sur-les-smartphones-voici-les-meilleures-promotions-pour-les-iphone-17-google-pixel-10-et-galaxy-s25</link>
      <pubDate>Tue, 25 Nov 2025 12:50:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848295_black-friday-week-sur-les-smartphones-voici-les-meilleures-promotions-pour-les-iphone-17-google-pixel-10-et-galaxy-s25</guid>
      <description>
La Black Friday Week bat son plein ! Les &#233;tals des e-commer&#231;ants ne d&#233;semplissent pas de r&#233;ductions en tout genre. Nous avons rassembl&#233; ici les meilleures offres disponibles pour les smartphones haut de gamme test&#233;s par Frandroid.
</description>
    </item>
    <item>
      <title>The best gaming PC in 2025: my top picks for all budgets and games</title>
      <link>https://www.techradar.com/computing/gaming-pcs/best-gaming-pc</link>
      <pubDate>Tue, 25 Nov 2025 12:46:58 +0000</pubDate>
      <guid isPermaLink="false">GJXeijTHxFB7rkVFcVrkqf</guid>
      <description>Looking to upgrade? I've carefully selected the best gaming PCs in 2025 based on budget, performance,  design, and configurability.</description>
    </item>
  </channel>
</rss>
