<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 29 Dec 2025 15:28:02 GMT</lastBuildDate>
    <item>
      <title>Le jeu illimit&#233; sur GeForce Now, c&#8217;est termin&#233; : Nvidia impose un plafond &#224; tout le monde&#8230; ou presque</title>
      <link>https://www.frandroid.com/marques/nvidia/2922349_le-jeu-illimite-sur-geforce-now-cest-termine-nvidia-impose-un-plafond-a-tout-le-monde-ou-presque</link>
      <pubDate>Mon, 29 Dec 2025 15:26:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2922349_le-jeu-illimite-sur-geforce-now-cest-termine-nvidia-impose-un-plafond-a-tout-le-monde-ou-presque</guid>
      <description>
Nvidia met en place ce que la firme annon&#231;ait l'an dernier : une limite de temps de jeu mensuel via son service de cloud gaming GeForce Now. Tout le monde est concern&#233;, sauf certains abonn&#233;s.
</description>
    </item>
    <item>
      <title>&#8216;The X-Files&#8217; Is Ready to Be Your Free Streaming Binge for the New Year</title>
      <link>https://gizmodo.com/x-files-streaming-free-pluto-tv-2000703924</link>
      <pubDate>Mon, 29 Dec 2025 15:15:33 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703924</guid>
      <description>Every episode from the classic run and the 2016 revival is coming to Pluto TV on January 1.</description>
    </item>
    <item>
      <title>Google Photos s&#8217;invite sur les t&#233;l&#233;viseurs de Samsung, mais snobe toujours Google TV</title>
      <link>https://www.01net.com/actualites/google-photos-sinvite-sur-les-televiseurs-de-samsung-mais-snobe-toujours-google-tv.html</link>
      <pubDate>Mon, 29 Dec 2025 15:03:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317509</guid>
      <description>Absent de mani&#232;re assez paradoxale sur Google TV, Google Photos s&#8217;invite enfin sur les &#233;crans du salon&#8230; mais par une porte d&#233;rob&#233;e. Samsung annonce l&#8217;arriv&#233;e progressive de fonctions issues du service de stockage et de partage de photos de Google sur ses t&#233;l&#233;viseurs connect&#233;s, avec des diaporamas intelligents et des th&#232;mes g&#233;n&#233;r&#233;s par IA d&#232;s 2026 &#8212; sans pour autant proposer, pour l&#8217;instant, l&#8217;application compl&#232;te....</description>
    </item>
    <item>
      <title>The 32 top enterprise tech startups from Disrupt Startup Battlefield</title>
      <link>https://techcrunch.com/2025/12/29/the-32-top-enterprise-tech-startups-from-disrupt-startup-battlefield/</link>
      <pubDate>Mon, 29 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3076776</guid>
      <description>Here is the full list of the enterprise tech Startup Battlefield 200 selectees, along with a note on what made us select them for the competition.</description>
    </item>
    <item>
      <title>I asked ChatGPT for my New Year's resolutions, and now I feel almost too seen</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/i-asked-chatgpt-for-my-new-years-resolutions-and-now-i-feel-almost-too-seen</link>
      <pubDate>Mon, 29 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">Aziwpmdsco6nEFbsjiPDh9</guid>
      <description>ChatGPT proves surprisingly adept at coming up with meaningful New Year's resolutions &#8212; use this prompt to get yours</description>
    </item>
    <item>
      <title>How to keep your kids safe in this AI-powered world</title>
      <link>https://www.techradar.com/ai-platforms-assistants/how-you-can-keep-your-kids-safe-in-this-ai-powered-world</link>
      <pubDate>Mon, 29 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">LKPKtkmCdGGc96p24A4YqB</guid>
      <description>AI is suddenly everywhere in children&#8217;s lives. In their games, homework and chats. Here&#8217;s how parents can move past fear and feel confident about keeping them safe.</description>
    </item>
    <item>
      <title>Polarsteps is the free app that tracks your travels &#8212; and it just made my New Year&#8217;s resolutions list</title>
      <link>https://www.techradar.com/phones/polarsteps-is-the-free-app-that-tracks-your-travels-and-it-just-made-my-new-years-resolutions-list</link>
      <pubDate>Mon, 29 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">HVPoyoifEGE3Ppumq83Lef</guid>
      <description>Polarsteps is a completely free app that allows you to track and share your travels and journeys, and it even offers a Spotify Wrapped-style recap.</description>
    </item>
    <item>
      <title>I didn&#8217;t quit social media in 2025, but I might have to if this awful trend continues in 2026</title>
      <link>https://www.techradar.com/phones/i-didnt-quit-social-media-in-2025-but-i-might-have-to-if-this-awful-trend-continues-in-2026</link>
      <pubDate>Mon, 29 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">wvvwf9TTUtTCkq34aYCPhN</guid>
      <description>Instagram is becoming a dumping ground for AI slop, and it now seems to be coming from Meta itself.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Tuesday, December 30 (game #933)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-30-december-2025</link>
      <pubDate>Mon, 29 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">Fpih5ggyCwuiRaX6fKz94T</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Tuesday, December 30 (game #1436)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-30-december-2025</link>
      <pubDate>Mon, 29 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">WsbbjFxpBJdF4uLEVVQQNL</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Tuesday, December 30 (game #667)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-30-december-2025</link>
      <pubDate>Mon, 29 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">ewBxnXP328VaM7arEUyxJQ</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>This experimental camera can focus on everything at once</title>
      <link>https://www.theverge.com/news/850689/camera-focal-lens-technology-research</link>
      <pubDate>2025-12-29T09:50:20-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=850689</guid>
      <description>A camera lens, historically, can only focus on one thing at a time, just like the human eye. That could be a thing of the past, though, thanks to a breakthrough lens technology developed by researchers at Carnegie Mellon University (CMU) that can bring every part of a scene into sharp focus, capturing finer details [&#8230;]</description>
    </item>
    <item>
      <title>P&#233;nurie de RAM : on sait pourquoi les cartes graphiques n&#8217;ont pas (encore) augment&#233; de prix</title>
      <link>https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2922177_penurie-de-ram-on-sait-pourquoi-les-cartes-graphiques-nont-pas-encore-augmente-de-prix</link>
      <pubDate>Mon, 29 Dec 2025 14:43:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2922177_penurie-de-ram-on-sait-pourquoi-les-cartes-graphiques-nont-pas-encore-augmente-de-prix</guid>
      <description>
Les cartes graphiques ont &#233;t&#233; jusqu'&#224; maintenant relativement prot&#233;g&#233;es de la p&#233;nurie de DRAM qui touche tout le march&#233; de l'informatique. Mais des hausses de prix seraient &#224; pr&#233;voir d&#232;s le mois prochain.
</description>
    </item>
    <item>
      <title>&#171; Impossible de dire si c&#8217;est un humain &#187; : un expert de Nvidia bluff&#233; apr&#232;s avoir test&#233; la conduite autonome de Tesla</title>
      <link>https://www.frandroid.com/marques/tesla/2921945_impossible-de-dire-si-cest-un-humain-un-expert-de-nvidia-bluffe-apres-avoir-teste-la-conduite-autonome-de-tesla</link>
      <pubDate>Mon, 29 Dec 2025 14:39:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2921945_impossible-de-dire-si-cest-un-humain-un-expert-de-nvidia-bluffe-apres-avoir-teste-la-conduite-autonome-de-tesla</guid>
      <description>
Sp&#233;cialiste de la robotique, un cadre de&#160;Nvidia a tester la derni&#232;re version de la conduite autonome de Tesla. Et on peut dire que l&#8217;exp&#233;rience a &#233;t&#233; particuli&#232;rement concluante pour cet expert, qui ne cache pas son admiration.
</description>
    </item>
    <item>
      <title>Quels sont les meilleurs smartphones en d&#233;cembre 2025&#160;?</title>
      <link>https://www.frandroid.com/guide-dachat/smartphones/332196_10-smartphones-attendus-debut-2016</link>
      <pubDate>Mon, 29 Dec 2025 14:30:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/smartphones/332196_10-smartphones-attendus-debut-2016</guid>
      <description>
Vous h&#233;sitez sur votre prochain smartphone &#224; acheter ? Bienvenue sur notre guide r&#233;unissant les mod&#232;les les plus performants du moment, tous soigneusement test&#233;s par notre &#233;quipe. Cette s&#233;lection met en avant les meilleurs t&#233;l&#233;phones selon leurs points forts : qualit&#233; photo, puissance ou autonomie pour des prix diff&#233;rents.
</description>
    </item>
    <item>
      <title>Rien de plus pratique que cet &#233;cran portable Full HD de 15,6&#8243; en promo &#224; -25 % facile &#224; transporter</title>
      <link>https://www.frandroid.com/bons-plans/2922271_rien-de-plus-pratique-que-cet-ecran-portable-full-hd-de-156-en-promo-a-25-facile-a-transporter</link>
      <pubDate>Mon, 29 Dec 2025 14:19:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2922271_rien-de-plus-pratique-que-cet-ecran-portable-full-hd-de-156-en-promo-a-25-facile-a-transporter</guid>
      <description>
Le mod&#232;le M156F04 de la marque UFYQL est un &#233;cran portable de 15,6 pouces qui peut se brancher &#224; n'importe quel appareil pour diffuser un flux Full HD. Il est &#224; retrouver &#224; 59,99 euros au lieu de 79,99 euros.
</description>
    </item>
    <item>
      <title>Life on Europa Could Feed On This Unexpected Source of Energy</title>
      <link>https://gizmodo.com/life-on-europa-could-feed-on-this-unexpected-source-of-energy-2000703619</link>
      <pubDate>Mon, 29 Dec 2025 14:15:31 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703619</guid>
      <description>Jupiter's icy Moon is one of the most promising places to search for life in the solar system.</description>
    </item>
    <item>
      <title>Ces Pixel abandonn&#233;s par Google passent &#224; Android 16 gr&#226;ce &#224; LineageOS</title>
      <link>https://www.frandroid.com/marques/google/2922323_ces-pixel-abandonnes-par-google-passent-a-android-16-grace-a-lineageos</link>
      <pubDate>Mon, 29 Dec 2025 14:12:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2922323_ces-pixel-abandonnes-par-google-passent-a-android-16-grace-a-lineageos</guid>
      <description>
La derni&#232;re version de la ROM alternative LineageOS, bas&#233;e sur Android 16, redonne une seconde jeunesse &#224; de vieux mod&#232;les de Pixel jusque l&#224; non compatibles.
</description>
    </item>
    <item>
      <title>Comment Samsung pourrait s&#8217;inspirer d&#8217;Apple pour la puce Exynos de ses Galaxy S28</title>
      <link>https://www.frandroid.com/marques/samsung/2921971_comment-samsung-pourrait-sinspirer-dapple-pour-la-puce-exynos-de-ses-galaxy-s28</link>
      <pubDate>Mon, 29 Dec 2025 14:12:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2921971_comment-samsung-pourrait-sinspirer-dapple-pour-la-puce-exynos-de-ses-galaxy-s28</guid>
      <description>
De nouvelles informations laissent &#224; penser qu'&#224; la mani&#232;re d'Apple, Samsung pourrait d'ici deux ans accoucher d'un processeur Exynos &#233;quip&#233; d'un tandem CPU / GPU con&#231;u en interne... d&#233;laissant ainsi le partenariat (graphique) entretenu depuis plusieurs ann&#233;es avec AMD.
</description>
    </item>
    <item>
      <title>Downtime caused historic issues in 2025 - but who lost out most?</title>
      <link>https://www.techradar.com/pro/security/downtime-caused-historic-issues-in-2025-but-who-lost-out-most</link>
      <pubDate>Mon, 29 Dec 2025 14:10:00 +0000</pubDate>
      <guid isPermaLink="false">gy5T2kang7ESxEFDXpjFjh</guid>
      <description>For many, 2025 will be remembered by outages and lost revenue opportunities.</description>
    </item>
    <item>
      <title>Samsung plans to bring Google Photos to its TVs in 2026</title>
      <link>https://techcrunch.com/2025/12/29/samsung-plans-to-bring-google-photos-to-its-tvs-in-2026/</link>
      <pubDate>Mon, 29 Dec 2025 14:06:23 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3079158</guid>
      <description>Samsung said that Memories features for Google Photos will be exclusive to its TVs for six months</description>
    </item>
    <item>
      <title>Tech resolutions</title>
      <link>https://www.techradar.com/tag/techresolutions</link>
      <pubDate>Mon, 29 Dec 2025 14:05:34 +0000</pubDate>
      <guid isPermaLink="false">haQWu49jYAwC4A3RbufPPN</guid>
      <description>TechRadar's guide to starting 2026 in the best possible way</description>
    </item>
    <item>
      <title>Volkswagen et Xpeng s&#8217;unissent : voici l&#8217;ID. Unyx 07, la voiture &#233;lectrique allemande made in China</title>
      <link>https://www.frandroid.com/marques/volkswagen/2921831_volkswagen-et-xpeng-sunissent-voici-lid-unyx-07-la-voiture-electrique-allemande-made-in-china</link>
      <pubDate>Mon, 29 Dec 2025 14:03:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2921831_volkswagen-et-xpeng-sunissent-voici-lid-unyx-07-la-voiture-electrique-allemande-made-in-china</guid>
      <description>
D&#233;velopp&#233;e par Volkswagen en partenariat avec Xpeng, la nouvelle ID. Unyx 07 nous donne de nouvelles informations &#224; son sujet. La voiture &#233;lectrique revendique 231 chevaux et une autonomie de 558 kilom&#232;tres.
</description>
    </item>
    <item>
      <title>Un piratage du jeu Rainbow Six Siege fait perdre des millions de dollars &#224; Ubisoft</title>
      <link>https://www.01net.com/actualites/un-piratage-du-jeu-rainbow-six-siege-fait-perdre-des-millions-de-dollars-a-ubisoft.html</link>
      <pubDate>Mon, 29 Dec 2025 14:02:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317497</guid>
      <description>Ubisoft a essuy&#233; ce week-end une importante br&#232;che de s&#233;curit&#233; sur un de ses jeux en ligne vedette, Rainbow Six Siege. Les pirates ont pu s'infiltrer dans les serveurs internes et faire n'importe quoi, y compris distribuer des milliards de cr&#233;dits aux joueurs. L'&#233;diteur a d&#251; fermer les serveurs pendant quelques heures, avant de les rouvrir prudemment....</description>
    </item>
    <item>
      <title>Could Jordan Peele Be Heading to the MCU?</title>
      <link>https://gizmodo.com/jordan-peele-marvel-mcu-blade-midnight-sons-2000703415</link>
      <pubDate>Mon, 29 Dec 2025 14:00:35 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703415</guid>
      <description>Plus, James Cameron is hoping to make some progress on a new remake of 'Fantastic Voyage' in 2026.</description>
    </item>
    <item>
      <title>VCs predict strong enterprise AI adoption next year &#8212; again</title>
      <link>https://techcrunch.com/2025/12/29/vcs-predict-strong-enterprise-ai-adoption-next-year-again/</link>
      <pubDate>Mon, 29 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078782</guid>
      <description>More than 20 venture capitalists share their thoughts on AI agents, enterprise AI budgets and more for 2026.</description>
    </item>
    <item>
      <title>Everything we expect from Xbox in 2026, including Halo on PlayStation and the return of Fable</title>
      <link>https://www.techradar.com/gaming/xbox-predictions-2026</link>
      <pubDate>Mon, 29 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">Pd5Hxc2djrHDSzLFqVLhbT</guid>
      <description>Xbox&#8217;s 2026 is likely to be a major year, if not for the current generation, then for the next. Here are our predictions for what Microsoft's gaming arm will be up to next year.</description>
    </item>
    <item>
      <title>What is the release date for Fallout season 2 episode 3 on Prime Video?</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/what-is-the-release-date-for-fallout-season-2-episode-3-on-prime-video</link>
      <pubDate>Mon, 29 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">9A96TJYhqYVSFJKV2558Xk</guid>
      <description>It's almost time to ring in the New Year with Fallout season 2's next episode.</description>
    </item>
    <item>
      <title>The best shows to watch on HBO Max from 2025</title>
      <link>https://www.theverge.com/entertainment/846829/hbo-max-best-shows-2025</link>
      <pubDate>2025-12-29T08:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=846829</guid>
      <description>With all the drama surrounding Warner Bros. Discovery's plans to sell itself to another company, it's not currently clear how much longer HBO Max will continue to exist in its current form. But for the time being, the streamer is chock full of solid series you might want to consider watching if you find yourself [&#8230;]</description>
    </item>
    <item>
      <title>Ouvrir sa Tesla avec un iPhone sans batterie : cela serait pour bient&#244;t</title>
      <link>https://www.frandroid.com/marques/tesla/2922291_ouvrir-sa-tesla-avec-un-iphone-sans-batterie-cela-serait-pour-bientot</link>
      <pubDate>Mon, 29 Dec 2025 13:28:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2922291_ouvrir-sa-tesla-avec-un-iphone-sans-batterie-cela-serait-pour-bientot</guid>
      <description>
Pendant que Rivian d&#233;ploie le support officiel d'Apple Car Key, Tesla faisait de la r&#233;sistance avec son syst&#232;me propri&#233;taire. Le code de l'application mobile vend la m&#232;che : le support arrive. Et c'est une excellente nouvelle pour votre iPhone.
</description>
    </item>
  </channel>
</rss>
