<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 23 Dec 2025 09:30:02 GMT</lastBuildDate>
    <item>
      <title>&#171; L&#8217;ill&#233;gal qui devient payant ET compliqu&#233; &#187; : YGG provoque un scandale dans le milieu du piratage fran&#231;ais</title>
      <link>https://www.frandroid.com/culture-tech/web/2918897_lillegal-qui-devient-payant-et-complique-ygg-provoque-un-scandale-dans-le-milieu-du-piratage-francais</link>
      <pubDate>Tue, 23 Dec 2025 09:20:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/web/2918897_lillegal-qui-devient-payant-et-complique-ygg-provoque-un-scandale-dans-le-milieu-du-piratage-francais</guid>
      <description>
L'arriv&#233;e d'un mode Turbo modifiant le fonctionnement du site de piratage YGG Torrent provoque un scandale. Une partie des utilisateurs pr&#233;pare l'exode.
</description>
    </item>
    <item>
      <title>Voici les prix fran&#231;ais du Kia EV5 : pourquoi cette voiture &#233;lectrique rivale du Peugeot 3008 part avec un handicap</title>
      <link>https://www.frandroid.com/marques/kia/2918889_voici-les-prix-francais-du-kia-ev5-pourquoi-cette-voiture-electrique-rivale-du-peugeot-3008-part-avec-un-handicap</link>
      <pubDate>Tue, 23 Dec 2025 09:17:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/kia/2918889_voici-les-prix-francais-du-kia-ev5-pourquoi-cette-voiture-electrique-rivale-du-peugeot-3008-part-avec-un-handicap</guid>
      <description>
Lanc&#233;e en 2024 en Chine, la nouvelle Kia EV5 d&#233;barque enfin sur les routes europ&#233;ennes. La voiture &#233;lectrique cor&#233;enne d&#233;marre &#224; moins de 45 000 euros dans sa version d&#8217;entr&#233;e de gamme avec une autonomie d&#233;cente, mais n'est pas &#233;ligible au bonus &#233;cologique.
</description>
    </item>
    <item>
      <title>Voici le laptop gaming sous RTX 5060 le moins cher de No&#235;l</title>
      <link>https://www.frandroid.com/bons-plans/2768285_voici-le-laptop-gaming-sous-rtx-5060-le-moins-cher-de-noel</link>
      <pubDate>Tue, 23 Dec 2025 09:16:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2768285_voici-le-laptop-gaming-sous-rtx-5060-le-moins-cher-de-noel</guid>
      <description>
Puce Intel Core i7 de 13e g&#233;n&#233;ration, carte graphique RTX 5060, grande dalle rafra&#238;chie &#224; 165 Hz... Il ne manque quasiment rien au Gigabyte Gaming A16, pas m&#234;me un prix avantageux : chez PC Componentes, on le trouve &#224; 859 euros au lieu de 1 199,90 euros.
</description>
    </item>
    <item>
      <title>Pourquoi le prix des iPhone, iPad et Mac risque d&#8217;augmenter fortement en 2026</title>
      <link>https://www.frandroid.com/marques/apple/2918871_pourquoi-le-prix-des-iphone-ipad-et-mac-risque-daugmenter-fortement-en-2026</link>
      <pubDate>Tue, 23 Dec 2025 09:15:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2918871_pourquoi-le-prix-des-iphone-ipad-et-mac-risque-daugmenter-fortement-en-2026</guid>
      <description>
La p&#233;nurie de m&#233;moire vive n'&#233;pargnera pas Apple en 2026. On apprend que l'accord qui lie Samsung et SK Hynix au g&#233;ant de Cupertino prend fin en janvier. Cela risque fort de conduire ces deux acteurs &#224; revoir leurs prix &#224; la hausse... avec un potentiel impact sur le tarif des iPhone, iPad et autres Mac dans les prochains mois.
</description>
    </item>
    <item>
      <title>Cyberattaque La Poste&#160;: c&#8217;est quoi l&#8217;attaque par &#171;&#160;d&#233;ni de service&#160;&#187; qui bloque encore Colissimo&#160;?</title>
      <link>https://www.01net.com/actualites/cyberattaque-la-poste-cest-quoi-lattaque-par-deni-de-service-qui-bloque-encore-colissimo.html</link>
      <pubDate>Tue, 23 Dec 2025 09:03:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316762</guid>
      <description>L'acc&#232;s aux comptes bancaires revient progressivement ce mardi matin, mais le site de Colissimo reste inaccessible. Le groupe La Poste a confirm&#233; subir une attaque par &#171; d&#233;ni de service &#187; (DDoS). Derri&#232;re ce terme technique se cache une strat&#233;gie d'&#233;touffement num&#233;rique qui explique pourquoi le retour &#224; la normale se fait en ordre dispers&#233;.</description>
    </item>
    <item>
      <title>Les v&#233;los &#233;lectriques boost&#233;s par les moteurs Brose vont avoir droit &#224; leur petite r&#233;volution</title>
      <link>https://www.frandroid.com/marques/brose/2918979_les-velos-electriques-boostes-par-les-moteurs-brose-vont-avoir-droit-a-leur-petite-revolution</link>
      <pubDate>Tue, 23 Dec 2025 09:02:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/brose/2918979_les-velos-electriques-boostes-par-les-moteurs-brose-vont-avoir-droit-a-leur-petite-revolution</guid>
      <description>
L&#8217;application Brose d&#233;di&#233;e aux v&#233;los &#233;lectriques va bient&#244;t changer de nom pour devenir QORE, dans un contexte marqu&#233; par le rachat de la division moteurs &#233;lectriques de Brose par Yamaha Motor. Cette &#233;volution s&#8217;accompagne de nouvelles fonctionnalit&#233;s logicielles importantes.
</description>
    </item>
    <item>
      <title>Quel smartphone photo acheter en 2025 ? Notre guide complet</title>
      <link>https://www.frandroid.com/guide-dachat/smartphones/367607_meilleurs-smartphones-photos</link>
      <pubDate>Tue, 23 Dec 2025 09:00:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/smartphones/367607_meilleurs-smartphones-photos</guid>
      <description>
L'appareil photo est souvent un point majeur lorsqu&#8217;il s&#8217;agit de choisir un nouveau t&#233;l&#233;phone. Lors de nos tests, c'est un domaine que nous scrutons pr&#233;cis&#233;ment. Voici notre s&#233;lection des meilleurs smartphones photo du march&#233;.
</description>
    </item>
    <item>
      <title>3 canceled Netflix shows in 2025 that are still worth watching</title>
      <link>https://www.techradar.com/streaming/netflix/3-canceled-netflix-shows-in-2025-that-are-still-worth-watching</link>
      <pubDate>Tue, 23 Dec 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">ge8SKHjQxZVX86QN8JBGY5</guid>
      <description>From crime comedies to spy thrillers via the latest from the creator of Dawson's Creek, here are three canceled Netflix shows from 2025 that are still worth checking out.</description>
    </item>
    <item>
      <title>5 mindsets about running that help you move forward in life</title>
      <link>https://www.fastcompany.com/91452455/running-mindsets-move-forward-in-life</link>
      <pubDate>2025-12-23T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91452455/running-mindsets-move-forward-in-life</guid>
      <description>You have to push yourself if you want to get better, but the most important part is learning to run every day.
Below, Nicholas Thompson shares five key insights from his new book, The Running Ground: A Father, a Son, and the Simplest of Sports.</description>
    </item>
    <item>
      <title>Here&#8217;s how to protect your privacy when using AI assistants</title>
      <link>https://www.fastcompany.com/91453915/heres-how-to-protect-your-privacy-when-using-ai-assistants</link>
      <pubDate>2025-12-23T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91453915/heres-how-to-protect-your-privacy-when-using-ai-assistants</guid>
      <description>Do you share your innermost thoughts with ChatGPT? You might want to think twice&#8212;or at least change your settings fast.&#160;&#160;
Do you share your innermost thoughts with ChatGPT? You might want to think twice&#8212;or at least change your settings fast.&#160;&#160;</description>
    </item>
    <item>
      <title>La Banque Postale en panne : la banque en ligne et les services de La Poste toujours inaccessibles au lendemain de la cyberattaque</title>
      <link>https://www.frandroid.com/services/banque-en-ligne/2917771_la-banque-postale-est-en-panne-cest-confirme-une-cyberattaque-touche-tous-les-services-de-la-poste</link>
      <pubDate>Tue, 23 Dec 2025 08:50:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/banque-en-ligne/2917771_la-banque-postale-est-en-panne-cest-confirme-une-cyberattaque-touche-tous-les-services-de-la-poste</guid>
      <description>
La cyberattaque qui touche plusieurs services de La Poste (La Banque Postale, Colissimo, Digiposte) est toujours en cours ce matin du mardi 23 d&#233;cembre, plus de 24 heures apr&#232;s les premiers signalements. Mais un retour &#224; la normale pourrait bient&#244;t survenir.
</description>
    </item>
    <item>
      <title>1000 km d&#8217;autonomie, g&#233;n&#233;rateur d&#8217;oxyg&#232;ne, r&#233;frig&#233;rateur et si&#232;ges z&#233;ro-gravit&#233; : la nouvelle voiture &#233;lectrique de Leapmotor en fait des caisses</title>
      <link>https://www.frandroid.com/marques/leapmotor/2918857_1000-km-dautonomie-generateur-doxygene-refrigerateur-et-sieges-zero-gravite-la-nouvelle-voiture-electrique-de-leapmotor-en-fait-des-caisses</link>
      <pubDate>Tue, 23 Dec 2025 08:48:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/leapmotor/2918857_1000-km-dautonomie-generateur-doxygene-refrigerateur-et-sieges-zero-gravite-la-nouvelle-voiture-electrique-de-leapmotor-en-fait-des-caisses</guid>
      <description>
Quelques semaines apr&#232;s sa r&#233;v&#233;lation officielle, le nouveau Leapmotor D19 montre d&#233;sormais son poste de conduite. La voiture &#233;lectrique &#224; prolongateur d&#8217;autonomie s&#8217;offre tout le confort n&#233;cessaire, et de nombreux &#233;crans.
</description>
    </item>
    <item>
      <title>Nissan annonce avoir subi une fuite de donn&#233;es</title>
      <link>https://www.01net.com/actualites/nissan-annonce-avoir-subi-fuite-donnees.html</link>
      <pubDate>Tue, 23 Dec 2025 08:46:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316756</guid>
      <description>Nissan reconna&#238;t une nouvelle fuite de donn&#233;es. Les informations de 21 000 clients ont &#233;t&#233; compromises durant le hack d'un prestataire, &#224; savoir Red Hat. La marque japonaise promet de muscler la surveillance de ses sous-traitants.</description>
    </item>
    <item>
      <title>Google Pixel Buds 2a : un son chaleureux, des limites pratiques</title>
      <link>https://www.frandroid.com/marques/google/2911021_google-pixel-buds-2a-un-son-chaleureux-des-limites-pratiques</link>
      <pubDate>Tue, 23 Dec 2025 08:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2911021_google-pixel-buds-2a-un-son-chaleureux-des-limites-pratiques</guid>
      <description>
Cinquante euros. C'est l'&#233;cart de prix entre les anciens Pixel Buds A et ces nouveaux Pixel Buds 2a affich&#233;s &#224; 149 euros. Une augmentation de 50 % qui pose question dans un march&#233; ultra-concurrentiel. Les Pixel Buds A-Series s&#233;duisaient gr&#226;ce &#224; leur tarif agressif et leurs bonnes prestations. La question se pose donc : que justifie une telle hausse de prix ?
...</description>
    </item>
    <item>
      <title>&#201;cran OLED, Snapdragon 8 Elite Gen 5, charge 80 W : le r&#233;cent Nubia Z80 Ultra est 15 % moins cher juste avant No&#235;l</title>
      <link>https://www.frandroid.com/bons-plans/2918439_ecran-oled-snapdragon-8-elite-gen-5-charge-80-w-le-recent-nubia-z80-ultra-est-15-moins-cher-juste-avant-noel</link>
      <pubDate>Tue, 23 Dec 2025 08:10:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2918439_ecran-oled-snapdragon-8-elite-gen-5-charge-80-w-le-recent-nubia-z80-ultra-est-15-moins-cher-juste-avant-noel</guid>
      <description>
Rempla&#231;ant du Nubia Z70 Ultra, le Nubia Z80 Ultra vient d'&#234;tre lanc&#233; en 2025 par la marque chinoise, avec une fiche technique des plus prometteuses. Actuellement, vous trouverez ce smartphone &#224; 679 euros au lieu de 799 euros chez Joybuy.
</description>
    </item>
    <item>
      <title>Les cadeaux pr&#233;f&#233;r&#233;s de la r&#233;daction&#160;: on offre quoi &#224; un journaliste tech&#160;?</title>
      <link>https://www.01net.com/actualites/les-cadeaux-preferes-de-la-redaction-on-offre-quoi-a-un-journaliste-tech.html</link>
      <pubDate>Tue, 23 Dec 2025 08:01:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315154</guid>
      <description>&#192; quelques heures du 25 d&#233;cembre, l&#8217;&#233;quipe de 01net vous propose de d&#233;couvrir le cadeau tech que ses journalistes souhaiteraient recevoir ou offrir &#224; No&#235;l. Il y en a pour tous les go&#251;ts et pour tous les prix.</description>
    </item>
    <item>
      <title>The best Nintendo Switch 2 accessories for 2026</title>
      <link>https://www.engadget.com/gaming/nintendo/best-nintendo-switch-2-accessories-070011952.html?src=rss</link>
      <pubDate>Tue, 23 Dec 2025 08:00:36 +0000</pubDate>
      <guid isPermaLink="false">89ee5c5b-3997-4385-8587-5539ca627d35</guid>
      <description>Whether you just got a Switch 2 or you've had yours for a while, you may want to grab some key accessories to make it fit your gaming style even more than it already does. Not only can the right accessories make it easier and more fun to play all of the games you love, but they can also make your gaming experience better in different environments, be it on the couch, in an airplane or in the car. We've got to try out some of the latest Switch 2 accessories, and some of our old favorites are also compatible with the new console. These are our current favorite Nintendo Switch 2 accessories, and ...</description>
    </item>
    <item>
      <title>I review e-bikes for a living, and these are my top 3 electric bikes from 2025</title>
      <link>https://www.techradar.com/health-fitness/bikes/i-review-e-bikes-for-a-living-and-these-are-my-top-3-electric-bikes-from-2025</link>
      <pubDate>Tue, 23 Dec 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">xzzmj6LaBZKSAK34kBjbJJ</guid>
      <description>2026 is almost here and it was a bumper year for powered vehicles. Here are the best e-bikes I tested this year.</description>
    </item>
    <item>
      <title>Inside San Francisco&#8217;s coffeehouse-fueled AI scene, where million-dollar deals happen over cortados</title>
      <link>https://www.fastcompany.com/91462325/inside-san-franciscos-coffee-shop-ai-scene-where-million-dollar-deals-happen-over-cortados</link>
      <pubDate>2025-12-23T08:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91462325/inside-san-franciscos-coffee-shop-ai-scene-where-million-dollar-deals-happen-over-cortados</guid>
      <description>The best work doesn&#8217;t happen in offices. It happens where life happens. Where the coffee is strong, the Wi-Fi is reliable enough, and the person next to you might just have the insight that changes everything.
Fintech firm Mercury recently dropped some data that made me smile. It ranked the top five coffee shops powering founders in San Francisco based on actual transaction data: Sightglass, CoffeeShop, Equator, Saint Frank, Ritual. I&#8217;ve built Octolane with my cofounder, Rafi, from every single one of them....</description>
    </item>
    <item>
      <title>Quels sont les meilleurs aspirateurs robots pas chers en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/2767881_les-meilleurs-aspirateurs-robots-pas-chers-notre-selection</link>
      <pubDate>Tue, 23 Dec 2025 07:44:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2767881_les-meilleurs-aspirateurs-robots-pas-chers-notre-selection</guid>
      <description>
Un petit aspirateur robot vous ferait de l'&#339;il, mais vous n'avez pas envie de d&#233;penser des mille et des cents dans ce type d'appareil ? Bienvenue sur notre comparatif des meilleurs robots aspirateurs abordables &#224; acheter.
</description>
    </item>
    <item>
      <title>Cette alternative &#224; ChatGPT et Nano Banana fait mieux que Photoshop</title>
      <link>https://www.frandroid.com/culture-tech/2918873_cette-alternative-a-chatgpt-et-nano-banana-fait-mieux-que-photoshop</link>
      <pubDate>Tue, 23 Dec 2025 07:42:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/2918873_cette-alternative-a-chatgpt-et-nano-banana-fait-mieux-que-photoshop</guid>
      <description>
Le g&#233;ant Alibaba publie une nouvelle version de son IA de g&#233;n&#233;ration d'images Qwen. La promesse est redoutable : une g&#233;n&#233;ration sur plusieurs calques dissoci&#233;s.
</description>
    </item>
    <item>
      <title>Firefox promet un bouton &#8220;kill switch&#8221; pour tuer l&#8217;intelligence artificielle</title>
      <link>https://www.01net.com/actualites/firefox-promet-un-bouton-kill-switch-pour-tuer-lintelligence-artificielle.html</link>
      <pubDate>Tue, 23 Dec 2025 07:37:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316579</guid>
      <description>La nomination du nouveau patron de Mozilla la semaine derni&#232;re s&#8217;est accompagn&#233;e d&#8217;une annonce qui a suscit&#233; une vague de critiques, l&#8217;apparition de l&#8217;intelligence artificielle au sein du navigateur. Pour apaiser les tensions, l&#8217;entreprise vient de promettre l&#8217;int&#233;gration d&#8217;un bouton &#171;&#160;kill switch&#160;&#187;, un outil permettant aux utilisateurs de d&#233;sactiver compl&#232;tement les outils IA dans Firefox....</description>
    </item>
    <item>
      <title>Fini les probl&#232;mes de stockage sur votre PS5 gr&#226;ce &#224; ce SSD Lexar Play 1 To avec dissipateur thermique &#224; moins de 80 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2917997_fini-les-problemes-de-stockage-sur-votre-ps5-grace-a-ce-ssd-lexar-play-1-to-avec-dissipateur-thermique-a-moins-de-80-e</link>
      <pubDate>Tue, 23 Dec 2025 07:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2917997_fini-les-problemes-de-stockage-sur-votre-ps5-grace-a-ce-ssd-lexar-play-1-to-avec-dissipateur-thermique-a-moins-de-80-e</guid>
      <description>
Gr&#226;ce au 1 To de stockage de ce Lexar Play, vous pourrez doubler l'espace disponible sur votre PS5. Chez Darty, ce SSD passe &#224; 79,99 euros au lieu de 99,99 euros.
</description>
    </item>
  </channel>
</rss>
