<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 08 Nov 2025 17:32:01 GMT</lastBuildDate>
    <item>
      <title>OpenAI asked Trump administration to expand Chips Act tax credit to cover data centers</title>
      <link>https://techcrunch.com/2025/11/08/openai-asked-trump-administration-to-expand-chips-act-tax-credit-to-cover-data-centers/</link>
      <pubDate>Sat, 08 Nov 2025 17:30:24 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3066308</guid>
      <description>A recent letter from OpenAI reveals more details about how the company is hoping the federal government can support the company's ambitious plans for data center construction.</description>
    </item>
    <item>
      <title>BioWare&#8217;s Cryptic &#8216;Mass Effect 5 &#8216; Art is Building the Game&#8217;s Story</title>
      <link>https://gizmodo.com/biowares-cryptic-mass-effect-5-art-is-building-the-games-story-2000683272</link>
      <pubDate>Sat, 08 Nov 2025 17:25:43 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683272</guid>
      <description>The studio says everything it's put out for 'Mass Effect 5' thus far will lead to what awaits the next chapter in its sci-fi saga.</description>
    </item>
    <item>
      <title>Black Friday 2025 : les offres coulent &#224; flots sur Amazon &amp; Co, mais voici les meilleurs deals &#224; retenir en avant-premi&#232;re</title>
      <link>https://www.frandroid.com/bons-plans/2849105_black-friday-2025-les-offres-coulent-a-flots-sur-amazon-co-mais-voici-les-meilleurs-deals-a-retenir-en-avant-premiere</link>
      <pubDate>Sat, 08 Nov 2025 17:13:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849105_black-friday-2025-les-offres-coulent-a-flots-sur-amazon-co-mais-voici-les-meilleurs-deals-a-retenir-en-avant-premiere</guid>
      <description>
De nombreux e-commer&#231;ants ont pris de l'avance sur le Black Friday. On trouve d&#233;j&#224; de belles remises sur de nombreux produits Tech. Nous suivons les offres les plus int&#233;ressantes en temps r&#233;el pour vous pr&#233;senter une s&#233;lection des meilleures promotions tech du moment, incluant smartphones, ordinateurs, t&#233;l&#233;viseurs, objets connect&#233;s et accessoires.
...</description>
    </item>
    <item>
      <title>Test du vid&#233;oprojecteur Hisense PT1 : le meilleur rapport qualit&#233;/prix du home-cin&#233;ma grand &#233;cran</title>
      <link>https://www.frandroid.com/marques/hisense/2840661_test-du-videoprojecteur-hisense-pt1-le-meilleur-rapport-qualite-prix-du-home-cinema-grand-ecran</link>
      <pubDate>Sat, 08 Nov 2025 17:05:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/hisense/2840661_test-du-videoprojecteur-hisense-pt1-le-meilleur-rapport-qualite-prix-du-home-cinema-grand-ecran</guid>
      <description>
Le vid&#233;oprojecteur Hisense PT1 est un mod&#232;le &#224; ultra courte focale pens&#233; pour offrir une image spectaculaire &#224; seulement quelques centim&#232;tres d&#8217;un mur ou d&#8217;un &#233;cran. Avec sa technologie Triple Laser TriChroma, il promet une exp&#233;rience cin&#233;ma immersive dans votre salon. Voici notre test complet.
</description>
    </item>
    <item>
      <title>The best earbuds we&#8217;ve tested for 2025</title>
      <link>https://www.theverge.com/21309820/best-wireless-earbuds</link>
      <pubDate>2025-11-08T12:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/21309820/best-wireless-earbuds</guid>
      <description>It&#8217;s hard to buy a bad pair of wireless earbuds these days, and with constant discounts and deals wherever you look, now is as good a time as any to splurge on the pair you&#8217;ve been eyeing. The market has come a long way since the early era of true wireless earbuds when we had [&#8230;]</description>
    </item>
    <item>
      <title>De nombreux TV 4K (OLED ou QLED) et vid&#233;oprojecteurs sont en cours de d&#233;sotkage lors du pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2848951_le-black-friday-en-avant-premiere-creve-lecran-avec-ces-bons-plans-sur-les-tv-4k-et-les-videoprojecteurs-voici-le-top-des-meilleures-offres</link>
      <pubDate>Sat, 08 Nov 2025 16:57:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848951_le-black-friday-en-avant-premiere-creve-lecran-avec-ces-bons-plans-sur-les-tv-4k-et-les-videoprojecteurs-voici-le-top-des-meilleures-offres</guid>
      <description>
Le t&#233;l&#233;viseur du salon montre des signes de fatigue ? Couleurs ternes, son gr&#233;sillant, image vieillissante ? C&#8217;est sans doute le moment de le remplacer. &#192; l&#8217;approche du Black Friday, de nombreuses TV 4K et vid&#233;oprojecteurs sont propos&#233;s &#224; prix r&#233;duit. Voici notre s&#233;lection des meilleures offres du moment pour allier qualit&#233; d&#8217;image et bon rapport qualit&#233;-prix.
...</description>
    </item>
    <item>
      <title>Fnac et Darty se montrent bien g&#233;n&#233;reux lors du pr&#233;-Black Friday : les 18 deals qui valent le coup</title>
      <link>https://www.frandroid.com/bons-plans/2849237_fnac-et-darty-se-montrent-bien-genereux-lors-du-pre-black-friday-les-15-deals-qui-valent-le-coup</link>
      <pubDate>Sat, 08 Nov 2025 16:47:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849237_fnac-et-darty-se-montrent-bien-genereux-lors-du-pre-black-friday-les-15-deals-qui-valent-le-coup</guid>
      <description>
Pour ne pas laisser le champ libre &#224; Boulanger, la Fnac et Darty prennent aussi de l'avance sur le Black Friday et d&#233;ploient &#224; leur tour de solides offres sur de nombreux produits Tech. Nous avons fait le tri parmi toutes les offres, et voici uniquement celles qui valent le coup. 
</description>
    </item>
    <item>
      <title>Samsung n&#8217;&#233;pargne aucun de ses produits pour le pr&#233;-Black Friday : le TOP 16 des offres &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2852851_samsung-nepargne-aucun-de-ses-produits-pour-le-pre-black-friday-le-top-15-des-offres-a-retenir</link>
      <pubDate>Sat, 08 Nov 2025 16:40:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2852851_samsung-nepargne-aucun-de-ses-produits-pour-le-pre-black-friday-le-top-15-des-offres-a-retenir</guid>
      <description>
Samsung participe pleinement &#224; cette p&#233;riode de pr&#233;-Black Friday. Smartphones, t&#233;l&#233;viseurs, tablettes, barres de son, vid&#233;oprojecteurs et m&#234;me aspirateurs-balais&#8239;: la marque sud-cor&#233;enne casse les prix sur de nombreuses r&#233;f&#233;rences r&#233;centes et populaires. D&#233;couvrez les meilleures offres &#224; saisir dans cet article.  
</description>
    </item>
    <item>
      <title>Avec 900 &#8364; de moins, ce TV 4K QLED XXL de 98&#8243; (144 Hz) est le super deal du pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2728225_avec-900-de-moins-ce-tv-4k-qled-xxl-de-98-144-hz-est-le-super-deal-du-pre-black-friday</link>
      <pubDate>Sat, 08 Nov 2025 16:12:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2728225_avec-900-de-moins-ce-tv-4k-qled-xxl-de-98-144-hz-est-le-super-deal-du-pre-black-friday</guid>
      <description>
Une image d&#233;mesur&#233;e, une fluidit&#233; haut de gamme, un son Dolby Atmos, ce t&#233;l&#233;viseur TCL 98C655 raye toutes les lignes du grand spectacle. Le pr&#233;-Black Friday lui permet m&#234;me d&#8217;avoir une r&#233;duction &#224; la hauteur de ses 248 cm. De 2 299 euros &#224; 1 399 euros.
</description>
    </item>
    <item>
      <title>On a essay&#233; le Renault Kangoo E-Tech : une voiture &#233;lectrique incroyablement pratique mais qui n&#8217;arrive pas &#224; nous convaincre</title>
      <link>https://www.frandroid.com/marques/renault/2850207_on-a-essaye-le-renault-kangoo-e-tech-une-voiture-electrique-incroyablement-pratique-mais-qui-narrive-pas-a-nous-convaincre</link>
      <pubDate>Sat, 08 Nov 2025 16:06:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2850207_on-a-essaye-le-renault-kangoo-e-tech-une-voiture-electrique-incroyablement-pratique-mais-qui-narrive-pas-a-nous-convaincre</guid>
      <description>
&#192; l'heure des SUV &#233;lectriques, toujours plus gros et, paradoxalement, pas toujours tr&#232;s accueillants, les familles ne trouvent pas forc&#233;ment toutes leur bonheur. Tout l'inverse du Renault Kangoo E-Tech qui met de c&#244;t&#233; tout aspect esth&#233;tique pour maximiser son habitabilit&#233;. Nous avons pu l&#8217;essayer et voici notre avis !
</description>
    </item>
    <item>
      <title>A UK government department spent hundreds of millions upgrading its systems to Windows 10 - just in time for its official end of life</title>
      <link>https://www.techradar.com/pro/a-uk-government-department-spent-hundreds-of-millions-upgrading-its-systems-to-windows-10-just-in-time-for-its-official-end-of-life</link>
      <pubDate>Sat, 08 Nov 2025 16:02:00 +0000</pubDate>
      <guid isPermaLink="false">HkDnamTSPKsPmX8tfnUqLd</guid>
      <description>Defra spent hundreds of millions upgrading to Windows 10, yet large portions of its ageing estate remain outdated and require rapid modernization.</description>
    </item>
    <item>
      <title>Apple helped kill netbooks. Will it bring them back?</title>
      <link>https://www.theverge.com/tech/817277/apple-ipad-killed-the-netbook-cheap-macbook-is-bringing-them-back</link>
      <pubDate>2025-11-08T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=817277</guid>
      <description>Rumor has it, Apple is working on a low-cost MacBook. And not "low-cost for a Mac," but a proper cheap laptop, possibly as low as $599. For a company that traditionally targets the more premium end of the market, this would be something of an about-face. Of course, Apple takes great pride in its design [&#8230;]</description>
    </item>
    <item>
      <title>France vs South Africa free streams: How to watch Autumn International 2025, TV Channels, Team News &amp; Preivew</title>
      <link>https://www.techradar.com/how-to-watch/rugby/france-vs-south-africa-free-streams-how-to-watch-autumn-international-2025-tv-channels-team-news-and-preivew</link>
      <pubDate>Sat, 08 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">csbNApNR74kNWPXfsFvCEY</guid>
      <description>All the ways to watch France vs South Africa live streams online, as two of the world's best teams meet in a blockbuster 2025 Autumn International at Stade de France.</description>
    </item>
    <item>
      <title>How to watch France vs. South Africa online for free</title>
      <link>https://mashable.com/article/france-south-africa-autumn-internationals-2025-live-stream-for-free</link>
      <pubDate>Sat, 08 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">02ufZnb3BU7AdQe0Qthl63p</guid>
      <description>How to watch 2025 Autumn Internationals for free. Live stream France vs. South Africa in the Autumn Internationals for free.</description>
    </item>
  </channel>
</rss>
