<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 28 Feb 2026 15:28:02 GMT</lastBuildDate>
    <item>
      <title>How to watch NRL 2026: Free Streams, TV Channels, Preview for new season</title>
      <link>https://www.techradar.com/how-to-watch/rugby/nrl-2026-free-</link>
      <pubDate>Sat, 28 Feb 2026 15:15:00 +0000</pubDate>
      <guid isPermaLink="false">Nez7K28BkX5q6xaFZuuHa8</guid>
      <description>As Brisbane Broncos seek to defend their crown after dethroning Penrith, here's how to watch NRL 2026 live streams with TV channels and FREE options explained.</description>
    </item>
    <item>
      <title>This Is the System That Intercepted Iran's Missiles Over the UAE</title>
      <link>https://www.wired.com/story/uae-missile-intercept-system-iran/</link>
      <pubDate>Sat, 28 Feb 2026 15:12:51 +0000</pubDate>
      <guid isPermaLink="false">69a2f8e1ed5e0e393e77897b</guid>
      <description>As Iranian missiles targeted US-linked sites across the Gulf, the UAE&#8217;s missile shield was activated in real-time.</description>
    </item>
    <item>
      <title>Xiaomi launches 17 Ultra smartphone, an AirTag clone, and an ultra slim powerbank</title>
      <link>https://techcrunch.com/2026/02/28/xiaomi-launches-17-ultra-smartphone-an-airtag-clone-and-an-ultra-slim-powerbank/</link>
      <pubDate>Sat, 28 Feb 2026 15:09:03 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3097555</guid>
      <description>We round up everything Xiaomi announced at its Mobile World Congress event.</description>
    </item>
    <item>
      <title>Xiaomi Vision GT : tout savoir sur l&#8217;hypercar d&#233;voil&#233;e au MWC 2026</title>
      <link>https://www.frandroid.com/marques/xiaomi/2994909_xiaomi-vision-gt-le-constructeur-devoile-une-supercar-au-mwc-2026</link>
      <pubDate>Sat, 28 Feb 2026 15:07:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2994909_xiaomi-vision-gt-le-constructeur-devoile-une-supercar-au-mwc-2026</guid>
      <description>
Regardez bien cette silhouette. Ce n'est pas le prochain accessoire pour votre salon, c'est la Xiaomi Vision GT. D&#233;voil&#233;e &#224; Barcelone aux c&#244;t&#233;s de la nouvelle gamme Xiaomi 17, cette b&#234;te de course con&#231;ue pour Gran Turismo, sur les circuits, r&#233;els comme virtuels.
</description>
    </item>
    <item>
      <title>Test du Xiaomi 17 Ultra : un zoom optique continu, c&#8217;est une &#233;norme surprise</title>
      <link>https://www.frandroid.com/marques/xiaomi/2981687_test-xiaomi-17-ultra</link>
      <pubDate>Sat, 28 Feb 2026 15:07:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2981687_test-xiaomi-17-ultra</guid>
      <description>
&#201;cran 120 Hz LTPO, processeur Snapdragon 8 Elite Gen 5, batterie de 6000 mAh, charge rapide (avec ou sans fil), et un t&#233;l&#233;objectif &#224; double focale avec capteur de 200 m&#233;gapixels : le Xiaomi 17 Ultra frappe fort.
</description>
    </item>
    <item>
      <title>Why China&#8217;s humanoid robot industry is winning the early market</title>
      <link>https://techcrunch.com/2026/02/28/why-chinas-humanoid-robot-industry-is-winning-the-early-market/</link>
      <pubDate>Sat, 28 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3097319</guid>
      <description>China&#8217;s push into humanoid robots is accelerating, with domestic firms shipping more units and iterating faster than U.S. competitors in a still-nascent market.</description>
    </item>
    <item>
      <title>The hidden problem with taking five billion photos a day</title>
      <link>https://www.techradar.com/pro/the-hidden-problem-with-taking-five-billion-photos-a-day</link>
      <pubDate>Sat, 28 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">oZQDfPZiqDuMWLh5pvdWUo</guid>
      <description>Our relationship with photography has changed radically, creating vast dormant datasets.</description>
    </item>
    <item>
      <title>I'm a trained barista, and here are my top 15 AeroPress accessories to take your brewing to the next level</title>
      <link>https://www.techradar.com/tech/im-a-trained-barista-and-here-are-my-top-15-aeropress-accessories-to-take-your-brewing-to-the-next-level</link>
      <pubDate>Sat, 28 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">Wih3MMZKProQU92gtq2GPU</guid>
      <description>Upgrade your AeroPress with my guide to the best accessories and add-ons, starting at just $10.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Sunday, March 1 (game #1497)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-1-march-2026</link>
      <pubDate>Sat, 28 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">opUieBFxMWknSnhGQRcmea</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Sunday, March 1 (game #994)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-1-march-2026</link>
      <pubDate>Sat, 28 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">5UYFAwHb3TKp7Z2sqy5rES</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Sunday, March 1 (game #728)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-1-march-2026</link>
      <pubDate>Sat, 28 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">wy9u4rwhRnrkwr6gjm2srU</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Samsung veut que Galaxy AI soit votre &#171; ami invisible &#187;, mais &#231;a veut dire quoi ?</title>
      <link>https://www.frandroid.com/marques/samsung/2994039_samsung-veut-que-galaxy-ai-soit-votre-ami-invisible-mais-ca-veut-dire-quoi</link>
      <pubDate>Sat, 28 Feb 2026 14:53:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2994039_samsung-veut-que-galaxy-ai-soit-votre-ami-invisible-mais-ca-veut-dire-quoi</guid>
      <description>
Le r&#234;ve de Samsung est de faire de Galaxy AI une IA proactive capable d'agir comme un ami invisible et bien intentionn&#233; &#224; l'int&#233;rieur de votre t&#233;l&#233;phone.
</description>
    </item>
    <item>
      <title>Xiaomi lance une Hypercar, voici les premi&#232;res images du bolide</title>
      <link>https://www.01net.com/actualites/xiaomi-lance-une-hyper-car-voici-les-premieres-images-du-bolide.html</link>
      <pubDate>Sat, 28 Feb 2026 14:46:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1328866</guid>
      <description>Apr&#232;s le succ&#232;s fulgurant de sa berline &#233;lectrique SU7, Xiaomi acc&#233;l&#232;re dans l&#8217;univers automobile. Au MWC 2026, la marque chinoise d&#233;voile la Vision GT, une HyperCar futuriste pens&#233;e pour la performance et l&#8217;a&#233;rodynamisme.</description>
    </item>
    <item>
      <title>Le meilleur accessoire de Xiaomi revient dans un format plus petit et en moins cher</title>
      <link>https://www.01net.com/actualites/le-meilleur-accessoire-de-xiaomi-revient-dans-un-format-plus-petit-et-en-moins-cher.html</link>
      <pubDate>Sat, 28 Feb 2026 14:45:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1328140</guid>
      <description>Xiaomi pr&#233;sente la Mijia, le plus petit compresseur d&#8217;air &#233;lectrique jamais cr&#233;&#233; par la marque. Disponible d&#232;s aujourd&#8217;hui au prix de 49,99 &#8364;. Le Xiaomi Air Compact compressor est l&#224; et il pourrait convaincre un paquet de cyclistes et autres propri&#233;taires de trottienttes &#233;lectriques.</description>
    </item>
    <item>
      <title>Xiaomi lance son &#171;&#160;AirTag&#160;&#187; : le Tag est deux fois moins cher en plus d&#8217;&#234;tre compatible Android et iPhone</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/2993383_xiaomi-lance-son-airtag-deux-fois-moins-cher-et-compatible-android-et-iphone</link>
      <pubDate>Sat, 28 Feb 2026 14:40:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/2993383_xiaomi-lance-son-airtag-deux-fois-moins-cher-et-compatible-android-et-iphone</guid>
      <description>
egardez bien ce petit galet de 10 grammes. Le Xiaomi Tag n'est pas juste un clone de plus, c'est une alternative s&#233;rieuse qui s'int&#232;gre au r&#233;seau d'Apple tout en restant ouvert &#224; Google. Xiaomi veut d&#233;mocratiser le traqueur d'objets, et c'est tr&#232;s bien vu.
</description>
    </item>
    <item>
      <title>Xiaomi TV S Mini LED 2026 : la nouvelle offensive Mini LED abordable</title>
      <link>https://www.frandroid.com/marques/xiaomi/2993701_xiaomi-tv-s-mini-led-2026-la-nouvelle-offensive-mini-led-abordable</link>
      <pubDate>Sat, 28 Feb 2026 14:40:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2993701_xiaomi-tv-s-mini-led-2026-la-nouvelle-offensive-mini-led-abordable</guid>
      <description>
Xiaomi lance en France sa s&#233;rie de t&#233;l&#233;viseurs TV S Mini LED 2026, d&#233;clin&#233;e de 55 &#224; 98 pouces, avec dalles 4K QD&#8209;Mini LED, compatibilit&#233; HDR, Google TV et tarifs agressifs. En voici tous les d&#233;tails.
</description>
    </item>
    <item>
      <title>01lab&#160;: l&#8217;&#233;cran du Xiaomi 17 Ultra bat le record absolu de luminosit&#233;</title>
      <link>https://www.01net.com/actualites/01lab-lecran-du-xiaomi-17-ultra-bat-le-record-absolu-de-luminosite.html</link>
      <pubDate>Sat, 28 Feb 2026 14:36:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1328694</guid>
      <description>Le Xiaomi 17 Ultra est pass&#233; sur le gril de notre 01Lab. Verdict ? Sa nouvelle dalle OLED HyperRGB explose les compteurs et bouscule la concurrence.</description>
    </item>
    <item>
      <title>Xiaomi&#160;: 5 nouvelles trottinettes &#233;lectriques pour envahir (encore) le march&#233;</title>
      <link>https://www.01net.com/actualites/xiaomi-5-nouvelles-trottinettes-electriques-pour-envahir-encore-le-marche.html</link>
      <pubDate>Sat, 28 Feb 2026 14:32:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1328043</guid>
      <description>Xiaomi pr&#233;sente une nouvelle gamme de trottinettes &#233;lectriques, la Xiaomi Electric Scooter 6. Cette s&#233;rie comprend cinq mod&#232;les, dont un tr&#232;s haut de gamme, deux haut de gamme et deux entr&#233;e de gamme.</description>
    </item>
    <item>
      <title>Review: Xiaomi 17 Ultra and Leitzphone Pack Leica Magic Into a Flagship Phone</title>
      <link>https://www.wired.com/review/xiaomi-17-ultra-leitzphone/</link>
      <pubDate>Sat, 28 Feb 2026 14:32:00 +0000</pubDate>
      <guid isPermaLink="false">699f15349af3e6657d579acb</guid>
      <description>The latest Xiaomi flagship is a beast and comes in a specially co-designed Leica edition that&#8217;s picture-perfect.</description>
    </item>
    <item>
      <title>Redmi Buds 8 Pro : Xiaomi d&#233;voile ses &#233;couteurs immersifs au MWC 2026</title>
      <link>https://www.frandroid.com/marques/xiaomi/2993033_redmi-buds-8-pro-xiaomi-devoile-ses-ecouteurs-immersifs-au-mwc-2026</link>
      <pubDate>Sat, 28 Feb 2026 14:32:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2993033_redmi-buds-8-pro-xiaomi-devoile-ses-ecouteurs-immersifs-au-mwc-2026</guid>
      <description>
Xiaomi a pr&#233;sent&#233; les Redmi Buds 8 Pro lors de son &#233;v&#233;nement au Mobile World Congress de Barcelone ce 28 f&#233;vrier. Ces &#233;couteurs true wireless se veulent &#234;tre une option polyvalente pour une &#233;coute quotidienne enrichie avec un prix contenu.
</description>
    </item>
    <item>
      <title>Xiaomi 17 et 17 Ultra et Leica Leitz Phone&#160;: sur les smartphones Xiaomi veut calmer tout le monde en photo</title>
      <link>https://www.01net.com/actualites/xiaomi-17-et-17-ultra-et-leica-leitz-phone-sur-les-smartphones-xiaomi-veut-calmer-tout-le-monde-en-photo.html</link>
      <pubDate>Sat, 28 Feb 2026 14:30:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1328684</guid>
      <description>Xiaomi s&#8217;associe une fois de plus &#224; Leica et pr&#233;sente trois nouveaux mod&#232;les : les Xiaomi 17, Xiaomi 17 Ultra et un mod&#232;le enti&#232;rement centr&#233; sur la photographie, le Leica Leitz Phone. Chacun est fourni avec un kit photo destin&#233; &#224; am&#233;liorer l&#8217;exp&#233;rience et la qualit&#233;.</description>
    </item>
    <item>
      <title>Pincer, secouer, tourner&#160;: la Watch 5 de Xiaomi se contr&#244;le &#224; la force du poignet</title>
      <link>https://www.01net.com/actualites/pincer-secouer-tourner-la-watch-5-de-xiaomi-se-controle-a-la-force-du-poignet.html</link>
      <pubDate>Sat, 28 Feb 2026 14:30:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1328475</guid>
      <description>Et si la meilleure fa&#231;on d&#8217;utiliser une montre connect&#233;e &#233;tait de ne plus toucher &#224; son &#233;cran ? Avec sa nouvelle Watch 5, Xiaomi multiplie les interactions pour &#233;viter de se servir directement de la montre connect&#233;e. Le constructeur d&#233;voile aussi de nouveaux &#233;couteurs sous sa marque Redmi.</description>
    </item>
    <item>
      <title>Xiaomi Electric Scooter 6 Ultra&#160;: un monstre de trottinette &#233;lectrique &#224; moins de 800 euros</title>
      <link>https://www.01net.com/actualites/xiaomi-electric-scooter-6-ultra-un-monstre-de-trottinette-electrique-a-moins-de-800-euros.html</link>
      <pubDate>Sat, 28 Feb 2026 14:30:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327646</guid>
      <description>Xiaomi a d&#233;voil&#233; une version ultra performante et sportive de sa trottinette. L&#8217;Electric Scooter 6 Ultra est ce que la marque fait de mieux dans le domaine. Pr&#233;sentations.</description>
    </item>
    <item>
      <title>Xiaomi pr&#233;sente ses tags&#160;: deux fois moins cher que chez Apple</title>
      <link>https://www.01net.com/actualites/xiaomi-presente-ses-tags-deux-fois-moins-cher-que-chez-apple.html</link>
      <pubDate>Sat, 28 Feb 2026 14:30:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1328474</guid>
      <description>Xiaomi lance son tout premier traceur d&#8217;objets connect&#233;, le Xiaomi Tag. Un accessoire l&#233;ger et con&#231;u pour &#234;tre simple d&#8217;utilisation, &#224; un prix d&#233;fiant toute concurrence.</description>
    </item>
    <item>
      <title>Xiaomi 17 Ultra, Leica Phone&#160;: m&#234;me base technique, mais pourquoi cette diff&#233;rence de prix&#160;?</title>
      <link>https://www.01net.com/actualites/xiaomi-17-ultra-leica-phone-meme-base-technique-mais-pourquoi-cette-difference-de-prix.html</link>
      <pubDate>Sat, 28 Feb 2026 14:30:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1328321</guid>
      <description>Le Xiaomi 17 Ultra et le Leica Leitz Phone partagent la m&#234;me base technique, mais le Leica est 500 euros plus cher. Le Leica Leitz Phone se distingue par une bague rotative pour le contr&#244;le photo et un design l&#233;g&#232;rement diff&#233;rent. Le Xiaomi 17 Ultra est propos&#233; &#224; 1499 euros, tandis que le Leica Leitz Phone est &#224; 1999 euros, mais avec 1 To de stockage....</description>
    </item>
    <item>
      <title>Xiaomi 17 Ultra hands-on: Incredible cameras, but maybe hard to get</title>
      <link>https://www.engadget.com/mobile/smartphones/xiaomi-17-ultra-global-launch-hands-on-leica-camera-143006810.html?src=rss</link>
      <pubDate>Sat, 28 Feb 2026 14:30:06 +0000</pubDate>
      <guid isPermaLink="false">35bd6008-394d-4c07-8cc7-373bab2d6c95</guid>
      <description>China&#8217;s biggest phone makers continue to relentlessly forge ahead with high-spec phones that you may never see in the US. With the Xiaomi 17 Ultra this year, the company has continued its pattern from previous iterations by focusing on powerful camera sensors, huge batteries and&#8230; being selective about global availability.
Xiaomi&#8217;s 17 series is launching across multiple European territories months after its Asia debut, but at the time of writing, no word yet on US availability. Another logistical point of interest? When we last checked out Xiaomi&#8217;s devices, it was the 15 series, and the company...</description>
    </item>
    <item>
      <title>Xiaomi&#8217;s tracker doesn&#8217;t need a case to clip to your keys</title>
      <link>https://www.theverge.com/tech/884567/xiaomi-tag-tracker-apple-find-my-google-hub-bluetooth</link>
      <pubDate>2026-02-28T09:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=884567</guid>
      <description>Xiaomi has announced its first Bluetooth tracker, and while the Xiaomi Tag has a more elongated design than the Apple AirTag, that lets you use it in more places right out of the box. On one end of the tracker you'll find an integrated metal loop that can be attached to a keyring or clipped [&#8230;]</description>
    </item>
    <item>
      <title>Xiaomi&#8217;s Leica Leitzphone mostly earns the name</title>
      <link>https://www.theverge.com/gadgets/886131/xiaomi-leica-leitzphone-17-ultra-review</link>
      <pubDate>2026-02-28T09:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=886131</guid>
      <description>Xiaomi and Leica's long-running phone partnership just got a little closer. Alongside the new international release of its 17 Ultra flagship, Xiaomi has been entrusted with manufacturing a separate version that is the first Leica Leitzphone to release outside of Japan, following three Sharp-made models exclusive to the country. In truth, the Leitzphone is a [&#8230;]...</description>
    </item>
    <item>
      <title>Xiaomi 17 is a small(ish) phone with a big(ish) battery</title>
      <link>https://www.theverge.com/gadgets/886322/xiaomi-17-release-specs-price-mwc-ultra-leica</link>
      <pubDate>2026-02-28T09:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=886322</guid>
      <description>Xiaomi has just given a global launch to two of its latest flagship phones, the Xiaomi 17 and 17 Ultra, along with a Leica-branded Leitzphone edition of the Ultra. There's no sign, however, of the 17 Pro, which launched in China with an additional display mounted next to the rear cameras. The 17 and 17 [&#8230;]</description>
    </item>
    <item>
      <title>Borussia Dortmund vs Bayern Munich Live Streams: How to watch Bundesliga 2025-26 Der Klassiker from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/football/borussia-dortmund-vs-bayern-munich-bundesliga-2025-26</link>
      <pubDate>Sat, 28 Feb 2026 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">jKXjvvMCcqPu7NffVnkNWf</guid>
      <description>All the ways to watch Borussia Dortmund vs Bayern Munich live streams online and from anywhere, with Vincent Kompany's side looking to go 11 points clear at the top of the table.</description>
    </item>
    <item>
      <title>Leica&#8217;s Leitzphone looks like the dream phone for photographers &#8212; and I&#8217;m particularly excited about this one feature</title>
      <link>https://www.techradar.com/phones/leica-unveils-a-dream-flagship-phone-for-photographers-and-its-available-globally-but-theres-bad-news-if-youre-in-the-us</link>
      <pubDate>Sat, 28 Feb 2026 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">aLKdKUbja5HkfckxLDCFFB</guid>
      <description>Leica has finally revealed a flagship phone that's available outside of Japan, and it looks like the ultimate phone for photographers.</description>
    </item>
    <item>
      <title>Leica Leitzphone powered by Xiaomi : l&#8217;excellence optique a enfin son smartphone de r&#233;f&#233;rence</title>
      <link>https://www.frandroid.com/marques/leica/2993563_leica-leitzphone-powered-by-xiaomi-lexcellence-optique-a-enfin-son-smartphone-de-reference</link>
      <pubDate>Sat, 28 Feb 2026 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/leica/2993563_leica-leitzphone-powered-by-xiaomi-lexcellence-optique-a-enfin-son-smartphone-de-reference</guid>
      <description>
Est-ce vraiment un smartphone ou un appareil photo compact qui a fusionn&#233; avec un processeur Snapdragon ? Le Leica Leitzphone powered by Xiaomi vient d'&#234;tre annonc&#233; et il promet de ramener l'ergonomie des bo&#238;tiers pros dans votre poche. Mais &#224; quel prix ?
</description>
    </item>
    <item>
      <title>Voici l&#8217;Electric Scooter 6 Lite, la nouvelle trottinette &#233;lectrique abordable de Xiaomi</title>
      <link>https://www.frandroid.com/marques/xiaomi/2988483_voici-lelectric-scooter-6-lite-la-nouvelle-trottinette-electrique-abordable-de-xiaomi</link>
      <pubDate>Sat, 28 Feb 2026 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2988483_voici-lelectric-scooter-6-lite-la-nouvelle-trottinette-electrique-abordable-de-xiaomi</guid>
      <description>
Propos&#233;e &#224; 329,99 euros, la Xiaomi Electric Scooter 6 Lite constitue l&#8217;entr&#233;e de gamme de la nouvelle s&#233;rie de trottinettes &#233;lectriques de Xiaomi, avec une fiche technique centr&#233;e sur l&#8217;essentiel.
</description>
    </item>
    <item>
      <title>Les trottinettes &#233;lectriques Xiaomi Electric Scooter 6, 6 Pro et 6 Max sont l&#224; : de la nouveaut&#233; &#224; gogo, tout ce qu&#8217;il faut savoir</title>
      <link>https://www.frandroid.com/marques/xiaomi/2990333_les-trottinettes-electriques-xiaomi-electric-scooter-6-6-pro-et-6-max-sont-la-de-la-nouveaute-a-gogo-tout-ce-quil-faut-savoir</link>
      <pubDate>Sat, 28 Feb 2026 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2990333_les-trottinettes-electriques-xiaomi-electric-scooter-6-6-pro-et-6-max-sont-la-de-la-nouveaute-a-gogo-tout-ce-quil-faut-savoir</guid>
      <description>
Parmi les cinq nouvelles Xiaomi Electric Scooter 6, trois mod&#232;les se partagent le milieu de la gamme : la Scooter 6, Scooter 6 Pro et Scooter 6 Max. En voici une pr&#233;sentation compl&#232;te sous forme de comparatif.
</description>
    </item>
    <item>
      <title>Pourquoi vous devriez arr&#234;ter d&#8217;ignorer le Xiaomi 17 Ultra, le smartphone le plus sous-c&#244;t&#233; du march&#233;</title>
      <link>https://www.frandroid.com/marques/xiaomi/2993743_pourquoi-vous-devriez-arreter-dignorer-le-xiaomi-17-ultra-le-smartphone-le-plus-sous-cote-du-marche</link>
      <pubDate>Sat, 28 Feb 2026 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2993743_pourquoi-vous-devriez-arreter-dignorer-le-xiaomi-17-ultra-le-smartphone-le-plus-sous-cote-du-marche</guid>
      <description>
Pour la premi&#232;re fois, l'Ultra n'est pas qu'une accumulation de composants, c'est un produit fini, ergonomique et incroyablement dense. Avec seulement 8,29 mm d&#8217;&#233;paisseur et un poids de 218,4 g, il devient le mod&#232;le Ultra le plus svelte de l'histoire de la gamme. Xiaomi a opt&#233; pour un design enti&#232;rement plat. Le prix reste tr&#232;s &#233;l&#233;v&#233;.
</description>
    </item>
    <item>
      <title>Pneus de 12 pouces, mode Boost et recharge &#233;clair : la nouvelle Xiaomi Electric Scooter 6 Ultra envoie du lourd</title>
      <link>https://www.frandroid.com/marques/xiaomi/2992533_pneus-de-12-pouces-mode-boost-et-recharge-eclair-la-nouvelle-xiaomi-electric-scooter-6-ultra-envoie-du-lourd</link>
      <pubDate>Sat, 28 Feb 2026 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2992533_pneus-de-12-pouces-mode-boost-et-recharge-eclair-la-nouvelle-xiaomi-electric-scooter-6-ultra-envoie-du-lourd</guid>
      <description>
L'Electric Scooter 6 Ultra repr&#233;sente le vaisseau amiral de la nouvelle g&#233;n&#233;ration de trottinettes &#233;lectriques Xiaomi, avec un design enti&#232;rement retravaill&#233;, un moteur pouvant atteindre 1 200 W en cr&#234;te, une autonomie annonc&#233;e jusqu&#8217;&#224; 75 km et plusieurs &#233;volutions techniques en mati&#232;re de suspension. 
</description>
    </item>
    <item>
      <title>Xiaomi d&#233;fie l&#8217;iPad Air : voici les Xiaomi Pad 8 et Pad 8 Pro</title>
      <link>https://www.frandroid.com/marques/xiaomi/2993723_xiaomi-defie-lipad-air-voici-les-xiaomi-pad-8-et-pad-8-pro</link>
      <pubDate>Sat, 28 Feb 2026 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2993723_xiaomi-defie-lipad-air-voici-les-xiaomi-pad-8-et-pad-8-pro</guid>
      <description>
Xiaomi profite du Mobile World Congress &#224; Barcelone pour d&#233;voiler de nouveaux produits. La marque annonce notamment une nouvelle g&#233;n&#233;ration de tablettes, les Xiaomi Pad 8 et Xiaomi Pad 8 Pro.
</description>
    </item>
    <item>
      <title>Pourquoi le Xiaomi 17 est le vrai rival de l&#8217;iPhone 17 Pro cette ann&#233;e : voici son prix en France</title>
      <link>https://www.frandroid.com/marques/xiaomi/2993443_pourquoi-le-xiaomi-17-est-le-vrai-rival-de-liphone-17-pro-cette-annee-voici-son-prix-en-france</link>
      <pubDate>Sat, 28 Feb 2026 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2993443_pourquoi-le-xiaomi-17-est-le-vrai-rival-de-liphone-17-pro-cette-annee-voici-son-prix-en-france</guid>
      <description>
On louche sur le 17 Ultra, mais Xiaomi vient de frapper un grand coup au MWC 2026 avec le Xiaomi 17. Oubliez les compromis habituels des smartphones compacts : ici, on parle d'un monstre de puissance sous Snapdragon 8 Elite Gen 5, avec une batterie massive de 6330 mAh et une optique Leica qui promet monts et merveilles.
</description>
    </item>
    <item>
      <title>Xiaomi lance son Mijia Compact Portable Electric Air Compressor : un gonfleur &#233;lectrique ultra compact et pratique</title>
      <link>https://www.frandroid.com/marques/xiaomi/2993351_xiaomi-lance-son-mijia-compact-portable-electric-air-compressor-un-gonfleur-electrique-ultra-compact-et-pratique</link>
      <pubDate>Sat, 28 Feb 2026 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2993351_xiaomi-lance-son-mijia-compact-portable-electric-air-compressor-un-gonfleur-electrique-ultra-compact-et-pratique</guid>
      <description>
En marge du lancement de ses nouvelles trottinettes &#233;lectriques Scooter 6, Xiaomi a pr&#233;sent&#233; le Mijia Compact Portable Electric Air Compressor, un gonfleur &#233;lectrique ultra compact.
</description>
    </item>
    <item>
      <title>Xiaomi Watch 5 : le retour tant attendu de Xiaomi sur les montres  Wear OS</title>
      <link>https://www.frandroid.com/marques/xiaomi/2992753_xiaomi-watch-5-le-retour-tant-attendu-de-xiaomi-sur-les-montres-wear-os</link>
      <pubDate>Sat, 28 Feb 2026 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2992753_xiaomi-watch-5-le-retour-tant-attendu-de-xiaomi-sur-les-montres-wear-os</guid>
      <description>
D&#233;j&#224; annonc&#233;e en Chine, la Xiaomi Watch 5 d&#233;barque d&#233;sormais en France avec un beau changement de programme puisqu'elle est d&#233;sormais &#233;quip&#233;e de Wear OS comptant sur un large catalogue d'applications compatibles. 
</description>
    </item>
    <item>
      <title>Leica&#8217;s Leitzphone by Xiaomi has a huge 1-inch camera sensor and a stylish new design</title>
      <link>https://www.engadget.com/mobile/smartphones/leica-leitzphone-xiaomi-mwc-2026-135744417.html?src=rss</link>
      <pubDate>Sat, 28 Feb 2026 14:02:59 +0000</pubDate>
      <guid isPermaLink="false">1b5fe290-2954-4911-ae1d-49a1327a5367</guid>
      <description>Alongside a global launch for Xiaomi's 17 Ultra (read about that right here), the company announced a further deepening of its relationship with Leica. The CEO of Leica, Mattias Harsch, took to the stage to announce a new Leitzphone, which appears to be an even deeper collaboration than 17 Ultra by Leica, which is a different phone. Confused? That's fair.&#160;
Design-wise, Leica has shifted back to a single tone body color, which looks more "Leica" to this camera dilettante's eyes. And if you&#8217;re thinking you&#8217;ve heard of the Leitzphone before, you probably have: it was a series of phones made by Sh...</description>
    </item>
    <item>
      <title>The Witcher is a perfect fit for Reigns&#8217; Tinder-like roleplaying</title>
      <link>https://www.theverge.com/entertainment/885432/reigns-the-witcher-interview-steam-iphone-android</link>
      <pubDate>2026-02-28T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=885432</guid>
      <description>I never knew how easy it was to die in an orgy. But that's just one of the many threats facing Geralt of Rivia in his latest adventure. The studio behind the Reigns series of Tinder-like choose-your-own-adventure games has now adapted The Witcher, following a handful of original titles and a take on Game of [&#8230;]</description>
    </item>
    <item>
      <title>Spider-Man: Beyond the Spider-Verse &#8212; release date, cast, plot, and everything else we know about the new Marvel movie</title>
      <link>https://www.techradar.com/streaming/entertainment/spider-man-beyond-the-spider-verse-hub</link>
      <pubDate>Sat, 28 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">HKeJerJu4goEFaDntzgPCd</guid>
      <description>Spider-Man: Beyond the Spider-Verse is the final installment in Sony's Spider-Verse trilogy &#8212; here's all you need to know about it.</description>
    </item>
    <item>
      <title>20 years ago, Apple launched a Mac that changed mini-PCs forever &#8211; and offered quadruple the performance of its predecessor</title>
      <link>https://www.techradar.com/computing/20-years-ago-apple-launched-a-mac-that-changed-mini-pcs-forever-and-offered-quadruple-the-performance-of-its-predecessor</link>
      <pubDate>Sat, 28 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">GQg4uqV5wpJkFAQ7Zqkyei</guid>
      <description>The first Intel Mac mini launched 20 years ago today, marking a clear break with the PowerPC past.</description>
    </item>
    <item>
      <title>A new Stuff Your Kindle Day is live for 1 day only &#8212; score dark romance books for free</title>
      <link>https://mashable.com/article/stuff-your-kindle-day-dark-romance-books-for-free</link>
      <pubDate>Sat, 28 Feb 2026 13:31:39 +0000</pubDate>
      <guid isPermaLink="false">07E480Z455ePSP3dXuQjTgM</guid>
      <description>The latest Stuff Your Kindle Day is live on Feb. 28. Indulge in the Darkness is offering free dark romance books for one day only.</description>
    </item>
    <item>
      <title>Shokz OpenFit Pro Review: Open Earbuds With the One Thing You&#8217;ve Always Wanted</title>
      <link>https://gizmodo.com/shokz-openfit-pro-review-open-earbuds-with-the-one-thing-youve-always-wanted-2000727232</link>
      <pubDate>Sat, 28 Feb 2026 13:30:14 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000727232</guid>
      <description>Shokz OpenFit Pro envision a world where open-style earbuds have their own version of noise cancellation&#8212;and it actually feels possible.</description>
    </item>
    <item>
      <title>The DJI Osmo Pocket 4 just leaked again in a major way &#8212; and the launch of the vlogging camera can't be far off</title>
      <link>https://www.techradar.com/cameras/the-dji-osmo-pocket-4-just-leaked-again-in-a-major-way-and-the-launch-of-the-vlogging-camera-cant-be-far-off</link>
      <pubDate>Sat, 28 Feb 2026 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">V4V96TsNXAuRMuM4afR5v9</guid>
      <description>We now have what appears to be a quick start guide for the DJI Osmo Pocket 4 camera.</description>
    </item>
    <item>
      <title>How to watch India vs. West Indies in the 2026 T20 World Cup online for free</title>
      <link>https://mashable.com/article/india-west-indies-t20-world-cup-2026-live-stream-for-free</link>
      <pubDate>Sat, 28 Feb 2026 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">032qPMRs2l0IUh2wRjaCwB3</guid>
      <description>How to watch T20 World Cup for free. Live stream India vs. West Indies in the 2026 T20 World Cup for free from anywhere in the world.</description>
    </item>
  </channel>
</rss>
