<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 04 Feb 2026 09:51:35 GMT</lastBuildDate>
    <item>
      <title>Deux nouvelles failles de Chrome mettent en danger le navigateur, installez la mise &#224; jour</title>
      <link>https://www.01net.com/actualites/deux-nouvelles-failles-chrome-mettent-danger-navigateur-installez-mise-jour.html</link>
      <pubDate>Wed, 04 Feb 2026 09:47:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324058</guid>
      <description>Deux failles critiques viennent d&#8217;&#234;tre corrig&#233;es dans Chrome. Situ&#233;es dans le moteur V8 et dans une biblioth&#232;que vid&#233;o, elles peuvent aboutir &#224; des cyberattaques redoutables. Elles peuvent peuvent faire planter le navigateur ou permettre &#224; un pirate d&#8217;ex&#233;cuter du code &#224; distance sur votre ordinateur. Il est urgent d&#8217;installer la derni&#232;re mise &#224; jour de s&#233;curit&#233; d&#233;ploy&#233;e par Google....</description>
    </item>
    <item>
      <title>Windows 11 : pourquoi les joueurs devraient &#233;viter la derni&#232;re mise &#224; jour de janvier</title>
      <link>https://www.frandroid.com/os/windows/2965587_windows-11-pourquoi-les-joueurs-devraient-eviter-la-derniere-mise-a-jour-de-janvier</link>
      <pubDate>Wed, 04 Feb 2026 09:43:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/windows/2965587_windows-11-pourquoi-les-joueurs-devraient-eviter-la-derniere-mise-a-jour-de-janvier</guid>
      <description>
La mise &#224; jour Windows 11 de janvier 2026 continue de provoquer des bugs et chutes de performances chez de nombreux utilisateurs. Les joueurs sont aussi touch&#233;s et notamment les possesseurs de cartes graphiques Nvidia.
</description>
    </item>
    <item>
      <title>O&#249; est pass&#233;e ma voiture&#160;? Android Auto victime d&#8217;un bug tr&#232;s g&#234;nant</title>
      <link>https://www.01net.com/actualites/ou-est-passee-voiture-android-auto-victime-bug-tres-genant.html</link>
      <pubDate>Wed, 04 Feb 2026 09:43:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324062</guid>
      <description>Plusieurs utilisateurs d'Android Auto disent rencontrer un bug tr&#232;s probl&#233;matique qui fait dispara&#238;tre l'ic&#244;ne de leur voiture sur la carte.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs forfaits Orange ? Notre comparatif des offres mobiles et internet de l&#8217;op&#233;rateur en 2026</title>
      <link>https://www.frandroid.com/marques/1279963_orange-notre-avis-sur-les-offres-mobile-fibre-et-adsl-en-2023</link>
      <pubDate>Wed, 04 Feb 2026 09:40:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/1279963_orange-notre-avis-sur-les-offres-mobile-fibre-et-adsl-en-2023</guid>
      <description>
Ex-France T&#233;l&#233;com, devenu Orange, le premier op&#233;rateur historique a aujourd'hui une r&#233;putation de doyen sur le march&#233; des t&#233;l&#233;coms, en France et ailleurs. Avec une concurrence f&#233;roce &#224; c&#244;t&#233;, comment s'en sort l'op&#233;rateur ? Voici notre comparatif des meilleurs forfaits Orange, aussi bien mobiles qu'internet. 
</description>
    </item>
    <item>
      <title>Tesla fait machine arri&#232;re : l&#8217;appellation &#171;&#160;Standard&#160;&#187; dispara&#238;t du catalogue pour les Model 3 et Model Y</title>
      <link>https://www.frandroid.com/marques/tesla/2965519_tesla-fait-machine-arriere-lappellation-standard-disparait-du-catalogue-pour-les-model-3-et-model-y</link>
      <pubDate>Wed, 04 Feb 2026 09:38:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2965519_tesla-fait-machine-arriere-lappellation-standard-disparait-du-catalogue-pour-les-model-3-et-model-y</guid>
      <description>
Tesla revoit la nomenclature de ses voitures &#233;lectriques et fait dispara&#238;tre la mention Standard sur ses Model 3 et Model Y d'entr&#233;e de gamme.
</description>
    </item>
    <item>
      <title>Cette marque europ&#233;enne veut s&#8217;imposer en France avec un argument b&#233;ton pour remplacer vos AirTags et SmartTags</title>
      <link>https://www.frandroid.com/marques/chipolo/2941385_cette-marque-europeenne-veut-simposer-en-france-avec-un-argument-beton-pour-remplacer-vos-airtags-et-smarttags</link>
      <pubDate>Wed, 04 Feb 2026 09:35:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/chipolo/2941385_cette-marque-europeenne-veut-simposer-en-france-avec-un-argument-beton-pour-remplacer-vos-airtags-et-smarttags</guid>
      <description>
Chipolo est une marque europ&#233;enne qui fait concurrence aux AirTags et SmartTags. Or, elle est la seule &#224; proposer des balises compatibles avec les r&#233;seaux d'Apple et de Google et compte s'imposer durablement en France.
</description>
    </item>
    <item>
      <title>JBL Charge 6 : Amazon brade &#224; -40 % cette r&#233;f&#233;rence des enceintes Bluetooth juste apr&#232;s les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2809091_jbl-charge-6-amazon-brade-a-40-cette-reference-des-enceintes-bluetooth-juste-apres-les-soldes</link>
      <pubDate>Wed, 04 Feb 2026 09:34:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2809091_jbl-charge-6-amazon-brade-a-40-cette-reference-des-enceintes-bluetooth-juste-apres-les-soldes</guid>
      <description>
La JBL Charge 6 est une excellente enceinte Bluetooth que vous retrouvez &#224; 121,80 euros sur Amazon, contre 199,99 euros &#224; son lancement.
</description>
    </item>
    <item>
      <title>Anker SOLIX C2000 Gen 2&#160;: cette station &#233;lectrique de 2 kWh mise tout sur la l&#233;g&#232;ret&#233; et la vitesse</title>
      <link>https://www.01net.com/actualites/anker-solix-c2000-gen-2-cette-station-electrique-de-2-kwh-mise-tout-sur-la-legerete-et-la-vitesse.html</link>
      <pubDate>Wed, 04 Feb 2026 09:32:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324035</guid>
      <description>Anker d&#233;voile la SOLIX C2000 Gen 2 : une station de 2 048 Wh qui promet une recharge ultra-rapide et un poids plume. Sur le papier, elle a tout pour s&#233;duire les nomades comme les foyers s&#233;dentaires.</description>
    </item>
    <item>
      <title>265 000 km en Xiaomi SU7 : voici l&#8217;&#233;tat de la batterie de cette voiture &#233;lectrique apr&#232;s 18 mois</title>
      <link>https://www.frandroid.com/marques/xiaomi/2965487_265-000-km-en-xiaomi-su7-voici-letat-de-la-batterie-de-cette-voiture-electrique-apres-18-mois</link>
      <pubDate>Wed, 04 Feb 2026 09:31:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2965487_265-000-km-en-xiaomi-su7-voici-letat-de-la-batterie-de-cette-voiture-electrique-apres-18-mois</guid>
      <description>
Un propri&#233;taitre de Xiaomi SU7 a eu la bonne surprise de voir que la batterie de sa voiture &#233;lectrique affichait une capacit&#233; de 94,5&#160;% apr&#232;s 265 000 kilom&#232;tres parcourus. Une excellente performance qui devrait rassurer les clients.
</description>
    </item>
    <item>
      <title>Les Galaxy Buds 4, un design qui s&#8217;&#233;carte de celui des AirPods</title>
      <link>https://www.frandroid.com/produits-android/audio/ecouteurs-true-wireless/2965651_les-galaxy-buds-4-un-design-qui-secarte-de-celui-des-airpods</link>
      <pubDate>Wed, 04 Feb 2026 09:24:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/audio/ecouteurs-true-wireless/2965651_les-galaxy-buds-4-un-design-qui-secarte-de-celui-des-airpods</guid>
      <description>
Samsung s'appr&#234;te &#224; d&#233;voiler ses nouveaux &#233;couteurs sans fil Galaxy Buds 4 et Galaxy Buds 4 Pro, dont le design a fuit&#233; &#224; travers plusieurs sources. Si on en croit ces visuels, la marque cor&#233;enne op&#232;rerait un virage en abandonnant les lignes angulaires controvers&#233;es de la g&#233;n&#233;ration pr&#233;c&#233;dente.
</description>
    </item>
    <item>
      <title>Quels sont les meilleurs casques Bluetooth en 2026 ? Notre s&#233;lection</title>
      <link>https://www.frandroid.com/guide-dachat/guide-audio/457173_guide-dachat-les-meilleurs-casques-bluetooth-sans-fil-de-2017</link>
      <pubDate>Wed, 04 Feb 2026 09:20:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-audio/457173_guide-dachat-les-meilleurs-casques-bluetooth-sans-fil-de-2017</guid>
      <description>
Vous ne savez pas quel casque Bluetooth choisir dans cet oc&#233;an de r&#233;f&#233;rences ? Nous avons r&#233;alis&#233; une s&#233;lection des meilleurs casques audio Bluetooth parmi tous ceux que nous avons pu tester.
</description>
    </item>
    <item>
      <title>Ces 4 voitures &#233;lectriques chinoises Zeekr qui se rechargent ultra-rapidement arrivent en France et on a enfin la date officielle</title>
      <link>https://www.frandroid.com/marques/zeekr/2965563_ces-4-voitures-electriques-chinoises-zeekr-qui-se-rechargent-ultra-rapidement-arrivent-en-france-et-on-a-enfin-la-date-officielle</link>
      <pubDate>Wed, 04 Feb 2026 09:16:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/zeekr/2965563_ces-4-voitures-electriques-chinoises-zeekr-qui-se-rechargent-ultra-rapidement-arrivent-en-france-et-on-a-enfin-la-date-officielle</guid>
      <description>
Fond&#233;e en 2021, Zeekr va enfin faire son arriv&#233;e en France, d&#232;s 2026. Dans un premier temps, quatre voitures &#233;lectriques vont &#234;tre vendues chez nous, avec un prix de d&#233;part sous les 40 000 euros.
</description>
    </item>
    <item>
      <title>Nouvelle Xbox&#160;: AMD vend la m&#232;che sur la date de sortie</title>
      <link>https://www.01net.com/actualites/nouvelle-xbox-amd-vend-la-meche-sur-la-date-de-sortie.html</link>
      <pubDate>Wed, 04 Feb 2026 09:14:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324065</guid>
      <description>Malgr&#233; la domination &#233;crasante de la PS5, Microsoft pr&#233;pare bien une nouvelle Xbox de salon avec un SoC AMD, dont le d&#233;veloppement est jug&#233; &#171; en bonne voie &#187; pour un lancement possible en 2027.</description>
    </item>
    <item>
      <title>Iron Lung was a flop with Rotten Tomatoes critics &#8212; but its $21M box office debut is a huge win for independent horror</title>
      <link>https://www.techradar.com/streaming/entertainment/iron-lung-was-a-flop-with-rotten-tomatoes-critics-but-its-usd21m-box-office-debut-is-a-huge-win-for-independent-horror</link>
      <pubDate>Wed, 04 Feb 2026 09:10:05 +0000</pubDate>
      <guid isPermaLink="false">R2NNccAnBPswDiHwQzMJHU</guid>
      <description>Markiplier's directorial debut has proved that audiences have an appetite for independent horror</description>
    </item>
    <item>
      <title>Apple pousse encore plus loin le &#171;&#160;vibe coding&#160;&#187;</title>
      <link>https://www.01net.com/actualites/apple-pousse-encore-plus-loin-le-vibe-coding.html</link>
      <pubDate>Wed, 04 Feb 2026 09:01:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324029</guid>
      <description>Plus besoin de savoir programmer d&#233;sormais : l'IA s'occupe de tout, pour le meilleur comme pour le pire ! La pratique du &#171;&#160;vibe coding&#160;&#187; a rapidement trouv&#233; un espace chez les d&#233;veloppeurs d&#233;butants et m&#234;me aupr&#232;s des d&#233;veloppeurs plus aguerris. Apple embo&#238;te le pas avec une nouvelle version de Xcode qui laisse la main aux agents IA comme Codex ou Claude pour coder des apps....</description>
    </item>
    <item>
      <title>Google bient&#244;t forc&#233; de revendre Chrome malgr&#233; tout&#8201;?</title>
      <link>https://www.frandroid.com/marques/google/2965575_google-bientot-force-de-revendre-chrome-malgre-tout</link>
      <pubDate>Wed, 04 Feb 2026 08:55:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2965575_google-bientot-force-de-revendre-chrome-malgre-tout</guid>
      <description>
&#201;pargn&#233; par un jugement plut&#244;t tendre en 2025, Google pourrait bient&#244;t &#234;tre forc&#233; de revendre Chrome quand m&#234;me, puisque le minist&#232;re de la Justice a fait appel dans l&#8217;affaire de l&#8217;abus de position dominante de l&#8217;entreprise.
</description>
    </item>
    <item>
      <title>The Drama trailer has Zendaya and Robert Pattinson prepare for the most dramatic wedding ever</title>
      <link>https://mashable.com/video/a24-the-drama-trailer-zendaya-robert-pattinson</link>
      <pubDate>Wed, 04 Feb 2026 08:36:38 +0000</pubDate>
      <guid isPermaLink="false">00gbkPid3SoMWEFMbiEWkqh</guid>
      <description>A24 has released a new trailer for 'The Drama,' featuring Zendaya and Robert Pattinson as a couple approaching their wedding.</description>
    </item>
    <item>
      <title>Citro&#235;n coupe le prix de sa C3 Aircross&#160;: le SUV &#233;lectrique passe sous les 20&#160;000 euros</title>
      <link>https://www.01net.com/actualites/citroen-coupe-le-prix-de-sa-c3-aircross-le-suv-electrique-passe-sous-les-20-000-euros.html</link>
      <pubDate>Wed, 04 Feb 2026 08:30:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324020</guid>
      <description>Une hausse de la prime &#171;&#160;coup de pouce&#160;&#187;, une baisse du tarif constructeur, voil&#224; peut-&#234;tre ce qu&#8217;il fallait &#224; Citro&#235;n pour rendre son C3 Aircross vraiment int&#233;ressant.</description>
    </item>
    <item>
      <title>Gemini pourra bient&#244;t contr&#244;ler de votre smartphone Android</title>
      <link>https://www.01net.com/actualites/gemini-pourra-bientot-controler-de-votre-smartphone-android.html</link>
      <pubDate>Wed, 04 Feb 2026 08:28:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324059</guid>
      <description>Google travaille d&#8217;arrache-pied pour permettre &#224; Gemini de contr&#244;ler votre smartphone Android. Gemini sera bient&#244;t en mesure d&#8217;utiliser vos applications Android install&#233;es pour r&#233;aliser certaines t&#226;ches &#224; votre place.</description>
    </item>
    <item>
      <title>Steam Machine : la console de Valve arriverait tr&#232;s bient&#244;t</title>
      <link>https://www.frandroid.com/marques/valve/2965555_steam-machine-la-console-de-valve-arriverait-tres-bientot</link>
      <pubDate>Wed, 04 Feb 2026 08:26:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/valve/2965555_steam-machine-la-console-de-valve-arriverait-tres-bientot</guid>
      <description>
AMD avait la langue bien pendue lors de ses r&#233;sultats financiers. La marque a confirm&#233; que Valve devrait bien sortir sa Steam Machine dans les semaines &#224; venir.
</description>
    </item>
    <item>
      <title>Exclusive: Positron raises $230M Series B to take on Nvidia&#8217;s AI chips</title>
      <link>https://techcrunch.com/2026/02/04/exclusive-positron-raises-230m-series-b-to-take-on-nvidias-ai-chips/</link>
      <pubDate>Wed, 04 Feb 2026 08:18:51 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3089440</guid>
      <description>The investment comes from backers including the Qatar Investment Authority as demand for chips beyond Nvidia soars and as Qatar aims to build out its AI infrastructure.</description>
    </item>
    <item>
      <title>Les Samsung Galaxy Buds 3 Pro passent de 249 &#8364; &#224; 89 &#8364; juste apr&#232;s les soldes : ces excellents &#233;couteurs not&#233;s 9/10 sont le super deal du jour</title>
      <link>https://www.frandroid.com/bons-plans/2895255_les-samsung-galaxy-buds-3-pro-passent-de-249-a-89-juste-apres-les-soldes-ces-excellents-ecouteurs-notes-9-10-sont-le-super-deal-du-jour</link>
      <pubDate>Wed, 04 Feb 2026 08:18:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2895255_les-samsung-galaxy-buds-3-pro-passent-de-249-a-89-juste-apres-les-soldes-ces-excellents-ecouteurs-notes-9-10-sont-le-super-deal-du-jour</guid>
      <description>
Les Galaxy Buds 3 Pro de Samsung offrent une excellente prestation digne des meilleurs &#233;couteurs du march&#233;. Si ces derniers vous int&#233;ressent, c'est le bon moment de craquer : ils sont en promotion &#224; 89 euros contre 249 euros de base.
</description>
    </item>
    <item>
      <title>Bridgerton Season 4 Part 2 trailer teases a steamy bath scene</title>
      <link>https://mashable.com/video/bridgerton-season-4-teaser-trailer-netflix</link>
      <pubDate>Wed, 04 Feb 2026 08:18:18 +0000</pubDate>
      <guid isPermaLink="false">01M5mTVdoR9OEz60eboqW24</guid>
      <description>Netflix's "Bridgerton" Season 4 Part 2 trailer teases a bathtub scene between Benedict Bridgerton (Luke Thompson) and Sophie Baek (Yerin Ha).</description>
    </item>
    <item>
      <title>Microsoft propose une solution pour r&#233;concilier les &#233;diteurs de presse et l&#8217;IA g&#233;n&#233;rative</title>
      <link>https://www.01net.com/actualites/microsoft-propose-un-marche-pour-reconcilier-les-editeurs-de-presse-et-lia-generative.html</link>
      <pubDate>Wed, 04 Feb 2026 08:01:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324019</guid>
      <description>Pour qu'un chatbot IA puisse donner une information pr&#233;cise et fiable, il faut que les sources avec lesquelles son mod&#232;le a &#233;t&#233; entra&#238;n&#233; soit de la meilleure qualit&#233; possible. Les entreprises de l'IA sont friandes de ces sources, et il leur arrive assez souvent de ne pas demander la permission pour &#171; emprunter &#187; les articles &#224; haute valeur ajout&#233;e des publications en ligne. Microsoft propose une solution sous la forme d'un &#171; march&#233; de contenus&#160;&#187; qui, sur le papier, pourrait g&#233;n&#233;rer un certain int&#233;r&#234;t de la part des &#233;diteurs....</description>
    </item>
    <item>
      <title>How to buy a GPU in 2026</title>
      <link>https://www.engadget.com/gaming/pc/how-to-buy-a-gpu-160100017.html?src=rss</link>
      <pubDate>Wed, 04 Feb 2026 08:00:35 +0000</pubDate>
      <guid isPermaLink="false">7676f70e-877d-4293-afe3-fdbc21e98c7c</guid>
      <description>One of the toughest parts of any new computer build or upgrade is finding the right video card. In a gaming PC, the GPU is easily the most important part, and you can limit your experience by going with the wrong model. The buying process can be frustrating, especially right now with memory shortages leading to higher prices. In this guide, we'll help you navigate the market and find the right GPU for your needs.
It's all about the games
The first question to ask yourself is what kind of games do you want to play. Competitive shooters like Valorant, Overwatch and Marvel Rivals were designed to...</description>
    </item>
    <item>
      <title>More turn to astrology for career advice: &#8216;It&#8217;s very Scorpio of me&#8217;</title>
      <link>https://www.fastcompany.com/91469988/more-turn-to-astrology-for-career-advice-its-very-scorpio-of-me</link>
      <pubDate>2026-02-04T08:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91469988/more-turn-to-astrology-for-career-advice-its-very-scorpio-of-me</guid>
      <description>How astrology, an industry worth billions and whose popularity is booming, gives some workers spiritual guidance they believe helps them on the job.
When New York-based Autumn Myers, 31, was interviewing for her current digital marketing job, she pushed back the interview date so it didn&#8217;t fall during Mercury retrograde. &#8220;Those jobs have always ended up in more grief for me,&#8221; she tells Fast Company.&#160;...</description>
    </item>
    <item>
      <title>Ces 3 smartphones Samsung Galaxy sont d&#233;sormais priv&#233;s de mises &#224; jour</title>
      <link>https://www.01net.com/actualites/3-smartphones-samsung-desormais-prives-mises-jour.html</link>
      <pubDate>Wed, 04 Feb 2026 07:56:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324056</guid>
      <description>Samsung tourne la page des Galaxy S21 : les S21, S21+ et S21 Ultra. Lanc&#233;s il y a cinq ans, les trois smartphones sont d&#233;sormais priv&#233;s de mises &#224; jour. La gamme est arriv&#233;e au bout des promesses de la marque en mati&#232;re de support logiciel.</description>
    </item>
    <item>
      <title>Tout suspendu et seulement 17 kg : ce gravel &#233;lectrique fait dans l&#8217;in&#233;dit</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2965151_tout-suspendu-et-seulement-17-kg-ce-gravel-electrique-fait-dans-linedit</link>
      <pubDate>Wed, 04 Feb 2026 07:52:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2965151_tout-suspendu-et-seulement-17-kg-ce-gravel-electrique-fait-dans-linedit</guid>
      <description>
Proche d'un VTTAE, le Salsa Wanderosa est en fait un v&#233;lo gravel &#233;lectrique qui s&#8217;aventure sur le tout-terrain gr&#226;ce &#224; une double suspension, le tout avec une assistance l&#233;g&#232;re Fazua afin de garder un poids de 17 kg.
</description>
    </item>
  </channel>
</rss>
