<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 20 Jan 2026 15:36:34 GMT</lastBuildDate>
    <item>
      <title>Gaming More Than 10 Hours a Week? You&#8217;ll Want to Read This</title>
      <link>https://gizmodo.com/gaming-more-than-10-hours-a-week-youll-want-to-read-this-2000711944</link>
      <pubDate>Tue, 20 Jan 2026 15:35:08 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711944</guid>
      <description>Here's what scientists discovered when they investigated the health of three types of video gamers in Australia.</description>
    </item>
    <item>
      <title>Corsair&#8217;s wired Hall effect gaming keyboard is cheaper than ever</title>
      <link>https://www.theverge.com/gadgets/864339/corsair-hall-effect-gaming-keyboard-resident-evil-requiem-surface-laptop-deal-sale</link>
      <pubDate>2026-01-20T10:35:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864339</guid>
      <description>Hall effect switches are the most customizable and fastest you can currently get in a gaming keyboard. As such, they don&#8217;t usually come cheap. However, they&#8217;re fairly affordable to upgrade to today thanks to a deal on Corsair&#8217;s Vanguard Pro 96, which is cheaper than ever at Amazon and Best Buy, selling for $159.99 (originally [&#8230;]</description>
    </item>
    <item>
      <title>Boulanger propose de v&#233;ritables p&#233;pites juste avant la 3e d&#233;marque</title>
      <link>https://www.frandroid.com/bons-plans/2931541_boulanger-continue-de-casser-les-prix-pendant-les-soldes-voici-les-16-deals-a-saisir</link>
      <pubDate>Tue, 20 Jan 2026 15:31:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931541_boulanger-continue-de-casser-les-prix-pendant-les-soldes-voici-les-16-deals-a-saisir</guid>
      <description>
Nouvelle semaine, nouvelles affaires&#8201;! Boulanger frappe fort avec des baisses de prix encore plus importantes &#224; l&#8217;approche de la troisi&#232;me d&#233;marque. Les r&#233;ductions se multiplient, et certaines offres valent vraiment le d&#233;tour. D&#233;couvrez celles qui m&#233;ritent votre attention &#8212; et votre argent.
</description>
    </item>
    <item>
      <title>X (Twitter) publie enfin l&#8217;algorithme &#224; jour du r&#233;seau social</title>
      <link>https://www.frandroid.com/culture-tech/web/2949015_x-twitter-publie-enfin-lalgorithme-a-jour-du-reseau-social</link>
      <pubDate>Tue, 20 Jan 2026 15:27:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/web/2949015_x-twitter-publie-enfin-lalgorithme-a-jour-du-reseau-social</guid>
      <description>
Presque 3 ans apr&#232;s la derni&#232;re publication, X met &#224; jour le code open source de son algorithme de recommandations.
</description>
    </item>
    <item>
      <title>On a approch&#233; le Huawei Mate X7&#160;: le pliant qui d&#233;fie les photophones (et Google)</title>
      <link>https://www.01net.com/actualites/on-a-approche-le-huawei-mate-x7-le-pliant-qui-defie-les-photophones-et-google.html</link>
      <pubDate>Tue, 20 Jan 2026 15:26:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321229</guid>
      <description>Nous avons pu approcher le Huawei Mate X7, le dernier fleuron pliant du g&#233;ant chinois attendu en France pour f&#233;vrier 2026. S'il c&#232;de la couronne de la finesse absolue &#224; Honor et Samsung, il riposte avec un argument massue : un &#233;quipement photo avanc&#233;.</description>
    </item>
    <item>
      <title>NymVPN fixes bugs and boosts censorship resistance with latest update</title>
      <link>https://www.techradar.com/vpn/vpn-services/nymvpn-fixes-bugs-and-boosts-censorship-resistance-with-latest-update</link>
      <pubDate>Tue, 20 Jan 2026 15:23:50 +0000</pubDate>
      <guid isPermaLink="false">9Yz6VY8TnAAqrn5dMvB3va</guid>
      <description>The privacy-first VPN smoothes out the rough edges on Android and macOS in its first update of the year. Here's all you need to know.</description>
    </item>
    <item>
      <title>Cette nouvelle montre ultrafine tient plus de 3 semaines avec un prix d&#233;fiant toute concurrence</title>
      <link>https://www.frandroid.com/actualites-generales/2949133_cette-nouvelle-montre-ultrafine-tient-plus-de-3-semaines-avec-un-prix-defiant-toute-concurrence</link>
      <pubDate>Tue, 20 Jan 2026 15:23:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2949133_cette-nouvelle-montre-ultrafine-tient-plus-de-3-semaines-avec-un-prix-defiant-toute-concurrence</guid>
      <description>
&#192; l'occasion du lancement de son nouveau smartphone Magic 8 Pro Air, Honor a &#233;galement lev&#233; le voile sur une nouvelle montre connect&#233;e &#224; longue autonomie, la Honor Watch GS 5. 
</description>
    </item>
    <item>
      <title>Threat hunters can&#8217;t waste time stumbling in the dark &#8211; they need real observability</title>
      <link>https://www.techradar.com/pro/threat-hunters-cant-waste-time-stumbling-in-the-dark-they-need-real-observability</link>
      <pubDate>Tue, 20 Jan 2026 15:16:39 +0000</pubDate>
      <guid isPermaLink="false">tmCY8Yni5fsvCGbWnbsJTh</guid>
      <description>Attackers exploit blind spots, noise, and delay. Only deep observability exposes them in time.</description>
    </item>
    <item>
      <title>&#8216;A Knight of the Seven Kingdoms&#8217; Star Daniel Ings on Bringing a Westeros Legend to Life</title>
      <link>https://gizmodo.com/knight-of-the-seven-kingdoms-daniel-ings-interview-lyonel-baratheon-2000711139</link>
      <pubDate>Tue, 20 Jan 2026 15:15:34 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711139</guid>
      <description>Ser Lyonel Baratheon makes a big impression in the first episode of HBO's new 'Game of Thrones' spin-off.</description>
    </item>
    <item>
      <title>New botnet targets HPE OneView vulnerability, so patch now</title>
      <link>https://www.techradar.com/pro/security/new-botnet-targets-hpe-oneview-vulnerability-so-patch-now</link>
      <pubDate>Tue, 20 Jan 2026 15:15:00 +0000</pubDate>
      <guid isPermaLink="false">Q7waAq4yC4h8nZBFF52smQ</guid>
      <description>A critical-level flaw is being abused to expand the RondoDox botnet, experts have warned.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs TV 4K 55 pouces (OLED, QLED, LCD) en 2026&#8201;?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-tv/634882_quelles-sont-les-meilleures-tv-4k-hdr-de-55-pouces-en-2019</link>
      <pubDate>Tue, 20 Jan 2026 15:03:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-tv/634882_quelles-sont-les-meilleures-tv-4k-hdr-de-55-pouces-en-2019</guid>
      <description>
La cat&#233;gorie 55&#160;pouces reste l'un des choix les plus populaires pour les t&#233;l&#233;viseurs. Voici notre s&#233;lection des meilleurs TV de 55&#160;pouces &#224; tous les prix, qu'elles soient OLED, Mini LED ou LCD, mais toujours en 4K HDR.
</description>
    </item>
    <item>
      <title>L&#8217;&#233;norme boulette de Microsoft dans sa derni&#232;re publicit&#233; pour Windows 11</title>
      <link>https://www.frandroid.com/marques/microsoft/2949079_lenorme-boulette-de-microsoft-dans-sa-derniere-publicite-pour-windows-11</link>
      <pubDate>Tue, 20 Jan 2026 15:03:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2949079_lenorme-boulette-de-microsoft-dans-sa-derniere-publicite-pour-windows-11</guid>
      <description>
C'est l'histoire de l'arroseur arros&#233;, ou plut&#244;t du g&#233;ant de la tech qui tr&#233;buche sur ses propres lacets marketing. Microsoft a publi&#233; une vid&#233;o vantant Windows 11, mais un d&#233;tail g&#234;nant n'a pas &#233;chapp&#233; aux yeux de lynx des internautes, for&#231;ant l'entreprise &#224; sortir la gomme num&#233;rique en catastrophe.
</description>
    </item>
    <item>
      <title>Amazon&#8217;s CEO says tariffs are starting to &#8216;creep into&#8217; pricing</title>
      <link>https://www.theverge.com/news/864390/amazon-ceo-andy-jassy-tariffs-creep-into-pricing</link>
      <pubDate>2026-01-20T10:01:40-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864390</guid>
      <description>Amazon CEO Andy Jassy says consumers are starting to see the impact of tariffs less than a year after President Donald Trump implemented sweeping fees on a range of imported goods. During an interview with CNBC, Jassy says the inventory Amazon and third-party sellers prebought in early 2025 to keep prices low has "run out," [&#8230;]</description>
    </item>
    <item>
      <title>Fnac et Darty se montrent bien g&#233;n&#233;reux la veille de la 3e d&#233;marque : les 17 deals des soldes qui valent le coup</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-liquident-leurs-stocks-avant-la-3e-demarque-des-soldes</link>
      <pubDate>Tue, 20 Jan 2026 15:00:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-liquident-leurs-stocks-avant-la-3e-demarque-des-soldes</guid>
      <description>
&#192; la veille de la troisi&#232;me d&#233;marque des soldes, la Fnac et Darty relancent la chasse aux bonnes affaires&#8201;! Les deux enseignes appliquent de nouvelles baisses, notamment sur l&#8217;iPad&#8201;Pro&#8201;M2 de&#8201;&#8201;2 To propos&#233; &#224; un tarif encore plus all&#233;chant. Une belle opportunit&#233; de se faire plaisir. 
</description>
    </item>
    <item>
      <title>Les spectateurs de Netflix peuvent d&#233;sormais voter en temps r&#233;el</title>
      <link>https://www.01net.com/actualites/les-spectateurs-de-netflix-peuvent-desormais-voter-en-temps-reel.html</link>
      <pubDate>Tue, 20 Jan 2026 15:00:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320975</guid>
      <description>Les contenus en direct diffus&#233;s par Netflix vont &#234;tre bien plus interactifs. La plateforme de streaming inaugure en effet aujourd'hui un nouveau syst&#232;me de vote en temps r&#233;el qui permet aux spectateurs d'influer sur le d&#233;roulement du programme.</description>
    </item>
    <item>
      <title>Netflix is rolling out a live voting feature</title>
      <link>https://techcrunch.com/2026/01/20/netflix-is-rolling-out-a-live-voting-feature/</link>
      <pubDate>Tue, 20 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083735</guid>
      <description>Netflix said it the feature will be available globally and it will tally votes in real-time</description>
    </item>
    <item>
      <title>Quordle hints and answers for Wednesday, January 21 (game #1458)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-21-january-2026</link>
      <pubDate>Tue, 20 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">JX46fYoGYsHCLAKDGL6REL</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Wednesday, January 21 (game #955)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-21-january-2026</link>
      <pubDate>Tue, 20 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">rFyMzC8TUZcVNzApE55WbC</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Wednesday, January 21 (game #689)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-21-january-2026</link>
      <pubDate>Tue, 20 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">8YCnxobF3HZ4ReoNSmhxrE</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Simplifying your business response to worst-case scenarios</title>
      <link>https://www.techradar.com/pro/simplifying-your-business-response-to-worst-case-scenarios</link>
      <pubDate>Tue, 20 Jan 2026 14:59:19 +0000</pubDate>
      <guid isPermaLink="false">gsxjJX5FELjFGKqdwFiWyR</guid>
      <description>Mathematical optimization is built for exploring unique and developing scenarios we've never seen before, to strengthen adaptability, efficiency, and nimbleness of businesses.</description>
    </item>
    <item>
      <title>Ce pack Honor hyper complet (smartphone + tablette + true wireless) chute sous les 600 &#8364; pendant les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2948995_ce-pack-honor-hyper-complet-smartphone-tablette-true-wireless-chute-sous-les-600-e-pendant-les-soldes</link>
      <pubDate>Tue, 20 Jan 2026 14:58:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2948995_ce-pack-honor-hyper-complet-smartphone-tablette-true-wireless-chute-sous-les-600-e-pendant-les-soldes</guid>
      <description>
Pendant les soldes d'hiver, le Honor 400, la Honor Pad 10 et les Honor Choice Earbuds S8 se retrouvent dans un pack au prix tr&#232;s avantageux : 599,90 euros au lieu de 879,70 euros sur le site officiel du fabricant.
</description>
    </item>
    <item>
      <title>Meta's Oversight Board is looking into transparency around disabling accounts</title>
      <link>https://www.engadget.com/big-tech/metas-oversight-board-is-looking-into-transparency-around-disabling-accounts-145757717.html?src=rss</link>
      <pubDate>Tue, 20 Jan 2026 14:57:57 +0000</pubDate>
      <guid isPermaLink="false">933a656e-cf6e-4aab-909c-35fa339ad8ce</guid>
      <description>Meta has a lot of work to do when it comes to limiting hate speech on its platforms. Now, its Oversight Board is looking into the company's decision to ban an account for, among other things, posting visual violent threats and harassment against a journalist &#8212; and it wants the public's advice.&#160;
In the year prior to the ban, Meta referred five posts due to violations of its hateful conduct, bullying and harassment, violence and incitement and adult nudity and sexual activity community standards. In addition to the posts harassing the woman journalist, the user also shared "anti-gay slurs agains...</description>
    </item>
    <item>
      <title>I found the 5 most blatant iPhone 17 clones, and I can't believe they're actually real</title>
      <link>https://www.techradar.com/phones/iphone/i-found-the-5-most-blatant-iphone-17-clones-and-i-cant-believe-theyre-actually-real</link>
      <pubDate>Tue, 20 Jan 2026 14:50:11 +0000</pubDate>
      <guid isPermaLink="false">mSDa8m2SmPwUBbn4GVtuzf</guid>
      <description>Apple still sets the trends when it comes to phone design &#8211; and these cheeky clones are all the proof we need</description>
    </item>
    <item>
      <title>Cette temp&#234;te solaire a d&#233;clench&#233; une cascade d&#8217;alertes in&#233;dites depuis plus de 20 ans et ce n&#8217;est peut-&#234;tre pas fini</title>
      <link>https://www.futura-sciences.com/sciences/actualites/aurore-boreale-cette-tempete-solaire-declenche-cascade-alertes-inedites-depuis-plus-20-ans-ce-nest-peut-etre-pas-fini-130359/#xtor%3DRSS-8</link>
      <pubDate>Tue, 20 Jan 2026 15:47:24 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/aurore-boreale-cette-tempete-solaire-declenche-cascade-alertes-inedites-depuis-plus-20-ans-ce-nest-peut-etre-pas-fini-130359/#xtor%3DRSS-8</guid>
      <description>La Terre est actuellement sous le feu de l&#8217;un des bombardements les plus puissants que le Soleil puisse engendrer. Le choc avec les particules solaires a affol&#233; les chiffres. Des pr&#233;cautions ont d&#251; &#234;tre prises. Et ce n&#8217;est peut-&#234;tre pas termin&#233;&#8230;</description>
    </item>
    <item>
      <title>'19 minutes and 31 seconds later, I had a new 5K PB &#8212; one almost a full minute better than I&#8217;d ever achieved before': our writer tried a robotic exoskeleton and ended up setting himself a new running record</title>
      <link>https://www.techradar.com/health-fitness/19-minutes-and-31-seconds-later-i-had-a-new-5k-pb-one-almost-a-full-minute-better-than-id-ever-achieved-before-our-writer-tried-a-robotic-exoskeleton-and-ended-up-setting-himself-a-new-running-record</link>
      <pubDate>Tue, 20 Jan 2026 14:42:14 +0000</pubDate>
      <guid isPermaLink="false">NQUL4EmakcUkFxihyq3cAJ</guid>
      <description>Does your running PB count if you run like Robocop? Our writer got to grips with the Hypershell X Ultra exoskeleton</description>
    </item>
    <item>
      <title>The Fed&#8217;s Jerome Powell plans to attend Supreme Court argument on Lisa Cook case, says source</title>
      <link>https://www.fastcompany.com/91477591/feds-jerome-powell-plans-attend-supreme-court-argument-lisa-cook-case-says-source</link>
      <pubDate>2026-01-20T14:37:34</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91477591/feds-jerome-powell-plans-attend-supreme-court-argument-lisa-cook-case-says-source</guid>
      <description>The Supreme Court is considering whether President Trump can fire Federal Reserve governor Lisa Cook.
Federal Reserve Chair Jerome Powell will attend the Supreme Court&#8217;s oral argument Wednesday in a case involving the attempted firing of Fed governor Lisa Cook, an unusual show of support by the central bank chair.The high court is considering whether President Donald Trump can fire Cook, as he said he would do in late August, in an unprecedented attempt to remove one of the seven members of the Fed&#8217;s governing board. Powell plans to attend the high court&#8217;s Wednesday session, according to a per...</description>
    </item>
    <item>
      <title>This Audible deal ends soon: Get three months of access for only $3</title>
      <link>https://www.engadget.com/deals/this-audible-deal-ends-soon-get-three-months-of-access-for-only-3-193859839.html?src=rss</link>
      <pubDate>Tue, 20 Jan 2026 14:31:26 +0000</pubDate>
      <guid isPermaLink="false">a8d99938-0b9f-4c17-b1d6-b88b320bc1cc</guid>
      <description>One way to read more in the new year is to incorporate audiobooks as part of your reading habit. Audible is having a sale right now that makes that easier and cheaper to do: you can get three months of access for only $1 per month, or a total of $3. The promotion runs through January 21.
An Audible subscription grants one audiobook per month to keep. This can be selected from a massive catalog of new releases and bestsellers. The collection here has just about everything. 


However, it's easy to plow through a single book in a month. Users also get streaming access to thousands of curated tit...</description>
    </item>
    <item>
      <title>Test de l&#8217;&#233;cran TCL 27G64 : le Mini-LED sur PC enfin abordable !</title>
      <link>https://www.frandroid.com/marques/tcl/2934029_test-de-lecran-tcl-27g64-le-mini-led-sur-pc-enfin-abordable</link>
      <pubDate>Tue, 20 Jan 2026 14:28:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tcl/2934029_test-de-lecran-tcl-27g64-le-mini-led-sur-pc-enfin-abordable</guid>
      <description>
D'ann&#233;e en ann&#233;e, on voit &#233;voluer les technologies de nos &#233;crans sur PC. On est pass&#233; par du LCD avec l'IPS et le VA, maintenant de l'OLED, du QD-OLED, mais quid du Mini-LED ? M&#234;me si la technologie n'est pas nouvelle, surtout sur t&#233;l&#233;viseur, elle n'est pas des plus communes pour autant sur PC. On teste donc ce TCL 27G64 pour exp&#233;rimenter une nouvelle fois ce type de dalle.
...</description>
    </item>
    <item>
      <title>Sony et TCL s&#8217;associent pour cr&#233;er une coentreprise dans le divertissement &#224; domicile</title>
      <link>https://www.frandroid.com/marques/sony/2949047_sony-et-tcl-sassocient-pour-creer-une-coentreprise-dans-le-divertissement-a-domicile</link>
      <pubDate>Tue, 20 Jan 2026 14:26:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2949047_sony-et-tcl-sassocient-pour-creer-une-coentreprise-dans-le-divertissement-a-domicile</guid>
      <description>
Sony Corporation et TCL Electronics Holdings Limited ont annonc&#233; la signature d'un protocole d'accord pour la cr&#233;ation d'une coentreprise reprenant l'activit&#233; Home Entertainment de Sony. TCL d&#233;tiendra 51% du capital tandis que Sony conservera 49%, avec un d&#233;marrage des activit&#233;s pr&#233;vu en avril 2027 sous r&#233;serve des approbations r&#233;glementaires.
</description>
    </item>
    <item>
      <title>Tremblement de terre&#160;: TCL met la main sur les t&#233;l&#233;viseurs Sony</title>
      <link>https://www.01net.com/actualites/tremblement-de-terre-tcl-met-la-main-sur-les-televiseurs-sony.html</link>
      <pubDate>Tue, 20 Jan 2026 14:25:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321258</guid>
      <description>Sony est une place forte sur le march&#233; du t&#233;l&#233;viseur, et le groupe japonais le restera dans les ann&#233;es &#224; venir&#8230; mais probablement un peu moins. Le constructeur est en effet formellement entr&#233; en discussion avec TCL pour cr&#233;er une coentreprise charg&#233;e de reprendre son activit&#233; de divertissement domestique &#8212; y compris les t&#233;l&#233;viseurs Bravia.</description>
    </item>
    <item>
      <title>EU members consider the &#8216;trade bazooka&#8217; to handle Trump&#8217;s tariffs threats over Greenland</title>
      <link>https://www.fastcompany.com/91477596/eu-members-consider-trade-bazooka-handle-trumps-tariffs-threats-over-greenland</link>
      <pubDate>2026-01-20T14:22:22</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91477596/eu-members-consider-trade-bazooka-handle-trumps-tariffs-threats-over-greenland</guid>
      <description>The European Union could use the Anti-Coercion Instrument to sanction Washington.
French President Emmanuel Macron says the European Union &#8220;should not hesitate&#8221; to use the trade bloc&#8217;s Anti-Coercion Instrument in face of U.S. President Donald Trump&#8217;s tariff threats over Greenland.</description>
    </item>
    <item>
      <title>Game Pass en janvier 2026 : on commence l&#8217;ann&#233;e avec du lourd dans cette premi&#232;re s&#233;lection de 2026 !</title>
      <link>https://www.frandroid.com/marques/microsoft/2931685_game-pass-en-janvier-2026-on-commence-lannee-avec-du-lourd-dans-cette-premiere-selection-de-2026</link>
      <pubDate>Tue, 20 Jan 2026 14:18:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2931685_game-pass-en-janvier-2026-on-commence-lannee-avec-du-lourd-dans-cette-premiere-selection-de-2026</guid>
      <description>
Microsoft vient de d&#233;voiler la premi&#232;re s&#233;lection de 2026 pour son Game Pass. Plus d'une dizaine de jeux sont &#224; l'honneur entre les titres AAA et quelques jeux ind&#233;s. Voici ce qui vous occupera les prochaines semaines.
</description>
    </item>
    <item>
      <title>Mode furtif et ch&#226;ssis blind&#233; : Garmin d&#233;voile la montre ultime pour les militaires, mais pas seulement</title>
      <link>https://www.frandroid.com/actualites-generales/2949031_mode-furtif-et-chassis-blinde-garmin-devoile-la-montre-ultime-pour-les-militaires-mais-pas-seulement</link>
      <pubDate>Tue, 20 Jan 2026 14:11:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2949031_mode-furtif-et-chassis-blinde-garmin-devoile-la-montre-ultime-pour-les-militaires-mais-pas-seulement</guid>
      <description>
Garmin a annonc&#233; le lancement de sa nouvelle Tactix 8 Cerakote. Comme le mod&#232;le classique, il s'agit d'une montre haut de gamme pens&#233;e avant tout pour un usage militaire. 
</description>
    </item>
    <item>
      <title>Cartes graphiques : pr&#233;parez-vous &#224; une longue travers&#233;e du d&#233;sert chez Nvidia et AMD</title>
      <link>https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2948849_cartes-graphiques-preparez-vous-a-une-longue-traversee-du-desert-chez-nvidia-et-amd</link>
      <pubDate>Tue, 20 Jan 2026 14:06:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2948849_cartes-graphiques-preparez-vous-a-une-longue-traversee-du-desert-chez-nvidia-et-amd</guid>
      <description>
Il faudra &#234;tre patient, tr&#232;s patient, avant de voir arriver de nouvelles cartes graphiques sur le march&#233;.
</description>
    </item>
    <item>
      <title>What are tokenized securities? Risks and what to know as stock exchange NYSE embraces the blockchain</title>
      <link>https://www.fastcompany.com/91477563/nyse-tokenized-securities-risks-meaning-stock-exchange-embraces-blockchain</link>
      <pubDate>2026-01-20T14:05:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91477563/nyse-tokenized-securities-risks-meaning-stock-exchange-embraces-blockchain</guid>
      <description>The biggest shift would be the introduction of 24/7 trading, much like Bitcoin investors currently enjoy, but some have urged the SEC to tread carefully.
The blockchain is coming to Wall Street.</description>
    </item>
    <item>
      <title>How to qualify for the new and exclusive Lego Mini Pok&#233;mon Center</title>
      <link>https://mashable.com/article/lego-mini-pokemon-center</link>
      <pubDate>Tue, 20 Jan 2026 14:04:51 +0000</pubDate>
      <guid isPermaLink="false">04GKTWmpQWzYgy2HTh2ijKC</guid>
      <description>The first-ever Lego Pok&#233;mon sets have been announced. The new Lego Mini Pok&#233;mon Center is only available as a Lego Insiders Reward.</description>
    </item>
    <item>
      <title>Soldes montres connect&#233;es : 13 promotions pour &#234;tre &#224; l&#8217;heure &#224; ses s&#233;ances de sport ! Voici notre top des meilleurs bons plans</title>
      <link>https://www.frandroid.com/bons-plans/2937331_soldes-montres-connectees-13-promotions-pour-etre-a-lheure-a-ses-seances-de-sport-voici-notre-top-des-meilleurs-bons-plans</link>
      <pubDate>Tue, 20 Jan 2026 14:02:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2937331_soldes-montres-connectees-13-promotions-pour-etre-a-lheure-a-ses-seances-de-sport-voici-notre-top-des-meilleurs-bons-plans</guid>
      <description>
Les soldes d'hiver permettent de faire de bonnes affaires sur de nombreux produits Tech, dont les montres connect&#233;es ! Ces accessoires lifestyle &amp; sport profitent eux aussi d&#8217;une vague de promotions : voici les offres &#224; retenir. 
</description>
    </item>
    <item>
      <title>Le g&#233;ant de l&#8217;informatique Capgemini va tailler dans ses effectifs fran&#231;ais</title>
      <link>https://www.01net.com/actualites/le-geant-de-linformatique-capgemini-va-tailler-dans-ses-effectifs-francais.html</link>
      <pubDate>Tue, 20 Jan 2026 14:01:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321233</guid>
      <description>Le leader du conseil informatique explique &#234;tre contraint de se transformer, du fait de l'IA et du contexte &#233;conomique morose.</description>
    </item>
    <item>
      <title>Netflix revises offer to pay all cash for Warner Bros to stave off Paramount</title>
      <link>https://techcrunch.com/2026/01/20/netflix-revises-offer-to-pay-all-cash-for-warner-bros-to-stave-off-paramount/</link>
      <pubDate>Tue, 20 Jan 2026 14:00:40 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083741</guid>
      <description>However, the streaming giant is still offering the same $27.75 the companies had agreed on for WBD's movie studio and streaming assets, and the deal continues to value the company at $82.7 billion.</description>
    </item>
    <item>
      <title>British Sci-Fi Legend &#8216;Blake&#8217;s 7&#8217; Might Get the Reboot Treatment</title>
      <link>https://gizmodo.com/blakes-7-reboot-peter-hoar-last-of-us-2000711587</link>
      <pubDate>Tue, 20 Jan 2026 14:00:09 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711587</guid>
      <description>Plus, Sam Esmail's mystery new movie gets a big cast update.</description>
    </item>
    <item>
      <title>New Prime Video thriller Steal is a heart-stopping high-stakes cash heist &#8212; but stick with the sloppy middle to get a gratifying payoff</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/steal-review</link>
      <pubDate>Tue, 20 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">wAarCMVVbJMGRv4BUrDCjE</guid>
      <description>I&#8217;ve never wanted to work in finance less after watching new Prime Video thriller Steal &#8212; but after this traumatic binge, I can probably add trade processing to my CV.</description>
    </item>
    <item>
      <title>Adobe unveils new AI-powered video editing tools for Premiere</title>
      <link>https://www.engadget.com/ai/adobe-unveils-new-ai-powered-video-editing-tools-for-premiere-140000970.html?src=rss</link>
      <pubDate>Tue, 20 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">cf95748e-44a1-4996-b2bd-fb254f9e5267</guid>
      <description>Adobe has announced updates for Premiere and After Effects, including new AI-powered tools that are meant to speed up your video editing tasks. In Premiere, the company&#8217;s video-editing software, it has unveiled a new AI-powered Object Mask feature that lets you easily pick and track persons or objects moving through your video clips. You simply have to hover over that object and click to generate a mask overlay in seconds. While the mask is supposed to be accurate from the start, you can adjust and resize it as needed. Adobe says the feature uses its own AI model for the feature and that the p...</description>
    </item>
    <item>
      <title>Vie au travail | Mon patron est fou de l&#8217;IA, mais je ne veux rien en savoir</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-01-20/vie-au-travail/mon-patron-est-fou-de-l-ia-mais-je-ne-veux-rien-en-savoir.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Tue, 20 Jan 2026 09:00:00 -0500</pubDate>
      <guid isPermaLink="false">97c58f44d4393346ba861f19a4a24b4c</guid>
      <description>Q. Je suis cadre interm&#233;diaire dans une grande entreprise, j&#8217;ai atteint mon plafond professionnel et j&#8217;en ai encore pour 10&#160;ans avant la retraite. Mon approche de la technologie est de laisser les autres endurer tous les bogues de la p&#233;riode de rodage, puis de jeter un coup d&#8217;&#339;il plus tard pour voir s&#8217;il y a un produit stable et vraiment utile. Par exemple, j&#8217;ai achet&#233; mon premier iPhone 10&#160;ans apr&#232;s son lancement. &#192; part un compte LinkedIn que j&#8217;utilise &#224; l&#8217;occasion pour retrouver d&#8217;anciens employ&#233;s, je me tiens loin des r&#233;seaux sociaux. J&#8217;ai une vie agr&#233;able et normale&#160;: amis, famille, voisi...</description>
    </item>
    <item>
      <title>Les PC portables bureautiques et gaming sont vendus au rabais lors des soldes : le TOP 10 des offres</title>
      <link>https://www.frandroid.com/bons-plans/2935325_les-pc-portables-bureautiques-et-gaming-sont-vendus-au-rabais-lors-des-soldes-le-top-10-des-offres</link>
      <pubDate>Tue, 20 Jan 2026 13:59:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2935325_les-pc-portables-bureautiques-et-gaming-sont-vendus-au-rabais-lors-des-soldes-le-top-10-des-offres</guid>
      <description>
Les soldes d&#8217;hiver 2026 battent encore leur plein, et la troisi&#232;me d&#233;marque d&#233;bute d&#232;s demain. Si vous pensiez que les meilleures affaires &#233;taient d&#233;j&#224; pass&#233;es, d&#233;trompez-vous : de tr&#232;s belles offres restent disponibles, notamment sur les laptops, qu&#8217;il s&#8217;agisse de mod&#232;les taill&#233;s pour le gaming ou d&#8217;ultraportables puissants pour le travail.
</description>
    </item>
    <item>
      <title>Indian vibe-coding startup Emergent triples valuation to $300M with $70M fundraise</title>
      <link>https://techcrunch.com/2026/01/20/indian-vibe-coding-startup-emergent-raises-70m-at-300m-valuation-from-softbank-khosla-ventures/</link>
      <pubDate>Tue, 20 Jan 2026 13:50:09 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083742</guid>
      <description>The funding comes as the startup claims it has scaled ARR to $50 million, and is targeting $100 million by April 2026.</description>
    </item>
    <item>
      <title>Le moins cher des balais aspirateurs Dyson perd 150 &#8364; de son prix pour les soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2716213_le-moins-cher-des-balais-aspirateurs-dyson-perd-150-de-son-prix-pour-les-soldes-dhiver</link>
      <pubDate>Tue, 20 Jan 2026 13:45:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2716213_le-moins-cher-des-balais-aspirateurs-dyson-perd-150-de-son-prix-pour-les-soldes-dhiver</guid>
      <description>
Dyson a revu sa copie du V8 avec cette version estampill&#233;e Advanced qui fait des progr&#232;s sur de nombreux niveaux. Un mod&#232;le vendu 399 euros actuellement remis&#233; &#224; 249 euros chez Boulanger pour les soldes d'hiver 2026.
</description>
    </item>
    <item>
      <title>How BYD beat Tesla</title>
      <link>https://www.theverge.com/podcast/864314/byd-tesla-china-evs-vergecast</link>
      <pubDate>2026-01-20T08:40:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864314</guid>
      <description>The Model S. The Mach-E. The Ioniq. The&#8230; Dolphin Surf? That's right, friends: There's a new biggest name in EVs, and it means you might soon be cruising down the highway in the Dolphin Surf. And you might love it. After years of Tesla dominance, a Chinese company called BYD has become the world's biggest [&#8230;]</description>
    </item>
  </channel>
</rss>
