<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 30 Dec 2025 17:24:31 GMT</lastBuildDate>
    <item>
      <title>NASA&#8217;s New Chief Finds Loophole for Texas Shuttle Switcheroo</title>
      <link>https://gizmodo.com/nasas-new-chief-finds-loophole-for-texas-shuttle-switcheroo-2000704289</link>
      <pubDate>Tue, 30 Dec 2025 17:15:51 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000704289</guid>
      <description>&#8220;One way or another, we&#8217;re going to make sure Johnson Space Center gets its historic spacecraft right where it belongs.&#8221;</description>
    </item>
    <item>
      <title>Researchers identify new ToneShell backdoor targeting government agencies</title>
      <link>https://www.techradar.com/pro/security/researchers-identify-new-toneshell-backdoor-targeting-government-agencies</link>
      <pubDate>Tue, 30 Dec 2025 17:15:00 +0000</pubDate>
      <guid isPermaLink="false">mExRLcGordZYKdbsWpRHac</guid>
      <description>Chinese attackers are allegedly spying on their neighbors with sophisticated backdoors.</description>
    </item>
    <item>
      <title>Netflix has released a trailer for the Stranger Things finale</title>
      <link>https://www.engadget.com/entertainment/streaming/netflix-has-released-a-trailer-for-the-stranger-things-finale-171204480.html?src=rss</link>
      <pubDate>Tue, 30 Dec 2025 17:12:04 +0000</pubDate>
      <guid isPermaLink="false">133486b9-2c4e-4a35-9f6c-10e410520770</guid>
      <description>Tomorrow's the big day, and I don't just mean New Year's Eve. The series finale of Stranger Things airs tomorrow, and Netflix has released a trailer for the last episode. We're given only flashes of the final episode, along with a voiceover of an emotional Jim Hopper telling Eleven he needs her to fight one last time.
It's just over 1 minute and 30 seconds long, with what appears to be only about 30 seconds of new footage. There isn't much to go on here, as most of the footage features emotional moments from seasons past. Netflix no doubt is hoping to keep much of the excitement under wraps un...</description>
    </item>
    <item>
      <title>Le Shokz OpenRun, r&#233;f&#233;rence des casques &#224; conduction osseuse pour le sport, voit son prix baisser de 28 %</title>
      <link>https://www.frandroid.com/bons-plans/2923153_le-shokz-openrun-reference-des-casques-a-conduction-osseuse-pour-le-sport-voit-son-prix-baisser-de-28</link>
      <pubDate>Tue, 30 Dec 2025 17:09:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2923153_le-shokz-openrun-reference-des-casques-a-conduction-osseuse-pour-le-sport-voit-son-prix-baisser-de-28</guid>
      <description>
Shokz est une marque sp&#233;cialis&#233;e dans les casques &#224; conduction osseuse, comme ce mod&#232;le OpenRun USB-C id&#233;al pour le sport qui se retrouve &#224; 99 euros sur Boulanger, au lieu de 139 euros.
</description>
    </item>
    <item>
      <title>La nouvelle liseuse de TCL est la championne de la prise de notes</title>
      <link>https://www.01net.com/actualites/la-nouvelle-liseuse-de-tcl-est-la-championne-de-la-prise-de-notes.html</link>
      <pubDate>Tue, 30 Dec 2025 17:02:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317660</guid>
      <description>&#192; mi-chemin entre liseuse et tablette, TCL avance ses pions sur le terrain de la prise de notes. Avec la Note A1, le constructeur rejette l&#8217;E-Ink au profit de son &#233;cran NXTPAPER, qui promet un confort de lecture proche du papier, mais avec la couleur, la vid&#233;o et une vraie ambition &#171; productivit&#233; &#187; dop&#233;e &#224; l'IA.</description>
    </item>
    <item>
      <title>iPhone Fold : design, ergonomie, puissance&#8230; tout ce que l&#8217;on sait pour le moment</title>
      <link>https://www.frandroid.com/marques/apple/2739977_iphone-pliant-design-ergonomie-puissance-tout-ce-que-lon-sait-pour-le-moment</link>
      <pubDate>Tue, 30 Dec 2025 17:02:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2739977_iphone-pliant-design-ergonomie-puissance-tout-ce-que-lon-sait-pour-le-moment</guid>
      <description>
L'iPhone pliant d'Apple (iPhone Fold) n'en finit plus de faire causer sans avoir pour le moment plus d'informations &#224; fournir. Nous avons r&#233;uni tous les &#233;l&#233;ments d&#233;j&#224; disponibles et voici ce qu'il faut savoir. 
</description>
    </item>
    <item>
      <title>io9&#8217;s Top 100 Stories of 2025</title>
      <link>https://gizmodo.com/io9-top-stories-2025-star-wars-marvel-2000704022</link>
      <pubDate>Tue, 30 Dec 2025 17:00:41 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000704022</guid>
      <description>As another year comes to a close, take a look back at the year that was with our most-read posts of 2025.</description>
    </item>
    <item>
      <title>12 investors dish on what 2026 will bring for climate tech</title>
      <link>https://techcrunch.com/2025/12/30/12-investors-dish-on-what-2026-will-bring-for-climate-tech/</link>
      <pubDate>Tue, 30 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3077768</guid>
      <description>After a tumultuous year, venture investors are still optimistic about climate tech's long term prospects, especially as data centers continue to drive demand for electricity, manufacturing, and materials.</description>
    </item>
    <item>
      <title>Why Meta bought Manus &#8212; and what it means for your enterprise AI agent strategy</title>
      <link>https://venturebeat.com/orchestration/why-meta-bought-manus-and-what-it-means-for-your-enterprise-ai-agent</link>
      <pubDate>Tue, 30 Dec 2025 17:00:00 GMT</pubDate>
      <guid isPermaLink="false">20azz34UP1Bwvqhqocwxgy</guid>
      <description>Facebook and Instagram parent company Meta&#8217;s agreement to acquire Manus for more than $2 billion &#8212; announced last night by both companies and reported in The Wall Street Journal &#8212; marks one of the clearest signals yet that large tech platforms are no longer just competing on model quality, but on who controls the execution layer of AI-powered work.Manus, a Singapore-based startup founded by Chinese entrepreneurs that debuted earlier this year, has built a general-purpose AI agent designed to autonomously carry out multi-step tasks such as research, analysis, coding, planning, and content gener...</description>
    </item>
    <item>
      <title>Meta Buys AI Agent Startup for $2 Billion, Says It Will Cut All Ties With China</title>
      <link>https://gizmodo.com/meta-buys-ai-agent-startup-for-2-billion-says-it-will-cut-all-ties-with-china-2000704284</link>
      <pubDate>Tue, 30 Dec 2025 16:50:42 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000704284</guid>
      <description>Will Mark Zuckerberg's attempts to woo Trump keep him out of trouble?</description>
    </item>
    <item>
      <title>As Measles Cases Top 2,000, the U.S. Is on Brink of Losing Its Elimination Status</title>
      <link>https://gizmodo.com/as-measles-cases-top-2000-the-u-s-is-on-brink-of-losing-its-elimination-status-2000704258</link>
      <pubDate>Tue, 30 Dec 2025 16:45:02 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000704258</guid>
      <description>At least three people have died from the vaccine-preventable infection, while hundreds have been hospitalized.</description>
    </item>
    <item>
      <title>1Password deal: Last chance to save 50 percent on our favorite password manager</title>
      <link>https://www.engadget.com/deals/1password-deal-last-chance-to-save-50-percent-on-our-favorite-password-manager-162844256.html?src=rss</link>
      <pubDate>Tue, 30 Dec 2025 16:43:08 +0000</pubDate>
      <guid isPermaLink="false">cd9e1307-aef8-4e09-8a9c-1a77b7b352b3</guid>
      <description>If cleaning up your digital life is on your New Year's resolution list, we've got good news: 1Password is offering half off its subscription plans (both the Individual and Families plans). That brings the price of the Individual plan down to $24 for a year and the Families plan down to $36 for a year.&#160;
The plans are nearly identical, but the Families plan accommodates five additional people. These discounts are only available to new customers and the prices expire after the year, so set a reminder to cancel or reassess. And you'll need to act fast, because the offer expires today &#8212; Tuesday, De...</description>
    </item>
    <item>
      <title>Samsung Galaxy S26 Ultra : design, &#233;cran, fen&#234;tre de sortie, prix&#8230; Tout ce qu&#8217;on sait sur le futur smartphone</title>
      <link>https://www.frandroid.com/marques/samsung/2849839_samsung-galaxy-s26-ultra-design-ecran-fenetre-de-sortie-prix-tout-ce-quon-sait-sur-le-futur-smartphone</link>
      <pubDate>Tue, 30 Dec 2025 16:42:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2849839_samsung-galaxy-s26-ultra-design-ecran-fenetre-de-sortie-prix-tout-ce-quon-sait-sur-le-futur-smartphone</guid>
      <description>
Le Samsung Galaxy S26 Ultra approche petit &#224; petit, voici tout ce que l'on sait d&#233;j&#224; &#224; son sujet (fen&#234;tre de sortie, design, &#233;cran, performances, etc.).
</description>
    </item>
    <item>
      <title>Hackers are targeting taxpayers as they file - here's what to look for</title>
      <link>https://www.techradar.com/pro/security/hackers-are-targeting-taxpayers-as-they-file-heres-what-to-look-for</link>
      <pubDate>Tue, 30 Dec 2025 16:30:00 +0000</pubDate>
      <guid isPermaLink="false">gs5tExUNynG8sQV8gc4Xg6</guid>
      <description>Russia-linked actors are targeting tax firms in the US, stealing highly sensitive data</description>
    </item>
    <item>
      <title>The year in wireless hi-fi and headphones: 2025's top winners and losers &#8212; and what I want to see in 2026</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/the-year-in-wireless-hi-fi-and-headphones-2025s-top-winners-and-losers-and-what-i-want-to-see-in-2026</link>
      <pubDate>Tue, 30 Dec 2025 16:30:00 +0000</pubDate>
      <guid isPermaLink="false">RoovVgLMZfea4eHNnfTro</guid>
      <description>A whole year of wireless headphones and we&#8217;re still using Li-ion batteries, but buds can take our heart-rate? 2025&#8217;s audio wins, losses and could-do-betters.</description>
    </item>
    <item>
      <title>USDA announces ground beef recall over E. coli concerns</title>
      <link>https://www.fastcompany.com/91467813/usda-announces-ground-beef-recall-over-e-coli-concerns</link>
      <pubDate>2025-12-30T16:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91467813/usda-announces-ground-beef-recall-over-e-coli-concerns</guid>
      <description>The USDA says the beef may contain E. coli O26, a strain that can cause serious illness.
Packages of grass fed ground beef are being recalled over possible E. coli contamination. The affected packages were distributed in at least six states, according to the U.S. Department of Agriculture (USDA).</description>
    </item>
    <item>
      <title>Galaxy Watch : attention, cette mise &#224; jour pourrait d&#233;sactiver des fonctions de sant&#233; bien pratiques</title>
      <link>https://www.frandroid.com/marques/samsung/2922917_galaxy-watch-attention-cette-mise-a-jour-pourrait-desactiver-des-fonctions-de-sante-bien-pratiques</link>
      <pubDate>Tue, 30 Dec 2025 16:17:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2922917_galaxy-watch-attention-cette-mise-a-jour-pourrait-desactiver-des-fonctions-de-sante-bien-pratiques</guid>
      <description>
La mise &#224; jour des Galaxy Watch 4 vers One UI 8 Watch ne se ferait pas sans quelques probl&#232;mes avec des soucis de capteurs ou d'affichage rapport&#233;s par certains utilisateurs. 
</description>
    </item>
    <item>
      <title>I'm a creative software editor - and these are the 8 most exciting updates that made content creation even easier in 2025</title>
      <link>https://www.techradar.com/pro/im-a-creative-software-editor-and-these-are-the-8-most-exciting-updates-that-made-content-creation-even-easier-in-2025-from-editing-on-your-phone-to-designing-websites-with-ai</link>
      <pubDate>Tue, 30 Dec 2025 16:15:00 +0000</pubDate>
      <guid isPermaLink="false">fVn3BexF9eL7xKQPduKwTJ</guid>
      <description>The best updates I saw in the creative apps space this year, from editing on your phone to designing websites with AI.</description>
    </item>
    <item>
      <title>EDF d&#233;voile son plan pour faire chuter le prix de l&#8217;&#233;lectricit&#233; en France gr&#226;ce aux nouveaux r&#233;acteurs nucl&#233;aires</title>
      <link>https://www.frandroid.com/survoltes/energie/2923623_edf-devoile-son-plan-pour-faire-chuter-le-prix-de-lelectricite-en-france-grace-aux-nouveaux-reacteurs-nucleaires</link>
      <pubDate>Tue, 30 Dec 2025 16:13:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/2923623_edf-devoile-son-plan-pour-faire-chuter-le-prix-de-lelectricite-en-france-grace-aux-nouveaux-reacteurs-nucleaires</guid>
      <description>
Le prix de l'&#233;lectricit&#233; va-t'il diminuer dans le futur, gr&#226;ce aux nouvelles centrales nucl&#233;aires ? C'est possible, m&#234;me si les &#233;nergies renouvelables pourraient, elles aussi, participer &#224; cette baisse de co&#251;t.
</description>
    </item>
    <item>
      <title>Bixby n&#8217;est pas mort&#160;: Samsung pr&#233;pare sa revanche avec Perplexity</title>
      <link>https://www.01net.com/actualites/bixby-nest-pas-mort-samsung-prepare-sa-revanche-avec-perplexity.html</link>
      <pubDate>Tue, 30 Dec 2025 16:02:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317614</guid>
      <description>Longtemps moqu&#233; pour sa lourdeur face &#224; Google Assistant et Siri, l'assistant mal-aim&#233; de Samsung s'appr&#234;te &#224; recevoir une greffe de cerveau majeure. Gr&#226;ce &#224; l'IA de Perplexity, Bixby pourrait enfin devenir pertinent.</description>
    </item>
    <item>
      <title>U.S. consumer watchdog faces extinction in 2026 as Trump says it&#8217;s &#8216;very important&#8217; to shut it down</title>
      <link>https://www.fastcompany.com/91467761/u-s-consumer-watchdog-faces-extinction-2026-trump-says-very-important-shut-down</link>
      <pubDate>2025-12-30T16:00:55</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91467761/u-s-consumer-watchdog-faces-extinction-2026-trump-says-very-important-shut-down</guid>
      <description>The Consumer Financial Protection Bureau says it will run out of funds in early 2026. 
When Bianca Jones, a 33-year-old special education teacher in Memphis, Tennessee, decided a couple of years ago that she wanted to buy a house, she started digging into her Experian credit report. She was shocked by what she found.</description>
    </item>
    <item>
      <title>&#8216;Predator: Badlands&#8217; Is Coming Home Next Week</title>
      <link>https://gizmodo.com/predator-badlands-home-release-date-blu-ray-digital-streaming-2000704279</link>
      <pubDate>Tue, 30 Dec 2025 16:00:45 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000704279</guid>
      <description>Kick the new year off with one of our favorite movies of 2025.</description>
    </item>
    <item>
      <title>Forfaits SFR : les offres internet et mobile de l&#8217;op&#233;rateur au carr&#233; rouge en 2026</title>
      <link>https://www.frandroid.com/services/operateurs-mobiles/1644423_avis-sfr-en-2024-ce-que-lon-pense-des-offres-de-loperateur-au-carre-rouge</link>
      <pubDate>Tue, 30 Dec 2025 16:00:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/operateurs-mobiles/1644423_avis-sfr-en-2024-ce-que-lon-pense-des-offres-de-loperateur-au-carre-rouge</guid>
      <description>
SFR est un op&#233;rateur historique en France qui inspire des sentiments mitig&#233;s. Certes, l'op&#233;rateur au carr&#233; rouge s'est nettement am&#233;lior&#233; sur le plan technologique avec la 5G+ et le Wi-Fi 7, mais un &#233;ventuel rachat par les rivaux pourrait refroidir l'envie de souscrire &#224; un forfait SFR. Par ailleurs, voyons si ces derniers m&#233;ritent votre argent.
</description>
    </item>
    <item>
      <title>The best AI-powered dictation apps of 2025</title>
      <link>https://techcrunch.com/2025/12/30/the-best-ai-powered-dictation-apps-of-2025/</link>
      <pubDate>Tue, 30 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3076350</guid>
      <description>AI-powered dictation apps are useful for replying to emails, taking notes, and even coding through your voice</description>
    </item>
    <item>
      <title>December isn&#8217;t just for holiday movies &#8212; here are 9 new films I streamed this month that aren&#8217;t Christmas-themed</title>
      <link>https://www.techradar.com/streaming/december-isnt-just-for-holiday-movies-here-are-9-new-films-i-streamed-this-month-that-arent-christmas-themed</link>
      <pubDate>Tue, 30 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">Cm7WRdUNcw6ovi2x3X5VP5</guid>
      <description>Frankenstein tops my list of my December favorites, as well as No Country For Old Men and Fatal Attraction.</description>
    </item>
    <item>
      <title>OnePlus has previewed its Turbo 6 gaming phones &#8212; and confirmed they'll boast 9,000 mAh batteries</title>
      <link>https://www.techradar.com/phones/oneplus-phones/oneplus-has-previewed-its-turbo-6-gaming-phones-and-confirmed-theyll-boast-9-000-mah-batteries</link>
      <pubDate>Tue, 30 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">i6oHt8Cok9muHGyvbwqt3H</guid>
      <description>After a new phone with a focus on gaming? OnePlus has a couple of handsets that you might be interested in.</description>
    </item>
    <item>
      <title>GameSir put a tiny force feedback steering wheel on its new Swift Drive controller</title>
      <link>https://www.theverge.com/news/851259/gamesir-switch-turbo-drive-controller-steering-wheel-wireless-force-feedback</link>
      <pubDate>2025-12-30T10:59:41-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=851259</guid>
      <description>GameSir is no stranger to experimenting with unique controller features - its Tarantula Pro can automatically swap its face button labels to accommodate alternate layouts, and its Pocket 1 clamps Game Boy controls onto your phone. What sets its new Swift Drive controller apart is a small steering wheel located smack-dab in the middle of [&#8230;]</description>
    </item>
    <item>
      <title>Avant la p&#233;nurie et la hausse des prix, voici un SSD Samsung 8 To en promo &#224; -25 % capable de tourner &#224; 14 800 Mo/s</title>
      <link>https://www.frandroid.com/bons-plans/2923361_avant-la-penurie-et-la-hausse-des-prix-voici-un-ssd-samsung-8-to-en-promo-a-25-capable-de-tourner-a-14-800-mo-s</link>
      <pubDate>Tue, 30 Dec 2025 15:50:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2923361_avant-la-penurie-et-la-hausse-des-prix-voici-un-ssd-samsung-8-to-en-promo-a-25-capable-de-tourner-a-14-800-mo-s</guid>
      <description>
Le Samsung 9100 Pro 8 To est un SSD g&#233;n&#233;reux et d'une puissance rare, disponible en promo &#224; 827,99 euros au lieu de 1 099 euros sur Amazon.
</description>
    </item>
    <item>
      <title>Some Genius Made Spotify on Cassette a Real Thing</title>
      <link>https://gizmodo.com/some-genius-made-spotify-on-cassette-a-real-thing-2000704257</link>
      <pubDate>Tue, 30 Dec 2025 15:50:12 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000704257</guid>
      <description>It's just a DIY project, but I want one badly.</description>
    </item>
    <item>
      <title>Plaques roses, hausse du carburant, bonus &#233;cologique : tout ce qui change pour les conducteurs en 2026</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/voiture-hydrogene/2923541_plaques-roses-hausse-du-carburant-bonus-ecologique-tout-ce-qui-change-pour-les-conducteurs-en-2026</link>
      <pubDate>Tue, 30 Dec 2025 15:49:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/voiture-hydrogene/2923541_plaques-roses-hausse-du-carburant-bonus-ecologique-tout-ce-qui-change-pour-les-conducteurs-en-2026</guid>
      <description>
Le passage &#224; l'ann&#233;e 2026 s'accompagne de plusieurs modifications l&#233;gislatives impactant les automobilistes en France. Entre la r&#233;vision des bar&#232;mes du malus &#233;cologique, l'&#233;volution de la fiscalit&#233; sur les carburants et le renforcement du contr&#244;le technique pour certains v&#233;hicules, voici un point complet sur les nouvelles r&#232;gles en vigueur.
</description>
    </item>
    <item>
      <title>Anker&#8217;s portable backup battery is an even better investment now that it&#8217;s nearly half off</title>
      <link>https://www.theverge.com/gadgets/851016/anker-521-powerhouse-google-tv-streamer-4k-deal-sale</link>
      <pubDate>2025-12-30T10:47:34-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=851016</guid>
      <description>Winter storms across the country are bringing heavy snow, rain, and &#8212; in some cases, as this Californian who briefly lost power a few days ago can attest &#8212; outages. If you want to prepare, Anker&#8217;s 521 PowerHouse can help keep your essential devices running and it&#8217;s on sale for $129.99 ($120 off) at Amazon. [&#8230;]</description>
    </item>
    <item>
      <title>The FCC has probably killed a plan to improve smart home security</title>
      <link>https://www.theverge.com/news/851271/cyber-trust-mark-program-lead-administrator-withdraws</link>
      <pubDate>2025-12-30T10:47:09-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=851271</guid>
      <description>The US Cyber Trust Mark Program, an Energy Star-style certification for smart home security, could be winding down less than a year after it launched. Safety testing company UL Solutions has announced that it is stepping down as the program's lead administrator, just a few months after the Federal Communications Commission (FCC) began investigating it [&#8230;]...</description>
    </item>
    <item>
      <title>Everybody&#8217;s Getting In on the Canvas TV Craze</title>
      <link>https://gizmodo.com/everybodys-getting-in-on-the-canvas-tv-craze-2000704259</link>
      <pubDate>Tue, 30 Dec 2025 15:45:49 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000704259</guid>
      <description>You won&#8217;t have to look far for a screen pretending to be a painting.</description>
    </item>
    <item>
      <title>Freebox&#160;: 8 cha&#238;nes offertes aux abonn&#233;s jusqu&#8217;&#224; fin janvier</title>
      <link>https://www.01net.com/actualites/freebox-8-chaines-offertes-aux-abonnes-des-29-decembre.html</link>
      <pubDate>Tue, 30 Dec 2025 15:45:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316304</guid>
      <description>Depuis hier, Free offre &#224; ses abonn&#233;s plusieurs cha&#238;nes habituellement payantes, pour une dur&#233;e limit&#233;e.</description>
    </item>
    <item>
      <title>Xiaomi Electric Scooter 6 : une version Ultra surpuissante, mais aussi un mod&#232;le Lite tr&#232;s abordable en approche</title>
      <link>https://www.frandroid.com/marques/xiaomi/2923359_xiaomi-electric-scooter-6-une-version-ultra-surpuissante-mais-aussi-un-modele-lite-tres-abordable-en-approche</link>
      <pubDate>Tue, 30 Dec 2025 15:40:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2923359_xiaomi-electric-scooter-6-une-version-ultra-surpuissante-mais-aussi-un-modele-lite-tres-abordable-en-approche</guid>
      <description>
Moins conservatrices, les prochaines trottinettes &#233;lectriques Xiaomi Electric Scooter 6 adopteront des roues 12 pouces et une double suspension en 2026, &#224; l&#8217;exception d&#8217;une version tr&#232;s abordable.
</description>
    </item>
    <item>
      <title>VCs predict enterprises will spend more on AI in 2026&#160;&#8212;&#160;through&#160;fewer vendors</title>
      <link>https://techcrunch.com/2025/12/30/vcs-predict-enterprises-will-spend-more-on-ai-in-2026-through-fewer-vendors/</link>
      <pubDate>Tue, 30 Dec 2025 15:30:24 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078811</guid>
      <description>Enterprises have been experimenting with AI tools for a few years. Investors predict they will start to pick winners in 2026.</description>
    </item>
  </channel>
</rss>
