<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 20 Jan 2026 17:35:05 GMT</lastBuildDate>
    <item>
      <title>Pourquoi les voitures prot&#232;gent moins bien les femmes que les hommes, et pourquoi &#231;a va changer</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2948127_pourquoi-les-voitures-protegent-moins-bien-les-femmes-que-les-hommes-et-pourquoi-ca-va-changer</link>
      <pubDate>Tue, 20 Jan 2026 17:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2948127_pourquoi-les-voitures-protegent-moins-bien-les-femmes-que-les-hommes-et-pourquoi-ca-va-changer</guid>
      <description>
Si les constructeurs aiment toujours communiquer sur la s&#233;curit&#233; de leurs voitures, il aura fallu attendre 2026 pour qu'un mannequin f&#233;minin de crash-test soit officiellement pr&#233;sent&#233;. De quoi augurer d'une s&#233;curit&#233; accrue, et ce pour l'int&#233;gralit&#233; de la population.
</description>
    </item>
    <item>
      <title>'The coating is sprayed onto each smartwatch, then baked to help cure the coating' &#8212; Garmin's new Cerakote Edition of its tactix 8 outdoor watch offers 'long-lasting durability' compared to the standard polymer</title>
      <link>https://www.techradar.com/health-fitness/the-coating-is-sprayed-onto-each-smartwatch-then-baked-to-help-cure-the-coating-garmins-new-cerakote-edition-of-its-tactix-8-outdoor-watch-offers-long-lasting-durability-compared-to-the-standard-polymer</link>
      <pubDate>Tue, 20 Jan 2026 17:30:32 +0000</pubDate>
      <guid isPermaLink="false">SVMFmCgtBAtvawcJsu65aA</guid>
      <description>Garmin tactix 8 gets an ultra-tough Cerakote coating for enhanced durability in the field, plus new Garmin golf equipment drops.</description>
    </item>
    <item>
      <title>Best Buy's massive Super Bowl sale is live &#8212; here are 15 deals I'd buy on big-screen TVs, air fryers, soundbars, and more</title>
      <link>https://www.techradar.com/seasonal-sales/best-buys-massive-super-bowl-sale-is-live-here-are-15-deals-id-buy-on-big-screen-tvs-air-fryers-soundbars-and-more</link>
      <pubDate>Tue, 20 Jan 2026 17:27:46 +0000</pubDate>
      <guid isPermaLink="false">7joppB7FmUMmSvi8gSwUvQ</guid>
      <description>Best Buy has launched a huge Super Bowl sale, and I'm rounding up today's 15 best deals, including up to 55% off big-screen TVs, soundbars, air fryers, and more.</description>
    </item>
    <item>
      <title>Ransomware gang claims it hacked into Hyatt systems, says it has stolen data for sale</title>
      <link>https://www.techradar.com/pro/security/ransomware-gang-claims-it-hacked-into-hyatt-systems-says-it-has-stolen-data-for-sale</link>
      <pubDate>Tue, 20 Jan 2026 17:25:00 +0000</pubDate>
      <guid isPermaLink="false">cbc2mTAxLDYRFvu9D6qP55</guid>
      <description>NightSpire claims to have stolen almost 50GB of Hyatt files, including login credentials for CMS systems.</description>
    </item>
    <item>
      <title>L&#8217;Apple Watch Ultra 3 n&#8217;&#233;chappe pas aux soldes d&#8217;hiver et voit son prix passer sous les 700 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2949375_lapple-watch-ultra-3-nechappe-pas-aux-soldes-dhiver-et-voit-son-prix-passer-sous-les-700-e</link>
      <pubDate>Tue, 20 Jan 2026 17:22:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2949375_lapple-watch-ultra-3-nechappe-pas-aux-soldes-dhiver-et-voit-son-prix-passer-sous-les-700-e</guid>
      <description>
D&#233;voil&#233;e en septembre dernier, l'Apple Watch Ultra 3 est l'actuelle repr&#233;sentante de la s&#233;rie de tocantes connect&#233;es haut de gamme de la marque &#224; la Pomme. Pendant les soldes d'hiver, Rakuten l'affiche &#224; 669,99 euros au lieu de 899 euros. 
</description>
    </item>
    <item>
      <title>Netflix&#8217;s Star Search will let you vote to decide who wins</title>
      <link>https://www.theverge.com/entertainment/864424/netflix-star-search-live-voting</link>
      <pubDate>2026-01-20T12:19:41-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864424</guid>
      <description>Though Netflix's upcoming Star Search reboot will feature a panel of celebrity judges, viewers are going to have a hand in choosing which contestants win the competition. Ahead of Star Search's premiere tonight, Netflix has announced that it is launching a new real-time voting functionality that will give you the ability to tell the streamer [&#8230;]</description>
    </item>
    <item>
      <title>ExpressVPN deal: Two-year plans are up to 78 percent off right now</title>
      <link>https://www.engadget.com/deals/expressvpn-deal-two-year-plans-are-up-to-78-percent-off-right-now-180602610.html?src=rss</link>
      <pubDate>Tue, 20 Jan 2026 17:15:36 +0000</pubDate>
      <guid isPermaLink="false">ad6bc22c-2c6b-4ec4-832c-d6d9af119838</guid>
      <description>If you're looking to up your privacy game on the internet in the new year, you can do so for a little less than usual thanks to ExpressVPN's latest deal. Its two-year plans are up to 78 percent off right now: the Advanced tier is on sale for $101 for two years, plus four additional free months. That works out to $3.59 per month during the promotional period.
We&#8217;ve consistently liked ExpressVPN because it&#8217;s fast, easy to use and widely available across a large global server network. In fact, it's our current pick for best premium VPN. One of the biggest drawbacks has always been its high cost, ...</description>
    </item>
    <item>
      <title>Pivoting to Smart Glasses Is Getting Out of Hand</title>
      <link>https://gizmodo.com/pivoting-to-smart-glasses-is-getting-out-of-hand-2000711938</link>
      <pubDate>Tue, 20 Jan 2026 17:15:09 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711938</guid>
      <description>Going all-in on smart glasses is either going to be a really smart decision or a really dumb one.</description>
    </item>
    <item>
      <title>Tottenham vs Borussia Dortmund Free Streams: How to watch Champions League 2025/26 online from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/football/tottenham-vs-borussia-dortmund-champions-league-2025-26-free</link>
      <pubDate>Tue, 20 Jan 2026 17:15:00 +0000</pubDate>
      <guid isPermaLink="false">mpA2XvCH6R4SVACMWLCMSM</guid>
      <description>All the ways to watch Tottenham vs Borussia Dortmund live streams from anywhere, with both Thomas Frank and Niko Kovac under pressure ahead of this UCL tie.</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : quelles sont les offres &#224; saisir en ce mardi 20 janvier ?</title>
      <link>https://www.frandroid.com/bons-plans/2941853_soldes-dhiver-2026-quelles-sont-les-offres-a-saisir-en-ce-mardi-20-janvier</link>
      <pubDate>Tue, 20 Jan 2026 17:09:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2941853_soldes-dhiver-2026-quelles-sont-les-offres-a-saisir-en-ce-mardi-20-janvier</guid>
      <description>
Les soldes d'hiver suivent leur chemin et nous arrivons d&#233;j&#224; presque &#224; la troisi&#232;me d&#233;marque ! Au programme : toujours plus d'offres Tech &#224; prix cass&#233;s, que ce soient les smartphones, les tablettes, les t&#233;l&#233;viseurs 4K, et surtout les ordinateurs portables, gaming ou de bureautique. M&#234;me le gaming s'invite de plus en plus dans la danse des promotions.
...</description>
    </item>
    <item>
      <title>Free Box 5G vs Bbox 5G WiFi 7 : qui propose la meilleure offre en France ?</title>
      <link>https://www.frandroid.com/actualites-generales/2949477_free-box-5g-vs-bbox-5g-wifi-7-qui-propose-la-meilleure-offre-en-france</link>
      <pubDate>Tue, 20 Jan 2026 17:07:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2949477_free-box-5g-vs-bbox-5g-wifi-7-qui-propose-la-meilleure-offre-en-france</guid>
      <description>
Bouygues Telecom a d&#233;voil&#233; sa nouvelle box 5G et pour la premi&#232;re fois, il s'agit d'une v&#233;ritable Bbox. Que vaut cette nouvelle offre face &#224; la box 5G de Free ?
</description>
    </item>
    <item>
      <title>New Research Debunks Trump and RFK Jr.&#8217;s Claims Linking Tylenol to Autism</title>
      <link>https://gizmodo.com/new-research-debunks-trump-and-rfk-jr-s-claims-linking-tylenol-to-autism-2000711954</link>
      <pubDate>Tue, 20 Jan 2026 17:05:29 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711954</guid>
      <description>It's the latest research to find no clear link between maternal acetaminophen use and a higher autism risk.</description>
    </item>
    <item>
      <title>You should buy an electric car now, UK government says &#8211; while ignoring 5 massive roadblocks that affect millions</title>
      <link>https://www.techradar.com/vehicle-tech/hybrid-electric-vehicles/you-should-buy-an-electric-car-now-uk-government-says-while-ignoring-5-massive-roadblocks-that-affect-millions</link>
      <pubDate>Tue, 20 Jan 2026 17:04:32 +0000</pubDate>
      <guid isPermaLink="false">T8TCjxoHd56JrHRG5MSZ9n</guid>
      <description>The UK government says there's "never been a better time to switch" to an EV, but five big roadblocks are still standing in the way of many.</description>
    </item>
    <item>
      <title>Guerre en Ukraine&#160;: les donn&#233;es du front, nouvel or noir de l&#8217;IA</title>
      <link>https://www.01net.com/actualites/guerre-en-ukraine-les-donnees-du-front-nouvel-or-noir-de-lia.html</link>
      <pubDate>Tue, 20 Jan 2026 17:03:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321334</guid>
      <description>L'Ukraine va partager les donn&#233;es enregistr&#233;es sur le front avec ses alli&#233;s afin d'entra&#238;ner leurs mod&#232;les d'intelligence artificielle. Un atout strat&#233;gique de poids, &#224; la crois&#233;e des enjeux militaires, technologiques et diplomatiques.</description>
    </item>
    <item>
      <title>Meilleur Google Pixel (2026) : le guide d&#8217;achat complet</title>
      <link>https://www.frandroid.com/guide-dachat/2043088_quel-smartphone-google-pixel-choisir</link>
      <pubDate>Tue, 20 Jan 2026 17:02:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2043088_quel-smartphone-google-pixel-choisir</guid>
      <description>
Google propose ses propres smartphones, nomm&#233;s "Pixel". Chez Frandroid, nous les testons tous : on vous explique ici la gamme Pixel ainsi que le mod&#232;le qu'il vous faut.
</description>
    </item>
    <item>
      <title>Indiana Jones&#8217; Comeback Was Never Going to Be Easy</title>
      <link>https://gizmodo.com/indiana-jones-future-lucasfilm-kathleen-kennedy-2000711931</link>
      <pubDate>Tue, 20 Jan 2026 17:00:15 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711931</guid>
      <description>After 'Dial of Destiny' and 'The Great Circle', charting a path for Lucasfilm's *other* big franchise to return will take work.</description>
    </item>
    <item>
      <title>Netflix has introduced a new live vote feature that'll let you decide the outcome of some shows &#8212; but not everyone will be able to use it</title>
      <link>https://www.techradar.com/streaming/netflix/netflix-has-introduced-a-new-live-vote-feature-thatll-let-you-decide-the-outcome-of-some-shows-but-not-everyone-will-be-able-to-use-it</link>
      <pubDate>Tue, 20 Jan 2026 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">RLdANuLktarQr4RnN4XBuH</guid>
      <description>Netflix's new star-based live voting feature sounds great in practice, but is it a novelty that'll eventually lose its shine?</description>
    </item>
    <item>
      <title>C&#8217;est la grande braderie des soldes chez Samsung, avec des prix bas sur les Galaxy Z Fold, Galaxy S, Galaxy Book&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2939747_galaxy-z-fold-6-galaxy-s25-les-16-meilleures-offres-samsung-lors-des-soldes</link>
      <pubDate>Tue, 20 Jan 2026 16:56:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2939747_galaxy-z-fold-6-galaxy-s25-les-16-meilleures-offres-samsung-lors-des-soldes</guid>
      <description>
La 3e d&#233;marque des soldes approche &#224; grands pas et les offres restent toujours attractives, notamment du c&#244;t&#233; des produits Samsung. Entre smartphones pliant &#224; -50 %, TV OLED en r&#233;duction et &#233;crans Ultra Wide OLED, il y en a pour tous les go&#251;ts.
</description>
    </item>
    <item>
      <title>Suri's eco-friendly electric toothbrush that offers 'sustainability and performance at its absolute best' just got a big price cut on Amazon</title>
      <link>https://www.techradar.com/health-fitness/oral-health/suris-eco-friendly-electric-toothbrush-that-offers-sustainability-and-performance-at-its-absolute-best-just-got-a-big-price-cut-on-amazon</link>
      <pubDate>Tue, 20 Jan 2026 16:54:32 +0000</pubDate>
      <guid isPermaLink="false">PUk5gk2rsEfBBjMiT2XJcZ</guid>
      <description>The Suri 2.0 Sonic Electric Toothbrush is a fantastic alternative to plastic options from Oral-B and Philips &#8211; and it just dropped to its lowest price since Black Friday on Amazon.</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver : passer l&#8217;aspirateur et laver les sols devient un plaisir avec ces mod&#232;les en promotion. Le top 10 des offres</title>
      <link>https://www.frandroid.com/bons-plans/2941951_soldes-dhiver-passer-laspirateur-et-laver-les-sols-devient-un-plaisir-avec-ces-modeles-en-promotion-le-top-10-des-offres</link>
      <pubDate>Tue, 20 Jan 2026 16:48:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2941951_soldes-dhiver-passer-laspirateur-et-laver-les-sols-devient-un-plaisir-avec-ces-modeles-en-promotion-le-top-10-des-offres</guid>
      <description>
Aspirer, nettoyer, laver... Les aspirateurs-robots sont un v&#233;ritable gain de temps dans nos quotidiens bien remplis, mais ils ont un co&#251;t. M&#234;me chose pour les aspirateurs-balais qui sont de v&#233;ritables prouesses de technologie. Pour ces soldes d'hiver, voici notre top des meilleures offres.
</description>
    </item>
    <item>
      <title>CISOs are becoming ever more powerful at work - even more than other C-level execs</title>
      <link>https://www.techradar.com/pro/cisos-are-becoming-ever-more-powerful-at-work-even-more-than-other-c-level-execs</link>
      <pubDate>Tue, 20 Jan 2026 16:45:00 +0000</pubDate>
      <guid isPermaLink="false">d7Qgn3b3UAFDrWjnS3AdNA</guid>
      <description>CISOs' roles are expanding to work with other C-suite leaders more - but the job is getting harder.</description>
    </item>
    <item>
      <title>E.Leclerc multiplie les bonnes affaires &#224; l&#8217;approche de la 3e d&#233;marque des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2945683_e-leclerc-se-fait-plaisir-et-casse-le-prix-de-nombreux-produits-tech-a-la-2e-demarque-des-soldes</link>
      <pubDate>Tue, 20 Jan 2026 16:42:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2945683_e-leclerc-se-fait-plaisir-et-casse-le-prix-de-nombreux-produits-tech-a-la-2e-demarque-des-soldes</guid>
      <description>
D&#232;s demain, la 3&#7497; d&#233;marque d&#233;marre avec une nouvelle vague d&#8217;offres in&#233;dites. E.Leclerc ne compte pas rester en retrait et casse une fois de plus les prix sur les produits tech &#8212; smartphones, TV OLED, montres connect&#233;es, tablettes&#8230; Nous avons s&#233;lectionn&#233; les promos qui valent vraiment le d&#233;tour.
</description>
    </item>
    <item>
      <title>Roland's Go:Mixer Studio is an affordable but capable mixer for budding recording engineers</title>
      <link>https://www.engadget.com/audio/rolands-gomixer-studio-is-an-affordable-but-capable-mixer-for-budding-recording-engineers-163927262.html?src=rss</link>
      <pubDate>Tue, 20 Jan 2026 16:39:27 +0000</pubDate>
      <guid isPermaLink="false">96c6a24b-b235-40e0-b995-af49ea3aca8a</guid>
      <description>Roland just unveiled the Go:Mixer Studio, a powerful entry in the company's line of audio interfaces. This one promises to be a portable and affordable way to create high-quality recordings with a smartphone or PC.
The biggest news here are the 12 input channels and six output channels. This means that users can record multiple instruments at once and even run the signal through outboard gear if so desired. There are two XLR inputs on the back with phantom power, an instrument jack, stereo &#188;-inch line-in jacks, an aux input, TRS MIDI ins and outs, two headphones jacks and stereo line outs for ...</description>
    </item>
    <item>
      <title>Huawei pr&#233;sente une montre connect&#233;e &#224; plus de 3&#160;000 euros avec de l&#8217;or 18 carats</title>
      <link>https://www.01net.com/actualites/huawei-presente-une-montre-connectee-a-plus-de-3-000-euros-avec-de-lor-18-carats.html</link>
      <pubDate>Tue, 20 Jan 2026 16:36:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321260</guid>
      <description>Une montre connect&#233;e &#224; plus de 3 000 euros dot&#233;e d&#8217;or 18 carats ? Huawei d&#233;voile son nouveau mod&#232;le, la Watch Ultimate Design Royal Gold. Un mod&#232;le ultra haut de gamme, disponible d&#232;s aujourd&#8217;hui.</description>
    </item>
    <item>
      <title>Brochette de Matinales Tech&#8217; : notre programme Twitch de la semaine vous donne rendez-vous presque tous les jours</title>
      <link>https://www.frandroid.com/humanoid/emissions/2632585_brochette-de-matinale-tech-notre-programme-twitch-de-la-semaine-vous-donne-rendez-vous-presque-tous-les-jours</link>
      <pubDate>Tue, 20 Jan 2026 16:35:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/emissions/2632585_brochette-de-matinale-tech-notre-programme-twitch-de-la-semaine-vous-donne-rendez-vous-presque-tous-les-jours</guid>
      <description>
Notre programme Twitch de la semaine du lundi 19 janvier 2026, c&#8217;est juste ici : nous vous donnons rendez-vous mardi, mercredi, jeudi et vendredi sur notre cha&#238;ne Frandroidlive, pour quatre Matinales Tech' successives. Rien que &#231;a.
</description>
    </item>
    <item>
      <title>Former Nintendo of America boss Doug Bowser is joining Hasbro</title>
      <link>https://www.theverge.com/news/864412/nintendo-doug-bowser-joins-hasbro-build</link>
      <pubDate>2026-01-20T11:30:15-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864412</guid>
      <description>Doug Bowser is joining Hasbro's board of directors just weeks after retiring as Nintendo of America's president, according to an announcement on Tuesday. Though Hasbro's press release doesn't provide any specifics about Bowser's role on the board of directors, the company has big plans for its future in video games. Hasbro already licenses its intellectual [&#8230;]...</description>
    </item>
    <item>
      <title>AI is rewriting the CEO job description: Are you ready?</title>
      <link>https://www.fastcompany.com/91472400/ai-is-rewriting-the-ceo-job-description-are-you-ready</link>
      <pubDate>2026-01-20T16:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91472400/ai-is-rewriting-the-ceo-job-description-are-you-ready</guid>
      <description>A playbook for staying ahead of the curve.
The CEO job description has remained remarkably stable for decades&#8212;but the times they are a&#8217;changin&#8217;.</description>
    </item>
    <item>
      <title>No, Earth Won&#8217;t Lose Gravity for 7 Seconds on August 12, NASA Says</title>
      <link>https://gizmodo.com/no-earth-wont-lose-gravity-for-7-seconds-on-august-12-nasa-says-2000711970</link>
      <pubDate>Tue, 20 Jan 2026 16:25:07 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711970</guid>
      <description>As internet conspiracy theories go, this one was exceptionally dumb.</description>
    </item>
    <item>
      <title>This hidden iPhone feature lets you record and transcribe, but it's still not as good as Android Voice Recorder</title>
      <link>https://www.techradar.com/phones/iphone/this-hidden-iphone-feature-lets-you-record-and-transcribe-but-its-still-not-as-good-as-android-voice-recorder</link>
      <pubDate>Tue, 20 Jan 2026 16:24:37 +0000</pubDate>
      <guid isPermaLink="false">WgEbL6if4ba3f4cTMMSexA</guid>
      <description>This hidden iPhone Notes feature can help you capture all your critical conversations.</description>
    </item>
    <item>
      <title>One of the first alternative app stores in the EU is shutting down</title>
      <link>https://techcrunch.com/2026/01/20/one-of-the-first-alternative-app-stores-in-the-eu-is-shutting-down/</link>
      <pubDate>Tue, 20 Jan 2026 16:22:53 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083790</guid>
      <description>Setapp Mobile, one of the first alternative app stores in the EU, is shutting down next month, citing Apple's ever-changing terms.</description>
    </item>
    <item>
      <title>Grubhub parent acquires restaurant rewards startup Claim</title>
      <link>https://techcrunch.com/2026/01/20/grubhub-parent-acquires-restaurant-rewards-startup-claim/</link>
      <pubDate>Tue, 20 Jan 2026 16:22:31 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083780</guid>
      <description>The acquisition will give restaurants on Grubhub access to Claim&#8217;s customer acquisition and retention tools, while Grubhub diners can receive rewards.</description>
    </item>
    <item>
      <title>T-Mobile's new Better Value plan includes Netflix, Hulu, and a mobile hotspot &#8212; it could save you $1,000 versus the competition</title>
      <link>https://www.techradar.com/phones/network-providers/t-mobiles-new-better-value-plan-includes-netflix-hulu-and-a-mobile-hotspot-it-could-save-you-usd1-000-versus-the-competition</link>
      <pubDate>Tue, 20 Jan 2026 16:13:49 +0000</pubDate>
      <guid isPermaLink="false">pdwfUT7T8YG2TUBR84iaNQ</guid>
      <description>T-Mobile's Better Value family plan offers an incredible new unlimited data option for families - a cheap plan with a serious amount of perks.</description>
    </item>
    <item>
      <title>Cyberpunk 2077 : un mod tr&#232;s populaire supprim&#233; pour une raison qui divise</title>
      <link>https://www.frandroid.com/produits-android/console/2949119_cyberpunk-2077-un-mod-tres-populaire-supprime-pour-une-raison-qui-divise</link>
      <pubDate>Tue, 20 Jan 2026 16:12:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2949119_cyberpunk-2077-un-mod-tres-populaire-supprime-pour-une-raison-qui-divise</guid>
      <description>
Un mod de Cyberpunk 2077 dispara&#238;t malgr&#233; son grand succ&#232;s aupr&#232;s des joueurs. Son d&#233;veloppeur se justifie, mais les arguments ont du mal &#224; passer chez certains.
</description>
    </item>
    <item>
      <title>Amazon d&#233;gaine un tas d&#8217;offres durant les soldes, mais voici les 15 deals &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2933045_amazon-fait-le-plein-de-bonnes-affaires-durant-les-soldes-le-top-16-des-offres</link>
      <pubDate>Tue, 20 Jan 2026 16:10:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933045_amazon-fait-le-plein-de-bonnes-affaires-durant-les-soldes-le-top-16-des-offres</guid>
      <description>
Les soldes d&#8217;hiver battent encore leur plein chez Amazon, et tout le monde peut en profiter &#8212; m&#234;me sans &#234;tre membre Prime&#8239;! Alors que la 3&#7497; d&#233;marque approche, le g&#233;ant am&#233;ricain propose encore une large s&#233;lection de remises &#224; ne pas manquer. C&#8217;est le moment id&#233;al pour faire de bonnes affaires avant la prochaine vague de r&#233;ductions.
</description>
    </item>
    <item>
      <title>Elon Musk Jumps Into the Race to Replace Mitch McConnell</title>
      <link>https://gizmodo.com/elon-musk-jumps-into-the-race-to-replace-mitch-mcconnell-2000711915</link>
      <pubDate>Tue, 20 Jan 2026 16:10:17 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711915</guid>
      <description>The multibillionaire took a break from being the most hated man in America. He's back.</description>
    </item>
    <item>
      <title>How to watch The Fall and Rise of Reggie Dinkins online &#8212; stream the sports sitcom with Daniel Radcliffe from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/watch-the-fall-and-rise-of-reggie-dinkins-online</link>
      <pubDate>Tue, 20 Jan 2026 16:09:58 +0000</pubDate>
      <guid isPermaLink="false">BxDoe8rDcnsZdML92oyKPP</guid>
      <description>Here&#8217;s how to stream The Fall and Rise of Reggie Dinkins online and and watch abroad with a VPN.</description>
    </item>
    <item>
      <title>Rad Power Bikes warehouse catches fire following flammable battery warnings</title>
      <link>https://www.engadget.com/transportation/rad-power-bikes-warehouse-catches-fire-following-flammable-battery-warnings-133056542.html?src=rss</link>
      <pubDate>Tue, 20 Jan 2026 16:08:16 +0000</pubDate>
      <guid isPermaLink="false">8cda54fb-9e83-4718-adf2-6735fb66cb30</guid>
      <description>In a strange twist of fate, a fire broke out this week at the Rad Power Bikes retail store warehouse in Huntington Beach, California, Electrek reports. The structural blaze came less than two months after the Consumer Product Safety Commission (CPSC) warned customers to "immediately stop" using and dispose of some of the company's e-bike batteries due to fire hazard. In December, Rad filed for Chapter 11 bankruptcy protection, stating it couldn't afford to recall the batteries.&#160;
"We&#8217;re working with local authorities to review a thermal incident that occurred at our Huntington Beach store Sunda...</description>
    </item>
    <item>
      <title>Arc Raiders' design lead says Embark's 'ambitions are definitely large' when it comes to developing the PvE experience</title>
      <link>https://www.techradar.com/gaming/arc-raiders-design-lead-says-embarks-ambitions-are-definitely-large-when-it-comes-to-developing-the-pve-experience</link>
      <pubDate>Tue, 20 Jan 2026 16:07:08 +0000</pubDate>
      <guid isPermaLink="false">nCvmvK4V3v7KVtrxTd86dM</guid>
      <description>Arc Raiders design lead Virgil Watkins has said Embark Studios is looking to "escalate" PvE further, saying it's something "we're looking at growing next."</description>
    </item>
    <item>
      <title>Sony hands TV business to TCL. What it means for you.</title>
      <link>https://mashable.com/article/sony-hands-bravia-tv-line-to-tcl</link>
      <pubDate>Tue, 20 Jan 2026 16:07:02 +0000</pubDate>
      <guid isPermaLink="false">05eZ47r5VqfDx434q6UMCgP</guid>
      <description>Sony hands TV business to TCL. What it means for you.</description>
    </item>
    <item>
      <title>Ads in Xbox Game Pass Were Inevitable</title>
      <link>https://gizmodo.com/ads-in-xbox-game-pass-were-inevitable-2000711941</link>
      <pubDate>Tue, 20 Jan 2026 16:05:36 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711941</guid>
      <description>Microsoft&#8217;s first cloud-based game streaming service could be its first crack at ads in Game Pass.</description>
    </item>
    <item>
      <title>Spotify veut synchroniser livres papier et livres audio</title>
      <link>https://www.01net.com/actualites/spotify-veut-synchroniser-livres-papier-et-livres-audio.html</link>
      <pubDate>Tue, 20 Jan 2026 16:01:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321293</guid>
      <description>Spotify ne se limite pas &#224; la musique : depuis un bon moment maintenant, on peut aussi &#233;couter des podcasts, et m&#234;me des livres audio. La plateforme de streaming ne veut pas s'arr&#234;ter en si bon chemin : elle pr&#233;pare un syst&#232;me pour passer facilement d'un bon vieux bouquin en papier &#224; sa version audio !</description>
    </item>
    <item>
      <title>New reported Spotify feature syncs audiobooks to physical books</title>
      <link>https://mashable.com/article/spotify-audiobooks-page-match-feature</link>
      <pubDate>Tue, 20 Jan 2026 16:01:00 +0000</pubDate>
      <guid isPermaLink="false">06JBfaKmc43ey3CV12p16pE</guid>
      <description>Spotify is reportedly working on a feature that will sync an audiobook to where you are in a physical copy.</description>
    </item>
    <item>
      <title>Humans&amp;, a &#8216;human-centric&#8217; AI startup founded by Anthropic, xAI, Google alums, raised $480M seed round</title>
      <link>https://techcrunch.com/2026/01/20/humans-a-human-centric-ai-startup-founded-by-anthropic-xai-google-alums-raised-480m-seed-round/</link>
      <pubDate>Tue, 20 Jan 2026 16:00:57 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083788</guid>
      <description>Humans&amp;, a startup that believes AI should empower people, not replace them, has reportedly raised a $480 million seed round at a $4.48 billion valuation.</description>
    </item>
    <item>
      <title>'The film now is so expensive. I hate spending that much money on each shot' &#8212; photography icon Sally Mann finally switches to a digital camera after decades using film</title>
      <link>https://www.techradar.com/cameras/photography/the-film-now-is-so-expensive-i-hate-spending-that-much-money-on-each-shot-photography-icon-sally-mann-finally-switches-to-a-digital-camera-after-decades-using-film</link>
      <pubDate>Tue, 20 Jan 2026 16:00:19 +0000</pubDate>
      <guid isPermaLink="false">wVrfnETtxv8kSpuMwvSrTZ</guid>
      <description>Photography icon Sally Mann, describes how she's embraced a digital camera and color photography, after decades shooting in black-and-white with 8 x 10 sheet film</description>
    </item>
    <item>
      <title>Eat App wants a bite of India&#8217;s restaurant reservation business with an aquistion and Swiggy partnership</title>
      <link>https://techcrunch.com/2026/01/20/eat-app-wants-a-bite-of-indias-restaurant-reservation-business-with-an-aquistion-and-swiggy-partnership/</link>
      <pubDate>Tue, 20 Jan 2026 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078174</guid>
      <description>Eat App is making India its central focus to market its reservation and dine-in growth suite</description>
    </item>
    <item>
      <title>Inter Milan vs Arsenal Free Streams: How to watch Champions League 2025/26 online from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/football/inter-milan-vs-arsenal-champions-league-2025-26-free</link>
      <pubDate>Tue, 20 Jan 2026 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">tnCoYYGDVPSPq2JJTJgeR8</guid>
      <description>All the ways to watch Inter Milan vs Arsenal live streams from anywhere, with both side's seeking to reach the knockout stages.</description>
    </item>
    <item>
      <title>Apple peut continuer &#224; utiliser son dispositif de suivi publicitaire en France&#8230; pour l&#8217;instant</title>
      <link>https://www.01net.com/actualites/apple-peut-continuer-a-utiliser-son-dispositif-de-suivi-publicitaire-en-france-pour-linstant.html</link>
      <pubDate>Tue, 20 Jan 2026 15:59:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321186</guid>
      <description>Ce mardi 20 janvier, Apple a gagn&#233; un round dans la bataille qui l'oppose &#224; l'&#233;cosyst&#232;me de la publicit&#233; en ligne. Le tribunal judiciaire de Paris a d&#233;cid&#233;, dans une proc&#233;dure en r&#233;f&#233;r&#233;, de ne pas suspendre le dispositif de suivi publicitaire d'Apple.</description>
    </item>
    <item>
      <title>SpaceX didn&#8217;t properly inspect crane before collapse at Starbase, OSHA says</title>
      <link>https://techcrunch.com/2026/01/20/spacex-didnt-properly-inspect-crane-before-collapse-at-starbase-osha-says/</link>
      <pubDate>Tue, 20 Jan 2026 15:55:45 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083766</guid>
      <description>The federal safety agency has hit SpaceX with a $115,850 fine after finding seven "serious" violations during its investigation.</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver : il y a des tablettes tactiles avec plus de 1 000 euros de r&#233;duction ! Voici notre top 9 des meilleures offres</title>
      <link>https://www.frandroid.com/bons-plans/2941463_soldes-dhiver-entre-un-ipad-pro-a-50-et-des-tablettes-pas-cheres-encore-moins-cheres-cest-la-foire-aux-offres-dans-ce-top-des-deals</link>
      <pubDate>Tue, 20 Jan 2026 15:52:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2941463_soldes-dhiver-entre-un-ipad-pro-a-50-et-des-tablettes-pas-cheres-encore-moins-cheres-cest-la-foire-aux-offres-dans-ce-top-des-deals</guid>
      <description>
Il n'y a pas que les smartphones et les TV 4K qui profitent des soldes d'hiver, les tablettes tactiles aussi bien entendu. On peut s'attendre &#224; ce que seuls les mod&#232;les pas chers soient concern&#233;s, mais m&#234;me la tranche premium est frapp&#233;e de plein fouet par les r&#233;ductions. Voici notre top des meilleurs deals.
</description>
    </item>
    <item>
      <title>Mode furtif et ch&#226;ssis blind&#233; : Garmin d&#233;voile la montre ultime pour les militaires, mais pas seulement</title>
      <link>https://www.frandroid.com/actualites-generales/2949031_mode-furtif-et-chassis-blinde-garmin-devoile-la-montre-ultime-pour-les-militaires-mais-pas-seulement</link>
      <pubDate>Tue, 20 Jan 2026 15:52:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2949031_mode-furtif-et-chassis-blinde-garmin-devoile-la-montre-ultime-pour-les-militaires-mais-pas-seulement</guid>
      <description>
Garmin a annonc&#233; le lancement de sa nouvelle Tactix 8 Cerakote. Comme le mod&#232;le classique, il s'agit d'une montre haut de gamme pens&#233;e avant tout pour un usage militaire. 
</description>
    </item>
    <item>
      <title>Surprise, Bouygues Telecom lance discr&#232;tement une nouvelle Bbox Wi-Fi 7</title>
      <link>https://www.frandroid.com/marques/bouygues-telecom/2949257_surprise-bouygues-telecom-lance-discretement-une-nouvelle-bbox-wifi-7</link>
      <pubDate>Tue, 20 Jan 2026 15:51:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bouygues-telecom/2949257_surprise-bouygues-telecom-lance-discretement-une-nouvelle-bbox-wifi-7</guid>
      <description>
En plus de sa Bbox 5G, Bouygues Telecom lance aussi une nouvelle Bbox Wi-Fi 7 plus accessible. L'ancienne Bbox Wi-Fi 7 change de nom.
</description>
    </item>
    <item>
      <title>Is This Really the iPhone 18 Pro?</title>
      <link>https://gizmodo.com/is-this-really-the-iphone-18-pro-2000711918</link>
      <pubDate>Tue, 20 Jan 2026 15:50:10 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711918</guid>
      <description>The YouTuber/leaker who Apple is suing says it is.</description>
    </item>
    <item>
      <title>iPhone 18 leaks about Dynamic Island redesign may have been the result of mistranslation</title>
      <link>https://mashable.com/article/iphone-18-leak-dynamic-island-incorrect-translation</link>
      <pubDate>Tue, 20 Jan 2026 15:45:21 +0000</pubDate>
      <guid isPermaLink="false">073JGZTPPYEKtjkcyGidmgx</guid>
      <description>Reports about the demise of the Dynamic Island on the iPhone 18 Pro appear to have been an error, possibly due to a mistranslation.</description>
    </item>
    <item>
      <title>OpenAI says its mystery AI wearable is on track for 2026 as AI earbuds rumors spread</title>
      <link>https://mashable.com/article/openai-ai-wearable-2026-release-earbuds-rumors</link>
      <pubDate>Tue, 20 Jan 2026 15:44:10 +0000</pubDate>
      <guid isPermaLink="false">06qicIFGKcenWsniiNqkA9I</guid>
      <description>OpenAI says its on track to release its first AI hardware product in 2026, and rumors point to some type of AI-powered wireless earbuds.</description>
    </item>
    <item>
      <title>Roborocks first CES 2026 robot vacuum is out and on sale: Get the Qrevo Curv 2 Flow for $849.99</title>
      <link>https://mashable.com/article/jan-20-roborock-qrevo-curv-2-flow-release-deal</link>
      <pubDate>Tue, 20 Jan 2026 15:38:22 +0000</pubDate>
      <guid isPermaLink="false">02h9RR0ZDK6lxjbpkyDFlTu</guid>
      <description>The roller mop Qrevo Curv 2 Flow is the first big CES robot vacuum release. Buy it now for $849.99 ($150 off).</description>
    </item>
    <item>
      <title>Gaming More Than 10 Hours a Week? You&#8217;ll Want to Read This</title>
      <link>https://gizmodo.com/gaming-more-than-10-hours-a-week-youll-want-to-read-this-2000711944</link>
      <pubDate>Tue, 20 Jan 2026 15:35:08 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711944</guid>
      <description>Here's what scientists discovered when they investigated the health of three types of video gamers in Australia.</description>
    </item>
  </channel>
</rss>
