<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 03 Jan 2026 10:25:39 GMT</lastBuildDate>
    <item>
      <title>Ce TV QD-Mini LED 144 Hz g&#233;ant de 75&#8243;, taill&#233; pour le gaming, profite d&#8217;une belle ristourne de 300 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2924495_ce-tv-qd-mini-led-144-hz-geant-de-75-taille-pour-le-gaming-profite-dune-belle-ristourne-de-300-e</link>
      <pubDate>Sat, 03 Jan 2026 10:23:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2924495_ce-tv-qd-mini-led-144-hz-geant-de-75-taille-pour-le-gaming-profite-dune-belle-ristourne-de-300-e</guid>
      <description>
Envie d&#8217;un t&#233;l&#233;viseur capable d&#8217;assurer aussi bien c&#244;t&#233; films et s&#233;ries que manette en main ? Le TCL 75C6K est peut-&#234;tre la r&#233;ponse. Une dalle QD-MiniLED, du Dolby Atmos, et une fr&#233;quence qui grimpe jusqu&#8217;&#224; 240 Hz en mode jeu : le spectacle est autant visuel que nerveux. Et pour finir de convaincre, son prix glisse de 1 199 euros &#224; 898 euros chez Ubaldi.
...</description>
    </item>
    <item>
      <title>Comment optimiser la batterie de la ROG Xbox Ally (et ROG Xbox Ally X) ?</title>
      <link>https://www.frandroid.com/marques/asus/2899745_comment-optimiser-la-batterie-de-la-rog-xbox-ally-et-rog-xbox-ally-x</link>
      <pubDate>Sat, 03 Jan 2026 10:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/asus/2899745_comment-optimiser-la-batterie-de-la-rog-xbox-ally-et-rog-xbox-ally-x</guid>
      <description>
Il ne fait aucun doute que la ROG Xbox Ally (et d'autant plus sa version Ally X) est une machine puissante, mais le revers de la m&#233;daille, c'est qu'elle est &#233;galement gourmande c&#244;t&#233; autonomie. Alors pour profiter davantage de vos sessions nomades, voici tout un tas d'astuces indispensables pour &#233;tirer l&#8217;autonomie sans sacrifier le plaisir de jeu.
</description>
    </item>
    <item>
      <title>How to Protect Your iPhone or Android Device From Spyware</title>
      <link>https://www.wired.com/story/how-to-protect-your-iphone-or-android-device-from-spyware/</link>
      <pubDate>Sat, 03 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">693b09f747be3ac40e057fb2</guid>
      <description>Being targeted by sophisticated spyware is relatively rare, but experts say that everyone needs to stay vigilant as this dangerous malware continues to proliferate worldwide.</description>
    </item>
    <item>
      <title>Notion isn't just a note-taking app &#8211;here are 5 ways I'm using it to run my life in 2026</title>
      <link>https://www.techradar.com/computing/websites-apps/notion-is-now-way-more-than-a-note-taking-app-here-are-5-ways-im-using-it-to-run-my-life-in-2026</link>
      <pubDate>Sat, 03 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">pguMBgTJdo7j94bTKYQkWS</guid>
      <description>Notion has become an all-in-one app like no other &#8211; here&#8217;s why it&#8217;s worth a look in 2026, plus my favorite new tools.</description>
    </item>
    <item>
      <title>How Broadcom went from a simple Hewlett Packard division to eventually grew and become a tech industry behemoth</title>
      <link>https://www.techradar.com/pro/how-broadcom-went-from-a-simple-hewlett-packard-division-to-eventually-grew-and-become-a-tech-industry-behemoth</link>
      <pubDate>Sat, 03 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">krkjtJqd5uSUGYjNwXqvd</guid>
      <description>Broadcom's early beginning date back to the 1960s - we take a look back.</description>
    </item>
    <item>
      <title>Stop burning money in 2026: How to find and cancel your unneeded subscriptions&#160;easily</title>
      <link>https://www.fastcompany.com/91452853/subscripition-creep-kills-budget-find-cancel-unneeded-subscriptions-easily-stop-burning-money-2026</link>
      <pubDate>2026-01-03T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91452853/subscripition-creep-kills-budget-find-cancel-unneeded-subscriptions-easily-stop-burning-money-2026</guid>
      <description>Subscription creep is real, and it can kill your budget. You could free up hundreds of dollars per year by following these simple steps.
The new year often brings sticker shock. A glance at our bank statements and credit card bills shows just how much we spent during the holidays, serving as a painful reminder that with the festivities behind us, we should work on getting our expenditures under control....</description>
    </item>
    <item>
      <title>How to deep-clean your coffee maker for a better-tasting espresso in 2026 &#8211; a barista's guide</title>
      <link>https://www.techradar.com/home/coffee-machines/how-to-deep-clean-your-coffee-maker</link>
      <pubDate>Sat, 03 Jan 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">8dH4qtGsqTs87mrVCQqLz4</guid>
      <description>Deep clean your coffee maker for the tastiest espresso ever &#8211; six top tips from a barista</description>
    </item>
    <item>
      <title>Quels sont les meilleurs &#233;couteurs sans fil pas chers en 2026 ? Notre s&#233;lection</title>
      <link>https://www.frandroid.com/guide-dachat/guide-audio/1042881_meilleurs-ecouteurs-sans-fil-pas-cher</link>
      <pubDate>Sat, 03 Jan 2026 09:02:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-audio/1042881_meilleurs-ecouteurs-sans-fil-pas-cher</guid>
      <description>
Vous n'avez pas le budget pour des &#233;couteurs Bluetooth &#224; plusieurs centaines d'euros ? Rassurez-vous, il est facile de trouver des mod&#232;les sans fil fiables et performants &#224; moins de 100 euros. D&#233;couvrez ici notre s&#233;lection des meilleures options d'&#233;couteurs pour allier qualit&#233; et petit prix.
</description>
    </item>
    <item>
      <title>&#171;&#160;Aerominum&#160;&#187; : LG invente un mat&#233;riau mais oublie d&#8217;en livrer la fiche technique</title>
      <link>https://www.01net.com/actualites/aerominum-lg-invente-un-materiau-mais-oublie-den-livrer-la-fiche-technique.html</link>
      <pubDate>Sat, 03 Jan 2026 09:00:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317919</guid>
      <description>L'industrie de la tech adore se gargariser de n&#233;ologismes abscons, et LG n'est pas le dernier &#224; s'adonner &#224; cette passion. Le constructeur a en effet d&#233;voil&#233; un tout nouveau mat&#233;riau baptis&#233; &#171; Aerominum &#187; qui all&#232;ge ses nouveaux tr&#232;s grands portables. Malheureusement, il n'y a pas beaucoup de caract&#233;ristiques derri&#232;re les beaux discours.</description>
    </item>
    <item>
      <title>Samsung Galaxy S26 Ultra : One UI 8.5 montre d&#233;j&#224; la fonction la plus innovante du smartphone</title>
      <link>https://www.frandroid.com/marques/samsung/2926179_samsung-galaxy-s26-ultra-one-ui-8-5-montre-deja-la-fonction-la-plus-innovante-du-smartphone</link>
      <pubDate>Sat, 03 Jan 2026 08:45:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2926179_samsung-galaxy-s26-ultra-one-ui-8-5-montre-deja-la-fonction-la-plus-innovante-du-smartphone</guid>
      <description>
Voici encore une nouvelle preuve tangible de l'existence d'un filtre de confidentialit&#233; intelligent sur l'&#233;cran du Samsung Galaxy S26 Ultra.
</description>
    </item>
    <item>
      <title>Garmin Instinct 3 Solar : cette montre outdoor &#224; l&#8217;autonomie illimit&#233;e en promo devient l&#8217;alli&#233;e id&#233;ale pour vos d&#233;fis de 2026</title>
      <link>https://www.frandroid.com/bons-plans/2924769_garmin-instinct-3-solar-cette-montre-outdoor-a-lautonomie-illimitee-en-promo-devient-lalliee-ideale-pour-vos-defis-de-2026</link>
      <pubDate>Sat, 03 Jan 2026 08:32:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2924769_garmin-instinct-3-solar-cette-montre-outdoor-a-lautonomie-illimitee-en-promo-devient-lalliee-ideale-pour-vos-defis-de-2026</guid>
      <description>
Avec sa recharge solaire, la Garmin Instinct 3 Solar poss&#232;de 28 jours d'autonomie et pourra vous accompagner dans toutes vos sorties. Chez Alltricks, elle perd 60 euros de son prix et chute &#224; 339 euros.
</description>
    </item>
  </channel>
</rss>
