<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 23 Dec 2025 08:35:26 GMT</lastBuildDate>
    <item>
      <title>Google Pixel Buds 2a : un son chaleureux, des limites pratiques</title>
      <link>https://www.frandroid.com/marques/google/2911021_google-pixel-buds-2a-un-son-chaleureux-des-limites-pratiques</link>
      <pubDate>Tue, 23 Dec 2025 08:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2911021_google-pixel-buds-2a-un-son-chaleureux-des-limites-pratiques</guid>
      <description>
Cinquante euros. C'est l'&#233;cart de prix entre les anciens Pixel Buds A et ces nouveaux Pixel Buds 2a affich&#233;s &#224; 149 euros. Une augmentation de 50 % qui pose question dans un march&#233; ultra-concurrentiel. Les Pixel Buds A-Series s&#233;duisaient gr&#226;ce &#224; leur tarif agressif et leurs bonnes prestations. La question se pose donc : que justifie une telle hausse de prix ?
...</description>
    </item>
    <item>
      <title>&#201;cran OLED, Snapdragon 8 Elite Gen 5, charge 80 W : le r&#233;cent Nubia Z80 Ultra est 15 % moins cher juste avant No&#235;l</title>
      <link>https://www.frandroid.com/bons-plans/2918439_ecran-oled-snapdragon-8-elite-gen-5-charge-80-w-le-recent-nubia-z80-ultra-est-15-moins-cher-juste-avant-noel</link>
      <pubDate>Tue, 23 Dec 2025 08:10:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2918439_ecran-oled-snapdragon-8-elite-gen-5-charge-80-w-le-recent-nubia-z80-ultra-est-15-moins-cher-juste-avant-noel</guid>
      <description>
Rempla&#231;ant du Nubia Z70 Ultra, le Nubia Z80 Ultra vient d'&#234;tre lanc&#233; en 2025 par la marque chinoise, avec une fiche technique des plus prometteuses. Actuellement, vous trouverez ce smartphone &#224; 679 euros au lieu de 799 euros chez Joybuy.
</description>
    </item>
    <item>
      <title>Les cadeaux pr&#233;f&#233;r&#233;s de la r&#233;daction&#160;: on offre quoi &#224; un journaliste tech&#160;?</title>
      <link>https://www.01net.com/actualites/les-cadeaux-preferes-de-la-redaction-on-offre-quoi-a-un-journaliste-tech.html</link>
      <pubDate>Tue, 23 Dec 2025 08:01:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315154</guid>
      <description>&#192; quelques heures du 25 d&#233;cembre, l&#8217;&#233;quipe de 01net vous propose de d&#233;couvrir le cadeau tech que ses journalistes souhaiteraient recevoir ou offrir &#224; No&#235;l. Il y en a pour tous les go&#251;ts et pour tous les prix.</description>
    </item>
    <item>
      <title>The best Nintendo Switch 2 accessories for 2026</title>
      <link>https://www.engadget.com/gaming/nintendo/best-nintendo-switch-2-accessories-070011952.html?src=rss</link>
      <pubDate>Tue, 23 Dec 2025 08:00:36 +0000</pubDate>
      <guid isPermaLink="false">89ee5c5b-3997-4385-8587-5539ca627d35</guid>
      <description>Whether you just got a Switch 2 or you've had yours for a while, you may want to grab some key accessories to make it fit your gaming style even more than it already does. Not only can the right accessories make it easier and more fun to play all of the games you love, but they can also make your gaming experience better in different environments, be it on the couch, in an airplane or in the car. We've got to try out some of the latest Switch 2 accessories, and some of our old favorites are also compatible with the new console. These are our current favorite Nintendo Switch 2 accessories, and ...</description>
    </item>
    <item>
      <title>I review e-bikes for a living, and these are my top 3 electric bikes from 2025</title>
      <link>https://www.techradar.com/health-fitness/bikes/i-review-e-bikes-for-a-living-and-these-are-my-top-3-electric-bikes-from-2025</link>
      <pubDate>Tue, 23 Dec 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">xzzmj6LaBZKSAK34kBjbJJ</guid>
      <description>2026 is almost here and it was a bumper year for powered vehicles. Here are the best e-bikes I tested this year.</description>
    </item>
    <item>
      <title>Inside San Francisco&#8217;s coffeehouse-fueled AI scene, where million-dollar deals happen over cortados</title>
      <link>https://www.fastcompany.com/91462325/inside-san-franciscos-coffee-shop-ai-scene-where-million-dollar-deals-happen-over-cortados</link>
      <pubDate>2025-12-23T08:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91462325/inside-san-franciscos-coffee-shop-ai-scene-where-million-dollar-deals-happen-over-cortados</guid>
      <description>The best work doesn&#8217;t happen in offices. It happens where life happens. Where the coffee is strong, the Wi-Fi is reliable enough, and the person next to you might just have the insight that changes everything.
Fintech firm Mercury recently dropped some data that made me smile. It ranked the top five coffee shops powering founders in San Francisco based on actual transaction data: Sightglass, CoffeeShop, Equator, Saint Frank, Ritual. I&#8217;ve built Octolane with my cofounder, Rafi, from every single one of them....</description>
    </item>
    <item>
      <title>Cette alternative &#224; ChatGPT et Nano Banana fait mieux que Photoshop</title>
      <link>https://www.frandroid.com/culture-tech/2918873_cette-alternative-a-chatgpt-et-nano-banana-fait-mieux-que-photoshop</link>
      <pubDate>Tue, 23 Dec 2025 07:42:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/2918873_cette-alternative-a-chatgpt-et-nano-banana-fait-mieux-que-photoshop</guid>
      <description>
Le g&#233;ant Alibaba publie une nouvelle version de son IA de g&#233;n&#233;ration d'images Qwen. La promesse est redoutable : une g&#233;n&#233;ration sur plusieurs calques dissoci&#233;s.
</description>
    </item>
    <item>
      <title>Firefox promet un bouton &#8220;kill switch&#8221; pour tuer l&#8217;intelligence artificielle</title>
      <link>https://www.01net.com/actualites/firefox-promet-un-bouton-kill-switch-pour-tuer-lintelligence-artificielle.html</link>
      <pubDate>Tue, 23 Dec 2025 07:37:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316579</guid>
      <description>La nomination du nouveau patron de Mozilla la semaine derni&#232;re s&#8217;est accompagn&#233;e d&#8217;une annonce qui a suscit&#233; une vague de critiques, l&#8217;apparition de l&#8217;intelligence artificielle au sein du navigateur. Pour apaiser les tensions, l&#8217;entreprise vient de promettre l&#8217;int&#233;gration d&#8217;un bouton &#171;&#160;kill switch&#160;&#187;, un outil permettant aux utilisateurs de d&#233;sactiver compl&#232;tement les outils IA dans Firefox....</description>
    </item>
    <item>
      <title>Fini les probl&#232;mes de stockage sur votre PS5 gr&#226;ce &#224; ce SSD Lexar Play 1 To avec dissipateur thermique &#224; moins de 80 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2917997_fini-les-problemes-de-stockage-sur-votre-ps5-grace-a-ce-ssd-lexar-play-1-to-avec-dissipateur-thermique-a-moins-de-80-e</link>
      <pubDate>Tue, 23 Dec 2025 07:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2917997_fini-les-problemes-de-stockage-sur-votre-ps5-grace-a-ce-ssd-lexar-play-1-to-avec-dissipateur-thermique-a-moins-de-80-e</guid>
      <description>
Gr&#226;ce au 1 To de stockage de ce Lexar Play, vous pourrez doubler l'espace disponible sur votre PS5. Chez Darty, ce SSD passe &#224; 79,99 euros au lieu de 99,99 euros.
</description>
    </item>
    <item>
      <title>Fuite de donn&#233;es chez Chronopost&#160;: les informations vol&#233;es viennent &#171;&#160;d&#8217;un incident remontant au printemps 2025&#160;&#187;</title>
      <link>https://www.01net.com/actualites/nouvelle-fuite-chez-chronopost-pirate-affirme-avoir-vole-donnees-860-000-francais.html</link>
      <pubDate>Tue, 23 Dec 2025 07:26:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316574</guid>
      <description>Chronopost a subi une fuite de donn&#233;es. Sur BreachForums, un pirate affirme avoir mis la main sur les donn&#233;es li&#233;es &#224; 860 000 colis exp&#233;di&#233;s en France. Les informations auraient &#233;t&#233; exfiltr&#233;es par le biais du r&#233;seau de points relais Pickup. Chronopost &#233;voque des donn&#233;es vol&#233;es au printemps dernier.</description>
    </item>
    <item>
      <title>Comment nettoyer et d&#233;sinfecter son smartphone, son clavier, sa manette, ses &#233;couteurs ou sa souris ?</title>
      <link>https://www.frandroid.com/comment-faire/tutoriaux/679024_nos-smartphones-claviers-manettes-ecouteurs-et-souris-sont-des-nids-a-bacteries-et-a-virus</link>
      <pubDate>Tue, 23 Dec 2025 07:16:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/comment-faire/tutoriaux/679024_nos-smartphones-claviers-manettes-ecouteurs-et-souris-sont-des-nids-a-bacteries-et-a-virus</guid>
      <description>
Voici quelques conseils pour nettoyer et d&#233;sinfecter votre &#233;cran de smartphone, vos &#233;couteurs, votre manette de jeu, votre tablette tactile, votre clavier ou votre souris.
</description>
    </item>
    <item>
      <title>Les t&#233;l&#233;s connect&#233;es de Samsung, LG et Sony accus&#233;es d&#8217;espionner les t&#233;l&#233;spectateurs</title>
      <link>https://www.01net.com/actualites/les-teles-connectees-de-samsung-lg-et-sony-accusees-despionner-les-telespectateurs.html</link>
      <pubDate>Tue, 23 Dec 2025 07:03:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316705</guid>
      <description>Les principaux constructeurs de t&#233;l&#233;s connect&#233;es vont devoir r&#233;pondre &#224; une accusation tr&#232;s s&#233;rieuse : leurs lucarnes espionneraient les t&#233;l&#233;spectateurs en r&#233;alisant en douce des captures d'&#233;cran de ce qu'ils regardent. De quoi alimenter les profils de suivi publicitaire des utilisateurs, et pire encore.</description>
    </item>
    <item>
      <title>Groupon Promo Codes: 50% Off in January 2026</title>
      <link>https://www.wired.com/story/groupon-promo-code/</link>
      <pubDate>Tue, 23 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">674f7c8fa6af00e18ee649c1</guid>
      <description>Unlock up to 50% off, 40% off packages, and 25% off with top Groupon coupon codes. Explore coupons to save extra on travel getaways, holiday gifts, spa days, and event tickets.</description>
    </item>
    <item>
      <title>Simon Sinek: Gen Z won&#8217;t work without a clear payout. Here&#8217;s why</title>
      <link>https://www.fastcompany.com/91465039/simon-sinek-gen-z-wont-work-without-a-clear-payout-heres-why</link>
      <pubDate>2025-12-23T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91465039/simon-sinek-gen-z-wont-work-without-a-clear-payout-heres-why</guid>
      <description>Business leaders say the reason makes perfect sense.
Gen Zers, who were practically born with smartphones and iPads in their hands, have grown up completely immersed in the information highway. Therefore, it should come as no big surprise that those born as digital natives&#8212;deeply connected to culture, trends, politics, and business&#8212;have different ideas about what their contributions to the world should look like. They deeply value work-life balance and they need to feel like the work they do has meaning.&#160;...</description>
    </item>
    <item>
      <title>Voici le meilleur PC portable de l&#8217;ann&#233;e &#8211; Frandroid Awards 2025</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2911721_voici-le-meilleur-pc-portable-de-lannee-frandroid-awards-2025</link>
      <pubDate>Tue, 23 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2911721_voici-le-meilleur-pc-portable-de-lannee-frandroid-awards-2025</guid>
      <description>
Le meilleur PC portable test&#233; cette ann&#233;e par la r&#233;daction de Frandroid est le Lenovo Yoga Slim 7i Aura. D&#233;couvrez pourquoi ce dernier a re&#231;u le Frandroid Awards avec Delos de sa cat&#233;gorie.
</description>
    </item>
    <item>
      <title>iOS 26.3&#160;: les &#233;couteurs Bluetooth tiers se connecteront aussi facilement que des AirPods sur votre iPhone</title>
      <link>https://www.01net.com/actualites/ios-26-3-les-ecouteurs-bluetooth-tiers-se-connecteront-aussi-facilement-que-des-airpods-sur-votre-iphone.html</link>
      <pubDate>Tue, 23 Dec 2025 06:47:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316748</guid>
      <description>Pour se mettre en conformit&#233; avec le DMA, Apple introduit dans iOS 26.3 quelques changements d&#8217;interop&#233;rabilit&#233; avec les accessoires tiers. Les montres connect&#233;es et autres casques sans fil se connecteront bient&#244;t &#224; votre iPhone aussi facilement que des AirPods.</description>
    </item>
  </channel>
</rss>
