<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 21 Dec 2025 08:31:20 GMT</lastBuildDate>
    <item>
      <title>OnePlus 15R : ce nouveau smartphone not&#233; 8/10 est disponible en pr&#233;commande et profite d&#233;j&#224; d&#8217;une offre all&#233;chante</title>
      <link>https://www.frandroid.com/marques/2915187_oneplus-15r-ce-nouveau-smartphone-note-8-10-est-disponible-en-precommande-et-profite-deja-dune-offre-allechante</link>
      <pubDate>Sun, 21 Dec 2025 08:23:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2915187_oneplus-15r-ce-nouveau-smartphone-note-8-10-est-disponible-en-precommande-et-profite-deja-dune-offre-allechante</guid>
      <description>
Le nouveau flagship de OnePlus, le 15R n&#8217;a m&#234;me pas encore officiellement pos&#233; un pied sur le march&#233; qu&#8217;une promotion vient d&#233;j&#224; s&#8217;inviter &#224; la pr&#233;commande. La version 12/512 Go s&#8217;affiche au m&#234;me tarif que la d&#233;clinaison 256 Go, soit 729 euros au lieu de 829 euros, directement sur le site de la marque.
</description>
    </item>
    <item>
      <title>I tested HP's take on the MacBook Pro - and the HP ZBook X G1i is a surprisingly impressive mobile workstation for professionals and creators</title>
      <link>https://www.techradar.com/pro/hp-zbook-x-g1i-mobile-workstation-review</link>
      <pubDate>Sun, 21 Dec 2025 07:45:00 +0000</pubDate>
      <guid isPermaLink="false">WMCj9DCojRvarMf5jaszs7</guid>
      <description>The HP ZBook X G1i is a mobile workstation with high-powered Intel Core Ultra processors, NPUs, plenty of RAM, powerful graphics, and excellent connectivity.</description>
    </item>
    <item>
      <title>Microsoft&#160;: pourquoi 2025 restera l&#8217;ann&#233;e du cauchemar (et ce n&#8217;est pas fini)</title>
      <link>https://www.01net.com/actualites/microsoft-pourquoi-2025-restera-lannee-du-cauchemar-et-ce-nest-pas-fini.html</link>
      <pubDate>Sun, 21 Dec 2025 07:24:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316399</guid>
      <description>Entre la fin brutale de Windows 10, le fiasco de l&#8217;IA Recall et l&#8217;effondrement de la strat&#233;gie Xbox, 2025 s'impose comme l'ann&#233;e noire de Microsoft. Autopsie d&#8217;un g&#226;chis historique.</description>
    </item>
    <item>
      <title>The most important year-end metrics aren&#8217;t on your balance sheet</title>
      <link>https://www.fastcompany.com/91462762/the-most-important-year-end-metrics-arent-financial</link>
      <pubDate>2025-12-21T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91462762/the-most-important-year-end-metrics-arent-financial</guid>
      <description>As leaders plan for the year ahead, nonfinancial metrics offer the clearest signal of whether growth is truly sustainable.
As the year winds down, many leaders find themselves in a familiar ritual: closing the books, reviewing revenue targets, and drafting ambitious financial goals for the year ahead. These practices are important. But after years of designing teams and advising organizations at different stages of growth, I&#8217;ve come to believe that the most valuable year-end ritual has little to do with money alone....</description>
    </item>
    <item>
      <title>Voici le meilleur vid&#233;oprojecteur de l&#8217;ann&#233;e &#8211; Frandroid Awards 2025</title>
      <link>https://www.frandroid.com/produits-android/2897663_voici-le-meilleur-videoprojecteur-de-lannee-frandroid-awards-2025</link>
      <pubDate>Sun, 21 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2897663_voici-le-meilleur-videoprojecteur-de-lannee-frandroid-awards-2025</guid>
      <description>
Le meilleur vid&#233;oprojecteur test&#233; par Frandroid est le Xgimi Horizon 20 Max. D&#233;couvrez pourquoi ce produit a re&#231;u le Frandroid Awards avec Delos de sa cat&#233;gorie.
</description>
    </item>
    <item>
      <title>La seule chose &#224; faire avec ces PC portables en promotion, c&#8217;est de choisir celui qui vous convient le mieux [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2916709_la-seule-chose-a-faire-avec-ces-pc-portables-en-promotion-cest-de-choisir-celui-qui-vous-convient-le-mieux</link>
      <pubDate>Sun, 21 Dec 2025 06:47:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2916709_la-seule-chose-a-faire-avec-ces-pc-portables-en-promotion-cest-de-choisir-celui-qui-vous-convient-le-mieux</guid>
      <description>
Vous cherchez un petit PC pour aller sur le web et faire un peu de traitement de texte ? Une machine puissante pour profiter des jeux AAA du moment ? Une configuration &#224; l&#8217;aise avec l&#8217;IA ? PcComponentes a ce qu&#8217;il vous faut, et l&#8217;a m&#234;me &#224; prix r&#233;duit.
</description>
    </item>
    <item>
      <title>Data massive, petit prix : pourquoi ces 3 forfaits mobiles sont les meilleures affaires du moment</title>
      <link>https://www.frandroid.com/bons-plans/2916661_data-massive-petit-prix-pourquoi-ces-3-forfaits-mobiles-sont-les-meilleures-affaires-du-moment</link>
      <pubDate>Sun, 21 Dec 2025 06:32:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2916661_data-massive-petit-prix-pourquoi-ces-3-forfaits-mobiles-sont-les-meilleures-affaires-du-moment</guid>
      <description>
Avec des enveloppes data &#233;normes et des prix qui d&#233;marrent sous les 8 euros, ces trois offres sur le r&#233;seau de Bouygues Telecom sont clairement les bons plans du moment.
</description>
    </item>
  </channel>
</rss>
