<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 07 Dec 2025 09:23:22 GMT</lastBuildDate>
    <item>
      <title>Cybers&#233;curit&#233; : les 10 plus grandes menaces qui planent sur 2026</title>
      <link>https://www.01net.com/actualites/cybersecurite-menaces-planent-2026.html</link>
      <pubDate>Sun, 07 Dec 2025 09:08:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312105</guid>
      <description>Cyberattaques automatis&#233;es par l&#8217;IA, ransomwares n&#233;gociateurs, phishing ind&#233;tectable, deepfakes, menace quantique, vols de cryptos&#8230; Une montagne de menaces diff&#233;rentes planera sur les internautes dans le courant de l'ann&#233;e 2026. On fait le point sur celles-ci.</description>
    </item>
    <item>
      <title>We Were Liars season 2: everything we know so far about the hit Prime Video show's return</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/we-were-liars-season-2</link>
      <pubDate>Sun, 07 Dec 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">9aHY4aSGfJUNJKc3q5w7FR</guid>
      <description>We Were Liars season 2 is officially on the way. Here's everything we know so far from release date, trailer, predicted cast, plot rumors and more.</description>
    </item>
    <item>
      <title>L&#8217;ultra-fluide moniteur QD-OLED de Samsung (27&#8243;, 500 Hz) sort de son Odyssey en perdant 370 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2900343_lultra-fluide-moniteur-qd-oled-de-samsung-27-500-hz-sort-de-son-odyssey-en-perdant-370-e</link>
      <pubDate>Sun, 07 Dec 2025 08:24:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2900343_lultra-fluide-moniteur-qd-oled-de-samsung-27-500-hz-sort-de-son-odyssey-en-perdant-370-e</guid>
      <description>
Vous avez d&#233;j&#224; une machine qui explose les benchmarks et arrache les FPS comme si c&#8217;&#233;tait un sport olympique. Il ne manque qu'un moniteur capable d&#8217;avaler 500 Hz sans broncher. Oui, cinq cents. La prouesse est sign&#233;e Samsung, avec son Odyssey G6, le premier de sa lign&#233;e &#224; grimper aussi haut. Et comme si ce n&#8217;&#233;tait pas assez fou, Boulanger le fait chuter de 1 199,99 &#8364; &#224; 829,99 &#8364;. 
...</description>
    </item>
    <item>
      <title>Top des applis pour ma&#238;triser votre consommation d&#8217;&#233;nergie et r&#233;duire la facture</title>
      <link>https://www.01net.com/actualites/top-des-applis-pour-maitriser-votre-consommation-denergie-et-reduire-la-facture.html</link>
      <pubDate>Sun, 07 Dec 2025 08:04:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312902</guid>
      <description>Il existe des applications mobiles qui peuvent vous aider &#224; analyser votre consommation d'&#233;nergie, identifier les &#233;quipements les plus &#233;nergivores et vous donner des conseils pour faire des &#233;conomies, sans sacrifier votre confort.</description>
    </item>
    <item>
      <title>I tested the AGM G3 Pro and it stands out as a classy rugged phone with a neat thermal camera but it can be way too expensive</title>
      <link>https://www.techradar.com/pro/phone-communications/agm-g3-pro-rugged-phone-review</link>
      <pubDate>Sun, 07 Dec 2025 07:47:00 +0000</pubDate>
      <guid isPermaLink="false">L3NkHRwnSNKxREZy5z46sJ</guid>
      <description>The AGM G3 Pro is a rugged phone built for those who need thermal imaging on a regular basis.</description>
    </item>
    <item>
      <title>I reviewed the UPerfect UColor T3 and this 4K portable monitor challenges what "portable" means</title>
      <link>https://www.techradar.com/pro/i-reviewed-the-uperfect-ucolor-t3-and-this-4k-portable-monitor-challenges-what-portable-means</link>
      <pubDate>Sun, 07 Dec 2025 07:47:00 +0000</pubDate>
      <guid isPermaLink="false">4ro7YHLk4y64fWFhUZwU55</guid>
      <description>The UPerfect UColor T3 is a 23.8-inch 4K Panel powered by a single USB-C Cable, bringing size and portability closer than ever before</description>
    </item>
  </channel>
</rss>
