<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 05 Nov 2025 09:47:02 GMT</lastBuildDate>
    <item>
      <title>&#171;&#160;Une proposition formidable&#160;&#187; : Google et Epic Games de nouveau amis&#160;? Un accord a &#233;t&#233; trouv&#233; apr&#232;s plusieurs ann&#233;es de proc&#232;s sur le Play Store</title>
      <link>https://www.frandroid.com/marques/google/2855583_une-proposition-formidable-google-et-epic-games-de-nouveau-amis-un-accord-a-ete-trouve-apres-plusieurs-annees-de-proces-sur-le-play-store</link>
      <pubDate>Wed, 05 Nov 2025 09:43:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2855583_une-proposition-formidable-google-et-epic-games-de-nouveau-amis-un-accord-a-ete-trouve-apres-plusieurs-annees-de-proces-sur-le-play-store</guid>
      <description>
Epic Games et Google pourraient d&#233;finitivement conclure leur bataille judiciaire par un accord commun qui r&#233;soudrait tous leurs diff&#233;rends. La r&#233;ponse du juge est attendue ce jeudi.
</description>
    </item>
    <item>
      <title>Bonne surprise confirm&#233;e pour le prix de la grande rivale de la Tesla Model 3 sign&#233;e Mercedes</title>
      <link>https://www.frandroid.com/marques/mercedes-benz/2855557_bonne-surprise-confirmee-pour-le-prix-de-la-grande-rivale-de-la-tesla-model-3-signee-mercedes</link>
      <pubDate>Wed, 05 Nov 2025 09:40:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/mercedes-benz/2855557_bonne-surprise-confirmee-pour-le-prix-de-la-grande-rivale-de-la-tesla-model-3-signee-mercedes</guid>
      <description>
Quelques jours apr&#232;s l'ouverture des commandes, Mercedes-Benz confirme l'&#233;ligibilit&#233; de sa nouvelle CLA &#233;lectrique &#224; l'&#233;co-score, lui ouvrant la voie au bonus &#233;cologique aux particuliers. De quoi rendre cette rivale de la Tesla Model 3 encore plus attractive.
</description>
    </item>
    <item>
      <title>YouTube teste une pub impossible &#224; fermer sur smartphone</title>
      <link>https://www.01net.com/actualites/youtube-teste-pub-impossible-fermer-smartphone.html</link>
      <pubDate>Wed, 05 Nov 2025 09:40:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305262</guid>
      <description>YouTube exp&#233;rimente une nouvelle fa&#231;on de pr&#233;senter ses publicit&#233;s sur mobile qui risque de faire grincer des dents les utilisateurs gratuits.</description>
    </item>
    <item>
      <title>Black Friday en avant-premi&#232;re sur les tablettes tactiles : la s&#233;lection des offres en or sur les Samsung Galaxy Tab, Xiaomi Pad et autres</title>
      <link>https://www.frandroid.com/bons-plans/2850637_black-friday-en-avant-premiere-sur-les-tablettes-tactiles-la-selection-des-offres-en-or-sur-les-samsung-galaxy-tab-xiaomi-pad-et-autres</link>
      <pubDate>Wed, 05 Nov 2025 09:36:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850637_black-friday-en-avant-premiere-sur-les-tablettes-tactiles-la-selection-des-offres-en-or-sur-les-samsung-galaxy-tab-xiaomi-pad-et-autres</guid>
      <description>
Les tablettes tactiles se vendent moins qu'il y a quelques ann&#233;es, certes, mais on leur trouve toujours une utilit&#233;. Notamment pour certaines t&#226;ches comme le montage photo ou vid&#233;o, avec un stylet, y a pas plus agr&#233;able. Pendant l'avant-premi&#232;re du Black Friday, nombre de ces dalles sont en promo.
</description>
    </item>
    <item>
      <title>Apple rend son score de sommeil bien plus s&#233;v&#232;re pour mieux refl&#233;ter votre r&#233;cup&#233;ration</title>
      <link>https://www.frandroid.com/marques/apple/2855547_apple-rend-son-score-de-sommeil-bien-plus-severe-pour-mieux-refleter-votre-recuperation</link>
      <pubDate>Wed, 05 Nov 2025 09:35:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2855547_apple-rend-son-score-de-sommeil-bien-plus-severe-pour-mieux-refleter-votre-recuperation</guid>
      <description>
Apple a revu les mentions de son score de sommeil &#224; la baisse pour mieux refl&#233;ter la r&#233;cup&#233;ration r&#233;elle des utilisateurs. Un score jug&#233; correct jusqu'&#224; pr&#233;sent pourra ainsi &#234;tre &#233;valu&#233; comme faible. 
</description>
    </item>
    <item>
      <title>La crise du cycle se poursuit : 170 emplois supprim&#233;s chez cet acteur allemand sp&#233;cialis&#233; dans la location de v&#233;los d&#8217;entreprise</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2855667_la-crise-du-cycle-se-poursuit-170-emplois-supprimes-chez-cet-acteur-allemand-specialise-dans-la-location-de-velos-dentreprise</link>
      <pubDate>Wed, 05 Nov 2025 09:32:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2855667_la-crise-du-cycle-se-poursuit-170-emplois-supprimes-chez-cet-acteur-allemand-specialise-dans-la-location-de-velos-dentreprise</guid>
      <description>
JobRad, acteur majeur de la location de v&#233;los d&#8217;entreprise en Allemagne, va supprimer 170 postes, soit 20 % de ses effectifs. Plusieurs facteurs &#233;conomiques ont &#233;t&#233; cit&#233;s pour justifier ce choix.
</description>
    </item>
    <item>
      <title>Blood Tests for Alzheimer&#8217;s Are Here</title>
      <link>https://www.wired.com/story/blood-tests-for-alzheimers-have-arrived-but-how-effective-are-they-and-can-they-really-change-patients-lives/</link>
      <pubDate>Wed, 05 Nov 2025 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">68ff7fe95f5eec92760165bd</guid>
      <description>New diagnostic kits aim to revolutionize early screening of the disease, potentially allowing patients to receive treatments&#8212;such as monoclonal antibodies&#8212;sooner.</description>
    </item>
    <item>
      <title>Fnac et Darty bradent de nombreux&#160;produits Tech lors du pr&#233;-Black Friday : les 17 offres &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2849237_fnac-et-darty-bradent-de-nombreux-produits-tech-lors-du-pre-black-friday-les-17-offres-a-retenir</link>
      <pubDate>Wed, 05 Nov 2025 09:27:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849237_fnac-et-darty-bradent-de-nombreux-produits-tech-lors-du-pre-black-friday-les-17-offres-a-retenir</guid>
      <description>
Apr&#232;s que Boulanger est lanc&#233; son Black Friday en avance, c&#8217;est au tour de la Fnac et Darty de riposter. Les deux enseignes baissent ainsi les prix sur plusieurs produits tech. Profitez-en d&#232;s maintenant pour faire de bonnes affaires !
</description>
    </item>
    <item>
      <title>Tesla va faire dispara&#238;tre vos craintes sur les voitures &#233;lectriques d&#8217;occasion gr&#226;ce &#224; cette nouvelle option tr&#232;s rassurante</title>
      <link>https://www.frandroid.com/marques/tesla/2855495_tesla-va-faire-disparaitre-vos-craintes-sur-les-voitures-electriques-doccasion-grace-a-cette-nouvelle-option-tres-rassurante</link>
      <pubDate>Wed, 05 Nov 2025 09:16:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2855495_tesla-va-faire-disparaitre-vos-craintes-sur-les-voitures-electriques-doccasion-grace-a-cette-nouvelle-option-tres-rassurante</guid>
      <description>
Tesla s'appr&#234;te &#224; lancer une nouvelle option tr&#232;s int&#233;ressante pour les voitures &#233;lectriques d'occasion. La peur de voir la batterie ou les moteurs tomber en panne sera bient&#244;t de l'histoire ancienne.
</description>
    </item>
    <item>
      <title>Des drones s&#232;ment le chaos dans les a&#233;roports de Belgique</title>
      <link>https://www.01net.com/actualites/drones-sement-chaos-aeroports-belgique.html</link>
      <pubDate>Wed, 05 Nov 2025 08:58:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305260</guid>
      <description>Trois a&#233;roports belges ont &#233;t&#233; oblig&#233;s de fermer leurs portes. Des drones non identifi&#233;s ont &#233;t&#233; rep&#233;r&#233;s &#224; proximit&#233; des pistes et des tours de contr&#244;le. Le trafic a&#233;rien a d&#251; &#234;tre suspendu &#224; plusieurs reprises, provoquant des dizaines d&#8217;annulations et de d&#233;viations de vols. Les autorit&#233;s belges redoutent une op&#233;ration coordonn&#233;e d&#8217;espionnage, vraisemblablement orchestr&#233;e par la Russie....</description>
    </item>
    <item>
      <title>Le pr&#233;-Black Friday retire d&#233;j&#224; 35 % au r&#233;cent smartphone pas cher de Samsung, le Galaxy A17 5G</title>
      <link>https://www.frandroid.com/bons-plans/2854867_le-pre-black-friday-retire-deja-35-au-recent-smartphone-pas-cher-de-samsung-le-galaxy-a17-5g</link>
      <pubDate>Wed, 05 Nov 2025 08:49:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2854867_le-pre-black-friday-retire-deja-35-au-recent-smartphone-pas-cher-de-samsung-le-galaxy-a17-5g</guid>
      <description>
Un &#233;cran OLED, de la 5G et un suivi logiciel longue dur&#233;e : le Galaxy A17 5G est un excellent mod&#232;le d&#8217;entr&#233;e de gamme. Pour l&#8217;avant Black Friday, il passe &#224; 149 euros au lieu de 229 euros sur Red By SFR apr&#232;s une offre de remboursement.
</description>
    </item>
    <item>
      <title>Black Friday 2025 : les offres sont nombreuses chez Amazon &amp; Co, voici les meilleurs deals en avant-premi&#232;re</title>
      <link>https://www.frandroid.com/bons-plans/2849105_black-friday-2025-la-braderie-continue-chez-amazon-co-voici-les-meilleures-offres-en-avant-premiere</link>
      <pubDate>Wed, 05 Nov 2025 08:42:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849105_black-friday-2025-la-braderie-continue-chez-amazon-co-voici-les-meilleures-offres-en-avant-premiere</guid>
      <description>
&#192; peine novembre entam&#233; que le Black Friday pointe d&#233;j&#224; le bout de son nez chez certains e-commer&#231;ants fran&#231;ais. On vous a donc pr&#233;par&#233; une s&#233;lection des meilleures offres du moment, mise &#224; jour en temps r&#233;el, pour vous aider &#224; d&#233;nicher les bons plans tech sans prise de t&#234;te.
</description>
    </item>
    <item>
      <title>Valve va r&#233;soudre une des plus grosses limitations du Steam Deck</title>
      <link>https://www.frandroid.com/marques/2855431_valve-va-resoudre-une-des-plus-grosses-limitations-du-steam-deck</link>
      <pubDate>Wed, 05 Nov 2025 08:41:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2855431_valve-va-resoudre-une-des-plus-grosses-limitations-du-steam-deck</guid>
      <description>
Valve annonce la mise en place d'une nouvelle fonctionnalit&#233; tr&#232;s pratique pour le Steam Deck. La console de Valve pourra t&#233;l&#233;charger des jeux et des mises &#224; jour avec un &#233;cran &#233;teint. 
</description>
    </item>
    <item>
      <title>Notre guide d&#8217;achat des meilleurs smartphones &#224; grand &#233;cran en 2025</title>
      <link>https://www.frandroid.com/guide-dachat/382644_6-alternatives-samsung-galaxy-note-7</link>
      <pubDate>Wed, 05 Nov 2025 08:35:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/382644_6-alternatives-samsung-galaxy-note-7</guid>
      <description>
D'ann&#233;e en ann&#233;e, les smartphones ne cessent de grandir. Vous &#234;tes adeptes des grands &#233;crans ? Que ce soit pour jouer, regarder des vid&#233;os ou juste pour un plus grand confort, nous avons s&#233;lectionn&#233; pour vous les meilleurs t&#233;l&#233;phones avec un grand &#233;cran -- au minimum 6,7 pouces.
</description>
    </item>
    <item>
      <title>3 heures d&#8217;&#233;lectricit&#233; gratuite par jour : &#171;&#160;une politique mal pens&#233;e, &#233;labor&#233;e &#224; la va-vite&#160;&#187;</title>
      <link>https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2855479_3-heures-delectricite-gratuite-par-jour-une-politique-mal-pensee-elaboree-a-la-va-vite</link>
      <pubDate>Wed, 05 Nov 2025 08:34:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2855479_3-heures-delectricite-gratuite-par-jour-une-politique-mal-pensee-elaboree-a-la-va-vite</guid>
      <description>
Alors que son mix &#233;lectrique est encore domin&#233; par le charbon, l&#8217;Australie anticipe un trop-plein d&#8217;&#233;nergie solaire en 2026. Pour y faire face, le pays a d&#233;cid&#233; d&#8217;imposer &#224; ses &#233;nerg&#233;ticiens de fournir chaque jour d&#8217;&#233;lectricit&#233; gratuite &#224; des millions d&#8217;habitants.
</description>
    </item>
    <item>
      <title>Google Maps devient encore plus pratique sur cette voiture avec une petite nouveaut&#233;</title>
      <link>https://www.frandroid.com/marques/polestar/2855475_google-maps-devient-encore-plus-pratique-sur-cette-voiture-avec-une-petite-nouveaute</link>
      <pubDate>Wed, 05 Nov 2025 08:26:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/polestar/2855475_google-maps-devient-encore-plus-pratique-sur-cette-voiture-avec-une-petite-nouveaute</guid>
      <description>
Polestar vient d'int&#233;grer une fonction tr&#232;s utile &#224; une de ses voitures &#233;lectriques : Google Maps affiche d&#233;sormais les voies d'autoroute &#224; prendre, directement sur l'&#233;cran conducteur de la Polestar 4.
</description>
    </item>
    <item>
      <title>I&#8217;m a big fan of the new Dyson Hot+Cool HF1 &#8211; but there are a couple of drawbacks you should consider before buying</title>
      <link>https://www.techradar.com/home/air-quality/dyson-hot-and-cool-hf1-review</link>
      <pubDate>Wed, 05 Nov 2025 08:16:17 +0000</pubDate>
      <guid isPermaLink="false">YnWRZbHYi3o5LYtXbFYn8M</guid>
      <description>The new Dyson Hot+Cool HF1 has fantastic smart features, but a couple of drawbacks may mean it&#8217;s not for you.</description>
    </item>
    <item>
      <title>Faille critique des puces Zen 5&#160;: AMD annonce un correctif</title>
      <link>https://www.01net.com/actualites/faille-critique-puces-zen-5-amd-promet-correctif.html</link>
      <pubDate>Wed, 05 Nov 2025 08:11:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305246</guid>
      <description>Un bug inqui&#233;tant dans les processeurs AMD Zen 5 a &#233;t&#233; d&#233;couvert. L&#8217;instruction RDSEED, utilis&#233;e dans le chiffrement, produit parfois des valeurs incorrectes, compromettant la s&#233;curit&#233; des syst&#232;mes. AMD a confirm&#233; le probl&#232;me et d&#233;ploie d&#233;j&#224; un correctif.</description>
    </item>
    <item>
      <title>L&#8217;excellent Honor Magic 7 Pro propuls&#233; par un Snapdragon 8 Elite perd 500 &#8364; de son prix pendant le pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2854827_lexcellent-honor-magic-7-pro-propulse-par-un-snapdragon-8-elite-perd-500-e-de-son-prix-pendant-le-pre-black-friday</link>
      <pubDate>Wed, 05 Nov 2025 08:08:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2854827_lexcellent-honor-magic-7-pro-propulse-par-un-snapdragon-8-elite-perd-500-e-de-son-prix-pendant-le-pre-black-friday</guid>
      <description>
Lanc&#233; cette ann&#233;e, le Honor Magic 7 Pro a de s&#233;rieux atouts, le premier &#233;tant &#233;videmment sa puce ultra-puissante &#224; laquelle rien ne r&#233;siste. &#192; l'approche du Black Friday, Honor et Boulanger proposent ce smartphone &#224; 799,90 euros au lieu de 1 299 euros. 
</description>
    </item>
    <item>
      <title>On a pris en main le Motorola Edge 70&#160;: enfin un smartphone ultrafin &#224; un prix correct</title>
      <link>https://www.01net.com/actualites/prise-en-main-du-edge-70-que-vaut-liphone-air-de-motorola.html</link>
      <pubDate>Wed, 05 Nov 2025 08:00:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305145</guid>
      <description>Motorola entend bien ne plus laisser &#224; Apple et Samsung le monopole du smartphone ultrafin. Avec le Edge&#8239;70, la marque am&#233;ricaine s&#8217;invite sur le terrain du design tout en finesse et l&#233;g&#232;ret&#233;. L'ambition est claire&#8239;: proposer une alternative haut de gamme, mais accessible. Un positionnement strat&#233;gique, soutenu par un partenariat muscl&#233; avec Orange et une fiche technique qui n&#8217;a pas &#224; rougir face aux t&#233;nors du march&#233;. Nous l'avons pris en main....</description>
    </item>
    <item>
      <title>Motorola&#8217;s Edge 70 is the blueprint for future thin phones</title>
      <link>https://www.theverge.com/gadgets/813377/motorola-edge-70-review</link>
      <pubDate>2025-11-05T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=813377</guid>
      <description>I've been as much of a thin phone skeptic as anyone. Why would I give up on camera specs and battery life just to shave a couple of millimeters off a phone's waistline? I asked pretty much exactly that when I first saw Samsung's Galaxy S25 Edge earlier this year. But the Motorola Edge 70 [&#8230;]</description>
    </item>
    <item>
      <title>Bang &amp; Olufsen's new elite Dolby Atmos soundbar looks like it's come from the future, and is priced like it too</title>
      <link>https://www.techradar.com/televisions/soundbars/bang-and-olufsens-new-elite-dolby-atmos-soundbar-looks-like-its-come-from-the-future-and-is-priced-like-it-too</link>
      <pubDate>Wed, 05 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">hAxrh8PhTuXjSw9J3zWqQm</guid>
      <description>The Beosound Premiere looks a million dollars, and costs slightly less</description>
    </item>
    <item>
      <title>Motorola&#8217;s iPhone Air rival brings a bigger battery, faster charging, and a much better price to the ultra-thin table</title>
      <link>https://www.techradar.com/phones/motorola-phones/motorolas-iphone-air-rival-brings-a-bigger-battery-faster-charging-and-a-much-better-price-to-the-super-slim-table</link>
      <pubDate>Wed, 05 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">j8wxtXPQfyszugEpJHgm5P</guid>
      <description>Motorola has released its super-slim Edge 70 smartphone, and I can't believe how affordable it is.</description>
    </item>
    <item>
      <title>Il pense battre Apple et Samsung &#224; leur propre jeu : voici le Motorola Edge 70, on l&#8217;a pris en main</title>
      <link>https://www.frandroid.com/marques/motorola/2853417_il-pense-battre-apple-et-samsung-a-leur-propre-jeu-voici-le-motorola-edge-70-on-la-pris-en-main</link>
      <pubDate>Wed, 05 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/motorola/2853417_il-pense-battre-apple-et-samsung-a-leur-propre-jeu-voici-le-motorola-edge-70-on-la-pris-en-main</guid>
      <description>
Le Motorola Edge 70 vient d'&#234;tre officialis&#233; en exclusivit&#233; chez Orange et nous avons d&#233;j&#224; pris en main ce nouveau smartphone ultra fin. Est-il capable de faire trembler Apple et Samsung ?
</description>
    </item>
  </channel>
</rss>
