<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 14 Nov 2025 08:55:48 GMT</lastBuildDate>
    <item>
      <title>Le pr&#233;-Black Friday retire d&#233;j&#224; 300 &#8364; sur le prix de l&#8217;excellent Google Pixel 10</title>
      <link>https://www.frandroid.com/marques/2848533_le-pre-black-friday-retire-deja-300-euros-sur-le-prix-de-lexcellent-google-pixel-10</link>
      <pubDate>Fri, 14 Nov 2025 08:51:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2848533_le-pre-black-friday-retire-deja-300-euros-sur-le-prix-de-lexcellent-google-pixel-10</guid>
      <description>
Le Google Pixel 10 &#224; de belles choses &#224; offrir : un zoom optique x5, un Tensor G5 optimis&#233;, une meilleure batterie et la promesse de 7 ans de mises &#224; jour. Int&#233;ress&#233; ? Il peut vous revenir &#224; moins de 600 euros gr&#226;ce aux offres du pr&#233;-Black Friday. 
</description>
    </item>
    <item>
      <title>AIdol&#160;: le robot humano&#239;de russe se r&#234;vait en Rocky, il s&#8217;est effondr&#233; en quelques secondes</title>
      <link>https://www.01net.com/actualites/aidol-le-robot-humanoide-russe-se-revait-en-rocky-il-sest-effondre-en-quelques-secondes.html</link>
      <pubDate>Fri, 14 Nov 2025 08:44:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1307971</guid>
      <description>La Russie a pr&#233;sent&#233; en grande pompe son nouveau robot IA, AIdol. Mais la machine, cens&#233;e incarner la souverainet&#233; technologique du pays, a titub&#233;, s'est effondr&#233;e et a convuls&#233; sur sc&#232;ne. Un d&#233;sastre qui en dit long sur le retard de Moscou dans la course &#224; la robotique.</description>
    </item>
    <item>
      <title>Les voitures &#233;lectriques &#224; 1 000 kilom&#232;tres d&#8217;autonomie seront bient&#244;t une r&#233;alit&#233; avec ces nouvelles batteries</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2868703_les-voitures-electriques-a-1-000-kilometres-dautonomie-seront-bientot-une-realite-avec-ces-nouvelles-batteries</link>
      <pubDate>Fri, 14 Nov 2025 08:37:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2868703_les-voitures-electriques-a-1-000-kilometres-dautonomie-seront-bientot-une-realite-avec-ces-nouvelles-batteries</guid>
      <description>
Le groupe chinois Dongfeng Motor annonce &#234;tre quasiment pr&#234;t pour produire en grande s&#233;rie sa nouvelle batterie solide. Mais il y a un petit d&#233;tail &#224; ne pas n&#233;gliger...
</description>
    </item>
    <item>
      <title>Les abonn&#233;s Disney+ pourront bient&#244;t g&#233;n&#233;rer leurs propres vid&#233;os IA avec leurs personnages pr&#233;f&#233;r&#233;s</title>
      <link>https://www.01net.com/actualites/les-abonnes-disney-pourront-bientot-generer-leurs-propres-videos-ia-avec-leurs-personnages-preferes.html</link>
      <pubDate>Fri, 14 Nov 2025 08:29:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308032</guid>
      <description>Sora a peut-&#234;tre donn&#233; des id&#233;es &#224; Disney. Le g&#233;ant du divertissement a annonc&#233; que les abonn&#233;s Disney+ vont pouvoir g&#233;n&#233;rer de petites vid&#233;os avec leurs personnages favoris gr&#226;ce &#224; l'IA. Des vid&#233;os qui seront partag&#233;es dans l'application.</description>
    </item>
    <item>
      <title>Black Friday 2025 : les promotions s&#8217;encha&#238;nent sur Amazon &amp; Co, mais voici les meilleures offres en DIRECT</title>
      <link>https://www.frandroid.com/bons-plans/2864479_black-friday-2025-meilleures-offres-en-direct-amazon</link>
      <pubDate>Fri, 14 Nov 2025 08:26:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2864479_black-friday-2025-meilleures-offres-en-direct-amazon</guid>
      <description>
Avant le coup d'envoi officiel du vendredi noir &#224; la fin du mois, les offres se multiplient et deviennent de plus en plus int&#233;ressantes. D'un c&#244;t&#233;, il y a le pr&#233;-Black Friday chez la majorit&#233; des e-commer&#231;ants fran&#231;ais comme Boulanger, Fnac Darty, Amazon et Cdiscount, et de l'autre c&#244;t&#233;, il y a aussi le Singles Day, ou 11.11, chez AliExpress et consorts. Vous retrouverez les meilleures offres des deux &#233;v&#233;nements dans cet article. 
...</description>
    </item>
    <item>
      <title>Pourquoi le monde d&#233;rive et comment corriger la trajectoire des objectifs climatiques</title>
      <link>https://www.frandroid.com/survoltes/energie/2868689_pourquoi-le-monde-derive-et-comment-corriger-la-trajectoire-des-objectifs-climatiques</link>
      <pubDate>Fri, 14 Nov 2025 08:21:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/2868689_pourquoi-le-monde-derive-et-comment-corriger-la-trajectoire-des-objectifs-climatiques</guid>
      <description>
Le monde est-il sur la bonne voie pour atteindre ses objectifs climatiques&#8201;? &#192; en croire une nouvelle &#233;tude, la r&#233;ponse est non. En cause notamment, les tensions g&#233;opolitiques et l&#8217;explosion de la demande mondiale en &#233;lectricit&#233;. Mais tout n&#8217;est pas encore perdu, il est encore temps de corriger la trajectoire pour &#233;viter le pire.
</description>
    </item>
    <item>
      <title>Mozilla va int&#233;grer une &#171;&#160;fen&#234;tre d&#8217;IA&#187; dans Firefox</title>
      <link>https://www.01net.com/actualites/mozilla-va-integrer-une-fenetre-dia-dans-firefox.html</link>
      <pubDate>Fri, 14 Nov 2025 08:16:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308094</guid>
      <description>La Fondation Mozilla vient d&#8217;annoncer travailler sur une &#171; fen&#234;tre d&#8217;IA &#187; dans Firefox. Une mani&#232;re d&#8217;int&#233;grer l&#8217;IA dans son navigateur sans pour autant mettre en danger la vie priv&#233;e des utilisateurs.</description>
    </item>
    <item>
      <title>Domination chinoise dans l&#8217;&#233;lectrique : l&#8217;Europe cherche des mesures pour sauver sa fili&#232;re batteries</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2868671_domination-chinoise-dans-lelectrique-leurope-cherche-des-mesures-pour-sauver-sa-filiere-batteries</link>
      <pubDate>Fri, 14 Nov 2025 08:05:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2868671_domination-chinoise-dans-lelectrique-leurope-cherche-des-mesures-pour-sauver-sa-filiere-batteries</guid>
      <description>
Alors que la Chine continue de dominer l&#8217;industrie de la voiture &#233;lectrique, les fournisseurs europ&#233;ens sont pris &#224; la gorge. Ils demandent d&#233;sormais &#224; Bruxelles de mettre en place de nouvelles mesures pour les prot&#233;ger.
</description>
    </item>
    <item>
      <title>L&#8217;affaire Nexperia doit servir &#171;&#160;d&#8217;&#233;lectrochoc pour l&#8217;Europe&#160;&#187;, pr&#233;vient le ministre n&#233;erlandais de l&#8217;&#201;conomie</title>
      <link>https://www.01net.com/actualites/laffaire-nexperia-doit-servir-delectrochoc-pour-leurope-previent-le-ministre-neerlandais-de-leconomie.html</link>
      <pubDate>Fri, 14 Nov 2025 08:01:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1307995</guid>
      <description>Si c'&#233;tait &#224; refaire, il le referait. Le ministre de l'&#201;conomie n&#233;erlandais, qui &#233;tait au c&#339;ur de la pol&#233;mique entourant Nexperia, cette entreprise de semi-conducteurs des Pays-Bas au propri&#233;taire chinois, a racont&#233; les coulisses de la prise de contr&#244;le au Guardian : un t&#233;moignage in&#233;dit.</description>
    </item>
    <item>
      <title>Maxton Hall season 2 episode 4 cliffhanger spells fresh trouble for Ruby and James, but that&#8217;s not the storyline we should be worried about</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/maxton-hall-season-2-episode-4-cliffhanger-spells-fresh-trouble-for-ruby-and-james-but-thats-not-the-storyline-we-should-be-worried-about</link>
      <pubDate>Fri, 14 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">hzSx27KLdCyjQG35gdB7iR</guid>
      <description>The final few moments of Maxton Hall season 2 episode 4 changed things for Ruby and James again... but it's not them who will be punished.</description>
    </item>
    <item>
      <title>&#8216;Benefit burnout&#8217; and health insurance &#8216;planxiety&#8217; send young workers to AI for HR answers</title>
      <link>https://www.fastcompany.com/91441529/benefit-burnout-and-health-insurance-planxiety-send-young-workers-to-ai-for-hr-answers</link>
      <pubDate>2025-11-14T08:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91441529/benefit-burnout-and-health-insurance-planxiety-send-young-workers-to-ai-for-hr-answers</guid>
      <description>They&#8217;re also crowdsourcing advice on TikTok instead of talking to HR.
It&#8217;s open enrollment season again&#8212;that period between October and November when workers must reacquaint themselves with &#8220;deductibles,&#8221; &#8220;copays,&#8221; and &#8220;premiums.&#8221; Many would rather wait at the DMV, sit through a three-hour work meeting, or attempt to explain social media to tech-challeged loved ones than spend their afternoon selecting an insurance plan.&#160;...</description>
    </item>
    <item>
      <title>Le Bitcoin continue sa chute sous les 100&#160;000 dollars</title>
      <link>https://www.01net.com/actualites/bitcoin-devisse-sous-105-000-dollars-plus-milliard-dollars-evaporent-marche-crypto.html</link>
      <pubDate>Fri, 14 Nov 2025 07:53:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304916</guid>
      <description>Le Bitcoin replonge sous les 100 000 dollars, entra&#238;nant tout le march&#233; crypto dans sa chute. De plus en plus loin de son record, la cryptomonnaie num&#233;ro un continue de s'afficher dans le rouge. En 24 heures, des millions de dollars de positions ont &#233;t&#233; liquid&#233;es sur le march&#233;&#8230;</description>
    </item>
    <item>
      <title>&#171;&#8201;Nous pensons que le slop est une menace existentielle pour Internet&#8201;&#187;&#160;: comment Kagi veut nous d&#233;barrasser du pire de l&#8217;IA</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2868705_nous-pensons-que-le-slop-est-une-menace-existentielle-pour-internet-comment-kagi-veut-nous-debarrasser-du-pire-de-lia</link>
      <pubDate>Fri, 14 Nov 2025 07:50:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2868705_nous-pensons-que-le-slop-est-une-menace-existentielle-pour-internet-comment-kagi-veut-nous-debarrasser-du-pire-de-lia</guid>
      <description>
Depuis l&#8217;av&#232;nement de ChatGPT, Mijourney et autres, il y a de fortes chances pour que vous vous soyez retrouv&#233; sur un site 100&#160;% g&#233;n&#233;r&#233; par IA qui n&#8217;est l&#224; que pour attirer des clics. Le moteur de recherche Kagi veut lutter contre ce ph&#233;nom&#232;ne.
</description>
    </item>
    <item>
      <title>Starlink : l&#8217;Internet de l&#8217;espace sort de son orbite pour le pr&#233;-Black Friday avec le nouveau kit en promotion</title>
      <link>https://www.frandroid.com/bons-plans/2867705_starlink-linternet-de-lespace-sort-de-son-orbite-pour-le-pre-black-friday-avec-le-nouveau-kit-en-promotion</link>
      <pubDate>Fri, 14 Nov 2025 07:47:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2867705_starlink-linternet-de-lespace-sort-de-son-orbite-pour-le-pre-black-friday-avec-le-nouveau-kit-en-promotion</guid>
      <description>
Vous vivez dans une zone blanche oubli&#233;e des op&#233;rateurs ? Ou vous faites partie de ces travailleurs nomades qui tracent la route en van, entre deux levers de soleil ? Le kit Starlink remet du r&#233;seau dans vos vies, partout, avec des d&#233;bits qui flirtent avec ceux de la fibre. Et pour le Black Friday, le kit Standard Fixe s'affiche &#224; 269 euros au lieu de 349,99 euros sur la Fnac. 
...</description>
    </item>
    <item>
      <title>Spotify met &#224; jour son mode Al&#233;atoire pour mieux privil&#233;gier la vari&#233;t&#233;</title>
      <link>https://www.frandroid.com/services/2868711_spotify-met-a-jour-son-mode-aleatoire-pour-mieux-privilegier-la-variete</link>
      <pubDate>Fri, 14 Nov 2025 07:44:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/2868711_spotify-met-a-jour-son-mode-aleatoire-pour-mieux-privilegier-la-variete</guid>
      <description>
Spotify annonce officiellement la mise &#224; jour de son mode de lecture al&#233;atoire, ou Shuffle, avec un nouvel algorithme baptis&#233; &#171; Fewer repeats &#187;. L&#8217;id&#233;e est d&#8217;offrir davantage de vari&#233;t&#233; lors de l&#8217;&#233;coute des playlists, en &#233;vitant de rejouer trop fr&#233;quemment les m&#234;mes titres.
</description>
    </item>
    <item>
      <title>Sans offre gratuite, Apple Music tourne au ralenti face &#224; Spotify et YouTube</title>
      <link>https://www.01net.com/actualites/sans-offre-gratuite-apple-music-tourne-au-ralenti-face-a-spotify-et-youtube.html</link>
      <pubDate>Fri, 14 Nov 2025 07:30:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1307999</guid>
      <description>En refusant obstin&#233;ment l&#8217;&#233;coute gratuite, Apple Music s&#8217;est attir&#233; les faveurs de l&#8217;industrie&#8230; mais la plateforme fait aussi face &#224; un plafond de verre. Alors que Spotify et YouTube multiplient les utilisateurs gr&#226;ce &#224; leurs portes d&#8217;entr&#233;e sans frais, le service d&#8217;Apple progresse beaucoup plus lentement.</description>
    </item>
    <item>
      <title>IPTV pirate&#160;: Google va bloquer plus de 600 sites en France</title>
      <link>https://www.01net.com/actualites/iptv-pirate-google-va-bloquer-plus-de-600-sites-en-france.html</link>
      <pubDate>Fri, 14 Nov 2025 07:14:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308027</guid>
      <description>Les diffuseurs de rencontres sportives et les f&#233;d&#233;rations sportives amplifient leur lutte contre les sites pirates. Une liste de plus de 600 sites a &#233;t&#233; transmise &#224; Google, qui va bloquer ou d&#233;r&#233;f&#233;rencer les adresses.</description>
    </item>
    <item>
      <title>Mis sous pression par Bosch et de grandes associations, le salon n&#176;1 du v&#233;lo en Europe c&#232;de et fait une concession majeure</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2868225_mis-sous-pression-par-bosch-et-de-grandes-associations-le-salon-n1-du-velo-en-europe-cede-et-fait-une-concession-majeure</link>
      <pubDate>Fri, 14 Nov 2025 07:12:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2868225_mis-sous-pression-par-bosch-et-de-grandes-associations-le-salon-n1-du-velo-en-europe-cede-et-fait-une-concession-majeure</guid>
      <description>
Apr&#232;s l&#8217;annonce du retrait des grandes associations du cycle et de Bosch, l&#8217;organisateur du salon Eurobike ne lancera pas son &#233;v&#233;nement parall&#232;le Mobifuture en 2026, qui aurait pu scinder v&#233;los &#233;lectriques et classiques des autres v&#233;hicules type cargo ou v&#233;lis.
</description>
    </item>
    <item>
      <title>Discuter &#224; plusieurs avec ChatGPT, cela sera tr&#232;s bient&#244;t possible</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2868675_discuter-a-plusieurs-avec-chatgpt-cela-sera-tres-bientot-possible</link>
      <pubDate>Fri, 14 Nov 2025 07:11:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2868675_discuter-a-plusieurs-avec-chatgpt-cela-sera-tres-bientot-possible</guid>
      <description>
OpenAI vient de lancer une phase pilote d&#8217;une nouvelle fonctionnalit&#233; qui pourrait s&#8217;av&#233;rer particuli&#232;rement int&#233;ressante&#160;: les conversations de groupe sur ChatGPT.
</description>
    </item>
    <item>
      <title>Blue Apron Coupon &amp; Promo Codes: $25 Off | November 2025</title>
      <link>https://www.wired.com/story/blue-apron-coupon/</link>
      <pubDate>Fri, 14 Nov 2025 07:10:00 +0000</pubDate>
      <guid isPermaLink="false">672bb91dfd3b3c8dcf4aa83a</guid>
      <description>Browse chef-curated meal plans, plus get $25 off with an exclusive Blue Apron coupon code. You'll get 50% off your first 2 orders, and more top coupons on WIRED.</description>
    </item>
    <item>
      <title>WhatsApp va ajouter l&#8217;une des options les plus importantes d&#8217;Instagram et Facebook</title>
      <link>https://www.01net.com/actualites/whatsapp-ajouter-options-plus-importantes-instagram-facebook.html</link>
      <pubDate>Fri, 14 Nov 2025 07:03:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308056</guid>
      <description>WhatsApp pr&#233;pare une option tr&#232;s importante que vous utilisez d&#233;j&#224; sur Instagram et Facebook. Elle devrait int&#233;resser tous ceux qui tiennent &#224; leur nom d&#8217;utilisateur et veulent garder une coh&#233;rence entre leurs diff&#233;rents comptes.</description>
    </item>
    <item>
      <title>Le Dyson V12s aspire, d&#233;m&#234;le, lave et perd 245 &#8364; de son prix en plein pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2867853_le-dyson-v12s-aspire-demele-lave-et-perd-245-e-de-son-prix-en-plein-pre-black-friday</link>
      <pubDate>Fri, 14 Nov 2025 07:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2867853_le-dyson-v12s-aspire-demele-lave-et-perd-245-e-de-son-prix-en-plein-pre-black-friday</guid>
      <description>
L&#233;ger, maniable et tr&#232;s complet, le Dyson V12s Detect Slim Submarine est &#224; un prix bien moins r&#233;dhibitoire pendant le pr&#233;-Black Friday. La marque le propose en effet &#224; 474,17 euros au lieu de 719 euros.
</description>
    </item>
    <item>
      <title>Hungryroot Coupon Codes: 30% Off in November 2025</title>
      <link>https://www.wired.com/story/hungryroot-promo-code/</link>
      <pubDate>Fri, 14 Nov 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">689106ddb62bf4a139ca3cca</guid>
      <description>Get up to 30% off your first order and free gifts using a Hungryroot promo code today. Discover our best coupons and discounts to let you save on your healthy groceries as a new or returning customer.</description>
    </item>
    <item>
      <title>I rode in one of the UK&#8217;s first self-driving cars</title>
      <link>https://www.theverge.com/report/820324/wayve-driverless-robotaxi-london</link>
      <pubDate>2025-11-14T02:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=820324</guid>
      <description>I never really believed self-driving cars would make it to the UK, so you can imagine my surprise when I found myself clambering into one of Wayve's autonomous vehicles for a journey around north London a few weeks ago. In June, the company announced plans with Uber to begin trialing Level 4 fully autonomous robotaxis [&#8230;]</description>
    </item>
    <item>
      <title>3 signs your workplace is unprepared for a crisis</title>
      <link>https://www.fastcompany.com/91433692/three-signs-your-workplace-is-unprepared-for-a-crisis</link>
      <pubDate>2025-11-14T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91433692/three-signs-your-workplace-is-unprepared-for-a-crisis</guid>
      <description>These three warning signs show whether your business is built to withstand the next hit to its reputation.
From fake &#8220;apologies&#8221; that spread like wildfire on social media (as was the case during the Astronomer CEO scandal) to companies facing backlash for using generative AI without safeguards, recent crises have shown how quickly brand reputations can unravel in the digital age. The rapid spread of misinformation online, combined with new risks tied to emerging technologies, has left organizations more vulnerable than ever....</description>
    </item>
  </channel>
</rss>
