<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 21 Feb 2026 19:28:36 GMT</lastBuildDate>
    <item>
      <title>The US will send Tech Corps members to foreign countries in its latest push for AI dominance</title>
      <link>https://www.engadget.com/ai/the-us-will-send-tech-corps-members-to-foreign-countries-in-its-latest-push-for-ai-dominance-191916940.html?src=rss</link>
      <pubDate>Sat, 21 Feb 2026 19:19:16 +0000</pubDate>
      <guid isPermaLink="false">02331e47-b9df-46ca-88a8-577ea1fb9f3a</guid>
      <description>The government agency that sends its corps members abroad to volunteer in foreign countries launched its latest initiative called Tech Corps. The Peace Corps' latest proposal will recruit STEM graduates or those with professional experience in the artificial intelligence sector and send them to participating host countries.
According to the press release, volunteers will be placed in Peace Corps countries that are part of the American AI Exports Program, which was created last year from an executive order from President Trump as a way to bolster the US' grip on the AI market abroad. Tech Corps...</description>
    </item>
    <item>
      <title>Obedient Traders Respond to Claude Code Cybersecurity Plugin by Selling Cybersecurity Stocks</title>
      <link>https://gizmodo.com/obedient-traders-respond-to-claude-code-cybersecurity-plugin-by-selling-cybersecurity-stocks-2000723240</link>
      <pubDate>Sat, 21 Feb 2026 19:11:21 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000723240</guid>
      <description>The SaaSpocalypse is not real, but it can hurt you.</description>
    </item>
    <item>
      <title>Le miracle de P&#233;kin, le retour du diesel chez Stellantis et on a test&#233; la Xiaomi SU7 &#233;lectrique &#8211; Le r&#233;cap Survolt&#233;s</title>
      <link>https://www.frandroid.com/survoltes/2985195_le-miracle-de-pekin-le-retour-du-diesel-chez-stellantis-et-on-a-teste-la-xiaomi-su7-electrique-le-recap-survoltes</link>
      <pubDate>Sat, 21 Feb 2026 19:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2985195_le-miracle-de-pekin-le-retour-du-diesel-chez-stellantis-et-on-a-teste-la-xiaomi-su7-electrique-le-recap-survoltes</guid>
      <description>
L&#8217;actualit&#233; Survolt&#233;s a &#233;t&#233; dense cette semaine, entre essais de nouveaux mod&#232;les &#233;lectriques, bons plans et analyses sur l&#8217;industrie et l&#8217;&#233;nergie. Voici le r&#233;capitulatif des articles les plus consult&#233;s sur Frandroid.
</description>
    </item>
    <item>
      <title>Optoma Photon Life PH31 : ce vid&#233;oprojecteur tr&#232;s lumineux chute &#224; 399 euros</title>
      <link>https://www.frandroid.com/bons-plans/2983159_optoma-photon-life-ph31-ce-videoprojecteur-tres-lumineux-chute-a-399-euros</link>
      <pubDate>Sat, 21 Feb 2026 18:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2983159_optoma-photon-life-ph31-ce-videoprojecteur-tres-lumineux-chute-a-399-euros</guid>
      <description>
Parmi les trois vid&#233;oprojecteurs Photon Life d'Optoma, le PH31 est le plus abordable et il passe de 499 euros &#224; 399 euros chez Amazon. Une superbe occasion pour obtenir un vid&#233;oprojecteur compact en Full HD.
</description>
    </item>
    <item>
      <title>'What we really wanted was Mike': How Mike Markkula was Apple's first true master marketer before Steve Jobs and wrote the business plan that made Apple a Fortune 500 company</title>
      <link>https://www.techradar.com/pro/what-we-really-wanted-was-mike-how-mike-markkula-was-apples-first-true-master-marketer-before-steve-jobs-and-wrote-the-business-plan-that-made-apple-a-fortune-500-company</link>
      <pubDate>Sat, 21 Feb 2026 18:25:00 +0000</pubDate>
      <guid isPermaLink="false">iieYfsvFSbiJkeppw32CeG</guid>
      <description>How Mike Markkula transformed Apple from garage experiment into the business that reshaped personal computing.</description>
    </item>
    <item>
      <title>Les meilleurs ordinateurs portables &#224; moins de 500 euros en 2026</title>
      <link>https://www.frandroid.com/guide-dachat/638784_pc-portables-pas-cher-quels-sont-les-meilleurs-a-moins-de-500-euros</link>
      <pubDate>Sat, 21 Feb 2026 18:00:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/638784_pc-portables-pas-cher-quels-sont-les-meilleurs-a-moins-de-500-euros</guid>
      <description>
Vous cherchez un ordinateur portable pas cher, mais tout de m&#234;me fiable ? Suivez le guide : voici notre s&#233;lection des meilleurs PC portables &#224; moins de 500 euros.
</description>
    </item>
    <item>
      <title>A judge ruled Tesla still has to pay $243 million for a fatal crash involving Autopilot</title>
      <link>https://www.engadget.com/transportation/evs/a-judge-ruled-tesla-still-has-to-pay-243-million-for-a-fatal-crash-involving-autopilot-174548093.html?src=rss</link>
      <pubDate>Sat, 21 Feb 2026 17:45:50 +0000</pubDate>
      <guid isPermaLink="false">bb7e45e7-dc0a-4eba-b7bf-f574b107b4f6</guid>
      <description>Tesla is still on the hook for $243 million after a US judge rejected the EV maker's bid to overturn a jury verdict from last year. On Friday, US District Judge Beth Bloom upheld the jury's decision to hold Tesla partially responsible for a deadly crash that happened in 2019 and involved the self-driving Autopilot feature.
The judge added that there was enough evidence to support the jury's verdict, which was delivered in August 2025 and ordered Tesla to pay millions in compensatory and punitive damages to the two victims in the case. Judge Bloom added that Tesla didn't present any new argumen...</description>
    </item>
    <item>
      <title>Microsoft&#8217;s new gaming CEO vows not to flood the ecosystem with &#8216;endless AI slop&#8217;</title>
      <link>https://techcrunch.com/2026/02/21/microsofts-new-gaming-ceo-vows-not-to-flood-the-ecosystem-with-endless-ai-slop/</link>
      <pubDate>Sat, 21 Feb 2026 17:41:27 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3095331</guid>
      <description>Is Microsoft's gaming division doubling down on AI?</description>
    </item>
    <item>
      <title>WhatsApp could get a Reddit-style spoiler-hiding feature &#8211; so you won't have to hide from group chats if you&#8217;re behind on the big shows</title>
      <link>https://www.techradar.com/computing/websites-apps/whatsapp-could-get-a-reddit-style-spoiler-hiding-feature-so-you-wont-have-to-hide-from-group-chats-if-youre-behind-on-the-big-shows</link>
      <pubDate>Sat, 21 Feb 2026 17:30:00 +0000</pubDate>
      <guid isPermaLink="false">txjsCBWFvEebXx4U8ya8oU</guid>
      <description>Spoiler tags look like they're on their way to WhatsApp, to keep you from finding out plot twists before you're ready.</description>
    </item>
  </channel>
</rss>
