<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 24 Jan 2026 09:25:49 GMT</lastBuildDate>
    <item>
      <title>Contraintes d&#8217;ouvrir le capot sur leurs donn&#233;es d&#8217;entra&#238;nement, OpenAI, Google et Mistral tra&#238;nent des pieds</title>
      <link>https://www.01net.com/actualites/contraintes-douvrir-le-capot-sur-leurs-donnees-dentrainement-openai-google-et-mistral-trainent-des-pieds.html</link>
      <pubDate>Sat, 24 Jan 2026 09:01:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321856</guid>
      <description>Plusieurs grandes entreprises sp&#233;cialis&#233;es dans l&#8217;intelligence artificielle sont d&#233;j&#224; cens&#233;es fournir un r&#233;sum&#233; des donn&#233;es utilis&#233;es pour entra&#238;ner leurs mod&#232;les, en raison de l'AI Act. Mais aucun de ces g&#233;ants n'a encore jou&#233; le jeu et &#171;&#160;ouvert son capot &#187;. Et pour cause : donner acc&#232;s &#224; ces donn&#233;es pourrait entra&#238;ner des paiements et des d&#233;dommagements &#224; r&#233;p&#233;tition, une situation que les g&#233;ants de l'IA cherchent co&#251;te que co&#251;te &#224; &#233;viter....</description>
    </item>
    <item>
      <title>A practical blueprint for scaling AI in financial services</title>
      <link>https://www.techradar.com/pro/a-practical-blueprint-for-scaling-ai-in-financial-services</link>
      <pubDate>Sat, 24 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">kzJM5ks28HeEpvaWp54vab</guid>
      <description>Financial institutions must shift their focus if they want to see true value from AI.</description>
    </item>
    <item>
      <title>Why everything you think about yourself could be an illusion</title>
      <link>https://www.fastcompany.com/91479856/why-everything-you-think-about-yourself-could-be-an-illusion</link>
      <pubDate>2026-01-24T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91479856/why-everything-you-think-about-yourself-could-be-an-illusion</guid>
      <description>Neuroscience, physics, and Buddhism all agree: There is nothing fixed about us&#8212;not even close.
Below, J. Eric Oliver shares five key insights from his new book,&#160;How To Know Your Self: The Art &amp; Science of Discovering Who You Really Are.</description>
    </item>
    <item>
      <title>Final Fantasy VII Remake Intergrade&#160;: la version Switch 2 est-elle au niveau&#160;?</title>
      <link>https://www.01net.com/actualites/final-fantasy-vii-remake-intergrade-la-version-switch-2-est-elle-au-niveau.html</link>
      <pubDate>Sat, 24 Jan 2026 08:31:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322161</guid>
      <description>Attendue de longue date, la version Switch 2 de Final Fantasy VII Remake Intergrade est disponible depuis cette semaine en France. Mais que vaut vraiment ce portage et m&#233;rite-t-il qu&#8217;on se replonge une &#233;ni&#232;me fois dans l&#8217;aventure ?</description>
    </item>
    <item>
      <title>Xiaomi brade d&#233;j&#224; son tout nouveau smartphone pas cher, le Redmi Note 15 4G, avec des &#233;couteurs offerts en prime</title>
      <link>https://www.frandroid.com/bons-plans/2951789_xiaomi-brade-deja-son-tout-nouveau-smartphone-pas-cher-le-redmi-note-15-4g-avec-des-ecouteurs-offerts-en-prime</link>
      <pubDate>Sat, 24 Jan 2026 08:24:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2951789_xiaomi-brade-deja-son-tout-nouveau-smartphone-pas-cher-le-redmi-note-15-4g-avec-des-ecouteurs-offerts-en-prime</guid>
      <description>
Une batterie de 6 000 mAh, un grand &#233;cran AMOLED, un capteur photo de 108 m&#233;gapixels et une certification IP64, le tout &#224; prix serr&#233; : c'est la promesse du nouveau Xiaomi Redmi Note 15 4G. Avec les soldes, une remise et une ODR font tr&#233;bucher le tarif de 233 euros &#224; 179 euros tout en ajoutant une paire de Redmi Buds Active 6 offerte.
</description>
    </item>
    <item>
      <title>iPhone : Apple pr&#233;parerait un chamboulement en coulisses pour 2028</title>
      <link>https://www.frandroid.com/marques/apple/2954283_iphone-apple-preparerait-un-chamboulement-en-coulisses-pour-2028</link>
      <pubDate>Sat, 24 Jan 2026 08:07:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2954283_iphone-apple-preparerait-un-chamboulement-en-coulisses-pour-2028</guid>
      <description>
Apple se tournerait vers Intel pour moins d&#233;pendre de TSMC sur la fabrication des puces pour certains iPhone d&#232;s 2028.
</description>
    </item>
    <item>
      <title>6 milliards de mots de passe pirat&#233;s&#160;: les virus voleurs de donn&#233;es ont fait un carnage en 2025</title>
      <link>https://www.01net.com/actualites/6-milliards-mots-passe-pirates-virus-voleurs-donnees-carnage-2025.html</link>
      <pubDate>Sat, 24 Jan 2026 08:06:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321231</guid>
      <description>Plus de six milliards de mots de passe ont &#233;t&#233; siphonn&#233;s par des malwares en 2025. M&#234;me les mots de passe complexes et bien s&#233;curis&#233;s n'&#233;chappent pas aux virus de type infostealer. Ces identifiants compromis offrent aux cybercriminels un carburant in&#233;puisable pour leurs attaques.</description>
    </item>
    <item>
      <title>NYT Connections Sports Edition today: Hints and answers for January 24, 2026</title>
      <link>https://mashable.com/article/nyt-connections-sports-edition-hint-answer-today-january-24-2026</link>
      <pubDate>Sat, 24 Jan 2026 08:00:04 +0000</pubDate>
      <guid isPermaLink="false">01XV7EKmQSTLahO4Li96Mtd</guid>
      <description>Connections: Sports Edition is a New York Times word game about finding common sports threads between words. How to solve the day's puzzle.</description>
    </item>
    <item>
      <title>The Loch Capsule dishwasher is small, fast, and efficient &#8212; it even sanitizes gadgets</title>
      <link>https://www.theverge.com/reviews/866476/loch-capsule-review-counter-dishwasher-vanlife-tiny-house</link>
      <pubDate>2026-01-24T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/866476/tcls-playcube-projector-is-more-fun-than-a-rubiks-cube</guid>
      <description>A dishwasher is a luxury item some people can't live without. It's one of the first major kitchen devices I bought just as soon as I could afford one. And now that the kids are grown, it's the appliance I thought I'd miss most in my nomadic vanlife pursuits. Loch sent me its $459.99 / [&#8230;]</description>
    </item>
    <item>
      <title>Our 'favourite travel camera' for most people just hit a record-low price - the five-star-rated OM System OM-5 Mark II</title>
      <link>https://www.techradar.com/cameras/mirrorless-cameras/our-favourite-travel-camera-for-most-people-just-hit-a-record-low-price-the-five-star-rated-om-system-om-5-mark-ii</link>
      <pubDate>Sat, 24 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">gaczUe5kBfvf8JsVTkaegG</guid>
      <description>Get our top-rated travel camera, the OM SYSTEM OM-5 Mark II, for under &#163;900</description>
    </item>
    <item>
      <title>NYT Pips hints, answers for January 24, 2026</title>
      <link>https://mashable.com/article/pips-nyt-games-hints-answers-easy-medium-hard-january-24-2026</link>
      <pubDate>Sat, 24 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">062rjSQtAXu0I5HXeA7Mk4d</guid>
      <description>The New York Times' latest game, Pips, brings domino fun to your desktop. How to play Pips as well as hints in case you get stuck.</description>
    </item>
  </channel>
</rss>
