<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 27 Nov 2025 13:44:54 GMT</lastBuildDate>
    <item>
      <title>7 Best Alexa Speakers (2025): Echo Dot Max, Echo Show 11, Echo Studio</title>
      <link>https://www.wired.com/gallery/best-alexa-and-amazon-echo-speakers/</link>
      <pubDate>Thu, 27 Nov 2025 13:37:00 +0000</pubDate>
      <guid isPermaLink="false">5df1238e4a6a5900092a0c89</guid>
      <description>We&#8217;ve rounded up our favorite smart speakers that let you talk to Alexa, from the popular Echo Dot to the newest Echo Studio.</description>
    </item>
    <item>
      <title>Stranger Things a fait planter Netflix</title>
      <link>https://www.01net.com/actualites/stranger-things-a-fait-planter-netflix.html</link>
      <pubDate>Thu, 27 Nov 2025 13:31:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311722</guid>
      <description>Netflix a fait monter la sauce autour de l'ultime saison de sa s&#233;rie phare, *Stranger Things*&#8230; sans assurer l'intendance derri&#232;re. R&#233;sultat : la horde de fans qui s'est pr&#233;cipit&#233;e sur la premi&#232;re salve d'&#233;pisodes ont &#233;t&#233; accueillis par un &#233;cran noir.</description>
    </item>
    <item>
      <title>The awesome Mac mini M4 just dropped to $479 at Best Buy &#8211; that's a new record low</title>
      <link>https://www.techradar.com/computing/macs/the-awesome-mac-mini-m4-just-dropped-to-usd479-at-best-buy-thats-a-new-record-low</link>
      <pubDate>Thu, 27 Nov 2025 13:26:45 +0000</pubDate>
      <guid isPermaLink="false">T54cgQ4dPcUKdi2EcBLAAB</guid>
      <description>The latest Apple Mac mini with M4 chip is the cheapest it's ever been this Black Friday &#8211; don't miss out!</description>
    </item>
    <item>
      <title>Get up to 47% off AirPods: every AirPods Pro 3, AirPods Pro 2 and AirPods 4 Black Friday deal live now &#8211;run!</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/get-up-to-47-percent-off-airpods-every-airpods-pro-3-airpods-pro-2-and-airpods-4-black-friday-deal-live-now-run</link>
      <pubDate>Thu, 27 Nov 2025 13:24:00 +0000</pubDate>
      <guid isPermaLink="false">SJ55iHAsnhEoWJPD99Vhb4</guid>
      <description>Grab huge discounts on Apple's flagship AirPods today with our lowest-seen prices across all retailers, wherever you live</description>
    </item>
    <item>
      <title>Black Friday VPN : NordVPN, ProtonVPN, ExpressVPN et tous les autres l&#226;chent leurs promotions du Vendredi Noir !</title>
      <link>https://www.frandroid.com/bons-plans/2875107_black-friday-vpn-nordvpn-protonvpn-expressvpn-et-tous-les-autres-lachent-leurs-promotions-du-vendredi-noir</link>
      <pubDate>Thu, 27 Nov 2025 13:22:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2875107_black-friday-vpn-nordvpn-protonvpn-expressvpn-et-tous-les-autres-lachent-leurs-promotions-du-vendredi-noir</guid>
      <description>
Il n'y a pas que les smartphones, &#233;couteurs sans fil, vid&#233;oprojecteurs et consoles de jeux qui profitent du Black Friday. De nombreux services baissent &#233;galement le montant de leurs abonnements tels que les forfaits mobiles, les plateformes de streaming ainsi que les VPN dont voici la s&#233;lection.
</description>
    </item>
    <item>
      <title>How to watch Zattoo from anywhere&#8211; stream Zattoo from abroad</title>
      <link>https://www.techradar.com/how-to-watch/how-to-watch-zattoo-from-anywhere</link>
      <pubDate>Thu, 27 Nov 2025 13:17:51 +0000</pubDate>
      <guid isPermaLink="false">njaYuxw5SeH96gWGbGjxjn</guid>
      <description>How to watch Zattoo from anywhere with a VPN. It carries the channels of many of Europe's biggest public service broadcasters, including the BBC, ITV, Channel 4, Rai, ORF and France TV.</description>
    </item>
    <item>
      <title>Design unique et puissance XXL : ce v&#233;lo &#233;lectrique gravel n&#8217;a peur de rien</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2887869_design-unique-et-puissance-xxl-ce-velo-electrique-gravel-na-peur-de-rien</link>
      <pubDate>Thu, 27 Nov 2025 13:16:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2887869_design-unique-et-puissance-xxl-ce-velo-electrique-gravel-na-peur-de-rien</guid>
      <description>
Osant dans la forme de ses cadres comme &#224; son habitude, la firme suisse se lance pour la premi&#232;re fois dans le v&#233;lo &#233;lectrique gravel avec l&#8217;eb1 Panorama, g&#233;n&#233;reux en style autant qu&#8217;en carbone et en assistance.
</description>
    </item>
    <item>
      <title>How to watch TVA Canada from anywhere- stream TVA from outside Canada</title>
      <link>https://www.techradar.com/how-to-watch/watch-tva-canada-from-anywhere</link>
      <pubDate>Thu, 27 Nov 2025 13:09:40 +0000</pubDate>
      <guid isPermaLink="false">7zNcHaPVJdjCEw8824w3v3</guid>
      <description>How to watch TVA Canada from anywhere with a VPN. The free-to-air platform features uniquely French-Canadian TV shows and films, like MasterChef Quebec.</description>
    </item>
    <item>
      <title>L&#8217;excellente manette de la Nintendo Switch 2 est enfin compatible avec vos jeux Steam, mais &#224; une condition</title>
      <link>https://www.frandroid.com/marques/nintendo/2887917_la-manette-switch-2-pro-est-enfin-compatible-avec-steam-mais-a-une-condition</link>
      <pubDate>Thu, 27 Nov 2025 13:09:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nintendo/2887917_la-manette-switch-2-pro-est-enfin-compatible-avec-steam-mais-a-une-condition</guid>
      <description>
Steam vient d'ajouter le support de deux manettes Nintendo pour le jeu sur PC : la manette Switch 2 Pro ainsi que la manette GameCube.
</description>
    </item>
    <item>
      <title>China&#8217;s Alibaba brings removable batteries to the smart glasses race</title>
      <link>https://www.theverge.com/news/831354/alibaba-quark-smart-glasses</link>
      <pubDate>2025-11-27T08:07:54-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=831354</guid>
      <description>Chinese tech giant Alibaba entered the AI-powered smart glasses race on Thursday with the release of its Quark headsets in China. Notably, the batteries can be swapped out for all day usage unlike competitors.&#160; Alibaba said the Quark AI glasses come in two variants, the S1 flagship and the &#8220;lifestyle-focused&#8221; G1, in multiple colors and [&#8230;]</description>
    </item>
    <item>
      <title>Meta Quest 4 : le futur casque VR/MR se pr&#233;cise (et ne s&#8217;appellera pas Quest)</title>
      <link>https://www.frandroid.com/marques/meta/2888219_meta-quest-4-le-futur-casque-vr-mr-se-precise-et-ne-sappellera-pas-quest</link>
      <pubDate>Thu, 27 Nov 2025 13:05:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2888219_meta-quest-4-le-futur-casque-vr-mr-se-precise-et-ne-sappellera-pas-quest</guid>
      <description>
Attendu courant 2026, le prochain casque de r&#233;alit&#233; mixte de Meta, le &#171; Quest 4 &#187;, a fait l'objet d'une intervention d'un v&#233;t&#233;ran de la VR sur X. L'int&#233;ress&#233; corrobore plusieurs informations int&#233;ressantes sur l'appareil.
</description>
    </item>
    <item>
      <title>La guerre des pixels est relanc&#233;e&#160;: Sony d&#233;voile son premier capteur 200 Mpx pour smartphone</title>
      <link>https://www.01net.com/actualites/la-guerre-des-pixels-est-relancee-sony-devoile-son-premier-capteur-200-mpx.html</link>
      <pubDate>Thu, 27 Nov 2025 13:04:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311684</guid>
      <description>Sony d&#233;voile son premier capteur photo de 200 m&#233;gapixels, le LYTIA 901, marquant son entr&#233;e sur un terrain jusqu&#8217;ici r&#233;serv&#233; &#224; Samsung. Plus grand et plus avanc&#233; sur le papier, il promet des images plus d&#233;taill&#233;es et une meilleure gestion de la lumi&#232;re.</description>
    </item>
    <item>
      <title>The best Black Friday MacBook deals - save 25% on my all-time favorite model</title>
      <link>https://www.techradar.com/computing/macbooks/the-best-black-friday-macbook-deals-save-25-percent-on-my-all-time-favorite-model</link>
      <pubDate>Thu, 27 Nov 2025 13:04:21 +0000</pubDate>
      <guid isPermaLink="false">z2Rd8Cq2szyQPFFMDVCj34</guid>
      <description>All the best MacBook Air and MacBook Pro deals, chosen by a diehard Mac fan.</description>
    </item>
    <item>
      <title>Beat the DJI ban before it hits with this incredible Mavic 3 Pro Black Friday saving, now $1,200 off</title>
      <link>https://www.techradar.com/cameras/drones/beat-the-dji-ban-before-it-hits-with-this-incredible-mavic-3-pro-black-friday-saving-now-usd1-200-off</link>
      <pubDate>Thu, 27 Nov 2025 13:02:01 +0000</pubDate>
      <guid isPermaLink="false">uRCYmwDaYcRf6KF94rGydZ</guid>
      <description>B&amp;H Photo has slashed the price of the triple-camera Mavic 3 Pro Fly More Combo with pro controller drone kit, which is now $2,689 (was $3,889)</description>
    </item>
    <item>
      <title>Black Friday : Dreame d&#233;gaine des promotions rarement vues sur ses mod&#232;les premium [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/aspirateurs-balais-sans-fil/aspirateur-laveur/2880955_black-friday-dreame-degaine-des-promotions-rarement-vues-sur-ses-modeles-premium</link>
      <pubDate>Thu, 27 Nov 2025 13:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/aspirateurs-balais-sans-fil/aspirateur-laveur/2880955_black-friday-dreame-degaine-des-promotions-rarement-vues-sur-ses-modeles-premium</guid>
      <description>
Dreame lance ses offres du Black Friday avec des remises massives sur ses aspirateurs et robots premium, avec des r&#233;ductions pouvant atteindre 1 200 euros. Si vous aviez pr&#233;vu de vous &#233;quiper ou d&#8217;automatiser une partie du m&#233;nage, la p&#233;riode ne pouvait pas mieux tomber.
</description>
    </item>
    <item>
      <title>Chinese Robot Sets Guinness World Record With 66-Mile Walk</title>
      <link>https://gizmodo.com/chinese-robot-sets-guinness-world-record-with-66-mile-walk-2000692336</link>
      <pubDate>Thu, 27 Nov 2025 13:00:45 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000692336</guid>
      <description>The U.S.-China robot race is getting more literal.</description>
    </item>
    <item>
      <title>The Dell 14 Plus Just Hit a New Rock Bottom Price (2025)</title>
      <link>https://www.wired.com/story/dell-14-plus-black-friday-2025/</link>
      <pubDate>Thu, 27 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">6920d8f075beddc93cd6818a</guid>
      <description>With a new low price, Dell just launched the best laptop deal from Black Friday I've seen so far.</description>
    </item>
    <item>
      <title>My favorite e-reader is at its lowest price ever for Black Friday</title>
      <link>https://www.theverge.com/gadgets/828242/kobo-libra-colour-e-reader-black-friday-deal-sale-2025</link>
      <pubDate>2025-11-27T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=828242</guid>
      <description>Amazon&#8217;s Kindle Colorsoft Signature Edition might be heavily discounted for Black Friday, but we&#8217;d argue that the Kobo Libra Colour is actually the better option for those not already embedded in the Amazon ecosystem. It offers more features for slightly less &#8212; and right now, the color e-reader has returned to its all-time low of [&#8230;]</description>
    </item>
    <item>
      <title>Pluribus gets even more lonely &#8212; and dangerous &#8212; in episode 5</title>
      <link>https://www.theverge.com/tech/829885/pluribus-episode-5-discussion-apple-tv</link>
      <pubDate>2025-11-27T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=829885</guid>
      <description>After the last two episodes of Pluribus - in which Carol (Rhea Seehorn) was involved with an exploding hand grenade and an ill-advised truth serum - I couldn't help but wonder just how long the hive mind would tolerate her destructive ways. Well, here we are in episode 5, and I have an answer. "We [&#8230;]</description>
    </item>
    <item>
      <title>20 superb 4K monitors under $200 you must check out this Black Friday</title>
      <link>https://www.techradar.com/computing/monitors/20-superb-4k-monitors-under-usd200-you-must-check-out-this-black-friday</link>
      <pubDate>Thu, 27 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">wtURwLLPVUSBefbNAs2UpQ</guid>
      <description>Save up to 20% on the world's cheapest 4K monitor at just $95 and grab a 55-inch display for less than $170 this Black Friday.</description>
    </item>
    <item>
      <title>Galaxy Buds 3 Pro &#224; 109 &#8364; : Samsung casse le prix de ses meilleurs &#233;couteurs et &#231;a vaut le coup</title>
      <link>https://www.frandroid.com/marques/samsung/2888519_galaxy-buds-3-pro-a-109-e-samsung-casse-le-prix-de-ses-meilleurs-ecouteurs-et-ca-vaut-le-coup</link>
      <pubDate>Thu, 27 Nov 2025 12:59:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2888519_galaxy-buds-3-pro-a-109-e-samsung-casse-le-prix-de-ses-meilleurs-ecouteurs-et-ca-vaut-le-coup</guid>
      <description>
&#192; leur sortie, on a beaucoup ri du design "AirPods-like" et de ces lumi&#232;res sur les tiges. Mais aujourd'hui, le rire laisse place &#224; la stup&#233;faction.
</description>
    </item>
    <item>
      <title>This is one of the only VPN compatible with new Amazon Fire Sticks &#8211; and it's up to 77% off this Black Friday</title>
      <link>https://www.techradar.com/vpn/vpn-services/this-is-one-of-the-only-vpn-compatible-with-new-amazon-fire-sticks-and-its-up-to-77-percent-off-this-black-friday</link>
      <pubDate>Thu, 27 Nov 2025 12:56:41 +0000</pubDate>
      <guid isPermaLink="false">uNaayVTD2uXcNyFwJVsJr8</guid>
      <description>If you are picking up the latest Amazon Fire TV Stick this Black Friday, you might be in for a surprise regarding app compatibility. Here is the best way to secure your streaming and save money doing it.</description>
    </item>
    <item>
      <title>Epic&#8217;s Tim Sweeney says AI tags make &#8216;no sense&#8217; as &#8216;nearly all future production&#8217; will be made with AI anyway</title>
      <link>https://www.techradar.com/ai-platforms-assistants/apple-intelligence/epics-tim-sweeney-says-ai-tags-make-no-sense-as-nearly-all-future-production-will-be-made-with-ai-anyway</link>
      <pubDate>Thu, 27 Nov 2025 12:34:54 +0000</pubDate>
      <guid isPermaLink="false">DqaCj5vrvnMy5PTXv7iLxb</guid>
      <description>AI will soon become so prevalent in games development that AI tags are unnecessary, Epic CEO Tim Sweeney says.</description>
    </item>
    <item>
      <title>Huawei MatePad Edge&#160;: l&#8217;anti-iPad Pro qui veut vraiment remplacer votre PC</title>
      <link>https://www.01net.com/actualites/huawei-matepad-edge-lanti-ipad-pro-qui-veut-vraiment-remplacer-votre-pc.html</link>
      <pubDate>Thu, 27 Nov 2025 12:34:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311635</guid>
      <description>Huawei d&#233;voile la MatePad Edge : une tablette OLED de 14,2 pouces &#233;quip&#233;e d'un refroidissement liquide et d'une charge 140 W. Un monstre de puissance sous HarmonyOS 5 qui vise directement la couronne de l'iPad Pro et de la Surface.</description>
    </item>
    <item>
      <title>Argos' Black Friday deals make Beats' best headphones just &#163;99 &#8211; that's over 70% off!</title>
      <link>https://www.techradar.com/audio/wireless-headphones/argos-black-friday-deals-make-beats-best-headphones-just-gbp99-thats-over-70-percent-off</link>
      <pubDate>Thu, 27 Nov 2025 12:31:09 +0000</pubDate>
      <guid isPermaLink="false">pKUV4gNLQcmprbQDywZMGg</guid>
      <description>These Beats deals are hard to beat, with deepest-ever discounts on models such as the Beats Studio Pro</description>
    </item>
    <item>
      <title>OpenAI now lets business customers choose where their ChatGPT data is hosted</title>
      <link>https://www.techradar.com/pro/openai-now-lets-business-customers-choose-where-their-chatgpt-data-is-hosted</link>
      <pubDate>Thu, 27 Nov 2025 12:31:00 +0000</pubDate>
      <guid isPermaLink="false">KeKV8MNyDdpbNkK8SYyR8N</guid>
      <description>OpenAI's new at-rest data residency options include storage in Europe, the UK, the US and other additional countries.</description>
    </item>
    <item>
      <title>My AI shopping assistants are stuck in the past</title>
      <link>https://www.theverge.com/ai-artificial-intelligence/830450/ai-shopping-assistants-are-stuck-in-the-past</link>
      <pubDate>2025-11-27T07:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=830450</guid>
      <description>All I wanted was a new smartwatch. I had a couple in mind, like the Google Pixel Watch 4 or the Garmin Vivoactive 6, but my AI shopping buddies seemed really convinced watches from a couple years ago were the way to go. Over the past month, OpenAI, Google, Perplexity, and Microsoft have all introduced [&#8230;]</description>
    </item>
    <item>
      <title>Google Maps d&#233;ploie son mode &#233;conomie d&#8217;&#233;nergie, mais il y a un hic</title>
      <link>https://www.frandroid.com/marques/google/2888149_google-maps-deploie-son-mode-economie-denergie-mais-il-y-a-un-hic</link>
      <pubDate>Thu, 27 Nov 2025 12:28:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2888149_google-maps-deploie-son-mode-economie-denergie-mais-il-y-a-un-hic</guid>
      <description>
Le mode &#233;conomie d'&#233;nergie de Google Maps se d&#233;ploie sur Android. Cependant, tous les utilisateurs ne pourront pas en profiter. 
</description>
    </item>
    <item>
      <title>Secretlab has unleashed some absurd gaming desk discounts &#8211; here&#8217;s a few of my absolute favorites</title>
      <link>https://www.techradar.com/gaming/gaming-accessories/secretlab-has-unleashed-some-absurd-gaming-desk-discounts-heres-a-few-of-my-absolute-favorites</link>
      <pubDate>Thu, 27 Nov 2025 12:21:49 +0000</pubDate>
      <guid isPermaLink="false">dG3QFqSAt4E7a7QGDsULag</guid>
      <description>I&#8217;ve hunted down all the finest Secretlab gaming desk deals out there for you, from regular-sized static desks to huge XL standing desks.</description>
    </item>
    <item>
      <title>Intel says star hire from TSMC didn&amp;#8217;t steal secrets</title>
      <link>https://www.theverge.com/news/831353/intel-tsmc-wei-jen-lo-trade-secrets</link>
      <pubDate>2025-11-27T07:21:34-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=831353</guid>
      <description>Intel has defended itself against accusations that its latest executive hire stole trade secrets, as TSMC sues the exec and Taiwanese prosecutors say they&#8217;ve begun a probe into the incident. Wei-Jen Lo, a Taiwanese engineer, joined Intel this fall, hired to help the company improve its mass production processes. He&#8217;d previously worked at the American [&#8230;]...</description>
    </item>
    <item>
      <title>30+ Black Friday streaming deals for Hulu, Prime Video, Apple TV, Paramount+ and more</title>
      <link>https://www.techradar.com/live/news/black-friday-streaming-deals-2025</link>
      <pubDate>Thu, 27 Nov 2025 12:16:47 +0000</pubDate>
      <guid isPermaLink="false">ZvH8pv2cFDBVmRjoZiWAX6</guid>
      <description>I know how steep 2025&#8217;s streaming price hikes have been and these Black Friday deals for Hulu, Prime Video, Apple TV and more can help you stay ahead this Thanksgiving.</description>
    </item>
    <item>
      <title>Dreame&#8217;s Best Robot Vacuums Just Crashed to Their Lowest Prices of the Year for Black Friday</title>
      <link>https://gizmodo.com/dreames-best-robot-vacuums-just-crashed-to-their-lowest-prices-of-the-year-for-black-friday-2000687728</link>
      <pubDate>Thu, 27 Nov 2025 12:15:34 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687728</guid>
      <description>Save up to 60% off the price of the smartest and most advanced automated vacuum/mop combo robots available anywhere now through Dec. 1.</description>
    </item>
    <item>
      <title>C&#8217;est la d&#233;gringolade pour le Samsung Galaxy S25 Edge qui est d&#233;j&#224; &#224; -52 % pour le Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2888079_cest-la-degringolade-pour-le-samsung-galaxy-s25-edge-qui-est-deja-a-52-pour-le-black-friday</link>
      <pubDate>Thu, 27 Nov 2025 12:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2888079_cest-la-degringolade-pour-le-samsung-galaxy-s25-edge-qui-est-deja-a-52-pour-le-black-friday</guid>
      <description>
Le Samsung Galaxy S25 Edge fait partie de ses nouveaux smartphones ultra fins qui ne se vendent pas tr&#232;s bien, alors pas &#233;tonnant qu'on le retrouve d&#233;j&#224; &#224; moiti&#233; prix pour le Black Friday. 
</description>
    </item>
    <item>
      <title>Cyberpunk 2077 just beat The Witcher 3: Wild Hunt to a major sales milestone &#8211; and CD Projekt says the RPG isn&#8217;t done yet</title>
      <link>https://www.techradar.com/gaming/cyberpunk-2077-just-beat-the-witcher-3-wild-hunt-to-a-major-sales-milestone-and-cd-projekt-says-the-rpg-isnt-done-yet</link>
      <pubDate>Thu, 27 Nov 2025 12:13:48 +0000</pubDate>
      <guid isPermaLink="false">JFdE4dBBR4Akdxxk5vxD9</guid>
      <description>CD Projekt Red has announced that Cyberpunk 2077 has officially sold 35 million copies since its 2020 launch.</description>
    </item>
    <item>
      <title>Apple will take Samsung's phone crown for the first time in 14 years &#8211; and it's all thanks to the iPhone 17</title>
      <link>https://www.techradar.com/phones/iphone/apple-will-take-samsungs-phone-crown-for-the-first-time-in-14-years-and-its-all-thanks-to-the-iphone-17</link>
      <pubDate>Thu, 27 Nov 2025 12:11:26 +0000</pubDate>
      <guid isPermaLink="false">Vj3eKkwjRpfo7H8zZgtHNn</guid>
      <description>It looks as though we'll be celebrating a new smartphone sales champion come the end of the year.</description>
    </item>
    <item>
      <title>Samsung Galaxy Ring vs Oura Ring 4: Which smart ring should you buy for Black Friday?</title>
      <link>https://www.techradar.com/health-fitness/samsung-galaxy-ring-vs-oura-ring-4-which-smart-ring-should-you-buy-for-black-friday</link>
      <pubDate>Thu, 27 Nov 2025 12:10:44 +0000</pubDate>
      <guid isPermaLink="false">PwofBuNBYngE2BY2oznMkh</guid>
      <description>Can't choose between the Samsung Galaxy Ring and the Oura Ring 4? I'm a smart ring expert: here's which one I'd buy today.</description>
    </item>
    <item>
      <title>17 Best White Elephant Gifts (2025): Coffee Pot Mug, Legos, Sushi Magnets, and More</title>
      <link>https://www.wired.com/gallery/best-white-elephant-gifts-2025/</link>
      <pubDate>Thu, 27 Nov 2025 12:07:00 +0000</pubDate>
      <guid isPermaLink="false">671f0007dc407fd8b5892976</guid>
      <description>Bring the gift everyone will want to win from this year's holiday party, from a cute jacket for a beer can to magnets they'll wish they could eat.</description>
    </item>
    <item>
      <title>This Might Be the Best 3-In-1 Charging Stand for Apple Devices, Except for One Thing</title>
      <link>https://gizmodo.com/anker-prime-wireless-charging-station-review-2000686108</link>
      <pubDate>Thu, 27 Nov 2025 12:05:02 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000686108</guid>
      <description>Anker's Anker Prime Wireless Charging Station has a screen, fan-assisted 25W wireless charging, and an absurd price.</description>
    </item>
    <item>
      <title>Two PC makers warn of price hikes for new computers and suggest that Black Friday bargains might be your last chance saloon</title>
      <link>https://www.techradar.com/computing/gaming-pcs/two-pc-makers-warn-of-price-hikes-for-new-computers-and-suggest-that-black-friday-bargains-might-be-your-last-chance-saloon</link>
      <pubDate>Thu, 27 Nov 2025 12:03:51 +0000</pubDate>
      <guid isPermaLink="false">7xW7ssUc95Y9ZBkS9r8R9e</guid>
      <description>RAM pricing has truly rocketed, so I'm not surprised two PC makers are warning Black Friday is your last chance to get a good deal on a new PC.</description>
    </item>
    <item>
      <title>Ce premier visuel du Xiaomi 17 Ultra d&#233;voile-t-il son arme secr&#232;te&#160;?</title>
      <link>https://www.01net.com/actualites/ce-premier-visuel-du-xiaomi-17-ultra-devoile-t-il-son-arme-secrete.html</link>
      <pubDate>Thu, 27 Nov 2025 12:03:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311623</guid>
      <description>Xiaomi pr&#233;parerait un Xiaomi 17 Ultra qui marquerait une rupture strat&#233;gique avec seulement trois capteurs photo au lieu de quatre, dont un t&#233;l&#233;objectif de 200 m&#233;gapixels. Le smartphone haut de gamme, &#233;quip&#233; du Snapdragon 8 Elite Gen 5, pourrait &#234;tre d&#233;voil&#233; d&#232;s d&#233;cembre 2025 en Chine avant une commercialisation mondiale anticip&#233;e.</description>
    </item>
    <item>
      <title>The best Black Friday deals in the UK &#8211; 110+ offers on TVs, appliances, laptops, headphones, and more top-rated tech</title>
      <link>https://www.techradar.com/live/news/the-best-black-friday-deals-in-the-uk-110-offers-on-tvs-appliances-laptops-headphones-and-more-top-rated-tech</link>
      <pubDate>Thu, 27 Nov 2025 12:03:48 +0000</pubDate>
      <guid isPermaLink="false">CsczNXPeMvNWo5B9WFiMM3</guid>
      <description>I've covered the Black Friday sales for a decade as a shopping expert, and I'm here to bring you all of the best Black Friday deals available now in the UK.</description>
    </item>
    <item>
      <title>Clean Up on the Black Friday Deals at Eureka and Save Big On These Five Powerhouse Vacuums</title>
      <link>https://gizmodo.com/clean-up-on-the-black-friday-deals-at-eureka-and-save-big-on-these-five-powerhouse-vacuums-2000684873</link>
      <pubDate>Thu, 27 Nov 2025 12:00:38 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000684873</guid>
      <description>Robotic vacuum and mop combos, powerful floor vacuums, and ultra-versatile stick vacuums are up to 33% off now through Dec 1.</description>
    </item>
    <item>
      <title>5 Great Video Games You Might Have Missed (2025): Blippo+, Sektori, Dispatch, Blue Prince</title>
      <link>https://www.wired.com/story/5-great-games-you-might-have-missed-in-2025/</link>
      <pubDate>Thu, 27 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">6925dfdce9672ed9a6229270</guid>
      <description>When you&#8217;ve finished playing the big-name video games, try Blippo+, Sektori, Dispatch, and some of our other favorites from 2025.</description>
    </item>
    <item>
      <title>The VPN panic is only getting started</title>
      <link>https://www.theverge.com/tech/827435/uk-vpn-restrictions-ban-online-safety-act</link>
      <pubDate>2025-11-27T07:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=827435</guid>
      <description>After the Online Safety Act's onerous internet age restrictions took effect this summer, it didn't take long for Brits to get around them. Some methods went viral, like using video game Death Stranding's photo mode to bypass face scans. But in the end, the simplest solution won out: VPNs. Virtual private networks have proven remarkably [&#8230;]</description>
    </item>
    <item>
      <title>Prehistoric Planet: Ice Age showrunners confirm there&#8217;s no AI on screen &#8211; &#8216;mother nature is a better creator than any AI&#8217;</title>
      <link>https://www.techradar.com/streaming/apple-tv-plus/mother-nature-is-a-better-creator-than-any-ai-prehistoric-planet-ice-age-confirm-theres-no-ai-on-screen</link>
      <pubDate>Thu, 27 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">NakQ6WAwCCiTFxynPs2WUP</guid>
      <description>All five episodes of Prehistoric Planet: Ice Age are available to stream on Apple TV, but you won't see any AI taking us back in time.</description>
    </item>
    <item>
      <title>Jolt Capital V | Jusqu&#8217;&#224; 1,6&#160;milliard pour de &#171;&#160;vraies&#160;&#187; technologies souveraines</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-11-27/jolt-capital-v/jusqu-a-1-6-milliard-pour-de-vraies-technologies-souveraines.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Thu, 27 Nov 2025 07:00:00 -0500</pubDate>
      <guid isPermaLink="false">54936512ac493107a0698c5fde540fab</guid>
      <description>&#171;&#160;Un pays d&#8217;o&#249; la deeptech a disparu est un futur pays pauvre.&#160;&#187; &#199;a aurait pu &#234;tre le slogan du fonds de 1&#160;milliard de dollars que Jolt Capital annonce ce jeudi. C&#8217;est surtout une crainte que le pr&#233;sident de la firme europ&#233;enne, pr&#233;sente &#224; Montr&#233;al depuis l&#8217;&#233;t&#233;&#160;2024, a &#224; propos d&#8217;&#201;tats comme le Canada, qui tardent &#224; s&#8217;ajuster &#224; la nouvelle r&#233;alit&#233; g&#233;opolitique....</description>
    </item>
    <item>
      <title>Get an LG OLED and 5.1.2ch Dolby Atmos soundbar for under &#163;1,000 with these Black Friday deals</title>
      <link>https://www.techradar.com/televisions/get-an-lg-oled-and-5-1-2ch-dolby-atmos-soundbar-for-under-gbp1-000-with-these-black-friday-deals</link>
      <pubDate>Thu, 27 Nov 2025 11:55:35 +0000</pubDate>
      <guid isPermaLink="false">QiHYjAoPhtANHfBdFWCLq9</guid>
      <description>There's no other time of year than Black Friday where you can get an LG OLED and a 5.1.2 channel Dolby Atmos soundbar for cheap</description>
    </item>
    <item>
      <title>Best Black Friday Deals 2025: We've Tested Every Item and Tracked Every Price</title>
      <link>https://www.wired.com/story/black-friday-deals-2025/</link>
      <pubDate>Thu, 27 Nov 2025 11:52:40 +0000</pubDate>
      <guid isPermaLink="false">69271d9a58e4e06eb6f254cb</guid>
      <description>It's peak purchase season, and our Reviews team has scoured the entire internet to find the best Black Friday deals on gear we've tested and approved.</description>
    </item>
    <item>
      <title>Elon Musk lance un syst&#232;me d&#8217;affichage par popularit&#233; sur X</title>
      <link>https://www.frandroid.com/culture-tech/web/2887817_elon-musk-lance-un-systeme-daffichage-par-popularite-sur-x</link>
      <pubDate>Thu, 27 Nov 2025 11:45:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/web/2887817_elon-musk-lance-un-systeme-daffichage-par-popularite-sur-x</guid>
      <description>
Les utilisateurs du r&#233;seau social X (Twitter) pourront b&#233;n&#233;ficier d'un nouvel affichage o&#249; leurs abonnements seront class&#233;s par Grok en fonction de leur popularit&#233;. 
</description>
    </item>
  </channel>
</rss>
