<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 19 Nov 2025 13:45:43 GMT</lastBuildDate>
    <item>
      <title>La charge sans fil serait une aberration &#233;cologique : l&#8217;&#233;quivalent d&#8217;une ville comme Nantes gaspill&#233;</title>
      <link>https://www.frandroid.com/produits-android/2876097_la-charge-sans-fil-serait-une-aberration-ecologique-lequivalent-dune-ville-comme-nantes-gaspille</link>
      <pubDate>Wed, 19 Nov 2025 13:44:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2876097_la-charge-sans-fil-serait-une-aberration-ecologique-lequivalent-dune-ville-comme-nantes-gaspille</guid>
      <description>
Bon, il faut qu'on parle de votre chargeur &#224; induction. Pratique ? Indiscutablement. &#201;cologique ? Absolument pas. Entre la perte d'&#233;nergie et la chaleur d&#233;gag&#233;e, le bilan est lourd. Si tout le monde s'y met, on gaspille litt&#233;ralement l'&#233;quivalent de la production de 200 &#233;oliennes juste pour ne pas brancher un c&#226;ble.
</description>
    </item>
    <item>
      <title>Early Black Friday sale: Samsung&#8217;s flagship 2TB 990 Pro SSD is what creative pros need - and costs just &#163;121</title>
      <link>https://www.techradar.com/pro/early-black-friday-sale-samsungs-flagship-2tb-990-pro-ssd-is-what-creative-pros-need-and-costs-just-gbp121</link>
      <pubDate>Wed, 19 Nov 2025 13:42:41 +0000</pubDate>
      <guid isPermaLink="false">uGkzLK7KV5x7q2sz2v7bGi</guid>
      <description>The 2TB Samsung 990 Pro SSD delivers read speeds up to 7,450MB/s, and it&#8217;s available for just &#163;121</description>
    </item>
    <item>
      <title>Le &#8220;packaging&#8221; : l&#8217;arme secr&#232;te d&#8217;Intel pour reconqu&#233;rir le march&#233; des puces et des processeurs</title>
      <link>https://www.frandroid.com/marques/intel/2850529_le-packaging-larme-secrete-dintel-pour-reconquerir-le-marche-des-puces-et-des-processeurs</link>
      <pubDate>Wed, 19 Nov 2025 13:38:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/intel/2850529_le-packaging-larme-secrete-dintel-pour-reconquerir-le-marche-des-puces-et-des-processeurs</guid>
      <description>
Dans la course aux processeurs, il n&#8217;y a pas que la finesse de gravure qui compte&#160;! Alors qu&#8217;Intel est vent debout pour reprendre la couronne des plus petits transistors face au Ta&#239;wanais TSMC, le g&#233;ant am&#233;ricain met en lumi&#232;re un de ces atouts peu connus&#160;: sa capacit&#233; &#224; coller les puces ensemble.
</description>
    </item>
    <item>
      <title>My favorite game of 2025 is half off at Target thanks to a fun-tastic early Black Friday sale</title>
      <link>https://www.techradar.com/seasonal-sales/my-favorite-game-of-2025-is-half-off-at-target-thanks-to-a-fun-tastic-early-black-friday-sale</link>
      <pubDate>Wed, 19 Nov 2025 13:36:01 +0000</pubDate>
      <guid isPermaLink="false">5MF5ywnu9xnzK4SMDS2unD</guid>
      <description>Flip 7 is the best game I've played this year, it's fun for the whole family, and target will sell it to you for 50%-off.</description>
    </item>
    <item>
      <title>Amazon n&#8217;h&#233;site pas &#224; vendre au rabais de nombreux produits Tech la veille du Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2860071_amazon-lance-une-vague-de-promotions-pour-le-pre-black-friday-les-18-offres-a-ne-pas-louper</link>
      <pubDate>Wed, 19 Nov 2025 13:31:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860071_amazon-lance-une-vague-de-promotions-pour-le-pre-black-friday-les-18-offres-a-ne-pas-louper</guid>
      <description>
Amazon lance &#224; partir de demain ses offres Black Friday, mais certaines sont d&#233;j&#224; en lignes. Plusieurs gammes telles que les smartphones, ordinateurs portables, casques audio et consoles de jeux b&#233;n&#233;ficient actuellement de prix r&#233;duits.
</description>
    </item>
    <item>
      <title>Il y a -35 % sur cet excellent stabilisateur DJI pour smartphone, capable de suivre automatiquement un sujet</title>
      <link>https://www.frandroid.com/bons-plans/2731841_il-y-a-35-sur-cet-excellent-stabilisateur-dji-pour-smartphone-capable-de-suivre-automatiquement-un-sujet</link>
      <pubDate>Wed, 19 Nov 2025 13:30:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2731841_il-y-a-35-sur-cet-excellent-stabilisateur-dji-pour-smartphone-capable-de-suivre-automatiquement-un-sujet</guid>
      <description>
Le DJI Osmo Mobile 7P est un gimbal qui offre non seulement une stabilisation efficace, mais aussi un suivi de sujet pr&#233;cis et ultra-r&#233;actif. S'il vous int&#233;resse, vous pourrez le trouver &#224; 89 euros au lieu de 139,99 euros sur Amazon, pendant le Black Friday.
</description>
    </item>
    <item>
      <title>Europe&amp;#8217;s cookie nightmare is crumbling</title>
      <link>https://www.theverge.com/news/823788/europe-cookie-prompt-browser-changes-proposal</link>
      <pubDate>2025-11-19T08:28:08-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=823788</guid>
      <description>The EU&#8217;s cookie consent policies have been an annoying and unavoidable part of browsing the web in Europe since their introduction in 2018. But the cookie nightmare is about to crumble thanks to some big proposed changes announced by the European Commission today. Instead of having to click accept or reject on a cookie pop-up [&#8230;]</description>
    </item>
    <item>
      <title>Netflix hasn&#8217;t confirmed Virgin River season 7's rumored release date, but there&#8217;s an obvious reason why it makes perfect sense</title>
      <link>https://www.techradar.com/streaming/netflix/netflix-hasnt-confirmed-virgin-river-season-7s-rumored-release-date-but-theres-an-obvious-reason-why-it-makes-perfect-sense</link>
      <pubDate>Wed, 19 Nov 2025 13:27:34 +0000</pubDate>
      <guid isPermaLink="false">Y5JJE5YMbVLBvWXqW59D85</guid>
      <description>We knew Virgin River season 7 would be getting a 2026 release, but we shouldn't be surprised by the release window leak.</description>
    </item>
    <item>
      <title>Mod&#233;ration, transparence&#160;: Amazon devra jouer selon les r&#232;gles europ&#233;ennes</title>
      <link>https://www.01net.com/actualites/moderation-transparence-amazon-devra-jouer-selon-les-regles-europeennes.html</link>
      <pubDate>Wed, 19 Nov 2025 13:27:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309333</guid>
      <description>Amazon a perdu son pari face &#224; la justice europ&#233;enne. Le g&#233;ant am&#233;ricain du commerce en ligne est donc bien consid&#233;r&#233; comme une &#171; tr&#232;s grande plateforme en ligne &#187; aux yeux du r&#232;glement sur les services num&#233;riques (DSA).</description>
    </item>
    <item>
      <title>Sony's fantastic WH-1000XM6 headphones just got their first-ever UK price cut &#8211; beat the Black Friday rush</title>
      <link>https://www.techradar.com/audio/wireless-headphones/sonys-fantastic-wh-1000xm6-headphones-just-got-their-first-ever-uk-price-cut-beat-the-black-friday-rush</link>
      <pubDate>Wed, 19 Nov 2025 13:16:41 +0000</pubDate>
      <guid isPermaLink="false">7HaZs2zTCvuA6ekigCS7Kg</guid>
      <description>Get &#163;50 off Sony's range-topping noise-cancelling over-ear headphones</description>
    </item>
    <item>
      <title>J&#8217;ai d&#233;sinstall&#233; PairDrop et l&#226;ch&#233; AirDrop : LocalSend est la seule vraie solution universelle pour transf&#233;rer des fichiers</title>
      <link>https://www.frandroid.com/android/2876005_jai-desinstalle-pairdrop-et-lache-airdrop-localsend-est-la-seule-vraie-solution-universelle-pour-transferer-des-fichiers</link>
      <pubDate>Wed, 19 Nov 2025 13:14:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/2876005_jai-desinstalle-pairdrop-et-lache-airdrop-localsend-est-la-seule-vraie-solution-universelle-pour-transferer-des-fichiers</guid>
      <description>
Vous avez un Mac et un smartphone Android ? Ou un PC Windows et un iPad ? Alors vous connaissez l'enfer du transfert de fichiers. On m'a souvent parl&#233; de PairDrop, la solution web. C'est mignon, &#231;a d&#233;panne. Mais la vraie solution industrielle, celle qui ne compresse pas vos fichiers et respecte votre vie priv&#233;e, c'est LocalSend.
</description>
    </item>
    <item>
      <title>TikTok is letting users control how much AI content they see</title>
      <link>https://www.theverge.com/news/823775/tiktok-ai-generated-content-controls-manage-topics</link>
      <pubDate>2025-11-19T08:06:49-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=823775</guid>
      <description>TikTok is testing a new control that will let users manage how much AI-generated content appears in their video feed on the app. To help make the filter more effective, the app will also soon start adding invisible watermarks to AI content. The new AI slider will appear along with TikTok&#8217;s other content controls under [&#8230;]</description>
    </item>
    <item>
      <title>Black Friday Garmin watch deals are officially live &#8211; including best-ever discounts on this 'perfect' Fenix 8 smartwatch</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/black-friday-garmin-watch-deals-are-officially-live-including-best-ever-discounts-on-this-years-perfect-fenix-8-smartwatch</link>
      <pubDate>Wed, 19 Nov 2025 13:06:42 +0000</pubDate>
      <guid isPermaLink="false">vtyDEZryVDGfLZRu44yTdS</guid>
      <description>Why wait for Black Friday? These Garmin watch deals have already started.</description>
    </item>
    <item>
      <title>Want a Ring doorbell but don't want the subscription? Check out this great half-price alternative instead</title>
      <link>https://www.techradar.com/home/smart-home/want-a-ring-doorbell-but-dont-want-the-subscription-check-out-this-great-half-price-alternative-instead</link>
      <pubDate>Wed, 19 Nov 2025 13:03:04 +0000</pubDate>
      <guid isPermaLink="false">fWq4PEpHz4arnqtHyaXJFB</guid>
      <description>There's no need to buy a subscription plan when the Eufy Video Doorbell dual captures crisp footage from its twin cameras and saves it locally on an SD card.</description>
    </item>
    <item>
      <title>Comment Xiaomi va &#171; pr&#233;parer l&#8217;arriv&#233;e du v&#233;hicule &#233;lectrique &#187; en France</title>
      <link>https://www.frandroid.com/marques/xiaomi/2873321_comment-xiaomi-va-preparer-larrivee-du-vehicule-electrique-en-france</link>
      <pubDate>Wed, 19 Nov 2025 13:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2873321_comment-xiaomi-va-preparer-larrivee-du-vehicule-electrique-en-france</guid>
      <description>
Xiaomi France confirme que les Xiaomi Stores qui reviennent en France servent, entre autres, &#224; pr&#233;parer l'arriv&#233;e des voitures &#233;lectriques de la marque. On commence par la SU7 ou le YU7 ?
</description>
    </item>
    <item>
      <title>James Gunn Says Another Hero Isn&#8217;t Showing Up for &#8216;Man of Tomorrow&#8217;</title>
      <link>https://gizmodo.com/superman-man-of-tomorrow-doctor-fate-james-gunn-2000687859</link>
      <pubDate>Wed, 19 Nov 2025 13:00:32 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687859</guid>
      <description>Plus, 'Twisted Metal' is back for round 3.</description>
    </item>
    <item>
      <title>Thrustmaster ESWAP X2 H.E. Controller Review</title>
      <link>https://www.wired.com/review/thrustmaster-eswap-x2-he-controller/</link>
      <pubDate>Wed, 19 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">691b0d569d626bbc630cd181</guid>
      <description>Harder, better, faster, modular. This truly amazing pro-tier controller can be finessed to do just about anything. But it will cost you.</description>
    </item>
    <item>
      <title>Screw it, I&#8217;m installing Linux</title>
      <link>https://www.theverge.com/tech/823337/switching-linux-gaming-desktop-cachyos</link>
      <pubDate>2025-11-19T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=823337</guid>
      <description>This time I'm really going to do it. I am going to put Linux on my gaming PC. Calling it now. 2026 is the year of Linux on the desktop. Or at least on mine. Linux has been a perfectly viable desktop OS for ages. But gaming on Linux is now viable, too. Valve's hard [&#8230;]</description>
    </item>
    <item>
      <title>Credit risk automation platform Kaaj raises $3.8M seed from Kindred Ventures</title>
      <link>https://techcrunch.com/2025/11/19/credit-risk-automation-platform-kaaj-raises-3-8m-seed-from-kindred-ventures/</link>
      <pubDate>Wed, 19 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069042</guid>
      <description>Kaaj announced on Wednesday a $3.8 million seed round from Kindred Ventures and Better Tomorrow Ventures.</description>
    </item>
    <item>
      <title>I tested Caira, the first Nano Banana AI camera &#8211; now I&#8217;m cancelling my Lightroom subscription</title>
      <link>https://www.techradar.com/cameras/caira-camera-review</link>
      <pubDate>Wed, 19 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">8CwYaFPyeDHe59ZgyNGHAk</guid>
      <description>The Caira claims to fuse proper camera engineering with Google&#8217;s new &#8216;Nano Banana&#8217; AI. It mostly succeeds, but also makes you wonder if you&#8217;ve just been replaced by your own camera.</description>
    </item>
    <item>
      <title>The classroom lab I still remember</title>
      <link>https://www.fastcompany.com/91444498/the-classroom-lab-i-still-remember</link>
      <pubDate>2025-11-19T13:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444498/the-classroom-lab-i-still-remember</guid>
      <description>A physics lesson and a blueprint for teaching.
Across&#160;nearly four&#160;decades as a teacher, principal, superintendent,&#160;funder, and now leader of a large education nonprofit organization, the experience that most shaped my view of learning&#160;wasn&#8217;t&#160;a grand reform or a shiny new program. It was a Friday physics lab in Brooklyn. My students predicted a graph that&#160;couldn&#8217;t&#160;exist&#8212;a vertical line for velocity and time. What followed was confusion, debate, trial, and error. And then discovery: Velocity&#160;requires&#160;both displacement and time. That brief struggle taught me, the teacher at the time, more about h...</description>
    </item>
    <item>
      <title>Vie num&#233;rique | Mot de passe&#160;: &#171;&#160;admin&#160;&#187; ou &#171;&#160;123456&#160;&#187;</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-11-19/vie-numerique/mot-de-passe-admin-ou-123456.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 19 Nov 2025 08:00:00 -0500</pubDate>
      <guid isPermaLink="false">27d366e3141a399790e31eb660223edd</guid>
      <description>Les habitudes en mati&#232;re de cybers&#233;curit&#233; stagnent au Canada. Malgr&#233; les mises en garde r&#233;currentes, une majorit&#233; de Canadiens n&#233;glige toujours les mesures les plus &#233;l&#233;mentaires de protection de leur vie num&#233;rique. C&#8217;est ce que r&#233;v&#232;le l&#8217;&#233;dition&#160;2025 d&#8217;un sondage annuel effectu&#233; par la firme de cybers&#233;curit&#233; NordPass.</description>
    </item>
    <item>
      <title>Quel casque choisir pour votre Nintendo Switch 2 en 2025&#8201;?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-gaming/832492_selection-meilleurs-casques-nintendo-switch</link>
      <pubDate>Wed, 19 Nov 2025 12:59:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-gaming/832492_selection-meilleurs-casques-nintendo-switch</guid>
      <description>
En tant que console de jeux hybride, la Nintendo Switch profitera fortement d'un casque ou d'&#233;couteurs si vous jouez en mode portable.
</description>
    </item>
    <item>
      <title>Le secret de polichinelle n&#8217;est plus : voici le nom rigolo d&#8217;Android 17</title>
      <link>https://www.frandroid.com/marques/google/2875641_le-secret-de-polichinelle-nest-plus-voici-le-nom-rigolo-dandroid-17</link>
      <pubDate>Wed, 19 Nov 2025 12:55:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2875641_le-secret-de-polichinelle-nest-plus-voici-le-nom-rigolo-dandroid-17</guid>
      <description>
Un indice contenu dans du code d'Android Canary nous confirme quel sera vraisemblablement le nom de code d'Android 17. Une nouvelle fois, il est tr&#232;s sucr&#233; et rigolo, dans la plus pure tradition de Google en la mati&#232;re.
</description>
    </item>
    <item>
      <title>I&#8217;ve spent hundreds of hours ranking the best Switch 2 games, and many of them are now on sale as part of early Black Friday sales</title>
      <link>https://www.techradar.com/gaming/nintendo/black-friday-switch-2-games-deals-round-up</link>
      <pubDate>Wed, 19 Nov 2025 12:50:09 +0000</pubDate>
      <guid isPermaLink="false">k5DvTcrC8RCYPH32hPW4xS</guid>
      <description>These best Switch 2 games are on sale for Black Friday. Here's the best deals on games like Split Fiction, NBA 2K26, and more.</description>
    </item>
    <item>
      <title>At this Black Friday price, this is the cheapest phone I would actually recommend buying</title>
      <link>https://www.techradar.com/seasonal-sales/at-this-black-friday-price-this-is-the-cheapest-phone-i-would-actually-recommend-buying</link>
      <pubDate>Wed, 19 Nov 2025 12:49:54 +0000</pubDate>
      <guid isPermaLink="false">5wdrSL5XzREwjPLtgDz93V</guid>
      <description>The CMF Phone 2 is the cheapest handset I&#8217;d actually recommend, and it&#8217;s even cheaper with this early Black Friday deal.</description>
    </item>
    <item>
      <title>Europe is scaling back its landmark privacy and AI laws</title>
      <link>https://www.theverge.com/news/823750/european-union-ai-act-gdpr-changes</link>
      <pubDate>2025-11-19T07:47:09-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=823750</guid>
      <description>After years of staring down the world&#8217;s biggest tech companies and setting the bar for tough regulation worldwide, Europe has blinked. Under intense pressure from industry and the US government, Brussels is stripping protections from its flagship General Data Protection Regulation (GDPR) &#8212; including simplifying its infamous cookie permission pop-ups &#8212;&#160;and relaxing or delaying landmark [&#8230;]...</description>
    </item>
    <item>
      <title>The Salomon XT-6 are the trendiest techwear of 2025 &#8211; and they&#8217;re finally on sale for Black Friday</title>
      <link>https://www.techradar.com/health-fitness/the-salomon-xt-6-are-the-trendiest-techwear-of-2025-and-theyre-finally-on-sale-for-black-friday</link>
      <pubDate>Wed, 19 Nov 2025 12:43:50 +0000</pubDate>
      <guid isPermaLink="false">qFJnNcWqqjmW8NcG6dA5A4</guid>
      <description>The uber-popular Salomon XT-6 are now on sale at various retailers ahead of Black Friday.</description>
    </item>
    <item>
      <title>This is the perfect cheap Black Friday iPhone deal: get the iPhone 16e for free with a plan at Metro by T-Mobile</title>
      <link>https://www.techradar.com/phones/iphone/this-is-the-perfect-cheap-black-friday-iphone-deal-get-the-iphone-16e-for-free-with-a-plan-at-metro-by-t-mobile</link>
      <pubDate>Wed, 19 Nov 2025 12:30:00 +0000</pubDate>
      <guid isPermaLink="false">YjhQkwM8GStGUMZrHoE6xS</guid>
      <description>Pair up the excellent iPhone 16e for free with one of Metro by T-Mobile's excellent cheap prepaid unlimited plans this week.</description>
    </item>
    <item>
      <title>How to break the solopreneur &#8216;loneliness loop&#8217;</title>
      <link>https://www.fastcompany.com/91444220/how-to-break-the-solopreneur-loneliness-loop</link>
      <pubDate>2025-11-19T12:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444220/how-to-break-the-solopreneur-loneliness-loop</guid>
      <description>Building a business alone can feel isolating. But experts say it doesn&#8217;t have to be. 
When Gabriela Flax left her corporate position managing 40 people to work on her career coaching businesses solo and moved from London to Sydney, the first thing she noticed was the silence. Without the constant movement, office hum, phones, and elevator dings, she says, she could finally bask in&#160;the quiet she&#8217;d always craved....</description>
    </item>
    <item>
      <title>As tech jobs stall, new research claims the dark web job market is growing more attractive</title>
      <link>https://www.techradar.com/pro/security/as-tech-jobs-stall-new-research-claims-the-dark-web-job-market-is-growing-more-attractive</link>
      <pubDate>Wed, 19 Nov 2025 12:29:00 +0000</pubDate>
      <guid isPermaLink="false">T4VMd93btJQjNxvCdJRWKd</guid>
      <description>Kaspersky research finds the median dark web job seeker is just 24 years old.</description>
    </item>
    <item>
      <title>Sennheiser's Black Friday headphones deals are live &#8211; and at these prices, sell-out risk is high(!)</title>
      <link>https://www.techradar.com/audio/wireless-headphones/sennheisers-black-friday-headphones-deals-are-live-and-at-these-prices-sell-out-risk-is-high</link>
      <pubDate>Wed, 19 Nov 2025 12:27:44 +0000</pubDate>
      <guid isPermaLink="false">pZcT84zZwjYo7Yii5qoihC</guid>
      <description>Just waking up to Sennheiser's Black Friday deals rollout? Have at them now before everyone else notices, music lover</description>
    </item>
    <item>
      <title>AMD FSR &#171; Redstone &#187; : de meilleures performances et une qualit&#233; d&#8217;image dop&#233;e d&#232;s le 10 d&#233;cembre ?</title>
      <link>https://www.frandroid.com/marques/amd/2875099_amd-fsr-redstone-de-meilleures-performances-et-une-qualite-dimage-dopee-des-le-10-decembre</link>
      <pubDate>Wed, 19 Nov 2025 12:23:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amd/2875099_amd-fsr-redstone-de-meilleures-performances-et-une-qualite-dimage-dopee-des-le-10-decembre</guid>
      <description>
Le bouquet de technologies FSR Redstone devrait enfin se mat&#233;rialiser &#224; plus grande &#233;chelle cet hiver. AMD vient en effet de confirmer qu'une annonce le concernant aura lieu d&#232;s le 10 d&#233;cembre prochain.
</description>
    </item>
    <item>
      <title>YouTube va encore copier une fonction de TikTok, mais c&#8217;est plut&#244;t une bonne chose</title>
      <link>https://www.frandroid.com/marques/google/2875335_youtube-va-encore-copier-une-fonction-de-tiktok-mais-cest-plutot-une-bonne-chose</link>
      <pubDate>Wed, 19 Nov 2025 12:20:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2875335_youtube-va-encore-copier-une-fonction-de-tiktok-mais-cest-plutot-une-bonne-chose</guid>
      <description>
YouTube commence &#224; d&#233;ployer aupr&#232;s de certains utilisateurs une messagerie permettant de s'envoyer rapidement une vid&#233;o vue sur la plateforme. 
</description>
    </item>
    <item>
      <title>Make 2026 the year of good gaming posture and grab this premium Herman Miller gaming chair for 25% off ahead of Black Friday</title>
      <link>https://www.techradar.com/gaming/gaming-accessories/make-2026-the-year-of-good-gaming-posture-and-grab-this-premium-herman-miller-gaming-chair-for-25-percent-off-ahead-of-black-friday</link>
      <pubDate>Wed, 19 Nov 2025 12:18:25 +0000</pubDate>
      <guid isPermaLink="false">cK2ieZrZvdUH59EQnYbvpA</guid>
      <description>My favorite premium Herman Miller gaming chair is now cheaper than ever thanks to this extra discount code.</description>
    </item>
    <item>
      <title>Tout le monde retient son souffle : la Nasa va r&#233;v&#233;ler ce soir de nouvelles images de l&#8217;objet venu d&#8217;ailleurs 3I/Atlas</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-tout-monde-retient-son-souffle-nasa-va-reveler-ce-soir-nouvelles-images-objet-venu-ailleurs-3i-atlas-127657/#xtor%3DRSS-8</link>
      <pubDate>Wed, 19 Nov 2025 13:17:10 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-tout-monde-retient-son-souffle-nasa-va-reveler-ce-soir-nouvelles-images-objet-venu-ailleurs-3i-atlas-127657/#xtor%3DRSS-8</guid>
      <description>Ce 19 novembre 2025, &#224; 21 h, heure de Paris, la Nasa va r&#233;v&#233;ler des images, prises notamment par plusieurs de ses missions dans le Syst&#232;me solaire, du troisi&#232;me objet interstellaire d&#233;couvert de fa&#231;on incontestable par la noosph&#232;re : 3I/Atlas. On aimerait bien qu'il soit une sonde interstellaire...</description>
    </item>
    <item>
      <title>As Lovable hits $200M ARR, its CEO credits staying in Europe for its success</title>
      <link>https://techcrunch.com/2025/11/19/as-lovable-hits-200m-arr-its-ceo-credits-staying-in-europe-for-its-success/</link>
      <pubDate>Wed, 19 Nov 2025 12:09:50 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069109</guid>
      <description>Lovable CEO Anton Osika said he credits ignoring advice to move to Silicon Valley for the AI coding company's success.</description>
    </item>
    <item>
      <title>WIRED&#8217;s Best E-Readers, Tested and Reviewed (2025): Kobo, Kindle, Boox</title>
      <link>https://www.wired.com/gallery/best-ereaders/</link>
      <pubDate>Wed, 19 Nov 2025 12:07:00 +0000</pubDate>
      <guid isPermaLink="false">62b4bf362944b6cfb7625e9a</guid>
      <description>These WIRED-tested ebook readers let you take your library anywhere.</description>
    </item>
    <item>
      <title>Young Mormons Built an App to Help Men Quit Gooning</title>
      <link>https://www.wired.com/story/young-mormons-built-an-app-to-help-men-quit-gooning/</link>
      <pubDate>Wed, 19 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">691239a7d4140dc8948164bc</guid>
      <description>The Relay app allows users to track their porn-free streaks and get group support. Its creators say they&#8217;re taking a stand against porn and AI erotica.</description>
    </item>
    <item>
      <title>This startup&#8217;s plant-inspired tech keeps hundreds of millions of plastic particles out of the ocean</title>
      <link>https://www.fastcompany.com/91444290/this-startups-plant-inspired-tech-keeps-hundreds-of-millions-of-plastic-particles-out-of-the-ocean</link>
      <pubDate>2025-11-19T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444290/this-startups-plant-inspired-tech-keeps-hundreds-of-millions-of-plastic-particles-out-of-the-ocean</guid>
      <description>By adding new filters at water treatment plants, PolyGone is removing microplastics from the water system&#8212;and then recycling them.
Tiny fragments of microplastics&#8212;from clothes, car tires, packaging, and other sources&#8212;slip through most water filters. But at a water treatment plant on the coast in Atlantic City, New Jersey, where plastic-filled wastewater would normally flow into the ocean, new technology has captured hundreds of millions of microplastic particles over the past year....</description>
    </item>
    <item>
      <title>Bo&#238;te de r&#233;ception | Algorithme Facebook, courriel pirat&#233; et t&#233;l&#233;phone cibl&#233;</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-11-19/boite-de-reception/algorithme-facebook-courriel-pirate-et-telephone-cible.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 19 Nov 2025 07:00:00 -0500</pubDate>
      <guid isPermaLink="false">d10770766ba3345db92d0f02a8e37ddc</guid>
      <description>Chaque mercredi, notre journaliste r&#233;pond &#224; vos questions en lien avec le num&#233;rique et les nouvelles technologies. Cette semaine, on retrouve vos amis sur Facebook, on d&#233;joue les pirates du courriel et on bloque les appels non d&#233;sir&#233;s.</description>
    </item>
    <item>
      <title>60+ early Black Friday deals: Score big savings on MacBooks, Nintendo Switch 2, Keurig, and Garmin</title>
      <link>https://mashable.com/article/best-early-black-friday-deals-2025</link>
      <pubDate>Wed, 19 Nov 2025 11:54:29 +0000</pubDate>
      <guid isPermaLink="false">02qcRU5kEQhykGdtbnTdwiW</guid>
      <description>We found the latest early Black Friday deals on Apple products, robot vacuums, headphones, power stations, Legos, and tons more goodies.</description>
    </item>
    <item>
      <title>The Echo Pop speaker is my favourite smart home gadget, and it's better than half price in Amazon's early Black Friday sales</title>
      <link>https://www.techradar.com/seasonal-sales/the-echo-pop-speaker-is-my-favourite-smart-home-gadget-and-its-better-than-half-price-in-amazons-early-black-friday-sales</link>
      <pubDate>Wed, 19 Nov 2025 11:53:02 +0000</pubDate>
      <guid isPermaLink="false">6jhqFpg4JKHRWvZFC6vSd7</guid>
      <description>The small but mighty Echo Pop speaker is over 50% off in Amazon's early Black Friday sales, and it's not one to skip.</description>
    </item>
    <item>
      <title>Le Black Friday n&#8217;&#233;pargne pas la Nintendo Switch 2 ! Voici les meilleures promotions sur les consoles, jeux, manettes et accessoires</title>
      <link>https://www.frandroid.com/bons-plans/2853043_meme-la-nintendo-switch-2-nechappe-pas-au-black-friday-voici-les-12-meilleurs-deals-sur-les-consoles-manettes-et-accessoires</link>
      <pubDate>Wed, 19 Nov 2025 11:51:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2853043_meme-la-nintendo-switch-2-nechappe-pas-au-black-friday-voici-les-12-meilleurs-deals-sur-les-consoles-manettes-et-accessoires</guid>
      <description>
L'ann&#233;e 2025 a &#233;t&#233; on ne peut plus riche pour le jeu vid&#233;o. Outre la sortie de nouveaux titres, la Nintendo Switch 2 a la part belle depuis plusieurs mois. D'autant plus qu'elle fait partie des meilleures offres dans cette s&#233;lection du pr&#233;-Black Friday, en pack avec Mario Kart World ou avec des accessoires suppl&#233;mentaires.
</description>
    </item>
    <item>
      <title>Amazon has knocked $600 off the Samsung 75-Inch Neo QLED 4K QN80F TV ahead of Black Friday</title>
      <link>https://mashable.com/article/nov-19-samsung-tv-deal</link>
      <pubDate>Wed, 19 Nov 2025 11:45:56 +0000</pubDate>
      <guid isPermaLink="false">07BVUeElnqn6hGDWtna4eqv</guid>
      <description>As of Nov. 19, the Samsung 75-Inch Neo QLED 4K QN80F TV has been discounted to $1,497.99 at Amazon ahead of Black Friday. This is 29% off its list price and its lowest-ever price.</description>
    </item>
  </channel>
</rss>
