<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 11 Dec 2025 17:29:52 GMT</lastBuildDate>
    <item>
      <title>Sorry, Smart Glasses Will Not Save You From Your Phone</title>
      <link>https://gizmodo.com/sorry-smart-glasses-will-not-save-you-from-your-phone-2000698420</link>
      <pubDate>Thu, 11 Dec 2025 17:20:35 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000698420</guid>
      <description>Say "distraction-free" one more time, I dare you.</description>
    </item>
    <item>
      <title>Rivian goes big on autonomy, with custom silicon, lidar, and a hint at robotaxis</title>
      <link>https://techcrunch.com/2025/12/11/rivian-goes-big-on-autonomy-with-custom-silicon-lidar-and-a-hint-at-robotaxis/</link>
      <pubDate>Thu, 11 Dec 2025 17:20:10 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3075170</guid>
      <description>CEO RJ Scaringe laid out his plan for how Rivian's vehicles will increasingly drive themselves, in a bid to match or exceed the capabilities of rival automakers and AV companies.</description>
    </item>
    <item>
      <title>Rivian goes all in on 'universal hands-free' driving at its first Autonomy and AI day</title>
      <link>https://www.engadget.com/transportation/evs/rivian-goes-all-in-on-universal-hands-free-driving-at-its-first-autonomy-and-ai-day-172004733.html?src=rss</link>
      <pubDate>Thu, 11 Dec 2025 17:20:04 +0000</pubDate>
      <guid isPermaLink="false">94590970-c2fc-4f70-aefd-2f4732696276</guid>
      <description>EV automaker Rivian just held its inaugural Autonomy and AI day which, unsurprisingly, focused extensively on hands-free driving. An upcoming software update promises the introduction of "universal hands-free" driving. The company says its vehicles will be able to autonomously navigate more than 3.5 million miles of roads in North America, "covering the vast majority of marked roads in the US."
This is coming to the R2 line of EVs, but also Gen 2 R1 vehicles like the recently-released Rivian R1S. The service will be locked behind a subscription for something called Autonomy+ that includes self...</description>
    </item>
    <item>
      <title>Rivian is building its own powerful AI chips for autonomous driving</title>
      <link>https://www.theverge.com/news/842213/rivian-ai-autonomous-chip-specs</link>
      <pubDate>2025-12-11T12:20:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=842213</guid>
      <description>Rivian announced that it was designing its own AI chips for fully autonomous driving, in a bold - if belated - move to catch up with Tesla and other automakers that have working on the technology for far longer. At an "AI and Autonomy" event at the company's office in Silicon Valley on Thursday, Rivian [&#8230;]</description>
    </item>
    <item>
      <title>Switzerland will revise proposed law change after backlash from tech industry</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/switzerland-will-revise-proposed-law-change-after-backlash-from-tech-industry</link>
      <pubDate>Thu, 11 Dec 2025 17:17:36 +0000</pubDate>
      <guid isPermaLink="false">Ceqv8baMYTvPzkQJLFEm9h</guid>
      <description>The Swiss tech industry joined forces and managed to make the government reconsider the amendment to widen surveillance obligations. Yet, the fight for privacy isn't over.</description>
    </item>
    <item>
      <title>Int&#233;gration de personnages &#224; Sora | Disney investit 1&#160;milliard&#8239;US dans OpenAI</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-12-11/integration-de-personnages-a-sora/disney-investit-1-milliard-us-dans-openai.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Thu, 11 Dec 2025 12:13:55 -0500</pubDate>
      <guid isPermaLink="false">58000122a36e3f0c90c7fc4609db297e</guid>
      <description>Disney investit 1&#160;milliard&#8239;US dans OpenAI et int&#233;grera des personnages tels que Mickey Mouse, Cendrillon et Luke Skywalker &#224; Sora, l&#8217;outil de g&#233;n&#233;ration vid&#233;o de la soci&#233;t&#233; d&#8217;intelligence artificielle (IA), dans le cadre d&#8217;un accord de licence annonc&#233; jeudi par les deux entreprises.</description>
    </item>
    <item>
      <title>Disney and OpenAI are set to open the vault to Sora &#8212; yet an AI Mickey feels like magic lost</title>
      <link>https://www.techradar.com/ai-platforms-assistants/disney-and-openai-are-set-to-open-the-vault-to-sora-yet-an-ai-mickey-feels-like-magic-lost</link>
      <pubDate>Thu, 11 Dec 2025 17:12:56 +0000</pubDate>
      <guid isPermaLink="false">AroKBrDKz5j9xcE3zUBpMC</guid>
      <description>Some imagination, huh?</description>
    </item>
    <item>
      <title>The AirPods Pro 3 just dropped below $200 for the first time</title>
      <link>https://www.theverge.com/gadgets/842551/apple-airpods-pro-3-wireless-earbuds-deal-sale-2025</link>
      <pubDate>2025-12-11T12:10:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=842551</guid>
      <description>Apple&#8217;s latest gadgets have gotten some notable discounts lately &#8212; including the recently released Apple Watch Series 11, which is still on sale for $100 off at Amazon. Now, we&#8217;re seeing the AirPods Pro 3 drop down to their lowest price to date, with the noise-canceling earbuds going for just $199 ($50 off) at Amazon [&#8230;]</description>
    </item>
    <item>
      <title>Supergirl&#8217;s first trailer introduces the Woman of Tomorrow</title>
      <link>https://www.theverge.com/entertainment/842392/supergirl-trailer-warner-bros-dc-studios-james-gunn-release-date</link>
      <pubDate>2025-12-11T12:05:29-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=842392</guid>
      <description>The first trailer for DC Studios' Supergirl feature is finally here to give us a look at what the Woman of Tomorrow is made of. Though Superman's (technically) older cousin Kara Zor-El (Millie Alcock) was kind of a mess when we first met her, she's trying to pull it together in Supergirl's new trailer. The [&#8230;]</description>
    </item>
    <item>
      <title>Nvidia develops new software to help track chips following smuggling discovery</title>
      <link>https://www.techradar.com/pro/nvidia-develops-new-software-to-help-track-chips-following-smuggling-discovery</link>
      <pubDate>Thu, 11 Dec 2025 17:05:00 +0000</pubDate>
      <guid isPermaLink="false">L2A83CMwZU8Piy9nJpG46f</guid>
      <description>Nvidia has open-sourced new GPU monitoring software, but it's not for geolocation.</description>
    </item>
    <item>
      <title>Netflix-Warner-Paramount : vous n&#8217;avez rien suivi ? Voici notre foire aux questions sur le deal qui chamboule le cin&#233;ma et la SVoD</title>
      <link>https://www.frandroid.com/services/svod/2901563_netflix-warner-vous-navez-rien-suivi-voici-notre-foire-aux-questions-sur-le-deal-qui-chamboule-le-cinema-et-la-svod</link>
      <pubDate>Thu, 11 Dec 2025 17:03:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2901563_netflix-warner-vous-navez-rien-suivi-voici-notre-foire-aux-questions-sur-le-deal-qui-chamboule-le-cinema-et-la-svod</guid>
      <description>
S'il y a des personnes qui ont pass&#233; la derni&#232;re semaine sous un rocher, ou qui se sont simplement coup&#233;es de l'actualit&#233;, sachez que Netflix a annonc&#233; l'acquisition de Warner Bros. Cette fusion de deux titans de l'audiovisuel pose beaucoup de questions auxquelles nous apportons les r&#233;ponses ici.
</description>
    </item>
    <item>
      <title>Disney accuses Google of &#8216;massive&#8217; copyright infringement following deal with OpenAI</title>
      <link>https://www.theverge.com/news/842573/disney-google-copyright-infringement-cease-and-desist</link>
      <pubDate>2025-12-11T12:02:06-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=842573</guid>
      <description>Disney has accused Google of engaging in copyright infringement on a "massive scale," claiming its AI models have generated content resembling characters from Frozen, Deadpool, Star Wars, and others, according to reports from Variety and Deadline. In a cease-and-desist letter sent on Wednesday, Disney demands that Google stop allegedly infringing on its copyrighted works. Disney [&#8230;]...</description>
    </item>
    <item>
      <title>WhatsApp is trying to reinvent voicemail</title>
      <link>https://www.theverge.com/news/842485/whatsapp-voice-mail-video-message-call-feature</link>
      <pubDate>2025-12-11T12:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=842485</guid>
      <description>WhatsApp says it's making "voicemails a thing of the past" by introducing a new feature that pretty much works like voicemail. Missed call messages are rolling out as part of WhatsApp's latest feature drop, which makes it easier for you to leave voice or video notes in chats after you've called someone who doesn't answer [&#8230;]</description>
    </item>
    <item>
      <title>Runway releases its first world model, adds native audio to latest video model</title>
      <link>https://techcrunch.com/2025/12/11/runway-releases-its-first-world-model-adds-native-audio-to-latest-video-model/</link>
      <pubDate>Thu, 11 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3075161</guid>
      <description>Runway debuts a physics-aware world model that simulates reality to train agents and power video, robotics and avatar applications.</description>
    </item>
    <item>
      <title>Goodbye June review: New Netflix movie is a near flawless directorial debut for Kate Winslet &#8212; but you&#8217;ll cry your eyes out</title>
      <link>https://www.techradar.com/streaming/netflix/goodbye-june-review</link>
      <pubDate>Thu, 11 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">kxPSo4W5rpzLJeQ2P67LAC</guid>
      <description>Did I have Helen Mirren being fictionally killed off on my Christmas bingo card? No &#8211; but I'm so glad she agreed to star in new Netflix movie Goodbye June.</description>
    </item>
    <item>
      <title>Voici le meilleur vid&#233;oprojecteur ultra courte focale de l&#8217;ann&#233;e &#8211; Frandroid Awards 2025</title>
      <link>https://www.frandroid.com/produits-android/2897781_voici-le-meilleur-videoprojecteur-ultra-courte-focale-de-lannee-frandroid-awards-2025</link>
      <pubDate>Thu, 11 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2897781_voici-le-meilleur-videoprojecteur-ultra-courte-focale-de-lannee-frandroid-awards-2025</guid>
      <description>
Le meilleur vid&#233;oprojecteur &#224; ultra courte focale test&#233; par Frandroid est le Hisense PX3-Pro. D&#233;couvrez pourquoi ce produit a re&#231;u le Frandroid Awards avec Delos de sa cat&#233;gorie.
</description>
    </item>
    <item>
      <title>The First Trailer for &#8216;Supergirl&#8217; Welcomes Superman&#8217;s Mighty Mess of a Cousin</title>
      <link>https://gizmodo.com/the-first-trailer-for-supergirl-welcomes-supermans-mighty-mess-of-a-cousin-2000696001</link>
      <pubDate>Thu, 11 Dec 2025 16:59:36 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000696001</guid>
      <description>Milly Alcock goes punk rock as Kara Zor-El in the next DC Studios movie.</description>
    </item>
    <item>
      <title>Boulies OP180 office chair review: Surprisingly comfortable and built for the workplace</title>
      <link>https://www.techradar.com/pro/boulies-op180-office-chair-review</link>
      <pubDate>Thu, 11 Dec 2025 16:55:57 +0000</pubDate>
      <guid isPermaLink="false">xnrgBfjx9GPk4S8fnNnrbM</guid>
      <description>The OP180 sits neatly in Boulies' Office Professional line-up ideal for office spaces with multiple users.</description>
    </item>
    <item>
      <title>Chantage sur Android&#160;: ce nouveau virus peut effacer toutes vos donn&#233;es et exiger une ran&#231;on</title>
      <link>https://www.01net.com/actualites/chantage-android-nouveau-virus-peut-effacer-toutes-donnees-exiger-rancon.html</link>
      <pubDate>Thu, 11 Dec 2025 16:54:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315083</guid>
      <description>Un nouveau malware cherche &#224; ran&#231;onner les utilisateurs d'un smartphone Android. Cach&#233; dans de fausses applications, le virus menace en effet d'effacer toutes les donn&#233;es enregistr&#233;es sur le t&#233;l&#233;phone.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs TV Samsung en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-tv/1173005_quelle-est-la-meilleure-tv-samsung-a-acheter</link>
      <pubDate>Thu, 11 Dec 2025 16:51:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-tv/1173005_quelle-est-la-meilleure-tv-samsung-a-acheter</guid>
      <description>
Sur le march&#233; des t&#233;l&#233;viseurs, Samsung est un acteur majeur au sein d'une concurrence bien install&#233;e. D&#233;couvrez notre s&#233;lection des meilleurs TV Samsung cette ann&#233;e.
</description>
    </item>
    <item>
      <title>The Amazon Is Morphing Into a &#8216;Hypertropical&#8217; Climate&#8212;and It&#8217;s as Apocalyptic as It Sounds</title>
      <link>https://gizmodo.com/the-amazon-is-morphing-into-a-hypertropical-climate-and-its-as-apocalyptic-as-it-sounds-2000698491</link>
      <pubDate>Thu, 11 Dec 2025 16:50:23 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000698491</guid>
      <description>A new study predicts that by 2100, the Amazon rainforest could experience up to 150 days of hot drought conditions each year, causing mass tree die-offs.</description>
    </item>
    <item>
      <title>The Disney-OpenAI Deal Redefines the AI Copyright War</title>
      <link>https://www.wired.com/story/disney-and-openais-deal-is-a-major-turning-point/</link>
      <pubDate>Thu, 11 Dec 2025 16:49:37 +0000</pubDate>
      <guid isPermaLink="false">693aebfb97f8ad30748d1249</guid>
      <description>Disney is hedging against the future. OpenAI is clearing a path for Sora. And together they&#8217;ve made a blueprint for how AI and Hollywood can move forward.</description>
    </item>
    <item>
      <title>Les capteurs photo du Galaxy S26 pourraient en d&#233;cevoir plus d&#8217;un, voici pourquoi</title>
      <link>https://www.frandroid.com/marques/samsung/2906741_les-capteurs-photo-du-galaxy-s26-pourraient-en-decevoir-plus-dun-voici-pourquoi</link>
      <pubDate>Thu, 11 Dec 2025 16:46:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2906741_les-capteurs-photo-du-galaxy-s26-pourraient-en-decevoir-plus-dun-voici-pourquoi</guid>
      <description>
D'apr&#232;s une source bien inform&#233;e, Samsung aurait pris une d&#233;cision &#233;tonnante pour les capteurs photo du futur Galaxy S26 standard.
</description>
    </item>
    <item>
      <title>Amazon just slashed the Bose QuietComfort Earbuds to a record-low price - now $129</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/amazon-just-slashed-the-bose-quietcomfort-earbuds-to-a-record-low-price-now-usd129</link>
      <pubDate>Thu, 11 Dec 2025 16:40:00 +0000</pubDate>
      <guid isPermaLink="false">5JJRZHohtbi8rNA7Vfwqsf</guid>
      <description>The Bose QuietComfort Earbuds are an excellent pair of budget-friendly noise-cancelling buds, and you can now get them for a record-low price on Amazon.</description>
    </item>
    <item>
      <title>Sonos Ace : le meilleur casque audio de 2024 est presque &#224; moiti&#233; prix gr&#226;ce &#224; cette offre de No&#235;l</title>
      <link>https://www.frandroid.com/bons-plans/2880295_sonos-ace-le-meilleur-casque-audio-de-2024-est-presque-a-moitie-prix-grace-a-cette-offre-de-noel</link>
      <pubDate>Thu, 11 Dec 2025 16:39:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2880295_sonos-ace-le-meilleur-casque-audio-de-2024-est-presque-a-moitie-prix-grace-a-cette-offre-de-noel</guid>
      <description>
Pour sa premi&#232;re incursion dans le monde des casques audio Bluetooth, Sonos a frapp&#233; fort avec son Ace hyper abouti, &#233;quilibr&#233; et bourr&#233; de technologies. Celui qu'on a qualifi&#233; de meilleur mod&#232;le l'an dernier est affich&#233; &#224; 270 euros au lieu de 499 euros &#224; son lancement.  
</description>
    </item>
    <item>
      <title>Disney has accused Google of copyright infringement on a 'massive scale'</title>
      <link>https://www.engadget.com/ai/disney-has-accused-google-of-copyright-infringement-on-a-massive-scale-163737642.html?src=rss</link>
      <pubDate>Thu, 11 Dec 2025 16:37:37 +0000</pubDate>
      <guid isPermaLink="false">c0137d09-1211-498e-a9f8-b853b5fbbc4f</guid>
      <description>Disney has accused Google of copyright infringement on a "massive scale," alleging that the tech giant is training its AI tools on protected materials as well as allowing those tools to generate infringing images and videos. Variety reports that Disney attorneys sent a cease-and-desist letter to Google on Wednesday.
&#8220;Google is infringing Disney&#8217;s copyrights on a massive scale, by copying a large corpus of Disney&#8217;s copyrighted works without authorization to train and develop generative artificial intelligence (&#8216;AI&#8217;) models and services, and by using AI models and services to commercially exploi...</description>
    </item>
    <item>
      <title>Test de la MSI Claw A8 BZ2EM : l&#8217;alternative grand &#233;cran &#224; la Xbox Ally X</title>
      <link>https://www.frandroid.com/marques/msi/2892497_test-de-la-msi-claw-a8-bz2em-lalternative-grand-ecran-a-la-xbox-ally-x</link>
      <pubDate>Thu, 11 Dec 2025 16:34:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/msi/2892497_test-de-la-msi-claw-a8-bz2em-lalternative-grand-ecran-a-la-xbox-ally-x</guid>
      <description>
MSI tente le salto en int&#233;grant pour la premi&#232;re fois une puce AMD &#224; ses PC consoles portables. Voici la MSI Claw A8 BZ2EM, qui ne compte plus sur Intel pour soutenir ses jeux.
</description>
    </item>
    <item>
      <title>Mullvad retires OpenVPN support on desktop, pushing all users to WireGuard</title>
      <link>https://www.techradar.com/vpn/vpn-services/mullvad-retires-openvpn-support-on-desktop-pushing-all-users-to-wireguard</link>
      <pubDate>Thu, 11 Dec 2025 16:31:10 +0000</pubDate>
      <guid isPermaLink="false">9mVF5TZfuGKL2WeWvCXVVZ</guid>
      <description>Mullvad has removed OpenVPN support from its desktop app, accelerating its shift to WireGuard as users prepare for the full OpenVPN shutdown in 2026.</description>
    </item>
    <item>
      <title>Relax, grown-ups: VR is doing fine</title>
      <link>https://www.theverge.com/column/842359/vr-teens-gaming</link>
      <pubDate>2025-12-11T11:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=842359</guid>
      <description>This is Lowpass by Janko Roettgers, a newsletter on the ever-evolving intersection of tech and entertainment, syndicated just for The Verge subscribers once a week. When news broke last week that Meta may cut the budget of its Meta Reality Labs unit by as much as 30 percent, followed by reports that the company is [&#8230;]</description>
    </item>
    <item>
      <title>Lawsuit claims ChatGPT put a &#8216;target&#8217; on murdered woman</title>
      <link>https://www.theverge.com/news/842494/openai-chatgpt-wrongful-death-suzanne-adams-delusions</link>
      <pubDate>2025-12-11T11:29:05-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=842494</guid>
      <description>OpenAI is facing a wrongful death lawsuit after a 56-year-old man killed his mother and took his own life after delusion-filled conversations with ChatGPT. The lawsuit, filed in a California court on Thursday, accuses ChatGPT of putting a "target" on the back of 83-year-old Suzanne Adams, who was killed at her Connecticut home in August. [&#8230;]</description>
    </item>
    <item>
      <title>AI is killing review sites. Can they fight back?</title>
      <link>https://www.fastcompany.com/91455594/ai-killing-review-sites-can-they-fight-back</link>
      <pubDate>2025-12-11T16:28:53</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91455594/ai-killing-review-sites-can-they-fight-back</guid>
      <description>With AI replacing traditional search, review sites must evolve fast&#8212;or risk being cut out of the buying journey.
AI is becoming a big part of online commerce. Referral traffic to retailers on Black Friday from AI chatbots and search engines jumped 800% over the same period last year, according to Adobe, meaning a lot more people are now using AI to help them with buying decisions. But where does that leave review sites who, in years past, would have been the guide for many of those purchases?...</description>
    </item>
    <item>
      <title>#FrandroidOffreMoi un super pack gaming sign&#233; Razer (casque, souris, tapis)</title>
      <link>https://www.frandroid.com/marques/razer/2906275_frandroidoffremoi-un-super-pack-gaming-signe-razer-casque-souris-tapis</link>
      <pubDate>Thu, 11 Dec 2025 16:26:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/razer/2906275_frandroidoffremoi-un-super-pack-gaming-signe-razer-casque-souris-tapis</guid>
      <description>
C'est le jour 11 du calendrier de l'Avent de Frandroid et on vous fait gagner un trio de produits ax&#233;s esport et sign&#233;s Razer (casque, souris et tapis).
</description>
    </item>
    <item>
      <title>Amazon just dropped the AirPods Pro 3 to their best price ever</title>
      <link>https://mashable.com/article/dec-11-apple-airpods-pro-3-deal</link>
      <pubDate>Thu, 11 Dec 2025 16:23:46 +0000</pubDate>
      <guid isPermaLink="false">03zzDDruh9UgLT6hnF22r4v</guid>
      <description>The Apple AirPods Pro 3 are now down to their best price ever at Amazon: just $199. That beats their Black Friday price.</description>
    </item>
    <item>
      <title>Elon Musk destroyed Twitter &#8212; now Operation Bluebird has revealed a shock plan to bring it back in 2026</title>
      <link>https://www.techradar.com/computing/social-media/elon-musk-destroyed-twitter-now-operation-bluebird-has-revealed-a-shock-plan-to-bring-it-back-in-2026</link>
      <pubDate>Thu, 11 Dec 2025 16:21:37 +0000</pubDate>
      <guid isPermaLink="false">JpqhkTzmYLe5FEhyC7tWDj</guid>
      <description>Operation Bluebird is filing to take back the Twitter brand and 'tweet,' but I wonder if this is a quixotic adventure.</description>
    </item>
    <item>
      <title>State AGs warn Google, Meta, and OpenAI that their chatbots could be breaking the law</title>
      <link>https://www.theverge.com/news/842512/google-meta-openai-state-attorneys-general-ai-letter</link>
      <pubDate>2025-12-11T11:21:17-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=842512</guid>
      <description>State attorneys general from across the US are demanding more accountability from AI companies, warning them that their chatbots may be violating state laws. As reported by Reuters, the AGs have given Meta, Google, OpenAI, and others a deadline of January 16th, 2026 to respond to demands for more safety measures for generative AI, saying [&#8230;]</description>
    </item>
    <item>
      <title>Are you a startup looking to build your website? Webflow is offering a crazy deal- get 100% off your first full year of a CMS site plan</title>
      <link>https://www.techradar.com/pro/website-building/are-you-a-startup-looking-to-build-your-website-webflow-is-offering-a-crazy-deal-get-100-percent-off-your-first-full-year-of-a-cms-site-plan</link>
      <pubDate>Thu, 11 Dec 2025 16:21:03 +0000</pubDate>
      <guid isPermaLink="false">mhKVDf8hXMhu6YvXtWqyVb</guid>
      <description>This is a great end-of-the-year opportunity for any startup company.</description>
    </item>
    <item>
      <title>Game Awards 2025 : comment et &#224; quelle heure suivre la c&#233;r&#233;monie du jeu vid&#233;o en direct ?</title>
      <link>https://www.frandroid.com/services/jeux-video/2904367_game-awards-2025-comment-et-a-quelle-heure-suivre-la-ceremonie-videoludique-en-direct</link>
      <pubDate>Thu, 11 Dec 2025 16:20:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/jeux-video/2904367_game-awards-2025-comment-et-a-quelle-heure-suivre-la-ceremonie-videoludique-en-direct</guid>
      <description>
Encore quelques heures avant la c&#233;r&#233;monie des Game Awards 2025, les Oscars du jeu vid&#233;o. Un &#233;v&#233;nement autant attendu par les gamers que la presse sp&#233;cialis&#233;e, si bien que la c&#233;r&#233;monie sera diffus&#233;e pour la premi&#232;re fois sur une plateforme de streaming.
</description>
    </item>
    <item>
      <title>The Kalshi-fication of everything</title>
      <link>https://www.fastcompany.com/91457404/kalshi-betting-gambling-polymarket</link>
      <pubDate>2025-12-11T16:19:38</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91457404/kalshi-betting-gambling-polymarket</guid>
      <description>The predictions platform is revealing what a world of total financialization will look like.
For many people, the first time they thought about Kalshi&#8212;a prediction market where you can place bets on the outcomes of sports, politics, culture, weather, and much more&#8212;was after a video clip of its cofounder, Tarek Mansour, went viral last week.&#160;</description>
    </item>
    <item>
      <title>Xiaomi ne fera pas que des voitures &#233;lectriques : un brevet trahit ce changement de strat&#233;gie</title>
      <link>https://www.frandroid.com/marques/xiaomi/2906725_xiaomi-ne-fera-pas-que-des-voitures-electriques-un-brevet-trahit-ce-changement-de-strategie</link>
      <pubDate>Thu, 11 Dec 2025 16:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2906725_xiaomi-ne-fera-pas-que-des-voitures-electriques-un-brevet-trahit-ce-changement-de-strategie</guid>
      <description>
Xiaomi va bel et bien produire et vendes des voitures dot&#233;es d'un moteur thermique. Des hybrides ? Des voitures &#233;lectriques &#224; prolongateur d'autonomie ? C'est bien possible, comme nous le prouve ce nouveau brevet bien utile.
</description>
    </item>
    <item>
      <title>Ford and SK On are ending their U.S. battery joint venture</title>
      <link>https://techcrunch.com/2025/12/11/ford-and-sk-on-are-ending-their-u-s-battery-joint-venture/</link>
      <pubDate>Thu, 11 Dec 2025 16:11:07 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3075158</guid>
      <description>The factories live on; the joint venture will not.</description>
    </item>
    <item>
      <title>A pair of Nintendo Switch 2 Joy-Con 2 controllers are $20 off at BJ&amp;#8217;s</title>
      <link>https://www.theverge.com/gadgets/842386/nintendo-switch-2-joy-con-2-controller-sonos-era-100-refurb-deal-sale</link>
      <pubDate>2025-12-11T11:07:29-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=842386</guid>
      <description>The Nintendo Switch 2 comes with a pair of Joy-Con 2 controllers, but it&#8217;s always good to have a second set around in case more people come over for a few rounds of Mario Kart World. BJ&#8217;s Wholesale Club is offering a set of Joy-Con 2 controllers for $79.99 ($20 off), a new all-time low. [&#8230;]</description>
    </item>
    <item>
      <title>CES 2026 preview: What to expect from tech's biggest conference in January</title>
      <link>https://www.engadget.com/big-tech/ces-2026-preview-what-to-expect-from-techs-biggest-conference-in-january-120000200.html?src=rss</link>
      <pubDate>Thu, 11 Dec 2025 16:06:49 +0000</pubDate>
      <guid isPermaLink="false">2645ab40-20b1-4cf0-bdcf-9e9656c79061</guid>
      <description>CES doesn't start until January, but whispers of the products and announcements that could be in store for tech's biggest annual conference have already started to take shape. The CES 2026 show floor is officially open from January 6 through 9, although the show kicks off with events on Sunday January 4 and a host of press conferences on Monday. As always, product demos, announcements and networking will be happening at the Las Vegas Convention Center and surrounding hotels all over the city. As usual, Engadget will be covering the event in-person and remotely, bringing you news and hands-ons ...</description>
    </item>
    <item>
      <title>Disneys $1 billion deal with OpenAI will bring Disney characters to Sora</title>
      <link>https://mashable.com/article/disney-openai-deal</link>
      <pubDate>Thu, 11 Dec 2025 16:05:46 +0000</pubDate>
      <guid isPermaLink="false">06mkzALQdEUUVzzJAwtFgNu</guid>
      <description>As Hollywood titans and AI companies wrangle over AI copyright issues, Disney has signed a $1 billion deal with OpenAI.</description>
    </item>
    <item>
      <title>Vous avez une Kindle&#160;? Amazon a une bonne nouvelle pour vous</title>
      <link>https://www.01net.com/actualites/vous-avez-kindle-amazon-bonne-nouvelle-pour-vous.html</link>
      <pubDate>Thu, 11 Dec 2025 16:04:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315079</guid>
      <description>Amazon pr&#233;pare un petit changement qui va redonner un peu d&#8217;air aux lecteurs sur Kindle.</description>
    </item>
    <item>
      <title>Denmark is planning on severe social media restrictions for young people. Here&#8217;s how</title>
      <link>https://www.fastcompany.com/91458737/denmark-planning-severe-social-media-restrictions-young-people-heres-how</link>
      <pubDate>2025-12-11T16:02:42</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91458737/denmark-planning-severe-social-media-restrictions-young-people-heres-how</guid>
      <description>The Danish government&#8217;s current plans to restrict access could become law as soon as 2026.  
As Australia began enforcing a world-first social media ban for children under 16 years old this week, Denmark is planning to follow its lead and severely restrict social media access for young people.The Danish government announced last month that it had secured an agreement by three governing coalition and two opposition parties in parliament to ban access to social media for anyone under the age of 15. Such a measure would be the most sweeping step yet by a European Union nation to limit use of soci...</description>
    </item>
    <item>
      <title>The best Christmas gifts to give everyone on your 2025 holiday shopping list</title>
      <link>https://www.engadget.com/the-best-christmas-gifts-to-give-everyone-on-your-2025-holiday-shopping-list-170018456.html?src=rss</link>
      <pubDate>Thu, 11 Dec 2025 16:00:35 +0000</pubDate>
      <guid isPermaLink="false">4160f992-6cb7-4c9c-b2bb-281bf7cf66e1</guid>
      <description>Finding the right gifts for everyone on your list this time of year can be a major source of stress. It can be even more daunting if you&#8217;re trying to stick to a budget all while getting the folks you love things that they will really appreciate. But there&#8217;s also a good chance you&#8217;re getting fed bad gift ideas (and just as bad deals) if you&#8217;re browsing the web frantically searching as we get closer and closer to the holidays.Allow us at Engadget to help you through it. Here, you&#8217;ll find all of our holiday gift guides collected in one place, so you can more easily find the best Christmas gifts y...</description>
    </item>
    <item>
      <title>Snag a pair of Apple AirPods 4 for nearly half off</title>
      <link>https://mashable.com/article/dec-11-apple-airpods-4-deal</link>
      <pubDate>Thu, 11 Dec 2025 16:00:32 +0000</pubDate>
      <guid isPermaLink="false">02EWTStq13xyQwbDdOvzrzD</guid>
      <description>As of Dec. 11, get the Apple AirPods 4 for 43% off at Walmart.</description>
    </item>
    <item>
      <title>Darth Vader&#8217;s Lightsaber Is No Longer the Most Expensive &#8216;Star Wars&#8217; Item Sold at Auction</title>
      <link>https://gizmodo.com/darth-vaders-lightsaber-is-no-longer-the-most-expensive-star-wars-item-sold-at-auction-2000698170</link>
      <pubDate>Thu, 11 Dec 2025 16:00:05 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000698170</guid>
      <description>Tom Jung's original 1977 half-sheet artwork for 'A New Hope' has just become the priciest piece of memorabilia from the galaxy far, far away.</description>
    </item>
    <item>
      <title>Cursor Launches an AI Coding Tool For Designers</title>
      <link>https://www.wired.com/story/cursor-launches-pro-design-tools-figma/</link>
      <pubDate>Thu, 11 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">69376031284ba7699c8efcd1</guid>
      <description>The 300-person startup hopes bringing designers aboard will give it an edge in an increasingly competitive AI software market.</description>
    </item>
    <item>
      <title>33 practical smart home gifts that make everyday life a little easier</title>
      <link>https://www.theverge.com/gadgets/800449/best-practical-smart-home-gift-ideas-2025</link>
      <pubDate>2025-12-11T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=800449</guid>
      <description>Smart home products are all about making everyday life a little easier, which is why they're some of the best and most thoughtful gifts you can give. Some people go all out building a multi-gadget IoT kingdom (like our resident smart home expert, Jen Pattison Tuohy), but a smart home is whatever your recipient wants [&#8230;]</description>
    </item>
    <item>
      <title>Luke Littler vs Darius Labanauskas live streams: How to watch World Darts Championship 2026 tie, preview</title>
      <link>https://www.techradar.com/how-to-watch/sport/luke-littler-vs-darius-labanauskas-world-darts-championship-2026</link>
      <pubDate>Thu, 11 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">6MQKwYzkwZ35QDvmmKmLJY</guid>
      <description>All the ways to watch Luke Littler vs Darius Labanauskas live streams from anywhere, as they open World Darts Championship 2026 at Alexandra Palace.</description>
    </item>
    <item>
      <title>The First Snow of Fraggle Rock is the kid-friendly festive special that Apple TV needs &#8211; and it's got the makings of being a Christmas classic</title>
      <link>https://www.techradar.com/streaming/apple-tv-plus/the-first-snow-of-fraggle-rock-is-the-kid-friendly-festive-special-that-apple-tv-needs-and-its-got-the-makings-of-being-a-christmas-classic</link>
      <pubDate>Thu, 11 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">Ve5QGvdPM3JF3W6yyBqYJV</guid>
      <description>It's the holiday season in Fraggle Rock &#8211; and there's a surprise in store for its adorable inhabitants.</description>
    </item>
    <item>
      <title>How to watch Celtic vs AS Roma: Europa League 2025/26 free stream, TV channels, kick-off time</title>
      <link>https://www.techradar.com/how-to-watch/football/celtic-vs-as-roma-europa-league-2025-26-free</link>
      <pubDate>Thu, 11 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">VRBnTq3MywhxwqKQnK6j4M</guid>
      <description>We'll show you how to watch Celtic vs AS Roma for free from anywhere in the world in this crucial Europa League tie.</description>
    </item>
    <item>
      <title>Kids Watch : voici LE cadeau de No&#235;l malin pour donner plus d&#8217;autonomie &#224; son enfant (sans compromis sur sa s&#233;curit&#233;) [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2904791_kids-watch-voici-le-cadeau-de-noel-malin-pour-donner-plus-dautonomie-a-son-enfant-sans-compromis-sur-sa-securite</link>
      <pubDate>Thu, 11 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2904791_kids-watch-voici-le-cadeau-de-noel-malin-pour-donner-plus-dautonomie-a-son-enfant-sans-compromis-sur-sa-securite</guid>
      <description>
Et si &#224; No&#235;l vous surpreniez votre enfant en d&#233;posant sa premi&#232;re montre connect&#233;e au pied du sapin ? Bouygues Telecom propose la Kids Watch, un mod&#232;le abordable et sp&#233;cialement pens&#233; pour les 9 ans et plus.
</description>
    </item>
    <item>
      <title>His and Hers trailer: Tessa Thompson and Jon Bernthal join forces for murder mystery</title>
      <link>https://mashable.com/video/his-and-hers-trailer-netflix-tessa-thompson-jon-bernthal</link>
      <pubDate>Thu, 11 Dec 2025 15:46:06 +0000</pubDate>
      <guid isPermaLink="false">0366a5DHkgIn9Cz7rW9YoAV</guid>
      <description>Tessa Thompson and Jon Bernthal star in "His &amp; Hers," a limited crime series coming to Netflix January 8.</description>
    </item>
    <item>
      <title>AI Fails to Win Time&#8217;s Person of the Year&#8230; This Time</title>
      <link>https://gizmodo.com/ai-fails-to-win-times-person-of-the-year-this-time-2000698441</link>
      <pubDate>Thu, 11 Dec 2025 15:45:50 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000698441</guid>
      <description>Sorry to the Polymarket bettors.</description>
    </item>
    <item>
      <title>The Magic: The Gathering Spider-Man Play Booster Box has hit a new record-low price &#8212; save over $90 at Amazon</title>
      <link>https://mashable.com/article/dec-11-magic-the-gathering-spider-man-play-booster-box-deal</link>
      <pubDate>Thu, 11 Dec 2025 15:43:08 +0000</pubDate>
      <guid isPermaLink="false">05XRLf8MPH3XbD4mp0IQYLX</guid>
      <description>The Magic: The Gathering Marvel's Spider-Man Play Booster Box is on sale for $113.95 on Amazon. That's the lowest-ever price.</description>
    </item>
    <item>
      <title>&#8216;They gave us the iPhone camera&#8217;: F1 producer Jerry Bruckheimer on Apple&#8217;s &#8216;phenomenal&#8217; involvement in the movie&#8217;s production</title>
      <link>https://www.techradar.com/streaming/they-gave-us-the-iphone-camera-f1-producer-jerry-bruckheimer-on-apples-phenomenal-involvement-in-the-movies-production</link>
      <pubDate>Thu, 11 Dec 2025 15:42:32 +0000</pubDate>
      <guid isPermaLink="false">pJYc3QDXoAcuE9G3KtwRuB</guid>
      <description>We spoke with F1 producer Jerry Bruckheimer ahead of the film's streaming release on Apple TV.</description>
    </item>
    <item>
      <title>ICO levies &#163;1.2 million fine against LastPass &#8212; data breach compromised info on 1.6 million users</title>
      <link>https://www.techradar.com/pro/security/ico-levies-gbp1-2-million-fine-against-lastpass-data-breach-compromised-info-on-1-6-million-users</link>
      <pubDate>Thu, 11 Dec 2025 15:41:33 +0000</pubDate>
      <guid isPermaLink="false">rkBTyBPa5ncirwBuQe48wJ</guid>
      <description>After a data breach in 2022, the Information Commissioners Office has finally reached a decision on a &#163;1.2 million fine.</description>
    </item>
    <item>
      <title>One of our favorite budgeting apps is 50 percent off for new users</title>
      <link>https://www.engadget.com/deals/one-of-our-favorite-budgeting-apps-is-50-percent-off-for-new-users-154056449.html?src=rss</link>
      <pubDate>Thu, 11 Dec 2025 15:40:56 +0000</pubDate>
      <guid isPermaLink="false">f9cd69a7-2172-4476-a391-04d87e530174</guid>
      <description>With a new year just around the corner, now is the perfect time to take stock of your finances. A budgeting app can help with that, and right now you can get 50 percent off your first year of a Monarch Money plan. All you need to do is enter the code MONARCHVIP at checkout and you&#8217;ll pay $50 for the initial 12 months instead of the regular price of $100. Note that the offer only applies to new users.


Monarch Money was the runner-up in our guide to the best budgeting apps in 2025, and it was definitely a grower. Initially we found the experience of using the app to be needlessly complicated c...</description>
    </item>
    <item>
      <title>The 10 best last-minute Christmas gifts for the 2025 holiday season</title>
      <link>https://www.engadget.com/the-10-best-last-minute-christmas-gifts-for-the-2025-holiday-season-140037254.html?src=rss</link>
      <pubDate>Thu, 11 Dec 2025 15:40:17 +0000</pubDate>
      <guid isPermaLink="false">f10f3474-8a9f-4844-b943-494ef9bdc916</guid>
      <description>We&#8217;re almost out of time &#8212; the holidays are just about here, and if you&#8217;re still doing your holiday shopping, you&#8217;re not alone. Between wrapping things up at work before some well-deserved time off and making sure you have everything you need to host family and friends, it can be hard to find the time to go shop for some gifts. And if you&#8217;re going to physical stores right now, you&#8217;re probably being met with half-empty shelves. But the internet remains an option, even this late in the game: you still have time to buy holiday gifts online.USPS, UPS and FedEx have laid out their holiday shipping ...</description>
    </item>
    <item>
      <title>Disney vend son &#226;me &#224; OpenAI. Le prix&#160;? 1 milliard de dollars&#160;!</title>
      <link>https://www.01net.com/actualites/disney-ouvre-ses-coffres-a-jouets-a-openai-et-degaine-ses-avocats-contre-google.html</link>
      <pubDate>Thu, 11 Dec 2025 15:38:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315095</guid>
      <description>Le groupe Disney pr&#234;te ses jouets &#224; OpenAI. Le g&#233;ant du divertissement autorise Sora et ChatGPT &#224; exploiter les personnages de ses univers pour g&#233;n&#233;rer des vid&#233;os et des images. L&#8217;accord inclut un investissement massif de Disney dans la start-up IA. Mais pendant qu&#8217;il ouvre grand la porte &#224; OpenAI, Disney en referme une autre avec fracas : le groupe accuse Google d&#8217;enfreindre massivement ses droits d&#8217;auteur et lui a adress&#233; une mise en demeure....</description>
    </item>
    <item>
      <title>A Nintendo Switch 2 Price Hike Is Almost Certainly Coming Soon</title>
      <link>https://gizmodo.com/nintendo-switch-2-price-hike-is-almost-certainly-coming-soon-2000698414</link>
      <pubDate>Thu, 11 Dec 2025 15:38:39 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000698414</guid>
      <description>You can once again blame AI, this time for gaming getting more expensive.</description>
    </item>
    <item>
      <title>The 34-inch LG UltraGear curved gaming monitor is cheaper than it was on Black Friday</title>
      <link>https://mashable.com/article/dec-11-lg-ultragear-curved-gaming-monitor-deal</link>
      <pubDate>Thu, 11 Dec 2025 15:36:50 +0000</pubDate>
      <guid isPermaLink="false">03Sz6kaX1Q8mjedYG87RrWV</guid>
      <description>The LG 34-inch UltraGear curved gaming monitor is on sale at Amazon for $356.99, down nearly 30% from its usual list price.</description>
    </item>
    <item>
      <title>Masterpieces from  billionaire Koch brother&#8217;s collection headed to auction at Christie&#8217;s</title>
      <link>https://www.fastcompany.com/91458735/masterpieces-billionaire-koch-brothers-collection-headed-auction-christies</link>
      <pubDate>2025-12-11T15:36:09</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91458735/masterpieces-billionaire-koch-brothers-collection-headed-auction-christies</guid>
      <description>The &#8216;Visions of the West&#8217; sale will take place in New York over two sessions beginning January 20.
Some of the most recognizable artwork depicting the American West is heading to auction at Christie&#8217;s, where dozens of pieces from billionaire Bill Koch&#8217;s collection are expected to fetch at least $50 million.The in-person &#8220;Visions of the West&#8221; sale will take place in New York over two sessions beginning Jan. 20, with the final lots offered &#8212; appropriately &#8212; at high noon the following day. Koch&#8217;s holdings include major works by Frederic Remington, Charles Marion Russell and Albert Bierstadt, arti...</description>
    </item>
    <item>
      <title>No Need to Buy Earbuds or Speakers, Denon Offers a Subscription for Its Gadgets and Is Waiving Activation Fees for Limited Holiday Deals</title>
      <link>https://gizmodo.com/no-need-to-buy-earbuds-or-speakers-denon-offers-a-subscription-for-its-gadgets-and-is-waiving-activation-fees-for-limited-holiday-deals-2000697735</link>
      <pubDate>Thu, 11 Dec 2025 15:32:38 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000697735</guid>
      <description>Enjoy bold, rich, and premium sound without blowing your budget.</description>
    </item>
    <item>
      <title>Take your music seriously with Sonys XM6 headphones for their lowest price yet</title>
      <link>https://mashable.com/article/dec-11-sony-wh-1000xm6-headphones-deal</link>
      <pubDate>Thu, 11 Dec 2025 15:31:52 +0000</pubDate>
      <guid isPermaLink="false">00Nndrc5oOAXeu7xDbPuZgS</guid>
      <description>As of Dec. 11, get the Sony WH-1000XM6 headphones for their lowest price yet.</description>
    </item>
    <item>
      <title>&#171; Violation massive &#187; : Disney d&#233;clare la guerre &#224; Google et exige la correction imm&#233;diate de Gemini</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2906857_violation-massive-disney-declare-la-guerre-a-google-et-exige-larret-immediat-de-son-ia</link>
      <pubDate>Thu, 11 Dec 2025 15:30:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2906857_violation-massive-disney-declare-la-guerre-a-google-et-exige-larret-immediat-de-son-ia</guid>
      <description>
OpenAI et Google sont d&#233;sormais en guerre ouverte, et Disney a choisi son camp. Le g&#233;ant du cin&#233;ma poursuit Google pour violation du droit d'auteur, tout en misant 1 milliard de dollars sur ChatGPT.
</description>
    </item>
  </channel>
</rss>
