<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 25 Feb 2026 14:54:49 GMT</lastBuildDate>
    <item>
      <title>I Want My Remains Kept Inside Spotify and Liquid Death&#8217;s Speaker Urn</title>
      <link>https://gizmodo.com/i-want-my-remains-kept-inside-spotify-and-liquid-deaths-speaker-urn-2000726394</link>
      <pubDate>Wed, 25 Feb 2026 14:45:46 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000726394</guid>
      <description>Dying to get inside this morbid Bluetooth speaker marketing gimmick.</description>
    </item>
    <item>
      <title>D&#233;couvrez les nouveaux Samsung Galaxy S26 en direct sur Twitch d&#232;s 18h30</title>
      <link>https://www.frandroid.com/humanoid/emissions/2990015_decouvrez-les-nouveaux-samsung-galaxy-s26-en-direct-sur-twitch-des-18h30</link>
      <pubDate>Wed, 25 Feb 2026 14:43:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/emissions/2990015_decouvrez-les-nouveaux-samsung-galaxy-s26-en-direct-sur-twitch-des-18h30</guid>
      <description>
La premi&#232;re Samsung Galaxy Unpacked de l&#8217;ann&#233;e a lieu ce mercredi 25 f&#233;vrier 2026, &#224; partir de 19h. Frandroid couvre &#233;videmment cette grande conf&#233;rence o&#249; seront pr&#233;sent&#233;s les nouveaux Galaxy S26. Sans grande surprise, nous serons en direct sur notre cha&#238;ne Twitch Frandroidlive &#224; partir de 18h30.
</description>
    </item>
    <item>
      <title>En attendant les annonces d&#8217;Apple, l&#8217;Apple Watch Series 11 dans son format XXL est &#224; prix cass&#233; sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2925695_en-attendant-les-annonces-dapple-lapple-watch-series-11-dans-son-format-xxl-est-a-prix-casse-sur-amazon</link>
      <pubDate>Wed, 25 Feb 2026 14:39:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2925695_en-attendant-les-annonces-dapple-lapple-watch-series-11-dans-son-format-xxl-est-a-prix-casse-sur-amazon</guid>
      <description>
Rarement en promotion depuis son lancement, l&#8217;Apple Watch Series 11 refait enfin surface &#224; prix r&#233;duit. La montre connect&#233;e haut de gamme d&#8217;Apple s&#8217;affiche aujourd&#8217;hui &#224; 409 euros dans son grand format 46 mm, contre 479 euros habituellement. 
</description>
    </item>
    <item>
      <title>Xiaomi&amp;#8217;s magnetic power bank is incredibly thin</title>
      <link>https://www.theverge.com/tech/884330/xiaomi-ultra-thin-magnetic-magsafe-power-bank-5000-qi2</link>
      <pubDate>2026-02-25T09:39:44-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=884330</guid>
      <description>It was originally teased to be announced at Mobile World Congress 2026 in Barcelona, Spain, this weekend, but Xiaomi has already shared all the details for its new super slim wireless power bank on its Australian website. The Xiaomi UltraThin Magnetic Power Bank 5000 features a 5,000mAh battery, as the name implies, and is just [&#8230;]</description>
    </item>
    <item>
      <title>Discord remet la v&#233;rification d&#8217;&#226;ge &#224; plus tard sur fond de pol&#233;mique</title>
      <link>https://www.frandroid.com/android/applications/2989841_discord-remet-la-verification-dage-a-plus-tard-sur-fond-de-polemique</link>
      <pubDate>Wed, 25 Feb 2026 14:33:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/applications/2989841_discord-remet-la-verification-dage-a-plus-tard-sur-fond-de-polemique</guid>
      <description>
La messagerie Discord recule face aux contestations des utilisateurs concernant le syst&#232;me de v&#233;rification d'&#226;ge.
</description>
    </item>
    <item>
      <title>WhatsApp va (enfin) vous laisser prot&#233;ger votre compte avec un vrai mot de passe</title>
      <link>https://www.frandroid.com/marques/meta/2989833_whatsapp-va-enfin-vous-laisser-proteger-votre-compte-avec-un-vrai-mot-de-passe</link>
      <pubDate>Wed, 25 Feb 2026 14:31:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2989833_whatsapp-va-enfin-vous-laisser-proteger-votre-compte-avec-un-vrai-mot-de-passe</guid>
      <description>
Vous pensiez que s&#233;curiser une application de messagerie avec un vrai mot de passe &#233;tait une &#233;vidence ? Pas pour WhatsApp, qui aura attendu seize longues ann&#233;es avant de s'y mettre. L'application de Meta pr&#233;pare enfin l'int&#233;gration de ce bouclier classique pour contrer les piratages de comptes.
</description>
    </item>
    <item>
      <title>La m&#233;moire p&#232;se d&#233;sormais 35&#160;% du co&#251;t d&#8217;un PC chez HP</title>
      <link>https://www.01net.com/actualites/la-memoire-pese-desormais-35-du-cout-dun-pc-chez-hp.html</link>
      <pubDate>Wed, 25 Feb 2026 14:29:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1328152</guid>
      <description>La m&#233;moire repr&#233;sente une part de plus en plus importante dans la facture des composants des PC vendus par HP. Le constructeur rassure cependant sur son approvisionnement, qui est assur&#233; pour l'ann&#233;e 2026. Mais ensuite ?</description>
    </item>
    <item>
      <title>Bridging the AI-CRM Gap: How mid-market businesses can get ahead in 2026</title>
      <link>https://www.techradar.com/pro/bridging-the-ai-crm-gap-how-mid-market-businesses-can-get-ahead-in-2026</link>
      <pubDate>Wed, 25 Feb 2026 14:28:16 +0000</pubDate>
      <guid isPermaLink="false">ZTEjAqy7omVjtNbwJ38cRV</guid>
      <description>The CEO of Workbooks shares his thoughts on how businesses can get ahead in 2026 with AI/CRM integration.</description>
    </item>
    <item>
      <title>Does Anthropic think Claude is alive? Define &#8216;alive&#8217;</title>
      <link>https://www.theverge.com/report/883769/anthropic-claude-conscious-alive-moral-patient-constitution</link>
      <pubDate>2026-02-25T09:24:30-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=883769</guid>
      <description>Over the past several weeks, as more and more Anthropic executives do interviews on a publicity blitz for Claude, one thing has gotten increasingly clear: Anthropic sure seems to think Claude is alive in some way, shape, or form. "Alive" is obviously a loaded term; the more frequently used word is "conscious." If you ask [&#8230;]</description>
    </item>
    <item>
      <title>CrowdStrike says attackers are moving through networks in under 30 minutes</title>
      <link>https://www.techradar.com/pro/security/crowdstrike-says-attackers-are-moving-through-networks-in-under-30-minutes</link>
      <pubDate>Wed, 25 Feb 2026 14:13:49 +0000</pubDate>
      <guid isPermaLink="false">jtMvXVMAcZsFo6shnqYQz</guid>
      <description>Breakout time is the clearest signal of how intrusion has changed, researchers say, as they see data exfiltration within minutes of initial compromise.</description>
    </item>
    <item>
      <title>Fuite &#224; la CAF&#160;: les donn&#233;es des b&#233;n&#233;ficiaires au RSA ont &#233;t&#233; pirat&#233;es</title>
      <link>https://www.01net.com/actualites/fuite-donnees-caf-informations-beneficiaires-rsa-piratees.html</link>
      <pubDate>Wed, 25 Feb 2026 14:13:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1328138</guid>
      <description>Une nouvelle cyberattaque secoue l'&#201;tat fran&#231;ais. En piratant un service de l'&#201;tat, un cybercriminel est parvenu &#224; voler des informations relatives &#224; la CAF (Caisse d'Allocations Familiales). Les donn&#233;es des b&#233;n&#233;ficiaires au RSA ont &#233;t&#233; compromises, dont le num&#233;ro de s&#233;curit&#233; sociale, le matricule allocataire, et les coordonn&#233;es compl&#232;tes.</description>
    </item>
    <item>
      <title>Apple brings age verification to UK users in iOS 26.4 beta</title>
      <link>https://www.theverge.com/tech/884306/apple-age-verification-uk-users-ios-26-4-beta</link>
      <pubDate>2026-02-25T09:10:58-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=884306</guid>
      <description>Apple is bringing age verification to the UK, as the latest iOS 26.4 beta prompts users to verify that they're over 18 following installation. As shown in screenshots posted to Reddit, Apple says users who don't confirm their age "will not be able to download and purchase apps or make in-app purchases." In one of [&#8230;]</description>
    </item>
    <item>
      <title>'Basically zero' &#8212; top Goldman Sachs economist says AI barely had any positive effect on the US economy in 2025</title>
      <link>https://www.techradar.com/pro/basically-zero-top-goldman-sachs-economist-says-ai-barely-had-any-positive-effect-on-the-us-economy-in-2025</link>
      <pubDate>Wed, 25 Feb 2026 14:10:00 +0000</pubDate>
      <guid isPermaLink="false">ChTQJkRoyFGKjfTDRoJg55</guid>
      <description>Though AI's impact on the US economy might not have been so big, it's certainly set to continue rising globally.</description>
    </item>
    <item>
      <title>Comment suivre le Samsung Unpacked pour d&#233;couvrir en direct les nouveaux smartphones Galaxy</title>
      <link>https://www.frandroid.com/marques/samsung/2989759_comment-suivre-le-samsung-unpacked-pour-decouvrir-en-direct-les-nouveaux-smartphones-galaxy</link>
      <pubDate>Wed, 25 Feb 2026 14:04:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2989759_comment-suivre-le-samsung-unpacked-pour-decouvrir-en-direct-les-nouveaux-smartphones-galaxy</guid>
      <description>
On y est. C'est aujourd'hui, mercredi 25 f&#233;vrier, que Samsung abat ses cartes pour l'ann&#233;e 2026. Entre le Galaxy S26 Ultra qui a fait une cure d'amincissement et les promesses de l'IA agentique, il y a de quoi dire. Voici comment ne rien rater.
</description>
    </item>
    <item>
      <title>C&#8217;est la plus grande image jamais produite par Alma : le c&#339;ur chaotique de la Voie lact&#233;e se d&#233;voile enfin</title>
      <link>https://www.futura-sciences.com/sciences/actualites/voie-lactee-cest-plus-grande-image-jamais-produite-alma-coeur-chaotique-voie-lactee-devoile-enfin-131630/#xtor%3DRSS-8</link>
      <pubDate>Wed, 25 Feb 2026 15:01:50 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/voie-lactee-cest-plus-grande-image-jamais-produite-alma-coeur-chaotique-voie-lactee-devoile-enfin-131630/#xtor%3DRSS-8</guid>
      <description>Les noyaux actifs de galaxies avec des trous noirs g&#233;ants sont &#224; des centaines de millions voire des milliards d'ann&#233;es-lumi&#232;re de la Voie lact&#233;e. Les conditions de formation&#160;des premi&#232;res &#233;toiles moins d'un milliard&#160;d'ann&#233;es apr&#232;s le Big Bang sont difficilement observables. Heureusement, des...</description>
    </item>
    <item>
      <title>Sony Wants to Rework Its &#8216;Spider-Man&#8217; Spinoff Plans</title>
      <link>https://gizmodo.com/sony-spider-man-universe-reboot-kraven-madame-web-2000726185</link>
      <pubDate>Wed, 25 Feb 2026 14:00:16 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000726185</guid>
      <description>Plus, the new 'Scary Movie' may have found the films it wants to spoof.</description>
    </item>
    <item>
      <title>You can now make Alexa&#8217;s AI personality more friendly, blunt, or chilled out</title>
      <link>https://www.theverge.com/tech/884269/amazon-alexa-plus-personality-styles-availability</link>
      <pubDate>2026-02-25T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=884269</guid>
      <description>Amazon is giving you more control over how Alexa behaves during conversations and responses. Three "personality style" presets are launching today for Alexa Plus users in the US that allow you to make the AI-powered voice assistant more concise, cheerful, or relaxed, depending on your personal preferences. "Alexa's personality is one of the things customers [&#8230;]...</description>
    </item>
    <item>
      <title>Adobe&#8217;s new AI video editing tool stitches clips into a first draft</title>
      <link>https://www.theverge.com/tech/884285/adobe-firefly-ai-video-editing-quick-cut</link>
      <pubDate>2026-02-25T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=884285</guid>
      <description>Adobe is launching a new Firefly tool that helps video editors to focus on storytelling by creating a first cut to refine and build around. The Quick Cut feature is launching in beta today for Firefly's video editor, allowing users to automatically assemble clips together based on text prompts and simple creator inputs. "Quick Cut [&#8230;]</description>
    </item>
    <item>
      <title>Harbinger acquires autonomous driving company Phantom AI</title>
      <link>https://techcrunch.com/2026/02/25/harbinger-acquires-autonomous-driving-company-phantom-ai/</link>
      <pubDate>Wed, 25 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3095093</guid>
      <description>It's the Los Angeles trucking startup's first acquisition &#8212; the latest in a series of moves to spin up new revenue streams.</description>
    </item>
    <item>
      <title>Jira&#8217;s latest update allows AI agents and humans to work side by side</title>
      <link>https://techcrunch.com/2026/02/25/jiras-latest-update-allows-ai-agents-and-humans-to-work-side-by-side/</link>
      <pubDate>Wed, 25 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3096128</guid>
      <description>Atlassian is unveiling "agents in Jira" which gives users the ability to assign and manage work given to AI agents the same as humans.</description>
    </item>
    <item>
      <title>Y Combinator grad and AI insurance brokerage Harper raises $47M</title>
      <link>https://techcrunch.com/2026/02/25/ai-insurance-brokerage-harper-raises-45m-series-a-and-seed/</link>
      <pubDate>Wed, 25 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3096239</guid>
      <description>Harper is an AI-native insurance brokerage that just raised a $45 million combined Series A and seed, after a member of YC's Winter 2025 cohort.</description>
    </item>
    <item>
      <title>Amazon&#8217;s AI-powered Alexa+ gets new personality options</title>
      <link>https://techcrunch.com/2026/02/25/amazons-ai-powered-alexa-gets-new-personality-options/</link>
      <pubDate>Wed, 25 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3096381</guid>
      <description>Users will be able to choose from Alexa styles like Brief, Chill or Sweet, Amazon says.</description>
    </item>
    <item>
      <title>Adobe Firefly&#8217;s video editor can now automatically create a first draft from footage</title>
      <link>https://techcrunch.com/2026/02/25/adobe-fireflys-video-editor-can-now-automatically-create-a-first-draft-from-footage/</link>
      <pubDate>Wed, 25 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3096694</guid>
      <description>Adobe Firefly is getting a new feature called Quick Cut that uses AI to edit footage to create a first draft of the final video based on user instructions.</description>
    </item>
    <item>
      <title>What is the release date for Monarch: Legacy of Monsters season 2 episode 1 on Apple TV?</title>
      <link>https://www.techradar.com/streaming/apple-tv-plus/what-is-the-release-date-for-monarch-legacy-of-monsters-season-2-on-apple-tv</link>
      <pubDate>Wed, 25 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">2LSLpZaDaGxA9mBiBwMKH7</guid>
      <description>Here's when Monarch: Legacy of Monsters season 2's first chapter will air on Apple TV.</description>
    </item>
    <item>
      <title>Alexa+ just got a personality upgrade &#8212; you can now choose whether it&#8217;s brief, chill, or your biggest cheerleader</title>
      <link>https://www.techradar.com/home/smart-home/alexa-just-got-a-personality-upgrade-you-can-now-choose-whether-its-brief-chill-or-your-biggest-cheerleader</link>
      <pubDate>Wed, 25 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">F5RAkRRtGdf6XoidRKx8U</guid>
      <description>Amazon has added three customizable personality styles to Alexa+, letting users control how the assistant responds without changing its core functionality.</description>
    </item>
    <item>
      <title>Amazon introduces three personality styles for Alexa+</title>
      <link>https://www.engadget.com/ai/amazon-introduces-three-personality-styles-for-alexa-140000602.html?src=rss</link>
      <pubDate>Wed, 25 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">168aac8d-f07b-48bc-abbb-310e30c1fa7f</guid>
      <description>Amazon is offering a new way for Alexa+ users to customize the AI assistant's communication style. The company has introduced three personalities for Alexa+, so the assistant can adopt an attitude that is Brief, Chill or Sweet.&#160;The Brief style will be exactly that: no small talk and no extra conversation. Chill is easygoing and seems to be inspired by caricatures of the surfer/stoner type, while the Sweet mode is almost aggressively perky and chipper. In the audio sample provided, when a user asks "Alexa, how's it going?" the Chill voice responds, "Life&#8217;s treating me well &#8211; all systems are Zen...</description>
    </item>
    <item>
      <title>Spotify can reorder your playlists by BPM and key</title>
      <link>https://www.engadget.com/entertainment/music/spotify-can-reorder-your-playlists-by-bpm-and-key-140000101.html?src=rss</link>
      <pubDate>Wed, 25 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">b9913750-139d-47da-8106-55dacc23e2a5</guid>
      <description>Spotify is rolling out a new feature that&#8217;s meant to make transitions in between tracks even smoother. If you&#8217;ll recall, the streaming service released the ability to create customized transitions within playlists in August last year. It gave people a way to create uninterrupted progressions and eliminate awkward silences between songs. Now, Premium users will be able to make sure the songs in their playlists flow seamlessly even further by reordering tracks based on their keys and BPM or beats per minute. The new feature can rearrange playlists with one tap. All paying users have to do is tap...</description>
    </item>
    <item>
      <title>Comment cl&#244;turer son compte Sumeria ?</title>
      <link>https://www.frandroid.com/services/banque-en-ligne/2989363_comment-cloturer-son-compte-sumeria</link>
      <pubDate>Wed, 25 Feb 2026 13:59:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/banque-en-ligne/2989363_comment-cloturer-son-compte-sumeria</guid>
      <description>
&#192; partir du 12 mars 2026, la banque en ligne Sumeria appliquera des frais d'inactivit&#233; &#224; hauteur de 3 euros par mois. Pour celles et ceux qui ont t&#233;l&#233;charg&#233; Sumeria juste pour rembourser un pote, voici la d&#233;marche pour cl&#244;turer son compte et passer &#224; autre chose.
</description>
    </item>
    <item>
      <title>Amazon continues retreat from games by ending publishing deal for open-world racer</title>
      <link>https://www.theverge.com/entertainment/884280/amazon-publishing-deal-maverick-games-forza-cancel</link>
      <pubDate>2026-02-25T08:46:44-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=884280</guid>
      <description>Amazon continues to scale back its gaming efforts, this time by ending a notable publishing deal. The Game Business reports that Amazon will no longer be the publisher of an upcoming open-world racing title from Maverick Games, a new studio made up of former Forza developers. The deal was originally announced in 2024. The news [&#8230;]</description>
    </item>
    <item>
      <title>1Password augmente fortement le prix de ses abonnements : quelles sont les meilleures alternatives ?</title>
      <link>https://www.frandroid.com/actualites-generales/2989695_1password-augmente-fortement-le-prix-de-ses-abonnements-quelles-sont-les-meilleures-alternatives</link>
      <pubDate>Wed, 25 Feb 2026 13:35:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2989695_1password-augmente-fortement-le-prix-de-ses-abonnements-quelles-sont-les-meilleures-alternatives</guid>
      <description>
Le gestionnaire de mots de passe 1Password annonce une forte hausse de ses abonnements. Il existe pourtant de tr&#232;s bonnes alternatives bien moins ch&#232;res.
</description>
    </item>
    <item>
      <title>Apr&#232;s le DSA, maintenant le RGPD&#160;: les &#201;tats-Unis partent en guerre contre la protection des donn&#233;es en Europe</title>
      <link>https://www.01net.com/actualites/apres-le-dsa-maintenant-le-rgpd-les-etats-unis-partent-en-guerre-contre-la-protection-des-donnees-en-europe.html</link>
      <pubDate>Wed, 25 Feb 2026 13:30:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1328131</guid>
      <description>L'administration Trump ouvre un nouveau front contre l'Union europ&#233;enne. Les diplomates am&#233;ricains ont d&#233;sormais pour consigne de combattre les tentatives de r&#233;guler l'h&#233;bergement des donn&#233;es collect&#233;es par les entreprises am&#233;ricaines &#224; l'&#233;tranger. Le r&#232;glement g&#233;n&#233;ral sur la protection des donn&#233;es, pierre angulaire de la politique num&#233;rique europ&#233;enne, est dans le collimateur....</description>
    </item>
    <item>
      <title>Khosla&#8217;s Keith Rabois backs Comp, which wants to bolster HR teams with AI</title>
      <link>https://techcrunch.com/2026/02/25/khoslas-keith-rabois-backs-comp-which-wants-to-bolster-hr-teams-with-ai/</link>
      <pubDate>Wed, 25 Feb 2026 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3096711</guid>
      <description>The HR tech startup, which currently operates in Brazil, has raised a $17.25 million Series A.</description>
    </item>
    <item>
      <title>Xiaomi affiche son chargeur sans fil Qi 50 W &#224; moins de 40 &#8364; : c&#8217;est le meilleur rapport performance/prix du moment</title>
      <link>https://www.frandroid.com/bons-plans/2989271_xiaomi-affiche-son-chargeur-sans-fil-qi-50-w-a-moins-de-40-e-cest-le-meilleur-rapport-performance-prix-du-moment</link>
      <pubDate>Wed, 25 Feb 2026 13:24:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2989271_xiaomi-affiche-son-chargeur-sans-fil-qi-50-w-a-moins-de-40-e-cest-le-meilleur-rapport-performance-prix-du-moment</guid>
      <description>
Dans le (tr&#232;s) large catalogue de Xiaomi, on trouve un chargeur sans fil compatible avec la norme Qi de type socle, dont la puissance de charge s'&#233;l&#232;ve &#224; 50 W. De quoi ranimer rapidement un smartphone. En ce moment, la marque chinoise le propose &#224; 39,99 euros au lieu de 49,99 euros. 
</description>
    </item>
    <item>
      <title>Pok&#233;mon TCG: Perfect Order Booster Box preorders are $211 at TCGplayer &#8212; save vs. Walmart</title>
      <link>https://mashable.com/article/feb-25-pokemon-tcg-perfect-order-booster-box-deal</link>
      <pubDate>Wed, 25 Feb 2026 13:23:32 +0000</pubDate>
      <guid isPermaLink="false">055L62kFNLUsBSx02bl7sAs</guid>
      <description>The Pok&#233;mon TCG: Perfect Order Booster Box is $211 at TCGplayer, beating Walmart&#8217;s $229.95 preorder price.</description>
    </item>
    <item>
      <title>Sonos apparently has yet another app overhaul in the works, hopes you've forgotten 2024</title>
      <link>https://www.techradar.com/audio/sonos-apparently-has-yet-another-app-overhaul-in-the-works-hopes-youve-forgotten-2024</link>
      <pubDate>Wed, 25 Feb 2026 13:22:05 +0000</pubDate>
      <guid isPermaLink="false">bEJvBfhZ2hHXjNmLQ2gZSP</guid>
      <description>Should we make the point about the definition of insanity being doing the same thing over and over and expecting a different outcome?</description>
    </item>
    <item>
      <title>Look alive, bub &#8212; Marvel's Wolverine gets long-awaited release date and yes, it's still coming this year</title>
      <link>https://www.techradar.com/gaming/look-alive-bub-marvels-wolverine-gets-long-awaited-release-date-and-yes-its-still-coming-this-year</link>
      <pubDate>Wed, 25 Feb 2026 13:19:19 +0000</pubDate>
      <guid isPermaLink="false">3Hpt23iZKhC9WFff4gzYMc</guid>
      <description>Insomniac Games has locked in the Marvel's Wolverine release date &#8212; and it's coming sooner than you might think.</description>
    </item>
    <item>
      <title>AMC is closing more theaters: List of doomed cinema locations will grow in 2026 as meme stock craze sputters</title>
      <link>https://www.fastcompany.com/91498440/amc-theaters-closing-2026-list-doomed-cinema-locations-grows</link>
      <pubDate>2026-02-25T13:18:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91498440/amc-theaters-closing-2026-list-doomed-cinema-locations-grows</guid>
      <description>In an earnings call on Tuesday, the chain&#8217;s chief financial officer said AMC will continue to shutter more locations than it opens going forward.
AMC, the world&#8217;s largest movie theater chain and a one-time darling of meme stock traders, said this week that it expects to continue closing more movie theaters than it opens going forward.</description>
    </item>
    <item>
      <title>How to watch Sri Lanka vs. New Zealand in the 2026 T20 World Cup online for free</title>
      <link>https://mashable.com/article/sri-lanka-new-zealand-t20-world-cup-2026-live-stream-for-free</link>
      <pubDate>Wed, 25 Feb 2026 13:16:37 +0000</pubDate>
      <guid isPermaLink="false">07aEEummnLOJLVbz9pfDez4</guid>
      <description>How to watch T20 World Cup for free. Live stream Sri Lanka vs. New Zealand in the 2026 T20 World Cup for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Soundcore lance les Nebula P1 et P1i, deux vid&#233;oprojecteurs pens&#233;s pour la mobilit&#233; avec des enceintes originales</title>
      <link>https://www.frandroid.com/marques/anker/2989683_soundcore-lance-les-nebula-p1-et-p1i-deux-videoprojecteurs-penses-pour-la-mobilite</link>
      <pubDate>Wed, 25 Feb 2026 13:13:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/anker/2989683_soundcore-lance-les-nebula-p1-et-p1i-deux-videoprojecteurs-penses-pour-la-mobilite</guid>
      <description>
La marque soundcore, appartenant &#224; Anker Innovations, d&#233;voile officiellement deux nouveaux vid&#233;oprojecteurs Nebula, les P1 et P1i, con&#231;us pour apporter une image grand format et un son int&#233;gr&#233; ou d&#233;port&#233;, avec Google TV et Netflix au c&#339;ur de l&#8217;exp&#233;rience.
</description>
    </item>
    <item>
      <title>Si vous avez un compte Sumeria (ex-Lydia), la plateforme va vous facturer des &#171;&#8201;frais d&#8217;inactivit&#233;&#8201;&#187;</title>
      <link>https://www.frandroid.com/services/banque-en-ligne/2940197_attention-si-vous-avez-un-compte-sumeria-ex-lydia-la-plateforme-va-vous-facturer-des-frais-dinactivite-de-3-e-par-mois</link>
      <pubDate>Wed, 25 Feb 2026 13:10:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/banque-en-ligne/2940197_attention-si-vous-avez-un-compte-sumeria-ex-lydia-la-plateforme-va-vous-facturer-des-frais-dinactivite-de-3-e-par-mois</guid>
      <description>
Banque en ligne extr&#234;mement populaire en France, du fait de sa filiation avec le service Lydia, Sumeria va commencer &#224; facturer des &#171; frais d&#8217;inactivit&#233; &#187; pour les comptes qui n&#8217;utilisent pas le service.
</description>
    </item>
    <item>
      <title>1Password is getting more expensive soon - says change is despite the fact &#8216;pricing has remained largely unchanged for many years&#8217;</title>
      <link>https://www.techradar.com/pro/security/1password-is-getting-more-expensive-soon-says-change-is-despite-the-fact-pricing-has-remained-largely-unchanged-for-many-years</link>
      <pubDate>Wed, 25 Feb 2026 13:05:00 +0000</pubDate>
      <guid isPermaLink="false">uhq9V2BdjGaZnPuxnmWaRF</guid>
      <description>1Password is raising its prices, but it's still cheaper than it was 14 years ago.</description>
    </item>
    <item>
      <title>Behold the Haunting Gaze of C-3PO&#8217;s Disembodied Head From &#8216;The Empire Strikes Back&#8217;</title>
      <link>https://gizmodo.com/behold-the-haunting-gaze-of-c-3pos-disembodied-head-from-the-empire-strikes-back-2000726120</link>
      <pubDate>Wed, 25 Feb 2026 13:00:12 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000726120</guid>
      <description>The 'Star Wars' relic is part of a large entertainment memorabilia auction hosted by Propstore in March.</description>
    </item>
    <item>
      <title>Uber previews its Dubai air taxi service</title>
      <link>https://www.engadget.com/transportation/uber-previews-its-dubai-air-taxi-service-130000603.html?src=rss</link>
      <pubDate>Wed, 25 Feb 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">472ec9a0-4554-429c-b5f5-5bb3b266b7c0</guid>
      <description>Uber is one step closer to going airborne. On Wednesday, the company previewed its air taxi booking service ahead of an expected launch in Dubai later this year. The inaugural Uber Air program will let travelers book Joby Aviation's electric air taxis through a familiar process in the Uber app.The experience of booking an air taxi will be much like reserving a four-wheeled Uber. In the app, after entering your destination, Uber Air will appear as an option for eligible routes. The Uber app will book a flight and an Uber Black to pick you up and drop you off at a Joby "vertiport."The process of...</description>
    </item>
  </channel>
</rss>
