<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 03 Jan 2026 18:34:14 GMT</lastBuildDate>
    <item>
      <title>Moins de 90 &#8364; pour une barre de son 2.1 et Dolby Atmos : l&#8217;offre &#224; ne pas manquer en ce d&#233;but d&#8217;ann&#233;e</title>
      <link>https://www.frandroid.com/bons-plans/2925425_moins-de-90-e-pour-une-barre-de-son-2-1-et-dolby-atmos-loffre-a-ne-pas-manquer-en-ce-debut-dannee</link>
      <pubDate>Sat, 03 Jan 2026 18:26:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2925425_moins-de-90-e-pour-une-barre-de-son-2-1-et-dolby-atmos-loffre-a-ne-pas-manquer-en-ce-debut-dannee</guid>
      <description>
Si la TCL S55HE poss&#232;de un format compact qui saura s'int&#233;grer dans tous les salons, elle est &#233;galement compatible avec le Dolby Atmos. Chez Boulanger, elle perd 40 euros de son prix et tombe &#224; 89 euros.
</description>
    </item>
    <item>
      <title>Disinformation Floods Social Media After Nicol&#225;s Maduro's Capture</title>
      <link>https://www.wired.com/story/disinformation-floods-social-media-after-nicolas-maduros-capture/</link>
      <pubDate>Sat, 03 Jan 2026 18:14:47 +0000</pubDate>
      <guid isPermaLink="false">695951c6d05e4862f88e03a1</guid>
      <description>From seemingly AI-generated videos to the recirculation of old footage, TikTok, Instagram, and X did little to stop the onslaught of misleading posts in the wake of the US invasion of Venezuela.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs PC portables gamer &#224; choisir en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/689411_guide-meilleurs-pc-portables-gamer</link>
      <pubDate>Sat, 03 Jan 2026 18:02:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/689411_guide-meilleurs-pc-portables-gamer</guid>
      <description>
Vous cherchez un bon PC portable gamer pour jouer, pour ne pas vous prendre la t&#234;te avec un ordinateur de bureau ? &#192; partir de  1 000 euros, voici les meilleurs PC portables gaming du moment, pour jouer dans les meilleures conditions.
</description>
    </item>
    <item>
      <title>&#8216;Wonder Man&#8217; Really Wants You to Know Hollywood Hates Superpowers</title>
      <link>https://gizmodo.com/wonder-man-really-wants-you-to-know-hollywood-hates-superpowers-2000705000</link>
      <pubDate>Sat, 03 Jan 2026 17:50:39 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705000</guid>
      <description>There's no business like show business&#8212;and according to 'Wonder Man,' there's no room in that business for superpowers.</description>
    </item>
    <item>
      <title>California introduces a one-stop shop to delete your online data footprint</title>
      <link>https://www.engadget.com/cybersecurity/california-introduces-a-one-stop-shop-to-delete-your-online-data-footprint-173102064.html?src=rss</link>
      <pubDate>Sat, 03 Jan 2026 17:31:02 +0000</pubDate>
      <guid isPermaLink="false">ab76573b-0cc7-4801-8809-996388192de0</guid>
      <description>Californians can now put a stop to their personal data being sold around on an online trading floor, thanks to a new free tool. On January 1, the state launched its Delete Request and Opt-out Platform, shortened to DROP, that allows residents to request to delete all of their personal information online that's been harvested by data brokers.
According to the California Privacy Protection Agency (CalPrivacy), which was responsible for DROP's release, it's a "first of its kind" tool that imposes new restrictions on businesses that hoard and sell personal info that consumers didn't provide direct...</description>
    </item>
    <item>
      <title>We have more rumored details for Apple's cheaper MacBook &#8211; and it could be out soon</title>
      <link>https://www.techradar.com/computing/macbooks/we-have-more-rumored-details-for-apples-cheaper-macbook-and-it-could-be-out-soon</link>
      <pubDate>Sat, 03 Jan 2026 17:30:00 +0000</pubDate>
      <guid isPermaLink="false">CbnPQfgkDR8toMVqyEGS47</guid>
      <description>Apple is ready to introduce its cheaper MacBook to the world, according to a new analyst report.</description>
    </item>
    <item>
      <title>Meta&#8217;s Quest 3S is still $50 off and comes with a $50 gift card</title>
      <link>https://www.theverge.com/gadgets/853151/meta-quest-3s-apple-airtag-steam-winter-sale-deal</link>
      <pubDate>2026-01-03T12:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=853151</guid>
      <description>We posted a couple of times about Meta&#8217;s Quest 3S during the holidays. The virtual reality headset that typically sold for $299.99 was &#8212; and still is &#8212; available for $249.99. Better yet, you can get in on a promotion at Amazon that includes a $50 digital account credit with purchase. You can find a [&#8230;]</description>
    </item>
    <item>
      <title>Mode rafale : buffer, cartes et rolling shutter, tout comprendre pour ne plus jamais rater une photo d&#8217;action</title>
      <link>https://www.frandroid.com/comment-faire/tutoriaux/tutoriels-photo-video/2917735_mode-rafale-buffer-cartes-et-rolling-shutter-tout-comprendre-pour-ne-plus-jamais-rater-une-photo-daction</link>
      <pubDate>Sat, 03 Jan 2026 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/comment-faire/tutoriaux/tutoriels-photo-video/2917735_mode-rafale-buffer-cartes-et-rolling-shutter-tout-comprendre-pour-ne-plus-jamais-rater-une-photo-daction</guid>
      <description>
Si les bo&#238;tiers hybrides promettent de bannir la photo rat&#233;e gr&#226;ce &#224; des cadences de rafale explosives, les chiffres affich&#233;s ne font pas tout. Entre promesses marketing et r&#233;alit&#233; du terrain, d&#233;cryptons ce qui se passe vraiment lorsque vous maintenez le d&#233;clencheur enfonc&#233; en prise de vue continue. 
</description>
    </item>
  </channel>
</rss>
