<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 19 Nov 2025 15:36:54 GMT</lastBuildDate>
    <item>
      <title>Disney loses bid to block Sling TV&#8217;s one-day cable passes</title>
      <link>https://www.theverge.com/news/824017/disney-sling-tv-cable-passes-block-denied</link>
      <pubDate>2025-11-19T10:36:30-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=824017</guid>
      <description>A federal judge in New York denied Disney&#8217;s request to block Sling TV&#8217;s short-term passes, which give viewers the ability to stream live content for as little as one day. In a ruling on Tuesday, US District Judge Arun Subramanian ruled that Disney didn&#8217;t prove that Sling TV&#8217;s passes caused &#8220;irreparable harm&#8221; to the entertainment [&#8230;]</description>
    </item>
    <item>
      <title>Voici enfin les premiers prix de la Renault Twingo &#233;lectrique : moins de 20 000 &#8364; confirm&#233;, mais il y a un mais</title>
      <link>https://www.frandroid.com/marques/renault/2876717_voici-enfin-les-premiers-prix-de-la-renault-twingo-electrique-moins-de-20-000-e-confirme-mais-il-y-a-un-mais</link>
      <pubDate>Wed, 19 Nov 2025 15:33:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2876717_voici-enfin-les-premiers-prix-de-la-renault-twingo-electrique-moins-de-20-000-e-confirme-mais-il-y-a-un-mais</guid>
      <description>
&#192; peine pr&#233;sent&#233;e, la Renault Twingo E-Tech annonce ses prix pour le march&#233; italien. De quoi offrir une premi&#232;re id&#233;e de ce qui nous attend en France, et de d&#233;couvrir que la promesse d'une voiture &#233;lectrique &#224; moins de 20 000 euros sera une r&#233;alit&#233;... un peu plus tard.
</description>
    </item>
    <item>
      <title>Hisense&#8217;s Annual Upgrade Season Is Taking Up to $2,800 Off Its Top TVs Before Black Friday, With a Free $100 FIFA Gift Card</title>
      <link>https://gizmodo.com/hisenses-annual-upgrade-season-is-taking-up-to-2800-off-its-top-tvs-before-black-friday-with-a-free-100-fifa-gift-card-2000686716</link>
      <pubDate>Wed, 19 Nov 2025 15:32:15 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000686716</guid>
      <description>Upgrading your entertainment setup has never been more affordable.</description>
    </item>
    <item>
      <title>Le pr&#233;-Black Friday ratisse le prix de ce robot tondeuse Mammotion capable d&#8217;op&#233;rer sur une superficie de 800 m2</title>
      <link>https://www.frandroid.com/bons-plans/2875775_le-pre-black-friday-ratisse-le-prix-de-ce-robot-tondeuse-mammotion-capable-doperer-sur-une-superficie-de-800-m2</link>
      <pubDate>Wed, 19 Nov 2025 15:31:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2875775_le-pre-black-friday-ratisse-le-prix-de-ce-robot-tondeuse-mammotion-capable-doperer-sur-une-superficie-de-800-m2</guid>
      <description>
Les robots tondeuses commencent s&#233;rieusement &#224; gagner du terrain, au point que l&#8217;on voit d&#233;sormais appara&#238;tre des mod&#232;les abordables&#8230; sans pour autant sacrifier la fiche technique. C&#8217;est le cas de la Mammotion Yuka Mini 800. Et pour le rendre encore plus s&#233;duisant, il s&#8217;offre une belle coupe avant le Black Friday son prix passe de 959 euros &#224; 699 euros chez Boulanger.
...</description>
    </item>
    <item>
      <title>Une pr&#233;cision jamais atteinte dans une simulation de la Voie lact&#233;e : ce qu&#8217;elle promet pour la science est immense</title>
      <link>https://www.futura-sciences.com/sciences/actualites/voie-lactee-precision-jamais-atteinte-simulation-voie-lactee-ce-quelle-promet-science-immense-127668/#xtor%3DRSS-8</link>
      <pubDate>Wed, 19 Nov 2025 16:31:10 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/voie-lactee-precision-jamais-atteinte-simulation-voie-lactee-ce-quelle-promet-science-immense-127668/#xtor%3DRSS-8</guid>
      <description>Simuler un syst&#232;me aussi complexe qu&#8217;une galaxie, c&#8217;est un casse-t&#234;te, m&#234;me avec les supercalculateurs les plus perfectionn&#233;s. Mais des chercheurs ont trouv&#233; un moyen de doper leurs performances. Ils nous r&#233;v&#232;lent tout&#8230;</description>
    </item>
    <item>
      <title>Xiaomi multiplie les deals &#224; la veille du Black Friday : les 17 meilleures offres &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2858733_xiaomi-profite-du-pre-black-friday-pour-brader-ses-produits-les-plus-populaires-les-8-offres-a-saisir</link>
      <pubDate>Wed, 19 Nov 2025 15:30:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2858733_xiaomi-profite-du-pre-black-friday-pour-brader-ses-produits-les-plus-populaires-les-8-offres-a-saisir</guid>
      <description>
&#192; l'approche du Black Friday, Xiaomi n'h&#233;site pas &#224; casser le prix de ses produits, y compris sur les r&#233;f&#233;rences les plus r&#233;centes. Voici les produits de la marque que l'on recommande sans h&#233;siter.
</description>
    </item>
    <item>
      <title>19 Best Mac Accessories (2025), Tested and Reviewed</title>
      <link>https://www.wired.com/gallery/best-mac-accessories/</link>
      <pubDate>Wed, 19 Nov 2025 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">6800120f10c613a84bf60f5c</guid>
      <description>From a Mac Mini hub to mechanical keyboards, these curated gadgets will upgrade your Mac-powered desktop.</description>
    </item>
    <item>
      <title>With upcoming ban, Meta begins to notify Australian teens that their accounts will be shut down</title>
      <link>https://techcrunch.com/2025/11/19/with-upcoming-ban-meta-begins-to-notify-australian-teens-that-their-accounts-will-be-shut-down/</link>
      <pubDate>Wed, 19 Nov 2025 15:29:38 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069147</guid>
      <description>When the ban goes into effect on December 10, Meta will revoke account access for users under the age of 16 in Australia.</description>
    </item>
    <item>
      <title>Spotify&#8217;s new features let listeners explore the people and stories behind their favorite music</title>
      <link>https://techcrunch.com/2025/11/19/spotifys-new-features-let-listeners-explore-the-people-and-stories-behind-their-favorite-music/</link>
      <pubDate>Wed, 19 Nov 2025 15:24:19 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069145</guid>
      <description>Spotify new features will showcase who's behind your favorite songs, how music is connected, and what inspired the tunes.</description>
    </item>
    <item>
      <title>Ray clusters hijacked and turned into crypto miners by shadowy new botnet</title>
      <link>https://www.techradar.com/pro/security/ray-clusters-hijacked-and-turned-into-crypto-miners-by-shadowy-new-botnet</link>
      <pubDate>Wed, 19 Nov 2025 15:21:00 +0000</pubDate>
      <guid isPermaLink="false">ozXReKDgQvNrMjRL6dMUDb</guid>
      <description>IronErn440 is using a known, unfixed flaw, to create a botnet and deploy the XMRig cryptojacker.</description>
    </item>
    <item>
      <title>Why &#8216;Twin Peaks&#8217; Still Looks Incredible Decades Later</title>
      <link>https://gizmodo.com/twin-peaks-cinematography-ronald-victor-garcia-david-lynch-2000688097</link>
      <pubDate>Wed, 19 Nov 2025 15:19:02 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000688097</guid>
      <description>Director of Photography Ronald V&#237;ctor Garc&#237;a shares all the metaphorical direction Lynch would give him to nail the show's warm vibes.</description>
    </item>
    <item>
      <title>Le Black Friday s&#8217;attaque &#224; la domotique avec de multiples offres sur les airfryers, cam&#233;ras, ampoules et sonnettes connect&#233;es</title>
      <link>https://www.frandroid.com/bons-plans/2858095_black-friday-meilleures-promotions-maison-connectee-aspirateurs-robots</link>
      <pubDate>Wed, 19 Nov 2025 15:18:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2858095_black-friday-meilleures-promotions-maison-connectee-aspirateurs-robots</guid>
      <description>
Robot aspirateur, friteuse sans huile, ampoules intelligentes, cam&#233;ras de s&#233;curit&#233;... Les indispensables de la maison connect&#233;e sont d&#233;j&#224; en promotion &#224; l'occasion des offres anticip&#233;es du Black Friday. C'est le moment id&#233;al pour se lancer dans la domotique ou compl&#233;ter son installation avec notre s&#233;lection des meilleures offres disponibles.
</description>
    </item>
    <item>
      <title>This viral AI pen didn&amp;#8217;t help me cheat</title>
      <link>https://www.theverge.com/report/822151/ai-smart-pen-for-cheating-tests</link>
      <pubDate>2025-11-19T10:12:20-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=822151</guid>
      <description>A college student recently told me about the latest tech designed to help students cheat - and it wasn't ChatGPT. It was an actual, physical gadget marketed in YouTube ads as the workaround to physical, hardcopy tests, which are back in vogue now as AI tears through higher education like a tornado. (One example is [&#8230;]</description>
    </item>
    <item>
      <title>Exceptionally Rare Pink Grasshopper Is Chonky, Adorable&#8212;and a Genetic Miracle</title>
      <link>https://gizmodo.com/exceptionally-rare-pink-grasshopper-is-chonky-adorable-and-a-genetic-miracle-2000688101</link>
      <pubDate>Wed, 19 Nov 2025 15:10:02 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000688101</guid>
      <description>The color, likely caused by a genetic mutation, is lovely to behold but unfortunately detrimental to the critter's chances of survival.</description>
    </item>
    <item>
      <title>Poussi&#232;re, chaleur, humidit&#233; : ce que l&#8217;&#233;tude r&#233;v&#232;le pour optimiser l&#8217;entretien des panneaux solaires</title>
      <link>https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2875861_poussiere-chaleur-humidite-ce-que-letude-revele-pour-optimiser-lentretien-des-panneaux-solaires</link>
      <pubDate>Wed, 19 Nov 2025 15:09:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2875861_poussiere-chaleur-humidite-ce-que-letude-revele-pour-optimiser-lentretien-des-panneaux-solaires</guid>
      <description>
Des chercheurs apportent une meilleure compr&#233;hension de l&#8217;effet de la poussi&#232;re sur les panneaux photovolta&#239;ques. Leur &#233;tude r&#233;v&#232;le que la composition min&#233;rale de ces particules joue un r&#244;le important dans la d&#233;gradation des installations solaires.
</description>
    </item>
    <item>
      <title>ROG Xbox Ally X : pourquoi avons-nous mis autant de temps &#224; noter la console portable de Microsoft</title>
      <link>https://www.frandroid.com/marques/microsoft/2876255_rog-xbox-ally-x-pourquoi-avons-nous-mis-autant-de-temps-a-noter-la-console-portable-de-microsoft</link>
      <pubDate>Wed, 19 Nov 2025 15:07:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2876255_rog-xbox-ally-x-pourquoi-avons-nous-mis-autant-de-temps-a-noter-la-console-portable-de-microsoft</guid>
      <description>
Un mois apr&#232;s sa sortie, nous avons enfin donn&#233; une note &#224; la ROG Xbox Ally X. Petit r&#233;cit d'un test tumultueux et riche en p&#233;rip&#233;ties.
</description>
    </item>
    <item>
      <title>&#171; On peut ramener cette voiture ici &#187; : la patronne de BYD donne une bonne nouvelle sur sa voiture &#233;lectrique &#224; 15 000 &#8364; en Europe</title>
      <link>https://www.frandroid.com/marques/byd/2876209_on-peut-ramener-cette-voiture-ici-la-patronne-de-byd-donne-une-bonne-nouvelle-sur-sa-voiture-electrique-a-15-000-e-en-europe</link>
      <pubDate>Wed, 19 Nov 2025 15:02:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2876209_on-peut-ramener-cette-voiture-ici-la-patronne-de-byd-donne-une-bonne-nouvelle-sur-sa-voiture-electrique-a-15-000-e-en-europe</guid>
      <description>
BYD est d&#233;j&#224; pr&#234;t &#224; d&#233;gainer sa voiture &#233;lectrique &#224; moins de 15 000 euros pr&#233;vue pour respecter les r&#232;gles europ&#233;ennes. Si l'on en croit les propos de la patronne du constructeur chinois.
</description>
    </item>
    <item>
      <title>Best Gifts for Hikers, Backpackers, Outdoorsy People (2025)</title>
      <link>https://www.wired.com/gallery/awesome-gifts-for-hikers-backpackers-and-outdoorsy-people/</link>
      <pubDate>Wed, 19 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">66e33f4256ceae918a4e0dd0</guid>
      <description>Let them pick out their own hiking boots. Instead, try gifting a useful blade or a nature journal to delight your outdoorsy friend.</description>
    </item>
    <item>
      <title>Demonschool channels Buffy and Persona for delightfully demonic RPG action</title>
      <link>https://www.theverge.com/games-review/770090/demonschool-review-switch-xbox-ps5</link>
      <pubDate>2025-11-19T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=770090</guid>
      <description>In one particularly memorable sequence in Demonschool - the new tactical RPG from Necrosoft that, after a few hiccups, releases on November 19th - I throw a doll at a zombie's head, dispatch it with a roundhouse kick to the jowls as I watch my friends sweep demons off the floor in vortices of blood, [&#8230;]</description>
    </item>
    <item>
      <title>Onepot AI raises $13M to help make chemical drug creation easier</title>
      <link>https://techcrunch.com/2025/11/19/onepot-ai-raises-13m-to-help-make-chemical-drug-creation-easier/</link>
      <pubDate>Wed, 19 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069120</guid>
      <description>Onepot AI is a a company that is home to the small-molecule synthesis lab POT-1.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Thursday, November 20 (game #1396)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-20-november-2025</link>
      <pubDate>Wed, 19 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">dfG6nNNELMA8kf5xyerQLQ</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Thursday, November 20 (game #893)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-20-november-2025</link>
      <pubDate>Wed, 19 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">N2C2T6DztpWdxSdKpSUx89</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Thursday, November 20 (game #627)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-20-november-2025</link>
      <pubDate>Wed, 19 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">fbbFeFc9a6hqGZ9pRhwynF</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>What is the release date for South Park season 28 episode 4 on Paramount+?</title>
      <link>https://www.techradar.com/streaming/paramount-plus/what-is-the-release-date-for-south-park-season-28-episode-4-on-paramount</link>
      <pubDate>Wed, 19 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">EAHrGv77cwoKfgRfGfVxPP</guid>
      <description>You'll have to wait patiently for more South Park, as there's no new episode this week.</description>
    </item>
    <item>
      <title>How&#160;modern&#160;CMOs drive strategic impact in the age of&#160;AI</title>
      <link>https://www.fastcompany.com/91444224/how-modern-cmos-drive-strategic-impact-in-the-age-of-ai</link>
      <pubDate>2025-11-19T15:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444224/how-modern-cmos-drive-strategic-impact-in-the-age-of-ai</guid>
      <description>The new imperatives for marketing leadership to unlock growth. 
In today&#8217;s hyper-competitive B2B landscape, marketing leaders face a paradox:&#160;The&#160;pace of change is relentless, yet the need for clarity and purpose has never been greater.&#160;With artificial intelligence (AI) reshaping every&#160;facet&#160;of business, the imperative is not just to keep up but to lead the charge.&#160;&#160;...</description>
    </item>
    <item>
      <title>La guerre des routeurs&#160;: TP-Link accuse Netgear de d&#233;nigrement &#224; un milliard de dollars</title>
      <link>https://www.01net.com/actualites/la-guerre-des-routeurs-tp-link-accuse-netgear-de-denigrement-a-un-milliard-de-dollars.html</link>
      <pubDate>Wed, 19 Nov 2025 14:55:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309359</guid>
      <description>Guerre ouverte sur le march&#233; des routeurs. TP-Link accuse son concurrent Netgear d'&#339;uvrer dans l'ombre pour lui nuire, en orchestrant une campagne de d&#233;sinformation qui pourrait lui co&#251;ter tr&#232;s cher.</description>
    </item>
    <item>
      <title>This smart Nextbase dash cam for &#163;59 is my expert-approved pick &#8211; but hurry, the deal ends today</title>
      <link>https://www.techradar.com/vehicle-tech/dash-cams/this-smart-nextbase-dash-cam-for-gbp59-is-my-expert-approved-pick-but-hurry-the-deal-ends-today</link>
      <pubDate>Wed, 19 Nov 2025 14:55:26 +0000</pubDate>
      <guid isPermaLink="false">Ge6bbXATALHGWXs5wCSkzM</guid>
      <description>Amazon has the Nextbase Piqo for just &#163;59, and I think it's a no-brainer buy. Get it while it's still in stock.</description>
    </item>
    <item>
      <title>The US Will Prioritize Visa Processing for Fans With World Cup Tickets</title>
      <link>https://www.wired.com/story/the-us-will-prioritize-visa-processing-for-fans-with-world-cup-tickets/</link>
      <pubDate>Wed, 19 Nov 2025 14:49:33 +0000</pubDate>
      <guid isPermaLink="false">691cda5088f2fcf2a5741564</guid>
      <description>In the face of heavy travel restrictions imposed by the Trump administration, the United States announced that soccer fans going to the World Cup will enjoy a certain priority for processing tourist visa.</description>
    </item>
    <item>
      <title>La puissante tablette PC gaming Asus ROG Flow Z13 est &#224; -25 % pendant le pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2875699_la-puissante-tablette-pc-gaming-asus-rog-flow-z13-est-a-25-pendant-le-pre-black-friday</link>
      <pubDate>Wed, 19 Nov 2025 14:48:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2875699_la-puissante-tablette-pc-gaming-asus-rog-flow-z13-est-a-25-pendant-le-pre-black-friday</guid>
      <description>
L'Asus ROG Flow Z13, qui nous rappelle les Surface Pro de Microsoft, est une tablette PC qui offre de solides performances dans un format vraiment pratique. En ce pr&#233;-Black Friday, vous la trouverez &#224; 1 874,99 euros au lieu de 2 499,99 euros chez Darty et &#224; la Fnac.
</description>
    </item>
    <item>
      <title>Gustav Klimt portrait breaks modern art record with $236 million sale</title>
      <link>https://www.fastcompany.com/91444993/gustav-klimt-portrait-breaks-modern-art-record-sale-auction</link>
      <pubDate>2025-11-19T14:48:02</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444993/gustav-klimt-portrait-breaks-modern-art-record-sale-auction</guid>
      <description>Klimt&#8217;s &#8216;Portrait of Elisabeth Lederer&#8217; depicts the daughter of one of Vienna&#8217;s wealthiest families before Nazi Germany annexed Austria in 1938. 
A Gustav Klimt portrait painting that helped save the life of its Jewish subject during the Holocaust sold Tuesday for $236.4 million, a record for a modern art piece.</description>
    </item>
    <item>
      <title>Info 01net&#160;: Gemini va d&#233;barquer dans les voitures Renault en 2026</title>
      <link>https://www.01net.com/actualites/info-01net-gemini-va-debarquer-dans-les-voitures-renault-en-2026.html</link>
      <pubDate>Wed, 19 Nov 2025 14:46:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309122</guid>
      <description>&#192; peine lanc&#233; sur Android Auto, Gemini va ensuite &#233;quiper les voitures dot&#233;es d&#8217;un OS Google, le fameux Android Automotive. En France, c&#8217;est Renault avec sa R5, sa R4 et sa nouvelle Clio qui devrait en b&#233;n&#233;ficier, d&#232;s l&#8217;ann&#233;e prochaine.</description>
    </item>
    <item>
      <title>How to listen to The Ashes on Test Match Special from anywhere in the world</title>
      <link>https://www.techradar.com/how-to-listen/the-ashes-test-match-special</link>
      <pubDate>Wed, 19 Nov 2025 14:45:45 +0000</pubDate>
      <guid isPermaLink="false">ui82SQXDoxJFndsjfNDxfM</guid>
      <description>Here's how to listen to the 2025/26 Ashes on Test Match Special from anywhere in the world.</description>
    </item>
    <item>
      <title>Target joins OpenAI&#8217;s growing list of retail apps</title>
      <link>https://techcrunch.com/2025/11/19/target-joins-openais-growing-list-of-retail-apps/</link>
      <pubDate>Wed, 19 Nov 2025 14:36:12 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069140</guid>
      <description>OpenAI is pushing deeper into retail, with Target set to debut a new ChatGPT-powered app for shoppers. The app is launching in beta next week.</description>
    </item>
    <item>
      <title>Tout l&#8217;univers de Samsung est &#224; prix cass&#233; pendant le Black Friday : les 20 meilleurs deals</title>
      <link>https://www.frandroid.com/bons-plans/2852851_samsung-frappe-fort-a-lors-du-pre-black-friday-avec-ses-20-bonnes-affaires-a-saisir</link>
      <pubDate>Wed, 19 Nov 2025 14:36:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2852851_samsung-frappe-fort-a-lors-du-pre-black-friday-avec-ses-20-bonnes-affaires-a-saisir</guid>
      <description>
Pendant le pr&#233;-Black Friday, les produits Samsung sont &#224; l'honneur. On trouve des smartphones &#224; moiti&#233; prix, des TV &#224; prix cass&#233;s, ou m&#234;me des barres de son &#224; petit prix :&#160;retrouvez ici les meilleures offres.&#160;
</description>
    </item>
    <item>
      <title>Learning With AI Falls Short Compared to Old-Fashioned Web Search</title>
      <link>https://gizmodo.com/learning-with-ai-falls-short-compared-to-old-fashioned-web-search-2000688085</link>
      <pubDate>Wed, 19 Nov 2025 14:35:32 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000688085</guid>
      <description>In virtually all the ways that matter, getting summarized information from AI models was less educational than doing the work of search.</description>
    </item>
    <item>
      <title>OpenAI board member Larry Summers steps down amid Epstein file revelations</title>
      <link>https://techcrunch.com/2025/11/19/openai-board-member-larry-summers-steps-down-amid-epstein-file-revelations/</link>
      <pubDate>Wed, 19 Nov 2025 14:33:54 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069136</guid>
      <description>Former Treasury Secretary Larry Summers has resigned from OpenAI&#8217;s board days after Congress released documents showing he was close friends with convicted sex offender Jeffrey Epstein.</description>
    </item>
    <item>
      <title>Gemini 3 may be the moment Google pulls away in the AI arms race</title>
      <link>https://www.fastcompany.com/91444801/gemini-3-google-ai</link>
      <pubDate>2025-11-19T14:30:47</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444801/gemini-3-google-ai</guid>
      <description>Across a number of key benchmarks, the new model received top scores.
Google announced its widely anticipated Gemini 3 model Tuesday. By many key metrics, it appears to be more capable than the other big generative AI models on the market.&#160;</description>
    </item>
    <item>
      <title>Vasco Translator Q1 Review: Cloning Your Voice</title>
      <link>https://www.wired.com/review/vasco-translator-q1/</link>
      <pubDate>Wed, 19 Nov 2025 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">691cdc45e1e090347dceafcc</guid>
      <description>This new real-time interpreter can change your language while cloning your voice&#8212;sort of.</description>
    </item>
    <item>
      <title>Brands are looking for a voice</title>
      <link>https://www.fastcompany.com/91444456/brands-are-looking-for-a-voice</link>
      <pubDate>2025-11-19T14:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444456/brands-are-looking-for-a-voice</guid>
      <description>A forgettable, generic voice won&#8217;t cut it; brands need one that&#8217;s authentic and distinct. 
AI is bringing voice to the forefront of brand interactions. Smarter AI means we can talk to our technology&#8212;LLMs, software, phones, cars, fridges, and even banking apps. The novel part is this:&#160;Our&#160;technology is now talking back, and convincingly so. Brands are catching on, and the smart ones know that voice&#160;isn&#8217;t&#160;just&#160;functional,&#160;it will form a core part of the brand identity itself.&#160;...</description>
    </item>
    <item>
      <title>Le Porsche Cayenne devient enfin une voiture &#233;lectrique, et fait mieux que la 911 Turbo S</title>
      <link>https://www.frandroid.com/marques/porsche/2876195_le-porsche-cayenne-devient-enfin-une-voiture-electrique-et-fait-mieux-que-la-911-turbo-s</link>
      <pubDate>Wed, 19 Nov 2025 14:29:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/porsche/2876195_le-porsche-cayenne-devient-enfin-une-voiture-electrique-et-fait-mieux-que-la-911-turbo-s</guid>
      <description>
Porsche vient d'officialiser son nouveau Cayenne Electric, un SUV &#233;lectrique qui pulv&#233;rise tous les records de la marque. Il s'agit de la Porsche la plus puissante de l'histoire, mais aussi de l'une des Porsche les plus pratique pour le quotidien.
</description>
    </item>
    <item>
      <title>Why replication can&#8217;t fix the ransomware problem</title>
      <link>https://www.fastcompany.com/91444599/why-replication-cant-fix-the-ransomware-problem</link>
      <pubDate>2025-11-19T14:26:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444599/why-replication-cant-fix-the-ransomware-problem</guid>
      <description>Replication alone isn&#8217;t the solution some might hope.
Ransomware doesn&#8217;t knock on the front door. It sneaks in quietly, and by the time you notice, the damage is already done. Backups, replication, and cloud storage help recover from ransomware, but when it strikes, these products may not be enough. You copy your data and ensure copies are recoverable when needed....</description>
    </item>
    <item>
      <title>Sony Xperia 1 VII review: has Sony&#8217;s long-standing Xperia family lost what it takes to compete?</title>
      <link>https://www.techradar.com/phones/sony-xperia-phones/sony-xperia-1-vii-review</link>
      <pubDate>Wed, 19 Nov 2025 14:25:55 +0000</pubDate>
      <guid isPermaLink="false">NnYPKuzMCTbQS6KaLyAyDP</guid>
      <description>The Sony Xperia 1 VII is a capable handset that can't quite match some rivals, while coming in at a higher price.</description>
    </item>
    <item>
      <title>Bose Black Friday deals are in and my top-choice new Ultra Earbuds are on sale &#8211; run!</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/bose-black-friday-deals-are-in-and-my-top-choice-new-ultra-earbuds-and-headphones-are-heavily-discounted-run</link>
      <pubDate>Wed, 19 Nov 2025 14:24:38 +0000</pubDate>
      <guid isPermaLink="false">msbZXCWkbruHLH2ibsHkRd</guid>
      <description>Bose kit offers the best ANC in the business and now, the prices are truly worthy of your consideration &#8211;thanks, Black Friday!</description>
    </item>
    <item>
      <title>Cette marque de v&#233;lo &#233;lectrique offre (litt&#233;ralement) sur un plateau son tricycle aux professionnels</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2875813_cette-marque-de-velo-electrique-offre-litteralement-sur-un-plateau-son-tricycle-aux-professionnels</link>
      <pubDate>Wed, 19 Nov 2025 14:20:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2875813_cette-marque-de-velo-electrique-offre-litteralement-sur-un-plateau-son-tricycle-aux-professionnels</guid>
      <description>
Apr&#232;s deux ans de carri&#232;re, le tricycle &#233;lectrique Cube Trike Hybrid d&#233;voile une version Flatbed avec un plateau nu &#224; destination des professionnels, afin de charger de grandes quantit&#233;s marchandises.
</description>
    </item>
    <item>
      <title>Les Xiaomi Store ne sont pas l&#224; que pour faire joli, c&#8217;est une vraie strat&#233;gie qui se met en place</title>
      <link>https://www.01net.com/actualites/les-xiaomi-store-ne-sont-pas-la-que-pour-faire-joli-cest-une-vraie-strategie-qui-se-met-en-place.html</link>
      <pubDate>Wed, 19 Nov 2025 14:20:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309327</guid>
      <description>Xiaomi se lance dans l'ouverture de ses propres magasins physiques en France dans le cadre d'une strat&#233;gie mondiale ambitieuse visant &#224; implanter 10 000 Xiaomi Stores d'ici 2030, pour renforcer sa pr&#233;sence directe et mieux faire d&#233;couvrir l'ensemble de son &#233;cosyst&#232;me de produits, au-del&#224; des smartphones. La d&#233;marche vise aussi &#224; se diversifier peu &#224; peu....</description>
    </item>
    <item>
      <title>Je suis mont&#233; &#224; bord du Porsche Cayenne &#233;lectrique, et j&#8217;ai &#233;t&#233; impressionn&#233; par ses technologies et sa puissance d&#233;mentielles</title>
      <link>https://www.frandroid.com/marques/porsche/2875769_je-suis-monte-a-bord-du-porsche-cayenne-electrique-et-jai-ete-impressionne-par-ses-technologies-et-sa-puissance-dementielles</link>
      <pubDate>Wed, 19 Nov 2025 14:15:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/porsche/2875769_je-suis-monte-a-bord-du-porsche-cayenne-electrique-et-jai-ete-impressionne-par-ses-technologies-et-sa-puissance-dementielles</guid>
      <description>
Porche vient de d&#233;voiler sa nouvelle voiture &#233;lectrique, le Cayenne. Elle est plus rapide que la nouvelle 911 Turbo S et c'est m&#234;me la Porsche la plus puissante de tous les temps. On a pu monter &#224; bord pour se faire un premier avis, en statique.
</description>
    </item>
    <item>
      <title>Porsche Reveals Everything About Its Cayenne Electric&#8212;Except for One Vital Thing</title>
      <link>https://www.wired.com/story/porsche-reveals-everything-about-its-cayenne-electric-apart-from-one-vital-thing/</link>
      <pubDate>Wed, 19 Nov 2025 14:15:00 +0000</pubDate>
      <guid isPermaLink="false">691c570b80bfe18f54ee1f26</guid>
      <description>The automaker has taken the covers off its Cayenne Electric and Cayenne Turbo Electric, the most powerful production Porsches ever. But it won&#8217;t confirm a key AI feature of its first fully electric SUV.</description>
    </item>
    <item>
      <title>Porsche crowns Cayenne Electric &#8216;most powerful production Porsche of all time&#8217;</title>
      <link>https://www.theverge.com/news/823329/porsche-cayenne-electric-turbo-specs-price-range</link>
      <pubDate>2025-11-19T09:15:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=823329</guid>
      <description>It&#8217;s no surprise that the Porsche Cayenne EV is a beast. Of course the famed German automaker would tout its all-electric SUV as &#8220;the most powerful,&#8221; the quickest &#8212; both off the line and in a charging stall &#8212; and record-setting in so many ways. The question remains: how beastly are we talking? Now, thankfully, [&#8230;]</description>
    </item>
    <item>
      <title>Adobe to acquire digital marketing platform Semrush for $1.9 billion</title>
      <link>https://www.theverge.com/news/823887/adobe-semrush-acquisition-digital-marketing</link>
      <pubDate>2025-11-19T09:14:57-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=823887</guid>
      <description>Adobe is acquiring the digital marketing platform Semrush for around $1.9 billion. In a press release on Wednesday, Adobe says the deal will allow it and Semrush to give marketers insight into how their brands appear across the web. The acquisition builds on Adobe&#8217;s existing suite of marketing tools that help businesses manage digital campaigns [&#8230;]</description>
    </item>
    <item>
      <title>How to cancel Surfshark and get a refund</title>
      <link>https://www.techradar.com/vpn/vpn-services/how-to-cancel-surfshark-and-get-a-refund</link>
      <pubDate>Wed, 19 Nov 2025 14:06:46 +0000</pubDate>
      <guid isPermaLink="false">rwzrkC93frxF2LPWA94tkE</guid>
      <description>Cancel auto-renewal and claim your money back - with no hassle</description>
    </item>
    <item>
      <title>Cloud and AI usage is still a concern for businesses - and the worries are only set to rise</title>
      <link>https://www.techradar.com/pro/cloud-and-ai-usage-is-still-a-concern-for-businesses-and-the-worries-are-only-set-to-rise</link>
      <pubDate>Wed, 19 Nov 2025 14:05:15 +0000</pubDate>
      <guid isPermaLink="false">8iRDoAYoKPC2BzXmn9zEoN</guid>
      <description>Public cloud might be favored more than on-prem, but both are just as at-risk of cyber incidents.</description>
    </item>
    <item>
      <title>XRP price keeps falling as digital tokens struggle to regain ground. What&#8217;s happening with crypto?</title>
      <link>https://www.fastcompany.com/91444912/xrp-price-today-why-is-it-falling-whats-happening-crypto</link>
      <pubDate>2025-11-19T14:03:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444912/xrp-price-today-why-is-it-falling-whats-happening-crypto</guid>
      <description>A selloff of cryptocurrencies has continued this week, due to broader economic concerns and longtime holders seeking to lock in profits while they can.
The cryptocurrency market is continuing to tumble as investors worry about risky assets, an AI and tech bubble, and a roughly 50% likelihood of the Federal Reserve cutting interest rates.&#160;</description>
    </item>
    <item>
      <title>Cdiscount encha&#238;ne les promotions avec l&#8217;arriv&#233;e du v&#233;ritable Black Friday : les 17 meilleures offres</title>
      <link>https://www.frandroid.com/bons-plans/2850059_cdiscount-pratique-des-prix-bien-bas-pour-le-pre-black-friday-voici-les-15-meilleurs-deals</link>
      <pubDate>Wed, 19 Nov 2025 14:00:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850059_cdiscount-pratique-des-prix-bien-bas-pour-le-pre-black-friday-voici-les-15-meilleurs-deals</guid>
      <description>
&#192; l'approche du Black Friday, Cdiscount multiplie les bonnes affaires. T&#233;l&#233;viseurs, ordinateurs portables, consoles de jeux et m&#234;me des forfaits mobiles&#8230; De nombreux produits tr&#232;s recherch&#233;s profitent de belles remises.
</description>
    </item>
    <item>
      <title>The 15 Best Soundbars We&#8217;ve Tested in 2025: Sonos, Sony, Bose</title>
      <link>https://www.wired.com/gallery/best-soundbars/</link>
      <pubDate>Wed, 19 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">5ba9532c0f3ae02cf6c58ef4</guid>
      <description>Every television deserves a row of speakers to call its own. These are our favorite soundbars.</description>
    </item>
    <item>
      <title>Security startup Guardio nabs $80M from ION Crossover Partners</title>
      <link>https://techcrunch.com/2025/11/19/security-startup-guardio-nabs-80m-from-ion-crossover-partners/</link>
      <pubDate>Wed, 19 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068285</guid>
      <description>Guardio is leveraging its experience building browser extensions and apps that scan for malicious and phishing sites to build a tool that looks for artifacts in code and websites made with vibe coding tools.</description>
    </item>
    <item>
      <title>These are the 15 best iPhone, iPad, Mac, Apple Watch and Apple TV apps of 2025, according to Apple</title>
      <link>https://www.techradar.com/computing/websites-apps/these-are-the-12-best-iphone-ipad-mac-apple-watch-and-apple-tv-apps-of-the-2025-according-to-apple</link>
      <pubDate>Wed, 19 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">oU7Jh8c88gzHbVo9ZTHDMR</guid>
      <description>Apple&#8217;s App Store Awards have honored the best apps of 2025 across Apple&#8217;s platforms &#8211;here are all the key winners.</description>
    </item>
    <item>
      <title>What is the release date for Pluribus episode 4 on Apple TV?</title>
      <link>https://www.techradar.com/streaming/apple-tv-plus/what-is-the-release-date-for-pluribus-episode-4-on-apple-tv</link>
      <pubDate>Wed, 19 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">J3Csdia8UbR2DYGqfxsd4C</guid>
      <description>Episode 4 of Apple's mystery sci-fi drama arrives later this week &#8211; here's when you can watch it.</description>
    </item>
    <item>
      <title>Microsoft reveals new plan to make your Windows 11 PC more stable and reliable &#8211; and help you recover from disasters</title>
      <link>https://www.techradar.com/computing/windows/microsoft-reveals-new-plan-to-make-your-windows-11-pc-more-stable-and-reliable-and-help-you-recover-from-disasters</link>
      <pubDate>Wed, 19 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">ZCxxmX5hGL5xWSFvGfXfH4</guid>
      <description>Microsoft is working on making Windows 11 more stable, though it's going to be a long road to that end goal.</description>
    </item>
    <item>
      <title>The age of intelligent real estate</title>
      <link>https://www.fastcompany.com/91444524/the-age-of-intelligent-real-estate</link>
      <pubDate>2025-11-19T14:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444524/the-age-of-intelligent-real-estate</guid>
      <description>Move from manual tasks to wise decisions.
Every industry eventually reaches its productivity era. Manufacturing&#160;had&#160;automation. Finance had algorithmic trading. Today, real estate is stepping into its own transformation: the age of intelligent decision&#160;making.&#160;</description>
    </item>
    <item>
      <title>Test de la ROG Xbox Ally X : une bonne console portable, mais une mauvaise Xbox</title>
      <link>https://www.frandroid.com/marques/microsoft/2830145_test-de-la-rog-xbox-ally-x-pourquoi-vous-devriez-attendre-avant-de-lacheter</link>
      <pubDate>Wed, 19 Nov 2025 13:56:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2830145_test-de-la-rog-xbox-ally-x-pourquoi-vous-devriez-attendre-avant-de-lacheter</guid>
      <description>
L'Asus ROG Xbox Ally X est l&#224; pour relancer la cat&#233;gorie des PC consoles portables. Mais h&#233;las, son lancement n'est pas aussi simple que pr&#233;vu...
</description>
    </item>
    <item>
      <title>Windows 11&#160;: Microsoft va enfin corriger cette aberration du calendrier</title>
      <link>https://www.01net.com/actualites/windows-11-microsoft-va-enfin-corriger-cette-aberration-du-calendrier.html</link>
      <pubDate>Wed, 19 Nov 2025 13:49:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309326</guid>
      <description>Le syst&#232;me d&#8217;exploitation de Microsoft profitera prochainement d&#8217;une mise &#224; jour qui introduira une nouveaut&#233; que plus personne n&#8217;attendait : un aper&#231;u complet du calendrier depuis le volet des notifications.</description>
    </item>
    <item>
      <title>Black Friday &#233;couteurs, casques et enceintes : voici les 12 meilleures offres sur l&#8217;audio des marques Nothing, Apple, Sony, Bose, JBL&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2849763_black-friday-ecouteurs-sans-fil-les-meilleures-offres-sur-tous-les-produits-audio</link>
      <pubDate>Wed, 19 Nov 2025 13:47:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849763_black-friday-ecouteurs-sans-fil-les-meilleures-offres-sur-tous-les-produits-audio</guid>
      <description>
&#201;couteurs Bluetooth, casques audio sans-fil, enceintes Bluetooth, plusieurs produits audio regroupent cette cat&#233;gorie. Nous avons s&#233;lectionn&#233; les meilleures offres du secteur. Vous y trouverez des AirPods, des produits JBL ou encore des casques de chez Sony.
</description>
    </item>
    <item>
      <title>CIOs are being lumped with AI responsibilities - and many of them aren't happy with that</title>
      <link>https://www.techradar.com/pro/cios-are-being-lumped-with-ai-responsibilities-and-many-of-them-arent-happy-with-that</link>
      <pubDate>Wed, 19 Nov 2025 13:46:31 +0000</pubDate>
      <guid isPermaLink="false">RGpFsMU9AhNpSiZmPqFUyX</guid>
      <description>While CIOs are OK with taking on AI responsibilities, they lack sufficient support, particularly when it comes to security.</description>
    </item>
    <item>
      <title>Early Black Friday sale: Samsung&#8217;s flagship 2TB 990 Pro SSD is what creative pros need - and costs just &#163;121</title>
      <link>https://www.techradar.com/pro/early-black-friday-sale-samsungs-flagship-2tb-990-pro-ssd-is-what-creative-pros-need-and-costs-just-gbp121</link>
      <pubDate>Wed, 19 Nov 2025 13:42:41 +0000</pubDate>
      <guid isPermaLink="false">uGkzLK7KV5x7q2sz2v7bGi</guid>
      <description>The 2TB Samsung 990 Pro SSD delivers read speeds up to 7,450MB/s, and it&#8217;s available for just &#163;121</description>
    </item>
  </channel>
</rss>
