<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 18 Nov 2025 08:54:06 GMT</lastBuildDate>
    <item>
      <title>Test du OnePlus 15 : il a tout d&#8217;un grand smartphone gaming, sauf le prix</title>
      <link>https://www.frandroid.com/marques/oneplus/2855373_test-du-oneplus-15-il-a-tout-dun-grand-smartphone-gaming-sauf-le-prix</link>
      <pubDate>Tue, 18 Nov 2025 08:45:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/oneplus/2855373_test-du-oneplus-15-il-a-tout-dun-grand-smartphone-gaming-sauf-le-prix</guid>
      <description>
Oubliez le OnePlus 13, son successeur rebat les cartes et s'inscrit sur le secteur des smartphones haut de gamme les plus performants, sans en avoir le prix.
</description>
    </item>
    <item>
      <title>Samsung Galaxy S26 Ultra : design, &#233;cran, fen&#234;tre de sortie, prix&#8230; Tout ce qu&#8217;on sait sur le futur smartphone</title>
      <link>https://www.frandroid.com/marques/samsung/2849839_samsung-galaxy-s26-ultra-design-ecran-fenetre-de-sortie-prix-tout-ce-quon-sait-sur-le-futur-smartphone</link>
      <pubDate>Tue, 18 Nov 2025 08:41:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2849839_samsung-galaxy-s26-ultra-design-ecran-fenetre-de-sortie-prix-tout-ce-quon-sait-sur-le-futur-smartphone</guid>
      <description>
Le Samsung Galaxy S26 Ultra approche petit &#224; petit, voici tout ce que l'on sait d&#233;j&#224; &#224; son sujet (fen&#234;tre de sortie, design, &#233;cran, performances, etc.).
</description>
    </item>
    <item>
      <title>La nomination de Clair Obscur: Expedition 33 dans cette cat&#233;gorie des Game Awards est une honte</title>
      <link>https://www.frandroid.com/produits-android/console/2872829_la-nomination-de-clair-obscur-expedition-33-dans-cette-categorie-des-game-awards-est-une-honte</link>
      <pubDate>Tue, 18 Nov 2025 08:36:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2872829_la-nomination-de-clair-obscur-expedition-33-dans-cette-categorie-des-game-awards-est-une-honte</guid>
      <description>
Le jeu Clair Obscur: Expedition 33 est sur le point de tout rafler aux Game Awards 2025. Au point de d&#233;border sur des cat&#233;gories franchement peu appropri&#233;es.
</description>
    </item>
    <item>
      <title>Comme Vinted, Leboncoin et Etsy sont inond&#233;s de contenus pornographiques</title>
      <link>https://www.01net.com/actualites/comme-vinted-leboncoin-et-etsy-sont-inondes-de-contenus-pornographiques.html</link>
      <pubDate>Tue, 18 Nov 2025 08:33:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308855</guid>
      <description>Des vendeurs d&#233;tournent Etsy et Leboncoin pour promouvoir des contenus pornographiques, mettant les plateformes en infraction avec la loi fran&#231;aise. La haute-commissaire &#224; l&#8217;Enfance s'est saisie du dossier en contactant l'Arcom.</description>
    </item>
    <item>
      <title>Apple va enfin vous permettre de remplacer Siri sur iPhone&#8230; &#224; une (importante) condition</title>
      <link>https://www.frandroid.com/marques/apple/2872779_apple-va-enfin-vous-permettre-de-remplacer-siri-sur-iphone-a-une-importante-condition</link>
      <pubDate>Tue, 18 Nov 2025 08:03:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2872779_apple-va-enfin-vous-permettre-de-remplacer-siri-sur-iphone-a-une-importante-condition</guid>
      <description>
Un temps chantre du contr&#244;le, Apple ouvre timidement son syst&#232;me d&#8217;exploitation &#224; la concurrence. La preuve avec la possibilit&#233; de remplacer Siri comme assistant par d&#233;faut&#8230; Si vous habitez au Japon.
</description>
    </item>
    <item>
      <title>Le bouton lat&#233;ral de l&#8217;iPhone pourra bient&#244;t lancer un autre assistant que Siri</title>
      <link>https://www.01net.com/actualites/le-bouton-lateral-de-liphone-pourra-bientot-lancer-un-autre-assistant-que-siri.html</link>
      <pubDate>Tue, 18 Nov 2025 08:02:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308823</guid>
      <description>Apple continue de peaufiner iOS 26, en ajoutant de nouvelles fonctions au fil de l'eau et des b&#234;tas. Et justement la troisi&#232;me b&#234;ta d'iOS 26.2, disponible depuis cette nuit pour les d&#233;veloppeurs, contient au moins deux nouveaut&#233;s tr&#232;s int&#233;ressantes.</description>
    </item>
    <item>
      <title>Black Friday des montres connect&#233;es : les smartwatches d&#8217;Apple, Garmin, Xiaomi, Samsung profitent de belles offres</title>
      <link>https://www.frandroid.com/bons-plans/2854639_top-offres-black-friday-montres-bracelets-connectes</link>
      <pubDate>Tue, 18 Nov 2025 08:00:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2854639_top-offres-black-friday-montres-bracelets-connectes</guid>
      <description>
Nous ne sommes que mi-novembre, mais les promotions d&#233;barquent avant l&#8217;heure. Ce pr&#233;-Black Friday met &#224; l&#8217;honneur les montres connect&#233;es et les bracelets, orient&#233;s sport ou lifestyle. Tour d&#8217;horizon des meilleures offres d&#233;j&#224; propos&#233;es par les e-commer&#231;ants pour s'offrir une smartwach &#224; prix cass&#233;.
</description>
    </item>
    <item>
      <title>The 39 Best Shows on Apple TV, WIRED&#8217;s Picks (November 2025)</title>
      <link>https://www.wired.com/story/best-apple-tv-plus-shows/</link>
      <pubDate>Tue, 18 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">63cf1b483f042fa5827033d7</guid>
      <description>Pluribus, The Morning Show, and Slow Horses are among the best shows on Apple TV this month.</description>
    </item>
    <item>
      <title>Mastodon CEO steps down as the social network restructures</title>
      <link>https://techcrunch.com/2025/11/18/mastodon-ceo-steps-down-as-the-social-network-restructures/</link>
      <pubDate>Tue, 18 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068367</guid>
      <description>Eugen Rochko is stepping down as CEO of decentralized social network Mastodon. Felix Hlatky will now become the Executive Director as the company become structured as a nonprofit government by a board.</description>
    </item>
    <item>
      <title>Top 10 AI chatbot do's and don&#8217;ts to help you get the most out of ChatGPT, Gemini, and more</title>
      <link>https://www.techradar.com/ai-platforms-assistants/top-10-ai-chatbot-dos-and-donts-to-help-you-get-the-most-out-of-chatgpt-gemini-and-more</link>
      <pubDate>Tue, 18 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">WToBaVSP6YHerJtjvf8R9Y</guid>
      <description>AI Chatbots aren't good at everything. Here are the top 10 do's and don't when using a chatbot.</description>
    </item>
    <item>
      <title>Pour le pr&#233;-Black Friday, Darty fait -46 % sur le Xgimi Horizon Pro 4K, un vid&#233;oprojecteur premium avec Android TV</title>
      <link>https://www.frandroid.com/bons-plans/2871441_pour-le-pre-black-friday-darty-fait-46-sur-le-xgimi-horizon-pro-4k-un-videoprojecteur-premium-avec-android-tv</link>
      <pubDate>Tue, 18 Nov 2025 07:55:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2871441_pour-le-pre-black-friday-darty-fait-46-sur-le-xgimi-horizon-pro-4k-un-videoprojecteur-premium-avec-android-tv</guid>
      <description>
Le Xgimi Horizon Pro 4K est un vid&#233;oprojecteur premium &#233;qup&#233; de haut-parleurs Harman Kardon. Avec Android TV, une image de 200 pouces max pour 699,99 euros au lieu de  1299 euros, il est vraiment int&#233;ressant.
</description>
    </item>
    <item>
      <title>Manettes de jeux et Android 17, les nouveaux meilleurs amis</title>
      <link>https://www.frandroid.com/actualites-generales/2872789_manettes-de-jeux-et-android-17-les-nouveaux-meilleurs-amis</link>
      <pubDate>Tue, 18 Nov 2025 07:50:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2872789_manettes-de-jeux-et-android-17-les-nouveaux-meilleurs-amis</guid>
      <description>
Jouer sur son smartphone peut parfois relever du d&#233;fi surtout pour des jeux &#233;volu&#233;s. Android 17 pourrait proposer une reconfiguration des boutons des manettes de jeux et un gamepad virtuel. On vous explique tout.
</description>
    </item>
    <item>
      <title>Grosse hausse des prix &#224; pr&#233;voir sur les smartphones et les ordinateurs portables en 2026</title>
      <link>https://www.01net.com/actualites/grosse-hausse-des-prix-a-prevoir-sur-les-smartphones-et-les-ordinateurs-portables-en-2026.html</link>
      <pubDate>Tue, 18 Nov 2025 07:30:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308780</guid>
      <description>Les prix des smartphones et des ordinateurs portables ne sont pas pr&#232;s de reculer. Bien au contraire ! Les co&#251;ts de plusieurs composants critiques &#8212; stockage, m&#233;moire vive &#8212; sont en forte progression en raison des &#233;normes besoins de l'IA et d'un contexte &#233;conomique mondial compliqu&#233;. R&#233;sultat : il faut s'attendre &#224; une surchauffe des &#233;tiquettes d&#232;s l'ann&#233;e prochaine....</description>
    </item>
    <item>
      <title>Les Motorola Moto Buds Bass, pas de son by Bose mais une fiche technique solide</title>
      <link>https://www.frandroid.com/marques/motorola/2872761_les-motorola-moto-buds-bass-pas-de-son-by-bose-mais-une-fiche-technique-solide</link>
      <pubDate>Tue, 18 Nov 2025 07:23:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/motorola/2872761_les-motorola-moto-buds-bass-pas-de-son-by-bose-mais-une-fiche-technique-solide</guid>
      <description>
Pour un large public, Motorola propose d&#233;sormais les &#233;couteurs Moto Buds Bass qui misent sur un son puissant, une endurance remarquable et des fonctionnalit&#233;s avanc&#233;es dont la r&#233;duction dynamique des bruits ambiants.
</description>
    </item>
    <item>
      <title>Le Bitcoin coule sous les 90&#160;000 dollars&#160;: les sp&#233;culateurs perdent une fortune</title>
      <link>https://www.01net.com/actualites/bitcoin-coule-sous-90-000-dollars-speculateurs-perdent-fortune.html</link>
      <pubDate>Tue, 18 Nov 2025 07:22:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308838</guid>
      <description>Le Bitcoin continue sa descente. Apr&#232;s avoir d&#233;pass&#233; les 125 000 dollars, la cryptomonnaie num&#233;ro un du march&#233; s'enfonce d&#233;sormais sous la barre des 90 000 dollars. Au cours de cette nouvelle d&#233;gringolade, les sp&#233;culateurs ont perdu plus d'un milliard de dollars en une seule journ&#233;e.</description>
    </item>
    <item>
      <title>Avec Gemini 3, Google voudrait rendre ChatGPT &#171;&#160;obsol&#232;te&#160;&#187;</title>
      <link>https://www.01net.com/actualites/gemini-3-serait-pret-rendre-chatgpt-obsolete.html</link>
      <pubDate>Tue, 18 Nov 2025 07:16:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308721</guid>
      <description>Google s&#8217;appr&#234;terait &#224; bouleverser &#224; nouveau le secteur de l'IA avec le lancement imminent de Gemini 3.0. En coulisses, des employ&#233;s de Google, des testeurs et m&#234;me Sundar Pichai alimentent le suspense, tandis que les premiers retours &#233;voquent une IA capable de rel&#233;guer tous ses rivaux au second plan.</description>
    </item>
    <item>
      <title>Waylibus, le bus scolaire retenu par l&#8217;&#201;lys&#233;e qui fonctionne comme un v&#233;lo &#233;lectrique collectif</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2871229_waylibus-le-bus-scolaire-retenu-par-lelysee-qui-fonctionne-comme-un-velo-electrique-collectif</link>
      <pubDate>Tue, 18 Nov 2025 07:12:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2871229_waylibus-le-bus-scolaire-retenu-par-lelysee-qui-fonctionne-comme-un-velo-electrique-collectif</guid>
      <description>
Le Waylibus est la cr&#233;ation de la startup rouennaise Human-Mob, un bus &#233;lectrique collectif qui fonctionne comme un v&#233;lo &#233;lectrique, o&#249; les &#233;coliers peuvent recharger en roulant, avec m&#234;me une version professionnelle de type cargo.
</description>
    </item>
    <item>
      <title>Pr&#233;-Black Friday de qualit&#233; avec -30 % sur le Nothing Phone (3), un r&#233;cent smartphone premium au design unique</title>
      <link>https://www.frandroid.com/bons-plans/2871751_pre-black-friday-de-qualite-avec-30-sur-le-nothing-phone-3-un-recent-smartphone-premium-au-design-unique</link>
      <pubDate>Tue, 18 Nov 2025 07:11:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2871751_pre-black-friday-de-qualite-avec-30-sur-le-nothing-phone-3-un-recent-smartphone-premium-au-design-unique</guid>
      <description>
Le Nothing Phone (3) est une vraie &#233;volution en la mati&#232;re, avec une nouvelle version de l'interface Glyph et des performances solides, &#224; retrouver pour 599 euros au lieu de 849,95 euros.
</description>
    </item>
    <item>
      <title>Google Agenda ajoute enfin cette option attendue de longue date</title>
      <link>https://www.01net.com/actualites/google-agenda-ajoute-option-attendue-longue-date.html</link>
      <pubDate>Tue, 18 Nov 2025 07:01:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308829</guid>
      <description>Google Agenda va enfin vous permettre de bloquer du temps pour vos t&#226;ches sans avoir &#224; bricoler de faux rendez-vous. Une nouveaut&#233; que beaucoup d&#8217;utilisateurs r&#233;clamaient.</description>
    </item>
    <item>
      <title>If you haven&#8217;t failed big, you aren&#8217;t ready to lead</title>
      <link>https://www.fastcompany.com/91433706/if-you-havent-failed-big-you-arent-ready-to-lead</link>
      <pubDate>2025-11-18T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91433706/if-you-havent-failed-big-you-arent-ready-to-lead</guid>
      <description>The best leaders aren&#8217;t those who never fall, but those who learn to rise again with humility, empathy, and purpose.
The most enduring leaders aren&#8217;t the ones with flawless r&#233;sum&#233;s. They&#8217;re the ones who&#8217;ve been tested, humbled, and reshaped by failure.</description>
    </item>
    <item>
      <title>In leadership, you get what you expect</title>
      <link>https://www.fastcompany.com/91433825/in-leadership-you-get-what-you-expect</link>
      <pubDate>2025-11-18T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91433825/in-leadership-you-get-what-you-expect</guid>
      <description>Expectations have an uncanny way of turning into real, measurable effects on human behavior. Here&#8217;s why it matters for managers.
It&#8217;s been 70 years since Douglas McGregor sketched a management theory at MIT Sloan that leaders still ignore&#8212;and their teams pay the price.</description>
    </item>
    <item>
      <title>Huawei Mate 80 : reconnaissance faciale 3D, 20 Go de RAM, &#233;cran plat et puce Kirin 9030 Pro d&#233;voil&#233;s</title>
      <link>https://www.frandroid.com/marques/huawei/2872735_huawei-mate-80-reconnaissance-faciale-3d-20-go-de-ram-ecran-plat-et-puce-kirin-9030-pro-devoiles</link>
      <pubDate>Tue, 18 Nov 2025 06:58:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/huawei/2872735_huawei-mate-80-reconnaissance-faciale-3d-20-go-de-ram-ecran-plat-et-puce-kirin-9030-pro-devoiles</guid>
      <description>
Huawei d&#233;voile enfin sa s&#233;rie Mate 80. Au programme : &#233;cran plat, reconnaissance faciale 3D sur la version standard, et une puce Kirin 9030 Pro dont la densit&#233; de transistors d&#233;passerait celle du 3 nm de TSMC. 
</description>
    </item>
  </channel>
</rss>
