<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 20 Nov 2025 08:52:54 GMT</lastBuildDate>
    <item>
      <title>Vous allez vraiment utiliser le calendrier de Windows 11 apr&#232;s cette mise &#224; jour</title>
      <link>https://www.frandroid.com/os/windows/2877491_la-nouvelle-vue-calendrier-de-windows-11-va-vous-simplifier-la-vie</link>
      <pubDate>Thu, 20 Nov 2025 08:52:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/windows/2877491_la-nouvelle-vue-calendrier-de-windows-11-va-vous-simplifier-la-vie</guid>
      <description>
La vue calendrier de Windows 11 va bient&#244;t ressembler &#224; celle de Windows 10. Une mise &#224; jour bienvenue qui arrivera tr&#232;s prochainement.
</description>
    </item>
    <item>
      <title>T&#233;l&#233;chargez Frandroid Check : le comparateur de prix et de tests int&#233;gr&#233; &#224; votre navigateur</title>
      <link>https://www.frandroid.com/humanoid/2877567_telechargez-frandroid-check-le-comparateur-de-prix-et-de-tests-integre-a-votre-navigateur</link>
      <pubDate>Thu, 20 Nov 2025 08:50:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/2877567_telechargez-frandroid-check-le-comparateur-de-prix-et-de-tests-integre-a-votre-navigateur</guid>
      <description>
Le Black Friday arrive et avec lui, son lot de fausses promotions et de produits douteux. On a d&#233;cid&#233; d'agir. Voici Frandroid Check, notre extension navigateur maison. L'extension s'affiche directement sur les sites marchands pour vous donner le test du produit et son vrai prix. C'est gratuit, et &#231;a change tout.
</description>
    </item>
    <item>
      <title>Smartphones Samsung, Apple, Google, Nothing&#8230; notre s&#233;lection des meilleures offres de la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2848295_black-friday-week-sur-les-smartphones-voici-les-meilleures-promotions-pour-les-iphone-17-google-pixel-10-et-galaxy-s25</link>
      <pubDate>Thu, 20 Nov 2025 08:45:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848295_black-friday-week-sur-les-smartphones-voici-les-meilleures-promotions-pour-les-iphone-17-google-pixel-10-et-galaxy-s25</guid>
      <description>
La Black Friday Week bat son plein ! Les &#233;tals des e-commer&#231;ants ne d&#233;semplissent pas de r&#233;ductions en tout genre. Nous avons rassembl&#233; ici les meilleures offres disponibles pour les smartphones premium. 
</description>
    </item>
    <item>
      <title>Le Motorola Moto g05 passe au stand chez Amazon et perd 32 % pour la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2876799_le-motorola-moto-g05-passe-au-stand-chez-amazon-et-perd-32-pour-la-black-friday-week</link>
      <pubDate>Thu, 20 Nov 2025 08:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2876799_le-motorola-moto-g05-passe-au-stand-chez-amazon-et-perd-32-pour-la-black-friday-week</guid>
      <description>
Sur le march&#233; des smartphones d'entr&#233;e de gamme, le Motorola Moto g05 commence &#224; faire son trou et Amazon vous propose de le d&#233;couvrir pour 129,99 euros au lieu de 189,99 euros.
</description>
    </item>
    <item>
      <title>Huawei MatePad Pro : cette concurrente de l&#8217;iPad Pro perd 350 &#8364; de son prix pendant la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2876733_huawei-matepad-pro-cette-concurrente-de-lipad-pro-perd-350-e-de-son-prix-pendant-la-black-friday-week</link>
      <pubDate>Thu, 20 Nov 2025 08:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2876733_huawei-matepad-pro-cette-concurrente-de-lipad-pro-perd-350-e-de-son-prix-pendant-la-black-friday-week</guid>
      <description>
Les tablettes qui cherchent &#224; marcher sur les plates bandes de l'iPad Pro ne sont pas l&#233;gion, et peu arrive &#224; son port USB-C. Huawei malgr&#233; tout s'essaye &#224; ce jeu avec sa nouvelle MatePad Pro. Au menu, de la puissance, de l'OLED, une autonomie XXL, et un clavier fourni pour un tarif agressif, et encore plus lors du Black Friday. La tablette est affich&#233;e &#224; 849 euros au lieu de 1 199 euros sur Amazon.
...</description>
    </item>
    <item>
      <title>Jeff Bezos reprend du service au sein d&#8217;une start-up sp&#233;cialis&#233;e en IA</title>
      <link>https://www.01net.com/actualites/jeff-bezos-reprend-du-service-au-sein-dune-start-up-specialisee-en-ia.html</link>
      <pubDate>Thu, 20 Nov 2025 08:22:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309253</guid>
      <description>Jeff Bezos devient co-directeur d&#8217;une start-up baptis&#233;e Project Prometheus, l'entreprise souhaite utiliser l'intelligence artificielle pour am&#233;liorer la fabrication d'ordinateurs, de voitures et d'engins spatiaux.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs smartphones &#224; moins de 300 euros en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/smartphones/276805_les-meilleurs-smartphones-a-moins-de-300-euros-en-2017</link>
      <pubDate>Thu, 20 Nov 2025 08:20:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/smartphones/276805_les-meilleurs-smartphones-a-moins-de-300-euros-en-2017</guid>
      <description>
Quel t&#233;l&#233;phone choisir pour un budget r&#233;duit ? Dans ce guide des meilleurs smartphones &#224; moins de 300 euros, nous avons s&#233;lectionn&#233; plusieurs mod&#232;les qui correspondent &#224; ces crit&#232;res. 
</description>
    </item>
    <item>
      <title>Le plus beau PC Windows est en promo pour le Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/bons-plans-pc-portable/2877521_le-plus-beau-pc-windows-est-en-promo-pour-le-black-friday</link>
      <pubDate>Thu, 20 Nov 2025 08:17:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/bons-plans-pc-portable/2877521_le-plus-beau-pc-windows-est-en-promo-pour-le-black-friday</guid>
      <description>
On conna&#238;t la chanson : le Dell XPS 13 est magnifique, mais toujours trop cher &#224; sa sortie. Sauf qu'Amazon vient de le faire passer sous la barre des 1 250 euros, et l&#224;, le discours change radicalement pour ce Black Friday.
</description>
    </item>
    <item>
      <title>Le DJI Avata 2, accompagn&#233; du casque Goggles 3 et du stabilisateur RC Motion 3, s&#8217;envole et perd 150 &#8364; pour la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2876287_le-dji-avata-2-accompagne-du-casque-goggles-3-et-du-stabilisateur-rc-motion-3-senvole-et-perd-150-e-pour-la-black-friday-week</link>
      <pubDate>Thu, 20 Nov 2025 08:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2876287_le-dji-avata-2-accompagne-du-casque-goggles-3-et-du-stabilisateur-rc-motion-3-senvole-et-perd-150-e-pour-la-black-friday-week</guid>
      <description>
En cette p&#233;riode de Black Friday Week, la Fnac baisse le prix de son pack contenant le DJI Avata 2, le casque Goggles 3 et le stabilisateur RC Motion 3 et l'affiche &#224; 849 euros au lieu de 999 euros. 
</description>
    </item>
    <item>
      <title>Windows 11&#160;: Nvidia confirme une baisse des performances en gaming caus&#233;e par la mise &#224; jour d&#8217;octobre</title>
      <link>https://www.01net.com/actualites/windows-11-nvidia-confirme-une-baisse-des-performances-en-gaming-causee-par-la-mise-a-jour-doctobre.html</link>
      <pubDate>Thu, 20 Nov 2025 08:11:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309517</guid>
      <description>Nvidia vient de confirmer une baisse de performances sous Windows 11 caus&#233;e par la mise &#224; jour d&#8217;octobre. Le fabricant vient de publier un pilote correctif pour ses cartes graphiques.</description>
    </item>
    <item>
      <title>How to move from ChatGPT to Claude (without starting from scratch)</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/how-to-move-from-chatgpt-to-claude-without-starting-from-scratch</link>
      <pubDate>Thu, 20 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">Z9QzjfLhjns52z7L8s4gQF</guid>
      <description>Here's how to transfer the helpful context ChatGPT has learned about you to Claude.</description>
    </item>
    <item>
      <title>Prime Video&#8217;s streaming add-on sale is now bigger than ever &#8211; here are the 31 unmissable deals I&#8217;d recommend</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/prime-videos-streaming-add-on-sale-is-now-bigger-than-ever-here-are-the-31-unmissable-deals-id-recommend</link>
      <pubDate>Thu, 20 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">q9jCvAvqyh3MsNpSos2bYF</guid>
      <description>Great news Prime Video subscribers! There are 31 new Prime Video channel deals for as low as $0.99 available right now.</description>
    </item>
    <item>
      <title>La nouvelle Amazon Echo Dot Max conna&#238;t sa premi&#232;re promotion &#224; l&#8217;occasion de la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2875799_la-nouvelle-amazon-echo-dot-max-connait-sa-premiere-promotion-a-loccasion-de-la-black-friday-week</link>
      <pubDate>Thu, 20 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2875799_la-nouvelle-amazon-echo-dot-max-connait-sa-premiere-promotion-a-loccasion-de-la-black-friday-week</guid>
      <description>
Amazon profite de cette Black Friday Week pour offrir une premi&#232;re promotion &#224; sa nouvelle enceinte, l'Echo Dot Max. Elle passe de 109 euros &#224; 99 euros.
</description>
    </item>
    <item>
      <title>Tiktok&#160;: Il est d&#233;sormais possible de d&#233;sactiver la lecture de vid&#233;os g&#233;n&#233;r&#233;es par IA</title>
      <link>https://www.01net.com/actualites/tiktok-il-est-desormais-possible-de-desactiver-la-lecture-de-videos-generees-par-ia.html</link>
      <pubDate>Thu, 20 Nov 2025 07:58:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309298</guid>
      <description>L&#8217;application TikTok, utilis&#233;e par 1,4 milliard de personnes dans le monde, introduit une nouvelle option visant &#224; r&#233;guler la quantit&#233; de vid&#233;os g&#233;n&#233;r&#233;es par intelligence artificielle dans son flux d&#8217;actualit&#233;.</description>
    </item>
    <item>
      <title>Jusqu&#8217;&#224; -400&#8364; : Dangbei casse les prix de ses projecteurs home cin&#233;ma premium [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/tv-connectee-produits/projecteur/2874119_jusqua-400e-dangbei-casse-les-prix-de-ses-projecteurs-home-cinema-premium</link>
      <pubDate>Thu, 20 Nov 2025 07:53:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/tv-connectee-produits/projecteur/2874119_jusqua-400e-dangbei-casse-les-prix-de-ses-projecteurs-home-cinema-premium</guid>
      <description>
Le Black Friday est d&#233;finitivement le meilleur moment pour acheter un vid&#233;oprojecteur. R&#233;f&#233;rence en la mati&#232;re, Dangbei r&#233;duit consid&#233;rablement le prix de ses vid&#233;oprojecteurs laser. D&#232;s 169 euros, vous pouvez acc&#233;der &#224; un vid&#233;oprojecteur compact, lumineux et directement pr&#234;t &#224; l&#8217;emploi, sans r&#233;glages compliqu&#233;s.
</description>
    </item>
    <item>
      <title>40% Off Chewy Promo Code | November 2025</title>
      <link>https://www.wired.com/story/chewy-promo-code/</link>
      <pubDate>Thu, 20 Nov 2025 07:50:00 +0000</pubDate>
      <guid isPermaLink="false">674f80033ffc1b7f03c85b6b</guid>
      <description>Explore Chewy coupon codes for 20% off pet food with early Black Friday deals, a $20 gift card on your first purchase, buy 3 get 1 free offers and more.</description>
    </item>
    <item>
      <title>Le r&#233;cent Sony Xperia 10 VII est de retour en promo &#224; l&#8217;occasion de la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2876123_le-recent-sony-xperia-10-vii-est-de-retour-en-promo-a-loccasion-de-la-black-friday-week</link>
      <pubDate>Thu, 20 Nov 2025 07:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2876123_le-recent-sony-xperia-10-vii-est-de-retour-en-promo-a-loccasion-de-la-black-friday-week</guid>
      <description>
Les promotions pleuvent sur le march&#233; des smartphones &#224; l'approche du Black Friday, et aujourd'hui, c'est le Sony Xperia 10 VII qui en profite. Ce r&#233;cent mod&#232;le milieu de gamme, qui b&#233;n&#233;ficie de plusieurs am&#233;liorations, est actuellement propos&#233; &#224; 379 euros au lieu de 449 euros sur Amazon.
</description>
    </item>
    <item>
      <title>Le Fran&#231;ais le plus connu de Facebook quitte Meta apr&#232;s 12 ans de service</title>
      <link>https://www.01net.com/actualites/francais-plus-connu-facebook-quitte-meta-apres-12-ans-service.html</link>
      <pubDate>Thu, 20 Nov 2025 07:42:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309502</guid>
      <description>Yann LeCun, pionnier mondial de l&#8217;intelligence artificielle, tourne la page Meta. Apr&#232;s douze ann&#233;es de service, il quitte le navire pour fonder sa propre start-up d&#233;di&#233;e &#224; l'IA. Derri&#232;re ce d&#233;part, on trouve des d&#233;saccords profonds avec la nouvelle direction prise par Meta et sa course effr&#233;n&#233;e aux mod&#232;les de langage. Le scientifique ambitionne d&#233;sormais de concevoir une IA vraiment intelligente qui soit capable de comprendre le monde r&#233;el....</description>
    </item>
    <item>
      <title>Amazon Prime Video lance des r&#233;sum&#233;s de s&#233;ries g&#233;n&#233;r&#233;s par l&#8217;IA&#8239;: voici comment &#231;a marche</title>
      <link>https://www.frandroid.com/marques/amazon/2877395_amazon-prime-video-lance-des-resumes-de-series-generes-par-lia-voici-comment-ca-marche</link>
      <pubDate>Thu, 20 Nov 2025 07:41:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazon/2877395_amazon-prime-video-lance-des-resumes-de-series-generes-par-lia-voici-comment-ca-marche</guid>
      <description>
La plateforme de streaming d'Amazon va proposer &#224; ses utilisateurs d'acc&#233;der &#224; des r&#233;capitulatifs de s&#233;ries g&#233;n&#233;r&#233;s par intelligence artificielle. 
</description>
    </item>
    <item>
      <title>Chrome se dote enfin d&#8217;une fonctionnalit&#233; que toute la concurrence avait d&#233;j&#224;</title>
      <link>https://www.frandroid.com/marques/google/2877461_chrome-se-dote-enfin-dune-fonctionnalite-que-toute-la-concurrence-avait-deja</link>
      <pubDate>Thu, 20 Nov 2025 07:39:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2877461_chrome-se-dote-enfin-dune-fonctionnalite-que-toute-la-concurrence-avait-deja</guid>
      <description>
La derni&#232;re version b&#234;ta du navigateur Google Chrome propose enfin d&#8217;activer les onglets verticaux pour gagner de la place sur PC. Pas trop t&#244;t alors que Firefox, Edge et Vivaldi proposent d&#233;j&#224; cette fonctionnalit&#233;.
</description>
    </item>
    <item>
      <title>Polestar int&#232;gre l&#8217;IA Google Gemini dans toutes ses voitures &#233;lectriques</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2877463_polestar-integre-lia-google-gemini-dans-toutes-ses-voitures-electriques</link>
      <pubDate>Thu, 20 Nov 2025 07:33:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2877463_polestar-integre-lia-google-gemini-dans-toutes-ses-voitures-electriques</guid>
      <description>
Vous trouviez Google Assistant un peu limit&#233; dans votre voiture ? Polestar et Google ont la solution. Le constructeur su&#233;dois, tout juste install&#233; en France, va int&#233;grer Gemini &#224; toute sa gamme. Mais attention, ne soyez pas trop press&#233;s : cette intelligence artificielle conversationnelle n'arrivera pas avant un moment.
</description>
    </item>
    <item>
      <title>Nokia mise tout sur l&#8217;IA et taille dans ses effectifs en France</title>
      <link>https://www.01net.com/actualites/nokia-mise-tout-sur-lia-et-taille-dans-ses-effectifs-en-france.html</link>
      <pubDate>Thu, 20 Nov 2025 07:30:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309429</guid>
      <description>Branle-bas de combat chez Nokia. Le g&#233;ant finlandais des t&#233;l&#233;coms a annonc&#233; une r&#233;organisation de ses activit&#233;s&#8230; et confirm&#233; une nouvelle charrette de licenciements en France. Le tout sur fond d'investissements dans l'IA.</description>
    </item>
    <item>
      <title>30% Off Samsung Promo Code | November 2025</title>
      <link>https://www.wired.com/story/samsung-promo-codes/</link>
      <pubDate>Thu, 20 Nov 2025 07:30:00 +0000</pubDate>
      <guid isPermaLink="false">6682a4c73029f65bb234b2d6</guid>
      <description>Save 30% or 10% with Samsung coupon codes, up to $2,100 on appliances, plus Black Friday deals on the Galaxy Z Fold7, Flip7, and S25.</description>
    </item>
    <item>
      <title>How to deal with annoying peers</title>
      <link>https://www.fastcompany.com/91443746/how-to-deal-with-annoying-peers</link>
      <pubDate>2025-11-20T07:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91443746/how-to-deal-with-annoying-peers</guid>
      <description>And each situation is far from one size fits all.
Colleagues are a critical part of what makes your work experience enjoyable and meaningful. You interact with your colleagues and (in the best of cases) create a&#160;neighborhood&#160;of peers that you can rely on both to push the work forward and to share the joys and tribulations of the workday.</description>
    </item>
    <item>
      <title>La microSD Samsung Pro Plus de 1 To est &#224; -58 % pour la Black Friday Week sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2875119_la-microsd-samsung-pro-plus-de-1-to-est-a-58-pour-la-black-friday-week-sur-amazon</link>
      <pubDate>Thu, 20 Nov 2025 07:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2875119_la-microsd-samsung-pro-plus-de-1-to-est-a-58-pour-la-black-friday-week-sur-amazon</guid>
      <description>
Pour augmenter de mani&#232;re significative la capacit&#233; de stockage de vos appareils, Amazon casse le prix de la Samsung MicroSDXC, PRO Plus. Elle passe de 179,99 euros &#224; 75,99 euros.
</description>
    </item>
    <item>
      <title>La puce N1 des iPhone 17 surprend tout le monde</title>
      <link>https://www.01net.com/actualites/la-puce-n1-des-iphone-17-surprend-tout-le-monde.html</link>
      <pubDate>Thu, 20 Nov 2025 07:14:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309425</guid>
      <description>Apple a r&#233;ussi son coup avec la puce N1 des iPhone 17. Pour une premi&#232;re g&#233;n&#233;ration de puce Wi-Fi maison, les r&#233;sultats sont &#233;tonnamment solides, surtout dans les conditions de connexion difficiles alors m&#234;me que ses caract&#233;ristiques sont plus modestes que celles des meilleurs composants de Broadcom, Qualcomm ou MediaTek.</description>
    </item>
    <item>
      <title>Can business schools really prepare students for a world of AI? Stanford thinks so</title>
      <link>https://www.fastcompany.com/91444164/can-business-schools-really-prepare-students-for-a-world-of-ai-stanford-thinks-so</link>
      <pubDate>2025-11-20T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444164/can-business-schools-really-prepare-students-for-a-world-of-ai-stanford-thinks-so</guid>
      <description>The new dean of its business school says that AI is going to be a core part of its DNA moving forward.
Business leaders are scrambling to understand the fast-moving world of artificial intelligence. But if companies are struggling to keep up, can today&#8217;s business schools really prepare students for a new landscape that&#8217;s unfolding in real time out in the real world?...</description>
    </item>
    <item>
      <title>YouTube relance les messages priv&#233;s, mais seuls deux pays peuvent en profiter</title>
      <link>https://www.01net.com/actualites/youtube-teste-retour-fonction-tres-demandee.html</link>
      <pubDate>Thu, 20 Nov 2025 06:59:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309489</guid>
      <description>YouTube teste le retour des messages priv&#233;s dans son application mobile. La fonction r&#233;appara&#238;t dans deux pays europ&#233;ens, mais seuls quelques utilisateurs peuvent pour l&#8217;instant mettre la main dessus.</description>
    </item>
  </channel>
</rss>
