<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 13 Jan 2026 17:30:40 GMT</lastBuildDate>
    <item>
      <title>Thousands of n8n instances under threat from top security issue</title>
      <link>https://www.techradar.com/pro/security/thousands-of-n8n-instances-under-threat-from-top-security-issue</link>
      <pubDate>Tue, 13 Jan 2026 17:25:00 +0000</pubDate>
      <guid isPermaLink="false">Wxe9mJBWUvRRuRrhm8fHHT</guid>
      <description>Despite being patched weeks ago, Ni8mare is still plaguing almost 60,000 instances, new data claims.</description>
    </item>
    <item>
      <title>AI music is flooding Spotify, and subscribers are furious &#8212; here&#8217;s why music fans 'no longer trust Discover Weekly'</title>
      <link>https://www.techradar.com/audio/spotify/ai-music-is-flooding-spotify-and-subscribers-are-furious-heres-why-music-fans-no-longer-trust-discover-weekly</link>
      <pubDate>Tue, 13 Jan 2026 17:23:04 +0000</pubDate>
      <guid isPermaLink="false">7L3wvEt75WaQ3KxCSUJkm7</guid>
      <description>Have you noticed AI-generated music in Spotify? These users have, and they're done with it.</description>
    </item>
    <item>
      <title>Battlefield 6 Season One has just been extended with new bonus rewards to 'allow extra time to further develop and refine Season 2 as a result of community feedback'</title>
      <link>https://www.techradar.com/gaming/battlefield-6-season-one-has-just-been-extended-with-new-bonus-rewards-to-allow-extra-time-to-further-develop-and-refine-season-2-as-a-result-of-community-feedback</link>
      <pubDate>Tue, 13 Jan 2026 17:15:50 +0000</pubDate>
      <guid isPermaLink="false">DqiGjV9EibEXE6YJ9DwnPT</guid>
      <description>Battlefield 6 players will now have longer to complete the Season One battle pass as developer Battlefield Studios announces its extension.</description>
    </item>
    <item>
      <title>Neo humanoid maker 1X releases world model&#160;to help bots&#160;learn what they see</title>
      <link>https://techcrunch.com/2026/01/13/neo-humanoid-maker-1x-releases-world-model-to-help-bots-learn-what-they-see/</link>
      <pubDate>Tue, 13 Jan 2026 17:14:08 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3082127</guid>
      <description>1X released a new world model that it says is a solid step toward its robots being able to teach themselves new tasks.</description>
    </item>
    <item>
      <title>A new 'more interactive' Hellblade is reportedly in the works, but Ninja Theory is no longer working on its 'experimental' Project Mara title</title>
      <link>https://www.techradar.com/gaming/a-new-more-interactive-hellblade-is-reportedly-in-the-works-but-ninja-theory-is-no-longer-working-on-its-experimental-project-mara-title</link>
      <pubDate>Tue, 13 Jan 2026 17:10:49 +0000</pubDate>
      <guid isPermaLink="false">mDwoLcDq4neWukRfYwQdZ</guid>
      <description>A new report claims that Ninja Theory is no longer working on Project Mara and is, instead, now developing a third installment in its Hellblade series.</description>
    </item>
    <item>
      <title>Fnac et Darty vendent au rabais de nombreux produits Tech lors des soldes d&#8217;hiver 2026</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-vendent-au-rabais-de-nombreux-produits-tech-lors-des-soldes-dhiver-2026</link>
      <pubDate>Tue, 13 Jan 2026 17:10:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-vendent-au-rabais-de-nombreux-produits-tech-lors-des-soldes-dhiver-2026</guid>
      <description>
&#192; la veille de la 2e d&#233;marque des soldes, Fnac et Darty fait le plein d'offres : on trouve des smartphones premium en pack &#224; prix cass&#233;, des TV &#224; moiti&#233; prix ou encore des laptops performants en r&#233;duction. D&#233;couvrez toutes les offres qui valent le coup. 
</description>
    </item>
    <item>
      <title>Boulanger d&#233;gaine d&#233;j&#224; ses meilleures offres avant la 2e d&#233;marque des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2931541_boulanger-degaine-deja-ses-meilleures-offres-avant-la-2e-demarque-des-soldes</link>
      <pubDate>Tue, 13 Jan 2026 17:06:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931541_boulanger-degaine-deja-ses-meilleures-offres-avant-la-2e-demarque-des-soldes</guid>
      <description>
Les soldes d&#8217;hiver battent leur plein et la deuxi&#232;me d&#233;marque pointe d&#233;j&#224; le bout de son nez. Chez Boulanger, les bonnes affaires s&#8217;encha&#238;nent avec une pluie de r&#233;ductions sur une large s&#233;lection de produits Tech. On a parcouru le site pour vous d&#233;nicher les meilleurs bons plans &#224; ne surtout pas manquer.
</description>
    </item>
    <item>
      <title>Ce que Siri pourra faire gr&#226;ce &#224; Gemini</title>
      <link>https://www.01net.com/actualites/ce-que-siri-pourra-faire-grace-a-gemini.html</link>
      <pubDate>Tue, 13 Jan 2026 17:03:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319837</guid>
      <description>Gemini sera donc le nouveau cerveau de Siri. Apple fait en effet appel &#224; Google et &#224; ses mod&#232;les IA comme base pour les futures fonctions d'Apple Intelligence, et l'assistant sera un des premiers &#224; en profiter. Reste &#224; savoir pour quoi faire, et quelle sera la place de ChatGPT dans tout &#231;a &#8212; car le bot d'OpenAI est d&#233;j&#224; embarqu&#233; dans Siri&#8230;</description>
    </item>
    <item>
      <title>Amazon lance une vague de promotions juste avant la 2e d&#233;marque des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2933045_amazon-lance-une-vague-de-promotions-juste-avant-la-2e-demarque-des-soldes</link>
      <pubDate>Tue, 13 Jan 2026 17:02:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933045_amazon-lance-une-vague-de-promotions-juste-avant-la-2e-demarque-des-soldes</guid>
      <description>
M&#234;me sans l&#8217;annoncer officiellement, Amazon casse les prix sur une multitude de produits Tech pendant les soldes. Et bonne nouvelle : la 2&#7497; d&#233;marque arrive &#224; grands pas&#8239;! C&#8217;est le moment r&#234;v&#233; pour faire de vraies bonnes affaires et d&#233;marrer 2026 du bon pied.
</description>
    </item>
    <item>
      <title>The AI explosion isn't just hurting the prices of computers and consoles &#8211; it's coming for TVs and audio tech too</title>
      <link>https://www.techradar.com/audio/portable-media-players/the-ai-explosion-isnt-just-hurting-the-prices-of-computers-and-consoles-its-coming-for-tvs-and-audio-tech-too</link>
      <pubDate>Tue, 13 Jan 2026 17:01:47 +0000</pubDate>
      <guid isPermaLink="false">2akkaUZ2fmof3zS5Dodm</guid>
      <description>Price rises could be coming for all AV tech, and budget sets may get hit hardest</description>
    </item>
    <item>
      <title>Google&#8217;s Veo now turns portrait images into vertical AI videos</title>
      <link>https://www.theverge.com/news/861257/google-veo-3-1-ai-video-ingredients-vertical-update</link>
      <pubDate>2026-01-13T12:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=861257</guid>
      <description>Google is making its Veo 3.1 AI video model pay closer attention to the reference images you want generated clips to be based on. The company is releasing new visual improvements for the "Ingredients to Video" tool that was introduced last year, alongside expanding native vertical video support and resolution upscaling features. The Ingredients to [&#8230;]...</description>
    </item>
    <item>
      <title>Google&#8217;s update for Veo 3.1 lets users create vertical videos through reference images</title>
      <link>https://techcrunch.com/2026/01/13/googles-update-for-veo-3-1-lets-users-create-vertical-videos-through-reference-images/</link>
      <pubDate>Tue, 13 Jan 2026 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3082222</guid>
      <description>Google is now allowing users to create vertical videos using references image.</description>
    </item>
    <item>
      <title>Ponies release date: what time does the new Peacock TV show come out?</title>
      <link>https://www.techradar.com/streaming/ponies-release-date-what-time-does-the-new-peacock-tv-show-come-out</link>
      <pubDate>Tue, 13 Jan 2026 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">uisdKoaSkqE5xUWtJKo9ZG</guid>
      <description>Emilia Clarke and Haley Lu Richardson's new spy thriller series arrives very soon &#8211; here's when and where you can watch it.</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : quelles sont les meilleures offres &#224; saisir sur Amazon, Fnac, Darty&#8230; ?</title>
      <link>https://www.frandroid.com/bons-plans/2931731_soldes-dhiver-2026-voici-les-meilleures-offres-en-direct-avant-la-fin-de-la-premiere-demarque</link>
      <pubDate>Tue, 13 Jan 2026 16:57:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931731_soldes-dhiver-2026-voici-les-meilleures-offres-en-direct-avant-la-fin-de-la-premiere-demarque</guid>
      <description>
Les soldes d'hiver 2026 ont d&#233;but&#233; la semaine derni&#232;re et les offres continuent de tomber sur Amazon, Fnac, Darty ou encore Cdiscount et Boulanger. Smartphones, PC portables, t&#233;l&#233;viseurs, tablettes ou encore casques et &#233;couteurs sans fil&#8230; Voici les meilleures offres Tech s&#233;lectionn&#233;es par la r&#233;daction pour cette fin de premi&#232;re d&#233;marque.
</description>
    </item>
    <item>
      <title>Meta confirms Reality Labs layoffs and shifts to invest more in wearables</title>
      <link>https://www.theverge.com/news/861295/meta-reality-labs-layoffs-shift-to-wearables</link>
      <pubDate>2026-01-13T11:56:55-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=861295</guid>
      <description>Around 10 percent of Meta's Reality Labs division, which develops its XR products and services, will be laid off beginning on Tuesday, as reported by Bloomberg. Meta spokesperson Tracy Clayton confirmed the layoffs in a statement to The Verge: "We said last month that we were shifting some of our investment from Metaverse toward Wearables. [&#8230;]</description>
    </item>
    <item>
      <title>Ce puissant laptop gaming Lenovo avec RTX 5070 + 32 Go de RAM se n&#233;gocie &#224; tr&#232;s bon prix pour les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2804861_ce-puissant-laptop-gaming-lenovo-avec-rtx-5070-32-go-de-ram-se-negocie-a-tres-bon-prix-pour-les-soldes</link>
      <pubDate>Tue, 13 Jan 2026 16:54:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2804861_ce-puissant-laptop-gaming-lenovo-avec-rtx-5070-32-go-de-ram-se-negocie-a-tres-bon-prix-pour-les-soldes</guid>
      <description>
En ce moment, vous avez le PC portable gaming Lenovo Legion 5 15IRX10 pour 1 199,99 euros alors qu'il &#233;tait propos&#233; &#224; 1 799,99 euros &#224; sa sortie. Il y a d&#233;j&#224; eu moins cher, mais &#231;a reste un tr&#232;s bon prix compte tenu de la p&#233;nurie des composants. 
</description>
    </item>
    <item>
      <title>I finally found an IKEA standing desk that fixes the two major design flaws I hate most</title>
      <link>https://www.techradar.com/pro/i-finally-found-an-ikea-standing-desk-that-fixes-the-two-major-design-flaws-i-hate-most</link>
      <pubDate>Tue, 13 Jan 2026 16:50:34 +0000</pubDate>
      <guid isPermaLink="false">CRYG7YZaNqfx39Fn6kV7zh</guid>
      <description>The Utmaning standing desk from IKEA  ticks all the boxes, from cables to comfort.</description>
    </item>
    <item>
      <title>Mise &#224; jour Google Home : 20 nouvelles fonctions d&#233;barquent, voici ce qui change</title>
      <link>https://www.frandroid.com/marques/google/2941135_mise-a-jour-google-home-20-nouvelles-fonctions-debarquent-voici-ce-qui-change</link>
      <pubDate>Tue, 13 Jan 2026 16:47:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2941135_mise-a-jour-google-home-20-nouvelles-fonctions-debarquent-voici-ce-qui-change</guid>
      <description>
Google Home gagne de nouvelles options pour cr&#233;er des r&#232;gles d'automatisation. Les possibilit&#233;s sont nombreuses.
</description>
    </item>
    <item>
      <title>Dozens of ICE Vehicles in Minnesota Lack &#8216;Necessary&#8217; Lights and Sirens</title>
      <link>https://www.wired.com/story/dozens-of-ice-vehicles-in-minnesota-lack-necessary-lights-and-sirens/</link>
      <pubDate>Tue, 13 Jan 2026 16:45:19 +0000</pubDate>
      <guid isPermaLink="false">69665b09d9af5a576f409c1e</guid>
      <description>A contract justification published in a federal register on Tuesday says that 31 ICE vehicles operating in the Twin Cities area &#8220;lack the necessary emergency lights and sirens&#8221; to be &#8220;compliant.&#8221;</description>
    </item>
    <item>
      <title>Apple&#8217;s Big Virtual Reality NBA Game Debut Demands More Interactivity</title>
      <link>https://gizmodo.com/apples-big-virtual-reality-nba-game-debut-demands-more-interactivity-2000709640</link>
      <pubDate>Tue, 13 Jan 2026 16:45:02 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000709640</guid>
      <description>A Vision Pro is way cheaper than courtside tickets, though Apple's headset could offer something beyond a good view.</description>
    </item>
    <item>
      <title>Newcastle vs Man City Free Streams: How to watch Carabao Cup 2025-26 semi-final online from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/football/newcastle-vs-man-city-carabao-cup-2025-26-semi-final-free</link>
      <pubDate>Tue, 13 Jan 2026 16:45:00 +0000</pubDate>
      <guid isPermaLink="false">CXQgzdKZc97LB9ZzNkvfw6</guid>
      <description>All the ways to watch Newcastle vs Man City live streams, with both sides hoping to gain an advantage in the first leg of this Carabao Cup semi-final.</description>
    </item>
    <item>
      <title>Tesla met &#224; jour le Model Y 2026 aux US : les 3 nouveaut&#233;s principales, avec le retour d&#8217;une option demand&#233;e</title>
      <link>https://www.frandroid.com/marques/tesla/2940277_tesla-met-a-jour-le-model-y-2026-voici-les-3-nouveautes-principales-dont-loption-7-places-et-uniquement-aux-etats-unis-pour-le-moment</link>
      <pubDate>Tue, 13 Jan 2026 16:39:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2940277_tesla-met-a-jour-le-model-y-2026-voici-les-3-nouveautes-principales-dont-loption-7-places-et-uniquement-aux-etats-unis-pour-le-moment</guid>
      <description>
On attendait tous la version longue venue de Chine, la Model Y L. Finalement, Tesla joue la carte du recyclage. Le Model Y 7 places fait son retour aux &#201;tats-Unis sur la version 2026.
</description>
    </item>
    <item>
      <title>1Password launches Unified Access as a one-stop shop for managing company credentials &#8211; say goodbye to shadow IT and SaaS sprawl</title>
      <link>https://www.techradar.com/pro/1password-launches-unified-access-as-a-one-stop-shop-for-managing-company-credentials-say-goodbye-to-shadow-it-and-saas-sprawl</link>
      <pubDate>Tue, 13 Jan 2026 16:37:33 +0000</pubDate>
      <guid isPermaLink="false">jjwen55ebdTztkAybuZXy8</guid>
      <description>Forget about shadow IT and SaaS sprawl - 1Password's Unified Access capabilities can discover credentials for you and creates a secure, compliant platform to manage your applications.</description>
    </item>
    <item>
      <title>Remarkable&#8217;s pricey Paper Pro is hundreds off with refurbished deals</title>
      <link>https://www.theverge.com/gadgets/861182/remarkable-paper-pro-refurbished-switch-2-case-ps5-lg-b5-deal-sale</link>
      <pubDate>2026-01-13T11:37:14-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=861182</guid>
      <description>If you compare the value proposition of getting one of Remarkable&#8217;s Paper Pro E-Ink tablets vs. buying a laptop, the latter will win in most scenarios. Laptops are more capable, with more ports, apps, and versatility &#8212; but they&#8217;re much more distracting, too. Avoiding distractions during work or while writing for leisure isn&#8217;t easy, and [&#8230;]</description>
    </item>
    <item>
      <title>Ventes de smartphones : Apple devient leader mondial, Samsung tremble et deux outsiders jubilent</title>
      <link>https://www.frandroid.com/marques/apple/2941467_ventes-de-smartphones-apple-devient-leader-mondial-samsung-tremble-et-deux-outsiders-jubilent</link>
      <pubDate>Tue, 13 Jan 2026 16:35:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2941467_ventes-de-smartphones-apple-devient-leader-mondial-samsung-tremble-et-deux-outsiders-jubilent</guid>
      <description>
Pour la premi&#232;re fois depuis 14 ans, Samsung n'est plus le premier constructeur mondial de smartphones. Port&#233; par un succ&#232;s de sa gamme iPhone 17, Apple vient de s'emparer de la couronne. Et le plus fou ? L'&#233;cart ne fait que se creuser. Les derniers chiffres de Counterpoint Research sont sans appel.
</description>
    </item>
    <item>
      <title>Apple Creator Studio suite is launching to take on Adobe</title>
      <link>https://www.theverge.com/news/861279/apple-creator-studio-apps-subscription-price-availability</link>
      <pubDate>2026-01-13T11:35:10-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=861279</guid>
      <description>Apple has announced Apple Creator Studio, a new software suite for Apple products that bundles popular creative apps into an all-in-one subscription service. Apple Creator Studio will be available on the App Store on January 28th, and includes access to Final Cut Pro, Logic Pro, Pixelmator Pro, Motion, Compressor, and MainStage - providing a rival [&#8230;]...</description>
    </item>
    <item>
      <title>NBA League Pass is up to 55 percent off right now</title>
      <link>https://www.engadget.com/entertainment/streaming/nba-league-pass-is-up-to-55-percent-off-right-now-163421218.html?src=rss</link>
      <pubDate>Tue, 13 Jan 2026 16:34:21 +0000</pubDate>
      <guid isPermaLink="false">a364f8fe-4cef-4bc2-89cf-730e7b34af39</guid>
      <description>NBA League Pass, the streaming service that lets you catch hundreds of out-of-market NBA games, is on sale right now for up to 55 percent off. The League Pass Premium subscription is on sale for $75, down from $160, while League Pass Standard is marked down to $50 from $110. We're almost halfway through the season at this point, so it makes sense for a service like League Pass to start offering some discounts.
The Standard plan includes commercials and support for only one device at a time, while the Premium tier offers no commercials, in-arena streams during breaks in the game, offline viewin...</description>
    </item>
    <item>
      <title>India reportedly tells quick-commerce firms to drop 10-minute delivery promise</title>
      <link>https://techcrunch.com/2026/01/13/india-reportedly-tells-quick-commerce-firms-to-drop-10-minute-delivery-promise/</link>
      <pubDate>Tue, 13 Jan 2026 16:27:46 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3082253</guid>
      <description>India's labor ministry is pushing the country's booming quick-commerce sector to prioritize the wellness and safety of its gig workers.</description>
    </item>
    <item>
      <title>The LG C5 OLED is still the best TV that we recommend in 2026  &#8212; and it just received a staggering $1,300 discount at Best Buy</title>
      <link>https://www.techradar.com/seasonal-sales/the-lg-c5-oled-is-still-the-best-tv-that-we-recommend-in-2026-and-it-just-received-a-staggering-usd1-300-discount-at-best-buy</link>
      <pubDate>Tue, 13 Jan 2026 16:23:55 +0000</pubDate>
      <guid isPermaLink="false">rNX7Ag9CGpDkh7DohvE7NX</guid>
      <description>The LG C5 OLED TV is still our best-rated TV of 2026, and the 65-inch model just received a staggering $1,300 discount, bringing the price down to &#163;1,399.</description>
    </item>
    <item>
      <title>Jony Ive and Sam Altman&#8217;s First AI Gadget May Try to Kill AirPods</title>
      <link>https://gizmodo.com/jony-ive-and-sam-altmans-first-ai-gadget-may-try-to-kill-airpods-2000709609</link>
      <pubDate>Tue, 13 Jan 2026 16:20:55 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000709609</guid>
      <description>Thank god someone is brave enough to take down many people's favorite wireless earbuds.</description>
    </item>
    <item>
      <title>Hackers claim to have Target source code for sale following recent cyberattack</title>
      <link>https://www.techradar.com/pro/security/hackers-claim-to-have-target-source-code-for-sale-following-recent-cyberattack</link>
      <pubDate>Tue, 13 Jan 2026 16:20:00 +0000</pubDate>
      <guid isPermaLink="false">rSMYgr7L2iQMoc29E9yURF</guid>
      <description>A Target database of almost 900GB was allegedly stolen and being sold in smaller batches.</description>
    </item>
    <item>
      <title>Apr&#232;s Air France, le plus grand groupe a&#233;rien europ&#233;en choisit &#233;galement Starlink</title>
      <link>https://www.frandroid.com/telecom/2941427_apres-air-france-la-plus-grande-compagnie-europeenne-qui-choisit-egalement-starlink</link>
      <pubDate>Tue, 13 Jan 2026 16:15:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2941427_apres-air-france-la-plus-grande-compagnie-europeenne-qui-choisit-egalement-starlink</guid>
      <description>
Quelques mois apr&#232;s l'annonce d'Air France, c'est au tour de Lufthansa de jeter l'&#233;ponge face &#224; ses partenaires historiques pour signer avec Starlink.
</description>
    </item>
    <item>
      <title>ElevenLabs CEO says the voice AI startup crossed $330 million ARR last year</title>
      <link>https://techcrunch.com/2026/01/13/elevenlabs-ceo-says-the-voice-ai-startup-crossed-330-million-arr-last-year/</link>
      <pubDate>Tue, 13 Jan 2026 16:15:22 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3082248</guid>
      <description>The company said it took only five months to go from $200 million to $330 million in annual recurring revenue.</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver : quoi de mieux que courir dans le froid avec une de ces 9 montres connect&#233;es &#224; prix sold&#233; ? Le TOP des bons plans</title>
      <link>https://www.frandroid.com/bons-plans/2937331_les-montres-connectees-sont-en-forte-promotion-durant-les-soldes-les-7-bonnes-affaires-a-retenir</link>
      <pubDate>Tue, 13 Jan 2026 16:13:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2937331_les-montres-connectees-sont-en-forte-promotion-durant-les-soldes-les-7-bonnes-affaires-a-retenir</guid>
      <description>
Les soldes d'hiver permettent de faire de bonnes affaires sur de nombreux produits Tech, dont les montres connect&#233;es ! Ces accessoires lifestyle &amp; sport profitent eux aussi d&#8217;une vague de promotions : voici les offres &#224; retenir. 
</description>
    </item>
    <item>
      <title>Ubisoft announces layoffs at The Division studio Massive Entertainment and Ubisoft Stockholm amid restructuring efforts</title>
      <link>https://www.techradar.com/gaming/ubisoft-announces-layoffs-at-the-division-studio-massive-entertainment-and-ubisoft-stockholm-amid-restructuring-efforts</link>
      <pubDate>Tue, 13 Jan 2026 16:11:25 +0000</pubDate>
      <guid isPermaLink="false">7TGoyegxsnmNX8RMirY99M</guid>
      <description>Ubisoft has announced job cuts at The Division studio, Massive Entertainment, and Ubisoft Stockholm as part of ongoing cost-cutting efforts.</description>
    </item>
    <item>
      <title>La France ne peut pas interdire les r&#233;seaux sociaux aux moins de 15 ans&#160;: le rappel &#224; l&#8217;ordre du Conseil d&#8217;&#201;tat</title>
      <link>https://www.01net.com/actualites/la-france-ne-peut-pas-interdire-les-reseaux-sociaux-aux-moins-de-15-ans-le-rappel-a-lordre-du-conseil-detat.html</link>
      <pubDate>Tue, 13 Jan 2026 16:08:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319514</guid>
      <description>La proposition de loi visant &#224; prot&#233;ger les mineurs en ligne, examin&#233;e ce mardi 13 janvier en commission des Affaires culturelles de l'Assembl&#233;e nationale, est en passe d'&#234;tre rabot&#233;e... apr&#232;s un avis du Conseil d'&#201;tat. Le texte fait partie des trois initiatives l&#233;gislatives qui veulent interdire les r&#233;seaux sociaux aux mineurs.</description>
    </item>
    <item>
      <title>Former NYC Mayor Eric Adams accused of $2.5 million crypto &#8216;rug pull&#8217; as his NYC Token crashes</title>
      <link>https://www.theverge.com/news/861269/former-nyc-mayor-eric-adams-accused-of-2-5-million-crypto-rug-pull-as-his-nyc-token-crashes</link>
      <pubDate>2026-01-13T11:06:37-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=861269</guid>
      <description>Former NYC Mayor Eric Adams has come under fire after his new cryptocurrency token crashed just hours following its launch on Monday. As reported by CoinDesk, Adams' "NYC Token" hit a $580 million market capitalization at its peak before plummeting to around $130 million at this time of writing. Data from the blockchain analysis platform, [&#8230;]</description>
    </item>
    <item>
      <title>Archaeologists in Sicily Discover an Ancient Stylus With an Erection. Yes, That Kind of Erection</title>
      <link>https://gizmodo.com/archaeologists-in-sicily-discover-an-ancient-stylus-with-an-erection-yes-that-kind-of-erection-2000709647</link>
      <pubDate>Tue, 13 Jan 2026 16:05:51 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000709647</guid>
      <description>The over 2,400-year-old ceramist's stylus likely features Dionysus...and his other bits.</description>
    </item>
    <item>
      <title>Celebrate Lunar New Year with the Lego Spring Festival Good Fortune build while its over $37 off</title>
      <link>https://mashable.com/article/jan-13-lego-spring-festival-good-fortune-deal</link>
      <pubDate>Tue, 13 Jan 2026 16:05:29 +0000</pubDate>
      <guid isPermaLink="false">00UzWnNyv47lFFuFITGRskI</guid>
      <description>The Lego Spring Festival Good Fortune set is on sale at Amazon for $52.60, down from the list price of $89.99. That's a 42% discount.</description>
    </item>
    <item>
      <title>OpenAI reportedly readies lengthy Super Bowl commercial</title>
      <link>https://mashable.com/article/openai-super-bowl-commercial-2026</link>
      <pubDate>Tue, 13 Jan 2026 16:03:36 +0000</pubDate>
      <guid isPermaLink="false">03OPJKjjgQPwqFXOETMOIso</guid>
      <description>OpenAI is planning another Super Bowl ad for 2026.</description>
    </item>
    <item>
      <title>De nombreux produits Samsung sont &#224; prix cass&#233;s durant les soldes : smartphones, TV, tablettes&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2939747_de-nombreux-produits-samsung-sont-a-prix-casses-durant-les-soldes-smartphones-tv-tablettes</link>
      <pubDate>Tue, 13 Jan 2026 16:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2939747_de-nombreux-produits-samsung-sont-a-prix-casses-durant-les-soldes-smartphones-tv-tablettes</guid>
      <description>
Samsung profite des soldes d&#8217;hiver pour proposer une avalanche de r&#233;ductions sur ses meilleurs produits. Entre ses Galaxy S et A, ses t&#233;l&#233;viseurs QLED et OLED, tablettes et &#233;couteurs sans fil, de nombreuses r&#233;f&#233;rences phares de la marque sud-cor&#233;enne voient leur prix chuter, rendant le moment id&#233;al pour s&#8217;&#233;quiper ou se faire plaisir &#224; moindre co&#251;t.
...</description>
    </item>
    <item>
      <title>Games Workshop Rejects the Abominable Intelligence</title>
      <link>https://gizmodo.com/games-workshop-ai-ban-warhammer-40k-2000709643</link>
      <pubDate>Tue, 13 Jan 2026 16:00:41 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000709643</guid>
      <description>The makers of 'Warhammer' declare heresy on generative AI, banning its use in the company's design process.</description>
    </item>
    <item>
      <title>I'm a lifelong iPhone user, but a few months with Gemini on Android have shown me exactly why Apple and Google's AI partnership is what everyone needs</title>
      <link>https://www.techradar.com/ai-platforms-assistants/apple-intelligence/im-a-lifelong-iphone-user-but-a-few-months-with-gemini-on-android-have-shown-me-exactly-why-apple-and-googles-ai-partnership-is-what-everyone-needs</link>
      <pubDate>Tue, 13 Jan 2026 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">QbBe2Rq2Wya9Rh6Zhs6Wx7</guid>
      <description>For the first time in years, I&#8217;m excited about the future of the iPhone. And that excitement is coming from Google, not Cupertino.</description>
    </item>
    <item>
      <title>Docusign&#8217;s AI will now help you understand what&#160;you&#8217;re&#160;signing</title>
      <link>https://www.fastcompany.com/91472355/docusign-ai-contracts-legal</link>
      <pubDate>2026-01-13T16:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91472355/docusign-ai-contracts-legal</guid>
      <description>The company is rolling out new features to help signers understand contract terms and help contract creators more quickly set up agreements for signature.&#160;
New AI tools from Docusign aim to make contracts easier to understand and quicker to&#160;prepare.&#160;</description>
    </item>
    <item>
      <title>Toujours aussi l&#233;ger, le v&#233;lo &#233;lectrique Origine Montmartre fait toujours plus dans le Made in France</title>
      <link>https://www.frandroid.com/marques/origine/2940937_toujours-aussi-leger-le-velo-electrique-origine-montmartre-fait-toujours-plus-dans-le-made-in-france</link>
      <pubDate>Tue, 13 Jan 2026 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/origine/2940937_toujours-aussi-leger-le-velo-electrique-origine-montmartre-fait-toujours-plus-dans-le-made-in-france</guid>
      <description>
Dans sa version cadre ouvert, le v&#233;lo &#233;lectrique urbain Origine Montmartre propose dor&#233;navant une toute nouvelle courroie Hutchinson Crossdyn, fabriqu&#233;e en France.
</description>
    </item>
    <item>
      <title>Samsungs new OLED TVs will probably be expensive. Meanwhile, the 2025 S90F OLED is almost 50% off.</title>
      <link>https://mashable.com/article/jan-13-samsung-s90f-oled-tv-deal</link>
      <pubDate>Tue, 13 Jan 2026 15:59:58 +0000</pubDate>
      <guid isPermaLink="false">00cT5ENQEugNn3VS84nbwX5</guid>
      <description>The Samsung S90F is one of the best OLED TVs on a budget. The 48, 55, and 77-inch models are still at Black Friday pricing at Amazon.</description>
    </item>
    <item>
      <title>Grow your card cache with 13% off the Pok&#233;mon TCG Mega Venusaur ex Premium Collection Box</title>
      <link>https://mashable.com/article/jan-13-pokemon-tcg-mega-venusaur-ex-premium-collection-box-deal</link>
      <pubDate>Tue, 13 Jan 2026 15:55:09 +0000</pubDate>
      <guid isPermaLink="false">03otuHWLMsdTwNBFq5xdNkI</guid>
      <description>As of Jan. 13, get 13% off the Pok&#233;mon TCG Mega Venusaur ex Premium Collection Box at Amazon.</description>
    </item>
    <item>
      <title>CES is over, but Im still lusting for the Samsung Galaxy Z TriFold</title>
      <link>https://mashable.com/article/samsung-galaxy-z-trifold-hands-on</link>
      <pubDate>Tue, 13 Jan 2026 15:55:07 +0000</pubDate>
      <guid isPermaLink="false">026f7CNHXKmxrSRVXu8kTvV</guid>
      <description>Mashable's tech editor got to go hands-on with the upcoming Samsung Galaxy Z TriFold at CES 2026, and it left a lasting impression.</description>
    </item>
    <item>
      <title>Dreame brings 8K video to compact action cameras</title>
      <link>https://www.theverge.com/tech/861248/dreame-leaptic-cube-action-camera-8k-stabilization-ai</link>
      <pubDate>2026-01-13T10:51:04-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=861248</guid>
      <description>Dreame, a Chinese company known for its unique robot vacuums and floor cleaners, expanded its offerings at CES 2026, such as a $700 floor lamp that doubled as a hair dryer. But more interesting is the debut of the company's first action camera. The Leaptic Cube features a design similar to the DJI Osmo Nano [&#8230;]</description>
    </item>
    <item>
      <title>Trump is headed to this Detroit Ford factory to promote U.S. manufacturing</title>
      <link>https://www.fastcompany.com/91473921/trump-headed-detroit-ford-factory-promote-u-s-manufacturing</link>
      <pubDate>2026-01-13T15:49:27</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91473921/trump-headed-detroit-ford-factory-promote-u-s-manufacturing</guid>
      <description>The president&#8217;s trip will include a visit to a Dearborn factory that make the F-150 pickup, a bestseller in the U.S.
President Donald Trump will travel to Michigan on Tuesday to promote his efforts to boost U.S. manufacturing, trying to counter fears about a weakening job market and worries that still-rising prices are taking a toll on Americans&#8217; pocketbooks.The day trip will include a tour of a Ford factory in Dearborn that makes F-150 pickups, the bestselling domestic vehicle in the U.S. The Republican president is also set to address the Detroit Economic Club at the MotorCity Casino.Novembe...</description>
    </item>
    <item>
      <title>The RAM shortage driving up tech prices won&#8217;t end any time soon, Micron says</title>
      <link>https://mashable.com/article/micron-memory-ram-shortage-not-ending-soon-ai</link>
      <pubDate>Tue, 13 Jan 2026 15:49:26 +0000</pubDate>
      <guid isPermaLink="false">06PwwkYaKOmzdhmXfO0TXUU</guid>
      <description>One of the bigger memory manufacturers believes the RAM shortage affecting tech prices may not end until 2028.</description>
    </item>
    <item>
      <title>Proton's Lifetime account raffle raises $1.27 million for digital rights advocates</title>
      <link>https://www.techradar.com/vpn/vpn-services/protons-lifetime-account-raffle-raises-usd1-27-million-for-digital-rights-advocates</link>
      <pubDate>Tue, 13 Jan 2026 15:47:02 +0000</pubDate>
      <guid isPermaLink="false">smBrDGDp9HE7wymJrtcFMd</guid>
      <description>With the money generated from its 2025 Lifetime Account Charity Fundraiser, Proton has awarded grants to ten community-chosen groups defending privacy online and digital rights.</description>
    </item>
    <item>
      <title>Marvel won&amp;#8217;t let you forget Avengers: Doomsday is coming</title>
      <link>https://www.theverge.com/entertainment/861185/marvel-studios-avengers-doomsday-countdown-teaser-black-panther-fantastic-four</link>
      <pubDate>2026-01-13T10:45:10-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=861185</guid>
      <description>A little over a year ago, Marvel spent the better part of an entire day slowly revealing the massive cast for Avengers: Doomsday. More recently, the studio started dropping teaser trailers featuring some of the movie's more notable superhero team-ups and returning characters. There was already plenty of hype around the project, which seems poised [&#8230;]...</description>
    </item>
    <item>
      <title>Former NYC Mayor Eric Adams Accused of Crypto Pump and Dump With NYC Token</title>
      <link>https://gizmodo.com/former-nyc-mayor-eric-adams-accused-of-crypto-pump-and-dump-with-nyc-token-2000709645</link>
      <pubDate>Tue, 13 Jan 2026 15:40:20 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000709645</guid>
      <description>Adams has wasted no time finding his true calling.</description>
    </item>
    <item>
      <title>Businesses are finally taking action to crack down on AI security risks</title>
      <link>https://www.techradar.com/pro/security/businesses-are-finally-taking-action-to-crack-down-on-ai-security-risks</link>
      <pubDate>Tue, 13 Jan 2026 15:40:00 +0000</pubDate>
      <guid isPermaLink="false">GHA9ognpgd4kBWNmRqZXGT</guid>
      <description>Nearly all business leaders agree AI will be the thing that changes their cybersecurity strategies the most this year.</description>
    </item>
    <item>
      <title>Microsoft scrambles to quell fury around its new AI data centers</title>
      <link>https://www.theverge.com/news/861080/microsoft-ai-data-center-infrastructure-electricity-rates</link>
      <pubDate>2026-01-13T10:33:41-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=861080</guid>
      <description>It looks like the wave of campaigns against data centers are getting under big tech companies' skin - and Microsoft is the latest giant to promise to address frustrations on the ground in communities around their data centers. The company announced a five-point plan today that it calls "Community-First AI Infrastructure." That includes paying more [&#8230;]...</description>
    </item>
  </channel>
</rss>
