<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 02 Mar 2026 08:52:57 GMT</lastBuildDate>
    <item>
      <title>Windows 11 voit enfin son nombre d&#8217;utilisateurs exploser</title>
      <link>https://www.01net.com/actualites/windows-11-voit-enfin-son-nombre-dutilisateurs-exploser.html</link>
      <pubDate>Mon, 02 Mar 2026 08:42:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1329015</guid>
      <description>Les parts de march&#233; de Windows 11 ont connu une importante et rapide ascension au cours des derni&#232;res semaines.</description>
    </item>
    <item>
      <title>&#171; Une nouvelle norme &#187; : Voi revoit enti&#232;rement sa flotte de v&#233;los et trottinettes &#233;lectriques pour 2026</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2995735_une-nouvelle-norme-voi-revoit-entierement-sa-flotte-de-velos-et-trottinettes-electrique-pour-2026</link>
      <pubDate>Mon, 02 Mar 2026 08:42:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2995735_une-nouvelle-norme-voi-revoit-entierement-sa-flotte-de-velos-et-trottinettes-electrique-pour-2026</guid>
      <description>
Voi Technology pr&#233;sente une nouvelle g&#233;n&#233;ration de trottinettes et de v&#233;los &#233;lectriques en libre-service, dont le d&#233;ploiement d&#233;butera en 2026 &#224; Stockholm avant un d&#233;ploiement progressif dans plusieurs autres villes europ&#233;ennes.
</description>
    </item>
    <item>
      <title>Motorola annonce un partenariat avec GrapheneOS pour des futurs smartphones ultra-s&#233;curis&#233;s</title>
      <link>https://www.frandroid.com/marques/motorola/2995703_motorola-annonce-un-partenariat-avec-grapheneos-pour-des-futurs-smartphones-ultra-securises</link>
      <pubDate>Mon, 02 Mar 2026 08:36:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/motorola/2995703_motorola-annonce-un-partenariat-avec-grapheneos-pour-des-futurs-smartphones-ultra-securises</guid>
      <description>
Au Mobile World Congress, Motorola a annonc&#233; un partenariat d&#8217;un nouveau genre avec l&#8217;&#233;quipe derri&#232;re la c&#233;l&#232;bre ROM GrapheneOS. Un t&#233;l&#233;phone d&#233;di&#233; au syst&#232;me d&#8217;exploitation devrait sortir bient&#244;t.
</description>
    </item>
    <item>
      <title>Soundcore Space 2 : un casque ANC abordable aux belles promesses</title>
      <link>https://www.frandroid.com/produits-android/audio/casque-audio/2995753_soundcore-space-2-un-casque-anc-abordable-aux-belles-promesses</link>
      <pubDate>Mon, 02 Mar 2026 08:35:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/audio/casque-audio/2995753_soundcore-space-2-un-casque-anc-abordable-aux-belles-promesses</guid>
      <description>
Soundcore pr&#233;sente son nouveau casque Space 2 au Mobile World Congress de Barcelone, un casque circum-auriculaire ax&#233; sur la r&#233;duction de bruit et une longue dur&#233;e d'utilisation.
</description>
    </item>
    <item>
      <title>J&#8217;ai vu le futur du PC portable chez Lenovo, et il est en pi&#232;ces d&#233;tach&#233;es</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2995337_jai-vu-le-futur-du-pc-portable-chez-lenovo-et-il-est-en-pieces-detachees</link>
      <pubDate>Mon, 02 Mar 2026 08:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2995337_jai-vu-le-futur-du-pc-portable-chez-lenovo-et-il-est-en-pieces-detachees</guid>
      <description>
Et si votre ordinateur portable pouvait s'agrandir une fois arriv&#233; &#224; l'h&#244;tel ? C'est le pari du ThinkBook Modular AI PC Concept. En utilisant des connecteurs pogo-pin et un syst&#232;me d'&#233;cran d&#233;port&#233;, Lenovo transforme un ultrabook classique en une station de travail de 19 pouces.
</description>
    </item>
    <item>
      <title>Sonos Play : une fuite r&#233;v&#232;le une future enceinte portable</title>
      <link>https://www.frandroid.com/produits-android/audio/enceinte-bluetooth/2995699_sonos-play-une-fuite-revele-un-futur-haut-parleur-portable</link>
      <pubDate>Mon, 02 Mar 2026 08:11:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/audio/enceinte-bluetooth/2995699_sonos-play-une-fuite-revele-un-futur-haut-parleur-portable</guid>
      <description>
Une fiche produit &#233;ph&#233;m&#232;re publi&#233;e sur le site marchand Best Buy Canada a d&#233;voil&#233; les caract&#233;ristiques d'une enceinte nomade Sonos in&#233;dite baptis&#233;e Play, &#233;voquant un successeur compact aux Move 2 et Roam 2.
</description>
    </item>
    <item>
      <title>Qualcomm's Snapdragon Wear Elite chip is made for smartwatches and AI devices</title>
      <link>https://www.engadget.com/wearables/qualcomms-snapdragon-wear-elite-chip-is-made-for-smartwatches-and-ai-devices-080744412.html?src=rss</link>
      <pubDate>Mon, 02 Mar 2026 08:07:44 +0000</pubDate>
      <guid isPermaLink="false">4ed0b543-198b-4d5b-8e0b-46b843c8e5e8</guid>
      <description>Qualcomm's Snapdragon Elite chips are reserved for the best Android phones and laptops, and now the company has introduced the first in the Elite series for wearables. The Snapdragon Wear Elite processor is designed for smartwatches and AI devices like pendants and promises up to a fivefold increase in single-thread CPU performance, Qualcomm announced.&#160;
The new processor is built on a 3nm process to improve speed and efficiency over previous models, while boosting the number of cores to five (one big core at 2.1GHz and 4 little cores at 1.9GHz). With those changes, the company is promising up ...</description>
    </item>
    <item>
      <title>Les fuites de donn&#233;es continuent en France avec le hack de la F&#233;d&#233;ration Fran&#231;aise de Gymnastique</title>
      <link>https://www.01net.com/actualites/fuites-donnees-continuent-france-hack-federation-francaise-gymnastique.html</link>
      <pubDate>Mon, 02 Mar 2026 08:01:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1328993</guid>
      <description>La F&#233;d&#233;ration Fran&#231;aise de Gymnastique a &#233;t&#233; pirat&#233;e. Les donn&#233;es de pr&#232;s de 3&#8239;millions de licenci&#233;s et ex&#8209;adh&#233;rents ont &#233;t&#233; compromises et mises en vente sur le dark web. C'est le nouvel &#233;pisode d&#8217;une vague de cyberattaques qui frappe les f&#233;d&#233;rations sportives fran&#231;aises depuis plusieurs mois.</description>
    </item>
    <item>
      <title>Vivo&#8217;s next phone will launch with a professional camera rig</title>
      <link>https://www.theverge.com/gadgets/887250/vivo-x300-ultra-global-launch-telephoto-camera-cage</link>
      <pubDate>2026-03-02T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=887250</guid>
      <description>Vivo rarely has a presence at MWC, but this year it bucked that trend in a big way, with the reveal of its next flagship phone, the X300 Ultra, alongside an upgraded telephoto extender lens and professional camera cage. The company isn't ready to launch the handset just yet - or even reveal very many [&#8230;]</description>
    </item>
    <item>
      <title>Pourquoi Anker est en train de devenir plus &#171;&#160;Apple&#160;&#187; qu&#8217;Apple sur les accessoires : voici les deux nouveaux chargeurs</title>
      <link>https://www.frandroid.com/marques/anker/2994773_pourquoi-anker-est-en-train-de-devenir-plus-apple-quapple-sur-les-accessoires-voici-les-deux-nouveaux-chargeurs</link>
      <pubDate>Mon, 02 Mar 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/anker/2994773_pourquoi-anker-est-en-train-de-devenir-plus-apple-quapple-sur-les-accessoires-voici-les-deux-nouveaux-chargeurs</guid>
      <description>
La recharge sans fil rapide, c'est bien, mais &#231;a chauffe. Pour r&#233;gler le probl&#232;me, Anker lance en Europe sa station Prime 3-en-1 avec un syst&#232;me de refroidissement actif. Anker annonce aussi un nouveau Nano 45W coloris Cosmic Orange.
</description>
    </item>
    <item>
      <title>Pourquoi ce petit &#171;&#160;compagnon&#160;&#187; Lenovo est l&#8217;objet le plus utile du MWC 2026</title>
      <link>https://www.frandroid.com/marques/2995387_pourquoi-ce-petit-compagnon-lenovo-est-lobjet-le-plus-utile-du-mwc-2026</link>
      <pubDate>Mon, 02 Mar 2026 07:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2995387_pourquoi-ce-petit-compagnon-lenovo-est-lobjet-le-plus-utile-du-mwc-2026</guid>
      <description>
On ne s'y attendait pas forc&#233;ment, mais Lenovo vient de pr&#233;senter un objet qui n'est ni un PC, ni une tablette. L'AI Work Companion Concept est une horloge de bureau intelligente qui centralise vos t&#226;ches pour vous &#233;viter de craquer.
</description>
    </item>
    <item>
      <title>Get a 32GB RAM mini PC for under $500! This Kamrui deal is hard to beat</title>
      <link>https://www.techradar.com/computing/get-a-32gb-ram-mini-pc-for-under-usd500-this-kamrui-deal-is-hard-to-beat</link>
      <pubDate>Mon, 02 Mar 2026 07:42:02 +0000</pubDate>
      <guid isPermaLink="false">nqZ2q9mbv7KMctak5CAsYm</guid>
      <description>The Kamrui Hyper H2 mini PC drops to a new record-low price</description>
    </item>
    <item>
      <title>Snap up a Kamrui Mini PC for under $250, but you'll need our exclusive code.</title>
      <link>https://www.techradar.com/computing/snap-up-a-kamrui-mini-pc-for-under-usd250-but-youll-need-our-exclusive-code</link>
      <pubDate>Mon, 02 Mar 2026 07:41:35 +0000</pubDate>
      <guid isPermaLink="false">gjCDkFvhrK3BTArhFKfjQT</guid>
      <description>Get the Kamrui E3B 4K Mini PC for just $294.93 at Amazon</description>
    </item>
    <item>
      <title>Huawei s&#233;duit avec son nouveau bracelet connect&#233; avec GPS int&#233;gr&#233; et lui retire 20 % pour f&#234;ter sa sortie</title>
      <link>https://www.frandroid.com/bons-plans/2994249_huawei-seduit-avec-son-nouveau-bracelet-connecte-avec-gps-integre-et-lui-retire-20-pour-feter-sa-sortie</link>
      <pubDate>Mon, 02 Mar 2026 07:34:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2994249_huawei-seduit-avec-son-nouveau-bracelet-connecte-avec-gps-integre-et-lui-retire-20-pour-feter-sa-sortie</guid>
      <description>
Huawei lance une nouvelle gamme de bracelets connect&#233;s dont fait partie le Huawei 11 Pro, un mod&#232;le qui se distingue par son GPS autonome int&#233;gr&#233;, rare pour un produit vendu 59,99 euros au lieu de 74,99 euros.
</description>
    </item>
    <item>
      <title>Apple pr&#233;parerait bien un Mac tactile, mais sans faire beaucoup d&#8217;efforts</title>
      <link>https://www.frandroid.com/marques/apple/2995679_apple-preparerait-bien-un-mac-tactile-mais-sans-faire-beaucoup-defforts</link>
      <pubDate>Mon, 02 Mar 2026 07:30:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2995679_apple-preparerait-bien-un-mac-tactile-mais-sans-faire-beaucoup-defforts</guid>
      <description>
Alors que les fronti&#232;res entre iPad et MacBook se font de plus en plus fines, Apple s&#8217;appr&#234;te &#224; sortir son tout premier PC portable tactile, si l&#8217;on en croit les derni&#232;res rumeurs. Mais point de r&#233;volution d&#8217;usage &#224; pr&#233;voir.
</description>
    </item>
    <item>
      <title>TCL NXTPAPER&#160;: les meilleurs &#233;crans pour vos yeux passent &#224; l&#8217;AMOLED</title>
      <link>https://www.01net.com/actualites/tcl-nxtpaper-meilleurs-ecrans-pour-vos-yeux-passent-amoled.html</link>
      <pubDate>Mon, 02 Mar 2026 07:00:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1328214</guid>
      <description>Toujours d&#233;termin&#233; &#224; prendre soin de vos yeux, TCL annonce l'arriv&#233;e des &#233;crans AMOLED pour sa technologie NXTPAPER, ainsi qu'un smartphone, deux tablettes et des &#233;couteurs.</description>
    </item>
    <item>
      <title>Le Wi-Fi 8 arrive, et les promesses sont folles</title>
      <link>https://www.01net.com/actualites/qualcomm-wi-fi-8-arrive-promesses-sont-folles.html</link>
      <pubDate>Mon, 02 Mar 2026 07:00:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1328895</guid>
      <description>Qualcomm pr&#233;sente sa vision du Wi-Fi 8, qui promet une connexion sans fil capable de rivaliser avec la fiabilit&#233; d'un r&#233;seau filaire.</description>
    </item>
    <item>
      <title>TCL Tbot&#160;: la montre-robot qui veut remplacer les parents</title>
      <link>https://www.01net.com/actualites/tcl-tbot-montre-robot-qui-veut-remplacer-parents.html</link>
      <pubDate>Mon, 02 Mar 2026 07:00:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1328149</guid>
      <description>TLC profite du MWC 2026 pour remettre en avant son Tbot, un concept de montre pour enfant qui une fois qu&#8217;elle est d&#233;croch&#233;e du poignet se transforme en petit robot pour assister votre prog&#233;niture tout au long de sa journ&#233;e.</description>
    </item>
    <item>
      <title>La 6G promet bien plus que de faire exploser les d&#233;bits</title>
      <link>https://www.01net.com/actualites/6g-promet-bien-plus-que-faire-exploser-debits.html</link>
      <pubDate>Mon, 02 Mar 2026 07:00:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1328920</guid>
      <description>Qualcomm d&#233;voile sa strat&#233;gie pour la 6G, dont le d&#233;ploiement commercial arrive &#224; grands pas. Une nouvelle g&#233;n&#233;ration qui, vous allez le voir, ne se contentera pas d'&#234;tre simplement plus rapide.</description>
    </item>
    <item>
      <title>Qualcomm&#8217;s new chip is geared toward wearable AI gadgets</title>
      <link>https://www.theverge.com/tech/886434/qualcomm-snapdragon-wear-elite-wearables</link>
      <pubDate>2026-03-02T02:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=886434</guid>
      <description>Like it or not, more AI wearables may be on the horizon - or at least Qualcomm seems to think so. Today the company announced its new Snapdragon Wear Elite chip. At a press briefing, Qualcomm said it considers the Elite to be a "wrist plus" chip. Meaning, it won't replace the previous W5 Plus, [&#8230;]</description>
    </item>
    <item>
      <title>Qualcomm&#8217;s Snapdragon Wear Elite aims to power the next wave of AI wearables &#8212; not just smartwatches</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/qualcomms-snapdragon-wear-elite-aims-to-power-the-next-wave-of-ai-wearables-not-just-smartwatches</link>
      <pubDate>Mon, 02 Mar 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">CtDU3Q4JxHg7hwANBfdA4Q</guid>
      <description>Qualcomm unveils Snapdragon Wear Elite wearable platform, which could live in the next generation of AI wearables.</description>
    </item>
    <item>
      <title>'Faster speeds, higher reliability, longer range, and powerful AI': Qualcomm introduces Wi-Fi 8 chips with a startling speed boost at MWC 2026</title>
      <link>https://www.techradar.com/computing/wi-fi-broadband/faster-speeds-higher-reliability-longer-range-and-powerful-ai-qualcomm-introduces-wi-fi-8-chips-with-a-startling-speed-boost-at-mwc-2026</link>
      <pubDate>Mon, 02 Mar 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">UWcueUg3hUKeZhbyfapeEN</guid>
      <description>Yes, you may not have Wi-Fi 7 yet, but the Wi-Fi 8 juggernaut is already gathering pace.</description>
    </item>
    <item>
      <title>Oubliez l&#8217;iPad mini, cette tablette Lenovo Legion Tab a beaucoup pour plaire</title>
      <link>https://www.frandroid.com/produits-android/tablette/2995479_oubliez-lipad-mini-cette-tablette-lenovo-legion-tab-a-beaucoup-pour-plaire</link>
      <pubDate>Mon, 02 Mar 2026 06:55:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/tablette/2995479_oubliez-lipad-mini-cette-tablette-lenovo-legion-tab-a-beaucoup-pour-plaire</guid>
      <description>
Le march&#233; des petites tablettes puissantes est quasi mort, &#224; l'exception de l'iPad mini et quelques surprises, dont la Redmagic Astra. Lenovo compte bien bousculer cet ordre &#233;tabli avec la Legion Tab (8.8", 5). Un &#233;cran 3K, une charge ultra-rapide et de l'IA pour booster vos parties. On a fait le tour du propri&#233;taire.
</description>
    </item>
  </channel>
</rss>
