<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 28 Nov 2025 07:34:19 GMT</lastBuildDate>
    <item>
      <title>Les smartphones ultra-fins sont ultra-boud&#233;s par les constructeurs chinois</title>
      <link>https://www.01net.com/actualites/les-smartphones-ultra-fins-sont-ultra-boudes-par-les-constructeurs-chinois.html</link>
      <pubDate>Fri, 28 Nov 2025 07:30:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311873</guid>
      <description>L'iPhone Air et le Galaxy S25 Edge ne feront pas beaucoup d'&#233;mules chez les constructeurs chinois, qui sont pourtant toujours prompts &#224; coller au plus pr&#232;s des designs d'Apple (et de Samsung). Les ventes d&#233;cevantes de ces smartphones ultra-fins ont refroidi les ardeurs chez Xiaomi, Oppo et d'autres.</description>
    </item>
    <item>
      <title>MacBook Air 13,6&#8243; M4 : le roi des laptops pas chers d&#8217;Apple est &#224; prix in&#233;dit pour le Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2888527_macbook-air-136-m4-le-roi-des-laptops-pas-chers-dapple-est-a-prix-inedit-pour-le-black-friday</link>
      <pubDate>Fri, 28 Nov 2025 07:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2888527_macbook-air-136-m4-le-roi-des-laptops-pas-chers-dapple-est-a-prix-inedit-pour-le-black-friday</guid>
      <description>
L&#8217;&#233;cosyst&#232;me Apple, c&#244;t&#233; laptops, c&#8217;est une hi&#233;rarchie bien huil&#233;e : en haut, les MacBook Pro et leurs puissances d&#233;mesur&#233;es. Juste en dessous, les MacBook Air, moins flamboyants, un &#233;cran moins spectaculaire, mais une fiabilit&#233; quasi biblique et cette endurance qui en fait l&#8217;alli&#233; des longues journ&#233;es. Et pour le Black Friday, le M4 s&#8217;offre un renouveau tarifaire avec 874 euros au lieu de 1 199 euros sur Cdiscount.
...</description>
    </item>
    <item>
      <title>HONOR 400, Magic V5, Magic7 Pro : ces puissants photophones sont &#224; prix cass&#233; pour le Black Friday [Sponso]</title>
      <link>https://www.frandroid.com/marques/honor/2873631_honor-400-magic-v5-magic7-pro-ces-puissants-photophones-sont-a-prix-casse-pour-le-black-friday</link>
      <pubDate>Fri, 28 Nov 2025 07:29:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/honor/2873631_honor-400-magic-v5-magic7-pro-ces-puissants-photophones-sont-a-prix-casse-pour-le-black-friday</guid>
      <description>
HONOR sonne le coup d&#8217;envoi du Black Friday et affiche pour l&#8217;occasion ses meilleurs smartphones, tablettes et PC portables avec de belles remises. Mieux, la marque accompagne certaines r&#233;f&#233;rences de beaux cadeaux.
</description>
    </item>
    <item>
      <title>Windows 11&#160;: le Bloc-notes va h&#233;riter d&#8217;une nouvelle fonction emprunt&#233;e &#224; Microsoft Word</title>
      <link>https://www.01net.com/actualites/windows-11-le-bloc-notes-va-heriter-dune-nouvelle-fonction-empruntee-a-microsoft-word.html</link>
      <pubDate>Fri, 28 Nov 2025 07:22:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311946</guid>
      <description>Microsoft est en train de tester une nouvelle fonctionnalit&#233; dans le Bloc-notes de Windows 11. Comme sur Word, l&#8217;utilitaire permettra bient&#244;t de cr&#233;er des tableaux pour organiser vos donn&#233;es.</description>
    </item>
    <item>
      <title>Xperia 1 VII : le dernier smartphone premium de Sony profite du Black Friday pour baisser son prix</title>
      <link>https://www.frandroid.com/bons-plans/2888563_xperia-1-vii-le-dernier-smartphone-premium-de-sony-profite-du-black-friday-pour-baisser-son-prix</link>
      <pubDate>Fri, 28 Nov 2025 07:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2888563_xperia-1-vii-le-dernier-smartphone-premium-de-sony-profite-du-black-friday-pour-baisser-son-prix</guid>
      <description>
Le Sony Xperia 1 VII est un t&#233;l&#233;phone portable haut de gamme &#224; retrouver pour 1 299 euros au lieu de 1 499 euros sur Amazon pour le Black Friday.
</description>
    </item>
    <item>
      <title>Le gendarme antitrust rejette la plainte de Qwant, qui d&#233;plore &#171;&#160;une &#233;tonnante tol&#233;rance vis-&#224;-vis de Microsoft&#160;&#187;</title>
      <link>https://www.01net.com/actualites/le-gendarme-antitrust-rejette-la-plainte-de-qwant-qui-deplore-une-etonnante-tolerance-vis-a-vis-de-microsoft.html</link>
      <pubDate>Fri, 28 Nov 2025 07:14:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311814</guid>
      <description>L'action en justice de Qwant contre Microsoft, pour pratiques anticoncurrentielles li&#233;es &#224; Bing, a &#233;t&#233; rejet&#233;e. Le moteur de recherche fran&#231;ais a fait appel de la d&#233;cision.</description>
    </item>
    <item>
      <title>Best Black Friday Headphone Deals (2025): Apple, Sony and More</title>
      <link>https://www.wired.com/story/black-friday-headphone-deals-2025/</link>
      <pubDate>Fri, 28 Nov 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">691e4b9bf2b91809d95c122a</guid>
      <description>From AirPods to over-ears, we've tested hundreds of pairs of headphones. Here are the best we've found this shopping holiday.</description>
    </item>
    <item>
      <title>Upgrade your storage for less with this speedy Crucial 2TB NVMe SSD deal at Amazon</title>
      <link>https://www.techradar.com/computing/storage-backup/upgrade-your-storage-for-less-with-this-speedy-crucial-2tb-nvme-ssd-deal-at-amazon</link>
      <pubDate>Fri, 28 Nov 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">Yc3j7GZm2sCCW3YdbxYasX</guid>
      <description>The Crucial T710 2TB NVMe SSD is a great upgrade if you keep running out of space on your PC. It's currently on sale now at Amazon for its lowest ever price.</description>
    </item>
    <item>
      <title>L&#8217;Apple Watch Series 10 &#233;clipserait presque la Series 11 avec cette offre du Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2888227_lapple-watch-series-10-eclipserait-presque-la-series-11-avec-cette-offre-du-black-friday</link>
      <pubDate>Fri, 28 Nov 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2888227_lapple-watch-series-10-eclipserait-presque-la-series-11-avec-cette-offre-du-black-friday</guid>
      <description>
L'Apple Watch Series 10 a certes &#233;t&#233; remplac&#233;e par la Series 11 cette ann&#233;e, mais cette derni&#232;re n'a apport&#233; que tr&#232;s peu de nouveaut&#233;s par rapport &#224; la tocante de 2024. C'est donc la Series 10 qu'on conseille davantage en ce Black Friday, d'autant plus qu'elle est propos&#233;e &#224; 324,99 euros au lieu de 479 euros chez Rakuten.
</description>
    </item>
    <item>
      <title>Google bloque la meilleure application YouTube pour Android TV</title>
      <link>https://www.01net.com/actualites/google-bloque-meilleure-application-youtube-android-tv.html</link>
      <pubDate>Fri, 28 Nov 2025 06:59:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311907</guid>
      <description>Google bloque SmartTube sur Android TV, une application que beaucoup pr&#233;f&#232;rent &#224; YouTube, mais elle devrait bient&#244;t &#234;tre de retour. Explications.</description>
    </item>
    <item>
      <title>The 135+ best Black Friday deals in the UK &#8211; save up to 60% on TVs, laptops, appliances, headphones, and more</title>
      <link>https://www.techradar.com/live/news/the-135-best-black-friday-deals-in-the-uk-save-up-to-60-percent-on-tvs-laptops-appliances-headphones-and-more</link>
      <pubDate>Fri, 28 Nov 2025 06:53:38 +0000</pubDate>
      <guid isPermaLink="false">kJmYWSkHuQyXBRmULBerPH</guid>
      <description>All of today's best Black Friday deals from Amazon, Currys, Argos, Very, John Lewis, and more in one place, hand-picked by the shopping and tech experts at TechRadar.</description>
    </item>
    <item>
      <title>iPhone 17 : le meilleur smartphone Apple du moment atteint un prix in&#233;dit en ce Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2888777_iphone-17-le-meilleur-smartphone-apple-du-moment-atteint-un-prix-inedit-en-ce-black-friday</link>
      <pubDate>Fri, 28 Nov 2025 06:50:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2888777_iphone-17-le-meilleur-smartphone-apple-du-moment-atteint-un-prix-inedit-en-ce-black-friday</guid>
      <description>
Le Black Friday officiel, c'est maintenant. L'une des meilleures offres du jour, c'est l'iPhone 17, aka le meilleur mod&#232;le actuel de la Pomme, qui est propos&#233; &#224; 829 euros au lieu de 969 euros chez Rakuten.
</description>
    </item>
    <item>
      <title>Les &#201;tats-Unis font du &#171;&#8201;chantage&#8201;&#187; pour que l&#8217;Europe abandonne ses lois de r&#233;gulation du num&#233;rique</title>
      <link>https://www.frandroid.com/culture-tech/politique/2889629_les-etats-unis-font-du-chantage-pour-que-leurope-abandonne-ses-lois-de-regulation-du-numerique</link>
      <pubDate>Fri, 28 Nov 2025 06:49:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/politique/2889629_les-etats-unis-font-du-chantage-pour-que-leurope-abandonne-ses-lois-de-regulation-du-numerique</guid>
      <description>
Cible de toutes les pressions depuis sa mise en place, le Digital Markets Act, pierre angulaire de la r&#233;gulation num&#233;rique europ&#233;enne, re&#231;oit des coups de boutoir de l&#8217;administration Trump.
</description>
    </item>
    <item>
      <title>Black Friday PC : voici les offres incontournables de la journ&#233;e ! MacBook, PC gamers, ultraportables&#8230; faites vous plaisir</title>
      <link>https://www.frandroid.com/bons-plans/2889071_black-friday-pc-portable-les-meilleures-offres-de-ce-vendredi</link>
      <pubDate>Fri, 28 Nov 2025 06:47:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2889071_black-friday-pc-portable-les-meilleures-offres-de-ce-vendredi</guid>
      <description>
Le Black Friday sur les PC portables en tout genre permet de d&#233;nicher de vraies bonnes affaires. Ultraportables, PC gamers ou 2 en 1, nous avons s&#233;lectionn&#233; les offres incontournables de la journ&#233;e.
</description>
    </item>
    <item>
      <title>Salon de Tokyo</title>
      <link>https://www.frandroid.com/actualites-generales/2881541_salon-de-tokyo</link>
      <pubDate>Fri, 28 Nov 2025 06:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2881541_salon-de-tokyo</guid>
      <description>Nous sommes all&#233;s &#224; la f&#234;te tech de l&#8217;auto nippone Le centre des congr&#232;s de Tokyo Big Sight, derri&#232;re ses deux pyramides invers&#233;es est un grand parc des expos, construit sur le&#160;polder&#160;de Odaiba&#160;dans la baie de Tokyo. Rappelant feu le Salon de Gen&#232;ve par sa taille ramass&#233;e, l&#8217;opus tokyo&#239;te impressionne toujours par la richesse cr&#233;ative [&#8230;]</description>
    </item>
    <item>
      <title>Samsung TQ65S95F : le plus lumineux et sans reflet des &#233;crans OLED est en promotion pour le Black Friday et perd 1 000 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2888003_samsung-tq65s95f-le-plus-lumineux-et-sans-reflet-des-ecrans-oled-est-en-promotion-pour-le-black-friday-et-perd-1-000-e</link>
      <pubDate>Fri, 28 Nov 2025 06:40:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2888003_samsung-tq65s95f-le-plus-lumineux-et-sans-reflet-des-ecrans-oled-est-en-promotion-pour-le-black-friday-et-perd-1-000-e</guid>
      <description>
Annonc&#233;e au CES 2025 de Las Vegas, la s&#233;rie S95F incarne le sommet du QD-OLED chez Samsung, le genre de t&#233;l&#233;viseur qui rafle presque toutes les m&#233;dailles. Et pour le Black Friday, ce champion baisse la garde : son prix glisse de 2 799 euros &#224; 1 799 euros chez Fnac et Darty.
</description>
    </item>
    <item>
      <title>01net morning&#160;: un clone de Telegram pour les dealers, un botnet a profit&#233; de la panne d&#8217;Amazon et les r&#233;seaux sociaux interdits au moins de 16 ans en Europe&#160;?</title>
      <link>https://www.01net.com/actualites/01net-morning-un-clone-de-telegram-pour-les-dealers-un-botnet-a-profite-de-la-panne-damazon-et-les-reseaux-sociaux-interdits-au-moins-de-16-ans-en-europe.html</link>
      <pubDate>Fri, 28 Nov 2025 06:30:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311869</guid>
      <description>Bonjour &#224; tous, voici la matinale de 01net ! Qu&#8217;avez-vous manqu&#233; hier ? Retrouvez toute l&#8217;actu &#224; connaitre pour d&#233;marrer la journ&#233;e du bon pied !</description>
    </item>
    <item>
      <title>L&#8217;iPhone 17 &#224; son meilleur prix, le MacBook Air M4 &#224; 884 &#8364; : tout Apple est &#224; prix cass&#233; pour le Black Friday [Sponso]</title>
      <link>https://www.frandroid.com/marques/apple/2886217_liphone-17-a-son-meilleur-prix-le-macbook-air-m4-a-884-e-tout-apple-est-a-prix-casse-pour-le-black-friday</link>
      <pubDate>Fri, 28 Nov 2025 06:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2886217_liphone-17-a-son-meilleur-prix-le-macbook-air-m4-a-884-e-tout-apple-est-a-prix-casse-pour-le-black-friday</guid>
      <description>
Alerte bon plan : iPhone, MacBook Air et Apple Watch sont &#224; des prix jamais vus chez Rakuten &#224; l&#8217;occasion du Black Friday.
</description>
    </item>
    <item>
      <title>C&#8217;est le moment de monter votre PC gamer : voici les meilleures offres du Black Friday sur les composants PC</title>
      <link>https://www.frandroid.com/bons-plans/2887763_cest-le-moment-de-monter-votre-pc-gamer-voici-les-meilleures-offres-du-black-friday-sur-les-composants-pc</link>
      <pubDate>Fri, 28 Nov 2025 06:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2887763_cest-le-moment-de-monter-votre-pc-gamer-voici-les-meilleures-offres-du-black-friday-sur-les-composants-pc</guid>
      <description>
Processeur, RAM, carte graphique, SSD, alimentation&#8230; vous aurez besoin de tout un tas de composants pour monter vous-m&#234;mes votre PC fixe de gaming. Le Black Friday est le moment id&#233;al pour rassembler tout cela : les promos sont g&#233;antes. Bienvenue sur la s&#233;lection des meilleurs produits avec les plus grosses r&#233;ductions.
</description>
    </item>
    <item>
      <title>C&#8217;est le forfait 5G sur le r&#233;seau Orange le plus g&#233;n&#233;reux du Black Friday (et de loin)</title>
      <link>https://www.frandroid.com/bons-plans/2888117_cest-le-forfait-5g-sur-le-reseau-orange-le-plus-genereux-du-black-friday-et-de-loin</link>
      <pubDate>Fri, 28 Nov 2025 06:19:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2888117_cest-le-forfait-5g-sur-le-reseau-orange-le-plus-genereux-du-black-friday-et-de-loin</guid>
      <description>
Avec 210 Go de 5G affich&#233;s &#224; partir de 8,99 euros par mois, cette offre Flash sign&#233;e YouPrice frappe tr&#232;s fort. Disponible sur le r&#233;seau d'Orange ou le r&#233;seau de SFR.
</description>
    </item>
    <item>
      <title>Le Black Friday s&#8217;attaque aux &#233;crans PC, souris et claviers ! Notre s&#233;lection des 12 meilleures offres pour refaire son setup PC</title>
      <link>https://www.frandroid.com/bons-plans/2887755_le-black-friday-sattaque-aux-ecrans-pc-souris-et-claviers-notre-selection-des-12-meilleures-offres-pour-refaire-son-setup-pc</link>
      <pubDate>Fri, 28 Nov 2025 06:10:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2887755_le-black-friday-sattaque-aux-ecrans-pc-souris-et-claviers-notre-selection-des-12-meilleures-offres-pour-refaire-son-setup-pc</guid>
      <description>
Le Black Friday met beaucoup en avant les ordinateurs portables, bureautiques ou bien gaming, mais n'oublions pas celles et ceux qui privil&#233;gient les ensembles de bureau. En ce moment, les promotions sur les accessoires pour &#233;quiper son setup pleuvent comme jamais !
</description>
    </item>
    <item>
      <title>Black Friday VPN deals: our survey says you want huge savings &#8211; these three deliver</title>
      <link>https://www.techradar.com/vpn/vpn-services/black-friday-vpn-deals-our-survey-says-you-want-huge-savings-these-three-deliver</link>
      <pubDate>Fri, 28 Nov 2025 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">yNnAaGjvhFQNh2NzgmcMtZ</guid>
      <description>We ran a poll to know what you care about the most when choosing a VPN deal, and most people said "huge discount." These are the top three picks right now.</description>
    </item>
    <item>
      <title>How close is the first solopreneur unicorn?</title>
      <link>https://www.fastcompany.com/91447642/how-close-is-the-first-solopreneur-unicorn</link>
      <pubDate>2025-11-28T06:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91447642/how-close-is-the-first-solopreneur-unicorn</guid>
      <description>Experts say the tools already exist; now it&#8217;s just a matter of time.
Just a handful of years ago, the idea of one person creating a company worth over a billion dollars seemed like a pipe dream. Thanks to rapid advancements in AI, the possibility of a &#8220;solopreneur unicorn&#8221; is less a matter of &#8220;if&#8221; and more a matter of &#8220;when.&#8221;</description>
    </item>
    <item>
      <title>Boulanger y va tr&#232;s fort avec les promotions pour le jour J du Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2888967_boulanger-y-va-tres-fort-avec-les-promotions-pour-le-jour-j-du-black-friday</link>
      <pubDate>Fri, 28 Nov 2025 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2888967_boulanger-y-va-tres-fort-avec-les-promotions-pour-le-jour-j-du-black-friday</guid>
      <description>
Boulanger compte bien tout donner pour lancement du v&#233;ritable Black Friday : prix cass&#233;s sur les t&#233;l&#233;viseurs, smartphones Samsung, Google ou encore Xiaomi, il y a de quoi se faire plaisir ! D&#233;couvrez toutes les offres que nous vous recommandons dans cette s&#233;lection mise &#224; jour en temps r&#233;el.&#160;
</description>
    </item>
    <item>
      <title>I review graphics cards for a living, and prices are as low as I've seen all year thanks to these Black Friday GPU deals</title>
      <link>https://www.techradar.com/computing/gpu/i-review-graphics-cards-for-a-living-and-prices-are-as-low-as-ive-seen-all-year-thanks-to-these-black-friday-gpu-deals</link>
      <pubDate>Fri, 28 Nov 2025 05:53:47 +0000</pubDate>
      <guid isPermaLink="false">Bwpchvqzs9VxfS5xfSxvCd</guid>
      <description>Graphics card prices have been out of control this year, but with these Black Friday graphics card deals, you can get the card you want for near or even below MSRP.</description>
    </item>
    <item>
      <title>The 34 best Lego Black Friday deals to shop right now at Amazon</title>
      <link>https://www.techradar.com/streaming/entertainment/the-34-best-lego-black-friday-deals-to-shop-right-now-at-amazon</link>
      <pubDate>Fri, 28 Nov 2025 05:52:28 +0000</pubDate>
      <guid isPermaLink="false">nN5UHFyAHFspw4jza6aeVP</guid>
      <description>This Black Friday, you can score some really great mini Lego builds that make the perfect stocking stuffer for under $10, as well as save on Star Wars, Creator, Classic, Disney, and Technic sets at Amazon.</description>
    </item>
    <item>
      <title>Amazon se montre bien g&#233;n&#233;reux pour le Black Friday avec une myriade d&#8217;offres sur les produits Tech les plus populaires</title>
      <link>https://www.frandroid.com/bons-plans/2889201_amazon-se-montre-bien-genereux-pour-le-black-friday-avec-une-myriade-doffres-sur-les-produits-tech-les-plus-populaires</link>
      <pubDate>Fri, 28 Nov 2025 05:50:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2889201_amazon-se-montre-bien-genereux-pour-le-black-friday-avec-une-myriade-doffres-sur-les-produits-tech-les-plus-populaires</guid>
      <description>
Ce vendredi 28 novembre sonne le TOP d&#233;part du Black Friday : le g&#233;ant am&#233;ricain a de belles p&#233;pites &#224; proposer pour l'occasion :&#160;Smartphones, &#233;couteurs, t&#233;l&#233;viseurs&#8230; Voici celles qui ont retenu notre attention.
</description>
    </item>
  </channel>
</rss>
