<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 28 Jan 2026 08:38:58 GMT</lastBuildDate>
    <item>
      <title>Windows&#160;: m&#233;fiez-vous des CAPTCHA, ils peuvent vous faire installer un virus</title>
      <link>https://www.01net.com/actualites/windows-mefiez-vous-captcha-peuvent-vous-faire-installer-virus.html</link>
      <pubDate>Wed, 28 Jan 2026 08:25:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322880</guid>
      <description>Une nouvelle cyberattaque ClickFix vise les utilisateurs Windows. L'attaque repose sur une page web pi&#233;g&#233;e avec un faux CAPTCHA qui va vous demander de copier&#8209;coller une simple commande. En ob&#233;issant, vous ouvrez les portes de votre ordinateur &#224; un redoutable virus, Amatera.</description>
    </item>
    <item>
      <title>Samsung veut vendre un million de Galaxy Wide Fold&#8230; mais c&#8217;est quoi le Galaxy Wide Fold ?</title>
      <link>https://www.frandroid.com/marques/samsung/2957413_samsung-veut-vendre-un-million-de-galaxy-wide-fold-mais-cest-quoi-le-galaxy-wide-fold</link>
      <pubDate>Wed, 28 Jan 2026 08:23:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2957413_samsung-veut-vendre-un-million-de-galaxy-wide-fold-mais-cest-quoi-le-galaxy-wide-fold</guid>
      <description>
Un Samsung Galaxy Wide Fold au format in&#233;dit pourrait voir le jour en r&#233;ponse directe &#224; l'iPhone Fold d'Apple. Voici tout ce que l'on sait.
</description>
    </item>
    <item>
      <title>Intel Panther Lake : les premiers prix du Core Ultra X7 358H piquent, on les a compar&#233;s au MacBook Pro</title>
      <link>https://www.frandroid.com/marques/intel/2957435_intel-panther-lake-les-premiers-prix-du-core-ultra-x7-358h-piquent-on-les-a-compares-au-macbook-pro</link>
      <pubDate>Wed, 28 Jan 2026 08:19:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/intel/2957435_intel-panther-lake-les-premiers-prix-du-core-ultra-x7-358h-piquent-on-les-a-compares-au-macbook-pro</guid>
      <description>
Intel Panther Lake (Series 3) est officiellement dans la nature. Sur le papier, le Core Ultra X7 358H est une petite bombe d'efficacit&#233;. Mais entre un Dell XPS 14 ind&#233;cent et un MSI Prestige plus raisonnable, attention.
</description>
    </item>
    <item>
      <title>Boulanger casse d&#233;j&#224; le prix des nouveaux &#233;couteurs ouverts de Huawei, taill&#233;s pour le sport</title>
      <link>https://www.frandroid.com/bons-plans/2956729_boulanger-casse-deja-le-prix-des-nouveaux-ecouteurs-ouverts-de-huawei-tailles-pour-le-sport</link>
      <pubDate>Wed, 28 Jan 2026 08:05:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2956729_boulanger-casse-deja-le-prix-des-nouveaux-ecouteurs-ouverts-de-huawei-tailles-pour-le-sport</guid>
      <description>
Huawei retente l&#8217;exp&#233;rience des &#233;couteurs ouverts avec les FreeClip&#8201;2, qui misent sur un&#160;meilleur confort&#160;et un&#160;son am&#233;lior&#233;. Parfaits pour le&#160;sport ou les d&#233;placements en ext&#233;rieur, ils profitent d&#233;j&#224; d&#8217;une&#160;remise de 30&#8201;euros&#160;&#224; l&#8217;occasion des&#160;soldes d&#8217;hiver&#8201;2026.
</description>
    </item>
    <item>
      <title>Microsoft soigne enfin l&#8217;interface du Xbox Cloud Gaming</title>
      <link>https://www.01net.com/actualites/microsoft-soigne-enfin-linterface-du-xbox-cloud-gaming.html</link>
      <pubDate>Wed, 28 Jan 2026 08:01:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322860</guid>
      <description>Le streaming de jeux est une pierre angulaire de de Microsoft qui veut mettre une &#171; Xbox &#187;&#160;entre les mains d'un maximum de joueurs, qu'ils soient &#233;quip&#233;s d'une Xbox, d'un PC&#8230; ou de n'importe quel autre appareil muni d'un &#233;cran et d'une connexion internet ! Il faut cependant soigner les d&#233;tails, &#224; commencer par une interface qui soit &#224; la mesure des attentes. C'est d&#233;sormais chose faite....</description>
    </item>
    <item>
      <title>The best E Ink tablets for 2026</title>
      <link>https://www.engadget.com/mobile/tablets/best-e-ink-tablet-130037939.html?src=rss</link>
      <pubDate>Wed, 28 Jan 2026 08:00:36 +0000</pubDate>
      <guid isPermaLink="false">57f41413-eec2-4d90-9c25-26d144b737b8</guid>
      <description>E Ink tablets have always been intriguing to me because I&#8217;m a longtime lover of pen and paper. I&#8217;ve had probably hundreds of notebooks over the years, serving as repositories for my story ideas, to-do lists, meeting notes and everything in between. However, I turned away from physical notebooks at a certain point because it was just easier to store everything digitally so I always had my most important information at my fingertips.E Ink tablets seem to provide the best of both worlds: the tactile satisfaction of regular notebooks with many of the conveniences found in digital tools, plus easy-...</description>
    </item>
    <item>
      <title>Wonder Man ending explained: what happens to Simon and Trevor, and more on the new Marvel TV show's finale</title>
      <link>https://www.techradar.com/streaming/disney-plus/wonder-man-ending-explained</link>
      <pubDate>Wed, 28 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">9U9rAuxPNLvpPG7md6kmvM</guid>
      <description>Want to know what the future might hold for Simon Williams and Trevor Slattery in the MCU? TechRadar has got you covered.</description>
    </item>
    <item>
      <title>&#171;&#8201;Instagram est une drogue&#8201;&#187;&#160;: des documents internes &#224; Meta ravivent les critiques sur la nocivit&#233; des r&#233;seaux sociaux</title>
      <link>https://www.frandroid.com/marques/meta/2957377_instagram-est-une-drogue-des-documents-internes-a-meta-ravivent-les-critiques-sur-la-nocivite-des-reseaux-sociaux</link>
      <pubDate>Wed, 28 Jan 2026 07:53:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2957377_instagram-est-une-drogue-des-documents-internes-a-meta-ravivent-les-critiques-sur-la-nocivite-des-reseaux-sociaux</guid>
      <description>
Dans un proc&#232;s assez m&#233;diatis&#233; aux &#201;tats-Unis, des documents internes &#224; Meta semblent indiquer que la firme avait conscience des effets d&#233;l&#233;t&#232;res de ses applis sur la sant&#233; mentale des plus jeunes, mais a redoubl&#233; d&#8217;efforts plut&#244;t que de se remettre en question.
</description>
    </item>
    <item>
      <title>Apple serre les dents&#160;: malgr&#233; la flamb&#233;e de la m&#233;moire, les prix de l&#8217;iPhone 18 ne s&#8217;envoleraient pas</title>
      <link>https://www.01net.com/actualites/apple-serre-les-dents-malgre-la-flambee-de-la-memoire-les-prix-de-liphone-18-ne-senvoleraient-pas.html</link>
      <pubDate>Wed, 28 Jan 2026 07:30:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322857</guid>
      <description>Les prix de la future gamme d'iPhone 18 vont-ils flamber ? Cela aurait une certaine logique, vu la flamb&#233;e des co&#251;ts de la m&#233;moire. Mais heureusement pour les consommateurs, Apple pourrait mettre &#224; profit sa force de frappe pour limiter la casse.</description>
    </item>
    <item>
      <title>WhatsApp songe &#224; un abonnement payant en France pour &#233;viter la pub dans l&#8217;application</title>
      <link>https://www.frandroid.com/android/applications/2957363_whatsapp-songe-a-un-abonnement-payant-pour-eviter-la-pub-dans-lapplication</link>
      <pubDate>Wed, 28 Jan 2026 07:25:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/applications/2957363_whatsapp-songe-a-un-abonnement-payant-pour-eviter-la-pub-dans-lapplication</guid>
      <description>
WhatsApp travaille sur un abonnement &#224; 4 euros par mois en Europe pour &#233;viter l'affichage de publicit&#233;s dans l'onglet Actus de l'application.
</description>
    </item>
    <item>
      <title>Prise en main Xgimi Elfin Flip&#160;: le projecteur le plus astucieux du march&#233; est aussi l&#8217;un des moins chers</title>
      <link>https://www.01net.com/actualites/test-xgimi-elfin-flip-avis.html</link>
      <pubDate>Wed, 28 Jan 2026 07:18:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320706</guid>
      <description>Successeur spirituel de l&#8217;Elfin premier du nom, ce nouveau mod&#232;le &#171;&#160;Flip&#160;&#187; mise tout sur un design pliant ing&#233;nieux et une ultra-portabilit&#233;. &#192; moins de 400 euros, ce projecteur Full HD promet d&#8217;emporter Netflix partout avec vous. Mais derri&#232;re son format livre de poche, l'image est-elle &#224; la hauteur pour vos soir&#233;es cin&#233;ma ?</description>
    </item>
    <item>
      <title>Ce forfait mobile 5G cach&#233; de 300 Go &#224; moins de 10&#160;euros est introuvable&#8230; sauf si vous connaissez l&#8217;astuce</title>
      <link>https://www.frandroid.com/bons-plans/2956187_ce-forfait-mobile-5g-cache-de-300-go-a-moins-de-10-euros-est-introuvable-sauf-si-vous-connaissez-lastuce</link>
      <pubDate>Wed, 28 Jan 2026 07:10:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2956187_ce-forfait-mobile-5g-cache-de-300-go-a-moins-de-10-euros-est-introuvable-sauf-si-vous-connaissez-lastuce</guid>
      <description>
Une simple manipulation sur le site de l'op&#233;rateur permet de d&#233;bloquer une offre secr&#232;te... 300 Go de data en 5G pour seulement 9,99&#160;euros par mois. Une astuce &#224; conna&#238;tre absolument pour profiter de ce tarif exclusif avant qu'il ne disparaisse.
</description>
    </item>
    <item>
      <title>Reanimal sur PC : quelles configurations pr&#233;voir pour le jeu d&#8217;horreur ?</title>
      <link>https://www.frandroid.com/guide-dachat/2956177_reanimal-sur-pc-quelles-configurations-prevoir-pour-le-jeu-dhorreur</link>
      <pubDate>Wed, 28 Jan 2026 07:07:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2956177_reanimal-sur-pc-quelles-configurations-prevoir-pour-le-jeu-dhorreur</guid>
      <description>
Reanimal marque le retour des cr&#233;ateurs de Little Nightmares. Pr&#234;ts &#224; survivre &#224; un nouveau monde glauque et horrifique ? Qu'en est-il de votre PC gamer ?
</description>
    </item>
    <item>
      <title>Fuite de donn&#233;es crypto&#160;: la startup Waltio d&#233;ment toute tentative de dissimulation</title>
      <link>https://www.01net.com/actualites/fuite-donnees-touche-50-000-investisseurs-crypto-france.html</link>
      <pubDate>Wed, 28 Jan 2026 07:00:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322352</guid>
      <description>La plateforme fran&#231;aise Waltio, sp&#233;cialis&#233;e dans la fiscalit&#233; des cryptomonnaies, vient d'&#234;tre victime d'une cyberattaque. Revendiqu&#233;e par le gang Sjiny Hunters, l'attaque a permis de voler les donn&#233;es de 50 000 investisseurs fran&#231;ais. Ceux-ci risquent de se retrouver dans le viseur des criminels sp&#233;cialis&#233;s dans l'extorsion. Alors que des sources r&#233;v&#232;lent d'autres fuites survenues chez Waltio l'an dernier, la start-up fran&#231;aise d&#233;ment avoir voulu cacher la violation....</description>
    </item>
    <item>
      <title>Google d&#233;voile de nouvelles fonctions de protection contre le vol pour les smartphones Android</title>
      <link>https://www.01net.com/actualites/google-devoile-de-nouvelles-fonctions-de-protection-contre-le-vol-pour-les-smartphones-android.html</link>
      <pubDate>Wed, 28 Jan 2026 07:00:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322854</guid>
      <description>Google renforce les m&#233;canismes de protection des smartphones Android, en lan&#231;ant des nouveaut&#233;s et des am&#233;liorations qui vont  rendre la vie des voleurs plus difficile.</description>
    </item>
    <item>
      <title>How to watch Shrinking season 3 online from anywhere &#8212; stream the heart-warming comedy</title>
      <link>https://www.techradar.com/how-to-watch/shrinking-season-3</link>
      <pubDate>Wed, 28 Jan 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">JyHU5CGFdveMKkeA2WA8ii</guid>
      <description>Can Paul and Jimmy move forward with acceptance and forgiveness? Here&#8217;s how you can watch Shrinking season 3 online and from anywhere.</description>
    </item>
    <item>
      <title>Why agentic AI belongs on every CEO&#8217;s 2026 roadmap</title>
      <link>https://www.fastcompany.com/91474411/why-agentic-ai-belongs-on-every-ceos-2026-roadmap</link>
      <pubDate>2026-01-28T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91474411/why-agentic-ai-belongs-on-every-ceos-2026-roadmap</guid>
      <description>Most companies using generative AI report little to no bottom-line impact. Agents, the next frontier in AI, can change that.
You know the ancient proverb: Give a man a fish, and you feed him for a day; teach a man to fish, and you feed him for a lifetime.</description>
    </item>
    <item>
      <title>Google Messages d&#233;voile son nouveau s&#233;lecteur de photos&#160;: voici ce qui change</title>
      <link>https://www.01net.com/actualites/google-messages-devoile-nouveau-selecteur-photos.html</link>
      <pubDate>Wed, 28 Jan 2026 06:56:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322865</guid>
      <description>Google int&#232;gre d&#233;sormais directement le s&#233;lecteur de photos d'Android &#224; son application Messages. Voici &#224; quoi cela ressemble.</description>
    </item>
    <item>
      <title>Apple, OpenAI, Anthropic : les patrons de la Silicon Valley critiquent timidement la police de Donald Trump</title>
      <link>https://www.frandroid.com/culture-tech/politique/2957353_les-pdg-de-la-silicon-valley-critiquent-timidement-les-agissements-de-la-police-americaine</link>
      <pubDate>Wed, 28 Jan 2026 06:45:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/politique/2957353_les-pdg-de-la-silicon-valley-critiquent-timidement-les-agissements-de-la-police-americaine</guid>
      <description>
Apr&#232;s avoir longtemps &#233;t&#233; accus&#233;s de collaborer avec un pouvoir trumpiste autoritaire, les PDG de la Silicon Valley ont commenc&#233; &#224; condamner discr&#232;tement les pratiques de la police de l&#8217;immigration &#233;tasunienne.
</description>
    </item>
    <item>
      <title>We-Vibe Discount Codes and Deals: Up to 60% Off</title>
      <link>https://www.wired.com/story/we-vibe-discount-code/</link>
      <pubDate>Wed, 28 Jan 2026 06:41:00 +0000</pubDate>
      <guid isPermaLink="false">697904dcb7a2a6fecffbb94f</guid>
      <description>Save on We-Vibe, including app-controlled bestsellers and popular gift sets designed for couples, connection, and shared pleasure.</description>
    </item>
  </channel>
</rss>
