<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 20 Nov 2025 13:38:15 GMT</lastBuildDate>
    <item>
      <title>Les Copilot+&#160;PC sont un peu plus joueurs</title>
      <link>https://www.01net.com/actualites/les-copilot-pc-sont-un-peu-plus-joueurs.html</link>
      <pubDate>Thu, 20 Nov 2025 13:36:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309656</guid>
      <description>Les PC fonctionnant avec Windows sur Arm ont plein de qualit&#233;s, mais &#231;a gal&#232;re toujours pour les jeux vid&#233;o. Qualcomm et Microsoft am&#233;liorent tout de m&#234;me les choses, &#224; coups de nouveaux pilotes, d'optimisations et d&#8217;un support &#233;largi pour certains jeux populaires.</description>
    </item>
    <item>
      <title>Pok&#233;mon Legends: Z-A - Mega Dimension DLC will add Mega Zeraora, but Game Freak says it 'might be a little difficult' to obtain</title>
      <link>https://www.techradar.com/gaming/pokemon-legends-z-a-mega-dimension-dlc-will-add-mega-zeraora-but-game-freak-says-it-might-be-a-little-difficult-to-obtain</link>
      <pubDate>Thu, 20 Nov 2025 13:31:04 +0000</pubDate>
      <guid isPermaLink="false">2exb56AfbEJZZBWozzAmgN</guid>
      <description>Game Freak has teased a brand new Mega-Evolved Pok&#233;mon ahead of the release of Pok&#233;mon Legends: Z-A's Mega Dimension expansion, but warns they might be a bit of a challenge to obtain.</description>
    </item>
    <item>
      <title>Sisterhood of the Best Travel Pants: Best Travel Trousers (2025)</title>
      <link>https://www.wired.com/gallery/the-sisterhood-of-the-traveling-pants/</link>
      <pubDate>Thu, 20 Nov 2025 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">690cdb004822932f4e54992c</guid>
      <description>Travel pants that are tough enough to handle hangry moods and unplanned delays.</description>
    </item>
    <item>
      <title>The FCC wants to roll back steps meant to stop a repeat of a massive telecom hack</title>
      <link>https://www.theverge.com/policy/824508/fcc-telecom-salt-typhoon-hack</link>
      <pubDate>2025-11-20T08:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=824508</guid>
      <description>After one of the biggest telecom hacks in US history, the Federal Communications Commission (FCC) moved to enforce strict standards on carriers' cybersecurity measures. On Thursday, the agency is set to vote to roll back those requirements, arguing they were an unnecessary overstep of its authority. The China-linked Salt Typhoon hack revealed last year impacted [&#8230;]...</description>
    </item>
    <item>
      <title>287 &#8364; pour marcher en travaillant : pourquoi le Walkingpad Z1 vaut le coup</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/2878521_287-e-pour-marcher-en-travaillant-pourquoi-le-walkingpad-z1-vaut-le-coup</link>
      <pubDate>Thu, 20 Nov 2025 13:29:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/2878521_287-e-pour-marcher-en-travaillant-pourquoi-le-walkingpad-z1-vaut-le-coup</guid>
      <description>
Rester assis huit heures par jour, c'est fini. Amazon propose une r&#233;duction solide sur le Walkingpad Z1, un tapis compact capable de se faire oublier une fois votre session termin&#233;e.
</description>
    </item>
    <item>
      <title>&#8216;Hawk Tuah&#8217; Girl Added to Lawsuit Over Alleged Crypto Memecoin Fraud</title>
      <link>https://gizmodo.com/hawk-tuah-girl-added-to-lawsuit-over-alleged-crypto-memecoin-fraud-2000688482</link>
      <pubDate>Thu, 20 Nov 2025 13:25:22 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000688482</guid>
      <description>The suit claims that the HAWK coin was rigged from the start to inflate its value rapidly before crashing.</description>
    </item>
    <item>
      <title>Trump administration wants to use federal power to challenge state AI laws</title>
      <link>https://www.techradar.com/pro/security/trump-administration-wants-to-use-federal-power-to-challenge-state-ai-laws</link>
      <pubDate>Thu, 20 Nov 2025 13:25:00 +0000</pubDate>
      <guid isPermaLink="false">QZQFMAT2QVQQTUxS8JdLSH</guid>
      <description>States trying to regulate AI could be overruled by Trump&#8217;s federal task force.</description>
    </item>
    <item>
      <title>Your secret weapon against cleaning chores! Up to 50% off at Tineco this Black Friday</title>
      <link>https://www.techradar.com/seasonal-sales/your-secret-weapon-against-cleaning-chores-up-to-50-percent-off-at-tineco-this-black-friday</link>
      <pubDate>Thu, 20 Nov 2025 13:24:13 +0000</pubDate>
      <guid isPermaLink="false">4Kdd7QGwVNCxzTiq6VheRM</guid>
      <description>Your secret weapon against cleaning chores! Up to 50% off at Tineco this Black Friday</description>
    </item>
    <item>
      <title>La Black Friday Week a officiellement d&#233;but&#233; sur Amazon : voici les meilleures offres en DIRECT</title>
      <link>https://www.frandroid.com/bons-plans/2876855_la-black-friday-week-commence-officiellement-sur-amazon-voici-les-meilleures-offres-en-direct</link>
      <pubDate>Thu, 20 Nov 2025 13:21:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2876855_la-black-friday-week-commence-officiellement-sur-amazon-voici-les-meilleures-offres-en-direct</guid>
      <description>
C'est le lancement de la Black Friday Week sur Amazon, mais aussi chez d'autres e-commer&#231;ants comme Fnac, Darty, Boulanger ou encore Cdiscount, qui suivront le pas sous peu. C'est donc le bon moment pour faire une excellente affaire sur votre prochain smartphone, tablette, PC portable, TV, etc. Vous retrouverez les meilleures offres Tech en temps r&#233;el dans cet article. 
...</description>
    </item>
    <item>
      <title>Les jouets dot&#233;s de l&#8217;IA d&#233;conseill&#233;s par des associations de d&#233;fense des enfants</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-11-20/les-jouets-dotes-de-l-ia-deconseilles-par-des-associations-de-defense-des-enfants.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Thu, 20 Nov 2025 08:20:46 -0500</pubDate>
      <guid isPermaLink="false">5da4bf12a6a630059c0923ba15d7c297</guid>
      <description>Ils sont mignons, voire c&#226;lins, et promettent d&#8217;apprendre et de tenir compagnie, mais les jouets dot&#233;s d&#8217;intelligence artificielle ne sont pas sans danger pour les enfants, selon des associations de d&#233;fense des enfants et des consommateurs qui exhortent les parents &#224; ne pas les acheter pendant les f&#234;tes de fin d&#8217;ann&#233;e.</description>
    </item>
    <item>
      <title>La Black Friday Week sur les v&#233;los &#233;lectriques, tous &#224; bicyclette avant le jour J : les meilleurs deals</title>
      <link>https://www.frandroid.com/bons-plans/2860283_black-friday-velos-electriques-selection-meilleures-offres</link>
      <pubDate>Thu, 20 Nov 2025 13:20:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860283_black-friday-velos-electriques-selection-meilleures-offres</guid>
      <description>
Les offres du Black Friday Week sont toujours aussi attractives. Les v&#233;los &#233;lectriques b&#233;n&#233;ficient eux aussi de promotions et c'est ce que nous vous d&#233;voilons dans notre s&#233;lection des meilleures promos sur les VAE. 
</description>
    </item>
    <item>
      <title>Sortera is turning America&#8217;s scrap aluminum problem into cash</title>
      <link>https://techcrunch.com/2025/11/20/sortera-is-turning-americas-scrap-aluminum-problem-into-cash/</link>
      <pubDate>Thu, 20 Nov 2025 13:20:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069395</guid>
      <description>Sortera has developed an AI-guided system to sort scrap aluminum by specific grades. The startup is building a second sorting facility in Tennessee.</description>
    </item>
    <item>
      <title>60+ early Black Friday deals: Score huge discounts on MacBooks, Nintendo Switch 2, Keurig, and Garmin</title>
      <link>https://mashable.com/article/best-early-black-friday-2025-deals</link>
      <pubDate>Thu, 20 Nov 2025 13:18:14 +0000</pubDate>
      <guid isPermaLink="false">06p5xyMWkjc7AXM74NU6WDP</guid>
      <description>We found the latest early Black Friday deals on Apple products, robot vacuums, headphones, power stations, Legos, and tons more goodies.</description>
    </item>
    <item>
      <title>Black Friday 2025: Get live updates on the latest sales, doorbusters, and deal drops</title>
      <link>https://mashable.com/live/black-friday-deals-live-updates-2025</link>
      <pubDate>Thu, 20 Nov 2025 13:15:33 +0000</pubDate>
      <guid isPermaLink="false">01mHnaruvo8I2B8GKGTKjOq</guid>
      <description>Get live updates on Black Friday sales. We found savings of $150 on Dyson Supersonic hair dryers and $300 on Samsung TVs.</description>
    </item>
    <item>
      <title>The creator-favorite DJI Mic Mini has hit a new record-low price at Amazon &#8212; save over $90 this Black Friday</title>
      <link>https://mashable.com/article/nov-20-creator-favorite-dji-mic-mini-record-low-price-deal</link>
      <pubDate>Thu, 20 Nov 2025 13:13:30 +0000</pubDate>
      <guid isPermaLink="false">06kw4w7g8XDki0RfR3qfjzX</guid>
      <description>Get the best DJI deal in the Amazon Black Friday sale. The DJI Mic Mini (2 TX + 1 RX + Charging Case) is on sale for over $90 off.</description>
    </item>
    <item>
      <title>Quick! The Fitbit Charge 6 is at a record-low price right now &#8211; and it's one of our favorite fitness trackers</title>
      <link>https://www.techradar.com/seasonal-sales/quick-the-fitbit-charge-6-is-at-a-record-low-price-right-now-and-its-one-of-our-favorite-fitness-trackers</link>
      <pubDate>Thu, 20 Nov 2025 13:05:09 +0000</pubDate>
      <guid isPermaLink="false">dVMHSUbTs96hEheELubdD7</guid>
      <description>Save up to 40% on Fitbit Charge 6 in Amazon's huge Black Friday event.</description>
    </item>
    <item>
      <title>Galaxy Watch : ces deux montres Samsung passent &#224; leur tour vers Wear OS 6 avec la mise &#224; jour One UI 8 Watch</title>
      <link>https://www.frandroid.com/marques/samsung/2878041_galaxy-watch-ces-deux-montres-samsung-passent-a-leur-tour-vers-wear-os-6-avec-la-mise-a-jour-one-ui-8-watch</link>
      <pubDate>Thu, 20 Nov 2025 13:05:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2878041_galaxy-watch-ces-deux-montres-samsung-passent-a-leur-tour-vers-wear-os-6-avec-la-mise-a-jour-one-ui-8-watch</guid>
      <description>
Apr&#232;s les Galaxy Watch 8 lanc&#233;es nativement sous la derni&#232;re version de One UI Watch, puis la Galaxy Watch 7, c'est au tour des Galaxy Watch 6 d'&#234;tre mises &#224; jour. 
</description>
    </item>
    <item>
      <title>Finland&#8217;s NestAI lands &#8364;100M, partners with Nokia to build AI for defense applications</title>
      <link>https://techcrunch.com/2025/11/20/finlands-nestai-lands-e100m-partners-with-nokia-to-build-ai-for-defense-applications/</link>
      <pubDate>Thu, 20 Nov 2025 13:04:11 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069486</guid>
      <description>Finnish startup NestAI said it has raised &#8364;100 million to build "Europe's leading physical AI lab."</description>
    </item>
    <item>
      <title>Paradromics Gets FDA Approval to Trial Its Brain Implant in People</title>
      <link>https://www.wired.com/story/paradromics-gets-fda-approval-to-trial-its-brain-implant-in-people/</link>
      <pubDate>Thu, 20 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">691c855c5b50fe7f8826aa99</guid>
      <description>The Austin-based startup will test its high-bandwidth device to help restore speech in people with extremely limited movement.</description>
    </item>
    <item>
      <title>ModRetro Chromatic Review: Chic and Durable</title>
      <link>https://www.wired.com/review/modretro-chromatic/</link>
      <pubDate>Thu, 20 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">691e335c3f721f22615483d5</guid>
      <description>This Game Boy clone is an uncompromising approach to the ultimate gamer nostalgia. But there are better options out there.</description>
    </item>
    <item>
      <title>10 Best Early Black Friday Deals at Best Buy (2025)</title>
      <link>https://www.wired.com/story/early-black-friday-best-buy-deals/</link>
      <pubDate>Thu, 20 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">691b78c0cac069ace2d1a5d4</guid>
      <description>The main event hasn't started, but Best Buy has already rolled out great deals on our favorite tech of the year.</description>
    </item>
    <item>
      <title>Camera support could be the boost Matter needs</title>
      <link>https://www.theverge.com/tech/821707/matter-smart-home-standard-supports-cameras-apple-ring-google-nest</link>
      <pubDate>2025-11-20T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=821707</guid>
      <description>It's finally happening. Three years after Matter launched, the interoperability standard now includes the most popular smart home devices: cameras. The Matter 1.5 spec, announced today, adds support for all types of video cameras - from indoor and outdoor, wired and battery-powered cameras, to video doorbells, baby monitors, pet cams, and more. Matter support should [&#8230;]...</description>
    </item>
    <item>
      <title>Black Friday 360 camera deals &#8211; my expert picks from DJI, GoPro, Insta360 and more</title>
      <link>https://www.techradar.com/cameras/360-cameras/black-friday-360-camera-deals-my-expert-picks-from-dji-gopro-insta360-and-more</link>
      <pubDate>Thu, 20 Nov 2025 12:59:27 +0000</pubDate>
      <guid isPermaLink="false">yeaCzpTULM73T2PQrqjtQ9</guid>
      <description>There are price cuts on all of the best 360 cameras from DJI, GoPro, Insta360 and more. Here are my top picks.</description>
    </item>
    <item>
      <title>The best earbuds of 2025 just crashed to their lowest ever price &#8211;run for these Technics!</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/the-best-earbuds-of-2025-just-crashed-to-their-lowest-ever-price-run-for-these-technics</link>
      <pubDate>Thu, 20 Nov 2025 12:55:01 +0000</pubDate>
      <guid isPermaLink="false">hgjGcTMPhebhUF6rA6amt7</guid>
      <description>Technics' excellent EAH-AZ100 simply can't be bettered when it comes to audio quality, and at this all-new lowest-seen price, there's no better time if it's got to be the best&#8230;</description>
    </item>
    <item>
      <title>La Black Friday Week s&#8217;attaque &#224; la domotique avec des offres folles sur les airfryers, cam&#233;ras, ampoules et sonnettes connect&#233;es</title>
      <link>https://www.frandroid.com/bons-plans/2858095_black-friday-airfryers-cameras-ampoules-meilleures-promos</link>
      <pubDate>Thu, 20 Nov 2025 12:45:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2858095_black-friday-airfryers-cameras-ampoules-meilleures-promos</guid>
      <description>
Air fryer, ampoules connect&#233;es ou cam&#233;ras de surveillance&#8230; Les incontournables de la maison intelligente profitent d&#233;j&#224; de r&#233;ductions avant le Black Friday. C&#8217;est l&#8217;occasion parfaite de d&#233;couvrir la domotique ou d&#8217;enrichir votre &#233;quipement gr&#226;ce &#224; notre s&#233;lection des meilleures offres du moment.
</description>
    </item>
    <item>
      <title>Beat the DJI ban over Black Friday &#8212; get the best-ever price on the DJI Mini 4K drone at Amazon</title>
      <link>https://mashable.com/article/nov-20-dji-drone-deal</link>
      <pubDate>Thu, 20 Nov 2025 12:43:24 +0000</pubDate>
      <guid isPermaLink="false">01kIfAZ3hNjZ5U9DvXxGEQ8</guid>
      <description>Get the best-ever price for the DJI Mini 4K drone. The DJI Mini 4K drone is on sale for $239 in the Amazon Black Friday sale.</description>
    </item>
    <item>
      <title>11 Best Protein Powders, According to Years of Testing (2025)</title>
      <link>https://www.wired.com/gallery/best-protein-powders/</link>
      <pubDate>Thu, 20 Nov 2025 12:30:00 +0000</pubDate>
      <guid isPermaLink="false">67df14a66e8fc14316580a6a</guid>
      <description>We found the best protein powders that won&#8217;t make your shake taste like drywall.</description>
    </item>
    <item>
      <title>Why wait for the Steam Machine when you can build your own? Start it off with these Black Friday AMD Radeon 9060 XT deals</title>
      <link>https://www.techradar.com/seasonal-sales/why-wait-for-the-steam-machine-when-you-can-build-your-own-start-it-off-with-these-black-friday-amd-radeon-9060-xt-deals</link>
      <pubDate>Thu, 20 Nov 2025 12:28:53 +0000</pubDate>
      <guid isPermaLink="false">Tn3LHubmKxtmbqBRAHiSdH</guid>
      <description>GPU prices may be on the rise, but that won't stop Black Friday from slashing them for your next PC build.</description>
    </item>
    <item>
      <title>Galaxy Buds 4 Pro : une fonction in&#233;dite pour le bo&#238;tier, mais pas pour les &#233;couteurs ?</title>
      <link>https://www.frandroid.com/marques/samsung/2878453_galaxy-buds-4-pro-une-fonction-inedite-pour-le-boitier-mais-pas-pour-les-ecouteurs</link>
      <pubDate>Thu, 20 Nov 2025 12:27:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2878453_galaxy-buds-4-pro-une-fonction-inedite-pour-le-boitier-mais-pas-pour-les-ecouteurs</guid>
      <description>
Samsung pr&#233;pare une nouvelle g&#233;n&#233;ration d&#8217;&#233;couteurs true wireless, les Galaxy Buds 4 Pro, qui devraient introduire la pr&#233;sence d&#8217;un bouton physique sur le bo&#238;tier pour faire sonner le smartphone associ&#233; et pourraient int&#233;grer un haut&#8209;parleur d&#233;di&#233; &#224; la localisation.
</description>
    </item>
    <item>
      <title>2025 Black Friday ads: Best deals from Walmart, Amazon, Best Buy, Kohls, Target, Home Depot, and more</title>
      <link>https://mashable.com/article/2025-black-friday-ads-deals-walmart-amazon-kohls-best-buy-target</link>
      <pubDate>Thu, 20 Nov 2025 12:19:34 +0000</pubDate>
      <guid isPermaLink="false">01ELCHrfZyNSburvBgH89bW</guid>
      <description>Black Friday Ads. Browse the best deals from Black Friday ads from Amazon, Target, Best Buy, Walmart, Home Depot, and more in 2025.</description>
    </item>
    <item>
      <title>Ghost of Yotei will get New Game Plus in a free update next week, along with 30 new cosmetics, extra photo mode features, and more</title>
      <link>https://www.techradar.com/gaming/ghost-of-yotei-will-get-new-game-plus-in-a-free-update-next-week-along-with-30-new-cosmetics-extra-photo-mode-features-and-more</link>
      <pubDate>Thu, 20 Nov 2025 12:14:54 +0000</pubDate>
      <guid isPermaLink="false">R5fC2kF4Qx2a2zrHZ3suJj</guid>
      <description>Sucker Punch Productions has announced that a free patch will be released for Ghost of Yotei next week, offering a slew of new features.</description>
    </item>
    <item>
      <title>La Black Friday Week fait d&#233;j&#224; baisser le prix du vid&#233;oprojecteur portable Xgimi Vibe One (avec batterie, Dolby Audio et Google TV)</title>
      <link>https://www.frandroid.com/marques/2877511_la-black-friday-week-fait-deja-baisser-le-prix-du-videoprojecteur-portable-xgimi-vibe-one-avec-batterie-dolby-audio-et-google-tv</link>
      <pubDate>Thu, 20 Nov 2025 12:14:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2877511_la-black-friday-week-fait-deja-baisser-le-prix-du-videoprojecteur-portable-xgimi-vibe-one-avec-batterie-dolby-audio-et-google-tv</guid>
      <description>
Sur le march&#233; depuis m&#234;me pas un mois, ce petit vid&#233;oprojecteur &#224; emporter partout, le Xgimi Vibe One, se dote d&#233;j&#224; d'une promotion pour le Black Friday. Lanc&#233; le 5 novembre au prix de 249 euros, il est aujourd'hui affich&#233; &#224; 199 euros sur Amazon.
</description>
    </item>
    <item>
      <title>Amazon Black Friday ad: The best deals you can buy online today</title>
      <link>https://mashable.com/article/amazon-black-friday-ad-2025-best-deals</link>
      <pubDate>Thu, 20 Nov 2025 12:09:28 +0000</pubDate>
      <guid isPermaLink="false">03fC0LXjuhPJUgLDP9jCtaL</guid>
      <description>Amazon Black Friday Ad. Browse the best deals from Amazon's Black Friday sale in 2025.</description>
    </item>
    <item>
      <title>How to Go Paperless in 9 Steps</title>
      <link>https://www.wired.com/story/how-to-go-paperless-in-9-steps/</link>
      <pubDate>Thu, 20 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">691661db4588fee6dbab6dd9</guid>
      <description>You promised yourself you'd digitize every last receipt, document, and paper record. But the trick to getting rid of paper is to not worry about being perfect.</description>
    </item>
    <item>
      <title>The Best Online Gift Cards and Digital Gift Ideas (2025)</title>
      <link>https://www.wired.com/story/gift-cards-and-digital-gift-ideas/</link>
      <pubDate>Thu, 20 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">61796004a7da35fe9f08a811</guid>
      <description>Forget the wrapping paper and shipping. Go digital this year with subscriptions, ebooks, apps, and more.</description>
    </item>
    <item>
      <title>Uber Eats will use Starship sidewalk robots to deliver food in the UK</title>
      <link>https://techcrunch.com/2025/11/20/uber-eats-will-use-starship-sidewalk-robots-to-deliver-food-in-the-uk/</link>
      <pubDate>Thu, 20 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069377</guid>
      <description>The two companies will start in the UK this year, before expanding to other European cities in 2026 and the U.S. in 2027.</description>
    </item>
    <item>
      <title>How to watch Daddy Issues season 2 online and stream every episode *FREE* from anywhere now</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/daddy-issues-season-2</link>
      <pubDate>Thu, 20 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">VH6DUdmjoHNnqSX7QSUwQK</guid>
      <description>Aimee Lou Wood returns for more family dysfunction in this brilliant BBC sitcom. Read here for how to watch Daddy Issues season 2 and stream every episode free from anywhere.</description>
    </item>
    <item>
      <title>Uber Eats will soon use robots to deliver your takeaway - but you can't tip them</title>
      <link>https://www.techradar.com/pro/uber-eats-will-soon-use-robots-to-deliver-your-takeaway-but-you-cant-tip-them</link>
      <pubDate>Thu, 20 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">CRqW4jg8U874tLkm2BfQbY</guid>
      <description>Starship Technologies robots could soon bring your Uber Eats takeaway to your door.</description>
    </item>
    <item>
      <title>How &#8216;good enough&#8217; products are disrupting premium pricing</title>
      <link>https://www.fastcompany.com/91440588/good-enough-products-disrupting-premium-pricing</link>
      <pubDate>2025-11-20T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91440588/good-enough-products-disrupting-premium-pricing</guid>
      <description>In a world where technology makes everything easier and cheaper, competitive advantage increasingly comes from business model innovation rather than product superiority.
Strategy textbooks taught us that sustainable competitive advantage that commanded premium prices was best protected by powerful barriers to entry. Build a moat, create switching costs, leverage access to high costs of entry, own distribution channels, and it would be difficult for startups to compete for your markets. But the forces of disruption operate by different rules, systematically destroying the very foundations of pr...</description>
    </item>
    <item>
      <title>Timoth&#233;e Chalamet&#8217;s best role yet is your weirdly intense coworker on Zoom</title>
      <link>https://www.fastcompany.com/91444566/marty-supreme-ad</link>
      <pubDate>2025-11-20T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444566/marty-supreme-ad</guid>
      <description>A24 is promoting its new film &#8216;Marty Supreme&#8217; with an awkward video call. Here&#8217;s why it&#8217;s genius.
Timoth&#233;e Chalamet just posted an 18-minute-long video to his Instagram to promote his upcoming A24 film, Marty Supreme. It might be his best role yet.</description>
    </item>
    <item>
      <title>Dr. Martens just made the classic rain boot a whole lot more punk</title>
      <link>https://www.fastcompany.com/91444926/dr-martens-rain-boot</link>
      <pubDate>2025-11-20T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444926/dr-martens-rain-boot</guid>
      <description>Walks like a rain boot, talks like a punk fan.
Here&#8217;s the thing about Wellington boots: They&#8217;re great when it&#8217;s raining, because they keep your toes dry and toasty. But when the rain stops, you feel a little silly stomping around in heavy rubber boots. </description>
    </item>
    <item>
      <title>New York&#8217;s ubiquitous construction scaffolding gets a glow up</title>
      <link>https://www.fastcompany.com/91445470/new-york-scaffolding-gets-a-glow-up</link>
      <pubDate>2025-11-20T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91445470/new-york-scaffolding-gets-a-glow-up</guid>
      <description>Six new designs remake the utilitarian construction shed into something near beautiful.
New York City scaffolding is so commonplace it has become a kind of extra architectural skin covering the city. It&#8217;s estimated that there are more than 9,000 of these &#8220;construction sheds&#8221; (another term for scaffolding) installed across the city, enough to stretch nearly 400 miles if they were put end to end. ...</description>
    </item>
    <item>
      <title>Deux vid&#233;oprojecteurs abordables chez ViewSonic : ce qu&#8217;il faut savoir sur le M1B Max et le LX60HDB</title>
      <link>https://www.frandroid.com/marques/viewsonic/2878397_deux-videoprojecteurs-abordables-chez-viewsonic-ce-quil-faut-savoir-sur-le-m1b-max-et-le-lx60hdb</link>
      <pubDate>Thu, 20 Nov 2025 11:50:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/viewsonic/2878397_deux-videoprojecteurs-abordables-chez-viewsonic-ce-quil-faut-savoir-sur-le-m1b-max-et-le-lx60hdb</guid>
      <description>
Alors que la d&#233;ferlante de vid&#233;oprojecteurs de marques chinoises n&#8217;a de cesse de grandir, ViewSonic tente de faire surface avec des produits abordables et pens&#233;s pour diff&#233;rents usages notamment avec les mod&#232;les M1B Max et LX60HDB dont voici tous les d&#233;tails.
</description>
    </item>
    <item>
      <title>Cynthia Erivo explains the story behind her new meme</title>
      <link>https://mashable.com/video/cynthia-erivo-meme</link>
      <pubDate>Thu, 20 Nov 2025 11:49:50 +0000</pubDate>
      <guid isPermaLink="false">00xMcBbCxmvuO0sQ0dk4loD</guid>
      <description>"Wicked: For Good" star Cynthia Erivo appeared on "The Tonight Show" and spoke to Jimmy Fallon about a meme of her holding up a hand and looking shocked.</description>
    </item>
    <item>
      <title>The phenomenal SteelSeries Arctis GameBuds just dropped below &#163;100 for the first time &#8211; a record-low before Black Friday</title>
      <link>https://www.techradar.com/gaming/the-phenomenal-steelseries-arctis-gamebuds-just-dropped-below-gbp100-for-the-first-time-a-record-low-before-black-friday</link>
      <pubDate>Thu, 20 Nov 2025 11:48:33 +0000</pubDate>
      <guid isPermaLink="false">cJfSnmPto72LXxanWHUXWN</guid>
      <description>The SteelSeries Arctis GameBuds top our best gaming earbuds guide, and you can save a lowest-ever 38% off them right now.</description>
    </item>
    <item>
      <title>This gaming microphone is so good I use it daily &#8211; and it's back on sale for Black Friday</title>
      <link>https://www.techradar.com/gaming/this-gaming-microphone-is-so-good-i-use-it-daily-and-its-back-on-sale-for-black-friday</link>
      <pubDate>Thu, 20 Nov 2025 11:48:15 +0000</pubDate>
      <guid isPermaLink="false">KBtcNyP6brh6XHrQ2NTiHG</guid>
      <description>The SteelSeries Alias has received a hefty 35% price cut for Black Friday this year.</description>
    </item>
    <item>
      <title>Watch out, Apple fans &#8211; this scary scam is stealing personal accounts with real Apple Support tickets</title>
      <link>https://www.techradar.com/computing/cyber-security/watch-out-apple-fans-this-scary-scam-is-stealing-personal-accounts-with-real-apple-support-tickets</link>
      <pubDate>Thu, 20 Nov 2025 11:47:09 +0000</pubDate>
      <guid isPermaLink="false">SLt5exJr72reJEKa5k5hzC</guid>
      <description>There&#8217;s a new phishing scam targeting Apple users, and it uses a masterful trick to build its victims&#8217; confidence &#8211;here's how to protect yourself.</description>
    </item>
    <item>
      <title>Kohls Black Friday ad: The best deals you can buy online today</title>
      <link>https://mashable.com/article/kohls-black-friday-ad-2025-best-deals</link>
      <pubDate>Thu, 20 Nov 2025 11:38:16 +0000</pubDate>
      <guid isPermaLink="false">04CRoBvMNullX14xn5vQ49P</guid>
      <description>Kohl's Black Friday Ad. Browse the best deals from the Kohl's Black Friday sale in 2025.</description>
    </item>
  </channel>
</rss>
