<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 10 Nov 2025 14:43:17 GMT</lastBuildDate>
    <item>
      <title>CNN&#8217;s app is adding a &#8216;Shorts&#8217; feed for bite-size videos</title>
      <link>https://www.theverge.com/news/816638/cnn-app-shorts-feed-videos-launch</link>
      <pubDate>2025-11-10T09:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=816638</guid>
      <description>CNN is revamping its app&#8217;s homepage with a feed dedicated to short-form videos. The new &#8220;Shorts&#8221; tab houses a stream of clips with stories from CNN, allowing you to swipe through them like you would with TikTok or Instagram Reels. The CNN app already had a section for short-form videos in its &#8220;Watch&#8221; tab, but [&#8230;]</description>
    </item>
    <item>
      <title>Apple fans, you won't love this one: rumors suggest OLED will be exclusive to M6 MacBook Pro and Max models</title>
      <link>https://www.techradar.com/computing/macbooks/apple-fans-you-wont-love-this-one-rumors-suggest-oled-will-be-exclusive-to-m6-macbook-pro-and-max-models</link>
      <pubDate>Mon, 10 Nov 2025 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">HmUaYAm6YHwroBh7EevZXZ</guid>
      <description>Apple is rumored to be gearing up for its M6 chips in the latter stages of 2026, but only those who purchase the M6 Pro or M6 Max models may receive the rumored OLED redesign.</description>
    </item>
    <item>
      <title>All Her Fault is Peacock&#8217;s most chilling thriller yet &#8211; here&#8217;s why everyone can&#8217;t stop talking about it</title>
      <link>https://www.techradar.com/streaming/all-her-fault-is-the-twisty-new-peacock-thriller-everyones-binging-and-its-every-bit-as-gripping-as-youve-heard</link>
      <pubDate>Mon, 10 Nov 2025 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">TGgZKnjozychVSwrd5PYxB</guid>
      <description>All Her Fault hits harder than you expect &#8211; here's why critics are calling it "worthy of a binge that carves a dent into your couch cushions".</description>
    </item>
    <item>
      <title>Apple Fitness+ dans la gal&#232;re : pourquoi la situation du service d&#8217;entrainement sportif n&#8217;est pas si dramatique</title>
      <link>https://www.frandroid.com/marques/2861717_apple-fitness-dans-la-galere-pourquoi-la-situation-du-service-dentrainement-sportif-nest-pas-si-dramatique</link>
      <pubDate>Mon, 10 Nov 2025 14:29:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2861717_apple-fitness-dans-la-galere-pourquoi-la-situation-du-service-dentrainement-sportif-nest-pas-si-dramatique</guid>
      <description>
Pas assez d'abonn&#233;s, pas assez de revenus. Selon Mark Gurman, Apple &#233;tudierait actuellement avec attention le cas de son application d'exercices sportifs guid&#233;s Apple Fitness+, en vue d'une r&#233;organisation. Toute mesure plus drastique serait (pour l'instant) &#233;cart&#233;e. 
</description>
    </item>
    <item>
      <title>Samsung lance une assurance universelle sur tous vos appareils, mais pas (encore) en France</title>
      <link>https://www.frandroid.com/marques/samsung/2862373_samsung-lance-une-assurance-universelle-sur-tous-vos-appareils-mais-pas-encore-en-france</link>
      <pubDate>Mon, 10 Nov 2025 14:24:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2862373_samsung-lance-une-assurance-universelle-sur-tous-vos-appareils-mais-pas-encore-en-france</guid>
      <description>
Le service Samsung Care+ &#233;volue en Inde. Il prot&#232;ge d&#233;sormais tous les produits Samsung, et plus seulement les smartphones. Une nouveaut&#233; que l'on aimerait voir venir en France.
</description>
    </item>
    <item>
      <title>Windows 10 : un bug prive des millions d&#8217;utilisateurs de mises &#224; jour de s&#233;curit&#233;</title>
      <link>https://www.frandroid.com/marques/microsoft/2862181_windows-10-un-bug-prive-des-millions-dutilisateurs-de-mises-a-jour-de-securite</link>
      <pubDate>Mon, 10 Nov 2025 14:24:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2862181_windows-10-un-bug-prive-des-millions-dutilisateurs-de-mises-a-jour-de-securite</guid>
      <description>
Le programme&#160;Extended Security Updates&#160;de Windows 10 doit offrir une ann&#233;e de protection suppl&#233;mentaire apr&#232;s la fin du support officiel par Microsoft. Cependant, certains utilisateurs n'y ont toujours pas acc&#232;s. 
</description>
    </item>
    <item>
      <title>Google issues security alert: Your VPN app could be spyware in disguise</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/google-issues-security-alert-your-vpn-app-could-be-spyware-in-disguise</link>
      <pubDate>Mon, 10 Nov 2025 14:24:14 +0000</pubDate>
      <guid isPermaLink="false">ewhDmYwLZFRiCxbFngbdgn</guid>
      <description>In a new security report, Google is warning users that many VPN apps and extensions are actually malicious software designed to steal your data, not protect it. Here's what you need to know.</description>
    </item>
    <item>
      <title>Nintendo lance un site de compatibilit&#233; Switch 2, cinq mois apr&#232;s la sortie de la console</title>
      <link>https://www.frandroid.com/marques/nintendo/2862459_nintendo-lance-un-site-de-compatibilite-switch-2-cinq-mois-apres-la-sortie-de-la-console</link>
      <pubDate>Mon, 10 Nov 2025 14:23:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nintendo/2862459_nintendo-lance-un-site-de-compatibilite-switch-2-cinq-mois-apres-la-sortie-de-la-console</guid>
      <description>
Bonne nouvelle pour les possesseurs de Switch 2 : Nintendo lance enfin un site pour v&#233;rifier si vos jeux Switch fonctionnent sur la nouvelle console.
</description>
    </item>
    <item>
      <title>The Washington Post confirms it suffered an Oracle-linked data breach</title>
      <link>https://www.techradar.com/pro/security/the-washington-post-confirms-it-suffered-an-oracle-linked-data-breach</link>
      <pubDate>Mon, 10 Nov 2025 14:19:51 +0000</pubDate>
      <guid isPermaLink="false">TkkxWJ6XfdtWjGXBzEaSin</guid>
      <description>The Post joins Harvard University, Schneider Electric, and others in being struck by Cl0p and FIN11.</description>
    </item>
    <item>
      <title>En Chine, Apple s&#8217;aligne sur la censure en supprimant deux apps LGBTQ+</title>
      <link>https://www.01net.com/actualites/en-chine-apple-saligne-sur-la-censure-en-supprimant-deux-apps-lgbtq.html</link>
      <pubDate>Mon, 10 Nov 2025 14:17:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306715</guid>
      <description>Les applications de rencontre LGBTQ+ ne sont pas les bienvenues dans l'App Store et les boutiques Android en Chine. Apple en a retir&#233; deux parmi les plus utilis&#233;es, sur instructions de l'appareil de censure chinois.</description>
    </item>
    <item>
      <title>&#8216;It: Welcome to Derry&#8217; Stars Kimberly Guerrero and James Remar on Episode 3&#8217;s Big Reveals</title>
      <link>https://gizmodo.com/it-welcome-to-derry-episode-3-spoilers-kimberly-guerrero-james-remar-2000680985</link>
      <pubDate>Mon, 10 Nov 2025 14:15:55 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000680985</guid>
      <description>Childhood sweethearts reunite in the latest entry in HBO's Stephen King series, but the circumstances aren't exactly happy ones.</description>
    </item>
    <item>
      <title>Avec 500 &#8364; de remise pr&#233;-Black Friday, le HP Victus 15 arm&#233; d&#8217;une RTX 5060 et d&#8217;un Ryzen AI 5 devient une machine gaming redoutable</title>
      <link>https://www.frandroid.com/bons-plans/2860253_avec-500-e-de-remise-pre-black-friday-le-hp-victus-15-arme-dune-rtx-5060-et-dun-ryzen-ai-5-devient-une-machine-gaming-redoutable</link>
      <pubDate>Mon, 10 Nov 2025 14:14:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860253_avec-500-e-de-remise-pre-black-friday-le-hp-victus-15-arme-dune-rtx-5060-et-dun-ryzen-ai-5-devient-une-machine-gaming-redoutable</guid>
      <description>
Cet HP Victus 15 est un PC portable r&#233;cent, datant de 2025, certifi&#233; Copilot+, qu'on retrouve en promo pour 899,99 euros sur Boulanger, au lieu de 1 399,99 euros pour le pr&#233;-Black Friday. On le trouve aussi 100 euros moins cher sur un autre site marchand, mais sans Windows pr&#233;install&#233;. 
</description>
    </item>
    <item>
      <title>Arcane season 2 is about to celebrate its one-year anniversary &#8211; here are 3 big questions I want one of the best Netflix shows' birthday event to answer</title>
      <link>https://www.techradar.com/streaming/netflix/arcane-season-2-is-about-to-celebrate-its-one-year-anniversary-here-are-3-big-questions-i-want-one-of-the-best-netflix-shows-birthday-event-to-answer</link>
      <pubDate>Mon, 10 Nov 2025 14:14:40 +0000</pubDate>
      <guid isPermaLink="false">jeFNCi3mPrvqZwm5e9R9dR</guid>
      <description>Riot Games' 'Arcane Fanniversary' event is set to celebrate Arcane season 2's first birthday.</description>
    </item>
    <item>
      <title>Cdiscount : les meilleures offres &#224; scruter pendant ce pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2850059_cdiscount-voici-les-10-bonnes-affaires-a-denicher-pendant-le-pre-black-friday</link>
      <pubDate>Mon, 10 Nov 2025 14:07:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850059_cdiscount-voici-les-10-bonnes-affaires-a-denicher-pendant-le-pre-black-friday</guid>
      <description>
Cdiscount rejoint la course aux bonnes affaires avec son op&#233;ration pr&#233;-Black Friday. Le site propose de belles r&#233;ductions sur une large gamme de produits Tech, allant des smartphones aux t&#233;l&#233;viseurs, en passant par les consoles de jeux. Parmi la multitude d&#8217;offres, voici les plus int&#233;ressantes, celles qui valent vraiment le d&#233;tour.
</description>
    </item>
    <item>
      <title>NVIDIA &#224; la relance : sa prochaine g&#233;n&#233;ration de GPU serait d&#233;j&#224; entr&#233;e en production</title>
      <link>https://www.frandroid.com/marques/nvidia/2862109_nvidia-a-la-relance-sa-prochaine-generation-de-gpu-serait-deja-entree-en-production</link>
      <pubDate>Mon, 10 Nov 2025 14:06:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2862109_nvidia-a-la-relance-sa-prochaine-generation-de-gpu-serait-deja-entree-en-production</guid>
      <description>
D&#233;voil&#233;e il y a quelques semaines &#224; la GTC 2025, la &#171; superpuce &#187; Vera Rubin de Nvidia serait d&#233;j&#224; entr&#233;e en production. Destin&#233;e &#224; l'IA, au monde des supercalculateurs et des data-centers, cette derni&#232;re est cens&#233;e se mat&#233;rialiser &#224; grande &#233;chelle fin 2026-d&#233;but 2027.
</description>
    </item>
    <item>
      <title>La charge rapide tue-t-elle votre batterie de smartphone ? Un test de 500 cycles d&#233;voile la v&#233;rit&#233;</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2862293_la-charge-rapide-tue-t-elle-votre-batterie-de-smartphone-un-test-de-500-cycles-devoile-la-verite</link>
      <pubDate>Mon, 10 Nov 2025 14:06:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2862293_la-charge-rapide-tue-t-elle-votre-batterie-de-smartphone-un-test-de-500-cycles-devoile-la-verite</guid>
      <description>
On nous r&#233;p&#232;te depuis des ann&#233;es d'&#233;viter la charge rapide pour pr&#233;server nos batteries. Une cha&#238;ne YouTube a test&#233; pendant 6 mois, dont des charges &#224; 120 watts.
</description>
    </item>
    <item>
      <title>Windows 11 : l&#8217;outil Capture d&#8217;&#233;cran va ajouter une option d&#8217;&#233;dition indispensable</title>
      <link>https://www.frandroid.com/marques/2861759_windows-11-loutil-capture-decran-va-ajouter-une-option-dedition-indispensable</link>
      <pubDate>Mon, 10 Nov 2025 14:01:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2861759_windows-11-loutil-capture-decran-va-ajouter-une-option-dedition-indispensable</guid>
      <description>
Microsoft travaille sur une option permettant &#224; l'outil Capture d'&#233;cran de pouvoir &#233;diter directement ses captures en y ajoutant du texte. 
</description>
    </item>
    <item>
      <title>America&#8217;s cybersecurity defenses are cracking</title>
      <link>https://www.theverge.com/policy/816882/cisa-cybersecurity-elections-infrastructure-shutdown</link>
      <pubDate>2025-11-10T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=816882</guid>
      <description>It was late June, and something strange was happening on Arizona's online portal for political candidates. Images of the candidates were disappearing. Photos of the Iranian Ayatollah Ruhollah Khomeini were popping up in their place. The state would later come to believe it was an attack from an Iranian government-affiliated group. When they first discovered [&#8230;]...</description>
    </item>
    <item>
      <title>The Seduction is the new HBO Max series you need to stream in November &#8211; and it&#8217;s as explicit as you&#8217;d expect</title>
      <link>https://www.techradar.com/streaming/hbo-max/the-seduction-review</link>
      <pubDate>Mon, 10 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">RJW8YXCyHShp93HWUepGwY</guid>
      <description>New French-language series The Seduction is HBO Max's latest offering, and I'm still blushing from all the sex and scandal.</description>
    </item>
    <item>
      <title>Can't sign up for Windows 10's extended updates? Here's why that might be &#8211; and what you can do about it</title>
      <link>https://www.techradar.com/computing/windows/cant-sign-up-for-windows-10s-extended-updates-heres-why-that-might-be-and-what-you-can-do-about-it</link>
      <pubDate>Mon, 10 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">5eodadws7YqpoUmCiJV76V</guid>
      <description>Sticking with Windows 10, but worried because you can't get extended updates? You might have run into a bug.</description>
    </item>
    <item>
      <title>Baseten takes on hyperscalers with new AI training platform that lets you own your model weights</title>
      <link>https://venturebeat.com/ai/baseten-takes-on-hyperscalers-with-new-ai-training-platform-that-lets-you</link>
      <pubDate>Mon, 10 Nov 2025 14:00:00 GMT</pubDate>
      <guid isPermaLink="false">4UOKzkyQ3Rxp6ogmiLzDYl</guid>
      <description>Baseten, the AI infrastructure company recently valued at $2.15 billion, is making its most significant product pivot yet: a full-scale push into model training that could reshape how enterprises wean themselves off dependence on OpenAI and other closed-source AI providers.The San Francisco-based company announced Thursday the general availability of Baseten Training, an infrastructure platform designed to help companies fine-tune open-source AI models without the operational headaches of managing GPU clusters, multi-node orchestration, or cloud capacity planning. The move is a calculated expa...</description>
    </item>
    <item>
      <title>Coros d&#233;voile sa nouvelle montre de sport pas ch&#232;re, la Coros Pace 4, avec &#233;cran Amoled, micro et design l&#233;ger</title>
      <link>https://www.frandroid.com/marques/coros/2853375_coros-devoile-sa-nouvelle-montre-de-sport-pas-chere-la-coros-pace-4-avec-ecran-amoled-micro-et-design-leger</link>
      <pubDate>Mon, 10 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/coros/2853375_coros-devoile-sa-nouvelle-montre-de-sport-pas-chere-la-coros-pace-4-avec-ecran-amoled-micro-et-design-leger</guid>
      <description>
Coros a d&#233;voil&#233; ce lundi sa Pace 4, nouvelle venue dans la gamme de montres running du constructeur, avec un prix de moins de 270 euros. 
</description>
    </item>
    <item>
      <title>Remote driving startup Vay could grab up to $410M from Singapore&#8217;s Grab</title>
      <link>https://techcrunch.com/2025/11/10/remote-driving-startup-vay-could-grab-up-to-410m-from-singapores-grab/</link>
      <pubDate>Mon, 10 Nov 2025 13:53:30 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3066398</guid>
      <description>Vay, a German startup offering remote-controlled rental cars, will get an investment of up to $410M from Singaporean super-app company Grab.</description>
    </item>
    <item>
      <title>Senate takes preliminary step towards ending the government shutdown</title>
      <link>https://www.fastcompany.com/91438277/senate-takes-preliminary-step-towards-ending-government-shutdown</link>
      <pubDate>2025-11-10T13:48:04</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91438277/senate-takes-preliminary-step-towards-ending-government-shutdown</guid>
      <description>The Senate voted 60&#8211;40 to advance compromise legislation, which does not include a guarantee of healthcare subsidies. 
The Senate took the first step to end the government shutdown on Sunday after a group of moderate Democrats agreed to proceed without a guaranteed extension of health care subsidies, angering many in their caucus who say Americans want them to continue the fight.In a test vote that is the first in a series of required procedural maneuvers, the Senate voted 60-40 to move toward passing compromise legislation to fund the government and hold a later vote on extending Affordable C...</description>
    </item>
    <item>
      <title>Pr&#233;-Black Friday 2025 : voici les meilleures offres en DIRECT d&#8217;Amazon, Boulanger, Fnac, Darty&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2849105_pre-black-friday-2025-voici-les-meilleures-offres-en-direct-damazon-boulanger-fnac-darty</link>
      <pubDate>Mon, 10 Nov 2025 13:46:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849105_pre-black-friday-2025-voici-les-meilleures-offres-en-direct-damazon-boulanger-fnac-darty</guid>
      <description>
De nombreux e-commer&#231;ants ont pris de l'avance sur le Black Friday cette ann&#233;e on retrouve d&#232;s maintenant de belles remises sur de nombreux produits Tech. Nous suivons les offres les plus int&#233;ressantes en temps r&#233;el pour vous pr&#233;senter une s&#233;lection des meilleures promotions du moment, incluant les smartphones, ordinateurs, t&#233;l&#233;viseurs, objets connect&#233;s, etc.
...</description>
    </item>
    <item>
      <title>Tesla is fighting the EV sales slump with short-term rentals</title>
      <link>https://www.theverge.com/news/817477/tesla-direct-short-term-ev-rentals-tax-credit</link>
      <pubDate>2025-11-10T08:32:48-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=817477</guid>
      <description>Tesla is now in the business of short-term car rentals, as the company tries to mitigate falling sales in the US following the expiry of federal tax credits for electric vehicles. Rentals are currently being offered in two California Tesla stores in San Diego and Costa Mesa, with plans to expand to more locations by [&#8230;]</description>
    </item>
    <item>
      <title>Why a lot of people are getting hacked with government spyware</title>
      <link>https://techcrunch.com/2025/11/10/why-a-lot-of-people-are-getting-hacked-with-government-spyware/</link>
      <pubDate>Mon, 10 Nov 2025 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3065850</guid>
      <description>Government surveillance vendors want us to believe their spyware products are only used in limited and targeted operations against terrorists and serious criminals. That claim is increasingly difficult to justify, given the broad range of victims &#8212; journalists, activists, and now political consultants &#8212; that have come forward.</description>
    </item>
    <item>
      <title>IT: Welcome to Derry: All the Stephen King Easter eggs so far</title>
      <link>https://mashable.com/article/it-welcome-to-derry-stephen-king-easter-eggs</link>
      <pubDate>Mon, 10 Nov 2025 13:27:24 +0000</pubDate>
      <guid isPermaLink="false">05piSrh4nEVYf12QNI8w6Ia</guid>
      <description>"IT: Welcome to Derry" is full of Stephen King Easter eggs. We've rounded them all up.</description>
    </item>
    <item>
      <title>Microsoft paie des influenceurs mode pour essayer de rendre Copilot &#171;&#160;cool&#160;&#187;</title>
      <link>https://www.01net.com/actualites/microsoft-paie-des-influenceurs-mode-pour-essayer-de-rendre-copilot-cool.html</link>
      <pubDate>Mon, 10 Nov 2025 13:25:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306705</guid>
      <description>Microsoft a un probl&#232;me avec Copilot. Le bot IA de l'&#233;diteur est en effet tr&#232;s loin d'&#234;tre aussi populaire que ChatGPT, dont il reprend pourtant les m&#234;mes technologies. L'entreprise a donc d&#233;cid&#233; d'embaucher des influenceurs pour vendre l'id&#233;e que Copilot &#233;tait &#171;&#160;cool &#187;.</description>
    </item>
    <item>
      <title>Darty enflamme le pr&#233;-Black Friday avec -53 % sur ce TV Samsung OLED 144 Hz de 55 pouces lanc&#233; en 2025</title>
      <link>https://www.frandroid.com/bons-plans/2862037_darty-enflamme-le-pre-black-friday-avec-53-sur-ce-tv-samsung-oled-144-hz-de-55-pouces-lance-en-2025</link>
      <pubDate>Mon, 10 Nov 2025 13:23:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2862037_darty-enflamme-le-pre-black-friday-avec-53-sur-ce-tv-samsung-oled-144-hz-de-55-pouces-lance-en-2025</guid>
      <description>
Quand il est sorti, le Samsung 55S90F &#233;tait &#224; 1 799 euros, mais pendant le pr&#233;-Black Friday avec r&#233;ductions et ODR sur Darty, il revient &#224; 829 euros.
</description>
    </item>
    <item>
      <title>Apple could be working on a batch of new iPhone satellite features, and I'm cautious but optimistic</title>
      <link>https://www.techradar.com/phones/iphone/apple-could-be-working-on-a-batch-of-new-iphone-satellite-features-and-im-cautious-but-optimistic</link>
      <pubDate>Mon, 10 Nov 2025 13:23:36 +0000</pubDate>
      <guid isPermaLink="false">9EcE46YJ7duzH8kTrvaBXc</guid>
      <description>Bloomberg&#8217;s Mark Gurman has suggested that Apple could be working on developing the iPhone&#8217;s satellite capability.</description>
    </item>
    <item>
      <title>Flight delays and cancellations just hit more than 13,000 in one day with FAA mandate in effect. Will it get worse?</title>
      <link>https://www.fastcompany.com/91438289/flight-delays-cancellations-getting-worse-update-faa-reductions</link>
      <pubDate>2025-11-10T13:21:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91438289/flight-delays-cancellations-getting-worse-update-faa-reductions</guid>
      <description>A plan to potentially reopen the government is working its way through Congress. In the meantime, travelers should expect even tighter restrictions.
This weekend, U.S. travelers began to feel the initial impact of flight reductions mandated by the Federal Aviation Administration (FAA), a plan designed to help compensate for the understaffing of air traffic controllers due to the ongoing government shutdown.&#160;...</description>
    </item>
    <item>
      <title>Samsung au CES 2026 : la LPDDR6 est officielle, un SSD modulaire pour les voitures et un T7 recycl&#233;</title>
      <link>https://www.frandroid.com/produits-android/hardware/stockage/2862221_samsung-au-ces-2026-la-lpddr6-est-officielle-un-ssd-modulaire-pour-les-voitures-et-un-t7-recycle</link>
      <pubDate>Mon, 10 Nov 2025 13:19:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/stockage/2862221_samsung-au-ces-2026-la-lpddr6-est-officielle-un-ssd-modulaire-pour-les-voitures-et-un-t7-recycle</guid>
      <description>
Samsung au CES 2026 : LPDDR6, AutoSSD modulaire et greenwashing ? Voici les quatre annonces qui concernent le stockage et la m&#233;moire.
</description>
    </item>
    <item>
      <title>Brands Mean Business</title>
      <link>https://www.fastcompany.com/91433896/brands-mean-business</link>
      <pubDate>2025-11-10T13:19:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91433896/brands-mean-business</guid>
      <description>Four reasons you shouldn&#8217;t be surprised that brands are still strategic assets.
Brands matter now more than ever.</description>
    </item>
    <item>
      <title>Apple TV 4K : tvOS 26.2 simplifie les profils et le contr&#244;le parental</title>
      <link>https://www.frandroid.com/marques/apple/2862227_apple-tv-4k-tvos-26-2-simplifie-les-profils-et-le-controle-parental</link>
      <pubDate>Mon, 10 Nov 2025 13:09:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2862227_apple-tv-4k-tvos-26-2-simplifie-les-profils-et-le-controle-parental</guid>
      <description>
Avec sa mise &#224; jour 26.2, Apple propose de nouvelles fonctionnalit&#233;s sur son bo&#238;tier multim&#233;dia l&#8217;Apple TV 4K, pour une personnalisation plus pouss&#233;e et une s&#233;curit&#233; accrue pour tous les membres du foyer.
</description>
    </item>
    <item>
      <title>Buying an older version is the best way to save on a Dyson haircare gadget this deals season &#8211; and I'm already seeing major discounts</title>
      <link>https://www.techradar.com/home/hair-care/buying-an-older-version-is-the-best-way-to-save-on-a-dyson-haircare-gadget-this-deals-season-and-im-already-seeing-major-discounts</link>
      <pubDate>Mon, 10 Nov 2025 13:08:19 +0000</pubDate>
      <guid isPermaLink="false">bFPzsBSc8BGYA58jHdjekV</guid>
      <description>Thinking about opting for a Dyson Supersonic or Airwrap Origin to save money this Black Friday? Here's what you need to know.</description>
    </item>
    <item>
      <title>Microsoft is working on a "new class&#8221; of AI agents that could change everything in your workforce</title>
      <link>https://www.techradar.com/pro/microsoft-is-working-on-a-new-class-of-ai-agents-that-could-change-everything-in-your-workforce</link>
      <pubDate>Mon, 10 Nov 2025 13:04:00 +0000</pubDate>
      <guid isPermaLink="false">RhrQDasAxPZG3GNGSpL6YZ</guid>
      <description>Hybrid work has become synonymous with remote working. But what if it meant humans working with AI?</description>
    </item>
    <item>
      <title>Jennifer Lawrence Keeps Teasing the Mystery New Miss Piggy Movie</title>
      <link>https://gizmodo.com/jennifer-lawrence-miss-piggy-movie-cancel-culture-muppets-2000683559</link>
      <pubDate>Mon, 10 Nov 2025 13:00:10 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683559</guid>
      <description>Plus, Dave Bautista talks about the delayed behind the 'Highlander' reboot.</description>
    </item>
    <item>
      <title>Asus ProArt P16 Review: The Fastest Windows Laptop</title>
      <link>https://www.wired.com/review/asus-proart-p16-2025/</link>
      <pubDate>Mon, 10 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">690e56dbcf26a92c7a51136f</guid>
      <description>This just might be the fastest Windows laptops on the market. Don&#8217;t ask about the price.</description>
    </item>
    <item>
      <title>6Sense founder Amanda Kahlow raises $30 million for&#160;new human-replacement&#160;AI&#160;sales startup&#160;1Mind</title>
      <link>https://techcrunch.com/2025/11/10/6sense-founder-amanda-kahlow-raises-30-million-for-new-human-replacement-ai-sales-startup-1mind/</link>
      <pubDate>Mon, 10 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3066193</guid>
      <description>Amanda&#160;Kahlow has been quietly been back in sales and marketing tech for about a year with agentic startup 1Mind.</description>
    </item>
    <item>
      <title>Scribe hits $1.3B valuation as it moves to show where AI will actually pay off</title>
      <link>https://techcrunch.com/2025/11/10/scribe-hits-1-3b-valuation-as-it-moves-to-show-where-ai-will-actually-pay-off/</link>
      <pubDate>Mon, 10 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3066339</guid>
      <description>Scribe Optimize is the startup's next major offering to help organizations identify where AI will be most useful.</description>
    </item>
    <item>
      <title>&#8216;Magnets are too heavy&#8217;: OnePlus exec explains why the OnePlus 15 doesn&#8217;t have Pixel-style magnetic charging</title>
      <link>https://www.techradar.com/phones/oneplus-phones/magnets-are-too-heavy-oneplus-exec-explains-why-the-oneplus-15-doesnt-have-pixel-style-magnetic-charging</link>
      <pubDate>Mon, 10 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">hkLCHUQ89VU5NNxC2nHKzH</guid>
      <description>At a roundtable interview attended by TechRadar, OnePlus exec Rudolf Xu explained the thought process behind the OnePlus 15's charging system.</description>
    </item>
    <item>
      <title>Europe&#8217;s largest motoring club tested how much range one popular EV lost over 4 years and almost 110,000 miles &#8211; and it&#8217;s way less than you&#8217;d think</title>
      <link>https://www.techradar.com/vehicle-tech/hybrid-electric-vehicles/europes-largest-motoring-club-tested-how-much-range-one-popular-ev-lost-over-4-years-and-almost-110-000-miles-and-its-way-less-than-youd-think</link>
      <pubDate>Mon, 10 Nov 2025 12:55:52 +0000</pubDate>
      <guid isPermaLink="false">4dude2n4Gq8Uj6xFvGMSxm</guid>
      <description>Extensive tests showed the Volkswagen ID 3 retained well in excess of 90% battery capacity after four years of hard driving.</description>
    </item>
    <item>
      <title>I write about AI for a living &#8211; and I can&#8217;t see Pluribus as anything but a scathing examination of our relationship with it</title>
      <link>https://www.techradar.com/ai-platforms-assistants/i-write-about-ai-for-a-living-and-i-cant-see-pluribus-as-anything-but-a-scathing-examination-of-our-relationship-with-it</link>
      <pubDate>Mon, 10 Nov 2025 12:54:27 +0000</pubDate>
      <guid isPermaLink="false">gft9x9TDqgJZrGkpF5eDCm</guid>
      <description>Pluribus doesn't mention AI at all, but to me it&#8217;s a chilling examination of our relationship with today&#8217;s chatbots and how they&#8217;re changing the world around us.</description>
    </item>
    <item>
      <title>Pr&#233;-Black Friday : les meilleurs deals Fnac et Darty &#224; ne pas manquer</title>
      <link>https://www.frandroid.com/bons-plans/2849237_top-promo-fnac-darty-la-selection-pre-black-friday</link>
      <pubDate>Mon, 10 Nov 2025 12:54:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849237_top-promo-fnac-darty-la-selection-pre-black-friday</guid>
      <description>
La Fnac et Darty n&#8217;entendent pas laisser Boulanger et Amazon occuper le terrain : les deux enseignes soeurs d&#233;gainent elles aussi leurs promotions avant le Black Friday. Ordinateurs, smartphones, TV, tablettes&#8230; les bonnes affaires se multiplient, et nous avons s&#233;lectionn&#233; pour vous les offres les plus int&#233;ressantes.
</description>
    </item>
  </channel>
</rss>
