<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 22 Nov 2025 11:25:04 GMT</lastBuildDate>
    <item>
      <title>Pendant la Black Friday Week, ce smartphone pliant &#224; clapet co&#251;te moins de 400 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2413084_pendant-la-black-friday-week-ce-smartphone-pliant-a-clapet-coute-moins-de-400-euros</link>
      <pubDate>Sat, 22 Nov 2025 11:22:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2413084_pendant-la-black-friday-week-ce-smartphone-pliant-a-clapet-coute-moins-de-400-euros</guid>
      <description>
Le Motorola Razr 40 Ultra de 2023 est un smartphone pliable &#224; clapet qui a plus d'un atout, notamment au niveau de son design et de son interface. En cette Black Friday Week, vous le trouverez &#224; seulement 399 euros sur Amazon alors qu'il en valait 1 200 euros &#224; son lancement.
</description>
    </item>
    <item>
      <title>My favorite VPN for gaming just dropped its prices by up to 77% &#8722; here's how to grab yours</title>
      <link>https://www.techradar.com/vpn/vpn-services/my-favorite-vpn-for-gaming-just-dropped-its-prices-by-up-to-77-percent-heres-how-to-grab-yours</link>
      <pubDate>Sat, 22 Nov 2025 11:12:45 +0000</pubDate>
      <guid isPermaLink="false">QtMeqKXbjZjnmknGC9syuT</guid>
      <description>It's here early. NordVPN, our pick for the best VPN service, has dropped its Black Friday prices. Get the top-rated gaming VPN for just $2.99 a month, a massive 77% saving on a two-year plan.</description>
    </item>
    <item>
      <title>Amazon se montre g&#233;n&#233;reux pour la Black Friday Week : voici les 20 offres &#224; saisir ce week-end</title>
      <link>https://www.frandroid.com/bons-plans/2860071_amazon-se-montre-genereux-pour-la-black-friday-week-voici-les-20-offres-a-saisir-ce-week-end</link>
      <pubDate>Sat, 22 Nov 2025 11:01:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860071_amazon-se-montre-genereux-pour-la-black-friday-week-voici-les-20-offres-a-saisir-ce-week-end</guid>
      <description>
La Black Friday Week vient de d&#233;buter chez Amazon, et d&#233;j&#224; de nouvelles offres font leur apparition sur tout le site. Les prix chutent, et certaines promotions m&#233;ritent vraiment le d&#233;tour.
</description>
    </item>
    <item>
      <title>You Won&#8217;t Believe What Archaeologists Found Beneath This Lake in Kyrgyzstan</title>
      <link>https://gizmodo.com/you-wont-believe-whats-at-the-bottom-of-this-huge-lake-in-kyrgyzstan-2000688602</link>
      <pubDate>Sat, 22 Nov 2025 11:00:05 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000688602</guid>
      <description>Archaeologists recently explored a long-lost Silk Road city at the bottom of a lake, uncovering a trove of artifacts and a medieval cemetery.</description>
    </item>
    <item>
      <title>Gear News of the Week: Matter 1.5 Adds Smart Home Camera Support, and Gemini Comes to Android Auto</title>
      <link>https://www.wired.com/story/gear-news-of-the-week-matter-15-adds-smart-home-camera-support-and-gemini-comes-to-android-auto/</link>
      <pubDate>Sat, 22 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">691ff8a470596d51722835b1</guid>
      <description>Plus: Omega debuts a new Seamaster Planet Ocean, and DJI has a new action camera.</description>
    </item>
    <item>
      <title>When will your Spotify Wrapped 2025 be released? Here are the most likely dates, based on recent history</title>
      <link>https://www.techradar.com/audio/spotify/when-will-your-spotify-wrapped-2025-be-released-here-are-the-most-likely-dates-based-on-recent-history</link>
      <pubDate>Sat, 22 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">Ufz97PSS7KxvEmnMXRKVF4</guid>
      <description>Is there a specific date when Spotify Wrapped 2025 will show up? And when does it stop tracking? Here's your questions answered.</description>
    </item>
    <item>
      <title>Test de la Decathlon Fit 100 : une montre de sport l&#233;g&#232;re et vraiment accessible</title>
      <link>https://www.frandroid.com/marques/decathlon/2860613_test-de-la-decathlon-fit-100-une-montre-de-sport-legere-et-vraiment-accessible</link>
      <pubDate>Sat, 22 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/decathlon/2860613_test-de-la-decathlon-fit-100-une-montre-de-sport-legere-et-vraiment-accessible</guid>
      <description>
Il n'y a pas besoin de d&#233;penser des mille et des cents pour une montre de sport. Fid&#232;le &#224; sa r&#233;putation, Decathlon a lanc&#233; une nouvelle montre avec GPS et suivi cardio &#224; prix cass&#233;, la Decathlon Fit 100. Voici son test complet. 
</description>
    </item>
    <item>
      <title>Inutile de payer plus : cet op&#233;rateur lance le forfait 5G le moins cher du march&#233; pour le Black Friday [Sponso]</title>
      <link>https://www.frandroid.com/telecom/forfait-mobile/2875685_inutile-de-payer-plus-cet-operateur-lance-le-forfait-5g-le-moins-cher-du-marche-pour-le-black-friday</link>
      <pubDate>Sat, 22 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/forfait-mobile/2875685_inutile-de-payer-plus-cet-operateur-lance-le-forfait-5g-le-moins-cher-du-marche-pour-le-black-friday</guid>
      <description>
C&#8217;est le moment id&#233;al pour changer de forfait mobile. D&#233;j&#224; reconnu pour ses offres &#224; prix plancher, NRJ Mobile lance pour le Black Friday des forfaits exclusifs, pas chers et adapt&#233;s &#224; chaque besoin. 
</description>
    </item>
    <item>
      <title>Colis Priv&#233; pirat&#233; : attention, vos donn&#233;es ont peut-&#234;tre fuit&#233; apr&#232;s cette cyberattaque</title>
      <link>https://www.frandroid.com/actualites-generales/2881753_colis-prive-pirate-attention-vos-donnees-ont-peut-etre-fuite-apres-cette-cyberattaque</link>
      <pubDate>Sat, 22 Nov 2025 10:47:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2881753_colis-prive-pirate-attention-vos-donnees-ont-peut-etre-fuite-apres-cette-cyberattaque</guid>
      <description>
Le transporteur fran&#231;ais Colis Priv&#233; a &#233;t&#233; victime d'une cyberattaque. Si l'entreprise se veut rassurante en &#233;voquant des donn&#233;es &#171; non sensibles &#187;, la nature des informations d&#233;rob&#233;es expose pourtant les clients &#224; des risques accrus de phishing et d'arnaques cibl&#233;es.
</description>
    </item>
    <item>
      <title>55 Best Early Black Friday Deals on WIRED-Tested Gear (2025)</title>
      <link>https://www.wired.com/story/early-black-friday-deals-2025-2/</link>
      <pubDate>Sat, 22 Nov 2025 10:38:00 +0000</pubDate>
      <guid isPermaLink="false">69172a7dab224fccf1af302e</guid>
      <description>We found early Black Friday deals on WIRED-tested smart bird feeders, smartwatches, vacuums, and more.</description>
    </item>
    <item>
      <title>Ce clone de Gmail vous plonge dans les archives priv&#233;es de Jeffrey Epstein</title>
      <link>https://www.frandroid.com/culture-tech/juridique/2881711_ce-clone-de-gmail-vous-plonge-dans-les-archives-privees-de-jeffrey-epstein</link>
      <pubDate>Sat, 22 Nov 2025 10:23:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/juridique/2881711_ce-clone-de-gmail-vous-plonge-dans-les-archives-privees-de-jeffrey-epstein</guid>
      <description>
Deux d&#233;veloppeurs ont mis en ligne Jmail, un site reproduisant l'interface de Gmail pour explorer les milliers de documents relatifs &#224; Jeffrey Epstein r&#233;cemment publi&#233;s par le Congr&#232;s am&#233;ricain. 
</description>
    </item>
    <item>
      <title>Cyberattaque contre Colis Priv&#233; : les donn&#233;es des clients ont &#233;t&#233; compromises</title>
      <link>https://www.01net.com/actualites/cyberattaque-contre-colis-prive-donnees-clients-compromises.html</link>
      <pubDate>Sat, 22 Nov 2025 10:18:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310274</guid>
      <description>Une cyberattaque vient de frapper Colis Priv&#233;. Le transporteur, qui livre 90 millions de colis par an, a confirm&#233; le vol de donn&#233;es de contact de ses clients. Ces informations suffisent &#224; lancer des vagues d'arnaques, dont des escroqueries au colis.</description>
    </item>
    <item>
      <title>Black Friday en DIRECT : voici les meilleures offres du week-end &#224; l&#8217;occasion de la Black Week sur Amazon, Fnac, Darty, Boulanger&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2876855_black-friday-week-week-end-meilleures-offres-en-direct-amazon-fnac-darty-boulanger</link>
      <pubDate>Sat, 22 Nov 2025 10:14:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2876855_black-friday-week-week-end-meilleures-offres-en-direct-amazon-fnac-darty-boulanger</guid>
      <description>
C'est officiellement la Black Friday Week sur Amazon, Fnac, Darty, Boulanger ou encore Cdiscount. C'est donc le bon moment pour faire une excellente affaire sur votre prochain smartphone, tablette, PC portable, TV, etc. Vous retrouverez les meilleures offres Tech en temps r&#233;el dans cet article. 
</description>
    </item>
    <item>
      <title>Devialet Phatom II 95 dB : la tornade sonore au format compact casse son prix pour la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2644121_devialet-phatom-ii-95-db-la-tornade-sonore-au-format-compact-casse-son-prix-pour-la-black-friday-week</link>
      <pubDate>Sat, 22 Nov 2025 10:08:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2644121_devialet-phatom-ii-95-db-la-tornade-sonore-au-format-compact-casse-son-prix-pour-la-black-friday-week</guid>
      <description>
Pas plus grande qu&#8217;un ballon de hand, mais capable de faire trembler les murs. La Phantom II 95 dB de Devialet condense tout le savoir-faire acoustique fran&#231;ais dans un bloc design, dense et percutant. Compacte, nerveuse, pr&#233;cise : une enceinte de salon qui joue dans une autre division. Une jolie r&#233;duction a lieu pendant la Black Friday Week, faisant passer la b&#234;te &#224; 880 euros contre 1 100 euros en temps normal.
...</description>
    </item>
    <item>
      <title>Valve Says Steam Machine Isn't a Console&#8212;but It Is</title>
      <link>https://www.wired.com/story/valve-says-steam-machine-isnt-a-console-but-it-is/</link>
      <pubDate>Sat, 22 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">69209623771219f06b6e7db5</guid>
      <description>Consoles are good, actually.</description>
    </item>
    <item>
      <title>AIOps: how companies can harness AI to reshape IT operations</title>
      <link>https://www.techradar.com/pro/aiops-how-companies-can-harness-ai-to-reshape-it-operations</link>
      <pubDate>Sat, 22 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">fVqSsxGtJhtFSbNBHgJH3o</guid>
      <description>AIOps is reshaping IT operations, but its powerful potential depends entirely on one critical factor.</description>
    </item>
    <item>
      <title>ICYMI: the 7 biggest tech stories of the week, from Google's AirDrop surprise to Gemini 3</title>
      <link>https://www.techradar.com/tech/icymi-the-7-biggest-tech-stories-of-the-week-from-googles-airdrop-surprise-to-gemini-3</link>
      <pubDate>Sat, 22 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">Gp7jBRzs4r6nXPxHmx3hoc</guid>
      <description>Here are the biggest tech stories of the past week, helping you catch up with everything you might have missed.</description>
    </item>
    <item>
      <title>Bren&#233;&#160;Brown and Adam Grant say the best leaders do this. Mediocre managers do the opposite</title>
      <link>https://www.fastcompany.com/91433420/brene-brown-adam-grant-best-leaders-ask-questions</link>
      <pubDate>2025-11-22T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91433420/brene-brown-adam-grant-best-leaders-ask-questions</guid>
      <description>Are you a &#8216;learner&#8217; or a &#8216;knower&#8217;?
How can you tell if someone is a&#160;great leader? They always want to know more. They&#8217;re interested in mastery of a subject or skill. They ask great questions. And, as they find out more, they sometimes change their mind. They&#8217;re a &#8220;learner.&#8221;</description>
    </item>
    <item>
      <title>How &#8216;Sesame Street&#8217; is navigating funding cuts, new media habits, and leaving HBO for Netflix</title>
      <link>https://www.fastcompany.com/91442760/how-sesame-street-is-navigating-funding-cuts-new-media-habits-and-leaving-hbo-for-netflix</link>
      <pubDate>2025-11-22T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91442760/how-sesame-street-is-navigating-funding-cuts-new-media-habits-and-leaving-hbo-for-netflix</guid>
      <description>Sesame Workshop CEO Sherrie Westin discusses the challenges of the past year, partnering with Netflix, and why emotional well-being and kindness matter in today&#8217;s world.
As Sesame Street&#8217;s 56th season gets underway, Elmo, Big Bird, and the Sesame organization are navigating a volatile chapter in the show&#8217;s history&#8212;marked by government funding cuts, evolving new media habits, and AI&#8217;s impact on education. Sherrie Westin, CEO of Sesame Workshop, discusses balancing risk-taking with brand trust, partnering with Netflix, and why emotional well-being and kindness are the skills that matter most in ...</description>
    </item>
    <item>
      <title>Tim Cook&#8217;s track record as Apple CEO is better than you&#8217;re giving him credit for</title>
      <link>https://www.fastcompany.com/91444994/tim-cook-pulled-off-impossible-steve-jobs-apple-ceo-succession</link>
      <pubDate>2025-11-22T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444994/tim-cook-pulled-off-impossible-steve-jobs-apple-ceo-succession</guid>
      <description>Amid reports that Cook may retire soon, here&#8217;s how I view his remarkable, under-appreciated tenure which puts him with Steve Jobs as one of the best tech leaders of all time. 
Last week, the Financial Times reported that Apple CEO Tim Cook may step down next year. This news seemed to have little impact on Apple&#8217;s stock price, but it certainly sparked conversations among Apple fans and armchair tech pundits. Some people have long criticized Cook as a bean counter and &#8220;ops guy,&#8221; believing he was not the right person to helm the 21st century&#8217;s leading consumer technology company, especially one p...</description>
    </item>
    <item>
      <title>&#8216;Huge red flag&#8217;: Top Biden tech adviser warns of AI and the authoritarian moment</title>
      <link>https://www.fastcompany.com/91445749/arati-prabhakar-biden-ai-trump-authoritarianism-palantir</link>
      <pubDate>2025-11-22T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91445749/arati-prabhakar-biden-ai-trump-authoritarianism-palantir</guid>
      <description>Arati Prabhakar talks to Fast Company about what the rise of artificial intelligence will mean for the future of democracy.
Camps are finally emerging in the big fight over whether and how to regulate AI. President Donald Trump earlier this week declared that he would block local officials who try to regulate the technology; according to a draft executive order leaked on Wednesday, the administration will punish states that try. State lawmakers and members of Congress&#8212;including Georgia Republican Rep. Marjorie Taylor Greene&#8212;are now pushing back.&#160;...</description>
    </item>
    <item>
      <title>Boulanger fait son d&#233;stockage durant la Black Friday Week : les 17 deals immanquables du week-end</title>
      <link>https://www.frandroid.com/bons-plans/2859523_boulanger-fait-son-destockage-durant-la-black-friday-week-les-17-deals-immanquables-du-week-end</link>
      <pubDate>Sat, 22 Nov 2025 09:51:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2859523_boulanger-fait-son-destockage-durant-la-black-friday-week-les-17-deals-immanquables-du-week-end</guid>
      <description>
La Black Friday Week d&#233;marre &#224; peine et voil&#224; que d&#233;j&#224; de nouvelles offres font leur apparition chez plusieurs e-commer&#231;ants. Boulanger n&#8217;h&#233;site pas &#224; baisser les prix de nombreuses r&#233;f&#233;rences Tech. Voici les offres qui valent le coup.
</description>
    </item>
    <item>
      <title>Cdiscount d&#233;gaine de belles offres pour la Black Friday Week : les 11 offres &#224; ne pas louper ce week-end</title>
      <link>https://www.frandroid.com/bons-plans/2850059_cdiscount-degaine-de-belles-offres-pour-la-black-friday-week-les-11-offres-a-ne-pas-louper-ce-week-end</link>
      <pubDate>Sat, 22 Nov 2025 09:26:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850059_cdiscount-degaine-de-belles-offres-pour-la-black-friday-week-les-11-offres-a-ne-pas-louper-ce-week-end</guid>
      <description>
Chez Cdiscount une vague de nouvelles offres sur de nombreux produits Tech est apparue lors de la Black Friday Week. Voici notre s&#233;lection des meilleures promotions chez ce marchand. 
</description>
    </item>
  </channel>
</rss>
