<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 28 Jan 2026 09:39:01 GMT</lastBuildDate>
    <item>
      <title>Fnac et Darty multiplient les bonnes affaires avec ces derni&#232;res offres &#224; saisir avant la fin des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-multiplient-les-bonnes-affaires-avec-ces-dernieres-offres-a-saisir-avant-la-fin-des-soldes</link>
      <pubDate>Wed, 28 Jan 2026 09:36:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-multiplient-les-bonnes-affaires-avec-ces-dernieres-offres-a-saisir-avant-la-fin-des-soldes</guid>
      <description>
C'est l'heure de la derni&#232;re d&#233;marque ! Il reste encore quelques jours pour profiter des soldes d'hiver, et les enseignes Fnac et Darty n'ont pas dit leur dernier mot. On trouve tout un tas d'offres Tech int&#233;ressantes sur les 2 sites : voici celles qui ont retenu notre attention. 
</description>
    </item>
    <item>
      <title>L&#8217;IA rafle tout : ce g&#233;ant de la m&#233;moire a d&#233;j&#224; vendu toute sa production pour 2026</title>
      <link>https://www.frandroid.com/produits-android/hardware/memoire/2957545_lia-rafle-tout-ce-geant-de-la-memoire-a-deja-vendu-toute-sa-production-pour-2026</link>
      <pubDate>Wed, 28 Jan 2026 09:32:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/memoire/2957545_lia-rafle-tout-ce-geant-de-la-memoire-a-deja-vendu-toute-sa-production-pour-2026</guid>
      <description>
SK Hynix, l'un des principaux fournisseurs de m&#233;moire du monde, d&#233;voile des r&#233;sultats records pour l'ann&#233;e 2025. Et au vu de la situation actuelle du march&#233;, cela ne fait que commencer. 
</description>
    </item>
    <item>
      <title>Grado's S750 open-back wired headphones offer crystal clarity and a wide soundstage, but the fit isn't a hit</title>
      <link>https://www.techradar.com/audio/headphones/grado-signature/s750/review</link>
      <pubDate>Wed, 28 Jan 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">Yjpst956BfUpQPwCJ2z5MF</guid>
      <description>Grado's new B cushion brings you closer to the music for a superb soundtrack</description>
    </item>
    <item>
      <title>Google just leaked a first look at Android for PC in action</title>
      <link>https://www.theverge.com/news/869142/google-leak-aluminium-os-android-pc-bug-report-video</link>
      <pubDate>2026-01-28T04:26:01-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=869142</guid>
      <description>We've been waiting months for our first look at Android running on a PC in Google's upcoming ChromeOS / Android hybrid platform, codenamed Aluminium OS. Now we've seen it in action, and have Google to thank for the leak. 9to5Google spotted a bug report related to Chrome Incognito tabs published to the Google Issue Tracker [&#8230;]</description>
    </item>
    <item>
      <title>On monte un PC en partant de z&#233;ro : ce soir, Unlock Talk met les mains dans le cambouis !</title>
      <link>https://www.frandroid.com/humanoid/emissions/2957583_on-monte-un-pc-en-partant-de-zero-ce-soir-unlock-talk-met-les-mains-dans-le-cambouis</link>
      <pubDate>Wed, 28 Jan 2026 09:20:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/emissions/2957583_on-monte-un-pc-en-partant-de-zero-ce-soir-unlock-talk-met-les-mains-dans-le-cambouis</guid>
      <description>
La 41e d&#8217;Unlock Talk aura lieu ce mercredi 28 janvier 2026, &#224; 17h, sur notre cha&#238;ne Twitch Frandroidlive. Au menu du jour : de l&#8217;actualit&#233; bien &#233;videmment, mais aussi et surtout un montage PC from scratch, avec deux experts en la mati&#232;re.
</description>
    </item>
    <item>
      <title>Clap de fin pour les Samsung Galaxy&#160;S21 qui re&#231;oivent leur derni&#232;re mise &#224; jour</title>
      <link>https://www.frandroid.com/marques/samsung/2957485_clap-de-fin-pour-les-samsung-galaxy-s21-qui-recoivent-leur-derniere-mise-a-jour</link>
      <pubDate>Wed, 28 Jan 2026 09:16:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2957485_clap-de-fin-pour-les-samsung-galaxy-s21-qui-recoivent-leur-derniere-mise-a-jour</guid>
      <description>
Sorti il y a bient&#244;t cinq ans, le Galaxy&#160;S21 de Samsung s&#8217;appr&#234;te &#224; recevoir sa derni&#232;re mise &#224; jour. Mais le t&#233;l&#233;phone n&#8217;est pas forc&#233;ment &#224; mettre au placard pour autant&#8201;!
</description>
    </item>
    <item>
      <title>Vivre en appartement et recharger sa voiture &#233;lectrique : une belle progression qui n&#8217;efface pas tout</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2957419_vivre-en-appartement-et-recharger-sa-voiture-electrique-une-belle-progression-qui-nefface-pas-tout</link>
      <pubDate>Wed, 28 Jan 2026 09:16:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2957419_vivre-en-appartement-et-recharger-sa-voiture-electrique-une-belle-progression-qui-nefface-pas-tout</guid>
      <description>
On entend souvent que la recharge d&#8217;une voiture &#233;lectrique en immeuble n&#8217;est pas facile. Mais les choses s&#8217;am&#233;liorent au fil des ann&#233;es, comme le prouve cette &#233;tude.
</description>
    </item>
    <item>
      <title>Municipales 2026&#160;: pourquoi des candidates d&#233;clarent la guerre &#224; Meta</title>
      <link>https://www.01net.com/actualites/municipales-2026-pourquoi-des-candidates-declarent-la-guerre-a-meta.html</link>
      <pubDate>Wed, 28 Jan 2026 09:11:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322688</guid>
      <description>Une centaine d'&#233;lues montent au cr&#233;neau contre la m&#233;canique de diffusion de Facebook et Instagram. Elles d&#233;noncent une &#171; bulle masculine &#187; qui risque de transformer leur campagne politique en site de rencontres, mena&#231;ant le pluralisme du d&#233;bat.</description>
    </item>
    <item>
      <title>It's not Dante's Inferno 2, but this upcoming indie game takes inspiration from the same classic poem and could be the sequel to Visceral's 2010 game I've been hoping for all these years</title>
      <link>https://www.techradar.com/gaming/the-alighieri-circle-dantes-bloodline-reveal-news</link>
      <pubDate>Wed, 28 Jan 2026 09:08:34 +0000</pubDate>
      <guid isPermaLink="false">452DQRt2D9feWWJWHp94mG</guid>
      <description>Upcoming indie game The Alighieri Circle Dante's Bloodline looks like an intriguing psychological thriller, and taking its inspiration from the classic poem, The Divine Comedy, has its hooks in me already.</description>
    </item>
    <item>
      <title>Acer Nitro V 16 : ce laptop gaming propuls&#233; par une RTX 5060 est 400 &#8364; moins cher pour les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2769133_acer-nitro-v-16-ce-laptop-gaming-propulse-par-une-rtx-5060-est-400-euros-moins-cher-pour-les-soldes</link>
      <pubDate>Wed, 28 Jan 2026 09:02:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2769133_acer-nitro-v-16-ce-laptop-gaming-propulse-par-une-rtx-5060-est-400-euros-moins-cher-pour-les-soldes</guid>
      <description>
L'Acer Nitro V 16 est un laptop gaming qui allie une dalle de 16" &#224; 180 Hz avec une RTX 5060 et un prix contenu, pour ceux qui veulent jouer s&#233;rieusement sans sacrifier leur compte en banque. Il est encore plus abordable avec cette promo des soldes chez la Fnac et Darty : 999 euros au lieu de 1 399 euros. 
</description>
    </item>
    <item>
      <title>Windows 11 : nouveaut&#233;s, configuration requise, installation, t&#233;l&#233;chargement, tout savoir sur le syst&#232;me de Microsoft</title>
      <link>https://www.frandroid.com/marques/microsoft/1014601_windows-11-interface-design-configuration-prix-date-tout-savoir</link>
      <pubDate>Wed, 28 Jan 2026 09:00:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/1014601_windows-11-interface-design-configuration-prix-date-tout-savoir</guid>
      <description>
Windows 11 est la derni&#232;re version du syst&#232;me d'exploitation de Microsoft en date. Nouveaut&#233;s de l'OS, design, configuration requise, installation, voici tout ce qu'il faut savoir sur Windows 11.
</description>
    </item>
    <item>
      <title>How to watch Champions League Gameweek 8: Free Streams &amp; TV Channels</title>
      <link>https://www.techradar.com/how-to-watch/football/champions-league-gameweek-8-free</link>
      <pubDate>Wed, 28 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">wmsjMUwBxhxDSrtAaTexj3</guid>
      <description>All the ways to watch Champions League 2025/26 Matchday 8 live streams online and from anywhere, as the league phase reaches its fascinating conclusion.</description>
    </item>
    <item>
      <title>La fourche peut se briser en roulant : le d&#233;faut inqui&#233;tant qui touche deux v&#233;los &#233;lectriques Specialized</title>
      <link>https://www.frandroid.com/marques/specialized/2957475_la-fourche-peut-se-briser-en-roulant-le-defaut-inquietant-qui-touche-deux-velos-electriques-specialized</link>
      <pubDate>Wed, 28 Jan 2026 08:51:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/specialized/2957475_la-fourche-peut-se-briser-en-roulant-le-defaut-inquietant-qui-touche-deux-velos-electriques-specialized</guid>
      <description>
Specialized a lanc&#233; un rappel concernant ses v&#233;los &#233;lectriques Turbo Como SL 4.0 et 5.0 vendus depuis 2021, en raison d&#8217;un d&#233;faut potentiel affectant la fourche. La marque demande aux propri&#233;taires concern&#233;s de cesser imm&#233;diatement l&#8217;utilisation de leur v&#233;lo.
</description>
    </item>
    <item>
      <title>Le Mini Countryman &#233;lectrique &#233;volue pour enfin d&#233;passer les 500 km d&#8217;autonomie : voici ce qui change</title>
      <link>https://www.frandroid.com/marques/mini/2957373_le-mini-countryman-electrique-evolue-pour-enfin-depasser-les-500-km-dautonomie-voici-ce-qui-change</link>
      <pubDate>Wed, 28 Jan 2026 08:47:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/mini/2957373_le-mini-countryman-electrique-evolue-pour-enfin-depasser-les-500-km-dautonomie-voici-ce-qui-change</guid>
      <description>
D&#233;voil&#233; en 2023, le Mini Countryman s&#8217;offre quelques petites am&#233;liorations sous le capot. La voiture &#233;lectrique fait &#233;voluer sa batterie, et voit son autonomie d&#233;passer la barre des 500 kilom&#232;tres.
</description>
    </item>
    <item>
      <title>Clawdbot devient Moltbot : pourquoi Anthropic Claude pourrait tuer sa poule aux &#339;ufs d&#8217;or</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/anthropic-claude-ai/2957479_clawdbot-de-vient-moltbot-pourquoi-anthropic-claude-pourrait-tuer-sa-poule-aux-oeufs-dor</link>
      <pubDate>Wed, 28 Jan 2026 08:46:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/anthropic-claude-ai/2957479_clawdbot-de-vient-moltbot-pourquoi-anthropic-claude-pourrait-tuer-sa-poule-aux-oeufs-dor</guid>
      <description>
Anthropic vient de forcer Clawdbot &#224; se renommer Moltbot pour des histoires de marque, alors que l'outil est litt&#233;ralement en train de devenir leur plus grosse source de revenus indirects. 
</description>
    </item>
    <item>
      <title>Google Wallet&#160;: d&#233;couvrez la nouvelle interface pour acc&#233;der plus vite &#224; vos cartes</title>
      <link>https://www.01net.com/actualites/google-wallet-decouvrez-nouvelle-interface-acceder-plus-vite-cartes.html</link>
      <pubDate>Wed, 28 Jan 2026 08:41:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322887</guid>
      <description>Google pr&#233;pare une refonte visuelle majeure de son application Wallet afin de simplifier l'acc&#232;s aux cartes que vous utilisez le plus souvent.</description>
    </item>
    <item>
      <title>Windows&#160;: m&#233;fiez-vous des CAPTCHA, ils peuvent vous faire installer un virus</title>
      <link>https://www.01net.com/actualites/windows-mefiez-vous-captcha-peuvent-vous-faire-installer-virus.html</link>
      <pubDate>Wed, 28 Jan 2026 08:25:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322880</guid>
      <description>Une nouvelle cyberattaque ClickFix vise les utilisateurs Windows. L'attaque repose sur une page web pi&#233;g&#233;e avec un faux CAPTCHA qui va vous demander de copier&#8209;coller une simple commande. En ob&#233;issant, vous ouvrez les portes de votre ordinateur &#224; un redoutable virus, Amatera.</description>
    </item>
    <item>
      <title>Samsung veut vendre un million de Galaxy Wide Fold&#8230; mais c&#8217;est quoi le Galaxy Wide Fold ?</title>
      <link>https://www.frandroid.com/marques/samsung/2957413_samsung-veut-vendre-un-million-de-galaxy-wide-fold-mais-cest-quoi-le-galaxy-wide-fold</link>
      <pubDate>Wed, 28 Jan 2026 08:23:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2957413_samsung-veut-vendre-un-million-de-galaxy-wide-fold-mais-cest-quoi-le-galaxy-wide-fold</guid>
      <description>
Un Samsung Galaxy Wide Fold au format in&#233;dit pourrait voir le jour en r&#233;ponse directe &#224; l'iPhone Fold d'Apple. Voici tout ce que l'on sait.
</description>
    </item>
    <item>
      <title>Intel Panther Lake : les premiers prix du Core Ultra X7 358H piquent, on les a compar&#233;s au MacBook Pro</title>
      <link>https://www.frandroid.com/marques/intel/2957435_intel-panther-lake-les-premiers-prix-du-core-ultra-x7-358h-piquent-on-les-a-compares-au-macbook-pro</link>
      <pubDate>Wed, 28 Jan 2026 08:19:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/intel/2957435_intel-panther-lake-les-premiers-prix-du-core-ultra-x7-358h-piquent-on-les-a-compares-au-macbook-pro</guid>
      <description>
Intel Panther Lake (Series 3) est officiellement dans la nature. Sur le papier, le Core Ultra X7 358H est une petite bombe d'efficacit&#233;. Mais entre un Dell XPS 14 ind&#233;cent et un MSI Prestige plus raisonnable, attention.
</description>
    </item>
    <item>
      <title>Boulanger casse d&#233;j&#224; le prix des nouveaux &#233;couteurs ouverts de Huawei, taill&#233;s pour le sport</title>
      <link>https://www.frandroid.com/bons-plans/2956729_boulanger-casse-deja-le-prix-des-nouveaux-ecouteurs-ouverts-de-huawei-tailles-pour-le-sport</link>
      <pubDate>Wed, 28 Jan 2026 08:05:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2956729_boulanger-casse-deja-le-prix-des-nouveaux-ecouteurs-ouverts-de-huawei-tailles-pour-le-sport</guid>
      <description>
Huawei retente l&#8217;exp&#233;rience des &#233;couteurs ouverts avec les FreeClip&#8201;2, qui misent sur un&#160;meilleur confort&#160;et un&#160;son am&#233;lior&#233;. Parfaits pour le&#160;sport ou les d&#233;placements en ext&#233;rieur, ils profitent d&#233;j&#224; d&#8217;une&#160;remise de 30&#8201;euros&#160;&#224; l&#8217;occasion des&#160;soldes d&#8217;hiver&#8201;2026.
</description>
    </item>
    <item>
      <title>Microsoft soigne enfin l&#8217;interface du Xbox Cloud Gaming</title>
      <link>https://www.01net.com/actualites/microsoft-soigne-enfin-linterface-du-xbox-cloud-gaming.html</link>
      <pubDate>Wed, 28 Jan 2026 08:01:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322860</guid>
      <description>Le streaming de jeux est une pierre angulaire de de Microsoft qui veut mettre une &#171; Xbox &#187;&#160;entre les mains d'un maximum de joueurs, qu'ils soient &#233;quip&#233;s d'une Xbox, d'un PC&#8230; ou de n'importe quel autre appareil muni d'un &#233;cran et d'une connexion internet ! Il faut cependant soigner les d&#233;tails, &#224; commencer par une interface qui soit &#224; la mesure des attentes. C'est d&#233;sormais chose faite....</description>
    </item>
    <item>
      <title>The best E Ink tablets for 2026</title>
      <link>https://www.engadget.com/mobile/tablets/best-e-ink-tablet-130037939.html?src=rss</link>
      <pubDate>Wed, 28 Jan 2026 08:00:36 +0000</pubDate>
      <guid isPermaLink="false">57f41413-eec2-4d90-9c25-26d144b737b8</guid>
      <description>E Ink tablets have always been intriguing to me because I&#8217;m a longtime lover of pen and paper. I&#8217;ve had probably hundreds of notebooks over the years, serving as repositories for my story ideas, to-do lists, meeting notes and everything in between. However, I turned away from physical notebooks at a certain point because it was just easier to store everything digitally so I always had my most important information at my fingertips.E Ink tablets seem to provide the best of both worlds: the tactile satisfaction of regular notebooks with many of the conveniences found in digital tools, plus easy-...</description>
    </item>
    <item>
      <title>Doomsday Clock now closest to midnight ever</title>
      <link>https://mashable.com/article/doomsday-clock-2026-seconds-close-to-midnight</link>
      <pubDate>Wed, 28 Jan 2026 08:00:09 +0000</pubDate>
      <guid isPermaLink="false">063pEcqg0ug1yW6ZHTZEgPN</guid>
      <description>Scientists have set the symbolic Doomsday Clock at 85 seconds to midnight, the closest it has ever been to global apocalypse.</description>
    </item>
    <item>
      <title>Wonder Man ending explained: what happens to Simon and Trevor, and more on the new Marvel TV show's finale</title>
      <link>https://www.techradar.com/streaming/disney-plus/wonder-man-ending-explained</link>
      <pubDate>Wed, 28 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">9U9rAuxPNLvpPG7md6kmvM</guid>
      <description>Want to know what the future might hold for Simon Williams and Trevor Slattery in the MCU? TechRadar has got you covered.</description>
    </item>
    <item>
      <title>&#171;&#8201;Instagram est une drogue&#8201;&#187;&#160;: des documents internes &#224; Meta ravivent les critiques sur la nocivit&#233; des r&#233;seaux sociaux</title>
      <link>https://www.frandroid.com/marques/meta/2957377_instagram-est-une-drogue-des-documents-internes-a-meta-ravivent-les-critiques-sur-la-nocivite-des-reseaux-sociaux</link>
      <pubDate>Wed, 28 Jan 2026 07:53:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2957377_instagram-est-une-drogue-des-documents-internes-a-meta-ravivent-les-critiques-sur-la-nocivite-des-reseaux-sociaux</guid>
      <description>
Dans un proc&#232;s assez m&#233;diatis&#233; aux &#201;tats-Unis, des documents internes &#224; Meta semblent indiquer que la firme avait conscience des effets d&#233;l&#233;t&#232;res de ses applis sur la sant&#233; mentale des plus jeunes, mais a redoubl&#233; d&#8217;efforts plut&#244;t que de se remettre en question.
</description>
    </item>
  </channel>
</rss>
