<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 21 Jan 2026 11:28:48 GMT</lastBuildDate>
    <item>
      <title>La fronde contre l&#8217;algorithme de la CAF, accus&#233; de sur-contr&#244;ler les plus pr&#233;caires, s&#8217;&#233;largit, avec un nouvel alli&#233; de taille</title>
      <link>https://www.01net.com/actualites/la-fronde-contre-algorithme-caf-accuse-de-sur-controler-plus-precaires-selargit-nouvel-allie.html</link>
      <pubDate>Wed, 21 Jan 2026 11:16:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321427</guid>
      <description>L'algorithme de notation utilis&#233; par la CAF est-il discriminatoire ? Alors que le recours devant le Conseil d'Etat form&#233; par 15 organisations a &#233;t&#233; rejoint par 10 autres associations ou syndicats, la fronde peut d&#233;sormais s'appuyer sur un avis du D&#233;fenseur des droits. L'autorit&#233; ind&#233;pendante estime que l'outil utilis&#233; par la CAF &#171;&#160;para&#238;t produire un surcontr&#244;le des populations les plus pr&#233;caires &#187;....</description>
    </item>
    <item>
      <title>Sony n&#8217;en veut pas mais ces d&#233;veloppeurs l&#8217;ont fait : Bloodborne existe en 4K et 60 FPS sur PC</title>
      <link>https://www.frandroid.com/produits-android/console/2950059_sony-nen-veut-pas-mais-ces-developpeurs-lont-fait-bloodborne-existe-en-4k-et-60-fps-sur-pc</link>
      <pubDate>Wed, 21 Jan 2026 11:11:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2950059_sony-nen-veut-pas-mais-ces-developpeurs-lont-fait-bloodborne-existe-en-4k-et-60-fps-sur-pc</guid>
      <description>
Sans portage PC ni version PS5 en vue, Bloodborne frustre de nombreux joueurs avec sa version PS4 dat&#233;e. La communaut&#233; de l'&#233;mulation fait cependant des miracles depuis plusieurs ann&#233;es avec un travail digne d'un v&#233;ritable remaster.
</description>
    </item>
    <item>
      <title>PowerToys&#160;: Microsoft d&#233;ploie un torrent nouveaut&#233;s pour son meilleur outil</title>
      <link>https://www.01net.com/actualites/powertoys-microsoft-deploie-un-torrent-nouveautes-pour-son-meilleur-outil.html</link>
      <pubDate>Wed, 21 Jan 2026 11:04:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321527</guid>
      <description>Microsoft vient de mettre &#224; jour ses PowerToys pour y int&#233;grer un nouvel utilitaire pour la souris et un &#233;norme coup de fouet pour sa Palette de commandes, son lanceur rapide pour Windows.</description>
    </item>
    <item>
      <title>&#8216;I&#8217;m Witnessing a Lot of Emptiness&#8217;: How ICE Uprooted Normal Life in Minneapolis</title>
      <link>https://www.wired.com/story/how-ice-uprooted-normal-life-in-minneapolis/</link>
      <pubDate>Wed, 21 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">696815792e8186519254af3f</guid>
      <description>WIRED talks to a postal worker, a teacher, two US citizens detained by federal agents, and six more Minnesota residents about life in an occupied American city.</description>
    </item>
    <item>
      <title>How to Fix Your Wi-Fi Problems (2026)</title>
      <link>https://www.wired.com/story/how-to-fix-wi-fi/</link>
      <pubDate>Wed, 21 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">696a358274a6e2705c2e6019</guid>
      <description>Is your magic internet box giving you problems? Get back online and stay there with our expert Wi-Fi fixes and tips.</description>
    </item>
    <item>
      <title>Vie num&#233;rique | L&#8217;IA g&#233;n&#233;rative plus cr&#233;ative que nous, sauf que&#8230;</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-01-21/vie-numerique/l-ia-generative-plus-creative-que-nous-sauf-que.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 21 Jan 2026 06:00:00 -0500</pubDate>
      <guid isPermaLink="false">27f899038dec34239127876410b6bd0a</guid>
      <description>L&#8217;IA g&#233;n&#233;rative est-elle plus cr&#233;ative que les humains&#160;? &#171;&#160;Noui&#160;&#187;, r&#233;pondent dans une importante &#233;tude publi&#233;e ce mercredi des universitaires montr&#233;alais, dont le chercheur Yoshua Bengio. Car si certaines IA sont plus cr&#233;atives que la moyenne de la population, elles le sont moins que les plus cr&#233;atifs d&#8217;entre nous.</description>
    </item>
    <item>
      <title>S&#233;isme dans le v&#233;lo : le g&#233;ant Canyon va licencier 20 % de ses effectifs apr&#232;s plusieurs ann&#233;es d&#233;licates</title>
      <link>https://www.frandroid.com/marques/canyon/2949893_seisme-dans-le-velo-le-geant-canyon-va-licencier-20-de-ses-effectifs-apres-plusieurs-annees-delicates</link>
      <pubDate>Wed, 21 Jan 2026 10:58:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/canyon/2949893_seisme-dans-le-velo-le-geant-canyon-va-licencier-20-de-ses-effectifs-apres-plusieurs-annees-delicates</guid>
      <description>
En supprimant 320 postes, soit 20 % du total de ses effectifs, la marque allemande Canyon confirme des changements importants sous l&#8217;&#233;gide de son fondateur, nourri d&#8217;ambitions, particuli&#232;rement dans le v&#233;lo &#233;lectrique.
</description>
    </item>
    <item>
      <title>OpenAI says its data centers will pay for own energy and limit water usage</title>
      <link>https://www.theverge.com/news/864798/openai-data-center-opposition-energy-bills</link>
      <pubDate>2026-01-21T05:58:15-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864798</guid>
      <description>OpenAI says it will minimize water use and pay for energy infrastructure upgrades needed to power its data centers. "We're being good neighbors," the company said, directly addressing the growing opposition to AI projects amid rising utility bills. "We commit to paying our own way on energy, so that our operations don't increase your electricity [&#8230;]...</description>
    </item>
    <item>
      <title>OnePlus says rumors of its demise are 'false' and 'unsubstantiated' &#8212; and we're glad to hear it</title>
      <link>https://www.techradar.com/phones/oneplus-phones/oneplus-says-rumors-of-its-demise-are-false-and-unsubstantiated-and-were-glad-to-hear-it</link>
      <pubDate>Wed, 21 Jan 2026 10:55:57 +0000</pubDate>
      <guid isPermaLink="false">frJAbMi4tDDoHxbsGXGKaB</guid>
      <description>Reports that OnePlus is being shuttered by parent company Oppo have been countered by a OnePlus exec.</description>
    </item>
    <item>
      <title>ChatGPT va d&#233;sormais deviner votre &#226;ge pour prot&#233;ger les mineurs des contenus adultes</title>
      <link>https://www.frandroid.com/marques/openai/2950153_chatgpt-va-desormais-deviner-votre-age-pour-proteger-les-mineurs-des-contenus-adultes</link>
      <pubDate>Wed, 21 Jan 2026 10:55:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/openai/2950153_chatgpt-va-desormais-deviner-votre-age-pour-proteger-les-mineurs-des-contenus-adultes</guid>
      <description>
OpenAI franchit une nouvelle &#233;tape dans la r&#233;gulation de son chatbot. L'entreprise d&#233;ploie mondialement un syst&#232;me de &#171; pr&#233;diction d'&#226;ge &#187; pour identifier les mineurs sur ChatGPT. 
</description>
    </item>
    <item>
      <title>La version 16+512 Go du OnePlus 15 est &#224; son plus bas prix pour les soldes, mais les stocks sont tr&#232;s limit&#233;s</title>
      <link>https://www.frandroid.com/bons-plans/2895271_la-version-16512-go-du-oneplus-15-est-a-son-plus-bas-prix-pour-les-soldes-mais-les-stocks-sont-tres-limites</link>
      <pubDate>Wed, 21 Jan 2026 10:52:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2895271_la-version-16512-go-du-oneplus-15-est-a-son-plus-bas-prix-pour-les-soldes-mais-les-stocks-sont-tres-limites</guid>
      <description>
OnePlus change sa fa&#231;on d'aborder le march&#233; avec sa nouvelle monture num&#233;rot&#233;e 15. Cette nouvelle it&#233;ration est pens&#233;e comme une console portable, une b&#234;te de calcul et un &#233;cran qui s'oriente sur la performance. Sorti il y a peu de temps, il b&#233;n&#233;ficie d&#233;j&#224; d'une belle baisse de prix pendant les soldes : 968 euros au lieu de 1 129 euros sur Amazon.
...</description>
    </item>
    <item>
      <title>Fnac et Darty multiplient les deals pour la 3e d&#233;marque des soldes : les 18 meilleures offres &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-multiplient-les-deals-pour-la-3e-demarque-des-soldes-les-18-meilleures-offres-a-retenir</link>
      <pubDate>Wed, 21 Jan 2026 10:41:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-multiplient-les-deals-pour-la-3e-demarque-des-soldes-les-18-meilleures-offres-a-retenir</guid>
      <description>
Ce mercredi 21 janvier, signe le lancement de la 3&#7497; d&#233;marque ! &#192; cette occasion, la Fnac et Darty ouvrent une nouvelle vague de promotions sur les produits Tech. Smartphones, tablettes, ordinateurs&#8230; les bonnes affaires se multiplient, avec notamment le r&#233;cent Galaxy&#8201;Z&#8201;Flip&#8201;7 affich&#233; &#224; prix cass&#233;.
</description>
    </item>
    <item>
      <title>Pourquoi le Samsung Galaxy A57 pourrait faire de l&#8217;ombre au Galaxy S26</title>
      <link>https://www.01net.com/actualites/pourquoi-samsung-galaxy-a57-pourrait-faire-ombre-galaxy-s26.html</link>
      <pubDate>Wed, 21 Jan 2026 10:34:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321470</guid>
      <description>Alors que le Galaxy S26 n&#8217;est plus tr&#232;s loin, les caract&#233;ristiques techniques du Galaxy A57 pourraient positionner le t&#233;l&#233;phone milieu de gamme de Samsung comme une alternative tr&#232;s cr&#233;dible.</description>
    </item>
    <item>
      <title>Document Disclosures Reveal Microsoft&#8217;s Influence as OpenAI Became a Revenue-Crazed Behemoth</title>
      <link>https://gizmodo.com/document-disclosures-reveal-microsofts-influence-as-openai-became-a-revenue-crazed-behemoth-2000712308</link>
      <pubDate>Wed, 21 Jan 2026 10:30:23 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000712308</guid>
      <description>A peek inside OpenAI as it changed from do-gooder computer lab to...whatever it is now.</description>
    </item>
    <item>
      <title>Meta Seeks to Bar Mentions of Mental Health&#8212;and Zuckerberg&#8217;s Harvard Past&#8212;From Child Safety Trial</title>
      <link>https://www.wired.com/story/meta-child-safety-trial-ask-judge-bar-mental-health-harvard/</link>
      <pubDate>Wed, 21 Jan 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">695ff61d1a2c4556c7acb2af</guid>
      <description>The trial starts soon in New Mexico&#8217;s case against Meta&#8212;and the company is pulling out all the stops to protect its reputation.</description>
    </item>
    <item>
      <title>50&#160;000 sites web en danger&#160;: une faille d&#8217;un plugin WordPress populaire a &#233;t&#233; d&#233;couverte</title>
      <link>https://www.01net.com/actualites/50-000-sites-web-danger-faille-plugin-wordpress-populaire-decouverte.html</link>
      <pubDate>Wed, 21 Jan 2026 10:28:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321461</guid>
      <description>Une faille critique a &#233;t&#233; d&#233;busqu&#233;e dans un plugin Wordpress install&#233; sur 100 000 sites web. Elle permet &#224; un pirate de se cr&#233;er un compte administrateur sur le site et d&#8217;en prendre le contr&#244;le total. La moiti&#233; des sites sont toujours vuln&#233;rables, bien qu'une mise &#224; jour ait &#233;t&#233; d&#233;ploy&#233;e.</description>
    </item>
    <item>
      <title>The Brave and the Bold's writer has seemingly been named &#8212; and Batman fans aren't pleased with who's been picked to pen the DCU movie</title>
      <link>https://www.techradar.com/streaming/entertainment/the-brave-and-the-bolds-writer-has-seemingly-been-named-and-batman-fans-arent-pleased-with-whos-been-picked-to-pen-the-dcu-movie</link>
      <pubDate>Wed, 21 Jan 2026 10:26:58 +0000</pubDate>
      <guid isPermaLink="false">g3yUBHm5y523gviTQ8Ecq6</guid>
      <description>The DCU Batman film's writer has reportedly been revealed &#8212; and it's the same person who penned box office bomb The Flash.</description>
    </item>
    <item>
      <title>Formovie lance le Xming Page Two : un vid&#233;oprojecteur plus lumineux avec Netflix et Google TV</title>
      <link>https://www.frandroid.com/marques/formovie/2950091_formovie-xming-page-two-un-videoprojecteur-lcd-compact-certifie-netflix-et-google-tv</link>
      <pubDate>Wed, 21 Jan 2026 10:26:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/formovie/2950091_formovie-xming-page-two-un-videoprojecteur-lcd-compact-certifie-netflix-et-google-tv</guid>
      <description>
Formovie &#233;largit sa gamme de vid&#233;oprojecteurs portables avec le Xming Page Two, un mod&#232;le Full HD &#224; technologie LCD int&#233;grant Google TV et une certification Netflix.
</description>
    </item>
    <item>
      <title>Google Glass, Amazon Fire, Friendster: Why great ideas from successful companies fail</title>
      <link>https://www.fastcompany.com/91462988/google-glass-amazon-fire-friendster-why-great-ideas-from-successful-companies-fail-great-ideas-fail-google-glass</link>
      <pubDate>2026-01-21T10:26:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91462988/google-glass-amazon-fire-friendster-why-great-ideas-from-successful-companies-fail-great-ideas-fail-google-glass</guid>
      <description>Here are the traps companies fall into.
In the world of business, we tend to believe that success is a direct result of talent, resources, and a &#8220;great idea.&#8221; We expect that if a company has a track record of dominance, like Google, Amazon, or Apple, they are a sure bet for the next big thing. Yet, the history of innovation is littered with the wreckage of unexpected flops launched by industry giants....</description>
    </item>
    <item>
      <title>&#171; Le rythme de production initial sera atrocement lent &#187; : l&#8217;aveu d&#8217;Elon Musk sur la nouvelle Tesla</title>
      <link>https://www.frandroid.com/marques/tesla/2949809_le-rythme-de-production-initial-sera-atrocement-lent-laveu-delon-musk-sur-la-nouvelle-tesla</link>
      <pubDate>Wed, 21 Jan 2026 10:25:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2949809_le-rythme-de-production-initial-sera-atrocement-lent-laveu-delon-musk-sur-la-nouvelle-tesla</guid>
      <description>
D&#233;voil&#233; en 2024, le Tesla Cybercab nous donne de ses nouvelles. D'apr&#232;s Elon Musk, la voiture &#233;lectrique autonome du constructeur devrait mettre un peu de temps &#224; acc&#233;l&#233;rer sa cadence de production. Et voici la raison.
</description>
    </item>
    <item>
      <title>ChatGPT is using age prediction to restrict what minors see</title>
      <link>https://www.theverge.com/news/864784/openai-chatgpt-age-prediction-restrictions-rollout</link>
      <pubDate>2026-01-21T05:23:14-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864784</guid>
      <description>OpenAI has added age prediction features to ChatGPT, meant to identify and bolster protections for underage users. These age detection plans were announced in December alongside updated guidelines for interacting with teens, and follow a rise in similar age-gating efforts from online platforms, including Instagram, YouTube, TikTok, and Roblox. ChatGPT's age prediction model works by [&#8230;]...</description>
    </item>
    <item>
      <title>CEOs want to spend more on AI - but they aren't seeing any big returns just yet</title>
      <link>https://www.techradar.com/pro/ceos-want-to-spend-more-on-ai-but-they-arent-seeing-any-big-returns-just-yet</link>
      <pubDate>Wed, 21 Jan 2026 10:22:39 +0000</pubDate>
      <guid isPermaLink="false">NprKKAKtMpkBJGgNWZWejL</guid>
      <description>Revenue growth is still pretty low, but businesses continue to invest in AI and explore next-gen agentic models.</description>
    </item>
    <item>
      <title>New Arc Raiders update appears to address some notorious out-of-bounds glitches, but players aren't convinced</title>
      <link>https://www.techradar.com/gaming/new-arc-raiders-update-appears-to-address-some-notorious-out-of-bounds-glitches-but-players-arent-convinced</link>
      <pubDate>Wed, 21 Jan 2026 10:22:05 +0000</pubDate>
      <guid isPermaLink="false">6Vm5h9qncFFA5SenPzUT2f</guid>
      <description>Arc Raiders' Stella Montis map still seems to be overrun with cheaters despite a new patch trying to address exactly that.</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver : la 3e d&#233;marque d&#233;marre fort, voici les offres qui m&#233;ritent votre argent</title>
      <link>https://www.frandroid.com/bons-plans/2949895_soldes-dhiver-3e-demarque-meilleures-offres-en-direct</link>
      <pubDate>Wed, 21 Jan 2026 10:18:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2949895_soldes-dhiver-3e-demarque-meilleures-offres-en-direct</guid>
      <description>
Cela fait d&#233;j&#224; deux semaines que les soldes d'hiver ont commenc&#233; en France et que les e-commer&#231;ants tels qu'Amazon, Fnac, Darty, Boulanger ou encore Cdiscount partagent des offres. Aujourd'hui, c'est la 3e d&#233;marque et les promotions se multiplient. 
</description>
    </item>
    <item>
      <title>In a move absolutely no one saw coming, The Office could be added to Fortnite soon &#8211; here&#8217;s what we know about the teaser so far</title>
      <link>https://www.techradar.com/gaming/in-a-move-absolutely-no-one-saw-coming-the-office-could-be-added-to-fortnite-soon-heres-what-we-know-about-the-teaser-so-far</link>
      <pubDate>Wed, 21 Jan 2026 10:13:18 +0000</pubDate>
      <guid isPermaLink="false">mBjx2vRKFAYU5aXMiSMLXT</guid>
      <description>The next Fortnite crossover seems to be The Office, as Epic Games teases an upcoming tie-in. Here's what we know so far.</description>
    </item>
    <item>
      <title>3 millions d&#8217;euros d&#8217;argent public ont &#233;t&#233; d&#233;tourn&#233;s &#224; cause d&#8217;une n&#233;gligence de cybers&#233;curit&#233;</title>
      <link>https://www.01net.com/actualites/3-millions-euros-argent-public-detournes-cause-negligence-cybersecurite.html</link>
      <pubDate>Wed, 21 Jan 2026 10:03:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321442</guid>
      <description>Un agent municipal a r&#233;ussi &#224; d&#233;tourner plus de trois millions d&#8217;euros en profitant d'un ordinateur laiss&#233; ouvert, et sans surveillance, pendant la pause d&#233;jeuner d'un coll&#232;gue. L'affaire d&#233;montre qu'une simple n&#233;gligence de s&#233;curit&#233; informatique peut avoir de s&#233;rieuses cons&#233;quences...</description>
    </item>
    <item>
      <title>The best robot vacuum for 2026</title>
      <link>https://www.engadget.com/home/smart-home/best-robot-vacuums-130010426.html?src=rss</link>
      <pubDate>Wed, 21 Jan 2026 10:02:26 +0000</pubDate>
      <guid isPermaLink="false">34d85207-dd69-4011-9786-cd94e2fbea9d</guid>
      <description>Looking to keep your home clean without having to vacuum and mop every day, pick up dirt, the dinner your child threw on the floor or your furry friend&#8217;s endless pet hair? Join the club. Smart home gadgets have come a long way over the years, and that includes robot vacuums. With newer technology including voice controls, object detection and more automation features, investing in a robot vacuum cleaner makes more sense now than ever before. Some of the best robot vacuum cleaners even have mopping capabilities, roller brush options and self-emptying bases, too, and there are plenty that don't ...</description>
    </item>
    <item>
      <title>Trump Family Makes $1.4 Billion Off Crypto in 2025, Offsetting Losses Elsewhere</title>
      <link>https://gizmodo.com/trump-family-makes-1-4-billion-off-crypto-in-2025-offsetting-losses-elsewhere-2000711770</link>
      <pubDate>Wed, 21 Jan 2026 10:00:44 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711770</guid>
      <description>Crypto is now said to account for roughly 20% of the family&#8217;s $6.8 billion fortune.</description>
    </item>
    <item>
      <title>The AI Boom Will Increase US Carbon Emissions&#8212;but It Doesn&#8217;t Have To</title>
      <link>https://www.wired.com/story/the-ai-boom-will-increase-us-carbon-emissions-but-it-doesnt-have-to/</link>
      <pubDate>Wed, 21 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">696a5bca21fa35fbff688f13</guid>
      <description>A new analysis finds that data centers&#8217; energy demands will drastically increase power plant emissions over the next decade. Renewables, though, could cut them while helping keep prices from rising.</description>
    </item>
    <item>
      <title>2026 will be the year Cybertruck dies</title>
      <link>https://www.fastcompany.com/91475013/2026-will-be-the-year-cybertruck-dies</link>
      <pubDate>2026-01-21T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91475013/2026-will-be-the-year-cybertruck-dies</guid>
      <description>Tesla CEO Elon Musk overpromised sales of 250,000 Cybertrucks annually by 2025. The company has reached barely 8% of that target.
The Tesla Cybertruck is the new Ford Edsel, taking the crown from one of the biggest flops in American car history.</description>
    </item>
    <item>
      <title>Atari&#8217;s planned gaming-themed Las Vegas hotel has been canceled</title>
      <link>https://www.fastcompany.com/91477957/ataris-planned-gaming-themed-las-vegas-hotel-has-been-cancelled</link>
      <pubDate>2026-01-21T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91477957/ataris-planned-gaming-themed-las-vegas-hotel-has-been-cancelled</guid>
      <description>It&#8217;s Game Over for Atari&#8217;s plans to build a hotel in Las Vegas. Only one of its eight prospective U.S. hotels is still in any stage of development.
Six years ago, Atari announced ambitious plans to build a gamer-themed hotel in Las Vegas, featuring an e-sports studio and a movie theater. The legacy video game company&#8217;s management at the time saw hotels as a way to revitalize the brand&#8217;s name, which was largely a nostalgia play. ...</description>
    </item>
    <item>
      <title>Ces 24 disques de d&#233;bris qui r&#233;v&#232;lent un cha&#238;non manquant de la formation des plan&#232;tes</title>
      <link>https://www.futura-sciences.com/sciences/actualites/formation-planetes-ces-24-disques-debris-revelent-chainon-manquant-formation-planetes-130362/#xtor%3DRSS-8</link>
      <pubDate>Wed, 21 Jan 2026 10:57:57 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/formation-planetes-ces-24-disques-debris-revelent-chainon-manquant-formation-planetes-130362/#xtor%3DRSS-8</guid>
      <description>Des astronomes ont capt&#233; des syst&#232;mes plan&#233;taires &#224; un stade rarement vu de leur d&#233;veloppement. Extr&#234;mement jeunes, il s'agit de disques de d&#233;bris constitu&#233;s de poussi&#232;re qui repr&#233;sentent une &#233;tape capitale et encore mal connue dans la formation des plan&#232;tes.</description>
    </item>
    <item>
      <title>The Apple Magic Keyboard is $60 off right now at Amazon</title>
      <link>https://mashable.com/article/jan-21-apple-keyboard-deal</link>
      <pubDate>Wed, 21 Jan 2026 09:57:42 +0000</pubDate>
      <guid isPermaLink="false">0655kkKN3VcGBX5wQkLcRyq</guid>
      <description>Find the best Apple deal. Save 24% on the Apple Magic Keyboard at Amazon.</description>
    </item>
    <item>
      <title>Ne jetez pas vos vieilles enceintes Marshall : ce nouveau produit leur offre le streaming et vient concurrencer Sonos</title>
      <link>https://www.frandroid.com/marques/marshall/2949975_ne-jetez-pas-vos-vieilles-enceintes-marshall-ce-nouveau-produit-leur-offre-le-streaming-et-vient-concurrencer-sonos</link>
      <pubDate>Wed, 21 Jan 2026 09:54:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/marshall/2949975_ne-jetez-pas-vos-vieilles-enceintes-marshall-ce-nouveau-produit-leur-offre-le-streaming-et-vient-concurrencer-sonos</guid>
      <description>
Avec Heddon, Marshall pr&#233;sente un hub de streaming musical d&#233;di&#233;, capable de diffuser un son coh&#233;rent dans plusieurs pi&#232;ces via le Wi-Fi et Auracast, tout en r&#233;introduisant le vinyle au centre d&#8217;un syst&#232;me audio domestique connect&#233;.
</description>
    </item>
    <item>
      <title>D&#233;fauts techniques et commandes annul&#233;es : la gal&#232;re des batteries fran&#231;aises d&#8217;ACC se poursuit</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2949761_defauts-techniques-et-commandes-annulees-la-galere-des-batteries-francaises-dacc-se-poursuit</link>
      <pubDate>Wed, 21 Jan 2026 09:52:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2949761_defauts-techniques-et-commandes-annulees-la-galere-des-batteries-francaises-dacc-se-poursuit</guid>
      <description>
Fond&#233;e en 2020, la firme tricolore ACC commence tout doucement &#224; monter en rythme. Tout est cependant loin d'&#234;tre r&#233;gl&#233; pour ses batteries pour voitures &#233;lectriques, qui rencontrent encore de nombreuses difficult&#233;s.
</description>
    </item>
    <item>
      <title>10 free dating apps to try for winter 2026</title>
      <link>https://mashable.com/roundup/best-free-dating-sites-apps</link>
      <pubDate>Wed, 21 Jan 2026 09:49:33 +0000</pubDate>
      <guid isPermaLink="false">01jPJXtwRdqkk4yJw3b1aGo</guid>
      <description>We've rounded up the best free dating apps to try this year. Find love, a fling, or anything in between &#8212; no credit card required.</description>
    </item>
    <item>
      <title>&#171;&#160;C&#8217;est faux&#160;&#187; : OnePlus d&#233;ment son d&#233;mant&#232;lement, mais le doute persiste</title>
      <link>https://www.01net.com/actualites/cest-faux-oneplus-dement-son-demantelement-mais-le-doute-persiste.html</link>
      <pubDate>Wed, 21 Jan 2026 09:48:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321432</guid>
      <description>Face &#224; la temp&#234;te m&#233;diatique annon&#231;ant sa disparition programm&#233;e, OnePlus r&#233;agit. La direction qualifie les rumeurs de &#171; fausses &#187;, mais le silence des branches am&#233;ricaine et europ&#233;enne laisse encore planer le doute.</description>
    </item>
    <item>
      <title>MacBook Pro M5 Max : pourquoi les chiffres alarmants de l&#8217;actuelle puce M4 Max font craindre la surchauffe</title>
      <link>https://www.frandroid.com/marques/apple/2949713_macbook-pro-m5-max-pourquoi-les-chiffres-alarmants-de-lactuelle-puce-m4-max-font-craindre-la-surchauffe</link>
      <pubDate>Wed, 21 Jan 2026 09:43:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2949713_macbook-pro-m5-max-pourquoi-les-chiffres-alarmants-de-lactuelle-puce-m4-max-font-craindre-la-surchauffe</guid>
      <description>
Un redditeur a mis en &#233;vidence quelques-unes des sorties de piste pr&#233;occupantes de sa puce M4 Max en termes de ma&#238;trise &#233;nerg&#233;tique, d&#233;montrant que derri&#232;re la sobri&#233;t&#233; habituelle des solutions d'Apple, des flamb&#233;es de consommation spectaculaires sont tout de m&#234;me &#224; pointer du doigt. 
</description>
    </item>
    <item>
      <title>Just ordered a MacBook Pro M4 Max? You might face a long wait to get it &#8212; but it's not because of the RAM crisis</title>
      <link>https://www.techradar.com/computing/macbooks/apple-macbook-pro-m4-max-buyers-beware-you-might-face-huge-delays-getting-your-laptop-but-its-not-because-of-the-ram-crisis</link>
      <pubDate>Wed, 21 Jan 2026 09:37:04 +0000</pubDate>
      <guid isPermaLink="false">aQ92J8htpEq3UMBrYKgQhh</guid>
      <description>Apple is expected to announce its M5 Pro and M5 Max chips at some point &#8211; and it could be sooner than we thought.</description>
    </item>
    <item>
      <title>Adieu la panne de batterie ? Le Motorola Edge 70 Fusion mise tout sur l&#8217;autonomie</title>
      <link>https://www.frandroid.com/marques/motorola/2949829_adieu-la-panne-de-batterie-le-motorola-edge-70-fusion-mise-tout-sur-lautonomie</link>
      <pubDate>Wed, 21 Jan 2026 09:36:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/motorola/2949829_adieu-la-panne-de-batterie-le-motorola-edge-70-fusion-mise-tout-sur-lautonomie</guid>
      <description>
Le Motorola Edge 70 Fusion se d&#233;voile avant l'heure avec une grosse batterie et un accent mis sur la robustesse.
</description>
    </item>
    <item>
      <title>Marathon : excellente nouvelle pour votre PC, le nouveau jeu de Bungie tournera sur des GPU vieux de 10 ans</title>
      <link>https://www.frandroid.com/produits-android/console/2949795_marathon-excellente-nouvelle-pour-votre-pc-le-nouveau-jeu-de-bungie-tournera-sur-des-gpu-vieux-de-10-ans</link>
      <pubDate>Wed, 21 Jan 2026 09:35:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2949795_marathon-excellente-nouvelle-pour-votre-pc-le-nouveau-jeu-de-bungie-tournera-sur-des-gpu-vieux-de-10-ans</guid>
      <description>
Marathon, le nouveau FPS des cr&#233;ateurs de Halo et Destiny, sera lanc&#233; le 5 mars prochain. Le studio a d&#233;voil&#233; les configurations recommand&#233;es de ce nouvel extraction shooter. Une excellente nouvelle pour de nombreux joueurs PC.
</description>
    </item>
    <item>
      <title>Amazon profite de la 3e d&#233;marque des soldes pour d&#233;stocker &#224; petit prix de nombreux produits Tech</title>
      <link>https://www.frandroid.com/bons-plans/2933045_amazon-profite-de-la-3e-demarque-des-soldes-pour-destocker-a-petit-prix-de-nombreux-produits-tech</link>
      <pubDate>Wed, 21 Jan 2026 09:35:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933045_amazon-profite-de-la-3e-demarque-des-soldes-pour-destocker-a-petit-prix-de-nombreux-produits-tech</guid>
      <description>
Le top d&#233;part de la 3&#7497; d&#233;marque est lanc&#233; ! Les soldes d&#8217;hiver se poursuivent avec des offres toujours aussi attractives chez Amazon, accessibles &#224; tous, m&#234;me sans abonnement Prime. Mieux encore, certains produits Tech r&#233;cents voient leurs prix chuter &#224; cette occasion &#8212; &#224; l&#8217;image du tout nouveau OnePlus&#8201;15, d&#233;j&#224; affich&#233; &#224; prix r&#233;duit.
</description>
    </item>
    <item>
      <title>ChatGPT pr&#233;dit d&#233;sormais l&#8217;&#226;ge des utilisateurs pour identifier les mineurs</title>
      <link>https://www.01net.com/actualites/chatgpt-predit-desormais-age-utilisateurs-identifier-mineurs.html</link>
      <pubDate>Wed, 21 Jan 2026 09:31:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321417</guid>
      <description>ChatGPT se met d&#233;sormais &#224; pr&#233;dire l'&#226;ge de ses utilisateurs. Pour identifier les adolescents, OpenAI utilise un algorithme qui s'attarde sur les signaux comportementaux laiss&#233;s par les usagers. En cas d'erreur, la start-up r&#233;clame un selfie pour lever les restrictions.</description>
    </item>
  </channel>
</rss>
