<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 25 Nov 2025 13:47:14 GMT</lastBuildDate>
    <item>
      <title>The best earbuds I recommend for every budget, all TechRadar tested</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/the-best-earbuds</link>
      <pubDate>Tue, 25 Nov 2025 13:42:23 +0000</pubDate>
      <guid isPermaLink="false">v6KhHtp4uqZNoCs2w9vZhh</guid>
      <description>My carefully considered pick of the best earbuds in the business &#8211; including one or two new models you might not be familiar with.</description>
    </item>
    <item>
      <title>Aluminium OS&#160;: le projet de Google pour rivaliser avec Windows, macOS et l&#8217;iPad</title>
      <link>https://www.01net.com/actualites/aluminium-os-le-projet-de-google-pour-rivaliser-avec-windows-macos-et-lipad.html</link>
      <pubDate>Tue, 25 Nov 2025 13:39:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311071</guid>
      <description>En coulisses, Google continue de travailler sur le rapprochement de ChromeOS et d'Android, un projet cens&#233; concurrencer les deux cadors du secteur &#8212;&#160;Windows et macOS&#160;&#8212; ainsi que l'iPad plus efficacement qu'avec la version actuelle de ChromeOS. Les pi&#232;ces du puzzle commencent &#224; se mettre en place.</description>
    </item>
    <item>
      <title>I&#8217;ve tested 30 Bluetooth speakers this year, here are the only 5 Black Friday deals I&#8217;d buy</title>
      <link>https://www.techradar.com/audio/wireless-bluetooth-speakers/ive-tested-30-bluetooth-speakers-this-year-here-are-the-only-5-black-friday-deals-id-buy</link>
      <pubDate>Tue, 25 Nov 2025 13:38:48 +0000</pubDate>
      <guid isPermaLink="false">BDr2gbjyWMqhuJTpFDYwW7</guid>
      <description>After testing more than 30 Bluetooth speakers this year, these are the 5 models I&#8217;d buy in the Black Friday sales.</description>
    </item>
    <item>
      <title>Mise &#224; jour Waze : la limitation la plus aga&#231;ante d&#8217;Android Auto dispara&#238;t</title>
      <link>https://www.frandroid.com/survoltes/2884959_mise-a-jour-waze-la-limitation-la-plus-agacante-dandroid-auto-disparait</link>
      <pubDate>Tue, 25 Nov 2025 13:37:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2884959_mise-a-jour-waze-la-limitation-la-plus-agacante-dandroid-auto-disparait</guid>
      <description>
Google Maps le fait depuis 2023. Il aura fallu attendre fin 2025 pour que Waze se d&#233;cide enfin. L'application GPS communautaire fait sauter son verrouillage d'&#233;cran lorsque vous &#234;tes connect&#233; &#224; Android Auto. Une mise &#224; jour silencieuse, mais qui change tout au quotidien.
</description>
    </item>
    <item>
      <title>Boulanger fait sa grande braderie pendant la Black Friday Week : les 16 offres qui m&#233;ritent votre argent</title>
      <link>https://www.frandroid.com/bons-plans/2859523_boulanger-fait-son-destockage-durant-la-black-friday-week-les-17-deals-immanquables-du-week-end</link>
      <pubDate>Tue, 25 Nov 2025 13:35:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2859523_boulanger-fait-son-destockage-durant-la-black-friday-week-les-17-deals-immanquables-du-week-end</guid>
      <description>
Avec la Black Friday Week, une nouvelle vague de promotions a d&#233;ferl&#233; chez les grands sites de e-commerce. Pour l'occasion, Boulanger n&#8217;h&#233;site pas &#224; baisser les prix de nombreuses r&#233;f&#233;rences Tech. Voici les offres qui valent le coup. 
</description>
    </item>
    <item>
      <title>Du jamais vu dans l&#8217;histoire de l&#8217;humanit&#233; : une sonde va &#224; entrer dans un territoire que seule notre imagination visitait</title>
      <link>https://www.futura-sciences.com/sciences/actualites/voyager-1-jamais-vu-histoire-humanite-sonde-va-entrer-territoire-seule-notre-imagination-visitait-127916/#xtor%3DRSS-8</link>
      <pubDate>Tue, 25 Nov 2025 14:35:40 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/voyager-1-jamais-vu-histoire-humanite-sonde-va-entrer-territoire-seule-notre-imagination-visitait-127916/#xtor%3DRSS-8</guid>
      <description>Le rendez-vous est fix&#233; en novembre 2026. Voyager 1 aura alors mis presque 50&#160;ans &#224; accomplir ce que la lumi&#232;re peut faire en seulement un jour !&#160;La mission ira-t-elle au-del&#224; ?</description>
    </item>
    <item>
      <title>The Best Samsung Phones of 2025, Tested and Reviewed</title>
      <link>https://www.wired.com/gallery/best-samsung-phones/</link>
      <pubDate>Tue, 25 Nov 2025 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">64dbd481eb3f06fa8140d241</guid>
      <description>From flagship and budget to flipping and folding, Samsung&#8217;s Galaxy range spans the breadth of the smartphone cosmos. WIRED&#8217;s here to help you make your choice.</description>
    </item>
    <item>
      <title>You can save up to 44% on the Echo Spot in Amazon's Black Friday sale &#8211; get your new smart alarm clock while you can</title>
      <link>https://www.techradar.com/seasonal-sales/you-can-save-up-to-44-percent-on-the-echo-spot-in-amazons-black-friday-sale-get-your-new-smart-alarm-clock-while-you-can</link>
      <pubDate>Tue, 25 Nov 2025 13:29:09 +0000</pubDate>
      <guid isPermaLink="false">BZZEyWWkBdnZQhQqzrRuY6</guid>
      <description>Amazon's flagship smart alarm is almost half off this Black Friday, and it's become a fan-favorite.</description>
    </item>
    <item>
      <title>Leaker claims Xbox Series X and Series S consoles could see another price hike due to global RAM shortage</title>
      <link>https://www.techradar.com/gaming/xbox/leaker-claims-xbox-series-x-and-series-s-consoles-could-see-another-price-hike-due-to-global-ram-shortage</link>
      <pubDate>Tue, 25 Nov 2025 13:27:51 +0000</pubDate>
      <guid isPermaLink="false">nfzMawbcimn6qfEaJvC9u5</guid>
      <description>Microsoft will reportedly have to increase the price of Xbox consoles yet again "very soon" due to a potential global RAM shortage.</description>
    </item>
    <item>
      <title>Skyscanner Rolls Out a Triple Wave of Travel Deals for Black Friday, Cyber Monday, and Travel Tuesday</title>
      <link>https://gizmodo.com/skyscanner-rolls-out-a-triple-wave-of-travel-deals-for-black-friday-cyber-monday-and-travel-tuesday-2000690001</link>
      <pubDate>Tue, 25 Nov 2025 13:23:38 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000690001</guid>
      <description>Visiting all your favorite destinations this holiday season doesn't have to put a dent in your wallet.</description>
    </item>
    <item>
      <title>Aluminium OS will be Google&#8217;s take on Android for PC</title>
      <link>https://www.theverge.com/news/828595/google-aluminium-os-android-pc-chromeos-ai</link>
      <pubDate>2025-11-25T08:23:20-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=828595</guid>
      <description>We know a little more about Google&#8217;s long-gestating plans to combine the best parts of Android and ChromeOS into a single OS thanks to a job listing for a product manager to work on &#8220;Aluminium OS.&#8221; The job ad describes it as &#8220;a new operating system built with Artificial Intelligence (AI) at the core.&#8221; Android [&#8230;]</description>
    </item>
    <item>
      <title>Chrome sur Android change pour vous aider &#224; retrouver vos sites pr&#233;f&#233;r&#233;s</title>
      <link>https://www.frandroid.com/marques/google/2884503_chrome-sur-android-change-pour-vous-aider-a-retrouver-vos-sites-preferes</link>
      <pubDate>Tue, 25 Nov 2025 13:21:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2884503_chrome-sur-android-change-pour-vous-aider-a-retrouver-vos-sites-preferes</guid>
      <description>
Google va d&#233;ployer sur la version Android de Chrome&#160;une fonction tr&#232;s appr&#233;ci&#233;e sur PC. Le navigateur de Google va permettre &#224; ses utilisateurs de ne jamais perdre de vue leurs sites pr&#233;f&#233;r&#233;s. 
</description>
    </item>
    <item>
      <title>Google stock price is surging today as AI sets it up to become next $4 trillion giant. Here&#8217;s why</title>
      <link>https://www.fastcompany.com/91448795/google-stock-price-today-goog-surges-on-ai-wins-4-trillion-near</link>
      <pubDate>2025-11-25T13:05:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448795/google-stock-price-today-goog-surges-on-ai-wins-4-trillion-near</guid>
      <description>Boosted by rave reviews of Gemini 3 and a rumored chip deal with Meta, Alphabet is performing better than any tech giant in the Magnificent 7.
Shares in Alphabet Inc (Nasdaq: GOOG), the company better known as Google, are rising again in premarket trading today. </description>
    </item>
    <item>
      <title>Get $500 off a stunning HP Omen gaming laptop in Best Buy's Black Friday gaming sale</title>
      <link>https://www.techradar.com/computing/gaming-laptops/get-usd500-off-a-stunning-hp-omen-gaming-laptop-in-best-buys-black-friday-gaming-sale</link>
      <pubDate>Tue, 25 Nov 2025 13:02:49 +0000</pubDate>
      <guid isPermaLink="false">yh8JFFCZizdvR4XEkrh56W</guid>
      <description>Best Buy's huge Black Friday sale includes massive discounts of up to $500 on HP gaming laptops and great discounts on HyperX peripherals &#8211; everything a budding gamer needs this November.</description>
    </item>
    <item>
      <title>Watch out - that Amazon page offering amazing Black Friday deals could be a dodgy spoof site, and could leave you seriously out of pocket</title>
      <link>https://www.techradar.com/pro/watch-out-that-amazon-page-offering-amazing-black-friday-deals-could-be-a-dodgy-spoof-site-and-could-leave-you-seriously-out-of-pocket</link>
      <pubDate>Tue, 25 Nov 2025 13:02:00 +0000</pubDate>
      <guid isPermaLink="false">WGLpHBinS7N9NhFnxsVgQX</guid>
      <description>Black Friday phishing attacks rise sharply, targeting unprepared shoppers with fake retailer sites, malicious emails, and rapidly scaled AI-driven scams.</description>
    </item>
    <item>
      <title>Volvo prend une d&#233;cision radicale pour ses voitures &#233;lectriques et la conduite autonome</title>
      <link>https://www.frandroid.com/marques/volvo/2884629_volvo-prend-une-decision-radicale-pour-ses-voitures-electriques-et-la-conduite-autonome</link>
      <pubDate>Tue, 25 Nov 2025 13:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volvo/2884629_volvo-prend-une-decision-radicale-pour-ses-voitures-electriques-et-la-conduite-autonome</guid>
      <description>
La firme su&#233;doise Volvo annonce rompre son contrat avec Luminar, charg&#233; de fournir le capteur LiDAR de ses voitures &#233;lectriques. Une d&#233;cision forte, qui risque de faire du mal &#224; l&#8217;&#233;quipementier, d&#233;j&#224; en mauvaise posture.
</description>
    </item>
    <item>
      <title>9 Best Speakers for Kids (2025): Smart, Bluetooth, and Offline Speakers</title>
      <link>https://www.wired.com/gallery/best-kids-speakers/</link>
      <pubDate>Tue, 25 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">61b89f715d74af6a6a505e1b</guid>
      <description>Play music, audiobooks, and more for your children with one of these WIRED-tested gadgets.</description>
    </item>
    <item>
      <title>Car influencers love Chinese EVs &#8212; and China loves them back</title>
      <link>https://www.theverge.com/transportation/828155/car-influencer-china-ev-youtube-influencer-pay-play</link>
      <pubDate>2025-11-25T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=828155</guid>
      <description>The first Chinese-made car Omar Rana ever drove was a gas-powered SUV that he rented while on a trip overseas in 2015. To say it didn't leave much of an impression would be an understatement. "It sucked really bad," Rana, aka OmarDrives, tells me. "A horrible experience." Flash forward nearly a decade to last year, [&#8230;]</description>
    </item>
    <item>
      <title>Dreame's stair-climbing, pet hair-sucking and floor-mopping robot vacuum just saw a major Black Friday discount</title>
      <link>https://www.techradar.com/seasonal-sales/dreames-stair-climbing-pet-hair-sucking-and-floor-mopping-robot-vacuum-just-saw-a-major-black-friday-discount</link>
      <pubDate>Tue, 25 Nov 2025 12:58:20 +0000</pubDate>
      <guid isPermaLink="false">Mp5gtUACoxn8F4AGVPaGZ</guid>
      <description>This stair-climbing, mopping and pet hair-busting robot vacuum should go straight in your shopping basket.</description>
    </item>
    <item>
      <title>16+ unmissable Black Friday floorcare deals from Shark, Tineco, and more</title>
      <link>https://www.techradar.com/home/small-appliances/black-friday-floorcare-deals-2025-from-shark-tineco-and-more</link>
      <pubDate>Tue, 25 Nov 2025 12:57:55 +0000</pubDate>
      <guid isPermaLink="false">FDcDGsNyvPrgD4aQDCatgg</guid>
      <description>Clean up in the Black Friday sales with up to 50% off wet-dry vacuums, spot cleaners, and steam mops from leading brands.</description>
    </item>
    <item>
      <title>I've tested more than a hundred laptops and this is the Black Friday deal I'd recommend: a huge $420 discount on the HP Omnibook X Flip</title>
      <link>https://www.techradar.com/computing/laptops/ive-tested-more-than-a-hundred-laptops-and-this-is-the-black-friday-deal-id-recommend-a-huge-usd420-discount-on-the-hp-omnibook-x-flip</link>
      <pubDate>Tue, 25 Nov 2025 12:54:51 +0000</pubDate>
      <guid isPermaLink="false">w8mpJY8yojvqa7ZWhQNZ79</guid>
      <description>Save almost half off the HP Omnibook X Flip &#8211; this is a Black Friday laptop deal you won't want to miss.</description>
    </item>
    <item>
      <title>The YouTube Music Recap for 2025 is rolling out now with new AI tricks &#8211; here's how to get it</title>
      <link>https://www.techradar.com/audio/audio-streaming/the-youtube-music-recap-for-2025-is-rolling-out-now-with-new-ai-tricks-heres-how-to-get-it</link>
      <pubDate>Tue, 25 Nov 2025 12:54:34 +0000</pubDate>
      <guid isPermaLink="false">J5yJrCGdDwCL7rL6eQXnUi</guid>
      <description>If you're a YouTube Music user, you can now look up your most listened to tracks and artists.</description>
    </item>
    <item>
      <title>La Black Friday Week des smartphones premium : de beaux prix cass&#233;s sur les t&#233;l&#233;phones d&#8217;Apple, Samsung, Google, Nothing&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2848295_black-friday-week-sur-les-smartphones-voici-les-meilleures-promotions-pour-les-iphone-17-google-pixel-10-et-galaxy-s25</link>
      <pubDate>Tue, 25 Nov 2025 12:50:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848295_black-friday-week-sur-les-smartphones-voici-les-meilleures-promotions-pour-les-iphone-17-google-pixel-10-et-galaxy-s25</guid>
      <description>
La Black Friday Week bat son plein ! Les &#233;tals des e-commer&#231;ants ne d&#233;semplissent pas de r&#233;ductions en tout genre. Nous avons rassembl&#233; ici les meilleures offres disponibles pour les smartphones haut de gamme test&#233;s par Frandroid.
</description>
    </item>
    <item>
      <title>The best gaming PC in 2025: my top picks for all budgets and games</title>
      <link>https://www.techradar.com/computing/gaming-pcs/best-gaming-pc</link>
      <pubDate>Tue, 25 Nov 2025 12:46:58 +0000</pubDate>
      <guid isPermaLink="false">GJXeijTHxFB7rkVFcVrkqf</guid>
      <description>Looking to upgrade? I've carefully selected the best gaming PCs in 2025 based on budget, performance,  design, and configurability.</description>
    </item>
    <item>
      <title>My favorite Asus gaming laptop is almost up to 30% off in Black Friday deals &#8211; just in time to beat the RAM price crisis</title>
      <link>https://www.techradar.com/seasonal-sales/my-favorite-asus-gaming-laptop-is-almost-up-to-30-percent-off-in-black-friday-deals-just-in-time-to-beat-the-ram-price-crisis</link>
      <pubDate>Tue, 25 Nov 2025 12:44:41 +0000</pubDate>
      <guid isPermaLink="false">3D6r7cuRAZSS5YeCgaXJFJ</guid>
      <description>At nearly 30% off in Black Friday deal, you'd do yourself a disservice not buying this Asus ROG gaming laptop, so don't miss it!</description>
    </item>
    <item>
      <title>GrapheneOS quitte la France&#160;: pourquoi l&#8217;Android &#171;&#160;anti-mouchards&#160;&#187; claque la porte</title>
      <link>https://www.01net.com/actualites/grapheneos-quitte-la-france-pourquoi-landroid-anti-mouchards-claque-la-porte.html</link>
      <pubDate>Tue, 25 Nov 2025 12:41:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310996</guid>
      <description>C'est la rupture. Fin 2025, ce qui n'&#233;tait qu'une niche pour passionn&#233;s de cybers&#233;curit&#233; s'est transform&#233; en affaire d'&#201;tat. Accus&#233; de faciliter le crime organis&#233; par les autorit&#233;s fran&#231;aises, le projet GrapheneOS riposte en retirant ses infrastructures du territoire. Plong&#233;e au c&#339;ur d'une pol&#233;mique o&#249; fantasmes techniques et volont&#233; de surveillance s'affrontent violemment....</description>
    </item>
    <item>
      <title>The best phone deal of Black Friday is still going strong: save $700 on Samsung's Galaxy Z Fold 7</title>
      <link>https://www.techradar.com/seasonal-sales/the-best-phone-deal-of-black-friday-is-still-going-strong-save-usd700-on-samsungs-galaxy-z-fold-7</link>
      <pubDate>Tue, 25 Nov 2025 12:39:34 +0000</pubDate>
      <guid isPermaLink="false">6iYSBRUV8u6gbHsF2aHkMN</guid>
      <description>Samsung has won Black Friday with this deal, and there's still plenty of time to grab it.</description>
    </item>
    <item>
      <title>Ce laptop Dell 2-en-1 avec &#233;cran 2K + Ultra 5 profite d&#8217;une belle ristourne lors de la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2884535_ce-laptop-dell-2-en-1-avec-ecran-2k-ultra-5-profite-dune-belle-ristourne-lors-de-la-black-friday-week</link>
      <pubDate>Tue, 25 Nov 2025 12:39:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2884535_ce-laptop-dell-2-en-1-avec-ecran-2k-ultra-5-profite-dune-belle-ristourne-lors-de-la-black-friday-week</guid>
      <description>
Si vous &#234;tes en qu&#234;te d'une machine qui brille de par sa polyvalence, nous avons la solution avec ce Dell 14 Plus 2-en-1. Son constructeur lui offre en plus une remise int&#233;ressante puisqu'il passe de 849 euros &#224; 599 euros.
</description>
    </item>
    <item>
      <title>This Best Buy discount might be the best Black Friday gaming laptop deal so far &#8211; save $500 on the Asus TUF A16 with RTX 5070</title>
      <link>https://www.techradar.com/computing/chromebooks/this-best-buy-discount-might-be-the-best-black-friday-gaming-laptop-deal-so-far-save-usd500-on-the-asus-tuf-a16-with-rtx-5070</link>
      <pubDate>Tue, 25 Nov 2025 12:35:34 +0000</pubDate>
      <guid isPermaLink="false">thZQA455xcPUqwxoVV78uQ</guid>
      <description>Save $500 on an RTX 5070 laptop with this early Black Friday deal at Best Buy - one of the best gaming laptop discounts I've seen all year.</description>
    </item>
    <item>
      <title>iOS 26 lets you banish a major annoyance in the Wallet app &#8211; here&#8217;s how to do it</title>
      <link>https://www.techradar.com/phones/ios/ios-26-lets-you-banish-a-major-annoyance-in-the-wallet-app-heres-how-to-do-it</link>
      <pubDate>Tue, 25 Nov 2025 12:26:44 +0000</pubDate>
      <guid isPermaLink="false">gqdvuvekReWjncXBptKMuC</guid>
      <description>Sick of receiving ad-related notifications from Apple&#8217;s Wallet app? There&#8217;s a quick way to disable them in iOS 26.</description>
    </item>
    <item>
      <title>Huawei Mate 80 Pro Max has the world&#8217;s brightest phone screen</title>
      <link>https://www.theverge.com/news/828543/huawei-mate-80-pro-max-dual-layer-oled-display-8000-nits</link>
      <pubDate>2025-11-25T07:21:49-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=828543</guid>
      <description>Huawei has just launched its Mate 80 series in China, and the top-spec 80 Pro Max stands out for a dual-layer OLED display that Huawei says can hit an unmatched 8,000 nits of peak brightness. The Mate 80 phones are joined by a new Mate X7 foldable with IP59 dustproofing. There are four Mate 80 [&#8230;]</description>
    </item>
    <item>
      <title>This Linux OS has got a million downloads since Windows 10 support ended &#8211; should Microsoft start worrying now?</title>
      <link>https://www.techradar.com/computing/windows/this-linux-os-has-got-a-million-downloads-since-windows-10-support-ended-should-microsoft-start-worrying-now</link>
      <pubDate>Tue, 25 Nov 2025 12:16:27 +0000</pubDate>
      <guid isPermaLink="false">Xh9S2xhhxB32yvZt5gDFoc</guid>
      <description>Can't &#8211; or won't &#8211; upgrade to Windows 11? You're not alone, and one Linux distro is attracting a lot of attention since Windows 10 support ended.</description>
    </item>
    <item>
      <title>I'm a serial iPhone case-buyer, and these are the best iPhone 17 cases I've tested</title>
      <link>https://www.techradar.com/phones/iphone/best-iphone-17-cases</link>
      <pubDate>Tue, 25 Nov 2025 12:12:55 +0000</pubDate>
      <guid isPermaLink="false">Xf5pbnfqAXBuD442Z8dCjE</guid>
      <description>Our pick of the best cases for your iPhone 17, iPhone Air, iPhone 17 Pro and iPhone 17 Pro Max, based on style, resilience and versatility.</description>
    </item>
    <item>
      <title>Cette RTX 5090 est la plus ch&#232;re du monde et elle est d&#233;j&#224; en rupture de stock</title>
      <link>https://www.frandroid.com/marques/nvidia/2884563_le-prix-de-cette-rtx-5090-est-hallucinant-mais-elle-est-deja-introuvable</link>
      <pubDate>Tue, 25 Nov 2025 12:10:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2884563_le-prix-de-cette-rtx-5090-est-hallucinant-mais-elle-est-deja-introuvable</guid>
      <description>
Une carte graphique &#224; plus de 4000 euros, &#231;a vous dit ? L'&#233;dition limit&#233;e de RTX 5090 par Asus est d&#233;j&#224; en rupture de stock malgr&#233; son prix hors du commun.
</description>
    </item>
    <item>
      <title>Brace yourself, Spotify fans &#8211;another price hike is predicted to hit the US in early 2026</title>
      <link>https://www.techradar.com/audio/audio-streaming/brace-yourself-spotify-fans-another-price-hike-is-predicted-to-hit-the-us-in-early-2026</link>
      <pubDate>Tue, 25 Nov 2025 12:07:44 +0000</pubDate>
      <guid isPermaLink="false">3DspnujU8mrKo6BD6fqnzb</guid>
      <description>It looks like Spotify is going to bump up prices for its US subscribers again, but we don't know by how much.</description>
    </item>
    <item>
      <title>The Fate of Earth Rests in Your Hands With Leeloo&#8217;s &#8216;Fifth Element&#8217; Multi Pass</title>
      <link>https://gizmodo.com/the-fate-of-earth-rests-in-your-hands-with-leeloos-fifth-element-multi-pass-2000691037</link>
      <pubDate>Tue, 25 Nov 2025 12:05:47 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000691037</guid>
      <description>The key prop carried by Milla Jovovich's character in the 1997 sci-fi adventure is going up for auction.</description>
    </item>
    <item>
      <title>The PS5 Pulse Elite headset and Pulse Explore earbuds are perfect for PS Portal players, and they're cheaper than ever for Black Friday</title>
      <link>https://www.techradar.com/gaming/the-ps5-pulse-elite-headset-and-pulse-explore-earbuds-are-perfect-for-ps-portal-players-and-theyre-cheaper-than-ever-for-black-friday</link>
      <pubDate>Tue, 25 Nov 2025 12:05:01 +0000</pubDate>
      <guid isPermaLink="false">2dM44s7989uDgQcK5zyczf</guid>
      <description>Upgrade your PS5 gaming with the PS Pulse Elite and PS Pulse Explore audio accessories. Perfect for PS Portal users with PS Link functionality.</description>
    </item>
    <item>
      <title>Vague d&#8217;attaques contre Windows&#160;: les pirates ont 2 nouvelles tactiques pour propager des virus</title>
      <link>https://www.01net.com/actualites/vague-attaques-contre-windows-pirates-2-nouvelles-tactiques-propager-virusvague-attaques-contre-windows.html</link>
      <pubDate>Tue, 25 Nov 2025 12:01:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311039</guid>
      <description>Une nouvelle vague de cyberattaques cible les utilisateurs de Windows. Pour diffuser des virus voleurs de donn&#233;es, les pirates s'appuient sur deux variantes in&#233;dites de l'offensive ClickFix.</description>
    </item>
    <item>
      <title>Gizmodo Senior Writer James Pero&#8217;s 8 Favorite Tech Gifts of 2025</title>
      <link>https://gizmodo.com/gizmodo-senior-writer-james-pero-favorite-tech-gifts-of-2025-2000689585</link>
      <pubDate>Tue, 25 Nov 2025 12:00:23 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000689585</guid>
      <description>Okay, one of these isn't a gadget or tech-related, but you're going to have to read to find out what it is.</description>
    </item>
    <item>
      <title>He Hunted Alleged Groomers on Roblox. Then the Company Banned Him</title>
      <link>https://www.wired.com/story/he-hunted-alleged-groomers-on-roblox-then-the-company-banned-him/</link>
      <pubDate>Tue, 25 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">68a3955c8788e9a1080aeddb</guid>
      <description>YouTuber &#8220;Schlep" built a huge following tracking down alleged child predators on Roblox before being kicked off. The platform is facing multiple lawsuits over child safety.</description>
    </item>
    <item>
      <title>LG UltraFine Evo 6K 32-inch Monitor Review: More Pixels, Please</title>
      <link>https://www.wired.com/review/lg-ultrafine-evo-6k-32-inch-monitor/</link>
      <pubDate>Tue, 25 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">6914f433152c1ddcd9411d80</guid>
      <description>One of the sharpest monitors ever made, the LG UltraFine Evo 6K monitor has more than just extra pixels to offer.</description>
    </item>
    <item>
      <title>You won&#8217;t want to hide Ikea&#8217;s colorful new Bluetooth speakers</title>
      <link>https://www.theverge.com/news/827516/ikea-bluetooth-speaker-solskydd-kulglass-lamp-spotify-tap</link>
      <pubDate>2025-11-25T07:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=827516</guid>
      <description>Ikea is launching two new Bluetooth speakers next month as part of a larger collection announced earlier this year, following the end of the company&#8217;s partnership with Sonos. Like the Blomprakt speaker lamp that launched in the US last month, both the new Solskydd and Kulglass speakers blend technology and design so they&#8217;ll function as [&#8230;]</description>
    </item>
    <item>
      <title>Large language mistake</title>
      <link>https://www.theverge.com/ai-artificial-intelligence/827820/large-language-models-ai-intelligence-neuroscience-problems</link>
      <pubDate>2025-11-25T07:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=827820</guid>
      <description>"Developing superintelligence is now in sight," says Mark Zuckerberg, heralding the "creation and discovery of new things that aren't imaginable today." Powerful AI "may come as soon as 2026 [and will be] smarter than a Nobel Prize winner across most relevant fields," says Dario Amodei, offering the doubling of human lifespans or even "escape velocity" [&#8230;]...</description>
    </item>
    <item>
      <title>IKEA reveals 6 colorful new Bluetooth speakers and lamps to brighten up your mood and home</title>
      <link>https://www.techradar.com/home/smart-home/ikea-reveals-6-colorful-new-bluetooth-speakers-and-lamps-to-brighten-up-your-mood-and-home</link>
      <pubDate>Tue, 25 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">L9ZZuxJaqSsyjPqziPvz33</guid>
      <description>IKEA has announced more products made in partnership with designer Teklan, going on sale next month.</description>
    </item>
    <item>
      <title>Intergalactic: The Heretic Prophet is reportedly still years away from release, will be a no-show at The Game Awards and won't launch in 2026</title>
      <link>https://www.techradar.com/gaming/intergalactic-the-heretic-prophet-is-reportedly-still-years-away-from-release-will-be-a-no-show-at-the-game-awards-and-wont-launch-in-2026</link>
      <pubDate>Tue, 25 Nov 2025 11:58:58 +0000</pubDate>
      <guid isPermaLink="false">jNSeMP99ahSUSN32N3qD4T</guid>
      <description>Sources claim Naughty Dog's next game, Intergalactic: The Heretic Prophet, won't be released in 2026 and is still years away.</description>
    </item>
    <item>
      <title>The best Black Friday coffee maker deals: up to 60% off Breville, De'Longhi and Keurig, plus free coffee</title>
      <link>https://www.techradar.com/home/coffee-machines/black-friday-2025-best-coffee-maker-deals</link>
      <pubDate>Tue, 25 Nov 2025 11:52:30 +0000</pubDate>
      <guid isPermaLink="false">vFwxPgG6FX4zjKcAu2pkig</guid>
      <description>Huge discounts on coffee makers from big brands, and free coffee with selected models.</description>
    </item>
  </channel>
</rss>
