<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 22 Jan 2026 08:38:58 GMT</lastBuildDate>
    <item>
      <title>Rachat SFR&#160;: les discussions ont repris entre Bouygues, Iliad, Orange et Altice</title>
      <link>https://www.01net.com/actualites/rachat-sfr-les-discussions-ont-repris-entre-bouygues-iliad-orange-et-altice.html</link>
      <pubDate>Thu, 22 Jan 2026 08:36:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321769</guid>
      <description>Du nouveau dans le dossier du rachat de SFR ? Bouygues Telecom, Orange et Free (groupe Iliad) annoncent ce jeudi 22 janvier avoir repris les n&#233;gociations avec Altice.</description>
    </item>
    <item>
      <title>ElevenLabs r&#233;unit Liza Minelli et Art Garfunkel pour un album &#171;&#160;co-cr&#233;&#233;&#160;&#187; avec l&#8217;IA</title>
      <link>https://www.01net.com/actualites/elevenlabs-reunit-liza-minelli-et-art-garfunkel-pour-un-album-co-cree-avec-lia.html</link>
      <pubDate>Thu, 22 Jan 2026 08:31:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321710</guid>
      <description>Si l'IA g&#233;n&#233;rative suscite le rejet chez de nombreux artistes, d'autres en revanche ont choisi d'embrasser la technologie. Les v&#233;t&#233;rans Liza Minelli et Art Garfunkel, ainsi que des noms en devenir ont particip&#233; &#224; l'&#233;laboration d'un album produit par ElevenLabs, un acteur majeur du clonage vocal par IA.</description>
    </item>
    <item>
      <title>9 capteurs et 100 millisecondes pour se d&#233;clencher : cet airbag v&#233;lo veut r&#233;volutionner la s&#233;curit&#233; des cyclistes pro</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2951475_9-capteurs-et-100-millisecondes-pour-se-declencher-cet-airbag-velo-veut-revolutionner-la-securite-des-cyclistes-pro</link>
      <pubDate>Thu, 22 Jan 2026 08:26:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2951475_9-capteurs-et-100-millisecondes-pour-se-declencher-cet-airbag-velo-veut-revolutionner-la-securite-des-cyclistes-pro</guid>
      <description>
Un airbag sp&#233;cifiquement con&#231;u pour les cyclistes professionnels fait son apparition dans une &#233;quipe du WorldTour. Baptis&#233; Aerobag, ce dispositif est utilis&#233; &#224; l&#8217;entra&#238;nement cette saison par l&#8217;&#233;quipe Picnic PostNL.
</description>
    </item>
    <item>
      <title>The best live TV streaming services to cut cable in 2026</title>
      <link>https://www.engadget.com/entertainment/streaming/best-live-tv-streaming-service-133000410.html?src=rss</link>
      <pubDate>Thu, 22 Jan 2026 08:00:37 +0000</pubDate>
      <guid isPermaLink="false">50eb34db-c0fc-4bfb-ab41-1cbe97faffd8</guid>
      <description>Sports fans who want to catch every last game and news junkies who want to watch network news as it unfolds have two main options: cable or a live TV streaming service. Cable or satellite service often requires extra equipment and convoluted contracts. Live TV streaming services only require an internet connection and a smart TV. These plans used to be cheaper and more user-friendly, too, but price hikes, media consolidation and contract disputes are starting to change the value a bit. We tested out all the major players to compare what you get and help you make sense of the options out there....</description>
    </item>
    <item>
      <title>Quels sont les meilleurs appareils photos num&#233;riques hybrides en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-photo-et-video/1338125_selection-des-meilleurs-appareils-photos-hybrides</link>
      <pubDate>Thu, 22 Jan 2026 08:00:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-photo-et-video/1338125_selection-des-meilleurs-appareils-photos-hybrides</guid>
      <description>
Les appareils photo dits &#171; hybrides &#187; ont supplant&#233; les reflex sur le march&#233; des bo&#238;tiers photo. Ils n&#233;cessitent un investissement financier important : autant bien choisir celui qui sera adapt&#233; &#224; vos besoins et ambitions. Nous avons test&#233;, s&#233;lectionn&#233; et rassembl&#233; pour vous les mod&#232;les les plus int&#233;ressants en 2026.
</description>
    </item>
    <item>
      <title>Le NexPhone est un smartphone capable de faire tourner Android, Linux et Windows 11</title>
      <link>https://www.01net.com/actualites/le-nexphone-est-un-smartphone-capable-de-faire-tourner-android-linux-et-windows-11.html</link>
      <pubDate>Thu, 22 Jan 2026 08:00:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321682</guid>
      <description>Android, Linux, Windows : pourquoi choisir ? Le NexPhone se rit des fronti&#232;res puisqu'il est capable de faire tourner les plateformes les plus populaires, &#224; l'exception d'iOS.</description>
    </item>
    <item>
      <title>Logitech&#8217;s new AI-powered webcam will let you really take center stage at your meetings</title>
      <link>https://www.techradar.com/pro/logitechs-new-ai-powered-webcam-will-let-you-really-take-center-stage-at-your-meetings</link>
      <pubDate>Thu, 22 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">dHVGVb4TKRP8kaBGz82S6N</guid>
      <description>AI-powered features give Logitech's new Rally AI Cameras a smarter way to present.</description>
    </item>
    <item>
      <title>Xiaomi renouvelle tout : 4 nouvelles trottinettes d&#233;voil&#233;es, les roues de 12 pouces se g&#233;n&#233;ralisent petit &#224; petit</title>
      <link>https://www.frandroid.com/marques/xiaomi/2951407_xiaomi-renouvelle-tout-4-nouvelles-trottinettes-devoilees-les-roues-de-12-pouces-se-generalisent-petit-a-petit</link>
      <pubDate>Thu, 22 Jan 2026 07:46:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2951407_xiaomi-renouvelle-tout-4-nouvelles-trottinettes-devoilees-les-roues-de-12-pouces-se-generalisent-petit-a-petit</guid>
      <description>
Quatre nouvelles trottinettes &#233;lectriques rejoignent l'offre de Xiaomi, avec une tendance forte qui se d&#233;gage : la g&#233;n&#233;ralisation progressive des roues de 12 pouces. 
</description>
    </item>
    <item>
      <title>Une selle v&#233;lo avec une poign&#233;e : la belle id&#233;e de ce VTC &#233;lectrique boost&#233; par Bosch et tout &#233;quip&#233;</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2950587_une-selle-velo-avec-une-poignee-la-belle-idee-de-ce-vtc-electrique-booste-par-bosch-et-tout-equipe</link>
      <pubDate>Thu, 22 Jan 2026 07:44:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2950587_une-selle-velo-avec-une-poignee-la-belle-idee-de-ce-vtc-electrique-booste-par-bosch-et-tout-equipe</guid>
      <description>
De retour avec le syst&#232;me Bosch Performance Line CX culminant &#224; 100 Nm de couple, le v&#233;lo &#233;lectrique BH Atom NX SUV s'offre une double suspension en cadre haut et ouvert, pour s&#8217;adonner &#224; toutes les pratiques.
</description>
    </item>
    <item>
      <title>Pendant les soldes d&#8217;hiver, la tondeuse Ecovacs Goat O800 RTK pr&#233;pare l&#8217;&#233;t&#233; et coupe 300 euros de son prix chez CDiscount</title>
      <link>https://www.frandroid.com/bons-plans/2950649_pendant-les-soldes-dhiver-la-tondeuse-ecovacs-goat-o800-rtk-prepare-lete-et-coupe-300-euros-de-son-prix-chez-cdiscount</link>
      <pubDate>Thu, 22 Jan 2026 07:34:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2950649_pendant-les-soldes-dhiver-la-tondeuse-ecovacs-goat-o800-rtk-prepare-lete-et-coupe-300-euros-de-son-prix-chez-cdiscount</guid>
      <description>
Avec l'Ecovacs Goat O800 RTK, votre jardin va se refaire une beaut&#233;. Entre son syst&#232;me qui lui permet de d&#233;tecter 200 obstacles et une cartographie accessible depuis votre smartphone, aucune zone ne sera &#233;pargn&#233;e. Ce qui n'est pas &#233;pargn&#233; non plus, c'est son prix qui perd 300 euros et tombe &#224; 699 euros chez Cdiscount.
</description>
    </item>
    <item>
      <title>Broche connect&#233;e&#160;: Apple veut r&#233;ussir l&#224; o&#249; l&#8217;AI Pin a mis&#233;rablement &#233;chou&#233;</title>
      <link>https://www.frandroid.com/marques/apple/2951399_broche-connectee-apple-veut-reussir-la-ou-lai-pin-a-miserablement-echoue</link>
      <pubDate>Thu, 22 Jan 2026 07:33:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2951399_broche-connectee-apple-veut-reussir-la-ou-lai-pin-a-miserablement-echoue</guid>
      <description>
Et si Apple avait un produit surprenant dans les tuyaux ? D&#8217;apr&#232;s de r&#233;centes rumeurs, la firme &#224; la pomme serait en train de travailler sur une broche connect&#233;e capable de voir et d&#8217;entendre l&#8217;environnement qui vous entoure.
</description>
    </item>
    <item>
      <title>Bouygues Telecom lance une nouvelle box TV qui am&#233;liore l&#8217;image de votre t&#233;l&#233;</title>
      <link>https://www.01net.com/actualites/bouygues-telecom-lance-une-nouvelle-box-tv-qui-ameliore-limage-de-votre-tele.html</link>
      <pubDate>Thu, 22 Jan 2026 07:30:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321422</guid>
      <description>Un nouveau bo&#238;tier TV avec de l&#8217;IA vient enrichir le catalogue de Bouygues Telecom. Cette premi&#232;re apparition de l&#8217;IA dans une Box va t&#8217;elle changer la donne ?</description>
    </item>
    <item>
      <title>$100 Off Shark Promo Code | This January</title>
      <link>https://www.wired.com/story/shark-promo-code/</link>
      <pubDate>Thu, 22 Jan 2026 07:20:00 +0000</pubDate>
      <guid isPermaLink="false">67d319413364868e8cc487dc</guid>
      <description>Shark makes some seriously powerful vacuums, from handheld vacs to steam mops. Don&#8217;t miss $100 off, 10% off, and more limited-time coupons from WIRED.</description>
    </item>
    <item>
      <title>I tested the GTBox T1 - and while the designers did something different with this mini PC, I'm debating whether it was a good idea</title>
      <link>https://www.techradar.com/computing/gtbox-t1-mini-pc-review</link>
      <pubDate>Thu, 22 Jan 2026 07:15:00 +0000</pubDate>
      <guid isPermaLink="false">h7wpXXMqKeR5AtAT8TsTzm</guid>
      <description>A uniquely styled mini PC, the GTBox T1 has a powerful platform inside its speaker aesthetics.</description>
    </item>
    <item>
      <title>Hungryroot Coupon Codes: 30% Off This January</title>
      <link>https://www.wired.com/story/hungryroot-promo-code/</link>
      <pubDate>Thu, 22 Jan 2026 07:10:00 +0000</pubDate>
      <guid isPermaLink="false">689106ddb62bf4a139ca3cca</guid>
      <description>Get up to 30% off your first order and free gifts using a Hungryroot promo code today. Discover our best coupons and discounts to let you save on your healthy groceries as a new or returning customer.</description>
    </item>
    <item>
      <title>Google&#160;: c&#8217;est quoi ce nouveau bouton &#171;&#160;palette&#160;&#187; sur le moteur de recherche&#160;?</title>
      <link>https://www.01net.com/actualites/google-cest-quoi-nouveau-bouton-palette-moteur-recherche.html</link>
      <pubDate>Thu, 22 Jan 2026 07:05:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321729</guid>
      <description>La Recherche Google est peut-&#234;tre devenue un peu ennuyante, mais cette nouvelle fonctionnalit&#233; color&#233;e pourrait lui donner un peu de peps.</description>
    </item>
    <item>
      <title>Patch Tuesday Windows 11&#160;: Microsoft partage une solution pour d&#233;bloquer Outlook</title>
      <link>https://www.01net.com/actualites/patch-tuesday-windows-11-microsoft-partage-une-solution-pour-debloquer-outlook.html</link>
      <pubDate>Thu, 22 Jan 2026 07:01:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321731</guid>
      <description>La premi&#232;re mise &#224; jour de Windows 11 pour l&#8217;ann&#233;e 2026 a caus&#233; de nombreux probl&#232;mes aux utilisateurs. Parmi ceux-ci, un bug bloque l&#8217;ouverture du client de messagerie Outlook. En attendant un correctif, Microsoft a partag&#233; une solution de contournement.</description>
    </item>
    <item>
      <title>Une cyberattaque majeure pourrait r&#233;v&#233;ler des plans secrets d&#8217;Apple</title>
      <link>https://www.01net.com/actualites/une-cyberattaque-majeure-pourrait-reveler-des-plans-secrets-dapple.html</link>
      <pubDate>Thu, 22 Jan 2026 07:01:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321707</guid>
      <description>Luxshare est moins connu que Foxconn, mais l'entreprise chinoise n'en est pas moins un poids lourd industriel qui fabrique de nombreux produits pour le compte d'Apple, de Nvidia, LG ou encore de Tesla. Une cyberattaque men&#233;e par un groupe de pirates bien connu a vis&#233; le sous-traitant, et ils d&#233;tiendraient de nombreux documents couvrant des informations confidentielles et des projets secrets....</description>
    </item>
    <item>
      <title>Your smartphone is quietly sharing your data overnight, NordVPN warns &#8211; here's how to limit it</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/your-smartphone-is-quietly-sharing-your-data-overnight-nordvpn-warns-heres-how-to-limit-it</link>
      <pubDate>Thu, 22 Jan 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">ZUcNGP5xpSYjGrQ4BtB36o</guid>
      <description>Smartphones continue sharing data overnight, often without users realizing it. NordVPN experts explain what&#8217;s normal, what&#8217;s risky, and how to minimize background tracking.</description>
    </item>
    <item>
      <title>How to get satisfaction from an unfulfilling job</title>
      <link>https://www.fastcompany.com/91474325/how-to-get-satisfaction-from-an-unfulfilling-job</link>
      <pubDate>2026-01-22T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91474325/how-to-get-satisfaction-from-an-unfulfilling-job</guid>
      <description>In a tight labor market, finding a new job isn&#8217;t always easy. Here&#8217;s how to get the most from your current job.
If you&#8217;re in an unfulfilling job or are dissatisfied with your work, it&#8217;s possible to get a fresh start no matter what the season. In fact, there are a few strategies that can help you find meaning and enhance your experience even as you slog forward....</description>
    </item>
    <item>
      <title>Pneus gravel polyvalents, 32 pouces : le sp&#233;cialiste Schwalbe roule sur les tendances du v&#233;lo</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2950397_pneus-gravel-polyvalents-32-pouces-le-specialiste-schwalbe-roule-sur-les-tendances-du-velo</link>
      <pubDate>Thu, 22 Jan 2026 06:54:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2950397_pneus-gravel-polyvalents-32-pouces-le-specialiste-schwalbe-roule-sur-les-tendances-du-velo</guid>
      <description>
Outre un curieux prototype aux pneus 32 pouces qui fait d&#233;bat chez les VTTistes, Schwalbe a pr&#233;sent&#233; 5 nouveaux pneus v&#233;lo G-ONE pour l&#8217;aventure, lors des Velofollies. 
</description>
    </item>
    <item>
      <title>eBay Coupon Codes and Deals: Up to 60% Off Select Items</title>
      <link>https://www.wired.com/story/ebay-coupon-code/</link>
      <pubDate>Thu, 22 Jan 2026 06:50:00 +0000</pubDate>
      <guid isPermaLink="false">672d41fcd6406683ec9bfd2e</guid>
      <description>Save up to 60% on a selection of items at eBay, including electronics, home products, card games, and more.</description>
    </item>
    <item>
      <title>&#171;&#8201;Hors de question de laisser un patron en roue libre d&#233;molir nos conditions de travail&#8201;&#187;&#160;: la gr&#232;ve est d&#233;clar&#233;e chez Ubisoft</title>
      <link>https://www.frandroid.com/produits-android/console/2951363_hors-de-question-de-laisser-un-patron-en-roue-libre-demolir-nos-conditions-de-travail-la-greve-est-declaree-chez-ubisoft</link>
      <pubDate>Thu, 22 Jan 2026 06:40:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2951363_hors-de-question-de-laisser-un-patron-en-roue-libre-demolir-nos-conditions-de-travail-la-greve-est-declaree-chez-ubisoft</guid>
      <description>
Apr&#232;s des annonces de restructuration aux airs de grand plan de licenciement, les syndicats de chez Ubisoft appellent &#224; la gr&#232;ve pour pr&#233;server leurs conditions de travail.
</description>
    </item>
    <item>
      <title>20% Off LG Promo Code &amp; Coupons | January 2026</title>
      <link>https://www.wired.com/story/lg-promo-code/</link>
      <pubDate>Thu, 22 Jan 2026 06:40:00 +0000</pubDate>
      <guid isPermaLink="false">67d879bf81a4d165ab8f1213</guid>
      <description>Save 20% with an LG promo code today, plus up to $1,000 off appliances, 40% off bestselling TVs and monitors.</description>
    </item>
  </channel>
</rss>
