<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 14 Jan 2026 08:37:01 GMT</lastBuildDate>
    <item>
      <title>Plus de 100 failles Windows corrig&#233;es&#160;: Microsoft d&#233;ploie le premier Patch Tuesday de 2026, installez la mise &#224; jour</title>
      <link>https://www.01net.com/actualites/plus-100-failles-windows-corrigees-microsoft-deploie-premier-patch-tuesday-2026-installez-mise-jour.html</link>
      <pubDate>Wed, 14 Jan 2026 08:25:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319894</guid>
      <description>Microsoft ouvre l&#8217;ann&#233;e 2026 sur un Patch Tuesday massif. La mise &#224; jour corrige 114 failles de s&#233;curit&#233;, dont huit jug&#233;es critiques. On trouve surtout trois vuln&#233;rabilit&#233;s zero day, dont une faille dont l'exploitation est av&#233;r&#233;e.</description>
    </item>
    <item>
      <title>Elon Musk annonce la fin de l&#8217;option FSD, Tesla aura d&#233;sormais un mod&#232;le 100 % abonnement</title>
      <link>https://www.frandroid.com/marques/tesla/2941817_elon-musk-annonce-la-fin-de-loption-fsd-cest-desormais-un-modele-100-abonnement</link>
      <pubDate>Wed, 14 Jan 2026 08:17:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2941817_elon-musk-annonce-la-fin-de-loption-fsd-cest-desormais-un-modele-100-abonnement</guid>
      <description>
D&#232;s le 14 f&#233;vrier 2026, il sera impossible d'acheter l'option FSD (Full Self-Driving) de mani&#232;re d&#233;finitive. Tesla bascule sur un mod&#232;le 100 % abonnement.
</description>
    </item>
    <item>
      <title>Le HP OmniBook X Flip 16, un laptop OLED 2-en-1 sous Ryzen AI 7, est sold&#233; &#224; -17 %</title>
      <link>https://www.frandroid.com/bons-plans/2941429_le-hp-omnibook-x-flip-16-un-laptop-oled-2-en-1-sous-ryzen-ai-7-est-solde-a-17</link>
      <pubDate>Wed, 14 Jan 2026 08:08:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2941429_le-hp-omnibook-x-flip-16-un-laptop-oled-2-en-1-sous-ryzen-ai-7-est-solde-a-17</guid>
      <description>
Avec sa charni&#232;re 360&#176;, le laptop OmniBook X Flip 16 peut se transformer en tablette en un rien de temps. Puissant et solide, ce mod&#232;le est propos&#233; &#224; 999,99 euros au lieu de 1 199,99 euros chez Boulanger pendant les soldes d'hiver 2026.
</description>
    </item>
    <item>
      <title>Meilleures consoles de jeux portables : notre s&#233;lection en 2026</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-gaming/1705105_quelles-sont-les-meilleures-consoles-portables-notre-selection</link>
      <pubDate>Wed, 14 Jan 2026 08:05:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-gaming/1705105_quelles-sont-les-meilleures-consoles-portables-notre-selection</guid>
      <description>
Les consoles de jeu portables ont le vent en poupe. Il existe de nombreuses r&#233;f&#233;rences pour jouer partout &#224; tous vos titres favoris : jeux Nintendo, mais aussi jeux PC, et Android. Voici quelles sont les meilleures consoles portables disponibles sur le march&#233;.
</description>
    </item>
    <item>
      <title>Limit&#233;e, impopulaire, trop ch&#232;re&#160;: Mercedes-Benz freine sur la conduite de niveau 3</title>
      <link>https://www.01net.com/actualites/limitee-impopulaire-trop-chere-mercedes-benz-freine-sur-la-conduite-de-niveau-3.html</link>
      <pubDate>Wed, 14 Jan 2026 08:00:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319879</guid>
      <description>Mercedes-Benz abandonne (provisoirement) le d&#233;ploiement de la conduite autonome de niveau 3. La nouvelle Classe S ne proposera pas cette technologie lors de son lancement, alors que le constructeur en avait fait un argument cl&#233;. Que s'est-il pass&#233; ?</description>
    </item>
    <item>
      <title>Hijack season 2 episode 1 isn&#8217;t enough on its own to keep me watching &#8212; especially after this huge blunder in the Apple TV show&#8217;s return</title>
      <link>https://www.techradar.com/streaming/apple-tv-plus/hijack-season-2-episode-1-isnt-enough-on-its-own-to-keep-me-watching-especially-after-this-huge-blunder-in-the-apple-tv-shows-return</link>
      <pubDate>Wed, 14 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">pPq8U8oefNkcB3UbBSqtNk</guid>
      <description>Episode 1 is an incredibly slow start to Hijack season 2, but the smallest of details has still managed to give me the biggest of tempers.</description>
    </item>
    <item>
      <title>Apple va abandonner Pixelmator sur iOS</title>
      <link>https://www.01net.com/actualites/apple-va-abandonner-pixelmator-sur-ios.html</link>
      <pubDate>Wed, 14 Jan 2026 07:58:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319910</guid>
      <description>L&#8217;arriv&#233;e d&#8217;Apple Creator Studio et d&#8217;une nouvelle application Pixelmator Pro pour iPad n&#8217;est pas sans incidence sur les versions iOS de Pixelmator et de Photomator.</description>
    </item>
    <item>
      <title>La Nasa se rapproche d&#8217;un moment que plus personne n&#8217;a v&#233;cu depuis plus de 50 ans !</title>
      <link>https://www.futura-sciences.com/sciences/actualites/nasa-nasa-rapproche-moment-plus-personne-na-vecu-depuis-plus-50-ans-130110/#xtor%3DRSS-8</link>
      <pubDate>Wed, 14 Jan 2026 08:47:10 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/nasa-nasa-rapproche-moment-plus-personne-na-vecu-depuis-plus-50-ans-130110/#xtor%3DRSS-8</guid>
      <description>Pour tous ceux qui n&#8217;ont pas connu la p&#233;riode Apollo et la formidable &#233;pop&#233;e de l&#8217;Homme sur la Lune, cette nouvelle mission Artemis II marque un retour historique aux portes de notre satellite. La Nasa&#160;s&#8217;appr&#234;te en effet &#224; envoyer un &#233;quipage autour de la Lune. Dans le meilleur des cas, le...</description>
    </item>
    <item>
      <title>Ces VTT &#233;lectriques Canyon font leur retour avec une batterie plus l&#233;g&#232;re mais hyper endurante</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2940879_ces-vtt-electriques-canyon-font-leur-retour-avec-une-batterie-plus-legere-mais-hyper-endurante</link>
      <pubDate>Wed, 14 Jan 2026 07:43:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2940879_ces-vtt-electriques-canyon-font-leur-retour-avec-une-batterie-plus-legere-mais-hyper-endurante</guid>
      <description>
Touch&#233;s par un rappel de leurs batteries, les VTTAE Canyon Torque:ON et Spectral:ON accueillent un nouveau pack de 800 Wh, bien plus l&#233;ger et s&#233;curis&#233;.
</description>
    </item>
    <item>
      <title>Android 17&#160;: Google ferait marche arri&#232;re en ramenant ce raccourci qu&#8217;on n&#8217;esp&#233;rait plus</title>
      <link>https://www.01net.com/actualites/android-17-google-ferait-marche-arriere-ramenant-raccourci-esperait-plus.html</link>
      <pubDate>Wed, 14 Jan 2026 07:36:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319885</guid>
      <description>Android 17 pourrait introduire une s&#233;paration entre le centre de notifications et les r&#233;glages rapides, mais aussi un raccourci qu&#8217;on esp&#233;rait tous voir revenir.</description>
    </item>
    <item>
      <title>Nvidia pourrait cr&#233;er une nouvelle p&#233;nurie en siphonnant des millions de t&#233;raoctets de SSD</title>
      <link>https://www.frandroid.com/marques/nvidia/2941793_nvidia-pourrait-creer-une-nouvelle-penurie-en-siphonnant-des-millions-de-teraoctets-de-ssd</link>
      <pubDate>Wed, 14 Jan 2026 07:32:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2941793_nvidia-pourrait-creer-une-nouvelle-penurie-en-siphonnant-des-millions-de-teraoctets-de-ssd</guid>
      <description>
&#192; peine le march&#233; a-t-il eu le temps de s&#8217;acclimater &#224; la crise actuelle de m&#233;moire vive qu&#8217;une autre p&#233;nurie se profile &#224; l&#8217;horizon&#160;: celle de la m&#233;moire flash qui pourrait se d&#233;clarer dans les ann&#233;es &#224; venir, toujours &#224; cause de l&#8217;IA.
</description>
    </item>
    <item>
      <title>P&#233;nurie de m&#233;moire&#160;: pourquoi Micron fait passer l&#8217;IA avant les consommateurs</title>
      <link>https://www.01net.com/actualites/penurie-de-memoire-pourquoi-micron-fait-passer-lia-avant-les-consommateurs.html</link>
      <pubDate>Wed, 14 Jan 2026 07:30:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319873</guid>
      <description>La fin annonc&#233;e de Crucial, la marque bien connue du grand public pour ses composants et ses barrettes de m&#233;moire &#224; installer soi-m&#234;me dans son PC, a &#233;t&#233; tr&#232;s mal v&#233;cue par de nombreux consommateurs. Ils sont nombreux &#224; reprocher &#224; Micron, la maison-m&#232;re, d'avoir fait le choix du profit facile en privil&#233;giant l'industrie de l'IA qui d&#233;vore la RAM &#224; grandes bouch&#233;es. Le patron du groupe veut sauver la r&#233;putation de Micron, sans trop y parvenir....</description>
    </item>
    <item>
      <title>Le paradoxe Volkswagen : comment le succ&#232;s des voitures &#233;lectriques en Europe a annul&#233; la d&#233;gringolade en Chine</title>
      <link>https://www.frandroid.com/marques/volkswagen/2941763_le-paradoxe-volkswagen-comment-le-succes-des-voitures-electriques-en-europe-a-annule-la-degringolade-en-chine</link>
      <pubDate>Wed, 14 Jan 2026 07:26:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2941763_le-paradoxe-volkswagen-comment-le-succes-des-voitures-electriques-en-europe-a-annule-la-degringolade-en-chine</guid>
      <description>
Volkswagen vient de pr&#233;senter ses r&#233;sultats de 2025. Surprise : la belle progression des ventes de voitures &#233;lectriques en Europe a quasiment annul&#233; la d&#233;gringolade de la marque en Chine.
</description>
    </item>
    <item>
      <title>Sold&#233;, le vid&#233;oprojecteur Full HD compact TCL sous Google TV passe sous les 380 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2940957_solde-le-videoprojecteur-full-hd-compact-tcl-sous-google-tv-passe-sous-les-380-e</link>
      <pubDate>Wed, 14 Jan 2026 07:21:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2940957_solde-le-videoprojecteur-full-hd-compact-tcl-sous-google-tv-passe-sous-les-380-e</guid>
      <description>
Nomade, simple &#224; installer et offrant une image douce, le TCL A1s est un vid&#233;oprojecteur tr&#232;s pratique qui devrait autant satisfaire les d&#233;butants que les utilisateurs confirm&#233;s. Pendant les soldes d'hiver 2026, Amazon le propose d'ailleurs &#224; 379,99 euros au lieu de 399,99 euros.
</description>
    </item>
    <item>
      <title>I tested the Ricoh ScanSnap iX2400 - and it's the one piece of office kit I&#8217;m investing in this year to keep my paperwork in order</title>
      <link>https://www.techradar.com/computing/ricoh-scansnap-ix2400-document-scanner-review</link>
      <pubDate>Wed, 14 Jan 2026 07:15:00 +0000</pubDate>
      <guid isPermaLink="false">hBxPksQFcCArrUSWG8EHrS</guid>
      <description>The ScanSnap iX2400 is a USB-connected A4 desktop document scanner that&#8217;s capable of duplex scanning at 45ppm. The simple 100-sheet ADF and ScanSnap Home software make it easy to keep paperwork, printed photos and receipts organised in a paper-to-digital format.</description>
    </item>
    <item>
      <title>&#171; La course aux caract&#233;ristiques techniques est finie &#187; : d&#8217;apr&#232;s le patron de Nothing, les prix des smartphones vont exploser de 30 % en 2026</title>
      <link>https://www.frandroid.com/marques/2941773_la-course-aux-caracteristiques-techniques-est-finie-dapres-le-patron-de-nothing-les-prix-des-smartphones-vont-exploser-de-30-en-2026</link>
      <pubDate>Wed, 14 Jan 2026 07:05:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2941773_la-course-aux-caracteristiques-techniques-est-finie-dapres-le-patron-de-nothing-les-prix-des-smartphones-vont-exploser-de-30-en-2026</guid>
      <description>
Carl Pei, le patron de Nothing, a &#233;galement pris la parole concernant la p&#233;nurie de m&#233;moire vive : 2026 sera l'ann&#233;e o&#249; les smartphones cesseront d'&#234;tre "abordables". La cause ? Une explosion des co&#251;ts de la m&#233;moire, aspir&#233;e par les serveurs de l'IA, qui pourrait faire grimper la facture de 30 % selon lui.
</description>
    </item>
    <item>
      <title>Setapp Mobile jette l&#8217;&#233;ponge sur iPhone, une des premi&#232;res boutiques alternatives en Europe ferme</title>
      <link>https://www.01net.com/actualites/setapp-mobile-jette-leponge-sur-iphone-une-des-premieres-boutiques-alternatives-en-europe-ferme.html</link>
      <pubDate>Wed, 14 Jan 2026 07:01:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319864</guid>
      <description>Une des premi&#232;res boutiques alternatives &#224; l'App Store lanc&#233;es en Europe va fermer ses portes. Setapp Mobile tirera sa r&#233;v&#233;rence le mois prochain, mais poursuit son aventure en dehors de l'iPhone.</description>
    </item>
    <item>
      <title>Your employees aren&#8217;t disengaged. They&#8217;re fed up</title>
      <link>https://www.fastcompany.com/91470496/your-employees-arent-disengaged-theyre-fed-up</link>
      <pubDate>2026-01-14T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91470496/your-employees-arent-disengaged-theyre-fed-up</guid>
      <description>SurveyMonkey&#8217;s CEO on how listening can be the key to reinvigorating employees.
Quiet quitting. Silent space-out. Faux focus. Call it what you want, a lot of today&#8217;s workers are going through the motions on the surface while quietly powering down beneath it. Nearly half of Gen Z employees say they&#8217;re &#8220;coasting,&#8221; and overall U.S. employee engagement sits at a decade low....</description>
    </item>
    <item>
      <title>Apple Intelligence : comment Gemini va transformer Siri sans laisser de traces</title>
      <link>https://www.frandroid.com/marques/apple/2941769_apple-intelligence-comment-gemini-va-transformer-siri-sans-laisser-de-traces</link>
      <pubDate>Wed, 14 Jan 2026 06:58:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2941769_apple-intelligence-comment-gemini-va-transformer-siri-sans-laisser-de-traces</guid>
      <description>
On commence enfin &#224; y voir clair dans le deal entre Apple et Google. On pensait que Siri allait devenir un simple clone de Gemini, mais la r&#233;alit&#233; est bien plus maligne. Apple va utiliser la puissance de Google tout en effa&#231;ant m&#233;thodiquement son nom de l'interface. 
</description>
    </item>
    <item>
      <title>&#171; Danger ! Surchauffe batterie &#187; : le message que vous ne voulez pas voir sur votre EX30, mais rassurez-vous</title>
      <link>https://www.frandroid.com/marques/volvo/2941765_danger-surchauffe-batterie-le-message-que-vous-ne-voulez-pas-voir-sur-votre-ex30-mais-rassurez-vous</link>
      <pubDate>Wed, 14 Jan 2026 06:45:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volvo/2941765_danger-surchauffe-batterie-le-message-que-vous-ne-voulez-pas-voir-sur-votre-ex30-mais-rassurez-vous</guid>
      <description>
i vous poss&#233;dez un Volvo EX30 en France, vous pouvez normalement continuer &#224; charger votre batterie sans craindre l'embrasement. Mais de l'autre c&#244;t&#233; de la Manche, c'est une autre histoire : un risque d'incendie force Volvo &#224; brider ses voitures.
</description>
    </item>
  </channel>
</rss>
