<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 10 Nov 2025 17:34:33 GMT</lastBuildDate>
    <item>
      <title>Incogni vs. Aura: What's your best option for maintaining online privacy?</title>
      <link>https://www.techradar.com/pro/security/incogni-vs-aura-whats-your-best-option-for-maintaining-online-privacy</link>
      <pubDate>Mon, 10 Nov 2025 17:34:00 +0000</pubDate>
      <guid isPermaLink="false">qDgXsEJYLdM42qjDnahpxj</guid>
      <description>Learn how Incogni and Aura fare against each other in features, pricing, customer support, user-friendliness, and reporting.</description>
    </item>
    <item>
      <title>Patreon is adding tweet-like features and more recommended content</title>
      <link>https://www.theverge.com/news/816723/patreon-features-quips-recommendations-collaborative-posts</link>
      <pubDate>2025-11-10T12:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=816723</guid>
      <description>Patreon is introducing a suite of new features, and some of them are reminiscent of traditional social media platforms. The most obvious callback is something Patreon is calling Quips, which &#8212; you guessed it &#8212; are essentially tweets. Quips are smaller text, photo, or video posts that are public by default and open for anyone [&#8230;]</description>
    </item>
    <item>
      <title>The DJI Mini 4 Pro price plummets to a record low following the Mini 5 Pro launch &#8211; the older model is simply an excellent buy</title>
      <link>https://www.techradar.com/seasonal-sales/the-dji-mini-4-pro-price-plummets-to-a-record-low-following-the-mini-5-pro-launch-the-older-model-is-simply-an-excellent-buy</link>
      <pubDate>Mon, 10 Nov 2025 17:25:25 +0000</pubDate>
      <guid isPermaLink="false">dLAaoPUwr8tMrLE9xQyxxU</guid>
      <description>4K video up to 100fps, omnidirectional object sensing, sub-250g &#8211; it's a stunning feature set for the money</description>
    </item>
    <item>
      <title>2025 was a bad year for internet freedoms &#8211; here's the 3 cheapest ways to reclaim your digital rights</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/2025-was-a-bad-year-for-internet-freedoms-heres-the-3-cheapest-ways-to-reclaim-your-digital-rights</link>
      <pubDate>Mon, 10 Nov 2025 17:17:43 +0000</pubDate>
      <guid isPermaLink="false">zPRANxGgW8EZfTVpyJuhzR</guid>
      <description>2025 saw an increase in internet restrictions &#8211; from internet shutdowns to age-gated content. A VPN can help you navigate the chaos, and Black Friday VPN deals make it cheaper than ever.</description>
    </item>
    <item>
      <title>Science Keeps Dismantling Trump&#8217;s Tylenol-Autism Scare</title>
      <link>https://gizmodo.com/science-keeps-dismantling-trumps-tylenol-autism-scare-2000683647</link>
      <pubDate>Mon, 10 Nov 2025 17:15:57 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683647</guid>
      <description>A new review shows a "lack of robust evidence" linking the use of Tylenol during pregnancy to either autism or ADHD.</description>
    </item>
    <item>
      <title>Forget the robots &#8211; this is the reason AI is the best thing to happen since smartphone cameras</title>
      <link>https://www.techradar.com/ai-platforms-assistants/gemini/forget-the-robots-this-is-the-reason-ai-is-the-best-thing-to-happen-since-smartphone-cameras</link>
      <pubDate>Mon, 10 Nov 2025 17:14:27 +0000</pubDate>
      <guid isPermaLink="false">Y2Z7ihGTnHNSAAdEEHyen8</guid>
      <description>Google Photos' new Gemini Ask feature is the best photo answer engine you're probably not using &#8211; yet.</description>
    </item>
    <item>
      <title>iRobot&#8217;s revenue has tanked and it&#8217;s almost out of cash</title>
      <link>https://www.theverge.com/news/817536/irobots-revenue-has-tanked-and-its-almost-out-of-cash</link>
      <pubDate>2025-11-10T12:10:32-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=817536</guid>
      <description>Things continue to look bleak for the original robot vacuum maker. iRobot&#8217;s third-quarter results, released last week, show that revenue is down and &#8220;well below our internal expectations due to continuing market headwinds, ongoing production delays, and unforeseen shipping disruptions,&#8221; said Gary Cohen, iRobot CEO, in a press release. This meant they had to spend [&#8230;]...</description>
    </item>
    <item>
      <title>Amazon's official Black Friday sale date revealed - preview the best deals from Bissell, Nike, Samsung, and more</title>
      <link>https://www.techradar.com/seasonal-sales/amazons-official-black-friday-sale-date-revealed-preview-the-best-deals-from-bissell-nike-samsung-and-more</link>
      <pubDate>Mon, 10 Nov 2025 17:10:16 +0000</pubDate>
      <guid isPermaLink="false">YUAGwLPgsij6t3hPdP2tAJ</guid>
      <description>Amazon has announced the dates for its official Black Friday sale, and I'm breaking down everything you need to know, plus today's best early deals.</description>
    </item>
    <item>
      <title>Lenovo Black Friday laptop deals are live: up to 45% off ThinkPad, Yoga, and Legion</title>
      <link>https://www.techradar.com/computing/windows-laptops/lenovo-black-friday-laptop-deals-are-live-save-up-to-45-percent-on-thinkpad-yoga-and-legion</link>
      <pubDate>Mon, 10 Nov 2025 17:05:29 +0000</pubDate>
      <guid isPermaLink="false">swfz2oSuE9gDfknjyvjCdY</guid>
      <description>Lenovo's early Black Friday sale includes everything from super-cheap Windows 11 machines to high-end gaming laptops: here are today's best deals.</description>
    </item>
    <item>
      <title>MLB pitchers Emmanuel Clase and Luis Ortiz indicted on bribery charges</title>
      <link>https://www.fastcompany.com/91438283/mlb-pitchers-emmanuel-clase-and-luis-ortiz-indicted-on-bribery-charges</link>
      <pubDate>2025-11-10T17:03:59</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91438283/mlb-pitchers-emmanuel-clase-and-luis-ortiz-indicted-on-bribery-charges</guid>
      <description>Officials said Clase was not in custody, while Ortiz was arrested on Sunday by the FBI at Logan International Airport.
Cleveland Guardians pitchers Emmanuel Clase and Luis Ortiz have been indicted on charges they took bribes from sports bettors to throw certain types of pitches, including tossing balls in the dirt instead of strikes, to ensure successful bets.According to the indictment unsealed Sunday in federal court in Brooklyn, the highly paid hurlers took several thousand dollars in payoffs to help two unnamed gamblers from their native Dominican Republic win at least $460,000 on in-game ...</description>
    </item>
    <item>
      <title>Cdiscount cr&#233;e la surprise du pr&#233;-Black Friday avec pr&#232;s de 40 % de remise sur le Samsung Galaxy S25 Ultra, le smartphone premium le plus abouti de sa g&#233;n&#233;ration</title>
      <link>https://www.frandroid.com/bons-plans/2862851_cdiscount-cree-la-surprise-du-pre-black-friday-avec-pres-de-40-de-remise-sur-le-samsung-galaxy-s25-ultra-le-smartphone-premium-le-plus-abouti-de-sa-generation</link>
      <pubDate>Mon, 10 Nov 2025 17:03:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2862851_cdiscount-cree-la-surprise-du-pre-black-friday-avec-pres-de-40-de-remise-sur-le-samsung-galaxy-s25-ultra-le-smartphone-premium-le-plus-abouti-de-sa-generation</guid>
      <description>
Le Samsung Galaxy S25 Ultra 256 Go co&#251;te 1 469 euros, sauf chez Cdiscount pendant le pr&#233;-Black Friday o&#249; il est disponible pour 918,99 euros.
</description>
    </item>
    <item>
      <title>Casting XXL pour notre &#233;mission Survolt&#233;s et double Matinale Tech&#8217; : notre programme Twitch de la semaine, c&#8217;est juste ici</title>
      <link>https://www.frandroid.com/humanoid/emissions/2632585_casting-xxl-pour-notre-emission-survoltes-et-double-matinale-tech-notre-programme-twitch-de-la-semaine-cest-juste-ici</link>
      <pubDate>Mon, 10 Nov 2025 17:03:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/emissions/2632585_casting-xxl-pour-notre-emission-survoltes-et-double-matinale-tech-notre-programme-twitch-de-la-semaine-cest-juste-ici</guid>
      <description>
Notre programme Twitch de la semaine du 10 novembre, c&#8217;est juste ici&#160;: nous vous donnons rendez-vous, mercredi, jeudi et vendredi sur notre cha&#238;ne Frandroidlive, pour siroter votre caf&#233; devant notre Matinale Tech' que pour profiter de la 19e de Survolt&#233;s.
</description>
    </item>
    <item>
      <title>Some Docker containers may not be as secure as they like, experts warn</title>
      <link>https://www.techradar.com/pro/security/some-docker-containers-may-not-be-as-secure-as-they-like-experts-warn</link>
      <pubDate>Mon, 10 Nov 2025 17:02:00 +0000</pubDate>
      <guid isPermaLink="false">3YJL2HisfD8Max7MZFzPq9</guid>
      <description>Three high-severity flaws were recently discovered that could grant access to the underlying system.</description>
    </item>
    <item>
      <title>Pour rattraper son retard sur l&#8217;IA, l&#8217;Europe pr&#234;te &#224; l&#226;cher du lest sur la vie priv&#233;e&#160;?</title>
      <link>https://www.01net.com/actualites/pour-rattraper-son-retard-sur-lia-leurope-prete-a-lacher-du-lest-sur-la-vie-privee.html</link>
      <pubDate>Mon, 10 Nov 2025 17:01:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306700</guid>
      <description>Dans neuf jours, la Commission europ&#233;enne pr&#233;sentera officiellement son grand projet de simplification des lois num&#233;riques, destin&#233; &#224; all&#233;ger la charge administrative des entreprises. Mais les projets de texte, publi&#233;s dans la presse europ&#233;enne la semaine derni&#232;re, sugg&#232;rent des &#171;&#160;changements &#233;normes &#187; : apr&#232;s l'AI Act, le RGPD, jusque-l&#224; intouchable, pourrait bel et bien subir un sacr&#233; coup de rabot. Au d&#233;triment de notre vie priv&#233;e, pour plusieurs d&#233;fenseurs du droit &#224; la vie priv&#233;e....</description>
    </item>
    <item>
      <title>Anno 117: Pax Romana is a beautiful and refined city builder, but its simplicity might disappoint returning fans</title>
      <link>https://www.techradar.com/gaming/anno-117-pax-romana-review</link>
      <pubDate>Mon, 10 Nov 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">KhvTboeRNWNk3r7NpcQbSa</guid>
      <description>Anno 117: Pax Romana isn&#8217;t as complex as its predecessor, but it&#8217;s still a gorgeous city builder that impresses across the board.</description>
    </item>
    <item>
      <title>Snapchat is bringing back classic 2D Bitmoji</title>
      <link>https://www.fastcompany.com/91438419/snapchat-is-bringing-back-classic-2d-bitmoji</link>
      <pubDate>2025-11-10T17:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91438419/snapchat-is-bringing-back-classic-2d-bitmoji</guid>
      <description>Snapchat+ subscribers will get the option to filter their Bitmoji with a new 2D style inspired by the original look.
Bitmoji is going back to 2D.</description>
    </item>
    <item>
      <title>Pr&#233;-Black Friday 2025 : voici les meilleures offres en DIRECT d&#8217;Amazon, Boulanger, Fnac, Darty&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2849105_pre-black-friday-2025-voici-les-meilleures-offres-en-direct-damazon-boulanger-fnac-darty</link>
      <pubDate>Mon, 10 Nov 2025 16:59:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849105_pre-black-friday-2025-voici-les-meilleures-offres-en-direct-damazon-boulanger-fnac-darty</guid>
      <description>
De nombreux e-commer&#231;ants ont pris de l'avance sur le Black Friday cette ann&#233;e on retrouve d&#232;s maintenant de belles remises sur de nombreux produits Tech. Nous suivons les offres les plus int&#233;ressantes en temps r&#233;el pour vous pr&#233;senter une s&#233;lection des meilleures promotions du moment, incluant les smartphones, ordinateurs, t&#233;l&#233;viseurs, objets connect&#233;s, etc.
...</description>
    </item>
    <item>
      <title>Bose&#8217;s latest QuietComfort Ultra earbuds are $50 off ahead of Black Friday</title>
      <link>https://www.theverge.com/tech/817575/bose-quietcomfort-ultra-earbuds-blink-video-doorbell-bundle-deal-sale</link>
      <pubDate>2025-11-10T11:57:35-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=817575</guid>
      <description>If your upcoming holiday plans include a lot of travel, having a pair of noise-cancelling earbuds can help make the flight or train ride a little less chaotic. Bose&#8217;s second-generation QuietComfort Ultra Earbuds are among the best noise-canceling earbuds we&#8217;ve tested recently, and they&#8217;re on sale for a new all-time low of around $249 ($50 [&#8230;]</description>
    </item>
    <item>
      <title>Verizon will literally give you a free Nintendo Switch with an internet plan right now</title>
      <link>https://www.techradar.com/gaming/nintendo/verizon-will-literally-give-you-a-free-nintendo-switch-with-an-internet-plan-right-now</link>
      <pubDate>Mon, 10 Nov 2025 16:48:36 +0000</pubDate>
      <guid isPermaLink="false">u8TvJ6ZiFBoxRUGo4uuGBL</guid>
      <description>You can upgrade your internet and get a free Nintendo Switch with Verizon right now.</description>
    </item>
    <item>
      <title>Samsung n&#8217;&#233;pargne aucun de ses produits pour le pr&#233;-Black Friday, m&#234;me le S25 Ultra y passe : voici le TOP 16 des offres &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2852851_samsung-nepargne-aucun-de-ses-produits-pour-le-pre-black-friday-le-top-15-des-offres-a-retenir</link>
      <pubDate>Mon, 10 Nov 2025 16:47:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2852851_samsung-nepargne-aucun-de-ses-produits-pour-le-pre-black-friday-le-top-15-des-offres-a-retenir</guid>
      <description>
Samsung participe pleinement &#224; cette p&#233;riode de pr&#233;-Black Friday. Smartphones, t&#233;l&#233;viseurs, tablettes, barres de son, vid&#233;oprojecteurs et m&#234;me aspirateurs-balais&#8239;: la marque sud-cor&#233;enne casse les prix sur de nombreuses r&#233;f&#233;rences r&#233;centes et populaires. D&#233;couvrez les meilleures offres &#224; saisir dans cet article.  
</description>
    </item>
    <item>
      <title>Smart Glasses Are Already Getting Ridiculously Light</title>
      <link>https://gizmodo.com/smart-glasses-are-already-getting-ridiculously-light-2000683643</link>
      <pubDate>Mon, 10 Nov 2025 16:45:09 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683643</guid>
      <description>Take a load off, Meta.</description>
    </item>
    <item>
      <title>Test du Minisforum MS-S1 Max : l&#8217;&#232;re du mini-PC limit&#233; &#224; la bureautique est d&#233;finitivement r&#233;volue</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-fixes/2855261_test-minisforum-ms-s1-max</link>
      <pubDate>Mon, 10 Nov 2025 16:42:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-fixes/2855261_test-minisforum-ms-s1-max</guid>
      <description>
Pendant des ann&#233;es, on a maintenu une s&#233;paration nette : mini-PC compacts d'un c&#244;t&#233; pour le travail, tours imposantes de l'autre pour le gaming et les charges lourdes. Le Minisforum MS-S1 Max avec son AMD Ryzen AI Max+ 395 et ses 128 Go de m&#233;moire unifi&#233;e vient bousculer cette logique. 
</description>
    </item>
    <item>
      <title>Samsung Galaxy S26 Plus reappears in renders with a new camera island</title>
      <link>https://www.theverge.com/news/817615/samsung-galaxy-s26-plus-renders-design-camera-island</link>
      <pubDate>2025-11-10T11:42:01-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=817615</guid>
      <description>Just two months ago, accepted wisdom was that there would be no Galaxy S26 Plus, Samsung&#8217;s mid-sized flagship canned in favor of a slim Edge phone. Now things have flipped, with the Edge supposedly cancelled and the Plus not only on track to release early next year, but revealed in new renders based on the [&#8230;]</description>
    </item>
    <item>
      <title>Powering AI Could Soon Use as Much Water as 10 Million Americans</title>
      <link>https://gizmodo.com/training-ai-could-soon-use-as-much-water-as-10-million-americans-2000683679</link>
      <pubDate>Mon, 10 Nov 2025 16:35:45 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683679</guid>
      <description>Fortunately, a new study outlines a strategy to significantly curb AI's water consumption and carbon emissions.</description>
    </item>
    <item>
      <title>Cette future voiture &#233;lectrique se cache dans Fortnite, et c&#8217;est une Peugeot</title>
      <link>https://www.frandroid.com/marques/peugeot/2862313_cette-future-voiture-electrique-se-cache-dans-fortnite-et-cest-une-peugeot</link>
      <pubDate>Mon, 10 Nov 2025 16:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/peugeot/2862313_cette-future-voiture-electrique-se-cache-dans-fortnite-et-cest-une-peugeot</guid>
      <description>
Apr&#232;s quasiment sept ans de bons et loyaux services, la Peugeot e-208 va se renouveler ces prochains mois. La firme vient de pr&#233;senter un concept pour le moins &#233;tonnant, directement int&#233;gr&#233; &#224; Fortnite. De quoi pr&#233;figurer la prochaine 208.
</description>
    </item>
    <item>
      <title>Why Disney is all in on cruises, according to experiences chief Josh D&#8217;Amaro</title>
      <link>https://www.fastcompany.com/91436259/disney-josh-damaro-cruise-ship-entertainment</link>
      <pubDate>2025-11-10T16:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91436259/disney-josh-damaro-cruise-ship-entertainment</guid>
      <description>Cruise mania is back in a big way, and with the launch of Destiny and more ships coming, he reveals what&#8217;s next and how Disney&#8217;s pushing its on-board storytelling forward.
Disney has been in the cruise business for 27 years now, but over the past few years, the company has doubled down in an unprecedented manner. On November 20, the entertainment giant will see the inaugural sailing of the Disney Destiny, a 144,000 gross ton ship capable of carrying 4,000 passengers that is the latest in a growing fleet. It&#8217;s the fourth addition in the past four years. And five more ships are coming by 2031, w...</description>
    </item>
    <item>
      <title>Consolidation begins to hit the carbon credit market</title>
      <link>https://techcrunch.com/2025/11/10/consolidation-begins-to-hit-the-carbon-credit-market/</link>
      <pubDate>Mon, 10 Nov 2025 16:29:57 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3066427</guid>
      <description>Carbon Direct is buying Pachama as the voluntary carbon markets enter a period of uncertainty.</description>
    </item>
    <item>
      <title>Don&#8217;t trust big tech with your storage? Try this Proton plan, now on sale for an incredible 60% off this Black Friday</title>
      <link>https://www.techradar.com/pro/dont-trust-big-tech-with-your-storage-try-this-proton-plan-now-on-sale-for-black-friday</link>
      <pubDate>Mon, 10 Nov 2025 16:26:00 +0000</pubDate>
      <guid isPermaLink="false">cpuHDnMHvtma95uN3XbC3m</guid>
      <description>Looking to avoid the big players when it comes to storage? This independent non-profit could be your answer.</description>
    </item>
    <item>
      <title>La prochaine montre Garmin embarquerait une nouveaut&#233; in&#233;dite et bienvenue</title>
      <link>https://www.frandroid.com/marques/garmin/2862669_la-prochaine-montre-garmin-embarquerait-une-nouveaute-inedite-et-bienvenue</link>
      <pubDate>Mon, 10 Nov 2025 16:22:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/garmin/2862669_la-prochaine-montre-garmin-embarquerait-une-nouveaute-inedite-et-bienvenue</guid>
      <description>
Selon les derni&#232;res informations en date, Garmin pr&#233;pare quelque chose d'in&#233;dit pour un futur mod&#232;le de montre connect&#233;e. Voici &#224; quoi cela pourrait ressembler.
</description>
    </item>
    <item>
      <title>Le pr&#233;-Black Friday liquide les stocks de smartphones premium : voici le meilleur des promos sur les iPhone d&#8217;Apple, Samsung Galaxy et Google Pixel</title>
      <link>https://www.frandroid.com/bons-plans/2848295_le-black-friday-liquide-les-stocks-de-smartphones-notre-top-10-des-promos-sur-les-iphone-dapple-samsung-galaxy-et-google-pixel</link>
      <pubDate>Mon, 10 Nov 2025 16:19:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848295_le-black-friday-liquide-les-stocks-de-smartphones-notre-top-10-des-promos-sur-les-iphone-dapple-samsung-galaxy-et-google-pixel</guid>
      <description>
Le Black Friday est bien en avance cette ann&#233;e, et de tous les produits tech, ce sont les smartphones qui en profitent le plus. Samsung Galaxy, iPhone d'Apple, Google Pixel, Xiaomi Redmi, de l'entr&#233;e au haut de gamme, voyons ce que r&#233;servent les e-commer&#231;ants en ce d&#233;but de Black November.
</description>
    </item>
    <item>
      <title>Sorry Sony Fans, the PS6 May Be Even More PC Than Console, Too</title>
      <link>https://gizmodo.com/sony-ps6-may-be-even-more-pc-than-console-2000683648</link>
      <pubDate>Mon, 10 Nov 2025 16:18:22 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683648</guid>
      <description>Get ready for the generation of consoles with the guts of a PC.</description>
    </item>
    <item>
      <title>Paul Tagliabue, the NFL&#8217;s commissioner for 17 years, has died at 84</title>
      <link>https://www.fastcompany.com/91438292/paul-tagliabue-nfls-commissioner-17-years-died-84</link>
      <pubDate>2025-11-10T16:16:05</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91438292/paul-tagliabue-nfls-commissioner-17-years-died-84</guid>
      <description>Tagliabue died in Chevy Chase, Maryland, from heart failure.
Paul Tagliabue, who helped bring labor peace and riches to the NFL during his 17 years as commissioner but was criticized for not taking stronger action on concussions, died Sunday from heart failure. He was 84.NFL spokesman Brian McCarthy said Tagliabue&#8217;s family informed the league of his death in Chevy Chase, Maryland.Tagliabue, who had developed Parkinson&#8217;s disease, was commissioner after Pete Rozelle from 1989 to 2006. He was elected to the Pro Football Hall of Fame as part of a special centennial class in 2020. Current Commissio...</description>
    </item>
    <item>
      <title>Oscar Isaac Would Come Back to &#8216;Star Wars&#8217; If Disney Is Done Capitulating to Fascism</title>
      <link>https://gizmodo.com/oscar-isaac-star-wars-return-disney-fascism-2000683691</link>
      <pubDate>Mon, 10 Nov 2025 16:15:08 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683691</guid>
      <description>The man behind Poe Dameron's X-Wing controls isn't giving up, as long as there's still light.</description>
    </item>
    <item>
      <title>Researchers Discover Two Mysterious Voids in Giza Pyramid</title>
      <link>https://gizmodo.com/researchers-discover-two-mysterious-voids-in-giza-pyramid-2000683650</link>
      <pubDate>Mon, 10 Nov 2025 16:10:06 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683650</guid>
      <description>A strangely smooth expanse of granite on the Menkaure Pyramid might be a second entrance.</description>
    </item>
    <item>
      <title>Supreme Court rejects a Kentucky appeal to overturn nationwide same-sex marriage legislation</title>
      <link>https://www.fastcompany.com/91438476/supreme-court-rejects-kentucky-appeal-overturn-nationwide-same-sex-marriage-legislation</link>
      <pubDate>2025-11-10T16:10:05</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91438476/supreme-court-rejects-kentucky-appeal-overturn-nationwide-same-sex-marriage-legislation</guid>
      <description>Kim Davis, a former Kentucky clerk, had been trying to get the court to side with her after she denied marriage licenses to same-sex couples.
The Supreme Court on Monday rejected a call to overturn its landmark decision that legalized same-sex marriage nationwide.The justices, without comment, turned away an appeal from Kim Davis, the former Kentucky court clerk who refused to issue marriage licenses to same-sex couples after the high court&#8217;s 2015 ruling in Obergefell v. Hodges.Davis had been trying to get the court to overturn a lower-court order for her to pay $360,000 in damages and attorne...</description>
    </item>
    <item>
      <title>Samsung phones under threat from this dangerous new spyware cyberattack - here's how to stay safe</title>
      <link>https://www.techradar.com/pro/security/samsung-phones-under-threat-from-this-dangerous-new-spyware-cyberattack-heres-how-to-stay-safe</link>
      <pubDate>Mon, 10 Nov 2025 16:04:00 +0000</pubDate>
      <guid isPermaLink="false">GQTNijkEBrW9955SLt3hd5</guid>
      <description>LandFall was deployed against targets using Samsung devices in the Middle East.</description>
    </item>
    <item>
      <title>Apple Fitness+ transpire pour sa survie</title>
      <link>https://www.01net.com/actualites/apple-fitness-transpire-pour-sa-survie.html</link>
      <pubDate>Mon, 10 Nov 2025 16:02:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306740</guid>
      <description>Le service Fitness+ n'a pas encore la t&#234;te sur le billot, mais  un gros nuage noir pointe &#224; l'horizon. Apple aurait en effet mis cette activit&#233; sous surveillance, car le retour sur investissement serait tr&#232;s modeste.</description>
    </item>
    <item>
      <title>YouTubers aren&#8217;t relying on ad revenue anymore &#8212; here&#8217;s how some are diversifying</title>
      <link>https://techcrunch.com/2025/11/10/youtubers-arent-relying-on-ad-revenue-anymore-heres-how-some-are-diversifying/</link>
      <pubDate>Mon, 10 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3053579</guid>
      <description>YouTubers are no longer just creators, and in some cases, their side businesses are growing faster than their channels.</description>
    </item>
    <item>
      <title>Google Maps releases new AI tools that let you create interactive projects</title>
      <link>https://techcrunch.com/2025/11/10/google-maps-releases-new-ai-tools-to-let-you-create-interactive-projects/</link>
      <pubDate>Mon, 10 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3066364</guid>
      <description>Google is debuting an agent that will generate code for you to build interactive Maps projects.</description>
    </item>
    <item>
      <title>Avant-Black Friday smartphones &#224; moins de 500 &#8364; : voici les meilleures offres Samsung Galaxy, Xiaomi Redmi et Nothing Phone</title>
      <link>https://www.frandroid.com/bons-plans/2856691_le-black-month-est-la-avec-des-reductions-phares-le-top-des-meilleures-offres-de-smartphones-a-moins-de-500-e</link>
      <pubDate>Mon, 10 Nov 2025 15:54:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2856691_le-black-month-est-la-avec-des-reductions-phares-le-top-des-meilleures-offres-de-smartphones-a-moins-de-500-e</guid>
      <description>
Si le Black Friday se fera attendre jusqu'&#224; la fin du mois, les e-commer&#231;ants fran&#231;ais n'ont eux pas attendu pour lancer des offres. Les smartphones font partie des produits qui profitent de r&#233;ductions vraiment int&#233;ressantes, notamment sur l'entr&#233;e et le milieu de gamme. 
</description>
    </item>
    <item>
      <title>&#171; &#192; plus de 250 euros, c&#8217;est nous qui avons la meilleure vente &#187; : il n&#8217;y pas que les smartphones de Xiaomi qui cartonnent en France</title>
      <link>https://www.frandroid.com/marques/xiaomi/2862351_a-plus-de-250-euros-cest-nous-qui-avons-la-meilleure-vente-il-ny-pas-que-les-smartphones-de-xiaomi-qui-cartonnent-en-france</link>
      <pubDate>Mon, 10 Nov 2025 15:52:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2862351_a-plus-de-250-euros-cest-nous-qui-avons-la-meilleure-vente-il-ny-pas-que-les-smartphones-de-xiaomi-qui-cartonnent-en-france</guid>
      <description>
Le patron de Xiaomi France nous apprend que les ventes de tablettes sont en croissance et que la marque compte bien surfer sur la vague.
</description>
    </item>
    <item>
      <title>Apple removes popular gay dating apps from Chinas App Store</title>
      <link>https://mashable.com/article/apple-removes-gay-dating-apps-blued-finka-from-china-app-store</link>
      <pubDate>Mon, 10 Nov 2025 15:40:21 +0000</pubDate>
      <guid isPermaLink="false">01LCebOTT3jQSjRvHgtzOzX</guid>
      <description>Apple has removed top gay dating apps Blued and Finka from China's App Store, WIRED has reported.</description>
    </item>
    <item>
      <title>The EPA Is in Chaos</title>
      <link>https://www.wired.com/story/environmental-protection-agency-shutdown-chaos/</link>
      <pubDate>Mon, 10 Nov 2025 15:37:09 +0000</pubDate>
      <guid isPermaLink="false">69024deb4e7c8c237645e49f</guid>
      <description>&#8220;We learn who is furloughed when we send an email to someone and get the out-of-office message,&#8221; one employee tells WIRED.</description>
    </item>
  </channel>
</rss>
