<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 24 Dec 2025 14:24:27 GMT</lastBuildDate>
    <item>
      <title>Pro-Russian hacker group claims responsibility for DDoS attack on French postal service</title>
      <link>https://www.engadget.com/cybersecurity/pro-russian-hacker-group-claims-responsibility-for-ddos-attack-on-french-postal-service-140015323.html?src=rss</link>
      <pubDate>Wed, 24 Dec 2025 14:00:15 +0000</pubDate>
      <guid isPermaLink="false">200fb94f-05a2-41c0-9479-d78ecdc58964</guid>
      <description>A pro-Russian hacker group has come forward as the perpetrator of a DDoS attack on the French national postal service La Poste that took place on December 22, according to Reuters. The distributed denial-of-service attack took central computer systems at La Poste entirely offline and caused major disruptions in package deliveries just days before Christmas.
Reuters reported that the cyberattack on La Poste was still not fully resolved as of Wednesday morning. While regular letters were not affected, postal workers were unable to track packages and online payments through La Banque Postale, the...</description>
    </item>
    <item>
      <title>How to track Santa Claus this Christmas Eve using AI</title>
      <link>https://techcrunch.com/2025/12/24/how-to-track-santa-claus-this-christmas-eve-2022/</link>
      <pubDate>Wed, 24 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=2460189</guid>
      <description>If you&#8217;re a parent with young children, then you&#8217;ll probably hear this a lot on Christmas Eve: &#8220;Where&#8217;s Santa right now?&#8221; With tracking tools like the NORAD Santa Tracker and Google&#8217;s Santa Tracker, everyone can know when Father Christmas will arrive. Plus, there are now some new AI tools to bring the holiday magic. Here&#8217;s [&#8230;]</description>
    </item>
    <item>
      <title>5 ways VPNs have surprised us this year</title>
      <link>https://www.techradar.com/vpn/vpn-services/5-ways-vpns-have-surprised-us-this-year</link>
      <pubDate>Wed, 24 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">Gk3HXoYc8ZCW5Xxkkoy3R8</guid>
      <description>Looking back at a year of innovation</description>
    </item>
    <item>
      <title>Pluribus season 2: everything we know so far about the hit Apple TV show's return</title>
      <link>https://www.techradar.com/streaming/apple-tv-plus/pluribus-season-2-hub</link>
      <pubDate>Wed, 24 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">G4NTiGv4ptopVS2aLawB8a</guid>
      <description>Pluribus season 2 is currently in development for Apple TV &#8211; here's what we know about it so far.</description>
    </item>
    <item>
      <title>My favorite camera for 2025 was the finest stills camera I&#8217;ve ever held &#8212; the stunning Hasselblad X2D II</title>
      <link>https://www.techradar.com/cameras/mirrorless-cameras/my-favorite-camera-for-2025-was-the-finest-stills-camera-ive-ever-held-the-stunning-hasselblad-x2d-ii</link>
      <pubDate>Wed, 24 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">w8si2qSW3MtLUZw4YM3xbP</guid>
      <description>The Hasselblad X2D II the finest camera for photography ever made &#8211; for outright image quality at least &#8211; and it also saw a welcome price drop from its predecessor.</description>
    </item>
    <item>
      <title>Aflac reveals personal data of 22.6 million people stolen in cyberattack - here's what we know</title>
      <link>https://www.techradar.com/pro/security/aflac-reveals-personal-data-of-22-6-million-people-stolen-in-cyberattack-heres-what-we-know</link>
      <pubDate>Wed, 24 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">q9UongDtubce5BJTLgW7Ta</guid>
      <description>Six months after the breach, Aflac determines how many people are affected and starts reaching out.</description>
    </item>
    <item>
      <title>Orange fait un cadeau surprise aux Livebox 4 et 5 (mais il peut brider votre Wi-Fi)</title>
      <link>https://www.01net.com/actualites/orange-fait-un-cadeau-surprise-aux-livebox-4-et-5-mais-il-peut-brider-votre-wi-fi.html</link>
      <pubDate>Wed, 24 Dec 2025 13:32:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317157</guid>
      <description>C'est une mise &#224; jour aussi discr&#232;te qu'importante. Orange a commenc&#233; &#224; d&#233;ployer une nouvelle fonctionnalit&#233; sur ses anciennes Livebox 4 et 5, ainsi que sur les mod&#232;les Sosh, pour r&#233;duire leur consommation &#233;lectrique. Attention, cette &#233;conomie d'&#233;nergie passe par une coupure automatique d'une partie du Wi-Fi, ce qui peut impacter la qualit&#233; de votre connexion....</description>
    </item>
    <item>
      <title>Toyota's Prius Prime saved me gas money but probably not the environment</title>
      <link>https://www.engadget.com/transportation/toyotas-prius-prime-saved-me-gas-money-but-probably-not-the-environment-133027378.html?src=rss</link>
      <pubDate>Wed, 24 Dec 2025 13:30:27 +0000</pubDate>
      <guid isPermaLink="false">2adbb108-ccc5-4295-a399-d2b2c5581dab</guid>
      <description>I&#8217;ve always wondered what it would be like to own a plug-in hybrid, and recently, fate handed me that opportunity. On a recent trip to Vancouver, I rented a 2024 Toyota Prius Prime for nearly two months &#8212; the ideal scenario to try out North America&#8217;s most popular PHEV.
My experience with the Prius Prime
Previously, the words "Prius" and "sexy" were rarely used in the same sentence. However, I think the wedge-shaped Prius Prime introduced for 2023 is much sexier than its frumpy predecessors. The sleek shape also pierces the wind better to improve efficiency. It&#8217;s lower to the ground than before...</description>
    </item>
    <item>
      <title>How to Choose a Computer Monitor (2025): Everything You Need to Know</title>
      <link>https://www.wired.com/story/how-to-choose-a-computer-monitor/</link>
      <pubDate>Wed, 24 Dec 2025 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">69446762ac80595d87684b6f</guid>
      <description>Monitors are cheaper, faster, and more beautiful than ever. Here&#8217;s how to choose one that will suit your needs and budget.</description>
    </item>
    <item>
      <title>The best shows and movies to stream on Netflix in 2025</title>
      <link>https://www.theverge.com/entertainment/845388/netflix-best-shows-movies-2025</link>
      <pubDate>2025-12-24T08:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=845388</guid>
      <description>Netflix has had an interesting year. Its ad tier, introduced last year, has grown significantly, and its live TV initiative has expanded to include not only weird one-offs like hot-dog-eating grudge matches but also WWE programming. Taking KPop Demon Hunters off Sony's hands for the business equivalent of $200 in a potato chip bag also [&#8230;]</description>
    </item>
    <item>
      <title>Pluribus Season 1s bombshell ending, explained</title>
      <link>https://mashable.com/article/pluribus-season-1-ending-explained-atom-bomb-stem-cell-radio-signal-8613</link>
      <pubDate>Wed, 24 Dec 2025 13:25:02 +0000</pubDate>
      <guid isPermaLink="false">05TGVGgVwfayqoM0TJdQYJW</guid>
      <description>The "Pluribus" Season 1 finale unites Carol (Rhea Seehorn) and Manousos (Carlos-Manuel Vesga) and drops several twists.</description>
    </item>
    <item>
      <title>Rhea Seehorn breaks down why The Left Hand of Darkness is so important to Pluribus</title>
      <link>https://mashable.com/article/pluribus-finale-the-left-hand-of-darkness-rhea-seehorn</link>
      <pubDate>Wed, 24 Dec 2025 13:24:42 +0000</pubDate>
      <guid isPermaLink="false">03gv1sK5PESuJmNXPMA6mn3</guid>
      <description>Ursula K. Le Guin's sci-fi classic "The Left Hand of Darkness" makes a cameo in "Pluribus" finale. Here's why it's so important.</description>
    </item>
    <item>
      <title>Orange am&#233;liore ses vieilles Livebox : elles vont consommer beaucoup moins d&#8217;&#233;nergie gr&#226;ce &#224; cette nouveaut&#233; bienvenue</title>
      <link>https://www.frandroid.com/marques/orange/2920541_orange-ameliore-ses-vieilles-livebox-elles-vont-consommer-beaucoup-moins-denergie-grace-a-cette-nouveaute-bienvenue</link>
      <pubDate>Wed, 24 Dec 2025 13:24:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/orange/2920541_orange-ameliore-ses-vieilles-livebox-elles-vont-consommer-beaucoup-moins-denergie-grace-a-cette-nouveaute-bienvenue</guid>
      <description>
Orange a entam&#233; le d&#233;ploiement d'une nouveaut&#233; logicielle int&#233;ressante vou&#233;e &#224; ses anciennes Livebox 4 et Livebox 5. Cette derni&#232;re leur permet d&#233;sormais de g&#233;rer dynamiquement la bande des 5 GHz pour faire d'importantes &#233;conomies d'&#233;nergie. 
</description>
    </item>
    <item>
      <title>The Pluribus cast unpacks Carol and Manousos tense meet-up: It says a lot about being human</title>
      <link>https://mashable.com/article/pluribus-season-1-finale-carol-manousos-rhea-seehorn-carlos-manuel-vesga</link>
      <pubDate>Wed, 24 Dec 2025 13:24:08 +0000</pubDate>
      <guid isPermaLink="false">01IjUf6eKH1GwcrJijn8Zwp</guid>
      <description>"Pluribus" stars Rhea Seehorn and Carlos-Manuel Vesga dive into Carol and Manousos' finale showdown.</description>
    </item>
    <item>
      <title>Rhea Seehorn on Carols explosive Pluribus finale choice: These people have crossed the line</title>
      <link>https://mashable.com/article/pluribus-finale-carol-atom-bomb-rhea-seehorn-interview</link>
      <pubDate>Wed, 24 Dec 2025 13:23:51 +0000</pubDate>
      <guid isPermaLink="false">02TRb6BaOJzV53VkDtYox2U</guid>
      <description>The "Pluribus" finale sees Carol obtain an atom bomb from the Others. But what does Rhea Seehorn think is next for her?</description>
    </item>
    <item>
      <title>C&#8217;est peut-&#234;tre la derni&#232;re offre avant No&#235;l pour la PS5 Slim : ce pack avec deux manettes chute sous les 500 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2920581_cest-peut-etre-la-derniere-offre-avant-noel-pour-la-ps5-slim-ce-pack-deux-manettes-chute-sous-les-500-e</link>
      <pubDate>Wed, 24 Dec 2025 13:21:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2920581_cest-peut-etre-la-derniere-offre-avant-noel-pour-la-ps5-slim-ce-pack-deux-manettes-chute-sous-les-500-e</guid>
      <description>
Compacte, dot&#233;e d'un espace de stockage confortable et toujours aussi performante, la PS5 Slim est bien plac&#233;e sur le podium des consoles next-gen. Si vous n'avez pas encore craqu&#233;, sachez qu'elle est actuellement, et s&#251;rement pour la derni&#232;re fois avant la fin des f&#234;tes de fin d'ann&#233;e 2025, en promo : PC Componentes la propose en pack &#224; 494,88 euros au lieu de 599,99 euros.
...</description>
    </item>
    <item>
      <title>On a essay&#233; la nouvelle Peugeot 308 &#233;lectrique restyl&#233;e, qui s&#8217;am&#233;liore sur un point en particulier</title>
      <link>https://www.frandroid.com/marques/peugeot/2887121_on-a-essaye-la-nouvelle-peugeot-308-electrique-restylee-qui-sameliore-sur-un-point-en-particulier</link>
      <pubDate>Wed, 24 Dec 2025 13:09:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/peugeot/2887121_on-a-essaye-la-nouvelle-peugeot-308-electrique-restylee-qui-sameliore-sur-un-point-en-particulier</guid>
      <description>
D&#233;voil&#233;e en 2023, l&#8217;actuelle g&#233;n&#233;ration de la Peugeot e-308 passe enfin par la case restylage. La voiture &#233;lectrique s&#8217;offre un style modernis&#233;, mais surtout, elle corrige l&#8217;un de ses plus gros d&#233;fauts. Nous en avons pris le volant, afin de savoir ce qu&#8217;elle vaut sur la route.
</description>
    </item>
    <item>
      <title>Le piratage de La Poste, une &#171;&#160;strat&#233;gie de sabotage&#160;&#187; qui risque de durer</title>
      <link>https://www.01net.com/actualites/piratage-la-poste-strategie-sabotage-vise-interets-francais.html</link>
      <pubDate>Wed, 24 Dec 2025 13:01:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317032</guid>
      <description>&#192; quelques heures de No&#235;l, La Poste reste prise en otage par une attaque DDoS qui s&#8217;&#233;ternise. Pour les experts, il s'agit d'une op&#233;ration de &#171; sabotage &#187; qui cherche &#224; nuire &#224; la France et aux millions de Fran&#231;ais qui attendent un colis. On fait le point sur la cyberattaque &#224; quelques heures du r&#233;veillon.</description>
    </item>
    <item>
      <title>How to redeem game codes on the Nintendo Switch 2</title>
      <link>https://www.engadget.com/gaming/nintendo/how-to-redeem-game-codes-on-the-nintendo-switch-2-130059847.html?src=rss</link>
      <pubDate>Wed, 24 Dec 2025 13:00:59 +0000</pubDate>
      <guid isPermaLink="false">a81f2c18-507d-4725-aaca-88daae260715</guid>
      <description>Digital game codes remain one of the simplest ways to add new titles to a Nintendo library. The Nintendo Switch 2 handles code redemption in a familiar way, building on the same process used on the original Switch. You can redeem a download code directly from the eShop on the console, or through a browser on a phone or desktop. Both routes link the purchase to the same Nintendo Account so the redeemed title appears on any compatible device tied to that account. The process is quick once you know where to look. Here is how to redeem game codes on Switch 2 through the console and online.
Things ...</description>
    </item>
    <item>
      <title>Samsung's latest Odyssey gaming monitor has a 32-inch 6K screen with glasses-free 3D</title>
      <link>https://www.engadget.com/computing/accessories/samsungs-latest-odyssey-gaming-monitor-has-a-32-inch-6k-screen-with-glasses-free-3d-130051748.html?src=rss</link>
      <pubDate>Wed, 24 Dec 2025 13:00:51 +0000</pubDate>
      <guid isPermaLink="false">907f23f2-3933-4b65-b5f7-864e897423fc</guid>
      <description>Ahead of CES 2026, Samsung has unveiled a number of impressive gaming monitors that flaunt 3D and very high refresh rates. The headliner is the 32-inch Odyssey 3D, "the world's first 6K display with glasses free 3D," according to Samsung. Along with the high resolution, it offers a 165Hz refresh rate (boosted to 330Hz through Dual Mode), along with a 1ms GtG response time. Optimized 3D effects that enhance terrain, distance and object separation "beyond 2D" will work with featured games like Stellar Blade and The First Berserker: Khazan," according to Samsung.
Another model, the 27-inch Odysse...</description>
    </item>
    <item>
      <title>In 2025, AI became a lightning rod for gamers and developers</title>
      <link>https://www.theverge.com/entertainment/848368/gen-ai-video-games-2025</link>
      <pubDate>2025-12-24T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=848368</guid>
      <description>2025 was the year generative AI made its presence felt in the video game industry. Its use has been discovered in some of the most popular games of the year, and CEOs from some of the largest game studios claim it's being implemented everywhere in the industry including in their own development processes. Meanwhile, rank-and-file [&#8230;]</description>
    </item>
    <item>
      <title>The Cosori 5L Rice Cooker review is a multifunctional appliance that delivers mixed results</title>
      <link>https://www.techradar.com/home/multi-cookers/cosori-5l-rice-cooker-review</link>
      <pubDate>Wed, 24 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">U6syvgu8gKrqgVwVCaVWV4</guid>
      <description>This rice cooker can steam, saut&#233;, and slow cook, but its rice cooking capabilities are somewhat disappointing</description>
    </item>
    <item>
      <title>Google Pixel phones need power and parity to fix a confusing product strategy in 2026</title>
      <link>https://www.techradar.com/phones/google-pixel-phones/google-pixel-phones-need-power-and-parity-to-fix-a-confusing-product-strategy-in-2026</link>
      <pubDate>Wed, 24 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">kFo3EM7bNdjdB94UatDA97</guid>
      <description>Google has positioned itself as the software lover&#8217;s choice when it comes to flagship phones &#8211; but there are some odd gaps between the standard and Pro handsets.</description>
    </item>
    <item>
      <title>The fifth dimension of design</title>
      <link>https://www.fastcompany.com/91464967/the-fifth-dimension-of-design</link>
      <pubDate>2025-12-24T13:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464967/the-fifth-dimension-of-design</guid>
      <description>Why time is the measure of true accessibility.
Michael Graves once said regarding a men&#8217;s suit, &#8220;You can buy a lot of cheap ones, or you can buy one great Armani suit.&#8221;</description>
    </item>
    <item>
      <title>Bo&#238;te de r&#233;ception | Pourriels, ChatGPT et Google Traduction</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-12-24/boite-de-reception/pourriels-chatgpt-et-google-traduction.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 24 Dec 2025 08:00:00 -0500</pubDate>
      <guid isPermaLink="false">84e3385e301f3d2f857b39131ab7d2d6</guid>
      <description>Chaque mercredi, notre journaliste r&#233;pond &#224; vos questions en lien avec le num&#233;rique et les nouvelles technologies. Cette semaine, on se demande qui combat les pourriels, on trouve les limites de l&#8217;intelligence artificielle sur son mobile et on d&#233;sactive la traduction dans Chrome.</description>
    </item>
    <item>
      <title>Voici ce que vous devez absolument activer si vous &#234;tes chez Free : la &#171;&#160;refonte&#160;&#187; 3G ne passe pas sur certains t&#233;l&#233;phones</title>
      <link>https://www.frandroid.com/marques/free/2920091_la-refonte-3g-de-free-tourne-au-cauchemar-pour-certains-smartphones</link>
      <pubDate>Wed, 24 Dec 2025 12:49:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2920091_la-refonte-3g-de-free-tourne-au-cauchemar-pour-certains-smartphones</guid>
      <description>
Votre t&#233;l&#233;phone affiche "4G", vos donn&#233;es fonctionnent, mais vos appels coupent ou n'aboutissent jamais ? Ne cherchez pas, ce n'est pas une panne temporaire. C'est structurel. Free est en train de transformer son r&#233;seau, et si votre smartphone n'est pas pr&#234;t, vous risquez bien plus qu'une conversation manqu&#233;e. 
</description>
    </item>
    <item>
      <title>Another image of the DJI Osmo Pocket 4 leaks &#8212; and it could come with a mysterious new accessory</title>
      <link>https://www.techradar.com/cameras/video-cameras/another-image-of-the-dji-osmo-pocket-4-leaks-and-it-could-come-with-a-mysterious-new-accessory</link>
      <pubDate>Wed, 24 Dec 2025 12:34:04 +0000</pubDate>
      <guid isPermaLink="false">tQKiWeRviGnCZpXUjxxxxX</guid>
      <description>We've got another sign of the DJI Osmo Pocket 4 and something called the DJI Osmo FrameTap.</description>
    </item>
    <item>
      <title>25 Work From Home Gift Ideas</title>
      <link>https://www.wired.com/gallery/work-from-home-gift-ideas/</link>
      <pubDate>Wed, 24 Dec 2025 12:30:00 +0000</pubDate>
      <guid isPermaLink="false">5db84ebc182de80009f7fe2b</guid>
      <description>Upgrade your loved one&#8217;s home office with these picks that make every day a little easier&#8212;and a little more fun.</description>
    </item>
    <item>
      <title>Save &#163;50 on Corsair&#8217;s top-tier VANGUARD PRO 96 Hall Effect Gaming Keyboard for Boxing Day</title>
      <link>https://www.techradar.com/computing/save-gbp50-on-corsairs-top-tier-vanguard-pro-96-hall-effect-gaming-keyboard-for-boxing-day</link>
      <pubDate>Wed, 24 Dec 2025 12:24:46 +0000</pubDate>
      <guid isPermaLink="false">WAnqzK6FaDi7mHp9WyjrKL</guid>
      <description>Save &#163;50 on Corsair&#8217;s top-tier VANGUARD PRO 96 Hall Effect Gaming Keyboard for Boxing Day</description>
    </item>
    <item>
      <title>Taking too many photos this year? Get Google's cloud storage for half price to keep them safe - or check out some of these other great deals</title>
      <link>https://www.techradar.com/computing/cloud-computing/taking-too-many-photos-this-year-get-googles-cloud-storage-for-half-price-to-keep-them-safe-or-check-out-some-of-these-other-great-deals</link>
      <pubDate>Wed, 24 Dec 2025 12:24:35 +0000</pubDate>
      <guid isPermaLink="false">XN263pahoM9fboRarg5vbH</guid>
      <description>If you'll be clogging up your camera roll with too many family videos this Christmas, check out this Google Cloud deal.</description>
    </item>
  </channel>
</rss>
