<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 03 Feb 2026 09:50:11 GMT</lastBuildDate>
    <item>
      <title>Cette batterie capable de &#171; respirer &#187; promet de r&#233;volutionner l&#8217;autonomie des voitures &#233;lectriques</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2963837_cette-batterie-capable-de-respirer-promet-de-revolutionner-lautonomie-des-voitures-electriques</link>
      <pubDate>Tue, 03 Feb 2026 09:48:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2963837_cette-batterie-capable-de-respirer-promet-de-revolutionner-lautonomie-des-voitures-electriques</guid>
      <description>
Des chercheurs chinois ont mis au point une batterie solide r&#233;volutionnaire pour les voitures &#233;lectriques. Capable de "respirer", elle devrait afficher une dur&#233;e de vie en tr&#232;s nette hausse.
</description>
    </item>
    <item>
      <title>&#171; Cela n&#8217;aurait pas d&#251; arriver &#187;&#160;: GOG revient sur sa banni&#232;re g&#233;n&#233;r&#233;e par IA</title>
      <link>https://www.frandroid.com/produits-android/console/2963795_cela-naurait-pas-du-arriver-gog-revient-sur-sa-banniere-generee-par-ia</link>
      <pubDate>Tue, 03 Feb 2026 09:47:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2963795_cela-naurait-pas-du-arriver-gog-revient-sur-sa-banniere-generee-par-ia</guid>
      <description>
Face &#224; l&#8217;ampleur de la pol&#233;mique, l&#8217;&#233;quipe derri&#232;re GOG se justifie d&#8217;avoir utilis&#233; des outils d&#8217;intelligence artificielle tout en comprenant qu&#8217;elle peut engendrer de la &#171; d&#233;ception &#187;. 
</description>
    </item>
    <item>
      <title>Cette semaine sur Twitch : 3 Matinales et un gros teasing &#224; ne pas rater</title>
      <link>https://www.frandroid.com/humanoid/emissions/2632585_cette-semaine-sur-twitch-3-matinales-et-un-gros-teasing-a-ne-pas-rater</link>
      <pubDate>Tue, 03 Feb 2026 09:46:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/emissions/2632585_cette-semaine-sur-twitch-3-matinales-et-un-gros-teasing-a-ne-pas-rater</guid>
      <description>
Notre programme Twitch de la semaine du lundi 2 f&#233;vier 2026, c&#8217;est juste ici : nous vous donnons rendez-vous, mardi, mercredi et jeudi sur notre cha&#238;ne Frandroidlive, principalement pour nos Matinales Tech". Mais attention, un teasing in&#233;dit aura aussi lieu. 
</description>
    </item>
    <item>
      <title>Google Home&#160;: ces nouveaux d&#233;clencheurs vont booster vos automatisations</title>
      <link>https://www.01net.com/actualites/google-home-nouveaux-declencheurs-booster-automatisations.html</link>
      <pubDate>Tue, 03 Feb 2026 09:43:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323874</guid>
      <description>La derni&#232;re mise &#224; jour de Google Home ajoute de nouvelles options pour les automatisations et en profite pour r&#233;soudre un probl&#232;me r&#233;current des vid&#233;os.</description>
    </item>
    <item>
      <title>Voiture &#233;lectrique : pourquoi les records de ventes cachent une r&#233;alit&#233; bien plus fragile en France</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2963807_voiture-electrique-pourquoi-les-records-de-ventes-cachent-une-realite-bien-plus-fragile-en-france</link>
      <pubDate>Tue, 03 Feb 2026 09:36:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2963807_voiture-electrique-pourquoi-les-records-de-ventes-cachent-une-realite-bien-plus-fragile-en-france</guid>
      <description>
Alors que l&#8217;ann&#233;e 2025 a vu les ventes de voitures &#233;lectriques progresser tr&#232;s nettement en France, 2026 d&#233;marre aussi tr&#232;s bien. Cette motorisation affichait en janvier une part de march&#233; de 28&#160;% sur notre territoire.
</description>
    </item>
    <item>
      <title>Quelles sont les meilleures manettes Xbox en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-gaming/1343671_les-meilleures-manettes-pour-xbox-a-choisir</link>
      <pubDate>Tue, 03 Feb 2026 09:25:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-gaming/1343671_les-meilleures-manettes-pour-xbox-a-choisir</guid>
      <description>
Vous poss&#233;dez une Xbox Series X ou S, ou une Xbox One, et vous avez besoin d'une nouvelle manette Xbox ? Vous avez l'embarras du choix. On explore tout ceci avec ce guide des meilleures manettes pour votre Xbox. 
</description>
    </item>
    <item>
      <title>Espionnage sur Windows&#160;: des hackers russes exploitent une faille de Microsoft Office</title>
      <link>https://www.01net.com/actualites/espionnage-windows-hackers-russes-exploitent-faille-microsoft-office.html</link>
      <pubDate>Tue, 03 Feb 2026 09:22:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323862</guid>
      <description>Des pirates russes exploitent une faille critique de Microsoft Office pour mener des op&#233;rations d&#8217;espionnage sur Windows. En s&#8217;appuyant sur de simples documents Word pi&#233;g&#233;s envoy&#233;s par e&#8209;mail, ils parviennent &#224; voler des documents sensibles relatifs &#224; la guerre en Ukraine. Cette br&#232;che permet de contourner les protections int&#233;gr&#233;es par Microsoft et de prendre le contr&#244;le &#224; distance d&#8217;un ordinateur, sans que la victime ne clique sur quoi que ce soit......</description>
    </item>
    <item>
      <title>BYD lance une nouvelle marque de voitures &#233;lectriques &#224; prix cass&#233; pour les taxis en Chine</title>
      <link>https://www.frandroid.com/marques/byd/2963779_byd-lance-une-nouvelle-marque-de-voitures-electriques-a-prix-casse-pour-la-chine</link>
      <pubDate>Tue, 03 Feb 2026 09:21:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2963779_byd-lance-une-nouvelle-marque-de-voitures-electriques-a-prix-casse-pour-la-chine</guid>
      <description>
C&#8217;est officiel, BYD propose enfin son service de VTC en Chine. Baptis&#233; Linghui, ce dernier va proposer &#224; la vente des voitures &#233;lectriques "in&#233;dites", et &#224; tr&#232;s bas prix, pour les chauffeurs.
</description>
    </item>
    <item>
      <title>Fnac et Darty : voici les 16 bonnes affaires &#224; d&#233;nicher pour le dernier jour des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-voici-les-16-bonnes-affaires-a-denicher-pour-le-dernier-jour-des-soldes</link>
      <pubDate>Tue, 03 Feb 2026 09:21:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-voici-les-16-bonnes-affaires-a-denicher-pour-le-dernier-jour-des-soldes</guid>
      <description>
Ce mardi 3 f&#233;vrier sonne la fin des soldes, il vous reste donc plus que quelques heures pour faire de bonnes affaires. La Fnac et Darty se donnent une derni&#232;re fois &#224; fond pour brader un tas de produits Tech. Voici les offres &#224; retenir. 
</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : voici les ultimes offres &#224; saisir pour ce dernier jour de promotions</title>
      <link>https://www.frandroid.com/bons-plans/2957561_soldes-dhiver-2026-voici-les-ultimes-offres-a-saisir-pour-ce-dernier-jour-de-promotions</link>
      <pubDate>Tue, 03 Feb 2026 09:16:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2957561_soldes-dhiver-2026-voici-les-ultimes-offres-a-saisir-pour-ce-dernier-jour-de-promotions</guid>
      <description>
Il ne faut pas se le cacher, la derni&#232;re d&#233;marque des soldes est souvent le moment o&#249; l'on trouve les meilleures offres, car les e-commer&#231;ants comme Amazon, Fnac, Darty ou encore Boulanger veulent &#233;couler les derniers stocks. Et c'est encore plus le cas pendant le dernier jour de l'&#233;v&#233;nement... 
</description>
    </item>
    <item>
      <title>This simple setting changed how I used ChatGPT forever &#8212; and it's so good you'll want to try it too</title>
      <link>https://www.techradar.com/ai-platforms-assistants/this-simple-setting-changed-how-i-used-chatgpt-forever-and-its-so-good-youll-want-to-try-it-too</link>
      <pubDate>Tue, 03 Feb 2026 09:12:40 +0000</pubDate>
      <guid isPermaLink="false">bt5qv88nJFLvo6RHDWVTwX</guid>
      <description>Turning on ChatGPT's voice mode with a custom voice setting completely redefines how users engage with AI.</description>
    </item>
    <item>
      <title>Elle cartonne en Chine : la Geely EX2 d&#233;barque chez nous contre la Renault 5 &#233;lectrique</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2963767_elle-cartonne-en-chine-la-geely-ex2-debarque-chez-nous-contre-la-renault-5-electrique</link>
      <pubDate>Tue, 03 Feb 2026 09:10:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2963767_elle-cartonne-en-chine-la-geely-ex2-debarque-chez-nous-contre-la-renault-5-electrique</guid>
      <description>
Le groupe Geely veut arriver en force en Europe, et va bient&#244;t y commercialiser son EX2. Une petite voiture &#233;lectrique ultra-abordable, qui rivalisera avec la Renault 5 E-Tech.
</description>
    </item>
    <item>
      <title>AirPods Pro 3 : les excellents &#233;couteurs d&#8217;Apple sont &#224; un super prix pour le dernier jour des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2862267_airpods-pro-3-les-excellents-ecouteurs-dapple-sont-a-un-super-prix-pour-le-dernier-jour-des-soldes</link>
      <pubDate>Tue, 03 Feb 2026 09:08:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2862267_airpods-pro-3-les-excellents-ecouteurs-dapple-sont-a-un-super-prix-pour-le-dernier-jour-des-soldes</guid>
      <description>
Les AirPods Pro 3 cumulent les qualit&#233;s : performance acoustique, r&#233;duction de bruit active, autonomie, int&#233;gration dans l'&#233;cosyst&#232;me Apple... Ils cochent toutes les cases. Et pour ce dernier jours des soldes d'hiver, vous les trouverez &#224; 214,99 euros au lieu de 249 euros gr&#226;ce &#224; un code promo sur Cdiscount. 
</description>
    </item>
    <item>
      <title>Neige et smartphone&#160;: pourquoi votre appli M&#233;t&#233;o se trompe (presque) toujours</title>
      <link>https://www.01net.com/actualites/neige-et-smartphone-pourquoi-votre-appli-meteo-se-trompe-presque-toujours.html</link>
      <pubDate>Tue, 03 Feb 2026 09:03:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323849</guid>
      <description>Vous avez re&#231;u une alerte neige apocalyptique sur votre smartphone ? Prudence. Entre mod&#232;les globaux peu sensibles &#224; nos reliefs et manque d'analyse humaine, les applis natives peuvent dramatiser la situation. Voici pourquoi il ne faut pas les croire sur parole.</description>
    </item>
    <item>
      <title>Ce petit d&#233;tail est vraiment tr&#232;s pratique sur le nouveau casque &#224; conduction osseuse de T&#8217;nb</title>
      <link>https://www.frandroid.com/produits-android/audio/2963739_ce-petit-detail-est-vraiment-tres-pratique-sur-le-nouveau-casque-a-conduction-osseuse-de-tnb</link>
      <pubDate>Tue, 03 Feb 2026 08:50:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/audio/2963739_ce-petit-detail-est-vraiment-tres-pratique-sur-le-nouveau-casque-a-conduction-osseuse-de-tnb</guid>
      <description>La marque fran&#231;aise T&#8217;nb, install&#233;e &#224; Salon-de-Provence, pr&#233;sente deux nouveaux accessoires audio destin&#233;s aux sportifs. Disponibles en f&#233;vrier 2026, les mod&#232;les Energy Light et Energy Buds ciblent diff&#233;rents profils d&#8217;utilisateurs avec des technologies et des formats distincts. Les &#233;couteurs ou casques &#224; conduction osseuse repr&#233;sente certains avantages dont ceux du confort et de pouvoir rester [&#8230;]...</description>
    </item>
    <item>
      <title>Decathlon d&#233;gaine un nouveau v&#233;lo &#233;lectrique &#224; moins de 1000 &#8364; : voici le Rockrider E-EXPL 100</title>
      <link>https://www.frandroid.com/marques/decathlon/2963811_decathlon-degaine-un-nouveau-velo-electrique-a-moins-de-1000-e-voici-le-rockrider-e-expl-100</link>
      <pubDate>Tue, 03 Feb 2026 08:49:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/decathlon/2963811_decathlon-degaine-un-nouveau-velo-electrique-a-moins-de-1000-e-voici-le-rockrider-e-expl-100</guid>
      <description>
Decathlon ajoute une nouvelle r&#233;f&#233;rence &#224; sa gamme de VTT &#233;lectriques avec le Rockrider E-EXPL 100, un mod&#232;le affich&#233; &#224; moins de 1 000 euros et destin&#233; &#224; une pratique accessible du VTTAE.
</description>
    </item>
    <item>
      <title>J&#8217;ai pris 1G en Porsche Cayenne &#233;lectrique&#160;: c&#8217;est pas humain&#160;!</title>
      <link>https://www.01net.com/actualites/jai-pris-1g-en-porsche-cayenne-electrique-cest-pas-humain.html</link>
      <pubDate>Tue, 03 Feb 2026 08:45:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323742</guid>
      <description>A quelques mois des essais officiels du Porsche Cayenne &#233;lectrique, nous avons eu l'opportunit&#233; de monter &#224; bord de la b&#234;te. Quelques tours de circuits et de tr&#232;s grosses sensations. R&#233;cit en acc&#233;l&#233;r&#233;.</description>
    </item>
    <item>
      <title>Cette tache solaire grandit &#224; une vitesse folle&#8230; et vient de d&#233;clencher l&#8217;une des plus puissantes &#233;ruptions du cycle</title>
      <link>https://www.futura-sciences.com/sciences/actualites/eruption-solaire-cette-tache-solaire-grandit-vitesse-folle-vient-declencher-plus-puissantes-eruptions-cycle-130847/#xtor%3DRSS-8</link>
      <pubDate>Tue, 03 Feb 2026 09:43:40 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/eruption-solaire-cette-tache-solaire-grandit-vitesse-folle-vient-declencher-plus-puissantes-eruptions-cycle-130847/#xtor%3DRSS-8</guid>
      <description>Sur notre Soleil, une nouvelle tache s&#8217;est brutalement r&#233;veill&#233;e. Ces derni&#232;res heures, elle est entr&#233;e plusieurs fois en &#233;ruption. Et une fois d&#233;j&#224;, de mani&#232;re spectaculaire.&#160;De quoi esp&#233;rer &#8211; ou redouter &#8211; une nouvelle temp&#234;te solaire m&#233;morable dans les jours &#224; venir.</description>
    </item>
    <item>
      <title>The Switch just surpassed the DS as Nintendo's best-selling console ever</title>
      <link>https://www.engadget.com/gaming/nintendo/the-switch-just-surpassed-the-ds-as-nintendos-best-selling-console-ever-083700901.html?src=rss</link>
      <pubDate>Tue, 03 Feb 2026 08:37:00 +0000</pubDate>
      <guid isPermaLink="false">4bb11cfd-c37c-46ab-b89a-12ca88c0c657</guid>
      <description>The original Switch just became Nintendo&#8217;s best-selling console ever with 155.37 million units as of December 31, 2025, overtaking the DS which sold 154.02 million units from 2004-2011. It was part of a holiday surge that saw the company move 7.01 million Switch 2s (and 17.37 million through Q3 of its fiscal year), making it the &#8220;fastest-selling dedicated video platform released by Nintendo to date,&#8221; the company said in its earnings report. Despite being supplanted by the Switch 2, the Switch keeps selling decently (1.36 million units in Q3 fiscal 2026), due to its relatively cheap price. Nint...</description>
    </item>
    <item>
      <title>La Nintendo Switch marque l&#8217;histoire : elle devient officiellement la console la plus vendue de la marque</title>
      <link>https://www.frandroid.com/actualites-generales/2963799_la-nintendo-switch-marque-lhistoire-elle-devient-officiellement-la-console-la-plus-vendue-de-la-marque</link>
      <pubDate>Tue, 03 Feb 2026 08:35:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2963799_la-nintendo-switch-marque-lhistoire-elle-devient-officiellement-la-console-la-plus-vendue-de-la-marque</guid>
      <description>
Nintendo a d&#233;voil&#233; les chiffres de vente de sa Switch. Lanc&#233;e en 2017, la console a d&#233;sormais d&#233;pass&#233; les chiffres de vente de la Nintendo DS et devient la console la plus vendue de l'histoire du constructeur. 
</description>
    </item>
    <item>
      <title>Copilot partout, satisfaction nulle part&#160;: Microsoft r&#233;duirait enfin la voilure sur l&#8217;IA dans Windows 11</title>
      <link>https://www.01net.com/actualites/copilot-partout-satisfaction-nulle-part-microsoft-reduirait-enfin-la-voilure-sur-lia-dans-windows-11.html</link>
      <pubDate>Tue, 03 Feb 2026 08:29:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323846</guid>
      <description>Microsoft a pass&#233; la majeure partie de ces derniers mois (ann&#233;es ?) &#224; int&#233;grer de l'IA g&#233;n&#233;rative au chausse-pied dans Windows 11. Certaines fonctions de Copilot sont probablement utiles, d'autres sont redondantes, n'ont aucun int&#233;r&#234;t, ou ne sont l&#224; que pour faire joli. Il semble que les innombrables critiques des utilisateurs aient fini par porter leurs fruits....</description>
    </item>
    <item>
      <title>Amazon brade &#224; -25 % cette batterie externe de 20 000 mAh capable de recharger 3 appareils et devient un indispensable</title>
      <link>https://www.frandroid.com/marques/2963569_amazon-brade-a-25-cette-batterie-externe-de-20-000-mah-capable-de-recharger-3-appareils-et-devient-un-indispensable</link>
      <pubDate>Tue, 03 Feb 2026 08:12:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2963569_amazon-brade-a-25-cette-batterie-externe-de-20-000-mah-capable-de-recharger-3-appareils-et-devient-un-indispensable</guid>
      <description>
&#192; la recherche d'une batterie externe efficace pour recharger plusieurs de vos appareils ? Celle propos&#233;e par Ugreen avec 20 000 mAh, deux ports USB-C et un port USB-A semble toute trouv&#233;e : bonne nouvelle, elle est brad&#233;e &#224; -25 % sur Amazon. 
</description>
    </item>
    <item>
      <title>Ce que le nouveau NFC va changer pour vous</title>
      <link>https://www.01net.com/actualites/ce-que-le-nouveau-nfc-va-changer-pour-vous.html</link>
      <pubDate>Tue, 03 Feb 2026 08:01:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323843</guid>
      <description>Port&#233;e plus grande, recharge plus g&#233;n&#233;reuse, d&#233;bits multipli&#233;s : avec sa &#171; release 15 &#187;, le NFC Forum promet une &#233;volution profonde de la technologie sans contact. Toutes ces innovations ne verront pas imm&#233;diatement le jour, mais elle annonce des changements importants pour tous les utilisateurs.</description>
    </item>
    <item>
      <title>The best Bluetooth trackers for 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-bluetooth-tracker-140028377.html?src=rss</link>
      <pubDate>Tue, 03 Feb 2026 08:00:35 +0000</pubDate>
      <guid isPermaLink="false">63b124f8-265d-49a7-9d11-52e671bec0c6</guid>
      <description>Most people think of AirTags when they picture a Bluetooth tracker. And indeed, Apple&#8217;s little white discs were once the only capable option, relying on a vast finding network of nearby iPhones to pinpoint lost tags. But now Google has a finding network of its own, and third party brands like Chipolo, Hyper and Pebblebee have trackers that pair with your choice of Google or Apple&#8217;s network. That means you&#8217;ve got a lot of options for tagging and tracking your keys, backpacks, luggage and more. We tested the major brands out there to see how well they work, how loud they are and how they look to...</description>
    </item>
  </channel>
</rss>
