<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 04 Dec 2025 08:35:03 GMT</lastBuildDate>
    <item>
      <title>Ce botnet est responsable de la pire attaque DDoS de l&#8217;histoire d&#8217;Internet</title>
      <link>https://www.01net.com/actualites/botnet-responsable-attaque-ddos-puissante-temps.html</link>
      <pubDate>Thu, 04 Dec 2025 08:31:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313635</guid>
      <description>Un gigantesque botnet appel&#233; Aisuru enchaine les cyberattaques. Au 3&#7497; trimestre 2025, il a orchestr&#233; plus de 1&#8239;300 attaques DDoS. Il a aussi et surtout d&#233;ploy&#233; une attaque record. D&#233;jou&#233;e par Cloudflare, l'offensive provenait de millions d'appareils pirat&#233;s&#8230;</description>
    </item>
    <item>
      <title>19 mod&#232;les de v&#233;lo en location et des prix pour tout le monde : V&#233;ligo entre dans une nouvelle dimension</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2897705_19-modeles-de-velo-en-location-et-des-prix-pour-tout-le-monde-veligo-entre-dans-une-nouvelle-dimension</link>
      <pubDate>Thu, 04 Dec 2025 08:27:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2897705_19-modeles-de-velo-en-location-et-des-prix-pour-tout-le-monde-veligo-entre-dans-une-nouvelle-dimension</guid>
      <description>
Apr&#232;s 6 ans de succ&#232;s, le service de location de v&#233;los &#233;lectriques V&#233;ligo passe &#224; 19 mod&#232;les diff&#233;rents, dont des cargos professionnels et adapt&#233;s, avec une offre jusqu&#8217;&#224; 12 mois d&#232;s janvier 2026.
</description>
    </item>
    <item>
      <title>Un des plus grands t&#233;lescopes du monde est en danger, et ces scientifiques veulent le sauver</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-plus-grands-telescopes-monde-danger-ces-scientifiques-veulent-sauver-128192/#xtor%3DRSS-8</link>
      <pubDate>Thu, 04 Dec 2025 09:07:49 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-plus-grands-telescopes-monde-danger-ces-scientifiques-veulent-sauver-128192/#xtor%3DRSS-8</guid>
      <description>Menac&#233; par une construction industrielle proche du&#160;lieu, l'observatoire Paranal, dans le d&#233;sert d'Atacama au Chili, re&#231;oit le soutien de nombreux scientifiques internationaux, dont plusieurs prix Nobel. Tous esp&#232;rent faire reculer le gouvernement chilien qui a autoris&#233; le chantier.</description>
    </item>
    <item>
      <title>La fin de Meta AI dans WhatsApp&#8201;? L&#8217;Union europ&#233;enne y songe</title>
      <link>https://www.frandroid.com/marques/meta/2897971_la-fin-de-meta-ai-dans-whatsapp-lunion-europeenne-y-songe</link>
      <pubDate>Thu, 04 Dec 2025 08:02:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2897971_la-fin-de-meta-ai-dans-whatsapp-lunion-europeenne-y-songe</guid>
      <description>
Si l&#8217;on en croit les informations r&#233;v&#233;l&#233;es par le Financial Times, l&#8217;Union europ&#233;enne ne devrait pas tarder &#224; ouvrir une enqu&#234;te sur Meta pour abus de position dominante &#224; cause du forcing de son robot conversationnel au sein de WhatsApp.
</description>
    </item>
    <item>
      <title>Gemini was Google&#8217;s top trending search term in 2025</title>
      <link>https://techcrunch.com/2025/12/04/gemini-was-googles-top-trending-search-term-in-2025/</link>
      <pubDate>Thu, 04 Dec 2025 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3072303</guid>
      <description>Gemini wasn&#8217;t the only AI chatbot to make the list, as DeepSeek ranked seventh among the year&#8217;s trending searches.</description>
    </item>
    <item>
      <title>The Abandons review: New Netflix western is no Yellowstone, but Gillian Anderson shines</title>
      <link>https://www.techradar.com/streaming/netflix/the-abandons-review</link>
      <pubDate>Thu, 04 Dec 2025 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">xGppb9qZ3aS3w5BBzHmi3a</guid>
      <description>Going up against the Taylor Sheridanverse is a bold move, even for Netflix. But while the new western The Abandons is solid, it pales in comparison.</description>
    </item>
    <item>
      <title>Working mothers are still being left out of career growth. How we can fix that</title>
      <link>https://www.fastcompany.com/91447522/mothers-dont-just-face-a-pay-gap-they-face-a-training-gap-too</link>
      <pubDate>2025-12-04T08:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91447522/mothers-dont-just-face-a-pay-gap-they-face-a-training-gap-too</guid>
      <description>Why mothers fall into this gap, how it hurts companies, and the businesses pursuing ideas and policies that offer a solution. 
It&#8217;s a tale as old as the modern workplace: In the 1960s, women entered the workforce en masse, ready to compete with their male counterparts for promotions, pay, and opportunity&#8212;only to find the system wasn&#8217;t built for them.&#160;...</description>
    </item>
    <item>
      <title>On a essay&#233; l&#8217;Alpine A390 : tout simplement la plus puissante des voitures &#233;lectriques fran&#231;aises avec 3 moteurs</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2883697_on-a-essaye-lalpine-a390-tout-simplement-la-plus-puissante-des-voitures-electriques-francaises-avec-3-moteurs</link>
      <pubDate>Thu, 04 Dec 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2883697_on-a-essaye-lalpine-a390-tout-simplement-la-plus-puissante-des-voitures-electriques-francaises-avec-3-moteurs</guid>
      <description>
Nous avons test&#233; l'Alpine A390, la deuxi&#232;me voiture &#233;lectrique de la marque sportive fran&#231;aise. Elle veut cumuler une exp&#233;rience de conduite au meilleur niveau avec une r&#233;elle polyvalence, mais y parvient-elle ? Voici notre avis.
</description>
    </item>
    <item>
      <title>01net Awards&#160;: le meilleur casque audio de l&#8217;ann&#233;e est&#8230;</title>
      <link>https://www.01net.com/actualites/01net-awards-le-meilleur-casque-audio-de-lannee-est.html</link>
      <pubDate>Thu, 04 Dec 2025 07:59:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313562</guid>
      <description>La r&#233;daction de 01net.com d&#233;signe les meilleurs produits de l&#8217;ann&#233;e. D&#233;couvrez tous les jours les vainqueurs de chaque cat&#233;gorie jusqu&#8217;&#224; la remise des prix le 11 d&#233;cembre, en live s&#8217;il vous plait !</description>
    </item>
    <item>
      <title>I installed the TerraMaster D4&#8209;320U into my studio, and it proved to be a fast way to boost on-site data storage</title>
      <link>https://www.techradar.com/computing/terramaster-d4-320u-nas-review</link>
      <pubDate>Thu, 04 Dec 2025 07:47:00 +0000</pubDate>
      <guid isPermaLink="false">uB7c2xUhkiuTUCZEstPwKN</guid>
      <description>Designed for rack mounting, this 4-bay direct-attached storage (DAS) offers an easy way to quickly boost desktop or NAS storage. The D4-320U is built for pure simplicity, bolts directly into a standard rack, and offers four bays that will take 3.5-inch or 2.5-inch SATA drives, then connects directly to your NAS or computer through a simple USB cable....</description>
    </item>
    <item>
      <title>Google Photos va enfin accueillir la fonctionnalit&#233; qui lui manquait</title>
      <link>https://www.frandroid.com/marques/google/2897931_google-photos-va-enfin-accueillir-la-fonctionnalite-qui-lui-manquait</link>
      <pubDate>Thu, 04 Dec 2025 07:45:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2897931_google-photos-va-enfin-accueillir-la-fonctionnalite-qui-lui-manquait</guid>
      <description>
Retouchez vos cernes, vos yeux, dents et l&#232;vres dans Google Photos gr&#226;ce &#224; cette future fonctionnalit&#233;.
</description>
    </item>
    <item>
      <title>Google inaugure une nouvelle fonction IA et &#231;a tourne au fiasco</title>
      <link>https://www.01net.com/actualites/google-teste-nouvelle-fonction-ia-tourne-fiasco.html</link>
      <pubDate>Thu, 04 Dec 2025 07:30:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313473</guid>
      <description>Google a demand&#233; &#224; son IA de r&#233;&#233;crire les titres dans Discover. Le g&#233;ant du web cherchait &#224; faciliter la vie des internautes, mais l&#8217;exp&#233;rience a tourn&#233; au fiasco.</description>
    </item>
    <item>
      <title>P&#233;nurie de m&#233;moire : ce constructeur historique jette l&#8217;&#233;ponge, c&#8217;est une tr&#232;s mauvaise nouvelle, la crise va empirer</title>
      <link>https://www.frandroid.com/produits-android/hardware/memoire/2897875_penurie-de-memoire-ce-constructeur-historique-jette-leponge-cest-une-tres-mauvaise-nouvelle-la-crise-va-empirer</link>
      <pubDate>Thu, 04 Dec 2025 07:28:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/memoire/2897875_penurie-de-memoire-ce-constructeur-historique-jette-leponge-cest-une-tres-mauvaise-nouvelle-la-crise-va-empirer</guid>
      <description>
C'est une v&#233;ritable crise dans la crise. Alors que les prix de la m&#233;moire vive flambent, le constructeur historique Crucial annonce son retrait du march&#233; grand public.
</description>
    </item>
    <item>
      <title>&#192; peine d&#233;barqu&#233; sur le march&#233;, le Realme GT 8 Pro premium est d&#233;j&#224; &#224; prix cass&#233;, seul ou en pack avec des &#233;couteurs offerts</title>
      <link>https://www.frandroid.com/bons-plans/2897139_a-peine-debarque-sur-le-marche-le-realme-gt-8-pro-premium-est-deja-a-prix-casse-seul-ou-en-pack-avec-des-ecouteurs-offerts</link>
      <pubDate>Thu, 04 Dec 2025 07:24:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2897139_a-peine-debarque-sur-le-marche-le-realme-gt-8-pro-premium-est-deja-a-prix-casse-seul-ou-en-pack-avec-des-ecouteurs-offerts</guid>
      <description>
C'est l'un des deals les plus chauds de l'apr&#232;s-Black Friday, sur un smartphone tout chaud sorti du four : le realme GT8 Pro 12+256 Go est &#224; 899 euros au lieu de 999,99 euros sur Amazon. Il existe aussi en pack en version 512 Go avec des &#233;couteurs et un chargeur pour 1 099,99 euros au lieu de 1 199,99 euros.
</description>
    </item>
    <item>
      <title>Quels sont les meilleurs scooters &#233;lectriques de 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-survoltes/guides-dachat-scooters-electriques/814124_guide-achat-meilleurs-scooters-electriques</link>
      <pubDate>Thu, 04 Dec 2025 07:11:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-survoltes/guides-dachat-scooters-electriques/814124_guide-achat-meilleurs-scooters-electriques</guid>
      <description>
Comme l'automobile, le monde du deux-roues se tourne aussi vers l'&#233;lectrique et les fabricants de scooters sont nombreux &#224; proposer des mod&#232;les 100&#160;% &#233;lectriques. Voici une s&#233;lection des meilleurs scooters &#233;lectriques disponibles sur le march&#233;.
</description>
    </item>
    <item>
      <title>Google Chrome d&#233;voile ses meilleures extensions de 2025</title>
      <link>https://www.01net.com/actualites/google-chrome-devoile-meilleures-extensions-2025.html</link>
      <pubDate>Thu, 04 Dec 2025 07:00:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313626</guid>
      <description>Google d&#233;voile son classement des meilleures extensions Chrome de 2025. Une s&#233;lection qui fait la part belle aux assistants IA int&#233;gr&#233;s directement dans le navigateur.</description>
    </item>
    <item>
      <title>Your company just had layoffs. Can you still ask for a raise?</title>
      <link>https://www.fastcompany.com/91447588/workers-are-afraid-to-ask-for-raises-promotions-perks-they-shouldnt-be</link>
      <pubDate>2025-12-04T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91447588/workers-are-afraid-to-ask-for-raises-promotions-perks-they-shouldnt-be</guid>
      <description>Just because the job market is rocky doesn&#8217;t mean the conversation shouldn&#8217;t happen.
In today&#8217;s job market, many employees are feeling the pressure.</description>
    </item>
    <item>
      <title>The choice to be interviewed by a human or AI could hurt some job candidates</title>
      <link>https://www.fastcompany.com/91453764/choosing-between-a-human-or-ai-interviewer-could-hurt-job-candidates</link>
      <pubDate>2025-12-04T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91453764/choosing-between-a-human-or-ai-interviewer-could-hurt-job-candidates</guid>
      <description>A new University of Chicago analysis finds that a candidate&#8217;s choice of an AI or human interviewer unintentionally signals their strengths and weaknesses.
Companies are increasingly using AI to conduct job interviews, and, according to experts in the field, the technology is leading to some impressive results. However, giving candidates the choice between an AI interviewer or a human can create bias that makes landing a job tougher for some people, according to a new report....</description>
    </item>
    <item>
      <title>Google &#233;tablit sa liste des meilleures extensions Chrome de 2025&#160;: l&#8217;IA partout, tout le temps</title>
      <link>https://www.frandroid.com/marques/google/2897911_google-etablit-sa-liste-des-meilleures-extensions-chrome-de-2025-lia-partout-tout-le-temps</link>
      <pubDate>Thu, 04 Dec 2025 06:48:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2897911_google-etablit-sa-liste-des-meilleures-extensions-chrome-de-2025-lia-partout-tout-le-temps</guid>
      <description>
Pour c&#233;l&#233;brer les f&#234;tes de fin d&#8217;ann&#233;e qui arrivent bient&#244;t, Google a dress&#233; un classement de ce que l&#8217;entreprise consid&#232;re &#234;tre les dix meilleures extensions Chrome de l&#8217;ann&#233;e&#160;2025. Le constat est clair&#160;: le g&#233;ant de la recherche veut vous faire utiliser l&#8217;IA.
</description>
    </item>
    <item>
      <title>Li Auto, les voitures chinoises qui se recharge en 12 minutes, lance ses propres lunettes avec de l&#8217;IA int&#233;gr&#233;e</title>
      <link>https://www.frandroid.com/marques/li-auto/2897311_li-auto-les-voitures-chinoises-qui-se-recharge-en-12-minutes-lance-ses-propres-lunettes-avec-de-lia-integree</link>
      <pubDate>Thu, 04 Dec 2025 06:46:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/li-auto/2897311_li-auto-les-voitures-chinoises-qui-se-recharge-en-12-minutes-lance-ses-propres-lunettes-avec-de-lia-integree</guid>
      <description>
Le constructeur chinois Li Auto &#233;largit son univers avec le lancement des Livis, des lunettes intelligentes destin&#233;es &#224; faire d&#233;couvrir son &#233;cosyst&#232;me autour de l'intelligence artificielle bien au-del&#224; de ses voitures.
</description>
    </item>
    <item>
      <title>Le nombre d&#8217;appels masqu&#233;s ind&#233;sirables risque d&#8217;exploser &#224; partir de janvier</title>
      <link>https://www.01net.com/actualites/le-nombre-dappels-masques-indesirables-risque-dexploser-a-partir-de-janvier.html</link>
      <pubDate>Thu, 04 Dec 2025 06:35:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313624</guid>
      <description>L&#8217;Arcep vient d&#8217;annoncer une modification dans son plan national de num&#233;rotation. Le gendarme des t&#233;l&#233;coms passera automatiquement certains appels n&#8217;ayant pu &#234;tre authentifi&#233;s en appels masqu&#233;s.</description>
    </item>
  </channel>
</rss>
