<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 20 Jan 2026 08:38:52 GMT</lastBuildDate>
    <item>
      <title>Bien choisir sa toile de vid&#233;oprojecteur&#160;: nos conseils</title>
      <link>https://www.frandroid.com/produits-android/tv-connectee-produits/projecteur/2948013_bien-choisir-sa-toile-de-videoprojecteur-nos-conseils</link>
      <pubDate>Tue, 20 Jan 2026 08:37:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/tv-connectee-produits/projecteur/2948013_bien-choisir-sa-toile-de-videoprojecteur-nos-conseils</guid>
      <description>
Pour une image de cin&#233;ma &#224; domicile, rien ne vaut une toile de projection&#8239;: parfaitement lisse et optimis&#233;e pour le contraste et la fid&#233;lit&#233; des couleurs, elle surclasse un mur blanc, qui reste une solution pratique mais peu qualitative pour les passionn&#233;s.
</description>
    </item>
    <item>
      <title>Starlink : attention, Elon Musk se sert dans vos donn&#233;es pour nourrir son IA</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2948393_starlink-attention-elon-musk-se-sert-dans-vos-donnees-pour-nourrir-son-ia</link>
      <pubDate>Tue, 20 Jan 2026 08:26:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2948393_starlink-attention-elon-musk-se-sert-dans-vos-donnees-pour-nourrir-son-ia</guid>
      <description>
Vous avez un abonnement Starlink ? Vous travaillez peut-&#234;tre gratuitement pour Elon Musk depuis ce matin. SpaceX vient d'activer une nouvelle clause dans sa politique de confidentialit&#233; : l'utilisation de vos donn&#233;es pour entra&#238;ner l'IA. 
</description>
    </item>
    <item>
      <title>Alerte Google Agenda et Gemini&#160;: une faille de s&#233;curit&#233; menace votre vie priv&#233;e</title>
      <link>https://www.01net.com/actualites/alerte-google-agenda-gemini-faille-securite-menace-vie-privee.html</link>
      <pubDate>Tue, 20 Jan 2026 08:22:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321121</guid>
      <description>Une simple invitation Google Agenda peut suffire &#224; faire d&#233;railler Gemini. Des chercheurs ont d&#233;montr&#233; qu'il &#233;tait possible de manipuler l'IA g&#233;n&#233;rative en glissant des instructions cach&#233;es dans la description d'un &#233;v&#233;nement.</description>
    </item>
    <item>
      <title>Huawei Freeclip 2 : les &#233;couteurs ouverts de Huawei arrivent officiellement en France</title>
      <link>https://www.frandroid.com/marques/huawei/2948377_huawei-freeclip-2-les-ecouteurs-ouverts-de-huawei-arrivent-officiellement-en-france</link>
      <pubDate>Tue, 20 Jan 2026 08:12:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/huawei/2948377_huawei-freeclip-2-les-ecouteurs-ouverts-de-huawei-arrivent-officiellement-en-france</guid>
      <description>
Huawei lance officiellement en France les FreeClip 2, une nouvelle g&#233;n&#233;ration d&#8217;&#233;couteurs ouverts &#224; clip d&#8217;oreille, misant sur le confort, la s&#233;curit&#233; et un design atypique. On conna&#238;t maintenant leur prix.
</description>
    </item>
    <item>
      <title>AMD, Intel et Qualcomm sont sur un bateau&#160;: qui va imposer sa version du PC de demain&#160;?</title>
      <link>https://www.01net.com/actualites/amd-intel-qualcomm-processeurs-2026-ia-locale-difficultes-industrielles.html</link>
      <pubDate>Tue, 20 Jan 2026 08:04:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320009</guid>
      <description>Le CES est historiquement l'occasion pour les fabricants de processeurs de pr&#233;senter leurs nouvelles gammes et mod&#232;les, et l'&#233;dition 2026 de cette grand-messe annuelle n'a pas &#233;chapp&#233; &#224; la r&#232;gle. Le contexte actuel pousse toutefois les trois g&#233;ants du march&#233; &#224; naviguer entre rupture technologique majeure, &#233;ni&#232;mes promesses de r&#233;volution de l'IA et r&#233;alit&#233; industrielle contraignante. Qui d'AMD, d'Intel ou de Qualcomm parviendra &#224; se sortir le plus habilement de cette situation d&#233;licate ?...</description>
    </item>
    <item>
      <title>WhatsApp Web prendra bient&#244;t en charge les appels audio et vid&#233;o en groupe</title>
      <link>https://www.01net.com/actualites/whatsapp-web-prendra-bientot-en-charge-les-appels-audio-et-video-en-groupe.html</link>
      <pubDate>Tue, 20 Jan 2026 08:02:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321125</guid>
      <description>Meta travaille sur la future prise en charge des appels audio et vid&#233;o de groupe au sein de la version Web de sa messagerie instantan&#233;e.</description>
    </item>
    <item>
      <title>Roland&#8217;s Go:Mixer Studio turns your phone into a mobile music studio</title>
      <link>https://www.theverge.com/entertainment/864095/roland-gomixer-studio-namm</link>
      <pubDate>2026-01-20T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864095</guid>
      <description>Roland now offers a more capable audio mixer for phones and tablets with the launch of the Go:Mixer Studio. The Go:Mixer audio interface lineup has always been a bit limited, better suited for scrappy live streams and capturing quick demos on their phones than professional recording. The Go:Mixer Studio is an attempt to actually reach [&#8230;]</description>
    </item>
    <item>
      <title>Everstone combines Wingify, AB Tasty for $100M+ digital experience optimization platform</title>
      <link>https://techcrunch.com/2026/01/20/everstone-combines-wingify-ab-tasty-for-100m-digital-experience-optimization-platform/</link>
      <pubDate>Tue, 20 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083714</guid>
      <description>The combined business will serve more than 4,000 customers globally and surpass $100 million in annual revenue.</description>
    </item>
    <item>
      <title>Un faux bloqueur de pub s&#8217;en prend &#224; vos donn&#233;es sur Chrome</title>
      <link>https://www.frandroid.com/culture-tech/securite-applications/2948353_un-faux-bloqueur-de-pub-sen-prend-a-vos-donnees-sur-chrome</link>
      <pubDate>Tue, 20 Jan 2026 07:44:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/securite-applications/2948353_un-faux-bloqueur-de-pub-sen-prend-a-vos-donnees-sur-chrome</guid>
      <description>
Une extension nomm&#233;e NexShield et un temps h&#233;berg&#233; sur le Chrome Web Store est en fait un programme malveillant destin&#233; &#224; voler vos donn&#233;es via un syst&#232;me de piratage &#233;labor&#233;.
</description>
    </item>
    <item>
      <title>Dans l&#8217;App Store, Apple cherche &#224; brouiller un peu plus la fronti&#232;re entre publicit&#233; et r&#233;sultats</title>
      <link>https://www.01net.com/actualites/dans-lapp-store-apple-brouille-un-peu-plus-la-frontiere-entre-publicite-et-resultats.html</link>
      <pubDate>Tue, 20 Jan 2026 07:31:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321088</guid>
      <description>Apple voudrait effacer petit &#224; petit la fronti&#232;re entre la publicit&#233; et les contenus dans l'App Store. Le constructeur teste actuellement aupr&#232;s d'une poign&#233;e d'utilisateurs un nouvel affichage pour la r&#233;clame dans les r&#233;sultats de recherche de la boutique.</description>
    </item>
    <item>
      <title>Pour augmenter le stockage de votre Switch 2, la carte microSD Express Lexar 1 To sold&#233;e est une tr&#232;s bonne candidate</title>
      <link>https://www.frandroid.com/bons-plans/2947939_pour-augmenter-le-stockage-de-votre-switch-2-la-carte-microsd-express-lexar-1-to-soldee-est-une-tres-bonne-candidate</link>
      <pubDate>Tue, 20 Jan 2026 07:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2947939_pour-augmenter-le-stockage-de-votre-switch-2-la-carte-microsd-express-lexar-1-to-soldee-est-une-tres-bonne-candidate</guid>
      <description>
Nintendo a dot&#233; sa Switch 2 d'un port microSD Express pour augmenter l'espace de stockage de sa console. Si vous cherchez 1 To de libre, il est sur Amazon pour 183,99 euros au lieu de 214,95 euros.
</description>
    </item>
    <item>
      <title>&#171;&#160;C&#8217;est une arnaque&#160;&#187; : pourquoi la batterie solide europ&#233;enne de Donut Lab ne tient pas la route</title>
      <link>https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2948317_cest-une-arnaque-le-geant-chinois-svolt-demolit-la-batterie-solide-europeenne-de-donut-lab</link>
      <pubDate>Tue, 20 Jan 2026 07:24:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2948317_cest-une-arnaque-le-geant-chinois-svolt-demolit-la-batterie-solide-europeenne-de-donut-lab</guid>
      <description>
&#171; Cette batterie n'existe pas dans ce monde &#187; ? La sentence vient de Yang Hongxin, patron de Svolt. L'Europe pensait avoir trouv&#233; son champion de la batterie solide avec Donut Lab, mais le retour &#224; la r&#233;alit&#233; est violent. Incoh&#233;rences physiques, absence de preuves, calculs impossibles : voici pourquoi le ch&#226;teau de cartes est peut-&#234;tre en train de s'effondrer.
...</description>
    </item>
    <item>
      <title>Honor Magic 8 Pro Air : le smartphone de 6,1 mm est officiel et il n&#8217;a fait aucun compromis</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2948275_honor-magic-8-pro-air-le-smartphone-de-61-mm-est-officiel-et-il-na-fait-aucun-compromis</link>
      <pubDate>Tue, 20 Jan 2026 07:06:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2948275_honor-magic-8-pro-air-le-smartphone-de-61-mm-est-officiel-et-il-na-fait-aucun-compromis</guid>
      <description>
Le segment des smartphones &#171; Air &#187; r&#233;siste. Apr&#232;s un iPhone Air aux ventes timides, Honor lance son Magic 8 Pro Air en Chine. &#192; seulement 155 grammes, l'appareil affiche des caract&#233;ristiques de brute l&#224; o&#249; les autres font des concessions. 
</description>
    </item>
    <item>
      <title>Google Agenda&#160;: pourquoi vos anciens agendas vont soudainement r&#233;appara&#238;tre</title>
      <link>https://www.01net.com/actualites/google-agenda-pourquoi-anciens-agendas-vont-soudainement-reapparaitre.html</link>
      <pubDate>Tue, 20 Jan 2026 07:04:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321108</guid>
      <description>Google ne veut pas que vous oubliiez l'existence de vos diff&#233;rents agendas et compte bien vous le rappeler, o&#249; que vous soyez sur l'interface.</description>
    </item>
    <item>
      <title>iPhone 18 Pro et iPhone Fold&#160;: portrait robot de la future gamme d&#8217;Apple</title>
      <link>https://www.01net.com/actualites/iphone-18-pro-et-iphone-fold-portrait-robot-de-la-future-gamme-dapple.html</link>
      <pubDate>Tue, 20 Jan 2026 07:01:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321074</guid>
      <description>&#192; 8 mois du lancement de sa prochaine gamme d&#8217;iPhone, Apple poss&#232;de encore une certaine marge pour peaufiner ses annonces et garder quelques cartes en main. Mais, comme chaque ann&#233;e &#224; pareille &#233;poque, les contours des futurs iPhone 18 commencent d&#233;j&#224; &#224; se dessiner.</description>
    </item>
    <item>
      <title>120 Nm et 1000 W de puissance dans un v&#233;lo &#233;lectrique de 14 kg : le moteur DJI fait fort</title>
      <link>https://www.frandroid.com/marques/dji/2947429_120-nm-et-1000-w-de-puissance-dans-un-velo-electrique-de-14-kg-le-moteur-dji-fait-fort</link>
      <pubDate>Tue, 20 Jan 2026 07:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dji/2947429_120-nm-et-1000-w-de-puissance-dans-un-velo-electrique-de-14-kg-le-moteur-dji-fait-fort</guid>
      <description>
La nouvelle marque Velduro mise sur le premier moteur v&#233;lo DJI, l&#8217;Avinox M1, au travers d'un gravel et d'un VTT &#233;lectriques au cadre carbone, dans l&#8217;espoir de faire son nid sur le Vieux Continent.
</description>
    </item>
    <item>
      <title>4 strategies for when you&#8217;re going to lose your job but you don&#8217;t know when</title>
      <link>https://www.fastcompany.com/91472322/4-strategies-for-when-youre-going-to-lose-your-job</link>
      <pubDate>2026-01-20T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91472322/4-strategies-for-when-youre-going-to-lose-your-job</guid>
      <description>Losing a job is painful. Not knowing when it&#8217;ll happen, is even worse. An executive coach lays out strategies for staying grounded.
Most of us know that job loss is emotionally difficult, but what&#8217;s less talked about is the experience of knowing you will be terminated without knowing when. This process can be drawn out and draining&#8212;a form of anticipatory grief&#8212;an emotional response to a loss before it occurs. Often experienced by the loved ones of terminally ill patients, a version applies in the workplace when job loss is on the horizon. In today&#8217;s volatile landscape, this kind of professiona...</description>
    </item>
    <item>
      <title>Fuite de donn&#233;es &#224; l&#8217;Urssaf&#160;: les informations de 12 millions de salari&#233;s potentiellement compromises</title>
      <link>https://www.01net.com/actualites/fuite-de-donnees-a-lurssaf-les-informations-de-12-millions-de-salaries-potentiellement-compromises.html</link>
      <pubDate>Tue, 20 Jan 2026 06:58:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321113</guid>
      <description>L&#8217;Urssaf est frapp&#233;e par une nouvelle fuite massive de donn&#233;es. En exploitant des identifiants vol&#233;s en amont, des pirates sont parvenus &#224; prendre le contr&#244;le du compte d'un prestataire. Les informations de 12&#8239;millions de salari&#233;s embauch&#233;s ces trois derni&#232;res ann&#233;es sont potentiellement compromises.</description>
    </item>
    <item>
      <title>iPhone 18 Pro : de nouveaux coloris bordeaux et violet avec un Face ID sous l&#8217;&#233;cran, voici les derni&#232;res fuites</title>
      <link>https://www.frandroid.com/os/ios/2948261_iphone-18-pro-de-nouveaux-coloris-bordeaux-et-violet-avec-un-face-id-sous-lecran-voici-les-dernieres-fuites</link>
      <pubDate>Tue, 20 Jan 2026 06:54:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/ios/2948261_iphone-18-pro-de-nouveaux-coloris-bordeaux-et-violet-avec-un-face-id-sous-lecran-voici-les-dernieres-fuites</guid>
      <description>
Une fuite sign&#233;e Jon Prosser nous montre un iPhone 18 Pro au look surprenant, arborant des coloris bordeaux et une interface totalement repens&#233;e. 
</description>
    </item>
    <item>
      <title>Fini le hors-forfait en voyage : cette solution eSIM promet de la data illimit&#233;e partout dans le monde [Sponso]</title>
      <link>https://www.frandroid.com/telecom/2941957_fini-le-hors-forfait-en-voyage-cette-solution-esim-promet-de-la-data-illimitee-partout-dans-le-monde</link>
      <pubDate>Tue, 20 Jan 2026 06:47:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2941957_fini-le-hors-forfait-en-voyage-cette-solution-esim-promet-de-la-data-illimitee-partout-dans-le-monde</guid>
      <description>
Une solution pour t&#233;l&#233;phoner et utiliser de la data partout &#224; travers le monde, c&#8217;est en substance ce que propose Holafly avec ses formules d&#8217;abonnement Light et Unlimited &#224; partir de 49,90 dollars par mois.
</description>
    </item>
    <item>
      <title>On a port&#233; le seul et unique casque v&#233;lo gonflable, et il est incroyable</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2947925_on-a-porte-le-seul-et-unique-casque-velo-gonflable-et-il-est-incroyable</link>
      <pubDate>Tue, 20 Jan 2026 06:46:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2947925_on-a-porte-le-seul-et-unique-casque-velo-gonflable-et-il-est-incroyable</guid>
      <description>
Gonflable et d&#233;gonflable en 30 secondes, le Ventete aH-1 nous a fait tr&#232;s bonne impression, que ce soit sur le plan de la robustesse, au niveau des r&#233;glages ou du confort. Si l&#8217;on passe outre le tarif exorbitant.
</description>
    </item>
  </channel>
</rss>
