<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 08 Jan 2026 08:36:59 GMT</lastBuildDate>
    <item>
      <title>Une vague de cyberattaques s&#8217;abat sur ces routeurs D-Link obsol&#232;tes</title>
      <link>https://www.01net.com/actualites/vague-cyberattaques-abat-routeurs-d-link-obsoletes.html</link>
      <pubDate>Thu, 08 Jan 2026 08:30:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318758</guid>
      <description>Une faille critique permet de prendre le contr&#244;le &#224; distance d&#8217;anciens routeurs D&#8209;Link. Priv&#233;s de mises &#224; jour depuis plus de cinq ans, ils sont vuln&#233;rables aux cyberattaques. Pour &#233;viter les risques, D-Link recommande de changer de routeur.</description>
    </item>
    <item>
      <title>F2 Pro E : l&#8217;ancienne star des trottinettes milieu de gamme de Segway-Ninebot est sold&#233;e &#224; moins de 400 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2933337_f2-pro-e-lancienne-star-des-trottinettes-milieu-de-gamme-de-segway-ninebot-est-soldee-a-moins-de-400-e</link>
      <pubDate>Thu, 08 Jan 2026 08:12:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933337_f2-pro-e-lancienne-star-des-trottinettes-milieu-de-gamme-de-segway-ninebot-est-soldee-a-moins-de-400-e</guid>
      <description>
Id&#233;ale pour les trajets en ville, la Ninebot KickScooter F2 Pro E est une trottinette &#233;lectrique puissante, confortable et rassurante. Elle a beau avoir &#233;t&#233; d&#233;pass&#233;e par sa successeure, la F3 Pro E, elle reste tout de m&#234;me recommandable, surtout quand son prix passe de 449,99 euros &#224; 359,99 euros chez Boulanger, comme pendant ces soldes d'hiver 2026. 
...</description>
    </item>
    <item>
      <title>Grosse panne chez Logitech : pourquoi vos p&#233;riph&#233;riques Mac plantent et comment r&#233;gler le probl&#232;me</title>
      <link>https://www.frandroid.com/marques/logitech/2934135_grosse-panne-chez-logitech-pourquoi-vos-peripheriques-mac-plantent-et-comment-regler-le-probleme</link>
      <pubDate>Thu, 08 Jan 2026 08:03:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/logitech/2934135_grosse-panne-chez-logitech-pourquoi-vos-peripheriques-mac-plantent-et-comment-regler-le-probleme</guid>
      <description>
Depuis hier, les utilisateurs de p&#233;riph&#233;riques Logitech sur macOS font face &#224; un blocage complet des logiciels de configuration de la marque. Une mise &#224; jour corrective vient d'&#234;tre d&#233;ploy&#233;e pour r&#233;tablir la connexion avec vos souris et claviers.
</description>
    </item>
    <item>
      <title>Volvo touts EX60&#8217;s range and charging speed ahead of official debut</title>
      <link>https://www.theverge.com/transportation/857933/volvo-ex60-range-charging-speed-megacasting-battery</link>
      <pubDate>2026-01-08T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=857933</guid>
      <description>Volvo is starting to trickle out some details about its upcoming midsize electric SUV, the EX60, before its official debut January 21st. The EX60 will have an estimated range of 400 miles (or 810km based on the generous WLTP standard in Europe). That's significantly more range than any previous Volvo EV - at least until [&#8230;]</description>
    </item>
    <item>
      <title>Une anomalie cosmique sugg&#232;re qu'il faut revoir la forme de notre Univers  !</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-anomalie-cosmique-suggere-quil-faut-revoir-forme-notre-univers-129767/#xtor%3DRSS-8</link>
      <pubDate>Thu, 08 Jan 2026 08:47:01 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-anomalie-cosmique-suggere-quil-faut-revoir-forme-notre-univers-129767/#xtor%3DRSS-8</guid>
      <description>Ces derni&#232;res ann&#233;es, le prix Nobel de physique et architecte du Mod&#232;le cosmologique standard James Peebles avait rassembl&#233; dans un article plusieurs anomalies et &#233;nigmes que pose ce mod&#232;le. L'une d'elles est bien connue, c'est celle de la tension de Hubble. Mais si&#160;l'anomalie du dip&#244;le cosmique...</description>
    </item>
    <item>
      <title>Google Messages va int&#233;grer un menu d&#8217;actions inspir&#233; de WhatsApp</title>
      <link>https://www.01net.com/actualites/google-messages-va-integrer-un-menu-dactions-inspire-de-whatsapp.html</link>
      <pubDate>Thu, 08 Jan 2026 07:35:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318757</guid>
      <description>L&#8217;application de messagerie de Google vous permettra bient&#244;t d&#8217;acc&#233;der &#224; plus d&#8217;options en effectuant un appui long sur les messages et les images que vous recevez. Un syst&#232;me directement inspir&#233; de WhatsApp.</description>
    </item>
    <item>
      <title>Une hausse de prix in&#233;vitables pour les futurs Samsung Galaxy&#160;S26&#8201;?</title>
      <link>https://www.frandroid.com/marques/samsung/2934495_une-hausse-de-prix-inevitables-pour-les-futurs-samsung-galaxy-s26</link>
      <pubDate>Thu, 08 Jan 2026 07:32:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2934495_une-hausse-de-prix-inevitables-pour-les-futurs-samsung-galaxy-s26</guid>
      <description>
Les prochains fers de lance de la division mobile de Samsung ne devraient plus trop tarder &#224; &#234;tre officialis&#233;s. Et avec eux viendra tr&#232;s probablement une addition plus sal&#233;e que pr&#233;vu, malheureusement.
</description>
    </item>
    <item>
      <title>Bose Promo Code: 40% Off Bose for January 2026</title>
      <link>https://www.wired.com/story/bose-coupon-code/</link>
      <pubDate>Thu, 08 Jan 2026 07:30:00 +0000</pubDate>
      <guid isPermaLink="false">67d855d0dbfd501733b277c9</guid>
      <description>Enjoy at least 40% off headphones, speakers, soundbars, and other audio products from Bose.</description>
    </item>
    <item>
      <title>Le TCL PlayCube marqu&#233; par un design original &#233;teint 100 euros de son prix chez Amazon pour les soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2933779_le-tcl-playcube-marque-par-un-design-original-eteint-100-euros-de-son-prix-chez-amazon-pour-les-soldes-dhiver</link>
      <pubDate>Thu, 08 Jan 2026 07:29:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933779_le-tcl-playcube-marque-par-un-design-original-eteint-100-euros-de-son-prix-chez-amazon-pour-les-soldes-dhiver</guid>
      <description>
Compact et pouvant s'ajuster sur un angle de 90 degr&#233;s, le TCL PlayCube va vous faire oublier votre TV et, &#224; l'occasion des soldes d'hiver, il tombe &#224; 699,99 euros chez Amazon. Pensez &#224; cocher le coupon avant l'achat.
</description>
    </item>
    <item>
      <title>Heated Rivalrys Hudson Williams teases Season 2, explains c*ck sock to Fallon</title>
      <link>https://mashable.com/video/heated-rivalry-hudson-williams-jimmy-fallon</link>
      <pubDate>Thu, 08 Jan 2026 07:10:25 +0000</pubDate>
      <guid isPermaLink="false">008IuCUHev1IcHLMiFd7O5m</guid>
      <description>'Heated Rivalry' actor Hudson Williams talked to Jimmy Fallon about the hockey romance series, and dropped hints about Season 2.</description>
    </item>
    <item>
      <title>Sous pression financi&#232;re, le num&#233;ro 1 du v&#233;lo en Europe aborde 2026 en revendant une marque</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2933287_sous-pression-financiere-le-numero-1-du-velo-en-europe-aborde-2026-en-revendant-une-marque</link>
      <pubDate>Thu, 08 Jan 2026 07:04:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2933287_sous-pression-financiere-le-numero-1-du-velo-en-europe-aborde-2026-en-revendant-une-marque</guid>
      <description>
Bien qu&#8217;ayant re&#231;u une note financi&#232;re stable, le groupe n&#233;erlandais Accell n&#8217;attend pas de reprise avant 2027 et annonce se s&#233;parer de la marque de v&#233;lo Van Nicholas.
</description>
    </item>
    <item>
      <title>ChatGPT veut maintenant &#234;tre un compagnon de suivi de la sant&#233;</title>
      <link>https://www.01net.com/actualites/chatgpt-veut-maintenant-etre-un-compagnon-de-suivi-de-la-sante.html</link>
      <pubDate>Thu, 08 Jan 2026 07:01:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318714</guid>
      <description>Voudriez-vous confier vos donn&#233;es m&#233;dicales &#224; ChatGPT ? Chaque jour, des millions de personnes interrogent d&#233;j&#224; le chatbot d&#8217;OpenAI sur leur alimentation, leur forme ou leurs r&#233;sultats d&#8217;analyses. L&#8217;entreprise franchit d&#233;sormais un pas suppl&#233;mentaire avec ChatGPT Health qui va analyser votre carnet de sant&#233;.</description>
    </item>
    <item>
      <title>Anker unveils a new lineup of chargers, docks and accessories at CES 2026</title>
      <link>https://www.engadget.com/computing/accessories/anker-unveils-a-new-lineup-of-chargers-docks-and-accessories-at-ces-2026-160021025.html?src=rss</link>
      <pubDate>Thu, 08 Jan 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">e0a59925-1c86-46f9-b8b4-44c46f9069f6</guid>
      <description>Anker dove into CES 2026 with a slew of announcements that bring new chargers and accessories under its umbrella. The new accessories include improved visual interfaces, faster Qi2 wireless charging and &#8220;upgraded ecosystems&#8221; that support the latest iPhones. Some of the latest devices are even available to buy right now.
First up is the Anker Nano Charger with smart display, which features a tiny screen, 180-degree foldable prongs and provides up to 45W of power. The plug can identify the exact iPhone model connected and then deliver the right amount of power for your phone. Anker says the Nano...</description>
    </item>
    <item>
      <title>3 ways leaders can stop being work jerks</title>
      <link>https://www.fastcompany.com/91469143/3-ways-leaders-can-stop-being-work-jerks</link>
      <pubDate>2026-01-08T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91469143/3-ways-leaders-can-stop-being-work-jerks</guid>
      <description>Work jerks can create toxic cultures, stressed out employees, and burnout. Here&#8217;s how to stop being one.
A &#8220;work jerk&#8221; isn&#8217;t just someone who expects perfection. It&#8217;s the high achiever whose nervous system runs at lava-like temperatures, who&#8217;s chronically stressed, and demonstrates urgency as a personality trait. It looks like hair-trigger impatience, micromanaging, sharp feedback, and an automatic reflex to see others as obstacles rather than partners. Work jerk behaviors teach people at work to focus their energy on managing you and your reactions instead of doing good work....</description>
    </item>
    <item>
      <title>Research shows this habit parents hate is good for teenagers</title>
      <link>https://www.fastcompany.com/91470660/research-shows-this-habit-parents-hate-is-good-for-teenagers</link>
      <pubDate>2026-01-08T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91470660/research-shows-this-habit-parents-hate-is-good-for-teenagers</guid>
      <description>Although parents have long frowned upon this typical teen behavior, research finds it can be good for teens&#8217; mental health.
If you&#8217;re constantly hounding your teen to get out of bed before noon on the weekend, you may want to save your energy for a different battle. According to new research published in The Journal of Affective Disorders, sleeping in on the weekend could offer some significant protection against depression.&#160;...</description>
    </item>
    <item>
      <title>WhatsApp pr&#233;sente 3 nouveaut&#233;s bien pratiques pour vos discussions de groupe</title>
      <link>https://www.01net.com/actualites/whatsapp-presente-nouveautes-pratiques-discussions-groupe.html</link>
      <pubDate>Thu, 08 Jan 2026 06:57:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318740</guid>
      <description>D&#233;j&#224; tr&#232;s compl&#232;te, l&#8217;application WhatsApp continue de s&#8217;am&#233;liorer avec aujourd&#8217;hui trois nouveaut&#233;s bien pratiques pour vos conversations de groupe.</description>
    </item>
    <item>
      <title>Xiaomi 15T Pro : le smartphone qu&#8217;on recommande le plus actuellement chute sous les 650 &#8364; pendant les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2933473_xiaomi-15t-pro-le-smartphone-quon-recommande-le-plus-actuellement-chute-sous-les-650-e-pendant-les-soldes</link>
      <pubDate>Thu, 08 Jan 2026 06:55:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933473_xiaomi-15t-pro-le-smartphone-quon-recommande-le-plus-actuellement-chute-sous-les-650-e-pendant-les-soldes</guid>
      <description>
Not&#233; 9/10, le Xiaomi 15T Pro est l'un des meilleurs smartphones de ce d&#233;but d'ann&#233;e. Aussi dou&#233; en gaming et en photo, ce mod&#232;le peut surtout vous revenir &#224; 649 euros au lieu de 802 euros &#224; la Fnac et chez Darty pendant les soldes d'hiver.
</description>
    </item>
    <item>
      <title>CES 2026: Dells decadent new 52-inch 6K ultrawide monitor is a world first</title>
      <link>https://mashable.com/article/ces-2026-dell-52-inch-5k-ultrawide-monitor</link>
      <pubDate>Thu, 08 Jan 2026 06:53:02 +0000</pubDate>
      <guid isPermaLink="false">00nFaF7OOvj8q14soUtpsJw</guid>
      <description>Dell showcased a new 52-inch 6K monitor at CES 2026. The UltraSharp 52 Thunderbolt Hub Monitor is now available starting at $2,799.99.</description>
    </item>
    <item>
      <title>Peacock Promo Codes: 16% Off January 2026</title>
      <link>https://www.wired.com/story/peacock-promo-code/</link>
      <pubDate>Thu, 08 Jan 2026 06:44:00 +0000</pubDate>
      <guid isPermaLink="false">674752c56e8c795eaf0c88ef</guid>
      <description>Stream your favorite shows for up to $80 off this month, and save on subscription plans with the latest Peacock TV coupons from WIRED.</description>
    </item>
    <item>
      <title>ChatGPT Sant&#233;, ou comment OpenAI veut vous convaincre de partager vos donn&#233;es les plus personnelles</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2934483_chatgpt-sante-ou-comment-openai-veut-vous-convaincre-de-partager-vos-donnees-les-plus-personnelles</link>
      <pubDate>Thu, 08 Jan 2026 06:39:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2934483_chatgpt-sante-ou-comment-openai-veut-vous-convaincre-de-partager-vos-donnees-les-plus-personnelles</guid>
      <description>
D&#233;j&#224; largement utilis&#233; pour r&#233;pondre &#224; des questions concernant la sant&#233; de ses utilisateurs et utilisatrices, ChatGPT vient de lancer un service d&#233;di&#233; qui pourra se connecter &#224; tous vos services de quantified self.
</description>
    </item>
  </channel>
</rss>
