<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 19 Feb 2026 11:41:09 GMT</lastBuildDate>
    <item>
      <title>Reliance unveils $110B AI investment plan as India ramps up tech ambitions</title>
      <link>https://techcrunch.com/2026/02/19/reliance-unveils-110b-ai-investment-plan-as-india-ramps-up-tech-ambitions/</link>
      <pubDate>Thu, 19 Feb 2026 11:39:17 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3094292</guid>
      <description>Reliance has begun building multi-gigawatt AI data centers in Jamnagar, with more than 120 MW of capacity expected to come online in 2026.</description>
    </item>
    <item>
      <title>Website templates vs AI builders: What's the best way to create a website quickly?</title>
      <link>https://www.techradar.com/pro/website-building/website-templates-vs-ai-builders-whats-the-best-way-to-create-a-website-quickly</link>
      <pubDate>Thu, 19 Feb 2026 11:34:31 +0000</pubDate>
      <guid isPermaLink="false">cxGnXwFYe4WjGthMuPCzme</guid>
      <description>Choosing between traditional templates and AI-powered builders can determine how quickly you launch your website and how much control you keep over the final result.</description>
    </item>
    <item>
      <title>Best Home Gym Setup (2026): Adjustable Weights, Resistance Bands, and More</title>
      <link>https://www.wired.com/story/the-best-home-gym-setup/</link>
      <pubDate>Thu, 19 Feb 2026 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">6994dce2403c9316ffff7d08</guid>
      <description>Lifting weights can keep you carrying groceries and riding bikes even as you get older. Here&#8217;s our guide to a simple home setup.</description>
    </item>
    <item>
      <title>Tamron 35-100mm f/2.8 Di III VXD : un zoom lumineux et compact&#8230; dot&#233; d&#8217;une plage focale atypique</title>
      <link>https://www.frandroid.com/produits-android/photo/objectifs/2982721_tamron-35-100mm-f-2-8-di-iii-vxd-un-zoom-lumineux-et-compact-dote-dune-plage-focale-atypique</link>
      <pubDate>Thu, 19 Feb 2026 11:28:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/photo/objectifs/2982721_tamron-35-100mm-f-2-8-di-iii-vxd-un-zoom-lumineux-et-compact-dote-dune-plage-focale-atypique</guid>
      <description>
Coup d'envoi pour le nouvel objectif Tamron 35-100mm f/2.8 Di III VXD d&#233;di&#233; aux montures Sony E et Nikon Z. Ce zoom compact et lumineux profite d'une plage focale pas si courante et d'un prix relativement contenu. Pr&#233;sentations.
</description>
    </item>
    <item>
      <title>Votre casque audio est-il toxique&#160;? Une &#233;tude choc &#233;pingle 81 mod&#232;les</title>
      <link>https://www.01net.com/actualites/votre-casque-audio-est-il-toxique-une-etude-choc-epingle-81-modeles.html</link>
      <pubDate>Thu, 19 Feb 2026 11:28:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326820</guid>
      <description>Une r&#233;cente analyse europ&#233;enne met en &#233;vidence la pr&#233;sence de PFAS et de perturbateurs endocriniens dans 81 mod&#232;les de casques et &#233;couteurs.</description>
    </item>
    <item>
      <title>Pourquoi acheter le nouveau Google Pixel 10a quand le Pixel 9a fait tout aussi bien pour 200 &#8364; de moins ?</title>
      <link>https://www.frandroid.com/bons-plans/2982671_pourquoi-acheter-le-nouveau-google-pixel-10a-quand-le-pixel-9a-fait-tout-aussi-bien-pour-200-e-de-moins</link>
      <pubDate>Thu, 19 Feb 2026 11:27:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2982671_pourquoi-acheter-le-nouveau-google-pixel-10a-quand-le-pixel-9a-fait-tout-aussi-bien-pour-200-e-de-moins</guid>
      <description>
Google avait &#233;quip&#233; son Pixel 9a de la puce Tensor G4. Le r&#233;sultat a d&#251; convaincre la marque de Mountain View puisque la m&#234;me puce est pr&#233;sente sur le nouveau Pixel 10a. Sauf que le 9a est 200 euros moins cher, ce qui le rend tout de suite plus int&#233;ressant.
</description>
    </item>
    <item>
      <title>Garmin Fenix 9 incoming? CEO Cliff Pemble teases big things to come 'in the back half of the year'</title>
      <link>https://www.techradar.com/health-fitness/garmin-fenix-9-incoming-ceo-cliff-pemble-teases-big-things-to-come-in-the-back-half-of-the-year</link>
      <pubDate>Thu, 19 Feb 2026 11:21:27 +0000</pubDate>
      <guid isPermaLink="false">h4fLk78UX5B5nYRy97iw3j</guid>
      <description>First possible tease for the Garmin Fenix 9 comes from CEO Cliff Pemble, as he expects watch sales to "accelerate" later this year.</description>
    </item>
    <item>
      <title>The latest Skyrim Switch 2 Edition patch seems to fix my biggest issue with the port</title>
      <link>https://www.techradar.com/gaming/the-latest-skyrim-switch-2-edition-patch-seems-to-fix-my-biggest-issue-with-the-port</link>
      <pubDate>Thu, 19 Feb 2026 11:20:51 +0000</pubDate>
      <guid isPermaLink="false">AQNTrGwQKLt4zQAp8kaBZ</guid>
      <description>My biggest problem with Skyrim's Switch 2 port seems to have been fixed thanks to the addition of a framerate-boosting performance mode.</description>
    </item>
    <item>
      <title>Audi va bien ressusciter sa mythique TT en &#233;lectrique et c&#8217;est son patron qui le dit</title>
      <link>https://www.frandroid.com/marques/audi/2982473_audi-va-bien-ressusciter-sa-mythique-tt-en-electrique-et-cest-son-patron-qui-le-dit</link>
      <pubDate>Thu, 19 Feb 2026 11:17:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/audi/2982473_audi-va-bien-ressusciter-sa-mythique-tt-en-electrique-et-cest-son-patron-qui-le-dit</guid>
      <description>
Annonc&#233;e via le concept C en 2025, la future Audi TT avait finalement &#233;t&#233; mise de c&#244;t&#233;. Mais le coup&#233; sportif va finalement voir le jour, sous la forme d&#8217;une in&#233;dite voiture &#233;lectrique.
</description>
    </item>
    <item>
      <title>&#171;&#160;L&#8217;hiver de la voiture &#233;lectrique&#160;&#187; : comment ces d&#233;cisions politiques vont ralentir le march&#233; en 2026</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2982399_lhiver-de-la-voiture-electrique-comment-ces-decisions-politiques-vont-ralentir-le-marche-en-2026</link>
      <pubDate>Thu, 19 Feb 2026 11:01:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2982399_lhiver-de-la-voiture-electrique-comment-ces-decisions-politiques-vont-ralentir-le-marche-en-2026</guid>
      <description>
Selon les pr&#233;visions, la croissance des ventes de voitures &#233;lectriques devrait ralentir en 2026. La faute notamment aux d&#233;cisions politiques prises en Chine, en Europe et aux Etats-Unis. Des experts qualifient 2026 "d'hiver de la voiture &#233;lectrique".
</description>
    </item>
    <item>
      <title>J&#8217;ai d&#233;j&#224; conduit le nouveau Mercedes-Benz VLE : pourquoi les taxis en ville vont adorer ce van &#233;lectrique</title>
      <link>https://www.frandroid.com/marques/mercedes-benz/2966319_jai-deja-conduit-le-nouveau-mercedes-benz-vle-pourquoi-les-taxis-en-ville-vont-adorer-ce-van-electrique</link>
      <pubDate>Thu, 19 Feb 2026 11:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/mercedes-benz/2966319_jai-deja-conduit-le-nouveau-mercedes-benz-vle-pourquoi-les-taxis-en-ville-vont-adorer-ce-van-electrique</guid>
      <description>
J'ai pu monter &#224; bord du Mercedes-Benz VLE, le nouveau van &#233;lectrique de la marque, avant sa pr&#233;sentation. Un bref galop d'essai qui aura mis la lumi&#232;re sur sa maniabilit&#233; et son confort, avec des si&#232;ges arri&#232;re individuels.
</description>
    </item>
    <item>
      <title>Inside the Gay Tech Mafia</title>
      <link>https://www.wired.com/story/inside-the-gay-tech-mafia/</link>
      <pubDate>Thu, 19 Feb 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">6977ebfee4802fe5f44062e3</guid>
      <description>Gay men have long been rumored to run Silicon Valley. WIRED investigates.</description>
    </item>
    <item>
      <title>The biggest app in the whole wide world</title>
      <link>https://www.theverge.com/tech/876196/top-app-store-apps-developers</link>
      <pubDate>2026-02-19T06:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=876196</guid>
      <description>Last summer, Bria Sullivan was getting ready to launch her app, an adorable companion called Focus Friend meant to help people manage their screen time. Her outlandish dream was to get 100,000 downloads. She'd been building the app with Hank Green, a creator with a huge audience, so she thought maybe, maybe, Focus Friend could [&#8230;]</description>
    </item>
    <item>
      <title>WhatsApp prot&#232;gera bient&#244;t votre compte avec un mot de passe</title>
      <link>https://www.01net.com/actualites/whatsapp-protegera-bientot-votre-compte-avec-un-mot-de-passe.html</link>
      <pubDate>Thu, 19 Feb 2026 10:57:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326831</guid>
      <description>La messagerie instantan&#233;e de Meta pr&#233;pare l&#8217;arriv&#233;e des mots de passe pour vous aider &#224; mieux prot&#233;ger votre compte.</description>
    </item>
    <item>
      <title>Android fans left baffled as Google launches new Snapseed camera for iPhone</title>
      <link>https://www.techradar.com/phones/iphone/android-fans-left-baffled-as-google-launches-new-snapseed-camera-for-iphone</link>
      <pubDate>Thu, 19 Feb 2026 10:56:30 +0000</pubDate>
      <guid isPermaLink="false">eBRHm4X4SntUeiNRmd9EXD</guid>
      <description>Snapseed's camera feature has now fully rolled out on iPhone, complete with a pro mode, but Android is still waiting.</description>
    </item>
    <item>
      <title>Microsoft teste une fonction de bilan pour l&#8217;application Xbox sur PC</title>
      <link>https://www.frandroid.com/marques/microsoft/2982571_microsoft-teste-une-fonction-de-bilan-pour-lapplication-xbox-sur-pc</link>
      <pubDate>Thu, 19 Feb 2026 10:55:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2982571_microsoft-teste-une-fonction-de-bilan-pour-lapplication-xbox-sur-pc</guid>
      <description>
Les membres du programme Xbox Insider peuvent acc&#233;der &#224; un r&#233;capitulatif de leur session de jeu en utilisant l&#8217;application Xbox pour PC. De quoi retrouver facilement les temps forts d&#8217;une partie.
</description>
    </item>
    <item>
      <title>Is AI at work actually helping? Major survey claims many firms see no obvious benefit despite billions in investment</title>
      <link>https://www.techradar.com/pro/is-ai-at-work-actually-helping-major-survey-claims-many-firms-see-no-obvious-benefit-despite-billions-in-investment</link>
      <pubDate>Thu, 19 Feb 2026 10:50:03 +0000</pubDate>
      <guid isPermaLink="false">uHaa69rDVCVhvLwTWs3weT</guid>
      <description>Many companies have failed to realize AI productivity gains over the past three years, and the outlook isn't hugely optimistic.</description>
    </item>
    <item>
      <title>Berlin envisage de commander de nouveaux F-35 am&#233;ricains, un revers pour la d&#233;fense europ&#233;enne</title>
      <link>https://www.01net.com/actualites/berlin-commander-nouveaux-f35-americains-revers-defense-europeenne.html</link>
      <pubDate>Thu, 19 Feb 2026 10:41:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326815</guid>
      <description>Le projet d'avion de combat de sixi&#232;me g&#233;n&#233;ration europ&#233;en &#171; SCAF &#187; ou &#171; FCAS &#187;, qui remplacera le Rafale et l&#8217;Eurofighter, est au point mort depuis des mois. L'Allemagne envisagerait de se tourner &#224; nouveau vers le constructeur am&#233;ricain Lockheed Martin et de commander des avions de chasse F-35, un revers pour la d&#233;fense europ&#233;enne en qu&#234;te d&#8217;ind&#233;pendance vis-&#224;-vis des &#201;tats-Unis....</description>
    </item>
    <item>
      <title>Garmin Edge 550 : cet excellent compteur GPS v&#233;lo en promotion va ravir les cyclistes</title>
      <link>https://www.frandroid.com/bons-plans/2982485_garmin-edge-550-cet-excellent-compteur-gps-velo-en-promotion-va-ravir-les-cyclistes</link>
      <pubDate>Thu, 19 Feb 2026 10:37:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2982485_garmin-edge-550-cet-excellent-compteur-gps-velo-en-promotion-va-ravir-les-cyclistes</guid>
      <description>
Si vous faites du v&#233;lo pour le loisir ou pour la comp&#232;te, avoir un compteur GPS peut s'av&#233;rer utile pour suivre vos performances. Certains ne sont pas &#224; la port&#233;e de tous, mais le Garmin Edge 550 s'all&#232;ge de 50 euros et passe de 449 euros &#224; 399 euros. 
</description>
    </item>
    <item>
      <title>&#201;ni&#232;me fuite de donn&#233;es en France&#160;: le syndicat CFDT a &#233;t&#233; pirat&#233;, les informations des adh&#233;rents vol&#233;es</title>
      <link>https://www.01net.com/actualites/enieme-fuite-donnees-france-syndicat-cfdt-pirate-informations-adherents-volees.html</link>
      <pubDate>Thu, 19 Feb 2026 10:33:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326809</guid>
      <description>La CFDT, premier syndicat de France, a &#233;t&#233; victime d'une cyberattaque ayant entra&#238;n&#233; le vol de donn&#233;es personnelles. L'attaque a &#233;t&#233; revendiqu&#233;e &#224; deux reprises, notamment par le redoutable gang Clop. Le syndicat a notifi&#233; la CNIL et l'ANSSI, tandis que les investigations se poursuivent.</description>
    </item>
    <item>
      <title>Bowers &amp; Wilkins Px7 S3 Review: Stronger Build, Sweeter Sound</title>
      <link>https://www.wired.com/review/bowers-and-wilkins-px7-s3/</link>
      <pubDate>Thu, 19 Feb 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">698ba43d1cd27f239f179bc6</guid>
      <description>Bowers &amp; Wilkins&#8217; latest Px7 headphones keep sound and style at the forefront, with brilliant results.</description>
    </item>
    <item>
      <title>This AI Tool Will Tell You to Stop Slacking Off</title>
      <link>https://www.wired.com/story/fomi-ai-will-tell-you-to-stop-slacking-off/</link>
      <pubDate>Thu, 19 Feb 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">698d1356b397b1ead5556c3e</guid>
      <description>Fomi watches you work, then scolds you when your attention wanders. It&#8217;s helpful, but there are privacy issues to consider.</description>
    </item>
    <item>
      <title>A new Marvel art book has revealed where Spider-Man: Brand New Day will sit on the MCU timeline &#8212; and unveiled some big details about its plot</title>
      <link>https://www.techradar.com/streaming/entertainment/a-new-marvel-art-book-has-revealed-where-spider-man-brand-new-day-will-sit-on-the-mcu-timeline-and-unveiled-some-big-details-about-its-plot</link>
      <pubDate>Thu, 19 Feb 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">YkVF6WGbdwYD5tQpLTzJxV</guid>
      <description>Spider-Man: Brand New Day's plot synopsis and position on the MCU timeline have leaked online.</description>
    </item>
    <item>
      <title>Voici &#224; quel point l&#8217;Etat compte sur les panneaux solaires des particuliers et ce que &#231;a signifie pour les consommateurs</title>
      <link>https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2981365_voici-a-quel-point-letat-compte-sur-les-panneaux-solaires-des-particuliers-et-ce-que-ca-signifie-pour-les-consommateurs</link>
      <pubDate>Thu, 19 Feb 2026 10:15:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2981365_voici-a-quel-point-letat-compte-sur-les-panneaux-solaires-des-particuliers-et-ce-que-ca-signifie-pour-les-consommateurs</guid>
      <description>
L&#8217;autoconsommation avec des panneaux solaires install&#233; sur le toit des particuliers devient un levier de plus en plus important pour l&#8217;atteinte de la neutralit&#233; carbone. Cependant, le soutien financier de l&#8217;&#201;tat d&#233;di&#233; &#224; cette fili&#232;re sera plus encadr&#233;, voire peut-&#234;tre plus limit&#233;. C'est ce que nous apprend la nouvelle PPE.
</description>
    </item>
    <item>
      <title>Wix and QuickBooks team up to streamline accounting for SMBs</title>
      <link>https://www.techradar.com/pro/website-building/wix-and-quickbooks-team-up-to-streamline-accounting-for-smbs</link>
      <pubDate>Thu, 19 Feb 2026 10:14:06 +0000</pubDate>
      <guid isPermaLink="false">SGr3RD8tEYcVnSQ3Ua2Gw4</guid>
      <description>Both Wix and QuickBooks users can expect "immense value", says Wix rep.</description>
    </item>
    <item>
      <title>The case for being exclusive at work</title>
      <link>https://www.fastcompany.com/91494399/the-case-for-being-exclusive-at-work</link>
      <pubDate>2026-02-19T10:04:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91494399/the-case-for-being-exclusive-at-work</guid>
      <description>Leadership that draws the right audience in also pushes the wrong one out.
Most leaders understand their message needs to define exactly who their work is for. Fewer realize that it should also define who it&#8217;s not for. Fewer still realize that their message is unintentionally excluding some of the very people they want to attract.</description>
    </item>
    <item>
      <title>The 16 best portable Bluetooth speakers for 2026</title>
      <link>https://www.engadget.com/audio/speakers/best-portable-bluetooth-speakers-133004551.html?src=rss</link>
      <pubDate>Thu, 19 Feb 2026 10:00:35 +0000</pubDate>
      <guid isPermaLink="false">1bd3a0bd-7ca1-454b-b4cd-3afa55d51850</guid>
      <description>Portable Bluetooth speakers have become an easy default for listening away from your desk or living room. They&#8217;re the kind of tech you grab without thinking, whether you&#8217;re heading outside, cleaning the house or packing for a weekend away. The best portable options manage to sound bigger than they look, delivering clear audio without weighing down your bag.Battery life and durability matter just as much as sound quality now. Many modern speakers are built to survive splashes, dust and the occasional drop, while still offering quick pairing and stable connections. Some are designed for solo lis...</description>
    </item>
    <item>
      <title>A Simple Blood Test Could Eventually Tell You When Alzheimer&#8217;s Is Coming</title>
      <link>https://gizmodo.com/a-simple-blood-test-could-eventually-tell-you-when-alzheimers-is-coming-2000723492</link>
      <pubDate>Thu, 19 Feb 2026 10:00:15 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000723492</guid>
      <description>WashU researchers have created a model that can seemingly predict a person's symptoms of Alzheimer's within a few years.</description>
    </item>
    <item>
      <title>How to Organize Safely in the Age of Surveillance</title>
      <link>https://www.wired.com/story/how-to-organize-safely-in-the-age-of-surveillance/</link>
      <pubDate>Thu, 19 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">6989fcc118104615c3d4103f</guid>
      <description>From threat modeling to encrypted collaboration apps, we&#8217;ve collected experts&#8217; tips and tools for safely and effectively building a group&#8212;even while being targeted and tracked by the powerful.</description>
    </item>
    <item>
      <title>iPhone Air : quand le smartphone le plus fin d&#8217;Apple affine aussi son prix de fa&#231;on drastique</title>
      <link>https://www.frandroid.com/bons-plans/2922359_iphone-air-quand-le-smartphone-le-plus-fin-dapple-affine-aussi-son-prix-de-facon-drastique</link>
      <pubDate>Thu, 19 Feb 2026 09:48:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2922359_iphone-air-quand-le-smartphone-le-plus-fin-dapple-affine-aussi-son-prix-de-facon-drastique</guid>
      <description>
L'iPhone Air est un smartphone ultrafin et l&#233;ger que vous retrouvez &#224; un super prix aujourd'hui gr&#226;ce &#224; un code promo : 887 euros au lieu de 1 229 euros.
</description>
    </item>
    <item>
      <title>D&#233;velopp&#233; par des anciens de Tesla, le bracelet Fort est taill&#233; pour suivre vos exercices de musculation</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/bracelets-connectes/2982517_developpe-par-des-anciens-de-tesla-le-bracelet-fort-est-taille-pour-suivre-vos-exercices-de-musculation</link>
      <pubDate>Thu, 19 Feb 2026 09:47:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/bracelets-connectes/2982517_developpe-par-des-anciens-de-tesla-le-bracelet-fort-est-taille-pour-suivre-vos-exercices-de-musculation</guid>
      <description>
La startup Fort, fond&#233;e par d'anciens salari&#233;s de Tesla, propose un bracelet connect&#233; d'un nouveau genre, con&#231;u sp&#233;cifiquement pour les exercices de musculation. 
</description>
    </item>
    <item>
      <title>Hybride ou thermique ? C&#8217;est de la &#171; vieille technologie &#187; pour Polestar, qui maintient le cap du 100 % &#233;lectrique</title>
      <link>https://www.frandroid.com/marques/polestar/2982435_hybride-ou-thermique-cest-de-la-vieille-technologie-pour-polestar-qui-maintient-le-cap-du-100-electrique</link>
      <pubDate>Thu, 19 Feb 2026 09:46:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/polestar/2982435_hybride-ou-thermique-cest-de-la-vieille-technologie-pour-polestar-qui-maintient-le-cap-du-100-electrique</guid>
      <description>
Si Volvo a renonc&#233; &#224; son objectif de ne plus vendre que des voitures &#233;lectriques, ce n&#8217;est pas le cas de Polestar. La marque su&#233;doise exclut le lancement de nouveaux mod&#232;les thermiques et hybrides au sein de son catalogue.
</description>
    </item>
    <item>
      <title>Bonne nouvelle pour la remorque-v&#233;lo &#224; assistance &#233;lectrique Convoy C-01, qui d&#233;barque d&#232;s cet &#233;t&#233;</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2982575_bonne-nouvelle-pour-la-remorque-velo-a-assistance-electrique-convoy-c-01-qui-debarque-des-cet-ete</link>
      <pubDate>Thu, 19 Feb 2026 09:43:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2982575_bonne-nouvelle-pour-la-remorque-velo-a-assistance-electrique-convoy-c-01-qui-debarque-des-cet-ete</guid>
      <description>
Pr&#233;sent&#233;e lors de l&#8217;Eurobike 2025, la remorque &#224; assistance &#233;lectrique Convoy C-01 sera lanc&#233;e cet &#233;t&#233; avec la promesse de transformer un v&#233;lo m&#233;canique en mod&#232;le &#233;lectrifi&#233; gr&#226;ce &#224; un syst&#232;me amovible int&#233;grant moteur, batterie et direction assist&#233;e.
</description>
    </item>
    <item>
      <title>Les Galaxy S26 vont cr&#233;er de fausses vid&#233;os et le r&#233;sultat est bluffant</title>
      <link>https://www.frandroid.com/marques/samsung/2982573_les-galaxy-s26-vont-creer-de-fausses-videos-et-le-resultat-est-bluffant</link>
      <pubDate>Thu, 19 Feb 2026 09:42:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2982573_les-galaxy-s26-vont-creer-de-fausses-videos-et-le-resultat-est-bluffant</guid>
      <description>
Samsung d&#233;voile une nouvelle fonction d'&#233;dition de ses Galaxy S26. On parle aujourd'hui de vid&#233;o et d'ajout d'&#233;l&#233;ments dynamiques dans les s&#233;quences film&#233;es.
</description>
    </item>
  </channel>
</rss>
