<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 05 Jan 2026 11:24:29 GMT</lastBuildDate>
    <item>
      <title>SwitchBot se lance dans la robotique humano&#239;de avec l&#8217;Onero H1 : c&#8217;est soit une r&#233;volution, soit une vaste blague</title>
      <link>https://www.frandroid.com/produits-android/robots/2926533_switchbot-se-lance-dans-la-robotique-humanoide-avec-lonero-h1-cest-soit-une-revolution-soit-une-vaste-blague</link>
      <pubDate>Mon, 05 Jan 2026 11:18:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/robots/2926533_switchbot-se-lance-dans-la-robotique-humanoide-avec-lonero-h1-cest-soit-une-revolution-soit-une-vaste-blague</guid>
      <description>
Vous avez vu la vid&#233;o de d&#233;mo du SwitchBot Onero H1 ? C'est impressionnant : il plie le linge, vide le lave-vaisselle, sert &#224; manger. Trop beau pour &#234;tre vrai ? Probablement. 
</description>
    </item>
    <item>
      <title>Galaxy Z Flip 8 et Z Fold 8&#160;: Samsung pourrait r&#233;ussir un v&#233;ritable tour de force</title>
      <link>https://www.01net.com/actualites/galaxy-z-flip-8-z-fold-8-samsung-pourrait-reussir-tour-de-force.html</link>
      <pubDate>Mon, 05 Jan 2026 11:14:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318072</guid>
      <description>En 2026, Samsung mettrait les petits plats dans les grands pour ses Galaxy Z Fold 8 et le Z Flip 8 qui feraient un bond en avant sur deux points cl&#233;s.</description>
    </item>
    <item>
      <title>Les Verge &#233;lectriques sont maintenant disponibles en France avec une batterie solide : une premi&#232;re mondiale</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2927887_les-verge-electriques-sont-maintenant-disponibles-en-france-avec-une-batterie-solide-une-premiere-mondiale</link>
      <pubDate>Mon, 05 Jan 2026 11:09:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2927887_les-verge-electriques-sont-maintenant-disponibles-en-france-avec-une-batterie-solide-une-premiere-mondiale</guid>
      <description>
Lorsque les leaders chinois travaillent d'arrache-pied pour proposer une batterie solide avant la fin de la d&#233;cennie, la start-up Donut Lab vient de pr&#233;senter la sienne, d&#233;j&#224; disponible sur les motos &#233;lectriques de Verge Motorcycle. Charge en 5 minutes, abordable et endurante : est-ce trop beau pour &#234;tre vrai ?
</description>
    </item>
    <item>
      <title>CES Live Blog, Day 1: The Coolest Tech We&#8217;ve Seen So Far</title>
      <link>https://www.wired.com/live/ces-2026-live-blog/</link>
      <pubDate>Mon, 05 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">6957fd7ea2ad6e107579ae74</guid>
      <description>Read our live updates from CES 2026 in Las Vegas to see the latest consumer gadgetry in all of its chatbot-enabled, sensor-packed, AI-infused glory.</description>
    </item>
    <item>
      <title>At CES 2026, Everything Is AI. What Matters Is How You Use It</title>
      <link>https://www.wired.com/story/ces-2026-what-to-expect/</link>
      <pubDate>Mon, 05 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">693cbf425ad5cfb93ac79aea</guid>
      <description>Integrated chatbots and built-in machine intelligence are no longer standout features in consumer tech. If companies want to win in the AI era, they&#8217;ve got to hone the user experience.</description>
    </item>
    <item>
      <title>Trois ans plus tard, le piratage de LastPass continue de faire des d&#233;g&#226;ts</title>
      <link>https://www.01net.com/actualites/trois-ans-plus-tard-piratage-lastpass-continue-faire-degats.html</link>
      <pubDate>Mon, 05 Jan 2026 10:59:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318070</guid>
      <description>Le piratage de LastPass alimente encore aujourd&#8217;hui une s&#233;rie de vols de cryptomonnaies. Trois ans apr&#232;s les faits, des pirates russes se servent en effet des donn&#233;es vol&#233;es pour d&#233;pouiller des investisseurs. Plus de 35 millions de dollars en cryptos ont &#233;t&#233; siphonn&#233;s et blanchis.</description>
    </item>
    <item>
      <title>Ce bo&#238;tier IA compatible ChatGPT et Claude enregistre et r&#233;sume vos r&#233;unions</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/2928199_ce-boitier-ia-compatible-chatgpt-et-claude-enregistre-et-resume-vos-reunions</link>
      <pubDate>Mon, 05 Jan 2026 10:58:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/2928199_ce-boitier-ia-compatible-chatgpt-et-claude-enregistre-et-resume-vos-reunions</guid>
      <description>
En 2015, Facebook promettait un assistant humain nomm&#233; Moneypenny. Dix ans plus tard, le nom revient au CES 2026, mais chez Oxtak. C'est un dictaphone dop&#233; aux st&#233;ro&#239;des et &#224; l'IA qui promet de r&#233;sumer votre vie pro.
</description>
    </item>
    <item>
      <title>Plus de 2 000 km d&#8217;autonomie : une petite r&#233;volution se cache derri&#232;re ce v&#233;lo &#233;lectrique</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2927959_plus-de-2-000-km-dautonomie-une-petite-revolution-se-cache-derriere-ce-velo-electrique</link>
      <pubDate>Mon, 05 Jan 2026 10:50:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2927959_plus-de-2-000-km-dautonomie-une-petite-revolution-se-cache-derriere-ce-velo-electrique</guid>
      <description>
La startup japonaise Hello Space annonce le lancement de son assistance &#224; recharge en roulant &#224; vitesse de croisi&#232;re, de quoi grandement booster l&#8217;autonomie des v&#233;los &#233;lectriques.
</description>
    </item>
    <item>
      <title>Il ne vous reste plus que quelques jours pour profiter de l&#8217;un des meilleurs gestionnaires de mots de passe &#224; -60 % [Sponso]</title>
      <link>https://www.frandroid.com/services/vpn/2913779_il-ne-vous-reste-plus-que-quelques-jours-pour-profiter-de-lun-des-meilleurs-gestionnaires-de-mots-de-passe-a-60</link>
      <pubDate>Mon, 05 Jan 2026 10:46:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/vpn/2913779_il-ne-vous-reste-plus-que-quelques-jours-pour-profiter-de-lun-des-meilleurs-gestionnaires-de-mots-de-passe-a-60</guid>
      <description>
Vous n&#8217;avez pas encore profit&#233; de Proton Pass &#224; -60 % pour renforcer la s&#233;curit&#233; de vos mots de passe ? Aucun probl&#232;me, Proton repousse la fin de son offre de quelques jours pour vous permettre d&#8217;arranger &#231;a.
</description>
    </item>
    <item>
      <title>CES 2026: Gaming trends to expect at the show</title>
      <link>https://mashable.com/article/ces-2026-gaming-trends</link>
      <pubDate>Mon, 05 Jan 2026 10:45:49 +0000</pubDate>
      <guid isPermaLink="false">00ZmPjuJ4BRZPSQOJgHBJkk</guid>
      <description>While CES isn't typically heavily focused on video games, there's still some info worth checking out this year.</description>
    </item>
    <item>
      <title>Samsung Galaxy S26 Edge : le smartphone ultra-fin que l&#8217;on croyait mort donne signe de vie</title>
      <link>https://www.frandroid.com/marques/2928029_samsung-galaxy-s26-edge-le-smartphone-ultra-fin-que-lon-croyait-mort-donne-signe-de-vie</link>
      <pubDate>Mon, 05 Jan 2026 10:34:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2928029_samsung-galaxy-s26-edge-le-smartphone-ultra-fin-que-lon-croyait-mort-donne-signe-de-vie</guid>
      <description>
Le feuilleton du Galaxy S26 Edge conna&#238;t un nouveau rebondissement. L'apparition d'une certification officielle en Inde sugg&#232;re que Samsung n'a pas encore dit son dernier mot sur le segment des smartphones ultrafins.
</description>
    </item>
    <item>
      <title>Monster Hunter Wilds could be heading to Switch 2 as dataminers leak graphical presets for Nintendo's console</title>
      <link>https://www.techradar.com/gaming/monster-hunter-wilds-could-be-heading-to-switch-2-as-dataminers-leak-graphical-presets-for-nintendos-console</link>
      <pubDate>Mon, 05 Jan 2026 10:33:50 +0000</pubDate>
      <guid isPermaLink="false">UXPjqHe2LpuT8C7BZ9qQhG</guid>
      <description>Dataminers reveal potential evidence of a Monster Hunter Wilds Switch 2 port, but it'll be a hard sell with no cross-save support.</description>
    </item>
    <item>
      <title>Yes, Arc Raiders does matchmake you based on how friendly or aggressive you are</title>
      <link>https://www.techradar.com/gaming/yes-arc-raiders-does-matchmake-you-based-on-how-friendly-or-aggressive-you-are</link>
      <pubDate>Mon, 05 Jan 2026 10:30:51 +0000</pubDate>
      <guid isPermaLink="false">ujiBwHRFSRmKYVB7vTHND9</guid>
      <description>Arc Raiders now matches you with like-minded players based on your proclivity towards PvP or PvE. This is according to developer comments shared during an extended playthrough.</description>
    </item>
    <item>
      <title>I Switched to eSIM, and I Am Full of Regret</title>
      <link>https://www.wired.com/story/i-switched-to-esim-and-i-am-full-of-regret/</link>
      <pubDate>Mon, 05 Jan 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">6957fae899ff4b887feba9e4</guid>
      <description>Switching between mobile phones used to be easy. Then came eSIM.</description>
    </item>
    <item>
      <title>Starlink offers free internet access in Venezuela following Maduro raid</title>
      <link>https://www.engadget.com/big-tech/starlink-offers-free-internet-access-in-venezuela-following-maduro-raid-102705135.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 10:27:05 +0000</pubDate>
      <guid isPermaLink="false">e719aaee-2e27-45da-91a4-d4ebab9fd51f</guid>
      <description>SpaceX&#8217;s Starlink is offering customers in Venezuela free access to its internet service after the US captured the country&#8217;s president, Nicol&#225;s Maduro. According to CNBC, some areas of Caracas and other parts of the country lost power and internet connectivity in the wake of the operation.&#160;Starlink says its focus is &#8220;on enabling connectivity for new and existing customers to support the people of Venezuela.&#8221; At the time of writing, Starlink does not yet appear to formally operate in the country, as its availability map states that service there is "coming soon."&#160;Still, Starlink says it is proa...</description>
    </item>
    <item>
      <title>SwitchBot Obboto : une lampe globe avec 2900 LEDs pour le pixel art</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/2927995_switchbot-obboto-une-lampe-globe-avec-2900-leds-pour-le-pixel-art</link>
      <pubDate>Mon, 05 Jan 2026 10:24:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/2927995_switchbot-obboto-une-lampe-globe-avec-2900-leds-pour-le-pixel-art</guid>
      <description>
Il faut qu'on parle de l'obsession de mettre de l'IA partout. M&#234;me dans une lampe. SwitchBot d&#233;voile l'Obboto, un globe lumineux capable de g&#233;n&#233;rer des "animations d'ambiance contr&#244;l&#233;es par l'IA". Au-del&#224; du buzzword, c'est surtout un tr&#232;s joli afficheur pixel art qui pourrait bien faire de l'ombre au c&#233;l&#232;bre LaMetric Time.
</description>
    </item>
    <item>
      <title>La manette Pro de la Nintendo Switch 2 revient en promotion pour le d&#233;but de l&#8217;ann&#233;e 2026</title>
      <link>https://www.frandroid.com/bons-plans/2633865_la-manette-pro-de-la-nintendo-switch-2-revient-en-promotion-pour-le-debut-de-lannee-2026</link>
      <pubDate>Mon, 05 Jan 2026 10:22:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2633865_la-manette-pro-de-la-nintendo-switch-2-revient-en-promotion-pour-le-debut-de-lannee-2026</guid>
      <description>
Plus performante que la premi&#232;re version, la Nintendo Switch 2 Pro Controller est un accessoire id&#233;al qui permet d'exploiter tout le potentiel de la r&#233;cente console de la marque. Pour ce d&#233;but d'ann&#233;e 2026, on la trouve &#224; 69,99 euros au lieu de 89,90 euros chez Micromania.
</description>
    </item>
    <item>
      <title>Nvidia pr&#233;parerait une appli GeForce Now pour Linux</title>
      <link>https://www.01net.com/actualites/nvidia-preparerait-une-appli-geforce-now-pour-linux.html</link>
      <pubDate>Mon, 05 Jan 2026 10:22:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318075</guid>
      <description>Les joueurs abonn&#233;s au service de jeux en streaming de NVIDIA vont enfin pouvoir en profiter sur Linux. Nvdia serait sur le point de d&#233;voiler un nouveau client natif pour cet OS.</description>
    </item>
    <item>
      <title>How to watch Nigeria vs. Mozambique online for free</title>
      <link>https://mashable.com/article/nigeria-mozambique-africa-cup-of-nations-2025-live-stream-for-free</link>
      <pubDate>Mon, 05 Jan 2026 10:21:29 +0000</pubDate>
      <guid isPermaLink="false">01curlm1QxIGywxphCwADD3</guid>
      <description>How to watch AFCON for free. Live stream Nigeria vs. Mozambique in the 2025 Africa Cup of Nations for free.</description>
    </item>
    <item>
      <title>SwitchBot lance une station m&#233;t&#233;o avec &#233;cran E-Ink de 7,5 pouces boost&#233;e &#224; l&#8217;IA</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/2926729_switchbot-lance-une-station-meteo-avec-ecran-e-ink-de-75-pouces-boostee-a-lia</link>
      <pubDate>Mon, 05 Jan 2026 10:18:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/2926729_switchbot-lance-une-station-meteo-avec-ecran-e-ink-de-75-pouces-boostee-a-lia</guid>
      <description>
SwitchBot continue de tisser sa toile dans la maison connect&#233;e. Cette fois, la marque s'attaque &#224; l'affichage domestique avec une station m&#233;t&#233;o dot&#233;e d'un &#233;cran E-Ink. Loin d'&#234;tre un simple thermom&#232;tre de luxe, c'est un v&#233;ritable hub d'informations qui promet m&#234;me des "briefings m&#233;t&#233;o" boost&#233;s &#224; l'IA. 
</description>
    </item>
    <item>
      <title>How to watch Egypt vs. Benin online for free</title>
      <link>https://mashable.com/article/egypt-benin-africa-cup-of-nations-2025-live-stream-for-free</link>
      <pubDate>Mon, 05 Jan 2026 10:12:20 +0000</pubDate>
      <guid isPermaLink="false">00ozhaKHRuKQ8IR3VGs7axp</guid>
      <description>How to watch AFCON for free. Live stream Egypt vs. Benin in the 2025 Africa Cup of Nations for free.</description>
    </item>
    <item>
      <title>Microsoft va se calmer sur l&#8217;affichage des publicit&#233;s dans Windows 11</title>
      <link>https://www.frandroid.com/marques/microsoft/2927461_microsoft-va-se-calmer-sur-laffichage-des-publicites-dans-windows-11</link>
      <pubDate>Mon, 05 Jan 2026 10:09:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2927461_microsoft-va-se-calmer-sur-laffichage-des-publicites-dans-windows-11</guid>
      <description>
Les &#233;quipes de Microsoft testent une nouvelle option dans les param&#232;tres de Partage pour limiter certaines suggestions publicitaires dans Windows 11.
</description>
    </item>
    <item>
      <title>Nearly half a million patients exposed in healthcare breach - here's what we know</title>
      <link>https://www.techradar.com/pro/security/nearly-half-a-million-patients-exposed-in-healthcare-breach-heres-what-we-know</link>
      <pubDate>Mon, 05 Jan 2026 10:08:42 +0000</pubDate>
      <guid isPermaLink="false">QQwkTatKxtUBgzcK2pUMzA</guid>
      <description>Last May, Qilin struck Covenant Health, but initial reports claimed it to be a limited incident.</description>
    </item>
    <item>
      <title>ASUS ne sortira aucun smartphone en 2026&#160;: vers la fin d&#8217;une &#232;re&#160;?</title>
      <link>https://www.01net.com/actualites/asus-ne-sortira-aucun-smartphone-en-2026-vers-la-fin-dune-ere.html</link>
      <pubDate>Mon, 05 Jan 2026 10:02:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318048</guid>
      <description>Le couperet est tomb&#233; pour les fans de la marque ta&#239;wanaise : ASUS confirme qu'aucun nouveau mod&#232;le ne verra le jour cette ann&#233;e. Une &#171; pause &#187; qui ressemble &#233;trangement &#224; des adieux.</description>
    </item>
    <item>
      <title>CES 2026 live updates: The latest news, surprises, strange tech, and more</title>
      <link>https://mashable.com/live/ces-2026-news-live-updates</link>
      <pubDate>Mon, 05 Jan 2026 10:01:29 +0000</pubDate>
      <guid isPermaLink="false">00HdPGMgSorg1E6HI6usOJ2</guid>
      <description>CES 2026 is here. See the latest news on bleeding-edge tech, EV advancements, and more.</description>
    </item>
    <item>
      <title>The 5 best meditation apps for 2026</title>
      <link>https://www.engadget.com/apps/best-meditation-app-140047993.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 10:01:27 +0000</pubDate>
      <guid isPermaLink="false">4823369b-dc62-4e7a-8b4c-144062f5d2af</guid>
      <description>Daily life can get loud, and meditation apps offer a simple way to carve out a little breathing room. You do not need experience to start, and you do not need to commit to long sessions either. Most apps guide you through short practices that help with focus, sleep and stress, making it easy to build a routine even on busy days.There are plenty of meditation apps to choose from, each with its own style and approach. Some focus on mindfulness basics, others offer structured programs and a few add community features for accountability. I tested the most popular options to find the best meditatio...</description>
    </item>
    <item>
      <title>How to watch the 2025 Africa Cup of Nations online for free</title>
      <link>https://mashable.com/article/africa-cup-of-nations-2025-live-stream-for-free</link>
      <pubDate>Mon, 05 Jan 2026 10:01:18 +0000</pubDate>
      <guid isPermaLink="false">01x6w2GJ5DTY19LQCP9NGqI</guid>
      <description>How to watch Africa Cup of Nations for free. Live stream the 2025 Africa Cup of Nations for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Silicon Valley Is Flirting with a Very Stupid New Way to Die</title>
      <link>https://gizmodo.com/silicon-valley-is-flirting-with-a-very-stupid-new-way-to-die-2000705108</link>
      <pubDate>Mon, 05 Jan 2026 10:00:46 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705108</guid>
      <description>Peptides are legal and relatively harmless. Habitually injecting yourself with mysterious powders though?</description>
    </item>
    <item>
      <title>Flu Is Relentless. Crispr Might Be Able to Shut It Down</title>
      <link>https://www.wired.com/story/crispr-flu-antivirals/</link>
      <pubDate>Mon, 05 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">694049627b304af519561d7b</guid>
      <description>Innovative research into the gene-editing tool targets influenza&#8217;s ability to replicate&#8212;stopping it in its tracks.</description>
    </item>
    <item>
      <title>Kodiak taps Bosch to scale its self-driving truck tech</title>
      <link>https://techcrunch.com/2026/01/05/kodiak-taps-bosch-to-scale-its-self-driving-truck-tech/</link>
      <pubDate>Mon, 05 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3079614</guid>
      <description>There is no timeline for when these systems will become available. But once they do, Kodiak could bring its tech to more trucks, faster.</description>
    </item>
    <item>
      <title>This ingenious umbrella just solved a 175-year-old design flaw</title>
      <link>https://www.fastcompany.com/91462103/ori-umbrella</link>
      <pubDate>2026-01-05T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91462103/ori-umbrella</guid>
      <description>Origami does away with that pesky (but long-standing) design feature: the steel frame.
The design of the steel-ribbed umbrella has changed little since it was introduced in the 1850s, but the mechanical engineers and origami experts who made an umbrella that works by folding say they&#8217;ve finally improved upon it.</description>
    </item>
    <item>
      <title>Tech stocks will stall, electricity will get cheaper and . . . the U.S. will win the World Cup? 8 bold business predictions for 2026</title>
      <link>https://www.fastcompany.com/91462356/8-bold-business-predictions-for-2026</link>
      <pubDate>2026-01-05T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91462356/8-bold-business-predictions-for-2026</guid>
      <description>From nuclear power to immigration to layoffs, here are some attempts to guess the big business stories of the next 12 months.
I am not clairvoyant and have no crystal ball. But I&#8217;ve got some predictions for 2026.&#160;</description>
    </item>
    <item>
      <title>In 2026, venture capital&#8217;s hunger for AI will be insatiable</title>
      <link>https://www.fastcompany.com/91465347/2026-venture-capital-artificial-intelligence-openai-anduril</link>
      <pubDate>2026-01-05T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91465347/2026-venture-capital-artificial-intelligence-openai-anduril</guid>
      <description>There&#8217;s&#160;also venture interest in fintech, space, and defense startups, but the big money&#8217;s still pushing into artificial intelligence.
For venture capital, 2025 was&#160;all about artificial intelligence&#8212;a trend&#160;that&#8217;s&#160;all but certain to carry into 2026.</description>
    </item>
    <item>
      <title>CES 2026: This smart hummingbird feeder has slow-motion 4K video</title>
      <link>https://mashable.com/article/ces-2026-birdfy-hum-bloom-hummingbird-feeder</link>
      <pubDate>Mon, 05 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">072svfknMQyaa124se0sHV9</guid>
      <description>Birdfy makes a popular line of smart bird feeders, and at CES 2026, it debuted the Birdfy Hum Bloom, which offers slow-motion video.</description>
    </item>
    <item>
      <title>CES 2026: This portable device will test meals for allergens in minutes</title>
      <link>https://mashable.com/article/ces-2026-allergen-alert-mini-lab</link>
      <pubDate>Mon, 05 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">05Y66ei8fTZDoNRRo2wWbR2</guid>
      <description>Mashable checked out the Allergen Alert mini lab at CES 2026's Unveiled media event. It's a portable device that can test for food allergens.</description>
    </item>
    <item>
      <title>Own Microsoft&#8217;s project management tools for just $9.97</title>
      <link>https://mashable.com/article/jan-5-microsoft-project-2021-professional-lifetime-license-for-windows</link>
      <pubDate>Mon, 05 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01RbjwyDvIh5olH3hbKplvN</guid>
      <description>Get Microsoft Project 2021 Professional for Windows as a lifetime license for just $9.97 &#8212; new users only.</description>
    </item>
    <item>
      <title>Was 2016 the last good year?</title>
      <link>https://mashable.com/article/2016-the-last-good-year-genz-nostalgia</link>
      <pubDate>Mon, 05 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02ytNPiS0Cf1sSShhLYA1RD</guid>
      <description>Why does the year 2016 still mean so much to Gen Z? A personal look at nostalgia, TikTok trends, and the internet before everything changed.</description>
    </item>
    <item>
      <title>Exoplan&#232;tes : 30 ans apr&#232;s la premi&#232;re d&#233;couverte, la chasse entre dans une phase d&#233;cisive</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-exoplanetes-30-ans-apres-premiere-decouverte-chasse-phase-decisive-129380/#xtor%3DRSS-8</link>
      <pubDate>Mon, 05 Jan 2026 10:57:48 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-exoplanetes-30-ans-apres-premiere-decouverte-chasse-phase-decisive-129380/#xtor%3DRSS-8</guid>
      <description>Depuis les ann&#233;es 2010, l&#8217;Observatoire de la C&#244;te d&#8217;Azur (OCA) m&#232;ne des campagnes d'observation&#160;dans l'Antarctique dans le cadre du projet&#160;Astep (Antarctic Search for Transiting Extrasolar Planets). En th&#233;orie, cela permet de chercher, &#224; moindre co&#251;t, des exoplan&#232;tes habitables proches du...</description>
    </item>
    <item>
      <title>Motorola Razr Fold : le premier smartphone pliable au format livre de la marque a fuit&#233;</title>
      <link>https://www.frandroid.com/marques/motorola/2927445_motorola-razr-fold-le-premier-smartphone-pliable-au-format-livre-de-la-marque-a-fuite</link>
      <pubDate>Mon, 05 Jan 2026 09:57:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/motorola/2927445_motorola-razr-fold-le-premier-smartphone-pliable-au-format-livre-de-la-marque-a-fuite</guid>
      <description>
Alors que Motorola s'est jusqu'ici cantonn&#233; au march&#233; des smartphones &#224; clapet, une fuite r&#233;v&#232;le l'existence du &#171; Razr Fold &#187;. Ce mod&#232;le, au format livre, viendrait directement concurrencer les r&#233;f&#233;rences de Samsung et Google d&#232;s 2026.
</description>
    </item>
    <item>
      <title>2025 Digital rights review: Spyware, AI war &amp; EU regulations</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/2025-digital-rights-review-spyware-ai-war-and-eu-regulations</link>
      <pubDate>Mon, 05 Jan 2026 09:52:57 +0000</pubDate>
      <guid isPermaLink="false">xsFWfwms4CwAnQGHLzVdWY</guid>
      <description>We spoke to the digital rights organization Access Now about the most significant developments of the past 12 months. Here's what they said.</description>
    </item>
    <item>
      <title>Les voitures &#233;lectriques de Xiaomi viennent de r&#233;ussir un exploit que Tesla a mis 2 fois plus de temps &#224; atteindre</title>
      <link>https://www.frandroid.com/marques/xiaomi/2927385_les-voitures-electriques-de-xiaomi-viennent-de-reussir-un-exploit-que-tesla-a-mis-2-fois-plus-de-temps-a-atteindre</link>
      <pubDate>Mon, 05 Jan 2026 09:50:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2927385_les-voitures-electriques-de-xiaomi-viennent-de-reussir-un-exploit-que-tesla-a-mis-2-fois-plus-de-temps-a-atteindre</guid>
      <description>
Avec plus de 410 000 exemplaires vendus en 2025, les voitures &#233;lectriques de Xiaomi ont d&#233;pass&#233; les attentes. &#192; tel point que son patron a annonc&#233; &#234;tre rentable, et de relever son objectif de livraisons pour 2026.
</description>
    </item>
    <item>
      <title>Garmin Instinct 3 Amoled : Amazon brade d&#233;j&#224; &#224; -44 % cette montre outdoor lanc&#233;e en 2025</title>
      <link>https://www.frandroid.com/bons-plans/2531487_garmin-instinct-3-amoled-amazon-brade-deja-a-moins-44-pourcents-cette-montre-outdoor-lancee-en-2025</link>
      <pubDate>Mon, 05 Jan 2026 09:46:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2531487_garmin-instinct-3-amoled-amazon-brade-deja-a-moins-44-pourcents-cette-montre-outdoor-lancee-en-2025</guid>
      <description>
Annonc&#233;e lors du CES 2025 de Las Vegas, la Garmin Instinct 3 Amoled est une montre connect&#233;e sportive qui vous accompagne partout au tarif exceptionnel de 251,54 euros, au lieu de 449 euros habituellement. 
</description>
    </item>
    <item>
      <title>Data sovereignty: not just an issue for governments</title>
      <link>https://www.techradar.com/pro/data-sovereignty-not-just-an-issue-for-governments</link>
      <pubDate>Mon, 05 Jan 2026 09:46:04 +0000</pubDate>
      <guid isPermaLink="false">9EUuH2yq7HsYojSpAAGvDR</guid>
      <description>Data sovereignty is a major concern not just for governments but for organizations across sectors.</description>
    </item>
    <item>
      <title>Le gros coup de Decathlon, qui pourrait booster le v&#233;lo (&#233;lectrique) d&#8217;entreprise en France</title>
      <link>https://www.frandroid.com/marques/decathlon/2927657_le-gros-coup-de-decathlon-qui-pourrait-booster-le-velo-electrique-dentreprise-en-france</link>
      <pubDate>Mon, 05 Jan 2026 09:43:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/decathlon/2927657_le-gros-coup-de-decathlon-qui-pourrait-booster-le-velo-electrique-dentreprise-en-france</guid>
      <description>
Decathlon Pulse, la filiale d&#8217;investissement de Decathlon, va devenir majoritaire dans le groupe Bikeleasing, sp&#233;cialiste de la location de v&#233;los d&#8217;entreprise dans les pays germanophones. Une acquisition qui en dit long sur les ambitions du groupe fran&#231;ais.
</description>
    </item>
    <item>
      <title>Jackery d&#233;voile un robot solaire autonome et une pergola photovolta&#239;que</title>
      <link>https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2927715_jackery-devoile-un-robot-solaire-autonome-et-une-pergola-photovoltaique</link>
      <pubDate>Mon, 05 Jan 2026 09:41:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2927715_jackery-devoile-un-robot-solaire-autonome-et-une-pergola-photovoltaique</guid>
      <description>
On pensait avoir tout vu en mati&#232;re de batteries externes. Mais Jackery vient de dynamiter le CES 2026. Ici, ce n'est pas une simple station qu'on jette dans le coffre : la marque pr&#233;sente un robot autonome qui chasse le soleil et une pergola photovolta&#239;que pour votre jardin.
</description>
    </item>
    <item>
      <title>Alerte Chrome, Edge et Firefox&#160;: un empire de l&#8217;espionnage chinois a &#233;t&#233; d&#233;couvert</title>
      <link>https://www.01net.com/actualites/alerte-chrome-edge-firefox-empire-espionnage-chinois-decouvert.html</link>
      <pubDate>Mon, 05 Jan 2026 09:36:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318042</guid>
      <description>Un empire chinois de l'espionnage sur Chrome, Edge et Firefox a &#233;t&#233; d&#233;busqu&#233; par les chercheurs en cybers&#233;curit&#233; de Koi. Patient et m&#233;thodique, le groupe DarkSpectre a inond&#233; les boutiques d'extensions en apparence l&#233;gitimes qui sont en fait taill&#233;es pour siphonner vos donn&#233;es. L'entit&#233; vise notamment les informations sur des r&#233;unions d'entreprises....</description>
    </item>
    <item>
      <title>How to watch the 2025-26 Ashes online for free</title>
      <link>https://mashable.com/article/the-ashes-live-stream-for-free</link>
      <pubDate>Mon, 05 Jan 2026 09:31:46 +0000</pubDate>
      <guid isPermaLink="false">00Yaq6FSTrq39LbcVl2eVzs</guid>
      <description>How to watch The Ashes for free. Live stream the 2025-26 Ashes series for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Nouvelle fuite de donn&#233;es en France&#160;: Doctolib d&#233;ment &#234;tre responsable du vol de 150&#160;000 dossiers de patients</title>
      <link>https://www.01net.com/actualites/fuite-donnees-doctolib-informations-milliers-francais-compromises.html</link>
      <pubDate>Mon, 05 Jan 2026 09:29:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318023</guid>
      <description>Doctolib s'est retrouv&#233; au c&#339;ur d'une nouvelle fuite de donn&#233;es ce week-end. Plus de 150 000 fiches patients issues de l&#8217;H&#244;pital priv&#233; de la Miotte et d&#8217;un cabinet d&#8217;ophtalmologie de Sallanches circulent sur le dark web. Les deux &#233;tablissements passaient par Doctolib pour permettre aux patients de prendre rendez-vous. Interrog&#233; par 01net, Doctolib d&#233;ment fermement toute violation et pr&#233;cise que les donn&#233;es n'ont pas &#233;t&#233; vol&#233;es sur ses serveurs....</description>
    </item>
    <item>
      <title>Fini la corv&#233;e du rangement avant l&#8217;aspirateur&#160;? Narwal pr&#233;sente le Flow 2</title>
      <link>https://www.01net.com/actualites/fini-corvee-rangement-avant-aspirateur-narwal-presente-flow-2.html</link>
      <pubDate>Mon, 05 Jan 2026 09:27:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318047</guid>
      <description>Le Narwal Flow 2, fra&#238;chement d&#233;voil&#233; au CES 2026, entend r&#233;soudre l'un des d&#233;fauts r&#233;currents des robots : aspirer des petits objets ou des c&#226;bles, qui n&#233;cessitent souvent de voler &#224; leur secours.</description>
    </item>
  </channel>
</rss>
