<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 16 Feb 2026 17:41:12 GMT</lastBuildDate>
    <item>
      <title>&#171;&#160;Vous pouvez jailbreaker un F-35 comme un iPhone&#160;&#187; : pourquoi les Pays-Bas envisagent de cracker leurs avions de chasse</title>
      <link>https://www.01net.com/actualites/jailbreaker-f35-comme-iphone-pays-bas-cracker-avions-chasse.html</link>
      <pubDate>Mon, 16 Feb 2026 17:39:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326213</guid>
      <description>Le fleuron de l&#8217;aviation am&#233;ricaine pourrait-il &#234;tre &#171; jailbreak&#233; &#187; aussi facilement qu&#8217;un iPhone ? C&#8217;est en tout cas la piste &#233;voqu&#233;e par l'ancien secr&#233;taire d&#8217;&#201;tat &#224; la D&#233;fense des Pays-Bas dans le cas o&#249; les &#201;tats-Unis d&#233;cideraient de bloquer &#224; distance l&#8217;utilisation de sa flotte de F-35 et de celles d&#8217;autres alli&#233;s europ&#233;ens.</description>
    </item>
    <item>
      <title>Looking for a great deal on a KitchenAid mixer this Presidents' Day? Skip the sales and get an officially refurbished one half price instead</title>
      <link>https://www.techradar.com/home/small-appliances/looking-for-a-great-deal-on-a-kitchenaid-mixer-this-presidents-day-skip-the-sales-and-get-an-officially-refurbished-one-half-price-instead</link>
      <pubDate>Mon, 16 Feb 2026 17:37:57 +0000</pubDate>
      <guid isPermaLink="false">wFYjn8L2Tzcf4RgKnwcNeC</guid>
      <description>Find huge savings on KitchenAid's officially refurbished mixers, which come complete with warranties and full customer service.</description>
    </item>
    <item>
      <title>Way better than a Chromebook: This $330 Dell 15 Windows 11 laptop is the ultimate 'work-from-anywhere' deal in the Presidents' Day sale</title>
      <link>https://www.techradar.com/pro/way-better-than-a-chromebook-this-usd330-dell-15-windows-11-laptop-is-the-ultimate-work-from-anywhere-deal-in-the-presidents-day-sale</link>
      <pubDate>Mon, 16 Feb 2026 17:35:34 +0000</pubDate>
      <guid isPermaLink="false">q9nyAvJBmDqrEosMXm2q4B</guid>
      <description>The $330 Dell 15 Laptop ticks all my boxes for business or home use, with a Core 3 processor, 8GB RAM, and a fast 512GB SSD.</description>
    </item>
    <item>
      <title>Edifier&#8217;s portable wireless speaker has won me over with its bargain price, compelling sound and stunning looks &#8212; and this $100 President&#8217;s Day discount makes it a must-buy</title>
      <link>https://www.techradar.com/audio/wireless-bluetooth-speakers/edifiers-portable-wireless-speaker-has-won-me-over-with-its-bargain-price-compelling-sound-and-stunning-looks-and-this-usd100-presidents-day-discount-makes-it-a-must-buy</link>
      <pubDate>Mon, 16 Feb 2026 17:30:47 +0000</pubDate>
      <guid isPermaLink="false">4mUuaP4xtkcjgo7eNfiABe</guid>
      <description>This Edifier speaker has an enormous $100 off for President&#8217;s Day &#8212; making it a bargain I don&#8217;t think you can afford to sleep on.</description>
    </item>
    <item>
      <title>Tomb Raider just launched on iOS and Android complete with all of its biggest DLC and a seriously tempting price tag</title>
      <link>https://www.techradar.com/gaming/mobile-gaming/tomb-raider-just-launched-on-ios-and-android-complete-with-all-of-its-biggest-dlc-and-a-seriously-tempting-price-tag</link>
      <pubDate>Mon, 16 Feb 2026 17:25:01 +0000</pubDate>
      <guid isPermaLink="false">PbE8iibyJPJ2rXUZvR7tb5</guid>
      <description>Tomb Raider has launched for iOS and Android phones with all of its original DLC.</description>
    </item>
    <item>
      <title>Farewell Apple iWork? Iconic brand appears to be disappearing in favor of Creator Studio</title>
      <link>https://www.techradar.com/pro/farewell-apple-iwork-iconic-brand-appears-to-be-disappearing-in-favor-of-creator-studio</link>
      <pubDate>Mon, 16 Feb 2026 17:25:00 +0000</pubDate>
      <guid isPermaLink="false">RWreEpvQq3BDmzy3E6me9a</guid>
      <description>Apple's iWork brand looks to have been retired after two decades, with the launch of new Creator Studio, which includes paid subscriptions.</description>
    </item>
    <item>
      <title>My favorite Windows 11 mini PC is perfect for work and it's got a big price-cut in the Presidents' Day sale &#8212; but you'll need to act fast</title>
      <link>https://www.techradar.com/pro/my-favorite-windows-11-mini-pc-is-perfect-for-work-and-its-got-a-big-price-cut-in-the-presidents-day-sale-but-youll-need-to-act-fast</link>
      <pubDate>Mon, 16 Feb 2026 17:24:09 +0000</pubDate>
      <guid isPermaLink="false">VB3rGWa9JJPsSZT9g6v6WG</guid>
      <description>The Geekom A5 Pro mini PC delivers fast everyday performance in a tiny, space saving design, and it's now down to $699 for Presidents' Day.</description>
    </item>
    <item>
      <title>At this price, the Jackery 300 Plus portable power station is the Presidents' Day sale must-buy for reliable off-grid power</title>
      <link>https://www.techradar.com/pro/at-this-price-the-jackery-300-plus-portable-power-station-is-the-presidents-day-sale-must-buy-for-reliable-off-grid-power</link>
      <pubDate>Mon, 16 Feb 2026 17:17:19 +0000</pubDate>
      <guid isPermaLink="false">HBuxkjvDTZwhq7YmKqth43</guid>
      <description>Best Buy is running a big price cut on the Jackery Explorer 300 Plus, knocking $100 off this compact portable power station for President&#8217;s Day.</description>
    </item>
    <item>
      <title>This entry-level Alienware 16X Aurora Gaming Laptop is now down to $999.99</title>
      <link>https://www.techradar.com/computing/gaming-laptops/this-entry-level-alienware-16x-aurora-gaming-laptop-is-now-down-to-usd999-99</link>
      <pubDate>Mon, 16 Feb 2026 17:17:13 +0000</pubDate>
      <guid isPermaLink="false">uu7irfapMKFUzHHjFGBEKK</guid>
      <description>If you're shopping for a budget-friendly and high-quality gaming laptop in the Presidents' Day sales, then it's going to be hard to beat this Alienware 16X Aurora for $999.99.</description>
    </item>
    <item>
      <title>My job is testing budget earbuds and I'd buy these 4 options right now in the Presidents' Day sales &#8212; including a lowest price deal on my top pick</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/the-best-earbuds-deals-in-the-presidents-day-sales</link>
      <pubDate>Mon, 16 Feb 2026 17:15:33 +0000</pubDate>
      <guid isPermaLink="false">3fDbZhkjQH5F5wvEAkxjo6</guid>
      <description>It seems like every pair of earbuds I've enjoyed is discounted right now; here are five you should check out, all at reduced prices.</description>
    </item>
    <item>
      <title>I've spent 18 hours taking down Big Pharma in High On Life 2, and it's exactly what a sequel should be</title>
      <link>https://www.techradar.com/gaming/high-on-life-2-review</link>
      <pubDate>Mon, 16 Feb 2026 17:11:36 +0000</pubDate>
      <guid isPermaLink="false">ZZhnzSyN3r5NCi9RGhC4i8</guid>
      <description>High On Life 2 is an inventive FPS campaign that improves on its predecessor in every way, but a litany of technical faults has it feeling like it could've stayed in the oven for a bit longer.</description>
    </item>
    <item>
      <title>Triple Matinale au menu : voici notre programme Twitch de la semaine</title>
      <link>https://www.frandroid.com/humanoid/emissions/2632585_triple-matinale-au-menu-voici-notre-programme-twitch-de-la-semaine</link>
      <pubDate>Mon, 16 Feb 2026 17:11:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/emissions/2632585_triple-matinale-au-menu-voici-notre-programme-twitch-de-la-semaine</guid>
      <description>
Notre programme Twitch de la semaine du lundi 16 f&#233;vier 2026, c&#8217;est juste ici : nous vous donnons rendez-vous, mardi, jeudi et vendredi sur notre cha&#238;ne Frandroidlive, pour siroter votre caf&#233; devant notre Matinale Tech' nouvelle formule.
</description>
    </item>
    <item>
      <title>Tout simplement monstrueux : ce laptop gaming avec une RTX 5080, un Intel Core U9 et un &#233;cran 2,5K 18&#8243; est en promo &#224; -900 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2979009_tout-simplement-monstrueux-ce-laptop-gaming-avec-une-rtx-5080-un-intel-core-u9-et-un-ecran-25k-18-est-en-promo-a-900-e</link>
      <pubDate>Mon, 16 Feb 2026 17:05:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2979009_tout-simplement-monstrueux-ce-laptop-gaming-avec-une-rtx-5080-un-intel-core-u9-et-un-ecran-25k-18-est-en-promo-a-900-e</guid>
      <description>
C'est tout simplement le laptop gaming ultime : l'Asus ROG Strix G18 est une machine de guerre sur&#233;quip&#233;e que vous retrouvez chez E.Leclerc pour 3 099 euros au lieu de 3 999 euros.
</description>
    </item>
    <item>
      <title>Il divise le temps de travail par 280 : ce robot g&#233;ant de Stellantis fait en 1 heure ce qu&#8217;un employ&#233; fait en 7 semaines</title>
      <link>https://www.frandroid.com/survoltes/2979185_il-divise-le-temps-de-travail-par-280-ce-robot-geant-de-stellantis-fait-en-1-heure-ce-quun-employe-fait-en-7-semaines</link>
      <pubDate>Mon, 16 Feb 2026 17:03:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2979185_il-divise-le-temps-de-travail-par-280-ce-robot-geant-de-stellantis-fait-en-1-heure-ce-quun-employe-fait-en-7-semaines</guid>
      <description>
Dans son usine am&#233;ricaine de Sterling Heights, dans le Michigan, Stellantis a d&#233;ploy&#233; un robot autonome de 3,66 m&#232;tres de haut capable de scanner l'int&#233;gralit&#233; de son inventaire de pi&#232;ces en une heure. Une innovation qui divise le temps de travail par 280 selon le constructeur.
</description>
    </item>
    <item>
      <title>Les stocks de disques durs m&#233;caniques passent eux aussi &#224; la casserole</title>
      <link>https://www.01net.com/actualites/les-stocks-de-disques-durs-mecaniques-passent-eux-aussi-a-la-casserole.html</link>
      <pubDate>Mon, 16 Feb 2026 17:02:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326201</guid>
      <description>La m&#233;moire vive et le stockage SSD ne sont pas les seuls composants touch&#233;s par la demande gigantesque des entreprises de l'IA. L'approvisionnement en bons vieux disques durs traditionnels est lui aussi sous tension ! Western Digital affirme ainsi avoir &#233;coul&#233; l'ensemble de sa capacit&#233; de production pour 2026 &#8212; et nous ne sommes qu'en f&#233;vrier.</description>
    </item>
    <item>
      <title>How Ricursive Intelligence raised $335M at a $4B valuation in 4 months</title>
      <link>https://techcrunch.com/2026/02/16/how-ricursive-intelligence-raised-335m-at-a-4b-valuation-in-4-months/</link>
      <pubDate>Mon, 16 Feb 2026 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3093032</guid>
      <description>The reason why this nascent startup had VCs lining up is the founders.They are so famed in the AI world, everyone tried to hire them.</description>
    </item>
    <item>
      <title>What is the release date for Dove Cameron and Avan Jogia's new Prime Video show 56 Days?</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/what-is-the-release-date-for-dove-cameron-and-avon-jogias-new-prime-video-show-56-days</link>
      <pubDate>Mon, 16 Feb 2026 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">Fz2LN8VfjnfsPkNxjeCFk6</guid>
      <description>An erotic crime thriller, 56 Days will premiere on Prime Video in the next few days &#8212; here's when you can watch it.</description>
    </item>
    <item>
      <title>Macclesfield vs Brentford Live Streams: How to watch FA Cup 2025/26 from anywhere in the world</title>
      <link>https://www.techradar.com/how-to-watch/football/macclesfield-vs-brentford-free-streams-fa-cup-2025-26</link>
      <pubDate>Mon, 16 Feb 2026 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">m7yvEM2hgJgRojmJiAR87V</guid>
      <description>All the ways to watch Macclesfield vs Brentford online from anywhere in the world.</description>
    </item>
    <item>
      <title>'The world is in peril' &#8212; 5 reasons why the AI apocalypse might be closer than you think</title>
      <link>https://www.techradar.com/ai-platforms-assistants/the-world-is-in-peril-5-reasons-why-the-ai-apocalypse-might-be-closer-than-you-think</link>
      <pubDate>Mon, 16 Feb 2026 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">CzgRjMw8A2zY3VZfAGxATd</guid>
      <description>A cluster of recent AI developments signals that serious risks may be arriving sooner than many expect</description>
    </item>
    <item>
      <title>Arnaques par SMS et appels malveillantes : cette application filtre tout gratuitement</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2979235_arnaques-par-sms-et-appels-malveillantes-cette-application-filtre-tout-gratuitement</link>
      <pubDate>Mon, 16 Feb 2026 16:59:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2979235_arnaques-par-sms-et-appels-malveillantes-cette-application-filtre-tout-gratuitement</guid>
      <description>
L'application Saracroche passe &#224; la version 4.0. Au programme : une refonte compl&#232;te et la possibilit&#233; de filtrer les SMS malveillants. Une application must-have sur iPhone et Android.
</description>
    </item>
    <item>
      <title>PrivadoVPN&#8217;s PhantomMode lands on iOS to stop apps spying on you &#8212; here's everything you need to know and how to set it up</title>
      <link>https://www.techradar.com/vpn/vpn-services/privadovpns-phantommode-lands-on-ios-to-stop-apps-spying-on-you</link>
      <pubDate>Mon, 16 Feb 2026 16:54:10 +0000</pubDate>
      <guid isPermaLink="false">aihMQpBMBp6btTfAnncMYP</guid>
      <description>PrivadoVPN has rolled out PhantomMode to iOS users, a feature that blocks hidden trackers and ads on your device. Previously an Android exclusive, it offers privacy protection that doesn't stop when you disconnect your VPN.</description>
    </item>
    <item>
      <title>Samsung Galaxy Buds 4 leak suggests they could be missing a much-wanted AirPods 4 feature</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/samsung-galaxy-buds-4-leak-suggests-they-could-be-missing-a-much-wanted-airpods-4-feature</link>
      <pubDate>Mon, 16 Feb 2026 16:52:37 +0000</pubDate>
      <guid isPermaLink="false">3xuUbngB8dpo73W8pUkrMa</guid>
      <description>A new Galaxy Buds 4 leak suggests Samsung is dropping a feature that could be incredibly valuable in its next earbuds lineup.</description>
    </item>
    <item>
      <title>Quels sont les smartphones disposant encore d&#8217;une prise casque (jack) en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/674360_quel-smartphone-avec-prise-jack-choisir-en-2020</link>
      <pubDate>Mon, 16 Feb 2026 16:44:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/674360_quel-smartphone-avec-prise-jack-choisir-en-2020</guid>
      <description>
La prise jack 3,5 mm a peu &#224; peu disparu des smartphones. En 2026, il faut se faire une raison : plus aucun t&#233;l&#233;phone ne s'en encombre. &#192; la place, le port USB-C, qui est lui aussi capable de transmettre du son.
</description>
    </item>
    <item>
      <title>Fuite de donn&#233;es au CNRS&#160;: des informations personnelles d&#8217;employ&#233;s ont &#233;t&#233; vol&#233;es</title>
      <link>https://www.01net.com/actualites/fuite-donnees-cnrs-informations-personnelles-demployes-volees.html</link>
      <pubDate>Mon, 16 Feb 2026 16:32:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326188</guid>
      <description>Le Centre National de la Recherche Scientifique (CNRS) a subi une fuite de donn&#233;es massive. Des informations sensibles concernant d'anciens employ&#233;s recrut&#233;s avant 2007 ont &#233;t&#233; exfiltr&#233;es par des cybercriminels.</description>
    </item>
    <item>
      <title>The Vatican introduces an AI-assisted live translation service</title>
      <link>https://www.engadget.com/ai/the-vatican-introduces-an-ai-assisted-live-translation-service-163014907.html?src=rss</link>
      <pubDate>Mon, 16 Feb 2026 16:30:14 +0000</pubDate>
      <guid isPermaLink="false">9f3c09b9-c985-428a-b3a2-83ae5a16f420</guid>
      <description>The Vatican is leaning into AI. AI-assisted live translations are being introduced for Holy Mass attendees &#8212; the holy masses if you will. The Papal Basilica of Saint Peter in the Vatican has teamed up with Translated, a language service provider, to create live translations in 60 languages.&#160;
"Saint Peter&#8217;s Basilica has, for centuries, welcomed the faithful from every nation and tongue. In making available a tool that helps many to understand the words of the liturgy, we wish to serve the mission that defines the centre of the Catholic Church, universal by its very vocation," Cardinal Mauro Gam...</description>
    </item>
    <item>
      <title>Testing the new Dyson wet floor cleaner made me love my WashG1 even more &#8212; and it just crashed to an absurdly cheap price for Presidents' Day</title>
      <link>https://www.techradar.com/home/vacuums/testing-the-new-dyson-wet-floor-cleaner-made-me-love-my-washg1-even-more-and-it-just-crashed-to-an-absurdly-cheap-price-for-presidents-day</link>
      <pubDate>Mon, 16 Feb 2026 16:29:13 +0000</pubDate>
      <guid isPermaLink="false">tUmRZWvzoXsJA34FQZRuxE</guid>
      <description>With this discount, the nimble WashG1 wet floor cleaner is a no-brainer.</description>
    </item>
    <item>
      <title>ExpressVPN's lowest-ever price ends today &#8212; here are the quickest (and best) ways to save</title>
      <link>https://www.techradar.com/vpn/vpn-services/expressvpns-lowest-ever-price-ends-today-here-are-the-quickest-and-best-ways-to-save</link>
      <pubDate>Mon, 16 Feb 2026 16:28:41 +0000</pubDate>
      <guid isPermaLink="false">ZmDLgwFzfWAJVMqu5qrJyE</guid>
      <description>Plans are cheaper than the likes of Proton and NordVPN, but not for much longer</description>
    </item>
    <item>
      <title>Apr&#232;s la RAM, alerte sur les disques dur : ce constructeur majeur est en rupture pour le reste de 2026</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/2979167_apres-la-ram-alerte-sur-les-disques-dur-ce-constructeur-majeur-est-en-rupture-pour-le-reste-de-2026</link>
      <pubDate>Mon, 16 Feb 2026 16:28:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/2979167_apres-la-ram-alerte-sur-les-disques-dur-ce-constructeur-majeur-est-en-rupture-pour-le-reste-de-2026</guid>
      <description>
La crise de la RAM devient une crise de la m&#233;moire au sens large. Western Digital annonce avoir d&#233;j&#224; &#233;coul&#233; l'int&#233;gralit&#233; de sa production de 2026.
</description>
    </item>
    <item>
      <title>LG's impressive UltraWide 34-inch monitor is one of the best deals I've seen in Best Buy's Presidents' Day sale</title>
      <link>https://www.techradar.com/pro/lgs-impressive-ultrawide-34-inch-monitor-is-one-of-the-best-deals-ive-seen-in-best-buys-presidents-day-sale</link>
      <pubDate>Mon, 16 Feb 2026 16:21:00 +0000</pubDate>
      <guid isPermaLink="false">y8EWFrJJyZH89a6W23Cm5D</guid>
      <description>LG&#8217;s UltraWide 34-inch monitor is down to $210 at Best Buy, making it one of the cheapest ways to grab a big-screen IPS display from a well-known brand.</description>
    </item>
    <item>
      <title>'The gaming laptop deal to end all gaming laptop deals' - get a Lenovo with an RTX 5070 and OLED display for $1,194</title>
      <link>https://www.techradar.com/computing/gaming-laptops/the-gaming-laptop-deal-to-end-all-gaming-laptop-deals-get-a-lenovo-with-an-rtx-5070-and-oled-display-for-usd1-194</link>
      <pubDate>Mon, 16 Feb 2026 16:18:34 +0000</pubDate>
      <guid isPermaLink="false">dbyGhSArJiMSqFSipBHz7H</guid>
      <description>Here's how to get a gaming laptop with an RTX 5070 and OLED display for a record-low price today.</description>
    </item>
    <item>
      <title>The best Presidents Day TV deals: Save big on TCL, Samsung, Hisense, and more</title>
      <link>https://mashable.com/article/best-presidents-day-tv-live-deals-2026</link>
      <pubDate>Mon, 16 Feb 2026 16:14:27 +0000</pubDate>
      <guid isPermaLink="false">0624ovugHUc1fRghYByh9ah</guid>
      <description>The best live TV deals at Best Buy, Amazon, and Walmart for Presidents' Day. Shop deals on brands like TCL, Hisense, and Samsung.</description>
    </item>
    <item>
      <title>Here 50 Presidents Day deals actually worth shopping for</title>
      <link>https://www.theverge.com/gadgets/875949/best-presidents-day-sales-deals-2026</link>
      <pubDate>2026-02-16T11:12:34-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=875949</guid>
      <description>Deals have been admittedly pretty dry since the holidays, but now that February is in full swing, we&#8217;re starting to see strong discounts return across a range of categories. In fact, thanks to Valentine&#8217;s Day, the Super Bowl, and &#8212; as of this week &#8212; Presidents Day, retailers are once again offering a slew of [&#8230;]</description>
    </item>
    <item>
      <title>Presidents&#8217; Day is an excellent time to save money on the latest iPads &#8212; I've found today's 11 best deals from $299</title>
      <link>https://www.techradar.com/tablets/presidents-day-is-an-excellent-time-to-save-money-on-the-latest-ipads-ive-found-todays-11-best-deals-from-usd299</link>
      <pubDate>Mon, 16 Feb 2026 16:11:55 +0000</pubDate>
      <guid isPermaLink="false">vNo4cah9fvert3Ykcj6F57</guid>
      <description>I've rounded up what I reckon are the best Presidents' Day iPad deals to snap up before they sell out.</description>
    </item>
    <item>
      <title>Walmart is running a huge Presidents Day sale &#8212; find live deals on TVs, Apple, laptops, and more</title>
      <link>https://mashable.com/article/best-presidents-day-walmart-live-deals-2026</link>
      <pubDate>Mon, 16 Feb 2026 16:11:26 +0000</pubDate>
      <guid isPermaLink="false">02fAk4yvU0DEcesd2xH2PQO</guid>
      <description>Shop the best Presidents' Day deals at Walmart live now: earbuds, TVs, tech, kitchen appliances, and more.</description>
    </item>
    <item>
      <title>The Best Buy Presidents Day sale is live &#8212; shop deals on AirPods, TVs, laptops, headphones, and more</title>
      <link>https://mashable.com/article/best-presidents-day-best-buy-live-deals-2026</link>
      <pubDate>Mon, 16 Feb 2026 16:10:44 +0000</pubDate>
      <guid isPermaLink="false">07wZ8O8cpWYVFurAJ2Qzzub</guid>
      <description>Best Buy&#8217;s Presidents' Day sale is live now. Here are the best deals on TVs, laptops, headphones, and more.</description>
    </item>
    <item>
      <title>Google patches first Chrome zero-day of the year - so update now or face attack</title>
      <link>https://www.techradar.com/pro/security/google-patches-first-chrome-zero-day-of-the-year-so-update-now-or-face-attack</link>
      <pubDate>Mon, 16 Feb 2026 16:10:00 +0000</pubDate>
      <guid isPermaLink="false">kQBmEHvoGNvcFX2SaGDFbb</guid>
      <description>An 8.3/10 use after free in CSS Google Chrome bug was patched after being abused by unnamed threat actors.</description>
    </item>
    <item>
      <title>One of my favorite air purifiers is on sale for a record-low price ahead of spring pollen season</title>
      <link>https://mashable.com/article/feb-16-levoit-sprout-deal</link>
      <pubDate>Mon, 16 Feb 2026 16:09:15 +0000</pubDate>
      <guid isPermaLink="false">05KShR9U9ZCmD9wQSzkb4hk</guid>
      <description>The Levoit Sprout air purifier is on sale at Amazon for $179.99, down from the list price of $279.99. That's a 36% discount.</description>
    </item>
    <item>
      <title>Pairs Figure Skating Finale Free Streams: Running Order, Preview for Gold Medal Decider at 2026 Winter Olympics</title>
      <link>https://www.techradar.com/how-to-watch/sport/pairs-figure-skating-finale-2026-winter-olympics-free</link>
      <pubDate>Mon, 16 Feb 2026 16:06:34 +0000</pubDate>
      <guid isPermaLink="false">SfQyjCvCP5CA9nB7mBiRp7</guid>
      <description>All the ways to watch Pairs Figure Skating finale 2026 live streams for FREE, with Miura Riku and Kihara Ryuichi facing an uphill battle in the Free Skate.</description>
    </item>
    <item>
      <title>Could DMT Be a New Treatment for Depression? A Small Study Says Yes</title>
      <link>https://gizmodo.com/could-dmt-be-a-new-treatment-for-depression-a-small-study-says-yes-2000720779</link>
      <pubDate>Mon, 16 Feb 2026 16:05:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000720779</guid>
      <description>People taking DMT tended to experience significant relief from their depression for up to three months, the researchers found.</description>
    </item>
    <item>
      <title>Le r&#233;seau social X bri&#232;vement en panne dans plusieurs pays</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-02-16/le-reseau-social-x-brievement-en-panne-dans-plusieurs-pays.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Mon, 16 Feb 2026 11:04:50 -0500</pubDate>
      <guid isPermaLink="false">0d7d9458dcaf38919a4cf25100e31b9a</guid>
      <description>Le r&#233;seau social X a connu une panne dans plusieurs pays lundi pendant quelques heures, ont constat&#233; des observateurs sp&#233;cialis&#233;s et des journalistes de l&#8217;AFP, de nouveaux dysfonctionnements pour l&#8217;entreprise d&#8217;Elon Musk.</description>
    </item>
    <item>
      <title>Grab the EcoFlow River 2 Max portable power station for its best price ever</title>
      <link>https://mashable.com/article/feb-16-ecoflow-river-2-max-power-station-deal</link>
      <pubDate>Mon, 16 Feb 2026 16:04:49 +0000</pubDate>
      <guid isPermaLink="false">0052zYGiNf18CCUM7bFU2A3</guid>
      <description>The EcoFlow River 2 Max portable power station is on sale for its best price ever at $268.98. That's 43% off its list price.</description>
    </item>
    <item>
      <title>Mettez vite Chrome &#224; jour, Google corrige une faille permettant de contr&#244;ler le navigateur</title>
      <link>https://www.frandroid.com/marques/google/2978819_mettez-vite-chrome-a-jour-google-corrige-une-faille-permettant-de-controler-le-navigateur</link>
      <pubDate>Mon, 16 Feb 2026 16:04:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2978819_mettez-vite-chrome-a-jour-google-corrige-une-faille-permettant-de-controler-le-navigateur</guid>
      <description>
Premi&#232;re faille &#171; zero day &#187; de 2026 pour Chrome. Un correctif d'urgence est disponible
</description>
    </item>
    <item>
      <title>Netgear Nighthawk M7 Portable 5G Router Review: A Little Stability Goes a Long Way</title>
      <link>https://gizmodo.com/netgear-nighthawk-m7-portable-5g-router-review-a-little-stability-goes-a-long-way-2000722453</link>
      <pubDate>Mon, 16 Feb 2026 16:00:37 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000722453</guid>
      <description>The Nighthawk 5G M7 is a versatile travel Wi-Fi router the size of a chunky smartphone.</description>
    </item>
    <item>
      <title>The Magic of &#8216;Ponyo&#8217; Comes to Life at the Academy Museum</title>
      <link>https://gizmodo.com/the-magic-of-ponyo-comes-to-life-at-the-academy-museum-2000721980</link>
      <pubDate>Mon, 16 Feb 2026 16:00:26 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000721980</guid>
      <description>Studio Ghibli and Hayao Miyazaki donated over 100 pieces for the exhibit, open through January 2027.</description>
    </item>
    <item>
      <title>13 &#233;mulateurs Switch dans la ligne de mire de Nintendo</title>
      <link>https://www.01net.com/actualites/13-emulateurs-switch-dans-la-ligne-de-mire-de-nintendo.html</link>
      <pubDate>Mon, 16 Feb 2026 15:58:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326189</guid>
      <description>Nintendo a ferm&#233; les yeux pendant des ann&#233;es sur l'&#233;mulation Switch&#8230; mais c'est bien termin&#233;. En 2024, le constructeur obtenait l'arr&#234;t de toute activit&#233; pour Yuzu et Ryujinx, les deux principaux &#233;mulateurs &#224; l'&#233;poque. Mais c'est un jeu du chat et de la souris permanent, car de nombreuses alternatives sont apparues, et Nintendo est reparti &#224; la chasse....</description>
    </item>
    <item>
      <title>Galaxy Buds 4 et Buds 4 Pro : les images officielles avant la pr&#233;sentation</title>
      <link>https://www.frandroid.com/marques/samsung/2979043_galaxy-buds-4-et-buds-4-pro-les-images-officielles-avant-la-presentation</link>
      <pubDate>Mon, 16 Feb 2026 15:55:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2979043_galaxy-buds-4-et-buds-4-pro-les-images-officielles-avant-la-presentation</guid>
      <description>
Samsung s&#8217;appr&#234;te &#224; lancer ses Galaxy Buds 4 et Galaxy Buds 4 Pro aux c&#244;t&#233;s des Galaxy S26, avec un design revu, une r&#233;duction de bruit renforc&#233;e et des fonctions connect&#233;es plus pouss&#233;es. Des images officielles vient d&#8217;apparaitre sur la toile &#224; la faveur d&#8217;un revendeur.
</description>
    </item>
    <item>
      <title>Don't buy AirPods Pro 3 in the Presidents' Day Sales! Buy any of these 4 earbuds deals instead &#8211;all recommended by me, an audio expert</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/dont-buy-airpods-pro-3-in-the-presidents-day-sales-buy-any-of-these-4-earbuds-deals-instead-all-recommended-by-me-an-audio-expert</link>
      <pubDate>Mon, 16 Feb 2026 15:53:05 +0000</pubDate>
      <guid isPermaLink="false">tHQgcxX7f6RjHraKoYrQi6</guid>
      <description>AirPods Pro 3 are still a little pricey, no? These excellent options are a better bet for your hard-earned cash</description>
    </item>
    <item>
      <title>How to watch New Zealand vs. Canada in the 2026 T20 World Cup online for free</title>
      <link>https://mashable.com/article/new-zealand-canada-t20-world-cup-2026-live-stream-for-free</link>
      <pubDate>Mon, 16 Feb 2026 15:52:22 +0000</pubDate>
      <guid isPermaLink="false">00xFuBjB6BZIGxEUh5P3q4i</guid>
      <description>How to watch T20 World Cup for free. Live stream New Zealand vs. Canada in the 2026 T20 World Cup for free from anywhere in the world.</description>
    </item>
    <item>
      <title>&#8216;It&#8217;s bonkers&#8217;: Newegg sells a $229 16-core Xeon mini PC with a true Nvidia video card, 8GB RAM, 256GB SSD and is barely slower than Apple M3</title>
      <link>https://www.techradar.com/pro/its-bonkers-newegg-sells-a-usd229-16-core-xeon-mini-pc-with-a-true-nvidia-video-card-8gb-ram-256gb-ssd-and-is-barely-slower-than-apple-m3</link>
      <pubDate>Mon, 16 Feb 2026 15:51:41 +0000</pubDate>
      <guid isPermaLink="false">5WY7PNaULAD7jgTPBWckEY</guid>
      <description>With an odd name (and Windows 10 in tow) but some cracking hardware, this is a deal that will split opinions.</description>
    </item>
    <item>
      <title>Ce TV Samsung Neo QLED 55&#8243; 144 Hz taill&#233;e pour le gaming b&#233;n&#233;ficie d&#8217;une triple remise pour 41 % de r&#233;duction au total</title>
      <link>https://www.frandroid.com/bons-plans/2978859_ce-tv-samsung-neo-qled-55-144-hz-taillee-pour-le-gaming-beneficie-dune-triple-remise-pour-41-de-reduction-au-total</link>
      <pubDate>Mon, 16 Feb 2026 15:51:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2978859_ce-tv-samsung-neo-qled-55-144-hz-taillee-pour-le-gaming-beneficie-dune-triple-remise-pour-41-de-reduction-au-total</guid>
      <description>
Chez Ubaldi il y a de sacr&#233;es offres sur le TV Samsung TQ55QN70F, un mod&#232;le Neo QLED de 55" fluide et boost&#233; &#224; l'IA qu'il est possible de r&#233;cup&#233;rer pour 530 euros au lieu de 899 euros.
</description>
    </item>
    <item>
      <title>Was Twitter down? What users reported.</title>
      <link>https://mashable.com/article/was-twitter-x-down-what-users-reported</link>
      <pubDate>Mon, 16 Feb 2026 15:49:12 +0000</pubDate>
      <guid isPermaLink="false">03HDXHjeto13ScXg1zbEzs3</guid>
      <description>X appeared to be down on Monday morning.</description>
    </item>
    <item>
      <title>&#171; Nous avons d&#233;cid&#233; de maintenir les moteurs diesel &#187; : pourquoi Stellantis fait marche arri&#232;re sur les voitures &#233;lectriques</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2978729_nous-avons-decide-de-maintenir-les-moteurs-diesel-pourquoi-stellantis-fait-marche-arriere-sur-les-voitures-electriques</link>
      <pubDate>Mon, 16 Feb 2026 15:45:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2978729_nous-avons-decide-de-maintenir-les-moteurs-diesel-pourquoi-stellantis-fait-marche-arriere-sur-les-voitures-electriques</guid>
      <description>
Alors que l'industrie automobile europ&#233;enne jurait ses grands dieux n'avoir d'yeux que pour l'&#233;lectrique, Stellantis fait marche arri&#232;re. Discr&#232;tement, le groupe a r&#233;introduit au moins 7 mod&#232;les diesel sur le Vieux Continent.
</description>
    </item>
    <item>
      <title>Save up to 48% on two premium Garmin smartwatches at Amazon</title>
      <link>https://mashable.com/article/feb-16-garmin-epix-pro-smartwatch-deal</link>
      <pubDate>Mon, 16 Feb 2026 15:43:15 +0000</pubDate>
      <guid isPermaLink="false">06MS74qNEk6P4BD8wOkwF4O</guid>
      <description>The Garmin epix Pro 2 smartwatch and Garmin Instinct 2X Solar smartwatch are on sale at Amazon for up to 48% off. Save up to $476.</description>
    </item>
  </channel>
</rss>
