<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 19 Dec 2025 16:32:14 GMT</lastBuildDate>
    <item>
      <title>Arnaque au flagrant d&#233;lit&#160;: comment de faux policiers pi&#232;gent les Fran&#231;ais</title>
      <link>https://www.01net.com/actualites/arnaque-flagrant-delit-comment-faux-policiers-piegent-francais.html</link>
      <pubDate>Fri, 19 Dec 2025 16:30:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316261</guid>
      <description>La Gendarmerie nationale alerte sur une nouvelle vague d&#8217;arnaques. Cette fois, l'escroc se fait passer pour un faux policier charg&#233; de prendre un pirate en flagrant d&#233;lit.</description>
    </item>
    <item>
      <title>Test du TCL A1s, un vid&#233;oprojecteur compact sous Google TV avec d&#8217;excellentes prestations</title>
      <link>https://www.frandroid.com/marques/2890301_test-du-tcl-a1s-que-vaut-ce-videoprojecteur-compact</link>
      <pubDate>Fri, 19 Dec 2025 16:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2890301_test-du-tcl-a1s-que-vaut-ce-videoprojecteur-compact</guid>
      <description>
Avec le TCL A1s, le constructeur chinois investit le segment des vid&#233;oprojecteurs compacts et connect&#233;s, promettant une exp&#233;rience cin&#233;ma &#224; domicile accessible et performante. Voyons de quoi il est capable exactement.
</description>
    </item>
    <item>
      <title>Cadeaux de derni&#232;re minute&#160;: comment l&#8217;e-commerce a normalis&#233; la procrastination de 43&#160;% des Fran&#231;ais</title>
      <link>https://www.01net.com/actualites/cadeaux-de-derniere-minute-comment-le-commerce-a-normalise-la-procrastination-de-43-des-francais.html</link>
      <pubDate>Fri, 19 Dec 2025 16:27:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316325</guid>
      <description>Nous sommes le 19 d&#233;cembre et vous n'avez rien achet&#233; ? Pas de panique, vous &#234;tes dans la norme. Une &#233;tude Amazon/OpinionWay r&#233;v&#232;le que la puissance logistique du e-commerce a d&#233;complex&#233; les retardataires, transformant la course de No&#235;l en un sprint technologique de 72 heures.</description>
    </item>
    <item>
      <title>New managed web hosting service brings flat-rate node.js pricing</title>
      <link>https://www.techradar.com/pro/new-managed-web-hosting-service-brings-flat-rate-node-js-pricing</link>
      <pubDate>Fri, 19 Dec 2025 16:26:28 +0000</pubDate>
      <guid isPermaLink="false">gZndek24CvNddmD49weDhj</guid>
      <description>Hostinger is lowering the barrier for entry with new node.js support in shared hosting plans.</description>
    </item>
    <item>
      <title>Votre enfant utilise ChatGPT ? Voici ce qui va changer dans les interactions avec l&#8217;IA</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2916281_votre-enfant-utilise-chatgpt-voici-ce-qui-va-changer-dans-les-interactions-avec-lia</link>
      <pubDate>Fri, 19 Dec 2025 16:23:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2916281_votre-enfant-utilise-chatgpt-voici-ce-qui-va-changer-dans-les-interactions-avec-lia</guid>
      <description>
OpenAI redouble de vigilance pour d&#233;terminer l'&#226;ge des utilisateurs mineurs afin de leur offrir une exp&#233;rience d'utilisation en ad&#233;quation. 
</description>
    </item>
    <item>
      <title>Revolut veut tuer les op&#233;rateurs mobiles avec son offre 5G illimit&#233;e : bonne chance pour y arriver en France</title>
      <link>https://www.frandroid.com/telecom/forfait-mobile/2917091_revolut-veut-tuer-les-operateurs-mobiles-avec-son-offre-5g-illimitee-bonne-chance-pour-y-arriver-en-france</link>
      <pubDate>Fri, 19 Dec 2025 16:23:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/forfait-mobile/2917091_revolut-veut-tuer-les-operateurs-mobiles-avec-son-offre-5g-illimitee-bonne-chance-pour-y-arriver-en-france</guid>
      <description>
Vous trouviez que Revolut faisait d&#233;j&#224; trop de choses ? Attendez de voir la suite. Apr&#232;s la banque, la crypto et les assurances, l'entreprise lance Revolut Mobile. Un v&#233;ritable forfait t&#233;l&#233;phonique 5G directement dans l'application. L'offre est agressive pour le march&#233; britannique, mais vu de France, on a presque envie de sourire.
</description>
    </item>
    <item>
      <title>BMW a commenc&#233; &#224; produire des voitures &#233;lectriques invisibles dans son usine historique</title>
      <link>https://www.frandroid.com/marques/bmw/2916897_bmw-a-commence-a-produire-des-voitures-electriques-invisibles-dans-son-usine-historique</link>
      <pubDate>Fri, 19 Dec 2025 16:21:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bmw/2916897_bmw-a-commence-a-produire-des-voitures-electriques-invisibles-dans-son-usine-historique</guid>
      <description>
Le constructeur allemand pr&#233;pare l&#8217;arriv&#233;e de sa nouvelle berline i3 (s&#233;rie 3 &#233;lectrique), qui sera produite &#224; Munich. La voiture &#233;lectrique d&#233;marrera sa fabrication d&#232;s l&#8217;&#233;t&#233; 2026.
</description>
    </item>
    <item>
      <title>Who owns Trump Mobile?</title>
      <link>https://www.theverge.com/tech/848029/trump-mobile-ownership-structure-licensing</link>
      <pubDate>2025-12-19T11:20:27-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=848029</guid>
      <description>Where's the Trump Phone? We're going to keep talking about it every week, except next week, when we take a break until the new year. We've reached out, as usual, to ask about the Trump Phone's whereabouts. As usual, we're still waiting for a response. In the meantime, we're wondering who's actually behind the mobile [&#8230;]</description>
    </item>
    <item>
      <title>L&#8217;enqu&#234;te qui flingue la plus grande promesse du Wi-Fi 7 : &#171;&#160;Le MLO n&#8217;existe pas encore&#160;&#187;</title>
      <link>https://www.frandroid.com/telecom/2916429_lenquete-qui-flingue-la-plus-grande-promesse-du-wi-fi-7-le-mlo-nexiste-pas-encore</link>
      <pubDate>Fri, 19 Dec 2025 16:17:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2916429_lenquete-qui-flingue-la-plus-grande-promesse-du-wi-fi-7-le-mlo-nexiste-pas-encore</guid>
      <description>
De toutes les am&#233;liorations et fonctionnalit&#233;s apport&#233;es par le Wi-Fi 7, le MLO en est certainement la cl&#233; de vo&#251;te. Il est m&#234;me au c&#339;ur des discours des fabricants d'&#233;quipements en Wi-Fi 7, pourtant, la r&#233;alit&#233; de cette technologie est toute autre selon une enqu&#234;te de nos confr&#232;res de RTINGS.com.
</description>
    </item>
    <item>
      <title>Best Buy has launched a last-minute savings sale &#8212; AirPods, TVs, cheap laptops and more that arrive before Christmas</title>
      <link>https://www.techradar.com/seasonal-sales/best-buy-has-launched-a-last-minute-savings-sale-airpods-tvs-cheap-laptops-and-more-that-arrive-before-christmas</link>
      <pubDate>Fri, 19 Dec 2025 16:15:39 +0000</pubDate>
      <guid isPermaLink="false">ibjijnkhnaPtWMrJBMAhSN</guid>
      <description>Best Buy just launched a last-minute savings sale, and I'm rounding up the 21 best deals, including AirPods, TVs, laptops, smartwatches, and more.</description>
    </item>
    <item>
      <title>Meta is developing a new image and video model for a 2026 release, report says</title>
      <link>https://techcrunch.com/2025/12/19/meta-is-developing-a-new-image-and-video-model-for-a-2026-release-report-says/</link>
      <pubDate>Fri, 19 Dec 2025 16:05:29 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3077744</guid>
      <description>The company is working on an image and video model and new text-based model, which aids with coding.</description>
    </item>
    <item>
      <title>On a vu le TV Samsung Micro RGB de 115 pouces&#160;: une parfaite ma&#238;trise de la technologie de demain avec des mesures impressionnantes</title>
      <link>https://www.frandroid.com/marques/samsung/2915329_on-a-vu-le-tv-samsung-micro-rgb-de-115-pouces-une-parfaite-maitrise-de-la-technologie-de-demain-avec-des-mesures-impressionnantes</link>
      <pubDate>Fri, 19 Dec 2025 16:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2915329_on-a-vu-le-tv-samsung-micro-rgb-de-115-pouces-une-parfaite-maitrise-de-la-technologie-de-demain-avec-des-mesures-impressionnantes</guid>
      <description>
V&#233;ritable vitrine technologique pour Samsung, ce t&#233;l&#233;viseur d&#8217;une diagonale de 115 pouces embarque effectivement une dalle LCD avec un syst&#232;me de r&#233;tro&#233;clairage Micro RGB capable, en th&#233;orie d&#8217;offrir une palette extr&#234;mement large de couleurs associ&#233;e &#224; un tr&#232;s fort contraste. Nous avons pu faire des mesures.&#160;
</description>
    </item>
    <item>
      <title>There's a big Philips Hue sale at Best Buy from $11.99 &#8212; these are the smart bulb deals I recommend buying</title>
      <link>https://www.techradar.com/home/smart-lights/theres-a-big-philips-hue-sale-at-best-buy-from-usd11-99-these-are-the-smart-bulb-deals-i-recommend-buying</link>
      <pubDate>Fri, 19 Dec 2025 16:01:31 +0000</pubDate>
      <guid isPermaLink="false">BBE8z2cLSfV7Z8chZXoE24</guid>
      <description>A big shout-out to the A19 3-pack, which are part of the big Philips Hue sale at Best Buy</description>
    </item>
    <item>
      <title>The Fujifilm Instax Mini 12 instant camera is a great gift at $74</title>
      <link>https://www.theverge.com/gadgets/847732/fujifilm-instax-mini-12-camera-8bitdo-pro-3-controller-deal-sale</link>
      <pubDate>2025-12-19T11:01:19-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=847732</guid>
      <description>Although our phones are all equipped with cameras, there is still something special about being able to immediately produce a printed photo to pass around or give as a gift. If that&#8217;s something that appeals to you, the Fujifilm Instax Mini 12 instant camera is a great gift idea, and it&#8217;s now on sale at [&#8230;]</description>
    </item>
    <item>
      <title>6 Scary Predictions for AI in 2026</title>
      <link>https://www.wired.com/story/backchannel-2026-predictions-tech-robots-ai/</link>
      <pubDate>Fri, 19 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">694032e2e5b65c603b704131</guid>
      <description>Could the AI industry be on the verge of its first major layoffs? Will China spread propaganda to slow the US data-center building boom? Where are AI agents headed?</description>
    </item>
    <item>
      <title>100 000 images de Mars : cette sonde de la Nasa r&#233;v&#232;le un monde plus complexe qu&#8217;on ne l&#8217;imaginait</title>
      <link>https://www.futura-sciences.com/sciences/actualites/mars-100-000-images-mars-cette-sonde-nasa-revele-monde-plus-complexe-quon-ne-imaginait-129386/#xtor%3DRSS-8</link>
      <pubDate>Fri, 19 Dec 2025 16:59:20 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/mars-100-000-images-mars-cette-sonde-nasa-revele-monde-plus-complexe-quon-ne-imaginait-129386/#xtor%3DRSS-8</guid>
      <description>Peu d&#8217;instruments ont contempl&#233; Mars avec autant de fid&#233;lit&#233;. &#192; travers l&#8217;&#339;il per&#231;ant de HiRISE, la sonde MRO d&#233;chiffre la Plan&#232;te rouge, r&#233;v&#233;lant son incroyable g&#233;ologie et les secrets enfouis dans ses paysages mill&#233;naires.</description>
    </item>
    <item>
      <title>The best Nintendo Switch controllers to buy right now</title>
      <link>https://www.theverge.com/23350899/nintendo-switch-controllers-best-wireless-joy-con-gamepad</link>
      <pubDate>2025-12-19T10:56:58-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/23350899/nintendo-switch-controllers-best-wireless-joy-con-gamepad</guid>
      <description>The Switch 2 is here, and Nintendo seems ready to move on from the original Switch. But we&#8217;re not going to up and forget about it. That&#8217;s why we&#8217;ve kept testing controllers that might be a good fit for you. Even as many accessory makers are making controllers with the Switch 2 in mind, most [&#8230;]</description>
    </item>
    <item>
      <title>YouTube s&#8217;en prend (enfin) aux chaines qui g&#233;n&#232;rent de fausses bandes-annonces de films avec de l&#8217;IA</title>
      <link>https://www.01net.com/actualites/youtube-sen-prend-enfin-aux-chaines-qui-generent-de-fausses-bandes-annonces-de-films-avec-de-lia.html</link>
      <pubDate>Fri, 19 Dec 2025 15:55:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316306</guid>
      <description>Les fausses bandes-annonces g&#233;n&#233;r&#233;es gr&#226;ce &#224; l&#8217;intelligence artificielle sont monnaie courante sur YouTube. L&#8217;entreprise vient de s&#8217;attaquer &#224; deux poids lourds du domaine en supprimant d&#233;finitivement leurs chaines. Cette d&#233;cision sanctionne l&#8217;utilisation abusive d&#8217;intelligence artificielle, une pratique destin&#233;e &#224; tromper les internautes.</description>
    </item>
    <item>
      <title>Intel Core Ultra 5 225F hits $157.98 - all-time low and comes with free $70 Battlefield 6 game</title>
      <link>https://www.techradar.com/pro/intel-core-ultra-5-225f-hits-usd157-98-all-time-low-and-comes-with-free-usd70-battlefield-6-game</link>
      <pubDate>Fri, 19 Dec 2025 15:48:58 +0000</pubDate>
      <guid isPermaLink="false">ZjpdBUAfYAjKPkG9Q5duja</guid>
      <description>Intel&#8217;s Core Ultra 5 225F hits a new low price at Newegg and it comes with a free copy of Battlefield 6 too.</description>
    </item>
    <item>
      <title>One of our favorite budgeting apps is 50 percent off right now</title>
      <link>https://www.engadget.com/deals/one-of-our-favorite-budgeting-apps-is-50-percent-off-right-now-154056703.html?src=rss</link>
      <pubDate>Fri, 19 Dec 2025 15:46:26 +0000</pubDate>
      <guid isPermaLink="false">f9cd69a7-2172-4476-a391-04d87e530174</guid>
      <description>If you have a resolution in the new year to get more acquainted with your finances, a good budgeting app can help with that. One of our favorites is a bit cheaper to sign up for right now: Monarch Money is offering 50 percent off annual subscriptions for new users. Use the code MONARCHVIP at checkout to get half off, so you'll pay just $50 for one year of access.


Monarch Money was the runner-up in our guide to the best budgeting apps in 2025, and it was definitely a grower. Initially we found the experience of using the app to be needlessly complicated compared to some of its rivals, but get...</description>
    </item>
    <item>
      <title>Leak Reveals Lenovo Gaming Laptop With a Screen That Rolls Sideways Into an Ultrawide</title>
      <link>https://gizmodo.com/leak-reveals-lenovo-gaming-laptop-with-a-screen-that-rolls-sideways-into-an-ultrawide-2000701801</link>
      <pubDate>Fri, 19 Dec 2025 15:45:59 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000701801</guid>
      <description>Lenovo reportedly has other plans for rolling laptops, as well as a surprise handheld.</description>
    </item>
    <item>
      <title>Meilleurs aspirateurs-robots laveurs en d&#233;cembre 2025 : la s&#233;lection</title>
      <link>https://www.frandroid.com/guide-dachat/2037272_quels-sont-les-meilleurs-aspirateurs-robots-laveur-notre-selection</link>
      <pubDate>Fri, 19 Dec 2025 15:42:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2037272_quels-sont-les-meilleurs-aspirateurs-robots-laveur-notre-selection</guid>
      <description>
De plus en plus d'aspirateurs robots proposent une fonction de nettoyage humide pour s'occuper &#224; fond des sols. Certes, il s'agit souvent de mod&#232;les plus chers, mais aussi plus performants et polyvalents. Apr&#232;s tests, voici notre s&#233;lection des meilleurs aspirateurs robots laveurs.
</description>
    </item>
    <item>
      <title>TikTok Finally Strikes a Deal to Be Taken Over by Trump Allies</title>
      <link>https://gizmodo.com/tiktok-finally-strikes-deal-to-be-taken-over-by-trump-allies-2000701805</link>
      <pubDate>Fri, 19 Dec 2025 15:40:22 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000701805</guid>
      <description>A new U.S.-based joint venture would keep TikTok online while handing oversight of its algorithm and data security to some of America&#8217;s wealthiest investors.</description>
    </item>
    <item>
      <title>Voitures chinoises en Europe : ce chiffre spectaculaire qui donne des sueurs froides aux constructeurs historiques</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2916857_voitures-chinoises-en-europe-ce-chiffre-spectaculaire-qui-donne-des-sueurs-froides-aux-constructeurs-historiques</link>
      <pubDate>Fri, 19 Dec 2025 15:40:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2916857_voitures-chinoises-en-europe-ce-chiffre-spectaculaire-qui-donne-des-sueurs-froides-aux-constructeurs-historiques</guid>
      <description>
Avec une progression de 108 % en novembre, les marques chinoises bousculent l'ordre &#233;tabli du march&#233; automobile europ&#233;en. BYD et MG m&#232;nent la charge, tandis que les constructeurs traditionnels peinent &#224; maintenir leurs positions.
</description>
    </item>
    <item>
      <title>Invitez la nostalgie pour No&#235;l avec la console Blaze Evercade VS-R et la collection Tomb Raider (I &#224; III) &#224; moins de 80&#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2916853_invitez-la-nostalgie-pour-noel-avec-la-console-blaze-evercade-vs-r-et-la-collection-tomb-raider-i-a-iii-a-moins-de-80e</link>
      <pubDate>Fri, 19 Dec 2025 15:39:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2916853_invitez-la-nostalgie-pour-noel-avec-la-console-blaze-evercade-vs-r-et-la-collection-tomb-raider-i-a-iii-a-moins-de-80e</guid>
      <description>
Envie de ramener quelqu&#8217;un droit en enfance pour No&#235;l ? L&#8217;Evercade VS-R fait office de machine &#224; remonter le temps : design old school, cartouches comme &#224; l&#8217;&#233;poque et les aventures de Lara Croft en gros pixels et polygones assum&#233;s. Et pour finir de convaincre les nostalgiques, la console r&#233;tro tombe &#224; 76,99 euros au lieu de 109,99 euros sur Amazon.
...</description>
    </item>
    <item>
      <title>Une premi&#232;re : Valorant va bloquer l&#8217;acc&#232;s aux joueurs qui n&#8217;ont pas fait cette mise &#224; jour critique</title>
      <link>https://www.frandroid.com/produits-android/console/2916589_une-premiere-pour-contrer-les-tricheurs-valorant-sera-injouable-sans-cette-mise-a-jour-critique-qui-pourrait-rebuter-les-joueurs</link>
      <pubDate>Fri, 19 Dec 2025 15:31:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2916589_une-premiere-pour-contrer-les-tricheurs-valorant-sera-injouable-sans-cette-mise-a-jour-critique-qui-pourrait-rebuter-les-joueurs</guid>
      <description>
Valorant va bient&#244;t exiger des joueurs qu'ils mettent &#224; jour leur BIOS, sous peine de ne plus pouvoir acc&#233;der au jeu. Une premi&#232;re.
</description>
    </item>
    <item>
      <title>I tried Saily's Ultra subscription in India: here's my honest review</title>
      <link>https://www.techradar.com/pro/i-tried-sailys-ultra-subscription-in-india-heres-my-honest-review</link>
      <pubDate>Fri, 19 Dec 2025 15:31:29 +0000</pubDate>
      <guid isPermaLink="false">gdg3pWLET9UzQ8gzeaKxo7</guid>
      <description>The Ultra subscription is a reliable way to stay connected for travelers on the go.</description>
    </item>
    <item>
      <title>&#8216;Pluribus&#8217; Gives Carol a Precarious New Coping Mechanism</title>
      <link>https://gizmodo.com/pluribus-episode-8-recap-carol-zosia-2000700450</link>
      <pubDate>Fri, 19 Dec 2025 15:30:22 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000700450</guid>
      <description>Apple TV&#8217;s sci-fi hit is nearing the end of its first season, but there&#8217;s still so much story to tell.</description>
    </item>
    <item>
      <title>Engadget's favorite games of 2025</title>
      <link>https://www.engadget.com/gaming/engadgets-favorite-games-of-2025-153000109.html?src=rss</link>
      <pubDate>Fri, 19 Dec 2025 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">4efc7512-0d26-42d8-b185-e0b5b12811b1</guid>
      <description>From indies like Silksong, to AAAs like Ghost of Yotei, and everything in between, 2025 truly had it all, and is likely to go down in the history books as one of the best years in gaming. But these are the games that felt truly special to the Engadget team.&#160;Arc Raiders I&#8217;m genuinely shocked by how much I love ARC Raiders. I&#8217;ve never been very interested in the whole PvE (Player vs. Environment) genre, aside from some brief stints with Destiny, but ARC Raiders's sci-fi post-apocalyptic vibe just works for me. I love the Blade Runner/anime-like aesthetic of its environments, enemies and outfits....</description>
    </item>
    <item>
      <title>Microsoft vante son IA Copilot&#8230; avec des fonctions qui ne marchent m&#234;me pas</title>
      <link>https://www.frandroid.com/marques/microsoft/2916783_microsoft-vante-son-ia-copilot-avec-des-fonctions-qui-ne-marchent-meme-pas</link>
      <pubDate>Fri, 19 Dec 2025 15:28:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2916783_microsoft-vante-son-ia-copilot-avec-des-fonctions-qui-ne-marchent-meme-pas</guid>
      <description>
En voulant vanter les m&#233;rites de son IA Copilot, Microsoft tend le b&#226;ton pour se faire battre.
</description>
    </item>
    <item>
      <title>Adobe faces class action lawsuit after allegedly misusing authors work in AI training</title>
      <link>https://www.techradar.com/pro/adobe-faces-class-action-lawsuit-after-allegedly-misusing-authors-work-in-ai-training</link>
      <pubDate>Fri, 19 Dec 2025 15:20:00 +0000</pubDate>
      <guid isPermaLink="false">BdZiFabVMy3btgxjqT8ZRo</guid>
      <description>Oregon author is proposing a class action lawsuit against Adobe for pirating books to train its SlimLM small language models.</description>
    </item>
    <item>
      <title>Europol imagines robot crime waves in 2035</title>
      <link>https://www.theverge.com/report/847956/robot-crime-wave-europe-police-prediction</link>
      <pubDate>2025-12-19T10:16:27-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=847956</guid>
      <description>Rapid advances in AI and robotics are set to become both powerful tools for police and potent weapons for criminals, a 48-page report from pan-European police agency Europol argues. Earlier this month, Europol's Innovation Lab published "The Unmanned Future(s): The impact of robotics and unmanned systems on law enforcement." The document is framed as more [&#8230;]...</description>
    </item>
    <item>
      <title>The best board games to gift and play with the family for the 2025 holiday season</title>
      <link>https://www.engadget.com/the-best-board-games-to-gift-and-play-with-the-family-for-the-2025-holiday-season-125529223.html?src=rss</link>
      <pubDate>Fri, 19 Dec 2025 15:15:36 +0000</pubDate>
      <guid isPermaLink="false">8b67d713-c1e1-4ea2-a3a8-ab47cde9ad9f</guid>
      <description>It's become cliche to say that we live in a golden age of board games, but to paraphrase the great stoic philosopher Andy Bernard, it's great to know you're in the good old days before you've left them. Great titles are still coming out by the thousands every year, from crowd-pleasing party games to genre-bending, theme-heavy Euros. Whether the gamer in your life is looking for a mind-warping challenge, a fun evening with friends or something in-between, we've got new releases or old favorites they'll love.
Best board games to gift (and play) this holiday season




























Che...</description>
    </item>
    <item>
      <title>15 millions de voitures produites : BYD &#233;crase tout sur son passage, mais un d&#233;tail change la donne</title>
      <link>https://www.frandroid.com/marques/byd/2916759_15-millions-de-voitures-produites-byd-ecrase-tout-sur-son-passage-mais-un-detail-change-la-donne</link>
      <pubDate>Fri, 19 Dec 2025 15:13:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2916759_15-millions-de-voitures-produites-byd-ecrase-tout-sur-son-passage-mais-un-detail-change-la-donne</guid>
      <description>
BYD vient d&#8217;annoncer avoir atteint la barre des 15 millions de voitures &#233;lectrifi&#233;es produites &#224; travers le monde, d&#233;passant Tesla et Volkswagen. Mais attention &#224; un petit d&#233;tail.
</description>
    </item>
    <item>
      <title>L&#8217;iPhone pliant d&#8217;Apple prend forme &#224; travers de premi&#232;res images non officielles</title>
      <link>https://www.01net.com/actualites/liphone-pliant-dapple-prend-forme-a-travers-de-premieres-images-non-officielles.html</link>
      <pubDate>Fri, 19 Dec 2025 15:10:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316331</guid>
      <description>En se basant sur des fichiers CAD avanc&#233;s comme officiels, un site allemand a publi&#233; des premi&#232;res images de l&#8217;iPhone Fold qui r&#233;v&#232;lent un format audacieux et in&#233;dit. Plus large que ses rivaux en mode pli&#233; (120,6 x 83,8 x 9,6 mm), il s&#8217;ouvrirait en paysage sur un &#233;cran interne de 7,76 pouces, avec barre photo ovale et cam&#233;ra sous l'&#233;cran.</description>
    </item>
    <item>
      <title>The Verge&#8217;s 2025 holiday gift guide for tinkerers</title>
      <link>https://www.theverge.com/tech/800444/best-tool-gift-ideas-2025</link>
      <pubDate>2025-12-19T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=800444</guid>
      <description>As AI tools continue to rise in popularity, it's easy to forget the satisfaction of using something that doesn't need an update or a prompt to help you get things done. I'm talking about tools. They're simple and rugged, and they don't make things needlessly complicated. And now that the holidays are approaching, these tools [&#8230;]</description>
    </item>
    <item>
      <title>The wellness wild west is back on its bullshit with unapproved weight loss drugs</title>
      <link>https://www.theverge.com/column/846406/optimizer-wellness-wild-west-glp-3-retatrutide</link>
      <pubDate>2025-12-19T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=846406</guid>
      <description>This is Optimizer, a weekly newsletter sent every Friday from Verge senior reviewer Victoria Song that dissects and discusses the latest phones, smartwatches, apps, and other gizmos that swear they're going to change your life. Optimizer will be taking a break for the holidays and will be back January 9th. Opt in for Optimizer here. [&#8230;]</description>
    </item>
    <item>
      <title>Quordle hints and answers for Saturday, December 20 (game #1426)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-20-december-2025</link>
      <pubDate>Fri, 19 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">eMq469d3zMxbBLpJdemXbc</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Saturday, December 20 (game #923)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-20-december-2025</link>
      <pubDate>Fri, 19 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">Q5DK62e8ZrJEBXT9fWhDaY</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Saturday, December 20 (game #657)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-20-december-2025</link>
      <pubDate>Fri, 19 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">HPkLB4RhRoXYQZCLteM5cE</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>7 new movies and TV shows to watch on Netflix, Prime Video, HBO Max, and more this weekend (December 19)</title>
      <link>https://www.techradar.com/streaming/7-new-movies-and-tv-shows-to-watch-on-netflix-prime-video-hbo-max-and-more-this-weekend-december-19</link>
      <pubDate>Fri, 19 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">LGsnzGc2avTo9Wb3VCuocV</guid>
      <description>TechRadar's pre-Christmas 2025 streaming round-up is full of new movies and shows, a comedy special, and a live sport event.</description>
    </item>
    <item>
      <title>Une Tesla Model S au prix d&#8217;une Model 3 : Xpeng serait sur le point de lancer sa voiture &#233;lectrique avec 700 km d&#8217;autonomie et une recharge en 12 minutes en Europe</title>
      <link>https://www.frandroid.com/marques/xpeng/2916593_une-tesla-model-s-au-prix-dune-model-3-xpeng-serait-sur-le-point-de-lancer-sa-voiture-electrique-avec-700-km-dautonomie-et-une-recharge-en-12-minutes-en-europe</link>
      <pubDate>Fri, 19 Dec 2025 14:50:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2916593_une-tesla-model-s-au-prix-dune-model-3-xpeng-serait-sur-le-point-de-lancer-sa-voiture-electrique-avec-700-km-dautonomie-et-une-recharge-en-12-minutes-en-europe</guid>
      <description>
D&#233;voil&#233;e en 2024, la Xpeng P7+ aura bient&#244;t le droit &#224; une nouvelle g&#233;n&#233;ration qui devrait d&#233;barquer en Europe. La berline &#233;lectrique devrait &#234;tre d&#233;voil&#233;e le 8 janvier 2026, et voil&#224; ce que l&#8217;on sait d&#233;j&#224; &#224; son sujet.
</description>
    </item>
    <item>
      <title>Percy Jackson season 3 is &#8216;well underway&#8217; and creator Rick Riordan teases a major role: &#8216;it&#8217;s pretty amazing casting&#8217;</title>
      <link>https://www.techradar.com/streaming/disney-plus/percy-jackson-season-3-is-well-underway-and-creator-rick-riordan-teases-a-major-role-its-pretty-amazing-casting</link>
      <pubDate>Fri, 19 Dec 2025 14:45:03 +0000</pubDate>
      <guid isPermaLink="false">PejZLPcafKWPygVC5ARgS8</guid>
      <description>Percy Jackson and the Olympians season 2 has just arrived on Disney+, but creator Rick Riordan is already looking forward to season 3.</description>
    </item>
    <item>
      <title>Instacart settles with FTC for $60 million over alleged false advertising</title>
      <link>https://www.fastcompany.com/91463598/instacart-settles-ftc-60-million-alleged-false-advertising</link>
      <pubDate>2025-12-19T14:45:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463598/instacart-settles-ftc-60-million-alleged-false-advertising</guid>
      <description>The FTC said that Instacart has been falsely advertising free deliveries.
Delivery company Instacart will pay $60 million in customer refunds under a settlement reached with the Federal Trade Commission over alleged deceptive practices.The FTC said Thursday that Instacart has been falsely advertising free deliveries. The San Francisco-based company isn&#8217;t clearly disclosing service fees, which add as much as 15% to an order and must be paid for customers to receive their groceries, the FTC said.Instacart has also failed to clearly disclose that customers who enroll in a free trial for its Insta...</description>
    </item>
    <item>
      <title>A robot just learned 1,000 tasks in a single day &#8212; and it&#8217;s a big deal for everyday AI</title>
      <link>https://www.techradar.com/ai-platforms-assistants/a-robot-just-learned-1-000-tasks-in-a-single-day-and-its-a-big-deal-for-everyday-ai</link>
      <pubDate>Fri, 19 Dec 2025 14:37:27 +0000</pubDate>
      <guid isPermaLink="false">nRhmTQ9a8EkbKqvCP3UbP5</guid>
      <description>This robot was able to learn 1,000 tasks in just 24 hours - but why should you care?</description>
    </item>
    <item>
      <title>Krafton hikes India bet with new $670M fund</title>
      <link>https://techcrunch.com/2025/12/19/krafton-hikes-india-bet-with-new-670m-fund/</link>
      <pubDate>Fri, 19 Dec 2025 14:37:19 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3077711</guid>
      <description>Called the Unicorn Growth Fund, the investment vehicle is a collaboration between Krafton and South Korean internet conglomerate Naver, and investor Mirae Asset. It aims to deploy around $669.3 million over four years.</description>
    </item>
    <item>
      <title>Brendan Carr is a dummy</title>
      <link>https://www.theverge.com/podcast/848012/brendan-carr-fcc-dummy-free-speech-vergecast</link>
      <pubDate>2025-12-19T09:36:52-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=848012</guid>
      <description>All year on The Vergecast, we've been tracking the many bizarre and problematic actions of FCC Chairman Brendan Carr. There has been a lot to discuss! Then, this week, ahead of one of our last episodes of the year, Carr appeared in front of the Senate Commerce Committee and spent three hours explaining how he [&#8230;]</description>
    </item>
    <item>
      <title>LG TVs will let users delete unwanted Copilot shortcuts</title>
      <link>https://mashable.com/article/lg-tv-microsoft-copilot-delete-shortcuts</link>
      <pubDate>Fri, 19 Dec 2025 14:36:09 +0000</pubDate>
      <guid isPermaLink="false">01nhGcatmoQMNCcqEdc0kRP</guid>
      <description>LG will allow users to delete shortcuts for Microsoft Copilot that popped up on their smart TVs.</description>
    </item>
    <item>
      <title>Master PDFs like a pro with 30% off LightPDF</title>
      <link>https://www.techradar.com/computing/master-pdfs-like-a-pro-with-30-percent-off-lightpdf</link>
      <pubDate>Fri, 19 Dec 2025 14:34:42 +0000</pubDate>
      <guid isPermaLink="false">pzygN3SX5R2VtNWC9ApDgJ</guid>
      <description>Master PDFs like a pro with 30% off LightPDF</description>
    </item>
    <item>
      <title>Google va vous aider &#224; identifier les vid&#233;os g&#233;n&#233;r&#233;es par IA, mais il y a un hic</title>
      <link>https://www.frandroid.com/marques/google/2916689_google-va-vous-aider-a-identifier-les-videos-generees-par-ia-mais-il-y-a-un-hic</link>
      <pubDate>Fri, 19 Dec 2025 14:34:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2916689_google-va-vous-aider-a-identifier-les-videos-generees-par-ia-mais-il-y-a-un-hic</guid>
      <description>
Google am&#233;liore les capacit&#233;s de son outil de d&#233;tection de contenus fait par IA. Une bonne id&#233;e pourtant limit&#233;e par un point crucial.
</description>
    </item>
  </channel>
</rss>
