<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 26 Dec 2025 09:27:47 GMT</lastBuildDate>
    <item>
      <title>Boulanger casse le prix du Google Pixel 10 Pro, en pack avec ses chargeurs 67 W et sans fil PixelSnap 25 W</title>
      <link>https://www.frandroid.com/bons-plans/2872893_boulanger-casse-le-prix-du-google-pixel-10-pro-en-pack-avec-ses-chargeurs-67-w-et-sans-fil-pixelsnap-25-w</link>
      <pubDate>Fri, 26 Dec 2025 09:22:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2872893_boulanger-casse-le-prix-du-google-pixel-10-pro-en-pack-avec-ses-chargeurs-67-w-et-sans-fil-pixelsnap-25-w</guid>
      <description>
Le Google Pixel 10 Pro d&#233;barque dans un bundle qui booste. &#192; l&#8217;int&#233;rieur : tout ce qu&#8217;il faut pour le recharger comme il faut, en rapide et m&#234;me en sans fil gr&#226;ce &#224; la nouveaut&#233; PixelSnap. Avec une offre de reprise, l&#8217;ensemble tombe &#224; 799 euros.
</description>
    </item>
    <item>
      <title>Gmail&#160;: Google annonce la nouveaut&#233; qu&#8217;on attend depuis 20 ans</title>
      <link>https://www.01net.com/actualites/gmail-google-annonce-nouveaute-on-attend-depuis-20-ans.html</link>
      <pubDate>Fri, 26 Dec 2025 09:15:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317290</guid>
      <description>Gmail s&#8217;appr&#234;te &#224; lever l'une des plus grosses frustrations de ses utilisateurs. Pour la premi&#232;re fois, il va devenir possible de modifier son adresse @gmail.com sans devoir cr&#233;er un nouveau compte. Ce changement s'accompagne d'une s&#233;rie de restrictions.</description>
    </item>
    <item>
      <title>What to do if your robot vacuum keeps losing connection: 6 tips to fix it</title>
      <link>https://www.techradar.com/home/robot-vacuums/what-to-do-if-your-robot-vacuum-keeps-losing-connection</link>
      <pubDate>Fri, 26 Dec 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">9ab23gvaRj6AfpUGdULiG7</guid>
      <description>It's one of the most frustrating problems you can experience with your robot vacuums &#8211; here's how to restore your connection.</description>
    </item>
    <item>
      <title>&#171; Il faut toujours des boutons physiques &#187; : le patron du design de Stellantis nous explique comment il compte se diff&#233;rencier de Tesla et des marques chinoises</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2915311_il-faut-toujours-des-boutons-physiques-le-patron-du-design-de-stellantis-nous-explique-comment-il-compte-se-differencier-de-tesla-et-des-marques-chinoises</link>
      <pubDate>Fri, 26 Dec 2025 08:54:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2915311_il-faut-toujours-des-boutons-physiques-le-patron-du-design-de-stellantis-nous-explique-comment-il-compte-se-differencier-de-tesla-et-des-marques-chinoises</guid>
      <description>
Nous avons rencontr&#233; Gilles Vidal, le nouveau patron du design des marques europ&#233;ennes de Stellantis, pour conna&#238;tre sa vision du futur de l'automobile. Apr&#232;s l'int&#233;r&#234;t de l'intelligence artificielle et l'&#233;volution des silhouettes des voitures &#233;lectriques, nous avons &#233;chang&#233; sur les &#233;volutions des habitacles et des planches de bord en cette p&#233;riode propices aux &#233;crans. Voici ce que nous avons appris.
...</description>
    </item>
    <item>
      <title>Le Xiaomi 17 Ultra est l&#224; avec une recette implacable : zoom optique d&#233;ment et batterie immense</title>
      <link>https://www.frandroid.com/marques/xiaomi/2921065_le-xiaomi-17-ultra-est-la-avec-une-recette-implacable-zoom-optique-dement-et-batterie-immense</link>
      <pubDate>Fri, 26 Dec 2025 08:46:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2921065_le-xiaomi-17-ultra-est-la-avec-une-recette-implacable-zoom-optique-dement-et-batterie-immense</guid>
      <description>
Voici le Xiaomi 17 Ultra, un smartphone haut de gamme avec un t&#233;l&#233;objectif p&#233;riscopique de 200 Mpx et une batterie immense de 6800 mAh.
</description>
    </item>
    <item>
      <title>15 accidents mortels en Tesla et toujours la m&#234;me cause&#160;: une enqu&#234;te accuse un &#233;quipement des voitures</title>
      <link>https://www.01net.com/actualites/15-accidents-mortels-en-tesla-et-toujours-la-meme-cause-une-enquete-accuse-un-equipement-des-voitures.html</link>
      <pubDate>Fri, 26 Dec 2025 08:35:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317287</guid>
      <description>Souvent reconnues pour leur grande s&#233;curit&#233; sur la route, et leur propension &#224; faire baisser le nombre d&#8217;accidents par kilom&#232;tres parcourus, les Tesla auraient pourtant un d&#233;faut majeur en cas d&#8217;accident.

Selon une enqu&#234;te men&#233;e par le tr&#232;s s&#233;rieux Bloomberg, les v&#233;hicules &#233;lectriques de Tesla auraient un s&#233;rieux souci en mati&#232;re de gestion post impact. L&#8217;analyse a port&#233; sur les accidents mortels ayant eu lieu en Tesla, aux &#201;tats-Unis, et si les causes de d&#233;c&#232;s peuvent &#234;tre multifactorielles, un &#233;l&#233;ment revient dans 15 accidents mortels : le blocage des portes. Autrement dit, apr&#232;s l&#8217;accident...</description>
    </item>
    <item>
      <title>Les Nothing ear (a) not&#233;s 9/10 gr&#226;ce &#224; une solide r&#233;duction de bruit perdent 40 % sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2920595_les-nothing-ear-a-notes-9-10-grace-a-une-solide-reduction-de-bruit-perdent-40-sur-amazon</link>
      <pubDate>Fri, 26 Dec 2025 08:17:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2920595_les-nothing-ear-a-notes-9-10-grace-a-une-solide-reduction-de-bruit-perdent-40-sur-amazon</guid>
      <description>
Les Nothing Ear (a) arrivent avec une fiche technique compl&#232;te, personnalisable &#224; quasiment tous les niveaux, et se permettent m&#234;me d'int&#233;grer de l'intelligence artificielle. Chez Amazon, ils perdent 40 % et tombent &#224; 59 euros.
</description>
    </item>
    <item>
      <title>Apr&#232;s 4 jours de cyberattaque, La Poste annonce un retour &#224; la normale, ou presque</title>
      <link>https://www.01net.com/actualites/apres-4-jours-cyberattaque-poste-annonce-retour-normale-presque.html</link>
      <pubDate>Fri, 26 Dec 2025 08:07:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317282</guid>
      <description>Quatre jours apr&#232;s le d&#233;but de la cyberattaque, La Poste assure que tout est plus ou moins rentr&#233; dans l'ordre. Colissimo, Digiposte et la Banque Postale fonctionnent de nouveau. Toutefois, l'attaque DDoS n'est pas encore termin&#233;e...</description>
    </item>
    <item>
      <title>The best microSD cards for the Nintendo Switch 2</title>
      <link>https://www.engadget.com/gaming/nintendo/best-microsd-cards-for-nintendo-switch-2-160052947.html?src=rss</link>
      <pubDate>Fri, 26 Dec 2025 08:00:36 +0000</pubDate>
      <guid isPermaLink="false">2df5caaa-9798-4115-a8f0-26050980cc10</guid>
      <description>If you want to expand the storage of your Nintendo Switch 2, you&#8217;ll need a microSD Express card. This is not the same as the more traditional microSD cards you may have bought for the original Switch or other gaming handhelds; Express cards are newer, faster and significantly more expensive on average. But they&#8217;re your only choice, and given how much space certain Switch 2 games chew up, you&#8217;ll probably have no choice but to get one eventually. Which to buy, though? If you&#8217;re looking for the best microSD card for the Switch 2 today, we&#8217;ve broken down what you should know before taking the plun...</description>
    </item>
    <item>
      <title>Purple Promo Codes and Deals: Up to 30% Off</title>
      <link>https://www.wired.com/story/purple-promo-code/</link>
      <pubDate>Fri, 26 Dec 2025 07:30:00 +0000</pubDate>
      <guid isPermaLink="false">68c8302f6aec50ed2359ebd3</guid>
      <description>On the hunt for the perfect mattress (and pillow)? Save on your soon-to-be favorite brand, Purple, with these coupons and deals.</description>
    </item>
  </channel>
</rss>
