<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 23 Feb 2026 08:56:10 GMT</lastBuildDate>
    <item>
      <title>Minecraft bascule vers l&#8217;API Vulkan : une modernisation technique qui menace les mods</title>
      <link>https://www.frandroid.com/produits-android/2985781_minecraft-bascule-vers-lapi-vulkan-une-modernisation-technique-qui-menace-les-mods</link>
      <pubDate>Mon, 23 Feb 2026 08:53:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2985781_minecraft-bascule-vers-lapi-vulkan-une-modernisation-technique-qui-menace-les-mods</guid>
      <description>
Apr&#232;s 16 ans d&#8217;existence, Mojang fait &#233;voluer Minecraft en basculant vers Vulkan. Une bonne nouvelle pour moderniser les rendus graphiques du jeu&#8230; mais qui pourrait s&#233;rieusement compliquer la vie des moddeurs.
</description>
    </item>
    <item>
      <title>6 200 km en Afrique : voici l&#8217;&#233;pop&#233;e de cette moto &#233;lectrique recharg&#233;e uniquement au soleil</title>
      <link>https://www.frandroid.com/survoltes/moto/2985821_6-200-km-en-afrique-voici-lepopee-de-cette-moto-electrique-rechargee-uniquement-au-soleil</link>
      <pubDate>Mon, 23 Feb 2026 08:52:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/moto/2985821_6-200-km-en-afrique-voici-lepopee-de-cette-moto-electrique-rechargee-uniquement-au-soleil</guid>
      <description>
Une &#233;quipe de chercheurs a r&#233;alis&#233; un voyage de plus de 6 200 kilom&#232;tres depuis le Kenya jusqu&#8217;en Afrique du Sud en moto &#233;lectrique recharg&#233;e &#224; l'&#233;lectricit&#233; solaire. Baptis&#233; &#171;&#160;Recharging Hope&#160;&#187;, ce projet veut montrer que cette technologie est pr&#234;te et tout &#224; fait op&#233;rationnelle.
</description>
    </item>
    <item>
      <title>Nvidia pr&#233;pare une petite r&#233;volution technique pour booster les performances des jeux sous Linux</title>
      <link>https://www.frandroid.com/marques/nvidia/2985811_nvidia-prepare-une-petite-revolution-technique-pour-booster-les-performances-des-jeux-sous-linux</link>
      <pubDate>Mon, 23 Feb 2026 08:31:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2985811_nvidia-prepare-une-petite-revolution-technique-pour-booster-les-performances-des-jeux-sous-linux</guid>
      <description>
Nvidia prendrait-il enfin Linux au s&#233;rieux ? Une s&#233;rie d'offres d'emploi semble indiquer que la firme pr&#233;voit d'am&#233;liorer les performances des jeux et de ses propres pilotes sur l'OS.
</description>
    </item>
    <item>
      <title>Le monde du cin&#233;ma d&#233;nonce un &#171;&#160;pillage en r&#232;gle&#160;&#187; de l&#8217;IA &#171;&#160;ici et maintenant&#160;&#187;</title>
      <link>https://www.01net.com/actualites/le-monde-du-cinema-denonce-un-pillage-en-regle-de-lia-ici-et-maintenant.html</link>
      <pubDate>Mon, 23 Feb 2026 08:25:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327328</guid>
      <description>Une duplication de la voix et de l'image pour 250 euros, des clonages de voix sans autorisation... 4 000 com&#233;diens demandent de toute urgence la cr&#233;ation &#171; d'un cadre juridique pour que l&#8217;IA puisse coexister avec le travail des artistes et le respect des droits d&#8217;auteur et droits voisins &#187;, dans une tribune publi&#233;e dans Le Parisien.</description>
    </item>
    <item>
      <title>Espionnage sur l&#8217;iPhone&#160;: comment ce spyware peut vous filmer et vous &#233;couter &#224; votre insu</title>
      <link>https://www.01net.com/actualites/espionnage-iphone-comment-spyware-peut-vous-filmer-vous-ecouter-votre-insu.html</link>
      <pubDate>Mon, 23 Feb 2026 08:01:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327338</guid>
      <description>Predator, le spyware d&#8217;Intellexa d&#233;j&#224; impliqu&#233; dans plusieurs campagnes d&#8217;espionnage, est capable d'activer en douce le micro et la cam&#233;ra de l'iPhone. Pour la premi&#232;re fois, des chercheurs ont d&#233;couvert comment le spyware parvient &#224; arriver &#224; ses fins sans se faire prendre.</description>
    </item>
    <item>
      <title>Wispr Flow launches an Android app for AI-powered dictation</title>
      <link>https://techcrunch.com/2026/02/23/wispr-flow-launches-an-android-app-for-ai-powered-dictation/</link>
      <pubDate>Mon, 23 Feb 2026 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3095493</guid>
      <description>AI-powered dictation startup Wispr Flow has launched its Android app today. The company released its app for Mac and Windows first, then launched on iOS in June 2025. On iOS, users could use Wispr Flow through a dedicated keyboard. On Android, the interface is a bit different, as you can access the dictionary through a [&#8230;]</description>
    </item>
    <item>
      <title>The best earbuds for Android devices in 2026</title>
      <link>https://www.engadget.com/audio/headphones/best-earbuds-for-android-devices-120015765.html?src=rss</link>
      <pubDate>Mon, 23 Feb 2026 08:00:38 +0000</pubDate>
      <guid isPermaLink="false">22817ecc-1f2e-4996-b4f1-d25475f2663e</guid>
      <description>If you&#8217;re using an Android phone, finding the right pair of wireless earbuds can take a little more work than it does for iPhone owners. Apple&#8217;s AirPods are tightly woven into iOS, but that same level of seamless integration doesn&#8217;t automatically carry over to Android. The good news is there are plenty of earbuds that play just as nicely with Android devices, and in some cases offer features AirPods simply don&#8217;t.From earbuds designed to pair especially well with Samsung Galaxy and Google Pixel phones to models that prioritize strong noise cancellation, long battery life or workout-friendly dur...</description>
    </item>
    <item>
      <title>La nouveaut&#233; la plus int&#233;ressante du S26 Ultra est d&#233;j&#224; en train d&#8217;&#234;tre copi&#233;e par les constructeurs chinois</title>
      <link>https://www.frandroid.com/marques/samsung/2985789_la-nouveaute-la-plus-interessante-du-s26-ultra-est-deja-en-train-detre-copiee-par-les-constructeurs-chinois</link>
      <pubDate>Mon, 23 Feb 2026 07:34:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2985789_la-nouveaute-la-plus-interessante-du-s26-ultra-est-deja-en-train-detre-copiee-par-les-constructeurs-chinois</guid>
      <description>
Vous en avez assez que des indiscrets dans le m&#233;tro ou&#239;ssent regarder les messages que vous envoyez &#224; votre moiti&#233;&#8201;? Bonne nouvelle, la technologie &#171;&#8201;Privacy Display&#8201;&#187; de Samsung va arriver sur d&#8217;autres smartphones.
</description>
    </item>
    <item>
      <title>C&#8217;est la fin d&#8217;une &#232;re : l&#8217;application M&#233;t&#233;o vit ses derniers instants sur Android</title>
      <link>https://www.frandroid.com/marques/google/2985777_cest-la-fin-dune-ere-lapplication-meteo-vit-ses-derniers-instants-sur-android</link>
      <pubDate>Mon, 23 Feb 2026 07:32:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2985777_cest-la-fin-dune-ere-lapplication-meteo-vit-ses-derniers-instants-sur-android</guid>
      <description>
Google a commenc&#233; &#224; d&#233;brancher discr&#232;tement son application M&#233;t&#233;o native au profit d'une application web plus classique. Voici les changements.
</description>
    </item>
    <item>
      <title>Ces 3 gestionnaires de mots de passe ne sont pas aussi s&#233;curis&#233;s que pr&#233;vu, 25 failles ont &#233;t&#233; d&#233;couvertes</title>
      <link>https://www.01net.com/actualites/ces-3-gestionnaires-de-mots-de-passe-ne-sont-pas-aussi-securises-que-prevu-25-failles-ont-ete-decouvertes.html</link>
      <pubDate>Mon, 23 Feb 2026 07:31:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327092</guid>
      <description>Des chercheurs viennent de faire voler en &#233;clats l'une des promesses phares des gestionnaires de mots de passe. Selon une &#233;tude, il est bel et bien possible &#224; un pirate d'acc&#233;der aux donn&#233;es chiffr&#233;es des utilisateurs. Dans certains cas bien pr&#233;cis, la garantie &#171; zero-knowledge &#187; n'est pas &#224; la hauteur des promesses.</description>
    </item>
    <item>
      <title>Bon plan Tado&#176; X : le pack de 4 t&#234;tes thermostatiques perd 150 &#8364; chez Boulanger</title>
      <link>https://www.frandroid.com/bons-plans/2984997_bon-plan-tado-x-le-pack-de-4-tetes-thermostatiques-perd-150-e-chez-boulanger</link>
      <pubDate>Mon, 23 Feb 2026 07:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2984997_bon-plan-tado-x-le-pack-de-4-tetes-thermostatiques-perd-150-e-chez-boulanger</guid>
      <description>
Si vous souhaitez mieux contr&#244;ler votre consommation d'&#233;nergie et optimiser le fonctionnement de votre chauffage &#224; eau, alors le pack de quatre t&#234;tes thermostatiques connect&#233;es Tado&#176; X devrait vous int&#233;resser. Actuellement, Boulanger le propose &#224; 219,99 euros au lieu de 369,99 euros.
</description>
    </item>
    <item>
      <title>Fuite de donn&#233;es&#160;: un autre op&#233;rateur fran&#231;ais a &#233;t&#233; pirat&#233;</title>
      <link>https://www.01net.com/actualites/fuite-donnees-autre-operateur-francais-pirate.html</link>
      <pubDate>Mon, 23 Feb 2026 07:10:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327329</guid>
      <description>R&#233;glo Mobile, l&#8217;op&#233;rateur low cost de E.Leclerc, a &#233;t&#233; frapp&#233; par une cyberattaque visant l&#8217;un de ses prestataires. Les pirates ont d&#233;rob&#233; une grosse quantit&#233; de donn&#233;es personnelles, dont des donn&#233;es bancaires partielles. Cette fuite ouvre grand la porte &#224; des campagnes de phishing cibl&#233;es, &#224; l&#8217;usurpation d&#8217;identit&#233; et &#224; des tentatives de d&#233;tournement de num&#233;ros de t&#233;l&#233;phone......</description>
    </item>
    <item>
      <title>NYT Pips hints, answers for February 23, 2026</title>
      <link>https://mashable.com/article/pips-nyt-games-hints-answers-easy-medium-hard-february-23-2026</link>
      <pubDate>Mon, 23 Feb 2026 07:04:43 +0000</pubDate>
      <guid isPermaLink="false">078feBWQDsGUqUol820g0cO</guid>
      <description>The New York Times' latest game, Pips, brings domino fun to your desktop. How to play Pips as well as hints in case you get stuck.</description>
    </item>
    <item>
      <title>Comment recycler un vieux smartphone Samsung en mini PC</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-fixes/mini-pc/2985757_comment-recycler-un-vieux-smartphone-samsung-en-mini-pc</link>
      <pubDate>Mon, 23 Feb 2026 07:03:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-fixes/mini-pc/2985757_comment-recycler-un-vieux-smartphone-samsung-en-mini-pc</guid>
      <description>
Vous avez un vieux Samsung qui tra&#238;ne au fond d'un tiroir avec l'&#233;cran bris&#233; ? Ne le jetez pas. Le YouTuber ETA Prime vient de prouver qu'avec un peu de bricolage et moins de 100 euros, on peut en faire un mini PC de salon.
</description>
    </item>
    <item>
      <title>OnePlus Nord CE5 vs Samsung Galaxy A36&#160;: comment choisir le meilleur t&#233;l&#233;phone milieu de gamme&#160;?</title>
      <link>https://www.frandroid.com/versus/2780963_oneplus-nord-ce5-vs-samsung-galaxy-a36-comment-choisir-le-meilleur-telephone-milieu-de-gamme</link>
      <pubDate>Mon, 23 Feb 2026 07:03:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/versus/2780963_oneplus-nord-ce5-vs-samsung-galaxy-a36-comment-choisir-le-meilleur-telephone-milieu-de-gamme</guid>
      <description>
L'entr&#233;e de gamme est particuli&#232;rement dynamique cette ann&#233;e&#160;&#8212; en particulier le segment compris entre 250 et 350&#8364;. On fait s'affronter deux r&#233;f&#233;rences tr&#232;s recommandables dans notre nouveau comparatif&#160;!
</description>
    </item>
    <item>
      <title>How to decide what and how much to share at work</title>
      <link>https://www.fastcompany.com/91482837/how-to-decide-what-and-how-much-to-share-at-work</link>
      <pubDate>2026-02-23T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91482837/how-to-decide-what-and-how-much-to-share-at-work</guid>
      <description>In her new book, a Harvard Business School professor explains how to balance being authentic with being professional.
The workplace presents a distinctive set of disclosure dilemmas, beginning with the strange fan dance of interviewing. We are trying to put our best foot forward; to convince our potential employer we&#8217;re a perfect fit and consummate professional, yet we&#8217;re asked, &#8220;What are your weaknesses?&#8221; and &#8220;What are the biggest mistakes you&#8217;ve made?&#8221; Even the seemingly laidback &#8220;So, tell me about yourself&#8221; can feel like a trap. Where should we start?&#160;...</description>
    </item>
    <item>
      <title>NYT Connections Sports Edition today: Hints and answers for February 23, 2026</title>
      <link>https://mashable.com/article/nyt-connections-sports-edition-hint-answer-today-february-23-2026</link>
      <pubDate>Mon, 23 Feb 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">03iKTGxGxY1w3jVyPR1Ckv6</guid>
      <description>Connections: Sports Edition is a New York Times word game about finding common sports threads between words. How to solve the day's puzzle.</description>
    </item>
    <item>
      <title>&#171;&#160;Hey, Plex&#160;&#187; : Samsung ajoute une troisi&#232;me IA &#224; ses smartphones</title>
      <link>https://www.01net.com/actualites/hey-perplexity-samsung-ajoute-troisieme-ia-ses-smartphones.html</link>
      <pubDate>Mon, 23 Feb 2026 06:59:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327325</guid>
      <description>Samsung vient d'annoncer un partenariat avec l'IA de Perplexity qui sera int&#233;gr&#233;e aux Galaxy S26.</description>
    </item>
  </channel>
</rss>
