<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 31 Jan 2026 08:36:40 GMT</lastBuildDate>
    <item>
      <title>Ce v&#233;lo de route &#233;lectrique ultra l&#233;ger avec plus de 100 km d&#8217;autonomie perd 1 200 &#8364; chez Decathlon, une affaire en or</title>
      <link>https://www.frandroid.com/bons-plans/2960377_ce-velo-de-route-electrique-ultra-leger-avec-plus-de-100-km-dautonomie-perd-1-200-e-chez-decathlon-une-affaire-en-or</link>
      <pubDate>Sat, 31 Jan 2026 08:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2960377_ce-velo-de-route-electrique-ultra-leger-avec-plus-de-100-km-dautonomie-perd-1-200-e-chez-decathlon-une-affaire-en-or</guid>
      <description>
Si vous cherchez un v&#233;lo de route &#233;lectrique, le Van Rysel E-EDR AF chute &#224; 1 599 euros contre 2 799 euros de base chez Decathlon. Une belle offre sur un v&#233;lo aussi l&#233;ger, capable d&#8217;atteindre plus de 100 km d&#8217;autonomie selon l&#8217;usage.
</description>
    </item>
    <item>
      <title>Une arnaque &#224; l&#8217;amende impay&#233;e se propage en France, m&#233;fiez-vous des mails de l&#8217;ANTAI</title>
      <link>https://www.01net.com/actualites/arnaque-amende-impayee-propage-france-mefiez-vous-mails-antai.html</link>
      <pubDate>Sat, 31 Jan 2026 08:17:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323481</guid>
      <description>L'arnaque &#224; la fausse amende routi&#232;re revient en force en France. Des mails qui pr&#233;tendent que vous n'avez pas pay&#233; une amende de stationnement visent actuellement les Fran&#231;ais. L'escroquerie cherche &#224; vous d&#233;lester de vos donn&#233;es priv&#233;es et de quelques centaines d'euros&#8230;</description>
    </item>
    <item>
      <title>&#171;&#160;Ils ne veulent pas r&#233;gler le probl&#232;me&#160;&#187; : pourquoi le nouveau plan d&#8217;&#233;conomies des constructeurs europ&#233;ens inqui&#232;te les experts</title>
      <link>https://www.frandroid.com/marques/volkswagen/2962057_ils-ne-veulent-pas-regler-le-probleme-pourquoi-le-nouveau-plan-deconomies-des-constructeurs-europeens-inquiete-les-experts</link>
      <pubDate>Sat, 31 Jan 2026 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2962057_ils-ne-veulent-pas-regler-le-probleme-pourquoi-le-nouveau-plan-deconomies-des-constructeurs-europeens-inquiete-les-experts</guid>
      <description>
L'industrie automobile europ&#233;enne traverse une crise majeure. Mais au lieu d'annoncer des coupes budg&#233;taires, les constructeurs devraient plut&#244;t tout miser sur le logiciel, pour rattraper la Chine. La d&#233;cision r&#233;cente du groupe Volkswagen sur le sujet questionne.
</description>
    </item>
    <item>
      <title>The latest Instax printer is a pricey but worthy upgrade</title>
      <link>https://www.theverge.com/tech/870603/fujifilm-instax-mini-link-plus-reivew-improved-photos</link>
      <pubDate>2026-01-31T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/870603/the-loch-capsule-dishwasher-is-small-fast-and-efficient-it-even-sanitizes-gadgets</guid>
      <description>FujiFilm's Instax Mini Link 3 printer is a much-loved $100 accessory in my travel journal kit. I often tape a printed image next to my handwritten thoughts to preserve a moment in time. The prints produced by the instant film can, however, be soft and muddy - something the new $169.95 Instax Mini Link+ promises [&#8230;]</description>
    </item>
    <item>
      <title>Why so many businesses are still on the wrong side of the AI divide</title>
      <link>https://www.techradar.com/pro/why-so-many-businesses-are-still-on-the-wrong-side-of-the-ai-divide</link>
      <pubDate>Sat, 31 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">urgaagdG7R6aTCkSfucjzC</guid>
      <description>There's a big mismatch between what organization's priorities are and what they should be and how they are handling their operations.</description>
    </item>
    <item>
      <title>Chez Apple, la division IA se vide pendant que Google prend la main sur Siri</title>
      <link>https://www.01net.com/actualites/chez-apple-la-division-ia-se-vide-pendant-que-google-prend-la-main-sur-siri.html</link>
      <pubDate>Sat, 31 Jan 2026 07:29:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323545</guid>
      <description>Si la situation de Siri devrait se d&#233;bloquer tr&#232;s bient&#244;t gr&#226;ce aux mod&#232;les IA de Google, en interne les turbulences secouent toujours Apple avec de nouveaux d&#233;parts au sein de la division IA.</description>
    </item>
    <item>
      <title>I tested the KYY X90E laptop screen extender - a heavyweight dual-screen portable monitor with a lightweight price-tag</title>
      <link>https://www.techradar.com/pro/kyy-x90e-portable-monitor-review</link>
      <pubDate>Sat, 31 Jan 2026 07:15:00 +0000</pubDate>
      <guid isPermaLink="false">wZaSRz4VuJuXYhMwpdA37M</guid>
      <description>The KYY X90E Portable Monitor is an easy way to give more screen space to a laptop</description>
    </item>
    <item>
      <title>How to watch Sabalenka vs Rybakina on 9Now &#8212; it's *FREE*</title>
      <link>https://www.techradar.com/how-to-watch/tennis/aryna-sabalenka-vs-elena-rybakina-australian-open-womens-final-free</link>
      <pubDate>Sat, 31 Jan 2026 07:15:00 +0000</pubDate>
      <guid isPermaLink="false">LvyeAn8z7RYd52DCdUYkc9</guid>
      <description>How to watch Sabalenka vs Rybakina free streams online and from anywhere, as the top seed takes on the fifth seed in the final of the Australian Open 2026.</description>
    </item>
    <item>
      <title>Moins de 600 &#8364; pour un robot tondeuse sans fil efficace ? C&#8217;est le pari r&#233;ussi de ce mod&#232;le avec LiDAR [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/robots-tondeuses/2957759_moins-de-600-e-pour-un-robot-tondeuse-sans-fil-efficace-cest-le-pari-reussi-de-ce-modele-avec-lidar</link>
      <pubDate>Sat, 31 Jan 2026 07:12:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/robots-tondeuses/2957759_moins-de-600-e-pour-un-robot-tondeuse-sans-fil-efficace-cest-le-pari-reussi-de-ce-modele-avec-lidar</guid>
      <description>
Profiter d'un jardin propre sans lever le petit doigt, c'est possible gr&#226;ce aux robots tondeuses qui sont de plus en plus agiles, polyvalents et intelligents. Et le mieux dans tout &#231;a, c'est qu'ils sont d&#233;sormais toujours plus accessibles financi&#232;rement. 
</description>
    </item>
    <item>
      <title>L&#8217;un des pionniers des NFT ferme ses portes, les tokens non fongibles continuent de mourir</title>
      <link>https://www.01net.com/actualites/pionniers-nft-ferme-portes-tokens-non-fongibles-continuent-mourir.html</link>
      <pubDate>Sat, 31 Jan 2026 07:01:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322661</guid>
      <description>Nifty Gateway, l&#8217;une des plateformes historiques du boom des NFT, tirera sa r&#233;v&#233;rence dans quelques semaines. La mort de Nifty Gateway illustre le d&#233;clin progressif du march&#233; des tokens non fongibles.</description>
    </item>
  </channel>
</rss>
