<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 04 Nov 2025 07:34:06 GMT</lastBuildDate>
    <item>
      <title>Apple lance enfin l&#8217;App Store sur le web, en oubliant l&#8217;essentiel</title>
      <link>https://www.01net.com/actualites/apple-lance-enfin-lapp-store-sur-le-web-en-oubliant-lessentiel.html</link>
      <pubDate>Tue, 04 Nov 2025 07:30:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304862</guid>
      <description>17 ans apr&#232;s la cr&#233;ation de l'App Store, Apple daigne enfin donner &#224; sa boutique d'applications mobiles une version web digne de ce nom ! Mieux vaut tard que jamais, m&#234;me s'il manque toujours des fonctions essentielles.</description>
    </item>
    <item>
      <title>Pr&#233;-Black Friday : les yeux p&#233;tillent devant cet &#233;cran gaming Samsung incurv&#233; 49&#8243; et 144 Hz &#224; -25 %</title>
      <link>https://www.frandroid.com/bons-plans/2852813_pre-black-friday-les-yeux-petillent-devant-cet-ecran-gaming-samsung-incurve-49-et-144-hz-a-25</link>
      <pubDate>Tue, 04 Nov 2025 07:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2852813_pre-black-friday-les-yeux-petillent-devant-cet-ecran-gaming-samsung-incurve-49-et-144-hz-a-25</guid>
      <description>
Le Samsung G9 de 49 pouces est un &#233;cran PC incurv&#233; qu'il est possible de commander &#224; 599,99 euros au lieu de 799,99 euros en passant sur le site de Darty, avant m&#234;me le d&#233;but du Black Friday.
</description>
    </item>
    <item>
      <title>Vous pourrez bient&#244;t continuer vos conversations Google Meet dans Google Chat</title>
      <link>https://www.01net.com/actualites/vous-pourrez-bientot-continuer-vos-conversations-google-meet-dans-google-chat.html</link>
      <pubDate>Tue, 04 Nov 2025 07:29:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304914</guid>
      <description>Google vient d&#8217;annoncer une importante mise &#224; jour pour les conversations texte que vous tenez au cours d&#8217;un appel Google Meet. Vous pourrez bient&#244;t les retrouver dans Google Chat.</description>
    </item>
    <item>
      <title>130 Go de 5G &#224; petit prix : ce forfait mobile m&#233;rite d&#8217;&#234;tre plus connu [Sponso]</title>
      <link>https://www.frandroid.com/telecom/forfait-mobile/2850459_130-go-de-5g-a-petit-prix-ce-forfait-mobile-merite-detre-plus-connu</link>
      <pubDate>Tue, 04 Nov 2025 07:20:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/forfait-mobile/2850459_130-go-de-5g-a-petit-prix-ce-forfait-mobile-merite-detre-plus-connu</guid>
      <description>
Pas cher, performant et flexible, le forfait Oxyg&#232;ne de Prixtel est l'une des meilleures offres mobiles disponibles actuellement sur le march&#233; des t&#233;l&#233;coms.
</description>
    </item>
    <item>
      <title>Avec iOS 26.1, Apple corrige plus de 50 failles sur l&#8217;iPhone et l&#8217;iPad</title>
      <link>https://www.01net.com/actualites/avec-ios-26-1-apple-corrige-plus-50-failles-iphone-lipad.html</link>
      <pubDate>Tue, 04 Nov 2025 07:16:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304891</guid>
      <description>Apple d&#233;ploie iOS 26.1 sur les iPhone compatibles. Cette nouvelle version corrige pas moins de 56 failles critiques identifi&#233;es dans le syst&#232;me d'exploitation. Les failles pouvaient exposer les iPhone et iPad &#224; des vols de donn&#233;es ou &#224; l&#8217;ex&#233;cution de code malveillant. Si votre appareil est compatible, il vaut mieux ne pas tarder &#224; l&#8217;installer.</description>
    </item>
    <item>
      <title>macOS Tahoe 26.1 est disponible : voici toutes nouveaut&#233;s &#224; retenir</title>
      <link>https://www.frandroid.com/marques/apple/2845231_macos-tahoe-26-1-est-disponible-voici-toutes-nouveautes-a-retenir</link>
      <pubDate>Tue, 04 Nov 2025 07:16:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2845231_macos-tahoe-26-1-est-disponible-voici-toutes-nouveautes-a-retenir</guid>
      <description>
macOS 26.1 est disponible publiquement. Au programme : la d&#233;sactivation des effets Liquid Glass, quelques nouveaut&#233;s niveau design et am&#233;liorations des performances.
</description>
    </item>
    <item>
      <title>Nos 3 smartphones favoris en novembre 2025</title>
      <link>https://www.frandroid.com/guide-dachat/2852477_nos-3-smartphones-favoris-en-novembre-2025</link>
      <pubDate>Tue, 04 Nov 2025 07:16:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2852477_nos-3-smartphones-favoris-en-novembre-2025</guid>
      <description>
La saison des nouveaux smartphones se poursuit. Avec beaucoup de sorties, nous avons test&#233; un paquet de t&#233;l&#233;phones, et voici ceux que nous avons pr&#233;f&#233;r&#233;s.
</description>
    </item>
    <item>
      <title>iOS 26.1 est l&#224;, voici toutes les nouvelles fonctions</title>
      <link>https://www.frandroid.com/marques/apple/2845473_ios-26-1-est-la-voici-toutes-les-nouvelles-fonctions-et-comment-linstaller</link>
      <pubDate>Tue, 04 Nov 2025 07:07:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2845473_ios-26-1-est-la-voici-toutes-les-nouvelles-fonctions-et-comment-linstaller</guid>
      <description>
iOS 26.1 est maintenant disponible. La mise &#224; jour apporte plusieurs ajustements de design, des am&#233;liorations de performance, et de nouvelles options de personnalisation.
</description>
    </item>
    <item>
      <title>Galaxy Z TriFold&#160;: une nouvelle vid&#233;o montre en d&#233;tail le smartphone qui se plie en trois</title>
      <link>https://www.01net.com/actualites/galaxy-z-trifold-nouvelle-video-montre-detail-smartphone-plie-trois.html</link>
      <pubDate>Tue, 04 Nov 2025 07:03:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304885</guid>
      <description>Une nouvelle vid&#233;o montre le Galaxy Z TriFold sous un angle in&#233;dit. L&#8217;occasion de d&#233;couvrir plus de d&#233;tails sur son design tr&#232;s prometteur.</description>
    </item>
    <item>
      <title>Le Japon hausse encore le ton contre Sora d&#8217;OpenAI</title>
      <link>https://www.01net.com/actualites/le-japon-hausse-encore-le-ton-contre-sora-dopenai.html</link>
      <pubDate>Tue, 04 Nov 2025 07:01:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304857</guid>
      <description>Le Japon se rebiffe contre Sora 2, et plus sp&#233;cifiquement les industries culturelles dont les cr&#233;ations sont si populaires dans le monde entier. &#192; tel point que leurs personnages et univers sont pill&#233;s par le nouveau mod&#232;le IA de g&#233;n&#233;ration vid&#233;o d'OpenAI. Une organisation anti-partage nipponne a demand&#233; au cr&#233;ateur de ChatGPT d'arr&#234;ter de se servir dans ce coffre &#224; ic&#244;nes....</description>
    </item>
    <item>
      <title>Three invisible problems draining your team&#8217;s performance</title>
      <link>https://www.fastcompany.com/91428118/three-invisible-problems-draining-your-teams-performacne</link>
      <pubDate>2025-11-04T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91428118/three-invisible-problems-draining-your-teams-performacne</guid>
      <description>Most leaders manage time. The best ones manage rhythm and align their team&#8217;s energy, capacity, and timing to turn effort into flow.
Most people still measure performance in hours. They pack their calendars as full as possible, track time down to the minute, and take pride in squeezing more into each day. However, the best performance comes from harnessing rhythm&#8212;the alignment of energy, capacity, and focus. It&#8217;s what turns effort into flow....</description>
    </item>
    <item>
      <title>1&#160;200 km d&#8217;autonomie&#160;: Toyota a trouv&#233; la recette, mais pourrait &#234;tre doubl&#233;</title>
      <link>https://www.01net.com/actualites/1-200-km-dautonomie-toyota-a-trouve-la-recette-mais-pourrait-etre-double.html</link>
      <pubDate>Tue, 04 Nov 2025 06:56:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304576</guid>
      <description>En retard sur la voiture &#233;lectrique, Toyota mise beaucoup sur les batteries solides pour revenir dans la course. Le constructeur japonais pourrait &#234;tre le premier &#224; lancer un tel mod&#232;le qui marquerait un tournant dans l'industrie auto.</description>
    </item>
    <item>
      <title>Avec 200 Go de 5G, ce forfait mobile &#224; petit prix se d&#233;marque clairement sur le r&#233;seau de Bouygues</title>
      <link>https://www.frandroid.com/bons-plans/2852343_avec-200-go-de-5g-ce-forfait-mobile-a-petit-prix-se-demarque-clairement-sur-le-reseau-de-bouygues</link>
      <pubDate>Tue, 04 Nov 2025 06:49:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2852343_avec-200-go-de-5g-ce-forfait-mobile-a-petit-prix-se-demarque-clairement-sur-le-reseau-de-bouygues</guid>
      <description>
Rep&#233;r&#233; parmi les meilleures offres 5G sur le r&#233;seau de Bouygues Telecom, ce forfait La Poste Mobile propose 200 Go de data pour un tr&#232;s bon tarif. Il combine un gros volume, une belle couverture r&#233;seau et un prix sous les 11 euros, mais seulement pour quelques jours.
</description>
    </item>
    <item>
      <title>L&#8217;App Store d&#8217;Apple se dote enfin d&#8217;une interface web</title>
      <link>https://www.frandroid.com/marques/apple/2853837_lapp-store-dapple-se-dote-enfin-dune-interface-web</link>
      <pubDate>Tue, 04 Nov 2025 06:35:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2853837_lapp-store-dapple-se-dote-enfin-dune-interface-web</guid>
      <description>
Longtemps r&#233;serv&#233; aux propri&#233;taires d&#8217;appareil Apple, l&#8217;acc&#232;s au c&#233;l&#233;brissime App Store peut d&#233;sormais de faire via n&#8217;importe quel appareil par le truchement d&#8217;un site web tout fra&#238;chement lanc&#233;.
</description>
    </item>
    <item>
      <title>01net morning&#160;: nouvelles failles dans Windows 11, Shein menac&#233; d&#8217;interdiction en France, une coque en acier pour r&#233;duire l&#8217;utilisation du smartphone</title>
      <link>https://www.01net.com/actualites/01net-morning-nouvelles-failles-dans-windows-11-shein-menace-dinterdiction-en-france-une-coque-en-acier-pour-reduire-lutilisation-du-smartphone.html</link>
      <pubDate>Tue, 04 Nov 2025 06:30:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304854</guid>
      <description>Bonjour &#224; tous, voici la matinale de 01net ! Qu&#8217;avez-vous manqu&#233; ce week-end ? Retrouvez toute l&#8217;actu &#224; connaitre pour d&#233;marrer la semaine du bon pied !</description>
    </item>
    <item>
      <title>L&#8217;avant-premi&#232;re du Black Friday fait la part belle au gaming avec la Nintendo Switch 2 en promo, et bien d&#8217;autres</title>
      <link>https://www.frandroid.com/bons-plans/2853043_lavant-premiere-du-black-friday-fait-la-part-belle-au-gaming-avec-la-nintendo-switch-2-en-promo-et-bien-dautres</link>
      <pubDate>Tue, 04 Nov 2025 06:05:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2853043_lavant-premiere-du-black-friday-fait-la-part-belle-au-gaming-avec-la-nintendo-switch-2-en-promo-et-bien-dautres</guid>
      <description>
L'ann&#233;e 2025 a &#233;t&#233; on ne peut plus riche pour le jeu vid&#233;o. Outre la sortie de jeux prometteurs, la Nintendo Switch 2 a accapar&#233; toute l'attention cet &#233;t&#233; et continue de le faire aujourd'hui. D'autant plus qu'elle fait partie des meilleures offres dans cette s&#233;lection du pr&#233;-Black Friday.
</description>
    </item>
    <item>
      <title>20% Off Chewy Promo Codes | November 2025</title>
      <link>https://www.wired.com/story/chewy-promo-code/</link>
      <pubDate>Tue, 04 Nov 2025 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">674f80033ffc1b7f03c85b6b</guid>
      <description>Explore Chewy coupon codes for 20% off pet food with early Black Friday deals, a $20 gift card on your first purchase, buy 3 get 1 free offers and more.</description>
    </item>
    <item>
      <title>Samsung Galaxy S26, Redmagic 11 Pro, USB-C&#8230; &#8211; Tech&#8217;spresso</title>
      <link>https://www.frandroid.com/actualites-generales/2853579_samsung-galaxy-s26-redmagic-11-pro-usb-c-techspresso</link>
      <pubDate>Tue, 04 Nov 2025 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2853579_samsung-galaxy-s26-redmagic-11-pro-usb-c-techspresso</guid>
      <description>
Vers la fin des box en France, la signification du C d'USB-C et les derni&#232;res nouvelles sur les Galaxy S26 de Samsung. C'est parti pour le r&#233;cap des actus tech du 3 novembre.
</description>
    </item>
  </channel>
</rss>
