<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 22 Jan 2026 11:27:06 GMT</lastBuildDate>
    <item>
      <title>Whatsapp, Signal et Telegram ouverts &#224; la police fran&#231;aise&#160;? Le chiffrement des messageries encore menac&#233;</title>
      <link>https://www.01net.com/actualites/whatsapp-signal-et-telegram-ouverts-a-la-police-francaise-le-chiffrement-des-messageries-encore-menace.html</link>
      <pubDate>Thu, 22 Jan 2026 11:22:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321797</guid>
      <description>Les messageries chiffr&#233;es comme Signal, WhatsApp et Telegram seront-elles bient&#244;t accessibles aux policiers fran&#231;ais ? Le gouvernement compte bien repartir &#224; l'assaut du chiffrement, rapporte Le Monde ce jeudi 22 janvier.</description>
    </item>
    <item>
      <title>Tiger Global, Microsoft to fully exit Walmart-backed PhonePe via its IPO</title>
      <link>https://techcrunch.com/2026/01/22/tiger-global-microsoft-to-fully-exit-walmart-backed-phonepe-via-its-ipo/</link>
      <pubDate>Thu, 22 Jan 2026 11:19:30 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3084935</guid>
      <description>Tiger Global and Microsoft are offering up their full stakes in the company, while Walmart is choosing to retain its majority stake, and selling up to 45.9 million shares.</description>
    </item>
    <item>
      <title>Google Maps pr&#233;pare l&#8217;option qu&#8217;on attendait pour les signalements</title>
      <link>https://www.01net.com/actualites/google-maps-prepare-option-on-attendait-pour-signalements.html</link>
      <pubDate>Thu, 22 Jan 2026 11:15:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321855</guid>
      <description>Google Maps s&#8217;appr&#234;te enfin &#224; offrir aux utilisateurs la possibilit&#233; de supprimer l'int&#233;gralit&#233; de leurs signalements sur l'application.</description>
    </item>
    <item>
      <title>Most SMBs aren't set up to survive a major cyberattack - here's what needs to be done</title>
      <link>https://www.techradar.com/pro/security/most-smbs-arent-set-up-to-survive-a-major-cyberattack-heres-what-needs-to-be-done</link>
      <pubDate>Thu, 22 Jan 2026 11:14:44 +0000</pubDate>
      <guid isPermaLink="false">Y4hgLFe37VFgbex59iqAmf</guid>
      <description>One-tenth of UK orgs probably wouldn't survive after a cyberattack, and most agree risks have increased over the past 12 months.</description>
    </item>
    <item>
      <title>Ces deux smartphones pliants perdent jusqu&#8217;&#224; -50 % lors des soldes, mais lequel vaut vraiment le coup ?</title>
      <link>https://www.frandroid.com/bons-plans/2950509_jusqua-50-pour-le-samsung-galaxy-z-fold-6-et-le-google-pixel-9-pro-fold-durant-les-soldes-mais-quel-pliant-choisir</link>
      <pubDate>Thu, 22 Jan 2026 11:11:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2950509_jusqua-50-pour-le-samsung-galaxy-z-fold-6-et-le-google-pixel-9-pro-fold-durant-les-soldes-mais-quel-pliant-choisir</guid>
      <description>
Avoir un smartphone pliant demande un budget cons&#233;quent, mais quand il s'agit d'anciens mod&#232;les qui profitent en prime des soldes pour s'afficher &#224; prix cass&#233;s, c'est le moment ou jamais. Le Samsung Galaxy Z Fold 6 et le Google Pixel 9 Pro Fold font d'ailleurs l'objet d'une belle baisse de prix pendant les soldes, mais lequel choisir&#160;? 
</description>
    </item>
    <item>
      <title>Boulanger fait le plein de bonnes affaires &#224; la 3e d&#233;marque des soldes : les 19 offres &#224; ne pas rater</title>
      <link>https://www.frandroid.com/bons-plans/2931541_boulanger-frappe-pour-le-lancement-de-la-3e-demarque-des-soldes-les-18-deals-a-saisir</link>
      <pubDate>Thu, 22 Jan 2026 11:05:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931541_boulanger-frappe-pour-le-lancement-de-la-3e-demarque-des-soldes-les-18-deals-a-saisir</guid>
      <description>
La 3&#7497; d&#233;marque vient tout juste de d&#233;marrer chez Boulanger, et les bonnes affaires continuent de s&#8217;encha&#238;ner ! L&#8217;enseigne d&#233;voile de nouvelles r&#233;ductions encore plus all&#233;chantes sur une large s&#233;lection de produits. C&#8217;est le moment parfait pour profiter de remises g&#233;n&#233;reuses avant la fin des soldes.
</description>
    </item>
    <item>
      <title>Alerte LastPass&#160;: une arnaque par mail vise les clients du gestionnaire de mots de passe</title>
      <link>https://www.01net.com/actualites/alerte-lastpass-arnaque-mail-vise-clients-gestionnaire-mots-passe.html</link>
      <pubDate>Thu, 22 Jan 2026 11:01:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321848</guid>
      <description>LastPass alerte ses utilisateurs au sujet d'une nouvelle campagne de phishing. Les mails frauduleux pr&#233;tendent qu'il faut d'urgence r&#233;aliser une sauvegarde de votre coffre&#8209;fort, pr&#233;textant une op&#233;ration de maintenance. Cette tactique vise &#224; d&#233;rober vos identifiants et mots de passe.</description>
    </item>
    <item>
      <title>The US Is In For Another Bad Year of Measles Cases</title>
      <link>https://www.wired.com/story/the-us-is-in-for-another-bad-year-of-measles-cases/</link>
      <pubDate>Thu, 22 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">696fa92125e938273bcc52ea</guid>
      <description>A growing measles outbreak in South Carolina has infected more than 600 people since October, with hundreds more being potentially exposed.</description>
    </item>
    <item>
      <title>We Are Witnessing the Self-Immolation of a Superpower</title>
      <link>https://www.wired.com/story/donald-trump-has-fully-set-fire-to-what-made-america-great/</link>
      <pubDate>Thu, 22 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">697106233f17f3b6900ceffd</guid>
      <description>With Donald Trump&#8217;s actions in Greenland, Minneapolis, and Venezuela, a foreign enemy could not invent a better chain of events to wreck the standing of the United States.</description>
    </item>
    <item>
      <title>Former Google trio is building an interactive AI-powered learning app for kids</title>
      <link>https://techcrunch.com/2026/01/22/former-google-trio-is-building-an-interactive-ai-powered-learning-app-for-kids/</link>
      <pubDate>Thu, 22 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3084389</guid>
      <description>Big tech companies and upcoming startups want to use generative AI to build software and hardware for kids. A lot of those experiences are limited to text or voice, and kids might not find that captivating. Three former Google employees want to get over that hurdle with their generative AI-powered interactive app, Sparkli. Sparkli was [&#8230;]</description>
    </item>
    <item>
      <title>Not every actor is anti-AI &#8212; Chris Pratt says &#8216;a lot more movies will be made&#8217; thanks to the tech, even if new sci-fi thriller Mercy doesn't agree</title>
      <link>https://www.techradar.com/streaming/entertainment/not-every-actor-is-anti-ai-chris-pratt-says-a-lot-more-movies-will-be-made-thanks-to-the-tech-even-if-new-sci-fi-thriller-mercy-doesnt-agree</link>
      <pubDate>Thu, 22 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">dhGDJ2AcWxjhpfYuStCFGd</guid>
      <description>As new AI sci-fi thriller Mercy hits theaters this week, Chris Pratt is one of the few Hollywood figures not scared of the 'harsh reality' of technology.</description>
    </item>
    <item>
      <title>Fabriqu&#233;es avec de vieilles chambres &#224; air et des bouteilles recycl&#233;es, ces sacoches v&#233;lo d&#233;tonnent</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2951633_fabriquees-avec-de-vieilles-chambres-a-air-et-des-bouteilles-recyclees-ces-sacoches-velo-detonnent</link>
      <pubDate>Thu, 22 Jan 2026 10:57:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2951633_fabriquees-avec-de-vieilles-chambres-a-air-et-des-bouteilles-recyclees-ces-sacoches-velo-detonnent</guid>
      <description>
D&#233;barquant sur le march&#233; des sacoches v&#233;lo, dont certaines 2-en-1, Shad Bikes applique un style particulier &#224; ses produits con&#231;us &#224; partir de bouteilles recycl&#233;es voire de chambres &#224; air upcycl&#233;es.
</description>
    </item>
    <item>
      <title>Ubisoft has canceled the Prince of Persia: The Sands of Time remake and delayed several other titles in a major shakeup</title>
      <link>https://www.techradar.com/gaming/gaming-industry/ubisoft-has-canceled-the-prince-of-persia-the-sands-of-time-remake-and-delayed-several-other-titles-in-a-major-shakeup</link>
      <pubDate>Thu, 22 Jan 2026 10:54:18 +0000</pubDate>
      <guid isPermaLink="false">JesJznBANi6znNJQantjP6</guid>
      <description>The Prince of Persia: The Sands of Time remake has been canceled as Ubisoft undergoes a massive restructuring. The company has also delayed several games.</description>
    </item>
    <item>
      <title>Google Home : vos lumi&#232;res sont &#171; hors ligne &#187; ? Pas de panique, Google pr&#233;pare un correctif</title>
      <link>https://www.frandroid.com/marques/google/2951841_google-home-vos-lumieres-sont-hors-ligne-pas-de-panique-google-prepare-un-correctif</link>
      <pubDate>Thu, 22 Jan 2026 10:46:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2951841_google-home-vos-lumieres-sont-hors-ligne-pas-de-panique-google-prepare-un-correctif</guid>
      <description>
Des utilisateurs de l'application Google Home rapportent un bug g&#234;nant : leurs lumi&#232;res et interrupteurs connect&#233;s apparaissent en hors ligne. Google a officiellement reconnu le probl&#232;me.
</description>
    </item>
    <item>
      <title>Marre de l&#8217;IA et des pubs dans Chrome et Edge ? Cet outil bien pratique fait le m&#233;nage pour vous</title>
      <link>https://www.frandroid.com/culture-tech/web/2951777_marre-de-lia-et-des-pubs-dans-chrome-et-edge-cet-outil-bien-pratique-fait-le-menage-pour-vous</link>
      <pubDate>Thu, 22 Jan 2026 10:46:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/web/2951777_marre-de-lia-et-des-pubs-dans-chrome-et-edge-cet-outil-bien-pratique-fait-le-menage-pour-vous</guid>
      <description>
Si vous estimez que votre navigateur est devenu une v&#233;ritable usine &#224; gaz, rempli d'assistants IA et de fonctionnalit&#233;s inutiles, alors cet outil pourrait vous plaire.
</description>
    </item>
    <item>
      <title>Tesla battu par un petit nouveau : comment Decathlon s&#8217;invite dans les r&#233;seaux de recharge pr&#233;f&#233;r&#233;s des Fran&#231;ais</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2951601_tesla-battu-par-un-petit-nouveau-comment-decathlon-sinvite-dans-les-reseaux-de-recharge-preferes-des-francais</link>
      <pubDate>Thu, 22 Jan 2026 10:45:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2951601_tesla-battu-par-un-petit-nouveau-comment-decathlon-sinvite-dans-les-reseaux-de-recharge-preferes-des-francais</guid>
      <description>
Quel est le meilleur r&#233;seau de bornes de charge en France&#160;? C&#8217;est ce qu&#8217;a voulu savoir Chargemap, qui publie les r&#233;sultats de sa grande &#233;tude. Verdict : c'est une jeune entreprise tricolore qui a le plus s&#233;duit les propri&#233;taires de voitures &#233;lectriques.
</description>
    </item>
    <item>
      <title>Quels sont les meilleurs &#233;crans gaming de 2026&#8201;?</title>
      <link>https://www.frandroid.com/guide-dachat/688285_quel-ecran-pc-pour-le-gaming-choisir-en-2020-notre-selection</link>
      <pubDate>Thu, 22 Jan 2026 10:43:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/688285_quel-ecran-pc-pour-le-gaming-choisir-en-2020-notre-selection</guid>
      <description>
Vous jouez sur PC ? Voici notre s&#233;lection des meilleurs &#233;crans PC gamer : 4K, 144 Hz ou plus, HDR, incurv&#233;&#8230; Ultra premium ou bien abordable, ce guide r&#233;pondra &#224; tous les besoins et tous les budgets.
</description>
    </item>
    <item>
      <title>How to watch Confessions Of A Killer &#8212; it's *FREE*</title>
      <link>https://www.techradar.com/how-to-watch/confessions-of-a-killer-free</link>
      <pubDate>Thu, 22 Jan 2026 10:39:13 +0000</pubDate>
      <guid isPermaLink="false">Lr74x82Cm4yfLE4gJzmKGN</guid>
      <description>A decades-old murder confession makes for bone-chilling viewing. Here's how to watch Confessions Of A Killer for FREE.</description>
    </item>
    <item>
      <title>On a test&#233; le Samsung Galaxy XR : l&#8217;anti Apple Vision Pro est l&#224;</title>
      <link>https://www.frandroid.com/marques/samsung/2902831_on-a-teste-le-samsung-galaxy-xr-ne-vous-precipitez-pas-voici-pourquoi</link>
      <pubDate>Thu, 22 Jan 2026 10:38:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2902831_on-a-teste-le-samsung-galaxy-xr-ne-vous-precipitez-pas-voici-pourquoi</guid>
      <description>
Voici la r&#233;ponse de Google et Samsung &#224; l'h&#233;g&#233;monie naissante d'Apple dans la r&#233;alit&#233; mixte. De passage &#224; New York, je n'ai pas r&#233;sist&#233;. J'ai ramen&#233; un Galaxy XR dans mes valises pour comprendre ce que &#171; Android XR &#187; a dans le ventre. Le produit est utilisable en fran&#231;ais, le Play Store est l&#224;, et la promesse est belle : transformer votre environnement en un bureau Android g&#233;ant et infini. Voici ce que j'en pense.
...</description>
    </item>
    <item>
      <title>Tarif de l&#8217;&#233;lectricit&#233;&#160;: qui gagne et qui perd apr&#232;s la fin de l&#8217;ARENH&#8201;?</title>
      <link>https://www.frandroid.com/survoltes/2951611_tarif-de-lelectricite-qui-gagne-et-qui-perd-apres-la-fin-de-larenh</link>
      <pubDate>Thu, 22 Jan 2026 10:37:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2951611_tarif-de-lelectricite-qui-gagne-et-qui-perd-apres-la-fin-de-larenh</guid>
      <description>
La date de la prochaine mise &#224; jour du tarif r&#233;glement&#233; de vente de l&#8217;&#233;lectricit&#233; (TRVE) approche. Si une tr&#232;s l&#233;g&#232;re baisse est attendue pour la majorit&#233; des consommateurs, certains abonn&#233;s feront en revanche les frais de cette &#233;volution.
</description>
    </item>
    <item>
      <title>Vente de SFR : une nouvelle offre de 20 milliards serait bient&#244;t d&#233;pos&#233;e par Free, Bouygues et Orange</title>
      <link>https://www.frandroid.com/marques/sfr/2951701_vente-de-sfr-une-nouvelle-offre-de-20-milliards-serait-bientot-deposee-par-free-bouygues-et-orange</link>
      <pubDate>Thu, 22 Jan 2026 10:36:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sfr/2951701_vente-de-sfr-une-nouvelle-offre-de-20-milliards-serait-bientot-deposee-par-free-bouygues-et-orange</guid>
      <description>
Apr&#232;s plusieurs semaines de silence d'un c&#244;t&#233; comme de l'autre, le rachat de SFR pourrait rapidement d&#233;boucher sur une nouvelle offre du consortium compos&#233; de Bouygues Telecom, Free et Orange. Dans un communiqu&#233; de presse commun, les trois op&#233;rateurs confirment qu'un audit d'acquisition est lanc&#233;.
</description>
    </item>
    <item>
      <title>Best Organic Mattresses (2026): Birch, Avocado, Naturepedic, More</title>
      <link>https://www.wired.com/gallery/best-organic-mattress/</link>
      <pubDate>Thu, 22 Jan 2026 10:36:00 +0000</pubDate>
      <guid isPermaLink="false">6846efe40f6334a7bfdd954e</guid>
      <description>These natural, organic mattresses are eco-friendly alternatives to conventional models and just as comfortable.</description>
    </item>
    <item>
      <title>Livestream: Welcome to the Chinese Century</title>
      <link>https://www.wired.com/story/livestream-welcome-to-the-chinese-century/</link>
      <pubDate>Thu, 22 Jan 2026 10:35:53 +0000</pubDate>
      <guid isPermaLink="false">696693322ef346736f0541ca</guid>
      <description>Watch our livestream on China&#8217;s dominance, influence, and how it is rewriting the future.</description>
    </item>
    <item>
      <title>L&#8217;application Xbox permet (enfin) de faire tout ce que l&#8217;on attend d&#8217;elle sur les PC Windows ARM</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/2951403_lapplication-xbox-permet-enfin-de-faire-tout-ce-que-lon-attend-delle-sur-les-pc-windows-arm</link>
      <pubDate>Thu, 22 Jan 2026 10:34:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/2951403_lapplication-xbox-permet-enfin-de-faire-tout-ce-que-lon-attend-delle-sur-les-pc-windows-arm</guid>
      <description>
Microsoft a annonc&#233; cette semaine, par la voie d'un communiqu&#233;, que son application Xbox serait d&#233;sormais capable d'offrir peu ou prou la m&#234;me exp&#233;rience aux PC Windows ARM qu'aux machines x86. &#192; la cl&#233;, la possibilit&#233; d'installer des jeux et d'y jouer localement dans certains cas.
</description>
    </item>
    <item>
      <title>Prime Video unveils first look at Grand Regent Thragg and Universa in new images for Invincible season 4 &#8212; but where are its release date and trailer, William?</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/prime-video-unveils-first-look-at-grand-regent-thragg-and-universa-in-new-images-for-invincible-season-4-but-where-are-its-release-date-and-trailer-william</link>
      <pubDate>Thu, 22 Jan 2026 10:31:54 +0000</pubDate>
      <guid isPermaLink="false">esLyxMWNKLHdedWXxMsTbc</guid>
      <description>The first images for Invincible season 4 have revealed the new villains we'll meet in the Amazon TV Original.</description>
    </item>
    <item>
      <title>DHS&#8217;s Data Grab Is Getting Citizens Kicked Off Voter Rolls, New Complaint Says</title>
      <link>https://www.wired.com/story/dhs-data-grab-getting-citizens-kicked-off-voter-rolls/</link>
      <pubDate>Thu, 22 Jan 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">697000ed25e938273bcc52f5</guid>
      <description>As states check voter registration against a mashup of federal data, a new complaint says US citizens are getting kicked off state voter rolls as a result.</description>
    </item>
    <item>
      <title>Trump&#8217;s chaos is forcing the usually methodical chips industry to learn how to pivot quickly</title>
      <link>https://www.fastcompany.com/91477962/trumps-chaos-is-forcing-the-usually-methodical-chips-industry-to-learn-how-to-pivot-quickly</link>
      <pubDate>2026-01-22T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91477962/trumps-chaos-is-forcing-the-usually-methodical-chips-industry-to-learn-how-to-pivot-quickly</guid>
      <description>Donald Trump&#8217;s flip-flopping on tariffs for chips destined for China throws an industry that moves slowly into turmoil.
A week is a long time in politics. But in Donald Trump&#8217;s world, even a day can feel like an eon. On Tuesday last week, the United States approved the export of Nvidia&#8217;s H200 GPUs&#8212;the second-most advanced computer chips powering the generative AI revolution&#8212;to markets that include China....</description>
    </item>
    <item>
      <title>The Pok&#233;mon TCG Team Rocket&#8217;s Mewtwo ex League Battle Deck has hit a record-low price on Amazon &#8212; save over $30</title>
      <link>https://mashable.com/article/jan-22-pokemon-tcg-team-rockets-mewtwo-ex-league-battle-deck-deal</link>
      <pubDate>Thu, 22 Jan 2026 10:26:47 +0000</pubDate>
      <guid isPermaLink="false">07LrxVbQZbQQilfoDnZgluk</guid>
      <description>Score the Pok&#233;mon TCG&#8217;s Team Rocket&#8217;s Mewtwo ex League Battle Deck for just $19.98 on Amazon &#8212; a massive 62% discount.</description>
    </item>
    <item>
      <title>The Apple Watch Ultra 2 is down to its lowest-ever price at Amazon &#8212; save $250</title>
      <link>https://mashable.com/article/jan-22-apple-watch-ultra-2-deal</link>
      <pubDate>Thu, 22 Jan 2026 10:20:06 +0000</pubDate>
      <guid isPermaLink="false">02kTvUvz6wndtWRL1FH8Cqc</guid>
      <description>As of Jan. 22, select models of the Apple Watch Ultra 2 are back to their lowest-ever price of $549 at Amazon, 31% off their list price of $799.</description>
    </item>
    <item>
      <title>'Pin-sharp 4K footage' &#8211; the 3 best security cameras to protect your home, recommended by a smart home tech editor</title>
      <link>https://www.techradar.com/home/home-security/pin-sharp-4k-footage-the-3-best-security-cameras-to-protect-your-home-recommended-by-a-smart-home-tech-editor</link>
      <pubDate>Thu, 22 Jan 2026 10:19:53 +0000</pubDate>
      <guid isPermaLink="false">XDUR2hYh48vsN9efGzkm9a</guid>
      <description>Monitor your property with pin-sharp footage, great battery life, and even AI-powered facial recognition.</description>
    </item>
    <item>
      <title>Roborock has launched a new flagship robovac, and that's your cue to go and buy the old version for a massively reduced price</title>
      <link>https://www.techradar.com/home/vacuums/roborock-has-launched-a-new-flagship-robovac-and-thats-your-cue-to-go-and-buy-the-old-version-for-a-massively-reduced-price</link>
      <pubDate>Thu, 22 Jan 2026 10:18:24 +0000</pubDate>
      <guid isPermaLink="false">XmbiKtu6nwGaM6cgeRB8pn</guid>
      <description>I've tested dozens of robot vacuums, but this is the one that has a permanent spot in my home &#8211; and it's never let me down.</description>
    </item>
    <item>
      <title>Darty solde &#224; -44 % ce puissant laptop Asus avec &#233;cran Oled et pesant moins de 1 kilo</title>
      <link>https://www.frandroid.com/bons-plans/2814585_darty-solde-a-44-ce-puissant-laptop-asus-avec-ecran-oled-et-pesant-moins-de-1-kilo</link>
      <pubDate>Thu, 22 Jan 2026 10:17:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2814585_darty-solde-a-44-ce-puissant-laptop-asus-avec-ecran-oled-et-pesant-moins-de-1-kilo</guid>
      <description>
Le Zenbook UX3407 avec sa configuration ARM est en promotion chez Darty pour les soldes d'hiver. Une ristourne int&#233;ressante qui permet d'avoir ce tr&#232;s bon laptop &#224; presque moiti&#233; prix.
</description>
    </item>
    <item>
      <title>7500 mAh dans un petit smartphone, l&#8217;ultime exploit technique de OnePlus avant de dispara&#238;tre ?</title>
      <link>https://www.frandroid.com/marques/oneplus/2951657_7500-mah-dans-un-petit-smartphone-lultime-exploit-technique-de-oneplus-avant-de-disparaitre</link>
      <pubDate>Thu, 22 Jan 2026 10:16:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/oneplus/2951657_7500-mah-dans-un-petit-smartphone-lultime-exploit-technique-de-oneplus-avant-de-disparaitre</guid>
      <description>
Alors que les rumeurs sur une possible disparition de la marque s'intensifient, le OnePlus 15T fait parler de lui. Le futur appareil embarquerait une batterie gargantuesque, tentant une derni&#232;re fois de s&#233;duire les utilisateurs avant un potentiel d&#233;mant&#232;lement.
</description>
    </item>
    <item>
      <title>Get $100 off the Apple Studio Display right now at Amazon</title>
      <link>https://mashable.com/article/jan-22-apple-studio-display-deal</link>
      <pubDate>Thu, 22 Jan 2026 10:14:07 +0000</pubDate>
      <guid isPermaLink="false">06V5TmncBZzCZ1ecfqwXedO</guid>
      <description>Best Apple deal. Save 6% on the Apple Studio Display at Amazon.</description>
    </item>
    <item>
      <title>Upgrade your streaming setup with $15 off the Roku Streaming Stick 4K at Amazon</title>
      <link>https://mashable.com/article/jan-22-roku-streaming-stick-4k-deal</link>
      <pubDate>Thu, 22 Jan 2026 10:12:19 +0000</pubDate>
      <guid isPermaLink="false">07qKSsEgkQTsbusj9GlFPBO</guid>
      <description>Find the best streaming deal at Amazon. Save 30% on the Roku Streaming Stick 4K at Amazon.</description>
    </item>
    <item>
      <title>The Soundcore Sleep A30 Special earbuds are the best sleep earbuds available now</title>
      <link>https://mashable.com/review/soundcore-sleep-a30-special-earbuds</link>
      <pubDate>Thu, 22 Jan 2026 10:10:02 +0000</pubDate>
      <guid isPermaLink="false">01jR7eeXgfww41tfNeW9Km6</guid>
      <description>Soundcore's Sleep A30 Special earbuds are Mashable's headphones expert's new favorite sleep earbuds &#8212; here's why.</description>
    </item>
    <item>
      <title>Fnac et Darty multiplient les deals pour la 3e d&#233;marque des soldes : les 18 meilleures offres &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-multiplient-les-deals-pour-la-3e-demarque-des-soldes-les-18-meilleures-offres-a-retenir</link>
      <pubDate>Thu, 22 Jan 2026 10:08:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-multiplient-les-deals-pour-la-3e-demarque-des-soldes-les-18-meilleures-offres-a-retenir</guid>
      <description>
La 3&#7497; d&#233;marque des soldes d'hiver est lanc&#233;e ! &#192; cette occasion, la Fnac et Darty ouvrent une nouvelle vague de promotions sur les produits Tech. Smartphones, tablettes, ordinateurs&#8230; les bonnes affaires se multiplient, avec notamment le r&#233;cent Galaxy&#8201;Z&#8201;Flip&#8201;7 affich&#233; &#224; prix cass&#233;.
</description>
    </item>
    <item>
      <title>The Eufy E25 robot vacuum is $250 off at Amazon &#8212; act fast to save with this limited-time deal</title>
      <link>https://mashable.com/article/jan-22-eufy-robot-vacuum-deal</link>
      <pubDate>Thu, 22 Jan 2026 10:08:43 +0000</pubDate>
      <guid isPermaLink="false">05z4UzUK4lrkfg7wkaqu1Ig</guid>
      <description>Get the best robot vacuum deal. Save 28% on the eufy E25 at Amazon.</description>
    </item>
    <item>
      <title>Votre smartphone Xiaomi est devenu lent&#160;? D&#233;sinstallez ces 6 apps Android truff&#233;es de virus</title>
      <link>https://www.01net.com/actualites/votre-smartphone-xiaomi-est-devenu-lent-desinstallez-ces-6-apps-android-truffees-de-virus.html</link>
      <pubDate>Thu, 22 Jan 2026 10:03:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321779</guid>
      <description>Un nouveau malware s&#8217;invite dans des applications Android distribu&#233;es sur la boutique de Xiaomi. Truff&#233;es de malwares, ces six apps transforment votre smartphone en machine &#224; cliquer sur des pubs gr&#226;ce &#224; l&#8217;IA. Tandis que les pirates empochent les revenus publicitaires, votre smartphone va se mettre &#224; ramer et &#224; chauffer...</description>
    </item>
    <item>
      <title>Framework Laptop 16 (AMD) review: I&#8217;m obsessed with both the concept and the laptop</title>
      <link>https://mashable.com/review/framework-laptop-16-amd</link>
      <pubDate>Thu, 22 Jan 2026 10:02:37 +0000</pubDate>
      <guid isPermaLink="false">00X2YQ0uF0o6Wv6t1ic8bW0</guid>
      <description>The Framework Laptop 16 is buildable, repairable, and upgradeable. It's a shining jewel in a sea of tech designed to be obsolete within a few years.</description>
    </item>
    <item>
      <title>The best fitness trackers for 2026</title>
      <link>https://www.engadget.com/wearables/best-fitness-trackers-133053484.html?src=rss</link>
      <pubDate>Thu, 22 Jan 2026 10:00:35 +0000</pubDate>
      <guid isPermaLink="false">4ad1be40-0a29-3f30-89c3-c8f1a9034ccf</guid>
      <description>If you're looking to get fit, sleep better or just keep a closer eye on your health, a fitness wearable is a great place to start. Whether you're into intense workouts or just want to hit your step goal each day, the best fitness trackers available today can offer loads of helpful features, from sleep tracking and resting heart rate monitoring to built-in GPS and stress tracking. Some are even subtle enough to wear 24/7, like smart rings, while others double as stylish smartwatches.There are great options out there for beginners as well as more advanced users, and the variety of features means...</description>
    </item>
    <item>
      <title>&#171; Reprogrammation de votre colis &#187; : Attention &#224; cette arnaque qui peut vous viser et c&#8217;est la faute de Free</title>
      <link>https://www.frandroid.com/culture-tech/securite-applications/2951665_reprogrammation-de-votre-colis-attention-a-cette-arnaque-qui-peut-vous-viser-et-cest-la-faute-de-free</link>
      <pubDate>Thu, 22 Jan 2026 10:00:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/securite-applications/2951665_reprogrammation-de-votre-colis-attention-a-cette-arnaque-qui-peut-vous-viser-et-cest-la-faute-de-free</guid>
      <description>
Une campagne d'hame&#231;onnage se faisant passer pour Mondial Relay cible les victimes du piratage de Free de 2024.
</description>
    </item>
    <item>
      <title>The DJI Mini 5 Pro Fly More Combo is down to its record-low price at Amazon &#8212;  save $500</title>
      <link>https://mashable.com/article/jan-22-dji-mini-5-pro-combo-deal</link>
      <pubDate>Thu, 22 Jan 2026 10:00:05 +0000</pubDate>
      <guid isPermaLink="false">00FSq1FSdxaqqU4OWC31zWd</guid>
      <description>The DJI Mini 5 Pro Fly More Combo is on sale at Amazon for $1,099, down from the normal price of $1,599. That's a 31% discount.</description>
    </item>
    <item>
      <title>How Peacock&#8217;s Gold Zone is energizing Olympics coverage</title>
      <link>https://www.fastcompany.com/91448490/how-peacocks-gold-zone-is-energizing-olympics-coverage</link>
      <pubDate>2026-01-22T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448490/how-peacocks-gold-zone-is-energizing-olympics-coverage</guid>
      <description>During the summer Games in Paris, cohost Scott Hanson got so carried away by one race that he injured himself on camera. The Gold Zone control room, says producer Amy Rosenfeld, is &#8220;not for the faint of heart.&#8221;
</description>
    </item>
    <item>
      <title>This ingenious &#8216;weightless camera&#8217; is changing live sports forever</title>
      <link>https://www.fastcompany.com/91473380/ingenious-weightless-camera-changing-sports-broadcasting-live-tv-forever-muybridge-norway-hakon-espeland-anders-tomren</link>
      <pubDate>2026-01-22T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91473380/ingenious-weightless-camera-changing-sports-broadcasting-live-tv-forever-muybridge-norway-hakon-espeland-anders-tomren</guid>
      <description>Norwegian startup Muybridge has rocked pro tennis. Next up: soccer, hockey, F1. . . and even emergency medicine.&#160;
Several times during the men&#8217;s final of the Madrid Open tennis tournament between Casper Ruud and Jack Draper last spring, TV viewers were treated to a remarkable camera perspective. They watched the match from just behind the baseline, effortlessly following the player&#8217;s movement step for step and glimpsing his perfect angle on the ball with every shot.&#160;...</description>
    </item>
    <item>
      <title>Inside the founder factory known as Palantir, America&#8217;s most polarizing company</title>
      <link>https://www.fastcompany.com/91476499/inside-the-founder-factory-known-as-palantir-americas-most-polarizing-company</link>
      <pubDate>2026-01-22T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91476499/inside-the-founder-factory-known-as-palantir-americas-most-polarizing-company</guid>
      <description>More than two-dozen Palantir employees turned startup founders reveal the true nature of its power. Plus: The largest public dataset of Palantir alums who&#8217;ve started companies.
Chances are, you have an opinion about Palantir.</description>
    </item>
    <item>
      <title>Why your electric bill is so high&#8212;and what could bring down rates</title>
      <link>https://www.fastcompany.com/91478545/why-your-electric-bill-is-so-high-and-what-could-bring-down-rates</link>
      <pubDate>2026-01-22T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91478545/why-your-electric-bill-is-so-high-and-what-could-bring-down-rates</guid>
      <description>Data centers are just one piece of the very large, systemic problems with the U.S. grid.
Electric bills are climbing almost everywhere&#8212;and in some states, the increases have been staggering. If you live in the Bay Area, your average utility bill from PG&amp;E went up nearly 70% over the last five years. Between 2024 and 2025, alone, bills grew by double digits everywhere from Utah to Massachusetts to Tennessee....</description>
    </item>
    <item>
      <title>Child experts: AI toys too risky for young kids</title>
      <link>https://mashable.com/article/ai-toys-unsafe-for-kids</link>
      <pubDate>Thu, 22 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">04WwpY3ew9EHxCZBl2hD3i9</guid>
      <description>Common Sense Media experts share major warning about AI toys.</description>
    </item>
    <item>
      <title>10 movies out of Sundance 2026 you should know about right now</title>
      <link>https://mashable.com/article/sundance-2026-preview</link>
      <pubDate>Thu, 22 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01Zk5ZtZ8v4m7OFFJ4hXqXy</guid>
      <description>Charli XCX, Ta-Nehisi Coates, Alexander Skarsg&#229;rd, and Jenna Ortega have new movies coming your way. The Sundance 2026 films you need to know about.</description>
    </item>
    <item>
      <title>End PDF busywork with a lifetime license to this game-changing $30 tool</title>
      <link>https://mashable.com/article/jan-22-pdf-converter-pro-lifetime-license</link>
      <pubDate>Thu, 22 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01N88sQpMZQ847PLEaHi1en</guid>
      <description>Work with PDFs joyfully thanks to this lifetime license to PDF Converter and Editor, on sale now for just $29.99 (reg. $99.99).</description>
    </item>
    <item>
      <title>Cosmic Princess Kaguya! review: A dazzling ode to streaming and the creator economy</title>
      <link>https://mashable.com/article/cosmic-princess-kaguya-review-netflix</link>
      <pubDate>Thu, 22 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01BRFRiwTnRWfH3PXBshn6x</guid>
      <description>Shingo Yamashita's 'Cosmic Princess Kaguya!' presents a virtual world so dazzling and well-run you'll wish it actually existed. Review.</description>
    </item>
    <item>
      <title>How to unblock Pornhub for free in Missouri</title>
      <link>https://mashable.com/article/unblock-pornhub-for-free-missouri</link>
      <pubDate>Thu, 22 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">03Hu5rYNWv0U975A8yDg5Vf</guid>
      <description>How to unblock porn for free in Missouri. Unblock and watch Pornhub for free from anywhere in the world.</description>
    </item>
    <item>
      <title>How to watch Lakers vs. Clippers online for free</title>
      <link>https://mashable.com/article/lakers-clippers-nba-2026-live-stream-for-free</link>
      <pubDate>Thu, 22 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">045fz4OfRg1W7yZj9q6fT29</guid>
      <description>How to watch NBA for free. Watch Los Angeles Lakers vs. LA Clippers in the NBA for free from anywhere in the world.</description>
    </item>
    <item>
      <title>How to watch Warriors vs. Mavericks online for free</title>
      <link>https://mashable.com/article/warriors-mavericks-nba-2026-live-stream-for-free</link>
      <pubDate>Thu, 22 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">076RIZ2Tr7hythyYejWvXgV</guid>
      <description>How to watch NBA for free. Watch Golden State Warriors vs. Dallas Mavericks in the NBA for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Whats new to streaming this week? (Jan. 23, 2026)</title>
      <link>https://mashable.com/article/new-to-streaming-january-23-2026</link>
      <pubDate>Thu, 22 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00p1VXKc0WmtLJNaDKN72pd</guid>
      <description>What&#8217;s new to streaming for the week of Jan. 9, 2026, on Netflix, Hulu, Peacock, and more? We've got you covered.</description>
    </item>
    <item>
      <title>How to turn a tablet into an e-reader: The best settings and accessories</title>
      <link>https://mashable.com/article/how-to-turn-tablet-into-e-reader</link>
      <pubDate>Thu, 22 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00bH3CPr3nB3zvAksdfAEFK</guid>
      <description>Already have a tablet? Here's how to turn your tablet into an e-reader with the help of a few setting changes, a screen protector, Libby, and the Kindle app.</description>
    </item>
    <item>
      <title>Pranksters and pickup artists are using Meta Ray-Ban glasses to harass strangers for content</title>
      <link>https://mashable.com/article/meta-ray-ban-glasses-are-making-it-easier-to-film-strangers-for-content</link>
      <pubDate>Thu, 22 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">032az2s2HCM8hxOmyqRjQZN</guid>
      <description>Meta Ray-Ban glasses are making it easier to film strangers without consent, and some pranksters and pickup artists are harassing people in public.</description>
    </item>
    <item>
      <title>A new Stuff Your Kindle Day is live for 24 hours &#8212; download free cozy mystery books</title>
      <link>https://mashable.com/article/stuff-your-kindle-day-free-cozy-mystery-book-blast</link>
      <pubDate>Thu, 22 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">07daWEBOcQrOuvSgLX3FK4p</guid>
      <description>The latest Stuff Your Kindle Day is live. Download free cozy mystery books for your Kindle in the Cozy Mystery Book Blast.</description>
    </item>
    <item>
      <title>The first-ever Lego Pok&#233;mon sets have arrived &#8212; where to pre-order Pikachu, Eevee, and more</title>
      <link>https://mashable.com/article/lego-pokemon-pre-orders</link>
      <pubDate>Thu, 22 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">026V6oIMpOPlJvPb5C3Ds2Q</guid>
      <description>The first-ever Lego Pok&#233;mon sets are officially available for pre-order at the Lego website starting at $59.99.</description>
    </item>
    <item>
      <title>The Lego Pok&#233;mon Kanto Region Badge Collection is free when you pre-order the new Venusaur, Charizard, and Blastoise set</title>
      <link>https://mashable.com/article/free-lego-pokemon-kanto-region-badge-collection-deal</link>
      <pubDate>Thu, 22 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">075ndL5jK2twGLTY6lEh361</guid>
      <description>The Lego Pok&#233;mon Kanto Region Badge Collection is a free gift with purchase of the new Venusaur, Charizard, and Blastoise set.</description>
    </item>
    <item>
      <title>How to watch the 2026 Winter Olympics online for free</title>
      <link>https://mashable.com/article/winter-olympics-2026-live-stream-for-free</link>
      <pubDate>Thu, 22 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">03vQSsvHkcKVuzcuskR6s5p</guid>
      <description>How to watch Winter Olympics for free. Live stream the 2026 Winter Olympics for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Windows 11&#160;: Paint pourra bient&#244;t g&#233;n&#233;rer des coloriages pour vos enfants</title>
      <link>https://www.01net.com/actualites/windows-11-paint-pourra-bientot-generer-des-coloriages-pour-vos-enfants.html</link>
      <pubDate>Thu, 22 Jan 2026 09:48:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321834</guid>
      <description>Microsoft a d&#233;ploy&#233; plusieurs nouveaut&#233;s pour le Bloc-Notes et Paint aupr&#232;s des Insiders. Le Bloc-Notes va afficher un nouvel &#233;cran d&#8217;accueil tandis que Paint va pouvoir g&#233;n&#233;rer des coloriages gr&#226;ce &#224; l&#8217;IA.</description>
    </item>
    <item>
      <title>The best MacBooks to buy in 2026</title>
      <link>https://mashable.com/roundup/best-macbooks-2026</link>
      <pubDate>Thu, 22 Jan 2026 09:45:40 +0000</pubDate>
      <guid isPermaLink="false">028IdJmCP0Payh8KTTILFDq</guid>
      <description>What's the best MacBook to buy in 2026? Mashable's senior shopping reporter rounds up five options for school, photo editing, and more.</description>
    </item>
    <item>
      <title>How to watch Skyscraper Live: See Alex Honnold climb one of the worlds tallest buildings in real time</title>
      <link>https://mashable.com/article/how-to-watch-skyscraper-live</link>
      <pubDate>Thu, 22 Jan 2026 09:45:10 +0000</pubDate>
      <guid isPermaLink="false">00v3Bsr4aTxQEHlgAEO8h6H</guid>
      <description>Alex Honnold will climb Taipei 101 skyscraper live on Netflix in 'Skyscraper Live.' Here are the streaming details.</description>
    </item>
    <item>
      <title>The best Chromebooks for 2026</title>
      <link>https://mashable.com/roundup/best-chromebooks-2026</link>
      <pubDate>Thu, 22 Jan 2026 09:39:02 +0000</pubDate>
      <guid isPermaLink="false">076plrlJYfFKcnAMpzkT16F</guid>
      <description>We've vetted the best Chromebooks for 2026, comparing the Lenovo Flex 5i Chromebook Plus, Acer Chromebook Plus Spin 514, and more.</description>
    </item>
    <item>
      <title>NYT Mini crossword answers, hints for January 22, 2026</title>
      <link>https://mashable.com/article/nyt-mini-crossword-answers-hints-january-22-2026</link>
      <pubDate>Thu, 22 Jan 2026 09:37:27 +0000</pubDate>
      <guid isPermaLink="false">02Ghkx6zGMFnufalIbl5nhu</guid>
      <description>Answers to each clue for the January 22, 2026 edition of NYT's The Mini crossword puzzle.</description>
    </item>
    <item>
      <title>Pirater la derni&#232;re nouveaut&#233; de ChatGPT est un vrai jeu d&#8217;enfant</title>
      <link>https://www.01net.com/actualites/pirater-derniere-nouveaute-chatgpt-vrai-jeu-enfant.html</link>
      <pubDate>Thu, 22 Jan 2026 09:32:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321760</guid>
      <description>&#171; Traduire avec ChatGPT &#187;, l'alternative &#224; Google Traduction d'OpenAI, vient de se faire pirater par des chercheurs. Ils ont r&#233;ussi &#224; prouver que l'IA oublie facilement ses restrictions dans le cadre d'une injection par injection de requ&#234;te. ChatGPT ne voit alors aucun probl&#232;me &#224; fournir la recette d'un cocktail Molotov.</description>
    </item>
    <item>
      <title>Why your solo business needs an operational backbone</title>
      <link>https://www.fastcompany.com/91474956/why-your-solo-business-needs-an-operational-backbone</link>
      <pubDate>2026-01-22T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91474956/why-your-solo-business-needs-an-operational-backbone</guid>
      <description>3 systems to keep your business running smoothly.
It&#8217;s Friday afternoon, and a potential client just emailed, asking about your services. You scramble to find your pricing. (Where did you save that document?) You dig through old emails for a proposal you sent six months ago that you could adapt. You piece something together and curse your past self for not being more organized.&#160;...</description>
    </item>
  </channel>
</rss>
