<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 21 Nov 2025 09:39:28 GMT</lastBuildDate>
    <item>
      <title>Black Friday Week : cam&#233;ras, airfryers et ampoules connect&#233;es sont brad&#233;s, voici les meilleurs deals</title>
      <link>https://www.frandroid.com/bons-plans/2858095_black-friday-airfryers-cameras-ampoules-meilleures-promos</link>
      <pubDate>Fri, 21 Nov 2025 09:38:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2858095_black-friday-airfryers-cameras-ampoules-meilleures-promos</guid>
      <description>
Air fryer, ampoules connect&#233;es ou cam&#233;ras de surveillance&#8230; Les incontournables de la maison intelligente profitent d&#233;j&#224; de r&#233;ductions avant le Black Friday. C&#8217;est l&#8217;occasion parfaite de d&#233;couvrir la domotique ou d&#8217;enrichir votre &#233;quipement gr&#226;ce &#224; notre s&#233;lection des meilleures offres du moment.
</description>
    </item>
    <item>
      <title>Voici l&#8217;offre d&#8217;&#233;lectricit&#233; la moins ch&#232;re du moment : -25 % sur le tarif r&#233;glement&#233; d&#8217;EDF pendant 2 ans</title>
      <link>https://www.frandroid.com/survoltes/energie/2879699_voici-loffre-delectricite-la-moins-chere-du-moment-25-sur-le-tarif-reglemente-dedf-pendant-2-ans</link>
      <pubDate>Fri, 21 Nov 2025 09:24:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/2879699_voici-loffre-delectricite-la-moins-chere-du-moment-25-sur-le-tarif-reglemente-dedf-pendant-2-ans</guid>
      <description>
L&#8217;achat group&#233; d&#8217;&#233;nergie permet de b&#233;n&#233;ficier des prix les plus avantageux du march&#233;. Gr&#226;ce &#224; Ecodigo, les participants ont le droit des r&#233;ductions allant jusqu&#8217;&#224; 25 % sur leur facture d'&#233;lectricit&#233;. Clairement le bon plan du moment.
</description>
    </item>
    <item>
      <title>The best Shark vacuum just crashed to a record-low price ahead of Black Friday</title>
      <link>https://www.techradar.com/home/vacuums/the-best-shark-vacuum-just-crashed-to-a-record-low-price-ahead-of-black-friday</link>
      <pubDate>Fri, 21 Nov 2025 09:24:03 +0000</pubDate>
      <guid isPermaLink="false">JS3StZ3AqdKPMZ2juntbHh</guid>
      <description>This stick vacuum is seriously powerful &#8211; it delivers the most efficient cleaning of any cordless vacuum I've tested.</description>
    </item>
    <item>
      <title>Garmin rend vos entra&#238;nements encore plus beaux gr&#226;ce &#224; cette nouveaut&#233;, mais il faudra passer &#224; la caisse pour en profiter</title>
      <link>https://www.frandroid.com/marques/garmin/2879689_garmin-rend-vos-entrainements-encore-plus-beaux-grace-a-cette-nouveaute-mais-il-faudra-passer-a-la-caisse-pour-en-profiter</link>
      <pubDate>Fri, 21 Nov 2025 09:23:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/garmin/2879689_garmin-rend-vos-entrainements-encore-plus-beaux-grace-a-cette-nouveaute-mais-il-faudra-passer-a-la-caisse-pour-en-profiter</guid>
      <description>
En plus des fonctions ajout&#233;es par la mise &#224; jour &#224; toutes ses montres connect&#233;es, Garmin a ajout&#233; cette semaine une nouveaut&#233; &#224; son abonnement Connect+ qui permet d&#233;sormais de visualiser ses entra&#238;nements dans des cartes 3D. 
</description>
    </item>
    <item>
      <title>Le Bitcoin continue de couler et passe sous les 84&#160;000 dollars</title>
      <link>https://www.01net.com/actualites/bitcoin-coule-sous-90-000-dollars-speculateurs-perdent-fortune.html</link>
      <pubDate>Fri, 21 Nov 2025 09:20:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308838</guid>
      <description>Le Bitcoin continue sa descente. Apr&#232;s avoir d&#233;pass&#233; les 125 000 dollars, la cryptomonnaie num&#233;ro un du march&#233; s'enfonce d&#233;sormais sous la barre des 84 000 dollars. Au cours de cette nouvelle d&#233;gringolade, les sp&#233;culateurs ont perdu pr&#232;s d'un milliard de dollars en une seule journ&#233;e.</description>
    </item>
    <item>
      <title>Un nouveau g&#233;ant de l&#8217;IPTV pirate ferme ses portes&#160;: 26 millions d&#8217;utilisateurs priv&#233;s de streaming ill&#233;gal</title>
      <link>https://www.01net.com/actualites/nouveau-geant-iptv-ferme-portes-26-millions-utilisateurs-prives-streaming-illegal1309889.html</link>
      <pubDate>Fri, 21 Nov 2025 09:16:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309889</guid>
      <description>Photocall vient de dispara&#238;tre brutalement. Forte de 26&#8239;millions d&#8217;utilisateurs annuels, la plateforme IPTV ferme ses portes apr&#232;s une enqu&#234;te conjointes de l&#8217;ACE et de DAZN. Elle offrait l'acc&#232;s &#224; plus de 1&#8239;100 cha&#238;nes payantes en streaming ill&#233;gal.</description>
    </item>
    <item>
      <title>13 000 &#8364; en Chine : Leapmotor d&#233;gaine un SUV &#233;lectrique compact qui bouscule tout et qui arrivera en Europe avec Stellantis</title>
      <link>https://www.frandroid.com/marques/leapmotor/2879695_13-000-e-en-chine-leapmotor-degaine-un-suv-electrique-compact-qui-bouscule-tout-et-qui-arrivera-en-europe-avec-stellantis</link>
      <pubDate>Fri, 21 Nov 2025 09:08:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/leapmotor/2879695_13-000-e-en-chine-leapmotor-degaine-un-suv-electrique-compact-qui-bouscule-tout-et-qui-arrivera-en-europe-avec-stellantis</guid>
      <description>
Leapmotor vient de lancer la commercialisation de son nouveau SUV &#233;lectrique A10 en Chine, et &#231;a risque de faire mal &#224; la concurrence. Le constructeur chinois, alli&#233; &#224; Stellantis, ne rigole pas avec sa strat&#233;gie tarifaire.
</description>
    </item>
    <item>
      <title>J&#8217;ai failli quitter TotalEnergies pour &#233;conomiser 25 % : leur r&#233;action a &#233;t&#233; imm&#233;diate</title>
      <link>https://www.frandroid.com/survoltes/energie/2879719_jai-failli-quitter-totalenergies-pour-economiser-25-leur-reaction-a-ete-immediate</link>
      <pubDate>Fri, 21 Nov 2025 09:06:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/2879719_jai-failli-quitter-totalenergies-pour-economiser-25-leur-reaction-a-ete-immediate</guid>
      <description>
Vous aimez jeter de l'argent par les fen&#234;tres ? Moi non plus. Alors que les prix de gros de l'&#233;lectricit&#233; s'effondrent, rester sur votre vieux contrat est une erreur financi&#232;re. J'ai test&#233; pour vous : un clic vers la concurrence, un appel du service client, et hop, -20 % sur la facture. C'est presque trop facile.
</description>
    </item>
    <item>
      <title>L&#8217;objet venu d&#8217;ailleurs se montre sous un nouvel angle : la Nasa r&#233;v&#232;le ce que cachent les images</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-objet-venu-ailleurs-montre-sous-nouvel-angle-nasa-revele-ce-cachent-images-127706/#xtor%3DRSS-8</link>
      <pubDate>Fri, 21 Nov 2025 10:05:49 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-objet-venu-ailleurs-montre-sous-nouvel-angle-nasa-revele-ce-cachent-images-127706/#xtor%3DRSS-8</guid>
      <description>Apr&#232;s plusieurs semaines de non-activit&#233; m&#233;diatique, la Nasa avait sans doute d&#233;cid&#233; de rappeler qu'elle s'occupait de plusieurs missions dans le Syst&#232;me solaire, dont l'une des justifications &#233;tait qu'elles pouvaient servir &#224; combiner des observations pour percer de nouveaux secrets du cosmos &#8211;...</description>
    </item>
    <item>
      <title>Forget Amazon Haul - I'm buying these 10 office storage gadgets from Temu for Black Friday, at a total of just &#163;17</title>
      <link>https://www.techradar.com/pro/forget-amazon-haul-im-buying-these-10-office-storage-gadgets-from-temu-for-black-friday-at-a-total-of-just-gbp17</link>
      <pubDate>Fri, 21 Nov 2025 09:02:00 +0000</pubDate>
      <guid isPermaLink="false">HLELdeBUsc3pYfuDtKkyFb</guid>
      <description>You can equip your office with all manner of useful storage equipment for just &#163;17, thanks to Temu.</description>
    </item>
    <item>
      <title>To change our safety culture, we need storytellers</title>
      <link>https://www.fastcompany.com/91443434/change-safety-culture-storytellers</link>
      <pubDate>2025-11-21T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91443434/change-safety-culture-storytellers</guid>
      <description>Powerful personal narratives are key to reducing traffic deaths.
Earlier this week, communities around the world observed World Day of Remembrance for Road Traffic Victims. It&#8217;s a day to honor those we&#8217;ve lost and recommit ourselves to preventing future tragedies. As someone who&#8217;s worked in the transportation industry for more than 25 years, I come at this topic as an insider.&#160;...</description>
    </item>
    <item>
      <title>The billion-dollar AI startup rejecting 996 hustle culture</title>
      <link>https://www.fastcompany.com/91445544/the-1-25-billion-ai-startup-that-rejects-hustle-culture</link>
      <pubDate>2025-11-21T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91445544/the-1-25-billion-ai-startup-that-rejects-hustle-culture</guid>
      <description>Karri Saarinen, CEO of Linear, which makes software to streamline product development and has a $1.25 billion valuation, tells Fast Company why he&#8217;s bucking the trend of AI companies&#8217; &#8216;hardcore,&#8217; always-on work styles. 
As startups race to keep up with advances in artificial intelligence, some of them seem to be borrowing from China&#8217;s exacting work culture&#8212;which normalized a 72-hour workweek, or a &#8220;996&#8221; schedule of working six days a week from 9 a.m. to 9 p.m.&#160;...</description>
    </item>
    <item>
      <title>The 10 best Windows laptops of 2025</title>
      <link>https://mashable.com/roundup/best-windows-laptop-2025</link>
      <pubDate>Fri, 21 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">02SQxIMVbT4JY9KSC8WveA7</guid>
      <description>The Microsoft Surface Laptop 7 is the best Windows laptop we've tested. See how it compares to other Windows 11 laptops.</description>
    </item>
    <item>
      <title>Comment Google veut faciliter l&#8217;identification des fausses images</title>
      <link>https://www.frandroid.com/marques/google/2879549_comment-google-veut-faciliter-lidentification-des-fausses-images</link>
      <pubDate>Fri, 21 Nov 2025 08:54:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2879549_comment-google-veut-faciliter-lidentification-des-fausses-images</guid>
      <description>
La firme de Mountain View propose &#224; ses utilisateurs d'utiliser Google Gemini pour identifier les images qui auraient &#233;t&#233; cr&#233;&#233;es ou modifi&#233;es &#224; l'aide de son IA.   
</description>
    </item>
    <item>
      <title>Ce PC portable Lenovo est la meilleure affaire du Black Friday, point final</title>
      <link>https://www.frandroid.com/bons-plans/bons-plans-pc-portable/2879669_ce-pc-portable-lenovo-est-la-meilleure-affaire-du-black-friday-point-final</link>
      <pubDate>Fri, 21 Nov 2025 08:50:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/bons-plans-pc-portable/2879669_ce-pc-portable-lenovo-est-la-meilleure-affaire-du-black-friday-point-final</guid>
      <description>
On voit passer des centaines d'offres depuis le d&#233;but de ce Black Friday 2025, mais celle-ci sort du lot. Ce PC portable Lenovo perd quasiment la moiti&#233; de son prix et sa fiche technique n'a aucun sens &#224; ce tarif.
</description>
    </item>
    <item>
      <title>Windows 11&#160;: Microsoft ne comprend toujours pas pourquoi personne ne veut de son IA</title>
      <link>https://www.01net.com/actualites/windows-11-microsoft-ne-comprend-toujours-pas-pourquoi-personne-ne-veut-de-son-ia.html</link>
      <pubDate>Fri, 21 Nov 2025 08:46:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309894</guid>
      <description>L&#8217;obsession de Microsoft pour introduire de l&#8217;IA partout dans Windows 11 ne pla&#238;t pas aux utilisateurs. L&#8217;entreprise de Redmond, qui compte transformer son syst&#232;me d&#8217;exploitation en OS agentique ne comprend pas pourquoi les gens n&#8217;en veulent pas.</description>
    </item>
    <item>
      <title>C&#8217;est l&#8217;offre &#233;nergie de l&#8217;ann&#233;e : pourquoi il faut foncer sur les promos Black Friday de Bluetti [Sponso]</title>
      <link>https://www.frandroid.com/survoltes/2877633_cest-loffre-energie-de-lannee-pourquoi-il-faut-foncer-sur-les-promos-black-friday-de-bluetti</link>
      <pubDate>Fri, 21 Nov 2025 08:34:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2877633_cest-loffre-energie-de-lannee-pourquoi-il-faut-foncer-sur-les-promos-black-friday-de-bluetti</guid>
      <description>
Pendant le Black Friday, Bluetti n&#8217;est pas l&#224; pour plaisanter. Promotions agressives, codes promo exclusifs et cadeaux offerts aux 450 premiers acheteurs, autant vous dire que vous n&#8217;allez jamais payer aussi peu pour de l&#8217;&#233;nergie suppl&#233;mentaire.&#160;
</description>
    </item>
    <item>
      <title>La Black Friday Week est lanc&#233;e chez Amazon, Fnac, Darty&#8230; voici les meilleures offres de ce vendredi en DIRECT</title>
      <link>https://www.frandroid.com/bons-plans/2876855_la-black-friday-week-commence-officiellement-sur-amazon-voici-les-meilleures-offres-en-direct</link>
      <pubDate>Fri, 21 Nov 2025 08:26:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2876855_la-black-friday-week-commence-officiellement-sur-amazon-voici-les-meilleures-offres-en-direct</guid>
      <description>
C'est le lancement officiel de la Black Friday Week sur Amazon, Fnac, Darty, Boulanger ou encore Cdiscount. C'est donc le bon moment pour faire une excellente affaire sur votre prochain smartphone, tablette, PC portable, TV, etc. Vous retrouverez les meilleures offres Tech en temps r&#233;el dans cet article. 
</description>
    </item>
    <item>
      <title>On a cr&#233;&#233; l&#8217;outil qui tue les fausses promos du Black Friday</title>
      <link>https://www.frandroid.com/humanoid/2877567_on-a-cree-loutil-qui-tue-les-fausses-promos-du-black-friday</link>
      <pubDate>Fri, 21 Nov 2025 08:23:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/2877567_on-a-cree-loutil-qui-tue-les-fausses-promos-du-black-friday</guid>
      <description>
Le Black Friday arrive et avec lui, son lot de fausses promotions et de produits douteux. On a d&#233;cid&#233; d'agir. Voici Frandroid Check, notre extension navigateur maison. L'extension s'affiche directement sur les sites marchands pour vous donner le test du produit et son vrai prix. C'est gratuit, et &#231;a change tout.
</description>
    </item>
    <item>
      <title>Comet, le navigateur IA de Perplexity, arrive sur votre smartphone</title>
      <link>https://www.01net.com/actualites/comet-navigateur-ia-perplexity-arrive-smartphone.html</link>
      <pubDate>Fri, 21 Nov 2025 08:11:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309875</guid>
      <description>Comet, le navigateur IA sign&#233; Perplexity, d&#233;barque sur Android. R&#233;sum&#233;s instantan&#233;s, gestion intelligente des onglets, shopping assist&#233;&#8230; Le navigateur ajoute &#224; votre smartphone Android une bonne dose d'intelligence artificielle. De son c&#244;t&#233;, l&#8217;application iOS arrive bient&#244;t.</description>
    </item>
    <item>
      <title>Voici le classement officiel des meilleurs op&#233;rateurs mobiles pour passer vos appels WhatsApp</title>
      <link>https://www.frandroid.com/services/fai/2879583_quel-est-le-meilleur-operateur-mobile-pour-passer-vos-appels-whatsapp</link>
      <pubDate>Fri, 21 Nov 2025 08:11:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/fai/2879583_quel-est-le-meilleur-operateur-mobile-pour-passer-vos-appels-whatsapp</guid>
      <description>
L&#8217;autorit&#233; de r&#233;gulations des t&#233;l&#233;coms fran&#231;aises vient de publier ses chiffres sur la qualit&#233; des services mobiles en m&#233;tropole. Ils int&#232;grent pour la premi&#232;re des mesures sur la qualit&#233; des appels &#171;&#8201;OTT&#8201;&#187;.
</description>
    </item>
    <item>
      <title>Fin du passe Navigo physique : voici le calendrier complet du passage sur smartphone</title>
      <link>https://www.frandroid.com/android/2879595_fin-du-passe-navigo-physique-voici-le-calendrier-complet-du-passage-sur-smartphone</link>
      <pubDate>Fri, 21 Nov 2025 08:11:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/2879595_fin-du-passe-navigo-physique-voici-le-calendrier-complet-du-passage-sur-smartphone</guid>
      <description>
Il va encore falloir &#234;tre patient. Si vous attendiez de jeter votre passe Navigo physique pour basculer votre forfait Annuel sur votre iPhone, ce n'est pas pour tout de suite. &#206;le-de-France Mobilit&#233;s vient de confirmer la feuille de route &#224; Numerama. Spoiler : rendez-vous au printemps 2026.
</description>
    </item>
    <item>
      <title>Plus punchy et plus pr&#233;cis : le premier moteur central de Malhe est d&#233;j&#224; am&#233;lior&#233; quelques mois apr&#232;s sa sortie</title>
      <link>https://www.frandroid.com/marques/mahle/2879577_plus-punchy-et-plus-precis-le-premier-moteur-central-de-malhe-est-deja-ameliore-quelques-mois-apres-sa-sortie</link>
      <pubDate>Fri, 21 Nov 2025 08:09:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/mahle/2879577_plus-punchy-et-plus-precis-le-premier-moteur-central-de-malhe-est-deja-ameliore-quelques-mois-apres-sa-sortie</guid>
      <description>
Le motoriste Mahle d&#233;ploie une mise &#224; jour pour son moteur central M40, quelques mois seulement apr&#232;s son lancement. Cette &#233;volution revoit &#224; la fois le niveau d&#8217;assistance et optimise la gestion du bloc afin d&#8217;am&#233;liorer sa pr&#233;cision.
</description>
    </item>
    <item>
      <title>Une com&#232;te r&#233;cemment d&#233;couverte s&#8217;est bris&#233;e sous nos yeux : les astronomes d&#233;voilent des images saisissantes de sa fragmentation</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-comete-recemment-decouverte-brisee-sous-nos-yeux-astronomes-devoilent-images-saisissantes-fragmentation-127736/#xtor%3DRSS-8</link>
      <pubDate>Fri, 21 Nov 2025 09:07:00 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-comete-recemment-decouverte-brisee-sous-nos-yeux-astronomes-devoilent-images-saisissantes-fragmentation-127736/#xtor%3DRSS-8</guid>
      <description>Alors qu'elle &#233;tait observ&#233;e par des t&#233;lescopes, la com&#232;te C/2025 K1 s'est bris&#233;e en plusieurs morceaux, donnant lieu &#224; des images incroyables.</description>
    </item>
    <item>
      <title>Study Mode in ChatGPT doesn&#8217;t just give you the answer &#8211; it teaches you how to solve the problem yourself</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/study-mode-in-chatgpt-doesnt-just-give-you-the-answer-it-teaches-you-how-to-solve-the-problem-yourself</link>
      <pubDate>Fri, 21 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">4SYzko4QEEadMLdPUbGa9c</guid>
      <description>Using Study Mode in ChatGPT can be a great way to learn a subject as if you were being taught by a personal tutor.</description>
    </item>
    <item>
      <title>Maxton Hall season 2 episode 5&#8217;s big breakdown can only be bad news for one character &#8211; and it&#8217;s not James</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/maxton-hall-season-2-episode-5s-big-breakdown-can-only-be-bad-news-for-one-character-and-its-not-james</link>
      <pubDate>Fri, 21 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">RD7jeAq2aqZxVKBeKYgQy3</guid>
      <description>Maxton Hall season 2 episode 5 throws another huge spanner in the works for James and Ruby's relationship, and Mortimer is about to destroy one of them.</description>
    </item>
    <item>
      <title>3 signs that your future boss might be a bad boss</title>
      <link>https://www.fastcompany.com/91445460/3-signs-in-an-interview-that-your-future-boss-might-be-a-bad-boss</link>
      <pubDate>2025-11-21T08:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91445460/3-signs-in-an-interview-that-your-future-boss-might-be-a-bad-boss</guid>
      <description>Keeping an eye open for these red flags during the interview process could save you trouble later.
&#8220;Your new boss didn&#8217;t even offer you a glass of water?&#8221; my mother had questioned me in disbelief. &#8220;After how many interviews? You should not take that job. I am telling you not to take that job.&#8221;</description>
    </item>
    <item>
      <title>Samsung Galaxy Book 5 360 : ce laptop 2-en-1 not&#233; 9/10 perd 900 &#8364; pendant la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2878525_samsung-galaxy-book-5-360-ce-laptop-2-en-1-note-9-10-perd-900-e-pendant-la-black-friday-week</link>
      <pubDate>Fri, 21 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2878525_samsung-galaxy-book-5-360-ce-laptop-2-en-1-note-9-10-perd-900-e-pendant-la-black-friday-week</guid>
      <description>
Le Samsung Galaxy Book 5 360 n'est pas avare en atouts : autonomie bluffante, dalle AMOLED sublime, format polyvalent pratique... Bref, il nous a clairement convaincus. Pendant le Black Friday, vous le trouverez d'ailleurs &#224; 999,99 euros au lieu de 1 799,99 euros chez Boulanger.
</description>
    </item>
    <item>
      <title>Grok generates sycophantic praise for Elon Musk after new update</title>
      <link>https://mashable.com/article/elon-musk-grok-praise-athletic-intelligent-ai-chatbot</link>
      <pubDate>Fri, 21 Nov 2025 07:59:15 +0000</pubDate>
      <guid isPermaLink="false">07eYenIKPDXf0VFpBlu9ts2</guid>
      <description>xAI chatbot Grok heaped worshipful praise on Elon Musk after an update this week, calling him the pinnacle of human athleticism and intelligence.</description>
    </item>
    <item>
      <title>Black Friday Week : cette r&#233;cente barre de son JBL 11.1.4 Dolby Atmos/DTS:X perd 500 &#8364; d&#8217;un coup</title>
      <link>https://www.frandroid.com/bons-plans/2878795_black-friday-week-cette-recente-barre-de-son-jbl-11-1-4-dolby-atmos-dtsx-perd-500-e-dun-coup</link>
      <pubDate>Fri, 21 Nov 2025 07:40:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2878795_black-friday-week-cette-recente-barre-de-son-jbl-11-1-4-dolby-atmos-dtsx-perd-500-e-dun-coup</guid>
      <description>
Fnac et Darty frappent fort avec cette offre sur la JBL Bar 1300MK2 qui passe de 1 499 euros &#224; 999 euros alors qu'elle est sortie il y a quelques semaines.
</description>
    </item>
  </channel>
</rss>
