<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 13 Jan 2026 09:33:18 GMT</lastBuildDate>
    <item>
      <title>Elon Musk et Mars&#160;: 2026 est arriv&#233;, le Starship est-il pr&#234;t pour l&#8217;impossible&#160;?</title>
      <link>https://www.01net.com/actualites/elon-musk-et-mars-2026-est-arrive-le-starship-est-il-pret-pour-limpossible.html</link>
      <pubDate>Tue, 13 Jan 2026 09:32:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319544</guid>
      <description>L'ann&#233;e fatidique est l&#224;. Elon Musk l'avait promis : SpaceX visera Mars &#171; fin 2026 &#187;. Alors que le compte &#224; rebours est lanc&#233;, entre alignement plan&#233;taire critique et d&#233;fis techniques, le Starship peut-il vraiment d&#233;coller cette ann&#233;e ?</description>
    </item>
    <item>
      <title>Plus de 1000 km d&#8217;autonomie : Volkswagen pr&#233;sente une &#233;tonnante voiture &#233;lectrique avec moteur essence</title>
      <link>https://www.frandroid.com/marques/volkswagen/2940207_plus-de-1000-km-dautonomie-volkswagen-presente-une-etonnante-voiture-electrique-avec-moteur-essence</link>
      <pubDate>Tue, 13 Jan 2026 09:30:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2940207_plus-de-1000-km-dautonomie-volkswagen-presente-une-etonnante-voiture-electrique-avec-moteur-essence</guid>
      <description>
Quelques jours apr&#232;s avoir d&#233;voil&#233; ses informations techniques, le nouveau Volkswagen ID. Era 9X se montre en image. L&#8217;occasion de d&#233;couvrir le style de cette voiture &#233;lectrique &#224; prolongateur, de quoi promettre une autonomie d&#233;mentielle.
</description>
    </item>
    <item>
      <title>&#171; Nous sommes devenus trop bureaucratiques &#187; : l&#8217;autocritique rare du patron de Canyon, qui vise &#171; 1 milliard &#187; de chiffre d&#8217;affaires</title>
      <link>https://www.frandroid.com/marques/canyon/2940389_nous-sommes-devenus-trop-bureaucratiques-lautocritique-rare-du-patron-de-canyon-qui-vise-1-milliard-de-chiffre-daffaires</link>
      <pubDate>Tue, 13 Jan 2026 09:19:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/canyon/2940389_nous-sommes-devenus-trop-bureaucratiques-lautocritique-rare-du-patron-de-canyon-qui-vise-1-milliard-de-chiffre-daffaires</guid>
      <description>
Dans un entretien accord&#233; au Financial Times, Roman Arnold d&#233;taille les priorit&#233;s strat&#233;giques de Canyon, alors que le fondateur a repris les commandes op&#233;rationnelles de la marque allemande en septembre 2025. Il y &#233;voque la situation financi&#232;re du groupe, ses axes de d&#233;veloppement et les ajustements internes initi&#233;s depuis son retour.
</description>
    </item>
    <item>
      <title>Fnac et Darty vendent au rabais de nombreux produits Tech lors des soldes d&#8217;hiver 2026</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-vendent-au-rabais-de-nombreux-produits-tech-lors-des-soldes-dhiver-2026</link>
      <pubDate>Tue, 13 Jan 2026 09:19:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-vendent-au-rabais-de-nombreux-produits-tech-lors-des-soldes-dhiver-2026</guid>
      <description>
&#192; la veille de la 2e d&#233;marque des soldes, Fnac et Darty fait le plein d'offres : on trouve des smartphones premium en pack &#224; prix cass&#233;, des TV &#224; moiti&#233; prix ou encore des laptops performants en r&#233;duction. D&#233;couvrez toutes les offres qui valent le coup. 
</description>
    </item>
    <item>
      <title>US Senators call on Apple and Google to ban X and Grok from app stores amid image-generation controversy</title>
      <link>https://www.techradar.com/ai-platforms-assistants/us-senators-call-on-apple-and-google-to-ban-x-and-grok-from-app-stores-amid-image-generation-controversy</link>
      <pubDate>Tue, 13 Jan 2026 09:17:08 +0000</pubDate>
      <guid isPermaLink="false">XhWNuGrxUKCS7sXSfpScXV</guid>
      <description>US Senators have told Apple and Google to take action over Grok creating explicit images of women and children.</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : quelles sont les meilleures offres &#224; saisir sur Amazon, Fnac, Darty&#8230; ?</title>
      <link>https://www.frandroid.com/bons-plans/2931731_soldes-dhiver-2026-voici-les-meilleures-offres-en-direct-avant-la-fin-de-la-premiere-demarque</link>
      <pubDate>Tue, 13 Jan 2026 09:11:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931731_soldes-dhiver-2026-voici-les-meilleures-offres-en-direct-avant-la-fin-de-la-premiere-demarque</guid>
      <description>
Les soldes d'hiver 2026 ont d&#233;but&#233; la semaine derni&#232;re et les offres continuent de tomber sur Amazon, Fnac, Darty ou encore Cdiscount et Boulanger. Smartphones, PC portables, t&#233;l&#233;viseurs, tablettes ou encore casques et &#233;couteurs sans fil&#8230; Voici les meilleures offres Tech s&#233;lectionn&#233;es par la r&#233;daction pour cette fin de premi&#232;re d&#233;marque.
</description>
    </item>
    <item>
      <title>Attention, Free Mobile pourrait bien augmenter ses prix &#224; l&#8217;avenir</title>
      <link>https://www.frandroid.com/marques/free/2940361_attention-free-mobile-pourrait-bien-augmenter-ses-prix-a-lavenir</link>
      <pubDate>Tue, 13 Jan 2026 09:08:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2940361_attention-free-mobile-pourrait-bien-augmenter-ses-prix-a-lavenir</guid>
      <description>
Free Mobile r&#233;it&#232;re une vieille promesse sur ses prix. L'expiration approche et l'op&#233;rateur ne la prolonge pas.
</description>
    </item>
    <item>
      <title>&#171; On ne peut pas simplement rattraper ce retard &#187; : pourquoi Volkswagen, BMW et Mercedes s&#8217;effondrent en Chine</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2940191_on-ne-peut-pas-simplement-rattraper-ce-retard-pourquoi-volkswagen-bmw-et-mercedes-seffondrent-en-chine</link>
      <pubDate>Tue, 13 Jan 2026 09:06:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2940191_on-ne-peut-pas-simplement-rattraper-ce-retard-pourquoi-volkswagen-bmw-et-mercedes-seffondrent-en-chine</guid>
      <description>
Si la Chine &#233;tait le principal march&#233; des constructeurs allemands, ces derniers ont vu leurs ventes chuter tr&#232;s fortement. La faute &#224; la concurrence chinoise de plus en plus forte, notamment sur les voitures &#233;lectriques.
</description>
    </item>
    <item>
      <title>Pour pirater votre compte Facebook, les hackers ont une nouvelle tactique &#171;&#160;presque impossible &#224; d&#233;tecter&#160;&#187;</title>
      <link>https://www.01net.com/actualites/pour-pirater-votre-compte-facebook-les-hackers-ont-une-nouvelle-tactique-presque-impossible-a-detecter.html</link>
      <pubDate>Tue, 13 Jan 2026 09:01:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319594</guid>
      <description>Facebook reste le terrain de jeu pr&#233;f&#233;r&#233; des cybercriminels. Pour pirater votre compte, les cybercriminels redoublent d'ing&#233;niosit&#233;. Depuis quelques mois, les pirates s'appuient sur une nouvelle tactique de piratage qui est &#171; presque impossible &#224; d&#233;tecter &#187;. Elle comprend une fausse fen&#234;tre de connexion &#171; navigateur dans le navigateur &#187; qui permet de siphonner vos identifiants et mots de passe en quelques secondes....</description>
    </item>
    <item>
      <title>How to watch Tell Me Lies season 3 online from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/tell-me-lies-season-3-online</link>
      <pubDate>Tue, 13 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">DTfxUwVUb5WdESAxzSQWdY</guid>
      <description>Can Lucy and Stephen get things back on track after rekindling their relationship? Here&#8217;s how you can watch Tell Me Lies season 3 online and from anywhere.</description>
    </item>
    <item>
      <title>&#171;&#160;Es-tu mort ?&#160;&#187; : l&#8217;application morbide qui prend la premi&#232;re place de l&#8217;App Store sur iPhone</title>
      <link>https://www.frandroid.com/os/ios/2940359_es-tu-mort-lapplication-morbide-qui-prend-la-premiere-place-de-lapp-store-sur-iphone</link>
      <pubDate>Tue, 13 Jan 2026 08:55:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/ios/2940359_es-tu-mort-lapplication-morbide-qui-prend-la-premiere-place-de-lapp-store-sur-iphone</guid>
      <description>
Vous connaissez le "Dead Man's Switch" ? Ce dispositif de s&#233;curit&#233; qui se d&#233;clenche si l'op&#233;rateur ne r&#233;pond plus ? Une start-up chinoise en a fait une application grand public. Pas de GPS, pas de tracking, juste une question de vie ou de mort toutes les deux jours. Et le monde entier se l'arrache.
</description>
    </item>
    <item>
      <title>Le chiffrement des messages entre iPhone et Android devrait arriver bient&#244;t</title>
      <link>https://www.frandroid.com/marques/apple/2940273_le-chiffrement-des-messages-entre-iphone-et-android-devrait-arriver-bientot</link>
      <pubDate>Tue, 13 Jan 2026 08:50:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2940273_le-chiffrement-des-messages-entre-iphone-et-android-devrait-arriver-bientot</guid>
      <description>
Apr&#232;s de longs mois d&#8217;attente, il semblerait qu&#8217;Apple soit enfin pr&#234;t &#224; activer le chiffrement de bout en bout pour les messages RCS. Des morceaux de code dans la prochaine version d&#8217;iOS donnent des indices sur le sujet.
</description>
    </item>
    <item>
      <title>Adieu Wear OS : Mobvoi surprend tout le monde avec une montre connect&#233;e d&#8217;un nouveau genre</title>
      <link>https://www.frandroid.com/marques/mobvoi/2940211_adieu-wear-os-mobvoi-surprend-tout-le-monde-avec-une-montre-connectee-dun-nouveau-genre</link>
      <pubDate>Tue, 13 Jan 2026 08:44:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/mobvoi/2940211_adieu-wear-os-mobvoi-surprend-tout-le-monde-avec-une-montre-connectee-dun-nouveau-genre</guid>
      <description>
Lors du CES de Las Vegas, le constructeur chinois Mobvoi, &#224; l'origine des montres TicWatch, a d&#233;voil&#233; un nouvel &#233;cosyst&#232;me de produits dont une montre TicNote Watch. 
</description>
    </item>
    <item>
      <title>Nouvelle fuite de donn&#233;es en France&#160;: 150&#160;000 dossiers de patients vol&#233;s</title>
      <link>https://www.01net.com/actualites/fuite-donnees-doctolib-informations-milliers-francais-compromises.html</link>
      <pubDate>Tue, 13 Jan 2026 08:44:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318023</guid>
      <description>Doctolib s'est retrouv&#233; au c&#339;ur d'une nouvelle fuite de donn&#233;es ce week-end. Plus de 150 000 fiches patients issues de l&#8217;H&#244;pital priv&#233; de la Miotte et d&#8217;un cabinet d&#8217;ophtalmologie de Sallanches circulent sur le dark web. Les deux &#233;tablissements passaient par Doctolib pour permettre aux patients de prendre rendez-vous. Interrog&#233; par 01net, Doctolib d&#233;ment fermement toute violation et pr&#233;cise que les donn&#233;es n'ont pas &#233;t&#233; vol&#233;es sur ses serveurs. C'est &#233;galement le cas d'un des &#233;tablissements &#233;pingl&#233;s par les pirates....</description>
    </item>
    <item>
      <title>Cette voiture &#233;lectrique sans permis fran&#231;aise casse son prix d&#8217;entr&#233;e pour mieux concurrencer la Citro&#235;n Ami</title>
      <link>https://www.frandroid.com/marques/ligier/2939413_cette-voiture-electrique-sans-permis-francaise-casse-son-prix-dentree-pour-mieux-concurrencer-la-citroen-ami</link>
      <pubDate>Tue, 13 Jan 2026 08:34:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/ligier/2939413_cette-voiture-electrique-sans-permis-francaise-casse-son-prix-dentree-pour-mieux-concurrencer-la-citroen-ami</guid>
      <description>
Le constructeur fran&#231;ais Ligier repositionne sa voiture &#233;lectrique sans permis Myli en deux d&#233;clinaisons distinctes. Une strat&#233;gie marketing rod&#233;e qui vise &#224; &#233;largir sa client&#232;le tout en cassant les prix d'entr&#233;e.
</description>
    </item>
    <item>
      <title>Tesla met &#224; jour le Model Y 2026 : voici les 3 nouveaut&#233;s principales, dont l&#8217;option 7 places mais uniquement aux US</title>
      <link>https://www.frandroid.com/marques/tesla/2940277_tesla-met-a-jour-le-model-y-2026-voici-les-3-nouveautes-principales-dont-loption-7-places-et-uniquement-aux-etats-unis-pour-le-moment</link>
      <pubDate>Tue, 13 Jan 2026 08:34:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2940277_tesla-met-a-jour-le-model-y-2026-voici-les-3-nouveautes-principales-dont-loption-7-places-et-uniquement-aux-etats-unis-pour-le-moment</guid>
      <description>
On attendait tous la version longue venue de Chine, la Model Y L. Finalement, Tesla joue la carte du recyclage. Le Model Y 7 places fait son retour aux &#201;tats-Unis sur la version 2026.
</description>
    </item>
    <item>
      <title>Nintendo&#160;: il n&#8217;y aurait pas de hausse des prix pour la Switch 2&#8230; pour l&#8217;instant</title>
      <link>https://www.01net.com/actualites/nintendo-il-ny-aurait-pas-de-hausse-des-prix-pour-la-switch-2-pour-linstant.html</link>
      <pubDate>Tue, 13 Jan 2026 08:31:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319590</guid>
      <description>L'&#233;volution des prix de la m&#233;moire vive est regard&#233;e comme le lait sur le feu par les constructeurs de produits informatiques. C'est le cas aussi chez Nintendo, mais il faut relativiser : si une hausse des prix de la Switch 2 devait intervenir, ce ne serait pas pour tout de suite.</description>
    </item>
    <item>
      <title>Bee : tout savoir sur Bee, l&#8217;entreprise qu&#8217;Amazon vient de s&#8217;offrir</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/bracelets-connectes/2940259_bee-tout-savoir-sur-bee-lentreprise-quamazon-vient-de-soffrir</link>
      <pubDate>Tue, 13 Jan 2026 08:23:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/bracelets-connectes/2940259_bee-tout-savoir-sur-bee-lentreprise-quamazon-vient-de-soffrir</guid>
      <description>
Vous vous souvenez du flop de l'Ai Pin ? Amazon, apparemment, a pris des notes. L'entreprise vient d'acqu&#233;rir Bee, un petit wearable discret bourr&#233; d'IA pr&#233;sent&#233; au CES. Bref, Bee &#233;coute votre vie dehors, Alexa g&#232;re votre maison.
</description>
    </item>
    <item>
      <title>Mises &#224; jour Xiaomi : Orange c&#232;de enfin sous la pression des abonn&#233;s</title>
      <link>https://www.frandroid.com/marques/xiaomi/2940241_mises-a-jour-xiaomi-orange-cede-enfin-sous-la-pression-des-abonnes</link>
      <pubDate>Tue, 13 Jan 2026 08:09:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2940241_mises-a-jour-xiaomi-orange-cede-enfin-sous-la-pression-des-abonnes</guid>
      <description>
Il y a deux jours, Orange expliquait que valider une mise &#224; jour prenait du temps. Aujourd'hui, apr&#232;s une fronde massive sur les forums et les r&#233;seaux, l'op&#233;rateur d&#233;ploie soudainement la derni&#232;re version d'HyperOS sur les Xiaomi 15. 
</description>
    </item>
    <item>
      <title>iOS 26.3 pr&#233;pare l&#8217;arriv&#233;e du chiffrement pour les messages RCS</title>
      <link>https://www.01net.com/actualites/ios-26-3-prepare-larrivee-du-chiffrement-pour-les-messages-rcs.html</link>
      <pubDate>Tue, 13 Jan 2026 08:08:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319608</guid>
      <description>La messagerie RCS sous iOS devrait bient&#244;t acc&#233;der au chiffrement de bout en bout. Plusieurs indices trouv&#233;s dans la deuxi&#232;me b&#234;ta d&#8217;iOS 26.3 indiquent en tout cas que tout semble d&#233;j&#224; pr&#234;t du c&#244;t&#233; d&#8217;Apple.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs TV Oled en 2026&#8201;?</title>
      <link>https://www.frandroid.com/guide-dachat/679063_quelles-sont-les-meilleures-tv-oled-en-2020-notre-selection</link>
      <pubDate>Tue, 13 Jan 2026 08:04:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/679063_quelles-sont-les-meilleures-tv-oled-en-2020-notre-selection</guid>
      <description>
La technologie Oled est reine pour parmi les t&#233;l&#233;viseurs haut de gamme, gr&#226;ce &#224; ses excellents contrastes et la profondeur de ses noirs. Nous avons s&#233;lectionn&#233; et rassembl&#233; ici les meilleurs TV Oled que nous avons test&#233;s.
</description>
    </item>
    <item>
      <title>Meta pourrait sabrer encore dans les effectifs du m&#233;tavers</title>
      <link>https://www.01net.com/actualites/meta-pourrait-sabrer-encore-dans-les-effectifs-du-metavers.html</link>
      <pubDate>Tue, 13 Jan 2026 08:02:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319587</guid>
      <description>Le m&#233;tavers n'est vraiment plus la priorit&#233; de Meta, principal promoteur de cette &#171;&#160;vision&#160;&#187; d'un monde plong&#233; dans des univers virtuels qui n'a pas port&#233; les fruits esp&#233;r&#233;s. L'entreprise de Mark Zuckerberg s'est tourn&#233;e massivement vers l'IA et r&#233;duit la voilure au sein des Reality Labs.</description>
    </item>
    <item>
      <title>Tell Me Lies season 3 makes Lucy and Stephen a total yawnfest &#8212; but one budding new romance could soon be dangerous</title>
      <link>https://www.techradar.com/streaming/hulu/tell-me-lies-season-3-makes-lucy-and-stephen-a-total-yawnfest-but-one-budding-new-romance-could-soon-be-dangerous</link>
      <pubDate>Tue, 13 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">sWALd5mqCfVkvbeeWripwT</guid>
      <description>Turns out, we've waited two years to be reminded how awful Lucy and Stephen are together &#8211; but Tell Me Lies season 3 episodes 1 and 2 has also casually dropped a potential new bombshell into the mix.</description>
    </item>
    <item>
      <title>Nouveau et d&#233;j&#224; sold&#233;, le Poco M8 5G de Xiaomi joue dans la cour des Galaxy A36 c&#244;t&#233; performances</title>
      <link>https://www.frandroid.com/bons-plans/2939293_nouveau-et-deja-solde-le-poco-m8-5g-de-xiaomi-joue-dans-la-cour-des-galaxy-a36-cote-performances</link>
      <pubDate>Tue, 13 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2939293_nouveau-et-deja-solde-le-poco-m8-5g-de-xiaomi-joue-dans-la-cour-des-galaxy-a36-cote-performances</guid>
      <description>
Alors qu'il vient seulement d'&#234;tre lanc&#233;, le Xiaomi Poco M8 5G profite des soldes pour sa sortie et est disponible pour 259,90 euros au lieu de 303 euros.
</description>
    </item>
  </channel>
</rss>
