<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 19 Nov 2025 14:44:13 GMT</lastBuildDate>
    <item>
      <title>Target joins OpenAI&#8217;s growing list of retail apps</title>
      <link>https://techcrunch.com/2025/11/19/target-joins-openais-growing-list-of-retail-apps/</link>
      <pubDate>Wed, 19 Nov 2025 14:36:12 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069140</guid>
      <description>OpenAI is pushing deeper into retail, with Target set to debut a new ChatGPT-powered app for shoppers. The app is launching in beta next week.</description>
    </item>
    <item>
      <title>Tout l&#8217;univers de Samsung est &#224; prix cass&#233; pendant le Black Friday : les 20 meilleurs deals</title>
      <link>https://www.frandroid.com/bons-plans/2852851_samsung-frappe-fort-a-lors-du-pre-black-friday-avec-ses-20-bonnes-affaires-a-saisir</link>
      <pubDate>Wed, 19 Nov 2025 14:36:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2852851_samsung-frappe-fort-a-lors-du-pre-black-friday-avec-ses-20-bonnes-affaires-a-saisir</guid>
      <description>
Pendant le pr&#233;-Black Friday, les produits Samsung sont &#224; l'honneur. On trouve des smartphones &#224; moiti&#233; prix, des TV &#224; prix cass&#233;s, ou m&#234;me des barres de son &#224; petit prix :&#160;retrouvez ici les meilleures offres.&#160;
</description>
    </item>
    <item>
      <title>Learning With AI Falls Short Compared to Old-Fashioned Web Search</title>
      <link>https://gizmodo.com/learning-with-ai-falls-short-compared-to-old-fashioned-web-search-2000688085</link>
      <pubDate>Wed, 19 Nov 2025 14:35:32 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000688085</guid>
      <description>In virtually all the ways that matter, getting summarized information from AI models was less educational than doing the work of search.</description>
    </item>
    <item>
      <title>The Epstein files have claimed their first OpenAI victim: board member Larry Summers</title>
      <link>https://techcrunch.com/2025/11/19/the-epstein-files-have-claimed-their-first-openai-victim-board-member-larry-summers/</link>
      <pubDate>Wed, 19 Nov 2025 14:33:54 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069136</guid>
      <description>Former Treasury Secretary Larry Summers has resigned from OpenAI&#8217;s board days after Congress released documents showing he was close friends with convicted sex offender Jeffrey Epstein.</description>
    </item>
    <item>
      <title>Vasco Translator Q1 Review: Cloning Your Voice</title>
      <link>https://www.wired.com/review/vasco-translator-q1/</link>
      <pubDate>Wed, 19 Nov 2025 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">691cdc45e1e090347dceafcc</guid>
      <description>This new real-time interpreter can change your language while cloning your voice&#8212;sort of.</description>
    </item>
    <item>
      <title>Le Porsche Cayenne devient enfin une voiture &#233;lectrique, et fait mieux que la 911 Turbo S</title>
      <link>https://www.frandroid.com/marques/porsche/2876195_le-porsche-cayenne-devient-enfin-une-voiture-electrique-et-fait-mieux-que-la-911-turbo-s</link>
      <pubDate>Wed, 19 Nov 2025 14:29:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/porsche/2876195_le-porsche-cayenne-devient-enfin-une-voiture-electrique-et-fait-mieux-que-la-911-turbo-s</guid>
      <description>
Porsche vient d'officialiser son nouveau Cayenne Electric, un SUV &#233;lectrique qui pulv&#233;rise tous les records de la marque. Il s'agit de la Porsche la plus puissante de l'histoire, mais aussi de l'une des Porsche les plus pratique pour le quotidien.
</description>
    </item>
    <item>
      <title>Sony Xperia 1 VII review: has Sony&#8217;s long-standing Xperia family lost what it takes to compete?</title>
      <link>https://www.techradar.com/phones/sony-xperia-phones/sony-xperia-1-vii-review</link>
      <pubDate>Wed, 19 Nov 2025 14:25:55 +0000</pubDate>
      <guid isPermaLink="false">NnYPKuzMCTbQS6KaLyAyDP</guid>
      <description>The Sony Xperia 1 VII is a capable handset that can't quite match some rivals, while coming in at a higher price.</description>
    </item>
    <item>
      <title>Bose Black Friday deals are in, and my top-choice new Ultra Earbuds and headphones are heavily discounted &#8211; run!</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/bose-black-friday-deals-are-in-and-my-top-choice-new-ultra-earbuds-and-headphones-are-heavily-discounted-run</link>
      <pubDate>Wed, 19 Nov 2025 14:24:38 +0000</pubDate>
      <guid isPermaLink="false">msbZXCWkbruHLH2ibsHkRd</guid>
      <description>Bose kit offers the best ANC in the business and now, the prices are truly worthy of your consideration &#8211;thanks, Black Friday!</description>
    </item>
    <item>
      <title>Cette marque de v&#233;lo &#233;lectrique offre (litt&#233;ralement) sur un plateau son tricycle aux professionnels</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2875813_cette-marque-de-velo-electrique-offre-litteralement-sur-un-plateau-son-tricycle-aux-professionnels</link>
      <pubDate>Wed, 19 Nov 2025 14:20:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2875813_cette-marque-de-velo-electrique-offre-litteralement-sur-un-plateau-son-tricycle-aux-professionnels</guid>
      <description>
Apr&#232;s deux ans de carri&#232;re, le tricycle &#233;lectrique Cube Trike Hybrid d&#233;voile une version Flatbed avec un plateau nu &#224; destination des professionnels, afin de charger de grandes quantit&#233;s marchandises.
</description>
    </item>
    <item>
      <title>Les Xiaomi Store ne sont pas l&#224; que pour faire joli, c&#8217;est une vraie strat&#233;gie qui se met en place</title>
      <link>https://www.01net.com/actualites/les-xiaomi-store-ne-sont-pas-la-que-pour-faire-joli-cest-une-vraie-strategie-qui-se-met-en-place.html</link>
      <pubDate>Wed, 19 Nov 2025 14:20:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309327</guid>
      <description>Xiaomi se lance dans l'ouverture de ses propres magasins physiques en France dans le cadre d'une strat&#233;gie mondiale ambitieuse visant &#224; implanter 10 000 Xiaomi Stores d'ici 2030, pour renforcer sa pr&#233;sence directe et mieux faire d&#233;couvrir l'ensemble de son &#233;cosyst&#232;me de produits, au-del&#224; des smartphones. La d&#233;marche vise aussi &#224; se diversifier peu &#224; peu....</description>
    </item>
    <item>
      <title>Je suis mont&#233; &#224; bord du Porsche Cayenne &#233;lectrique, et j&#8217;ai &#233;t&#233; impressionn&#233; par ses technologies et sa puissance d&#233;mentielles</title>
      <link>https://www.frandroid.com/marques/porsche/2875769_je-suis-monte-a-bord-du-porsche-cayenne-electrique-et-jai-ete-impressionne-par-ses-technologies-et-sa-puissance-dementielles</link>
      <pubDate>Wed, 19 Nov 2025 14:15:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/porsche/2875769_je-suis-monte-a-bord-du-porsche-cayenne-electrique-et-jai-ete-impressionne-par-ses-technologies-et-sa-puissance-dementielles</guid>
      <description>
Porche vient de d&#233;voiler sa nouvelle voiture &#233;lectrique, le Cayenne. Elle est plus rapide que la nouvelle 911 Turbo S et c'est m&#234;me la Porsche la plus puissante de tous les temps. On a pu monter &#224; bord pour se faire un premier avis, en statique.
</description>
    </item>
    <item>
      <title>Porsche Reveals Everything About Its Cayenne Electric&#8212;Except for One Vital Thing</title>
      <link>https://www.wired.com/story/porsche-reveals-everything-about-its-cayenne-electric-apart-from-one-vital-thing/</link>
      <pubDate>Wed, 19 Nov 2025 14:15:00 +0000</pubDate>
      <guid isPermaLink="false">691c570b80bfe18f54ee1f26</guid>
      <description>The automaker has taken the covers off its Cayenne Electric and Cayenne Turbo Electric, the most powerful production Porsches ever. But it won&#8217;t confirm a key AI feature of its first fully electric SUV.</description>
    </item>
    <item>
      <title>Porsche crowns Cayenne Electric &#8216;most powerful production Porsche of all time&#8217;</title>
      <link>https://www.theverge.com/news/823329/porsche-cayenne-electric-turbo-specs-price-range</link>
      <pubDate>2025-11-19T09:15:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=823329</guid>
      <description>It&#8217;s no surprise that the Porsche Cayenne EV is a beast. Of course the famed German automaker would tout its all-electric SUV as &#8220;the most powerful,&#8221; the quickest &#8212; both off the line and in a charging stall &#8212; and record-setting in so many ways. The question remains: how beastly are we talking? Now, thankfully, [&#8230;]</description>
    </item>
    <item>
      <title>Adobe to acquire digital marketing platform Semrush for $1.9 billion</title>
      <link>https://www.theverge.com/news/823887/adobe-semrush-acquisition-digital-marketing</link>
      <pubDate>2025-11-19T09:14:57-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=823887</guid>
      <description>Adobe is acquiring the digital marketing platform Semrush for around $1.9 billion. In a press release on Wednesday, Adobe says the deal will allow it and Semrush to give marketers insight into how their brands appear across the web. The acquisition builds on Adobe&#8217;s existing suite of marketing tools that help businesses manage digital campaigns [&#8230;]</description>
    </item>
    <item>
      <title>How to cancel Surfshark and get a refund</title>
      <link>https://www.techradar.com/vpn/vpn-services/how-to-cancel-surfshark-and-get-a-refund</link>
      <pubDate>Wed, 19 Nov 2025 14:06:46 +0000</pubDate>
      <guid isPermaLink="false">rwzrkC93frxF2LPWA94tkE</guid>
      <description>Cancel auto-renewal and claim your money back - with no hassle</description>
    </item>
    <item>
      <title>Cloud and AI usage is still a concern for businesses - and the worries are only set to rise</title>
      <link>https://www.techradar.com/pro/cloud-and-ai-usage-is-still-a-concern-for-businesses-and-the-worries-are-only-set-to-rise</link>
      <pubDate>Wed, 19 Nov 2025 14:05:15 +0000</pubDate>
      <guid isPermaLink="false">8iRDoAYoKPC2BzXmn9zEoN</guid>
      <description>Public cloud might be favored more than on-prem, but both are just as at-risk of cyber incidents.</description>
    </item>
    <item>
      <title>XRP price keeps falling as digital tokens struggle to regain ground. What&#8217;s happening with crypto?</title>
      <link>https://www.fastcompany.com/91444912/xrp-price-today-why-is-it-falling-whats-happening-crypto</link>
      <pubDate>2025-11-19T14:03:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444912/xrp-price-today-why-is-it-falling-whats-happening-crypto</guid>
      <description>A selloff of cryptocurrencies has continued this week, due to broader economic concerns and longtime holders seeking to lock in profits while they can.
The cryptocurrency market is continuing to tumble as investors worry about risky assets, an AI and tech bubble, and a roughly 50% likelihood of the Federal Reserve cutting interest rates.&#160;</description>
    </item>
    <item>
      <title>Cdiscount encha&#238;ne les promotions avec l&#8217;arriv&#233;e du v&#233;ritable Black Friday : les 17 meilleures offres</title>
      <link>https://www.frandroid.com/bons-plans/2850059_cdiscount-pratique-des-prix-bien-bas-pour-le-pre-black-friday-voici-les-15-meilleurs-deals</link>
      <pubDate>Wed, 19 Nov 2025 14:00:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850059_cdiscount-pratique-des-prix-bien-bas-pour-le-pre-black-friday-voici-les-15-meilleurs-deals</guid>
      <description>
&#192; l'approche du Black Friday, Cdiscount multiplie les bonnes affaires. T&#233;l&#233;viseurs, ordinateurs portables, consoles de jeux et m&#234;me des forfaits mobiles&#8230; De nombreux produits tr&#232;s recherch&#233;s profitent de belles remises.
</description>
    </item>
    <item>
      <title>The 15 Best Soundbars We&#8217;ve Tested in 2025: Sonos, Sony, Bose</title>
      <link>https://www.wired.com/gallery/best-soundbars/</link>
      <pubDate>Wed, 19 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">5ba9532c0f3ae02cf6c58ef4</guid>
      <description>Every television deserves a row of speakers to call its own. These are our favorite soundbars.</description>
    </item>
    <item>
      <title>Security startup Guardio nabs $80M from ION Crossover Partners</title>
      <link>https://techcrunch.com/2025/11/19/security-startup-guardio-nabs-80m-from-ion-crossover-partners/</link>
      <pubDate>Wed, 19 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068285</guid>
      <description>Guardio is leveraging its experience building browser extensions and apps that scan for malicious and phishing sites to build a tool that looks for artifacts in code and websites made with vibe coding tools.</description>
    </item>
    <item>
      <title>What is the release date for Pluribus episode 4 on Apple TV?</title>
      <link>https://www.techradar.com/streaming/apple-tv-plus/what-is-the-release-date-for-pluribus-episode-4-on-apple-tv</link>
      <pubDate>Wed, 19 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">J3Csdia8UbR2DYGqfxsd4C</guid>
      <description>Episode 4 of Apple's mystery sci-fi drama arrives later this week &#8211; here's when you can watch it.</description>
    </item>
    <item>
      <title>Microsoft reveals new plan to make your Windows 11 PC more stable and reliable &#8211; and help you recover from disasters</title>
      <link>https://www.techradar.com/computing/windows/microsoft-reveals-new-plan-to-make-your-windows-11-pc-more-stable-and-reliable-and-help-you-recover-from-disasters</link>
      <pubDate>Wed, 19 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">ZCxxmX5hGL5xWSFvGfXfH4</guid>
      <description>Microsoft is working on making Windows 11 more stable, though it's going to be a long road to that end goal.</description>
    </item>
    <item>
      <title>These are the 15 best iPhone, iPad, Mac, Apple Watch and Apple TV apps of the 2025, according to Apple</title>
      <link>https://www.techradar.com/computing/websites-apps/these-are-the-12-best-iphone-ipad-mac-apple-watch-and-apple-tv-apps-of-the-2025-according-to-apple</link>
      <pubDate>Wed, 19 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">oU7Jh8c88gzHbVo9ZTHDMR</guid>
      <description>Apple&#8217;s App Store Awards have honored the best apps of 2025 across Apple&#8217;s platforms &#8211;here are all the key winners.</description>
    </item>
    <item>
      <title>OpenCV founders launch AI video startup to take on OpenAI and Google</title>
      <link>https://venturebeat.com/ai/opencv-founders-launch-ai-video-startup-to-take-on-openai-and-google</link>
      <pubDate>Wed, 19 Nov 2025 14:00:00 GMT</pubDate>
      <guid isPermaLink="false">7pXXhpBVZE9uIDVVMmFfR6</guid>
      <description>A new artificial intelligence startup founded by the creators of the world's most widely used computer vision library has emerged from stealth with technology that generates realistic human-centric videos up to five minutes long &#8212; a dramatic leap beyond the capabilities of rivals including OpenAI's Sora and Google's Veo.CraftStory, which launched Tuesday with $2 million in funding, is introducing Model 2.0, a video generation system that addresses one of the most significant limitations plaguing the nascent AI video industry: duration. While OpenAI's Sora 2 tops out at 25 seconds and most comp...</description>
    </item>
    <item>
      <title>The age of intelligent real estate</title>
      <link>https://www.fastcompany.com/91444524/the-age-of-intelligent-real-estate</link>
      <pubDate>2025-11-19T14:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444524/the-age-of-intelligent-real-estate</guid>
      <description>Move from manual tasks to wise decisions.
Every industry eventually reaches its productivity era. Manufacturing&#160;had&#160;automation. Finance had algorithmic trading. Today, real estate is stepping into its own transformation: the age of intelligent decision&#160;making.&#160;</description>
    </item>
    <item>
      <title>Test de la ROG Xbox Ally X : une bonne console portable, mais une mauvaise Xbox</title>
      <link>https://www.frandroid.com/marques/microsoft/2830145_test-de-la-rog-xbox-ally-x-pourquoi-vous-devriez-attendre-avant-de-lacheter</link>
      <pubDate>Wed, 19 Nov 2025 13:56:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2830145_test-de-la-rog-xbox-ally-x-pourquoi-vous-devriez-attendre-avant-de-lacheter</guid>
      <description>
L'Asus ROG Xbox Ally X est l&#224; pour relancer la cat&#233;gorie des PC consoles portables. Mais h&#233;las, son lancement n'est pas aussi simple que pr&#233;vu...
</description>
    </item>
    <item>
      <title>Windows 11&#160;: Microsoft va enfin corriger cette aberration du calendrier</title>
      <link>https://www.01net.com/actualites/windows-11-microsoft-va-enfin-corriger-cette-aberration-du-calendrier.html</link>
      <pubDate>Wed, 19 Nov 2025 13:49:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309326</guid>
      <description>Le syst&#232;me d&#8217;exploitation de Microsoft profitera prochainement d&#8217;une mise &#224; jour qui introduira une nouveaut&#233; que plus personne n&#8217;attendait : un aper&#231;u complet du calendrier depuis le volet des notifications.</description>
    </item>
    <item>
      <title>Black Friday &#233;couteurs, casques et enceintes : voici les 12 meilleures offres sur l&#8217;audio des marques Nothing, Apple, Sony, Bose, JBL&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2849763_black-friday-ecouteurs-sans-fil-les-meilleures-offres-sur-tous-les-produits-audio</link>
      <pubDate>Wed, 19 Nov 2025 13:47:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849763_black-friday-ecouteurs-sans-fil-les-meilleures-offres-sur-tous-les-produits-audio</guid>
      <description>
&#201;couteurs Bluetooth, casques audio sans-fil, enceintes Bluetooth, plusieurs produits audio regroupent cette cat&#233;gorie. Nous avons s&#233;lectionn&#233; les meilleures offres du secteur. Vous y trouverez des AirPods, des produits JBL ou encore des casques de chez Sony.
</description>
    </item>
    <item>
      <title>CIOs are being lumped with AI responsibilities - and many of them aren't happy with that</title>
      <link>https://www.techradar.com/pro/cios-are-being-lumped-with-ai-responsibilities-and-many-of-them-arent-happy-with-that</link>
      <pubDate>Wed, 19 Nov 2025 13:46:31 +0000</pubDate>
      <guid isPermaLink="false">RGpFsMU9AhNpSiZmPqFUyX</guid>
      <description>While CIOs are OK with taking on AI responsibilities, they lack sufficient support, particularly when it comes to security.</description>
    </item>
    <item>
      <title>La charge sans fil serait une aberration &#233;cologique : l&#8217;&#233;quivalent d&#8217;une ville comme Nantes gaspill&#233;</title>
      <link>https://www.frandroid.com/produits-android/2876097_la-charge-sans-fil-serait-une-aberration-ecologique-lequivalent-dune-ville-comme-nantes-gaspille</link>
      <pubDate>Wed, 19 Nov 2025 13:44:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2876097_la-charge-sans-fil-serait-une-aberration-ecologique-lequivalent-dune-ville-comme-nantes-gaspille</guid>
      <description>
Bon, il faut qu'on parle de votre chargeur &#224; induction. Pratique ? Indiscutablement. &#201;cologique ? Absolument pas. Entre la perte d'&#233;nergie et la chaleur d&#233;gag&#233;e, le bilan est lourd. Si tout le monde s'y met, on gaspille litt&#233;ralement l'&#233;quivalent de la production de 200 &#233;oliennes juste pour ne pas brancher un c&#226;ble.
</description>
    </item>
    <item>
      <title>Early Black Friday sale: Samsung&#8217;s flagship 2TB 990 Pro SSD is what creative pros need - and costs just &#163;121</title>
      <link>https://www.techradar.com/pro/early-black-friday-sale-samsungs-flagship-2tb-990-pro-ssd-is-what-creative-pros-need-and-costs-just-gbp121</link>
      <pubDate>Wed, 19 Nov 2025 13:42:41 +0000</pubDate>
      <guid isPermaLink="false">uGkzLK7KV5x7q2sz2v7bGi</guid>
      <description>The 2TB Samsung 990 Pro SSD delivers read speeds up to 7,450MB/s, and it&#8217;s available for just &#163;121</description>
    </item>
    <item>
      <title>Le &#8220;packaging&#8221; : l&#8217;arme secr&#232;te d&#8217;Intel pour reconqu&#233;rir le march&#233; des puces et des processeurs</title>
      <link>https://www.frandroid.com/marques/intel/2850529_le-packaging-larme-secrete-dintel-pour-reconquerir-le-marche-des-puces-et-des-processeurs</link>
      <pubDate>Wed, 19 Nov 2025 13:38:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/intel/2850529_le-packaging-larme-secrete-dintel-pour-reconquerir-le-marche-des-puces-et-des-processeurs</guid>
      <description>
Dans la course aux processeurs, il n&#8217;y a pas que la finesse de gravure qui compte&#160;! Alors qu&#8217;Intel est vent debout pour reprendre la couronne des plus petits transistors face au Ta&#239;wanais TSMC, le g&#233;ant am&#233;ricain met en lumi&#232;re un de ces atouts peu connus&#160;: sa capacit&#233; &#224; coller les puces ensemble.
</description>
    </item>
    <item>
      <title>My favorite game of 2025 is half off at Target thanks to a fun-tastic early Black Friday sale</title>
      <link>https://www.techradar.com/seasonal-sales/my-favorite-game-of-2025-is-half-off-at-target-thanks-to-a-fun-tastic-early-black-friday-sale</link>
      <pubDate>Wed, 19 Nov 2025 13:36:01 +0000</pubDate>
      <guid isPermaLink="false">5MF5ywnu9xnzK4SMDS2unD</guid>
      <description>Flip 7 is the best game I've played this year, it's fun for the whole family, and target will sell it to you for 50%-off.</description>
    </item>
    <item>
      <title>The 65-inch TCL QM6K QLED TV has hit its lowest-ever price on Amazon &#8212; pay under $500 ahead of Black Friday</title>
      <link>https://mashable.com/article/nov-19-tcl-qm6k-tv-deal</link>
      <pubDate>Wed, 19 Nov 2025 13:32:45 +0000</pubDate>
      <guid isPermaLink="false">041hTeA48biQtboiMw5bO3W</guid>
      <description>Find the best early Black Friday TV deal. The 65-inch TCL QM6K QLED TV is on sale for $497.99 at Amazon.</description>
    </item>
    <item>
      <title>Amazon n&#8217;h&#233;site pas &#224; vendre au rabais de nombreux produits Tech la veille du Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2860071_amazon-lance-une-vague-de-promotions-pour-le-pre-black-friday-les-18-offres-a-ne-pas-louper</link>
      <pubDate>Wed, 19 Nov 2025 13:31:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860071_amazon-lance-une-vague-de-promotions-pour-le-pre-black-friday-les-18-offres-a-ne-pas-louper</guid>
      <description>
Amazon lance &#224; partir de demain ses offres Black Friday, mais certaines sont d&#233;j&#224; en lignes. Plusieurs gammes telles que les smartphones, ordinateurs portables, casques audio et consoles de jeux b&#233;n&#233;ficient actuellement de prix r&#233;duits.
</description>
    </item>
    <item>
      <title>Il y a -35 % sur cet excellent stabilisateur DJI pour smartphone, capable de suivre automatiquement un sujet</title>
      <link>https://www.frandroid.com/bons-plans/2731841_il-y-a-35-sur-cet-excellent-stabilisateur-dji-pour-smartphone-capable-de-suivre-automatiquement-un-sujet</link>
      <pubDate>Wed, 19 Nov 2025 13:30:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2731841_il-y-a-35-sur-cet-excellent-stabilisateur-dji-pour-smartphone-capable-de-suivre-automatiquement-un-sujet</guid>
      <description>
Le DJI Osmo Mobile 7P est un gimbal qui offre non seulement une stabilisation efficace, mais aussi un suivi de sujet pr&#233;cis et ultra-r&#233;actif. S'il vous int&#233;resse, vous pourrez le trouver &#224; 89 euros au lieu de 139,99 euros sur Amazon, pendant le Black Friday.
</description>
    </item>
    <item>
      <title>Sketch.&#160;AI&#160;Prompt. Runway.</title>
      <link>https://www.fastcompany.com/91444363/sketch-ai-prompt-runway</link>
      <pubDate>2025-11-19T13:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444363/sketch-ai-prompt-runway</guid>
      <description>How I Designed a Fashion Show with AI. 
When I was a kid, my favorite place in the world was hunched over a sewing machine.&#160;I&#8217;d&#160;cut up old jeans, hand-stitch fabric scraps into new outfits, and dream of someday seeing my clothes walk a runway. My notebooks were full of fashion drawings. Somewhere in my teens, that dream slipped quietly into the background. Life pulled me in a different direction.&#160;...</description>
    </item>
    <item>
      <title>Europe&amp;#8217;s cookie nightmare is crumbling</title>
      <link>https://www.theverge.com/news/823788/europe-cookie-prompt-browser-changes-proposal</link>
      <pubDate>2025-11-19T08:28:08-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=823788</guid>
      <description>The EU&#8217;s cookie consent policies have been an annoying and unavoidable part of browsing the web in Europe since their introduction in 2018. But the cookie nightmare is about to crumble thanks to some big proposed changes announced by the European Commission today. Instead of having to click accept or reject on a cookie pop-up [&#8230;]</description>
    </item>
    <item>
      <title>Netflix hasn&#8217;t confirmed Virgin River season 7's rumored release date, but there&#8217;s an obvious reason why it makes perfect sense</title>
      <link>https://www.techradar.com/streaming/netflix/netflix-hasnt-confirmed-virgin-river-season-7s-rumored-release-date-but-theres-an-obvious-reason-why-it-makes-perfect-sense</link>
      <pubDate>Wed, 19 Nov 2025 13:27:34 +0000</pubDate>
      <guid isPermaLink="false">Y5JJE5YMbVLBvWXqW59D85</guid>
      <description>We knew Virgin River season 7 would be getting a 2026 release, but we shouldn't be surprised by the release window leak.</description>
    </item>
    <item>
      <title>Mod&#233;ration, transparence&#160;: Amazon devra jouer selon les r&#232;gles europ&#233;ennes</title>
      <link>https://www.01net.com/actualites/moderation-transparence-amazon-devra-jouer-selon-les-regles-europeennes.html</link>
      <pubDate>Wed, 19 Nov 2025 13:27:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309333</guid>
      <description>Amazon a perdu son pari face &#224; la justice europ&#233;enne. Le g&#233;ant am&#233;ricain du commerce en ligne est donc bien consid&#233;r&#233; comme une &#171; tr&#232;s grande plateforme en ligne &#187; aux yeux du r&#232;glement sur les services num&#233;riques (DSA).</description>
    </item>
    <item>
      <title>Target&#8217;s bad year continues: Sales decline and stock slips as high-stakes holiday shopping season arrives</title>
      <link>https://www.fastcompany.com/91444914/target-stock-price-slips-sales-decline-bad-2025-continues</link>
      <pubDate>2025-11-19T13:23:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444914/target-stock-price-slips-sales-decline-bad-2025-continues</guid>
      <description>The retail giant, still struggling to regain ground after customers opposed its rollback of DEI policies, just reported another lackluster quarter.
Today, retail giant Target Corporation (NYSE: TGT) reported its third-quarter fiscal 2025 earnings. Unfortunately, for the company and its investors, the results were a continuation of what Target has been seeing for years now: declining sales. ...</description>
    </item>
    <item>
      <title>Sony's fantastic WH-1000XM6 headphones just got their first-ever UK price cut &#8211; beat the Black Friday rush</title>
      <link>https://www.techradar.com/audio/wireless-headphones/sonys-fantastic-wh-1000xm6-headphones-just-got-their-first-ever-uk-price-cut-beat-the-black-friday-rush</link>
      <pubDate>Wed, 19 Nov 2025 13:16:41 +0000</pubDate>
      <guid isPermaLink="false">7HaZs2zTCvuA6ekigCS7Kg</guid>
      <description>Get &#163;50 off Sony's range-topping noise-cancelling over-ear headphones</description>
    </item>
    <item>
      <title>J&#8217;ai d&#233;sinstall&#233; PairDrop et l&#226;ch&#233; AirDrop : LocalSend est la seule vraie solution universelle pour transf&#233;rer des fichiers</title>
      <link>https://www.frandroid.com/android/2876005_jai-desinstalle-pairdrop-et-lache-airdrop-localsend-est-la-seule-vraie-solution-universelle-pour-transferer-des-fichiers</link>
      <pubDate>Wed, 19 Nov 2025 13:14:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/2876005_jai-desinstalle-pairdrop-et-lache-airdrop-localsend-est-la-seule-vraie-solution-universelle-pour-transferer-des-fichiers</guid>
      <description>
Vous avez un Mac et un smartphone Android ? Ou un PC Windows et un iPad ? Alors vous connaissez l'enfer du transfert de fichiers. On m'a souvent parl&#233; de PairDrop, la solution web. C'est mignon, &#231;a d&#233;panne. Mais la vraie solution industrielle, celle qui ne compresse pas vos fichiers et respecte votre vie priv&#233;e, c'est LocalSend.
</description>
    </item>
    <item>
      <title>TikTok is letting users control how much AI content they see</title>
      <link>https://www.theverge.com/news/823775/tiktok-ai-generated-content-controls-manage-topics</link>
      <pubDate>2025-11-19T08:06:49-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=823775</guid>
      <description>TikTok is testing a new control that will let users manage how much AI-generated content appears in their video feed on the app. To help make the filter more effective, the app will also soon start adding invisible watermarks to AI content. The new AI slider will appear along with TikTok&#8217;s other content controls under [&#8230;]</description>
    </item>
    <item>
      <title>Black Friday Garmin watch deals are officially live &#8211; including best-ever discounts on this 'perfect' Fenix 8 smartwatch</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/black-friday-garmin-watch-deals-are-officially-live-including-best-ever-discounts-on-this-years-perfect-fenix-8-smartwatch</link>
      <pubDate>Wed, 19 Nov 2025 13:06:42 +0000</pubDate>
      <guid isPermaLink="false">vtyDEZryVDGfLZRu44yTdS</guid>
      <description>Why wait for Black Friday? These Garmin watch deals have already started.</description>
    </item>
    <item>
      <title>Want a Ring doorbell but don't want the subscription? Check out this great half-price alternative instead</title>
      <link>https://www.techradar.com/home/smart-home/want-a-ring-doorbell-but-dont-want-the-subscription-check-out-this-great-half-price-alternative-instead</link>
      <pubDate>Wed, 19 Nov 2025 13:03:04 +0000</pubDate>
      <guid isPermaLink="false">fWq4PEpHz4arnqtHyaXJFB</guid>
      <description>There's no need to buy a subscription plan when the Eufy Video Doorbell dual captures crisp footage from its twin cameras and saves it locally on an SD card.</description>
    </item>
    <item>
      <title>Comment Xiaomi va &#171; pr&#233;parer l&#8217;arriv&#233;e du v&#233;hicule &#233;lectrique &#187; en France</title>
      <link>https://www.frandroid.com/marques/xiaomi/2873321_comment-xiaomi-va-preparer-larrivee-du-vehicule-electrique-en-france</link>
      <pubDate>Wed, 19 Nov 2025 13:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2873321_comment-xiaomi-va-preparer-larrivee-du-vehicule-electrique-en-france</guid>
      <description>
Xiaomi France confirme que les Xiaomi Stores qui reviennent en France servent, entre autres, &#224; pr&#233;parer l'arriv&#233;e des voitures &#233;lectriques de la marque. On commence par la SU7 ou le YU7 ?
</description>
    </item>
    <item>
      <title>James Gunn Says Another Hero Isn&#8217;t Showing Up for &#8216;Man of Tomorrow&#8217;</title>
      <link>https://gizmodo.com/superman-man-of-tomorrow-doctor-fate-james-gunn-2000687859</link>
      <pubDate>Wed, 19 Nov 2025 13:00:32 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687859</guid>
      <description>Plus, 'Twisted Metal' is back for round 3.</description>
    </item>
    <item>
      <title>Thrustmaster ESWAP X2 H.E. Controller Review</title>
      <link>https://www.wired.com/review/thrustmaster-eswap-x2-he-controller/</link>
      <pubDate>Wed, 19 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">691b0d569d626bbc630cd181</guid>
      <description>Harder, better, faster, modular. This truly amazing pro-tier controller can be finessed to do just about anything. But it will cost you.</description>
    </item>
    <item>
      <title>Screw it, I&#8217;m installing Linux</title>
      <link>https://www.theverge.com/tech/823337/switching-linux-gaming-desktop-cachyos</link>
      <pubDate>2025-11-19T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=823337</guid>
      <description>This time I'm really going to do it. I am going to put Linux on my gaming PC. Calling it now. 2026 is the year of Linux on the desktop. Or at least on mine. Linux has been a perfectly viable desktop OS for ages. But gaming on Linux is now viable, too. Valve's hard [&#8230;]</description>
    </item>
    <item>
      <title>Credit risk automation platform Kaaj raises $3.8M seed from Kindred Ventures</title>
      <link>https://techcrunch.com/2025/11/19/credit-risk-automation-platform-kaaj-raises-3-8m-seed-from-kindred-ventures/</link>
      <pubDate>Wed, 19 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069042</guid>
      <description>Kaaj announced on Wednesday a $3.8 million seed round from Kindred Ventures and Better Tomorrow Ventures.</description>
    </item>
    <item>
      <title>I tested Caira, the first Nano Banana AI camera &#8211; now I&#8217;m cancelling my Lightroom subscription</title>
      <link>https://www.techradar.com/cameras/caira-camera-review</link>
      <pubDate>Wed, 19 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">8CwYaFPyeDHe59ZgyNGHAk</guid>
      <description>The Caira claims to fuse proper camera engineering with Google&#8217;s new &#8216;Nano Banana&#8217; AI. It mostly succeeds, but also makes you wonder if you&#8217;ve just been replaced by your own camera.</description>
    </item>
    <item>
      <title>The classroom lab I still remember</title>
      <link>https://www.fastcompany.com/91444498/the-classroom-lab-i-still-remember</link>
      <pubDate>2025-11-19T13:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444498/the-classroom-lab-i-still-remember</guid>
      <description>A physics lesson and a blueprint for teaching.
Across&#160;nearly four&#160;decades as a teacher, principal, superintendent,&#160;funder, and now leader of a large education nonprofit organization, the experience that most shaped my view of learning&#160;wasn&#8217;t&#160;a grand reform or a shiny new program. It was a Friday physics lab in Brooklyn. My students predicted a graph that&#160;couldn&#8217;t&#160;exist&#8212;a vertical line for velocity and time. What followed was confusion, debate, trial, and error. And then discovery: Velocity&#160;requires&#160;both displacement and time. That brief struggle taught me, the teacher at the time, more about h...</description>
    </item>
    <item>
      <title>Gen Z daters want deeper connections, but some use AI to date, Hinge reports</title>
      <link>https://mashable.com/article/gen-z-daters-using-ai-communication-gap-hinge-report</link>
      <pubDate>Wed, 19 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">03Z20DlT2lEys0CcwhC80FU</guid>
      <description>Hinge's latest report states there's a communication gap, especially between straight men and women.</description>
    </item>
    <item>
      <title>Vie num&#233;rique | Mot de passe&#160;: &#171;&#160;admin&#160;&#187; ou &#171;&#160;123456&#160;&#187;</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-11-19/vie-numerique/mot-de-passe-admin-ou-123456.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 19 Nov 2025 08:00:00 -0500</pubDate>
      <guid isPermaLink="false">27d366e3141a399790e31eb660223edd</guid>
      <description>Les habitudes en mati&#232;re de cybers&#233;curit&#233; stagnent au Canada. Malgr&#233; les mises en garde r&#233;currentes, une majorit&#233; de Canadiens n&#233;glige toujours les mesures les plus &#233;l&#233;mentaires de protection de leur vie num&#233;rique. C&#8217;est ce que r&#233;v&#232;le l&#8217;&#233;dition&#160;2025 d&#8217;un sondage annuel effectu&#233; par la firme de cybers&#233;curit&#233; NordPass.</description>
    </item>
    <item>
      <title>Quel casque choisir pour votre Nintendo Switch 2 en 2025&#8201;?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-gaming/832492_selection-meilleurs-casques-nintendo-switch</link>
      <pubDate>Wed, 19 Nov 2025 12:59:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-gaming/832492_selection-meilleurs-casques-nintendo-switch</guid>
      <description>
En tant que console de jeux hybride, la Nintendo Switch profitera fortement d'un casque ou d'&#233;couteurs si vous jouez en mode portable.
</description>
    </item>
    <item>
      <title>Le secret de polichinelle n&#8217;est plus : voici le nom rigolo d&#8217;Android 17</title>
      <link>https://www.frandroid.com/marques/google/2875641_le-secret-de-polichinelle-nest-plus-voici-le-nom-rigolo-dandroid-17</link>
      <pubDate>Wed, 19 Nov 2025 12:55:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2875641_le-secret-de-polichinelle-nest-plus-voici-le-nom-rigolo-dandroid-17</guid>
      <description>
Un indice contenu dans du code d'Android Canary nous confirme quel sera vraisemblablement le nom de code d'Android 17. Une nouvelle fois, il est tr&#232;s sucr&#233; et rigolo, dans la plus pure tradition de Google en la mati&#232;re.
</description>
    </item>
    <item>
      <title>I&#8217;ve spent hundreds of hours ranking the best Switch 2 games, and many of them are now on sale as part of early Black Friday sales</title>
      <link>https://www.techradar.com/gaming/nintendo/black-friday-switch-2-games-deals-round-up</link>
      <pubDate>Wed, 19 Nov 2025 12:50:09 +0000</pubDate>
      <guid isPermaLink="false">k5DvTcrC8RCYPH32hPW4xS</guid>
      <description>These best Switch 2 games are on sale for Black Friday. Here's the best deals on games like Split Fiction, NBA 2K26, and more.</description>
    </item>
    <item>
      <title>At this Black Friday price, this is the cheapest phone I would actually recommend buying</title>
      <link>https://www.techradar.com/seasonal-sales/at-this-black-friday-price-this-is-the-cheapest-phone-i-would-actually-recommend-buying</link>
      <pubDate>Wed, 19 Nov 2025 12:49:54 +0000</pubDate>
      <guid isPermaLink="false">5wdrSL5XzREwjPLtgDz93V</guid>
      <description>The CMF Phone 2 is the cheapest handset I&#8217;d actually recommend, and it&#8217;s even cheaper with this early Black Friday deal.</description>
    </item>
    <item>
      <title>Europe is scaling back its landmark privacy and AI laws</title>
      <link>https://www.theverge.com/news/823750/european-union-ai-act-gdpr-changes</link>
      <pubDate>2025-11-19T07:47:09-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=823750</guid>
      <description>After years of staring down the world&#8217;s biggest tech companies and setting the bar for tough regulation worldwide, Europe has blinked. Under intense pressure from industry and the US government, Brussels is stripping protections from its flagship General Data Protection Regulation (GDPR) &#8212; including simplifying its infamous cookie permission pop-ups &#8212;&#160;and relaxing or delaying landmark [&#8230;]...</description>
    </item>
  </channel>
</rss>
