<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 07 Jan 2026 08:37:14 GMT</lastBuildDate>
    <item>
      <title>Razer Project AVA : le Tamagotchi du futur est une &#171;&#160;waifu&#160;&#187; holographique qui vous juge quand vous jouez</title>
      <link>https://www.frandroid.com/marques/2932591_razer-project-ava-le-tamagotchi-du-futur-est-une-waifu-holographique-qui-vous-juge-quand-vous-jouez</link>
      <pubDate>Wed, 07 Jan 2026 08:34:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2932591_razer-project-ava-le-tamagotchi-du-futur-est-une-waifu-holographique-qui-vous-juge-quand-vous-jouez</guid>
      <description>
C'est un peu effrayant. Razer vient de d&#233;voiler Project AVA, un compagnon IA enferm&#233; dans un &#233;cran transparent de 5,5 pouces. Il tourne sous Grok (xAI), analyse votre &#233;cran en temps r&#233;el et promet de vous aider &#224; gagner vos parties class&#233;es.
</description>
    </item>
    <item>
      <title>Fin de l&#8217;ADSL : Orange accorde un sursis inattendu &#224; des millions de foyers fran&#231;ais</title>
      <link>https://www.frandroid.com/marques/orange/2932521_fin-de-ladsl-orange-accorde-un-sursis-inattendu-a-des-millions-de-foyers-francais</link>
      <pubDate>Wed, 07 Jan 2026 08:32:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/orange/2932521_fin-de-ladsl-orange-accorde-un-sursis-inattendu-a-des-millions-de-foyers-francais</guid>
      <description>
Apr&#232;s un tempo soutenu ces derni&#232;res ann&#233;es, le rythme de d&#233;ploiement de la fibre a largement baiss&#233; ces derniers mois, &#224; tel point qu&#8217;Orange vient de repousser son calendrier de fermeture de l&#8217;ADSL d&#8217;un an pour des milliers de communes.
</description>
    </item>
    <item>
      <title>Razer enferme un compagnon IA dans un bocal connect&#233; avec son &#233;trange projet Ava</title>
      <link>https://www.01net.com/actualites/razer-enferme-un-compagnon-ia-dans-un-bocal-connecte-avec-son-etrange-projet-ava.html</link>
      <pubDate>Wed, 07 Jan 2026 08:30:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318498</guid>
      <description>Amusant ou glauque, chacun aura son opinion sur le projet Ava, derni&#232;re folie sign&#233;e Razer qui enferme un bot IA dans une sorte de bocal connect&#233;. Les compagnons propos&#233;s, d'un go&#251;t plus ou moins douteux, donnent des conseils sur tous les sujets, y compris pour jouer plus efficacement.</description>
    </item>
    <item>
      <title>Philips Hue Will Soon Let Your Lights Work Together for Scenes</title>
      <link>https://gizmodo.com/philips-hue-will-soon-let-your-lights-work-together-for-scenes-2000706444</link>
      <pubDate>Wed, 07 Jan 2026 08:30:20 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000706444</guid>
      <description>It's now far easier to set grouped Philips Hue lights up in scenes.</description>
    </item>
    <item>
      <title>It turns out I&#8217;ve been using my Hue lights all wrong</title>
      <link>https://www.theverge.com/tech/857250/philips-hue-spatial-aware-smart-lighting-feature</link>
      <pubDate>2026-01-07T03:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=857250</guid>
      <description>Color-changing lights are a lot of fun, but it can be hard to figure out how to best use them in your home. Most smart lighting companies offer pre-designed scenes to help you light your space, but the lights don't know where they are physically in your home, and the effect can get diluted. Philips [&#8230;]</description>
    </item>
    <item>
      <title>The Philips Hue app can now customize lighting scenes so they suit the layout of your rooms</title>
      <link>https://www.techradar.com/home/smart-lights/the-philips-hue-app-can-now-customize-lighting-scenes-so-they-suit-the-layout-of-your-rooms</link>
      <pubDate>Wed, 07 Jan 2026 08:30:00 +0000</pubDate>
      <guid isPermaLink="false">xfEjXAbzHoKKZWrpFT5Uwf</guid>
      <description>Hue SpatialAware is a new augmented reality feature that considers the location of your bulbs and lamps when applying a scene.</description>
    </item>
    <item>
      <title>Gr&#226;ce aux Soldes 2026 cette cam&#233;ra de surveillance 2K motoris&#233;e avec d&#233;tection et suivi co&#251;te moins de 20 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2931529_grace-aux-soldes-2026-cette-camera-de-surveillance-2k-motorisee-avec-detection-et-suivi-coute-moins-de-20-e</link>
      <pubDate>Wed, 07 Jan 2026 08:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931529_grace-aux-soldes-2026-cette-camera-de-surveillance-2k-motorisee-avec-detection-et-suivi-coute-moins-de-20-e</guid>
      <description>
Pendant les Soldes d'hiver 2026, vous pouvez vous procurer la petite cam&#233;ra motoris&#233;e TP-Link Tapo TC71 pour seulement 19,99 euros au lieu de 39,99 euros.
</description>
    </item>
    <item>
      <title>EarFun Air Pro 4+ : traduction IA et son Lossless &#224; moins de 100 euros : le nouveau challenger du milieu de gamme ? [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/2931115_earfun-air-pro-4-traduction-ia-et-son-lossless-a-moins-de-100-euros-le-nouveau-challenger-du-milieu-de-gamme</link>
      <pubDate>Wed, 07 Jan 2026 08:24:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2931115_earfun-air-pro-4-traduction-ia-et-son-lossless-a-moins-de-100-euros-le-nouveau-challenger-du-milieu-de-gamme</guid>
      <description>
Est-il n&#233;cessaire de d&#233;penser 200 ou 300 euros dans une paire d&#8217;&#233;couteurs pour profiter d&#8217;un son de qualit&#233; ? EarFun a la r&#233;ponse et c&#8217;est non. Avec ses Air Pro 4+, la marque propose pour moins de 100 euros non seulement des &#233;couteurs de tr&#232;s bonne facture, mais aussi un traducteur instantan&#233; IA.&#160;
</description>
    </item>
    <item>
      <title>Moto Sound Flow : la premi&#232;re enceinte portable de Motorola mise sur Bose et sa connectivit&#233; Wi&#8209;Fi</title>
      <link>https://www.frandroid.com/marques/motorola/2932563_moto-sound-flow-la-premiere-enceinte-portable-de-motorola-mise-sur-bose-et-sa-connectivite-wi%e2%80%91fi</link>
      <pubDate>Wed, 07 Jan 2026 08:24:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/motorola/2932563_moto-sound-flow-la-premiere-enceinte-portable-de-motorola-mise-sur-bose-et-sa-connectivite-wi%e2%80%91fi</guid>
      <description>
Motorola enrichit son univers d&#8217;accessoires connect&#233;s avec la Moto Sound Flow, une enceinte portable qui profite d&#8217;un partenariat audio avec Bose, de connectivit&#233;s avanc&#233;es et int&#233;gration &#224; la plateforme maison Moto Things.
</description>
    </item>
    <item>
      <title>Voici &#224; quoi ressemble le successeur de Blackberry de pr&#232;s : le retour du clavier physique sur smartphone ?</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2932187_voici-a-quoi-ressemble-le-successeur-de-blackberry-de-pres-le-retour-du-clavier-physique-sur-smartphone</link>
      <pubDate>Wed, 07 Jan 2026 08:20:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2932187_voici-a-quoi-ressemble-le-successeur-de-blackberry-de-pres-le-retour-du-clavier-physique-sur-smartphone</guid>
      <description>
Le Clicks Communicator &#233;tait expos&#233; au CES 2026. Sans pouvoir le toucher malheureusement, on a pris quelques photos de ce petit smartphone &#224; clavier physique.
</description>
    </item>
    <item>
      <title>Windows 11 affiche les applis Android de votre smartphone en plein &#233;cran sur votre PC</title>
      <link>https://www.01net.com/actualites/windows-11-affiche-les-applis-android-de-votre-smartphone-en-plein-ecran-sur-votre-pc.html</link>
      <pubDate>Wed, 07 Jan 2026 08:19:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318512</guid>
      <description>Microsoft vient de mettre &#224; jour son application Mobile connect&#233;. L&#8217;utilitaire est maintenant capable d&#8217;afficher les applications Android de votre smartphone sur la quasi-totalit&#233; de l&#8217;&#233;cran de votre PC.</description>
    </item>
    <item>
      <title>Not&#233;e 9/10 et sacr&#233;e meilleure barre de son 2025 par Frandroid, la Sennheiser Dolby Atmos 7.1.4 (400 W RMS) profite de -46 % pendant les Soldes 2026</title>
      <link>https://www.frandroid.com/bons-plans/2930413_notee-9-10-et-sacree-meilleure-barre-de-son-2025-par-frandroid-la-sennheiser-dolby-atmos-7-1-4-400-w-rms-profite-de-46-pendant-les-soldes-2026</link>
      <pubDate>Wed, 07 Jan 2026 08:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930413_notee-9-10-et-sacree-meilleure-barre-de-son-2025-par-frandroid-la-sennheiser-dolby-atmos-7-1-4-400-w-rms-profite-de-46-pendant-les-soldes-2026</guid>
      <description>
La barre de son Sennheiser Ambeo Plus est un concentr&#233; de puissance pour procurer une exp&#233;rience audio haut de gamme, &#224; retrouver en soldes &#224; 799 euros sur Fnac et Darty au lieu de 1 499 euros au lancement.
</description>
    </item>
    <item>
      <title>Valve ne bouge pas, Lenovo attaque : la Legion Go 2 est le vrai Steam Deck 2</title>
      <link>https://www.frandroid.com/marques/lenovo/2932517_valve-ne-bouge-pas-lenovo-attaque-la-legion-go-2-est-le-vrai-steam-deck-2</link>
      <pubDate>Wed, 07 Jan 2026 08:13:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lenovo/2932517_valve-ne-bouge-pas-lenovo-attaque-la-legion-go-2-est-le-vrai-steam-deck-2</guid>
      <description>
Valve ne sortira pas de Steam Deck 2 cette ann&#233;e ? Pas grave. Lenovo vient de le faire &#224; sa place au CES 2026. La Legion Go 2 abandonne Windows pour l'OS de Valve, tout en gardant son &#233;cran OLED g&#233;ant et sa puce surpuissante. Le probl&#232;me ? Lenovo a d&#233;cid&#233; que Linux &#233;tait un produit de luxe.
</description>
    </item>
    <item>
      <title>Le coup de g&#233;nie d&#8217;IKEA : ces enceintes connect&#233;es &#224; 5 euros vont se vendre comme des petits pains</title>
      <link>https://www.frandroid.com/marques/ikea/2932029_le-coup-de-genie-dikea-ces-enceintes-connectees-a-5-euros-vont-se-vendre-comme-des-petits-pains</link>
      <pubDate>Wed, 07 Jan 2026 08:05:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/ikea/2932029_le-coup-de-genie-dikea-ces-enceintes-connectees-a-5-euros-vont-se-vendre-comme-des-petits-pains</guid>
      <description>
Les IKEA Kallsup sont de nouvelles enceintes connect&#233;es &#224; 4,99 euros l'unit&#233;. Vous pouvez en connecter plusieurs &#224; la fois pour cr&#233;er une belle ambiance sonore chez vous.
</description>
    </item>
    <item>
      <title>G&#233;n&#233;ration et diffusion d&#8217;images sexuelles ill&#233;gales&#160;: Grok vis&#233; par des r&#233;gulateurs partout dans le monde</title>
      <link>https://www.01net.com/actualites/generation-et-diffusion-dimages-sexuelles-illegales-grok-vise-par-des-regulateurs-partout-dans-le-monde.html</link>
      <pubDate>Wed, 07 Jan 2026 08:02:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318496</guid>
      <description>La g&#233;n&#233;ration d'images p&#233;dopornographiques par Grok ainsi que la capacit&#233; du bot &#224; cr&#233;er et &#224; diffuser des images &#224; caract&#232;re sexuel non consenties risquent d'&#234;tre une grosse &#233;pine dans le pied d'Elon Musk. Plusieurs juridictions, aux &#201;tats-Unis, en Europe et ailleurs dans le monde, ont l'intention de lancer des enqu&#234;tes sur ces pratiques.</description>
    </item>
    <item>
      <title>Voici quels sont les trois meilleurs smartphones de 2025</title>
      <link>https://www.frandroid.com/guide-dachat/2928987_voici-quels-sont-les-trois-meilleurs-smartphones-de-2025</link>
      <pubDate>Wed, 07 Jan 2026 08:00:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2928987_voici-quels-sont-les-trois-meilleurs-smartphones-de-2025</guid>
      <description>
L'ann&#233;e 2025 a &#233;t&#233; un tournant, marqu&#233;e par l'int&#233;gration massive de l'IA dans nos smartphones. Apr&#232;s avoir test&#233; et compar&#233; des dizaines de mod&#232;les cette ann&#233;e, nous avons s&#233;lectionn&#233; la cr&#232;me de la cr&#232;me. Voici notre podium des trois smartphones incontournables de 2025.
</description>
    </item>
    <item>
      <title>CES Live Blog, Day 3: Even More of the Coolest Tech We&#8217;ve Seen</title>
      <link>https://www.wired.com/live/ces-2026-live-blog/</link>
      <pubDate>Wed, 07 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">6957fd7ea2ad6e107579ae74</guid>
      <description>Read our live updates from CES 2026 in Las Vegas to see the latest consumer gadgetry in all of its chatbot-enabled, sensor-packed, AI-infused glory.</description>
    </item>
    <item>
      <title>Roborock Saros 10 : ce robot-aspirateur petit, mais puissant perd 550 euros chez Darty et la Fnac &#224; l&#8217;occasion des soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2930267_roborock-saros-10-ce-robot-aspirateur-petit-mais-puissant-perd-550-euros-chez-darty-et-la-fnac-a-loccasion-des-soldes-dhiver</link>
      <pubDate>Wed, 07 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930267_roborock-saros-10-ce-robot-aspirateur-petit-mais-puissant-perd-550-euros-chez-darty-et-la-fnac-a-loccasion-des-soldes-dhiver</guid>
      <description>
Le Roborock Saros 10 se d&#233;marque par une petite taille, mais une forte puissance d'aspiration de 22 000 Pa. Tellement puissant qu'il se permet d'aspirer 550 euros de son prix chez Darty et &#224; la Fnac &#224; l'occasion des soldes d'hiver.
</description>
    </item>
    <item>
      <title>Klipsch The Fives II, Sevens II et Nines II : les enceintes actives passent &#224; l&#8217;&#232;re Dolby Atmos et Dirac</title>
      <link>https://www.frandroid.com/marques/klipsch/2932313_klipsch-the-fives-ii-sevens-ii-et-nines-ii-les-enceintes-actives-passent-a-lere-dolby-atmos-et-dirac</link>
      <pubDate>Wed, 07 Jan 2026 07:56:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/klipsch/2932313_klipsch-the-fives-ii-sevens-ii-et-nines-ii-les-enceintes-actives-passent-a-lere-dolby-atmos-et-dirac</guid>
      <description>
Pour ses 80 ans, Klipsch inaugure une nouvelle g&#233;n&#233;ration d&#8217;enceintes amplifi&#233;es avec les The Fives II, The Sevens II et The Nines II, d&#233;voil&#233;es au CES 2026 et pens&#233;es pour conjuguer h&#233;ritage pavillonn&#233; et &#233;lectronique de derni&#232;re g&#233;n&#233;ration.
</description>
    </item>
    <item>
      <title>&#192; l&#8217;occasion des soldes d&#8217;hiver, le Lenovo Yoga Slim 7 perd presque 25 % de son prix chez Darty et la Fnac, mais conserve sa superbe dalle OLED</title>
      <link>https://www.frandroid.com/bons-plans/2930583_a-loccasion-des-soldes-dhiver-le-lenovo-yoga-slim-7-perd-presque-25-de-son-prix-chez-darty-et-la-fnac-mais-conserve-sa-superbe-dalle-oled</link>
      <pubDate>Wed, 07 Jan 2026 07:55:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930583_a-loccasion-des-soldes-dhiver-le-lenovo-yoga-slim-7-perd-presque-25-de-son-prix-chez-darty-et-la-fnac-mais-conserve-sa-superbe-dalle-oled</guid>
      <description>
Avec sa dalle OLED de 14,5 pouces et sa batterie d'une autonomie de 15 heures, ce Lenovo Yoga Slim 7 pourra vous permettre de savourer vos films et s&#233;ries pr&#233;f&#233;r&#233;s dans les meilleures conditions. Du c&#244;t&#233; de la Fnac et Darty, il passe de 1 099 euros &#224; 829 euros.
</description>
    </item>
    <item>
      <title>Samsung et Lacoste se rejoignent dans ce pack sold&#233; &#224; -30% avec un smartphone Galaxy A56, un casque The Blend et un chargeur 25W</title>
      <link>https://www.frandroid.com/bons-plans/2930707_samsung-et-lacoste-se-rejoignent-dans-ce-pack-solde-a-30-avec-un-smartphone-galaxy-a56-un-casque-the-blend-et-un-chargeur-25w</link>
      <pubDate>Wed, 07 Jan 2026 07:50:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930707_samsung-et-lacoste-se-rejoignent-dans-ce-pack-solde-a-30-avec-un-smartphone-galaxy-a56-un-casque-the-blend-et-un-chargeur-25w</guid>
      <description>
C'est un pack un peu atypique que proposent Fnac et Darty pendant les Soldes : d'un c&#244;t&#233;, le Samsung Galaxy A56 et son chargeur 25 W, de l'autre, un casque Lacoste The Blend, le tout pour 439 euros au lieu de 632 euros.
</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : voici les meilleures offres &#224; ne pas rater pour cette premi&#232;re journ&#233;e de promotions</title>
      <link>https://www.frandroid.com/bons-plans/2931731_top-depart-soldes-dhiver-2026-les-meilleures-offres-en-direct</link>
      <pubDate>Wed, 07 Jan 2026 07:49:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931731_top-depart-soldes-dhiver-2026-les-meilleures-offres-en-direct</guid>
      <description>
On a bien mang&#233; pendant les f&#234;tes, la nouvelle ann&#233;e est pass&#233;e et il a neig&#233; dans presque toute la France : c'est maintenant l'heure des soldes d'hiver. De plus, cette &#233;dition risque d'&#234;tre particuli&#232;rement int&#233;ressante pour s'&#233;quiper &#224; de bons prix avant la hausse annonc&#233;e en 2026. 
</description>
    </item>
    <item>
      <title>Fin de l&#8217;ADSL&#160;: Orange reporte la fermeture commerciale, la fibre n&#8217;est pas compl&#232;tement d&#233;ploy&#233;e</title>
      <link>https://www.01net.com/actualites/fin-de-ladsl-orange-reporte-la-fermeture-commerciale-la-fibre-nest-pas-completement-deployee.html</link>
      <pubDate>Wed, 07 Jan 2026 07:30:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318493</guid>
      <description>Sursis pour le r&#233;seau cuivre d'Orange. Dans 8&#160;000 communes, il sera possible de souscrire &#224; un abonnement ADSL chez l'op&#233;rateur historique jusqu'au 31 janvier 2027, un an apr&#232;s la date d'origine. En revanche, il est toujours pr&#233;vu que l'ADSL s'&#233;teigne compl&#232;tement en 2030.</description>
    </item>
    <item>
      <title>Plus besoin d&#8217;attendre Apple&#160;: cet accessoire peut rendre votre MacBook tactile</title>
      <link>https://www.01net.com/actualites/plus-besoin-attendre-apple-accessoire-rendre-macbook-tactile.html</link>
      <pubDate>Wed, 07 Jan 2026 07:10:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318503</guid>
      <description>Alors que les rumeurs &#233;voquent l'arriv&#233;e d'un premier MacBook tactile cette ann&#233;e, un accessoire baptis&#233; &#171; Magic Screen &#187; propose d&#233;j&#224; d&#8217;ajouter cette fonctionnalit&#233; aux mod&#232;les actuels.</description>
    </item>
    <item>
      <title>30% Off Canon Promo Codes | January 2026</title>
      <link>https://www.wired.com/story/canon-promo-code/</link>
      <pubDate>Wed, 07 Jan 2026 07:10:00 +0000</pubDate>
      <guid isPermaLink="false">67252234563a280b6ad5ef8d</guid>
      <description>Save an extra 10% or 30% with Canon coupon codes, plus up to $1,600 on cameras, printers, and more this January.</description>
    </item>
    <item>
      <title>Assurance et pr&#234;t en ligne&#160;: voici ce qui change pour les consommateurs</title>
      <link>https://www.01net.com/actualites/assurance-et-pret-en-ligne-voici-ce-qui-change-pour-les-consommateurs.html</link>
      <pubDate>Wed, 07 Jan 2026 07:01:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318404</guid>
      <description>Dans six mois, les consommateurs b&#233;n&#233;ficieront de davantage de droits s'ils souscrivent &#224; des services financiers &#224; distance. Voici ce qu'il faut en retenir.</description>
    </item>
    <item>
      <title>Therabody Promo Codes: 15% Off January 2026</title>
      <link>https://www.wired.com/story/therabody-promo-code/</link>
      <pubDate>Wed, 07 Jan 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">674632f1989e3c09f802f92c</guid>
      <description>Save on the science-backed devices you&#8217;ve been eyeing with 15% off Theragun discount code and 30% off other great deals.</description>
    </item>
    <item>
      <title>Tuft &amp; Needle Promo Codes: 20% Off | January 2026</title>
      <link>https://www.wired.com/story/tuft-and-needle-promo-code/</link>
      <pubDate>Wed, 07 Jan 2026 06:50:00 +0000</pubDate>
      <guid isPermaLink="false">681239065a838ce371cf4250</guid>
      <description>Save 20% on best-selling mattresses with our top Tuft &amp; Needle coupon codes.</description>
    </item>
    <item>
      <title>20% Off Home Depot Promo Code</title>
      <link>https://www.wired.com/story/home-depot-promo-code/</link>
      <pubDate>Wed, 07 Jan 2026 06:45:00 +0000</pubDate>
      <guid isPermaLink="false">682755a99198909d2f7f6652</guid>
      <description>Save up to 50% today with the latest Home Depot coupons for appliances, power tools, and more holiday deals this month.</description>
    </item>
    <item>
      <title>LegalZoom Promo Code: Exclusive 10% Off LLC Formations</title>
      <link>https://www.wired.com/story/legalzoom-promo-code/</link>
      <pubDate>Wed, 07 Jan 2026 06:40:00 +0000</pubDate>
      <guid isPermaLink="false">67bccd2587d7d823b73305d9</guid>
      <description>Save on top services at LegalZoom, like LLC registration, incorporation, estate plans, and more with coupons and deals from WIRED.</description>
    </item>
  </channel>
</rss>
