<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 02 Dec 2025 10:49:38 GMT</lastBuildDate>
    <item>
      <title>&#171; L&#8217;&#233;cran interne est si mou que j&#8217;ai r&#233;ussi &#224; faire de profondes entailles &#187;, voici la premi&#232;re prise en main du Samsung Galaxy Z TriFold</title>
      <link>https://www.frandroid.com/marques/2894853_le-pliant-definitif-premiere-prise-en-main-du-samsung-galaxy-z-trifold</link>
      <pubDate>Tue, 02 Dec 2025 10:43:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2894853_le-pliant-definitif-premiere-prise-en-main-du-samsung-galaxy-z-trifold</guid>
      <description>
Oubliez tout ce que vous savez sur le Z Fold 7. Le Galaxy Z TriFold arrive et il change les r&#232;gles du jeu. &#201;cran immense de 10 pouces, mode DeX natif et&#8230; un chargeur dans la bo&#238;te (incroyable, non ?). Mais attention, &#224; pr&#232;s de 3000 dollars, la moindre rayure sur cet &#233;cran ultra-tendre va vous co&#251;ter tr&#232;s cher. Un des premiers YouTubers a mis la main dessus.
...</description>
    </item>
    <item>
      <title>Bascule chez BYD : l&#8217;invasion internationale commence vraiment et les voitures &#233;lectriques se vendent mieux que les hybrides</title>
      <link>https://www.frandroid.com/marques/byd/2895049_bascule-chez-byd-linvasion-internationale-commence-vraiment-et-les-voitures-electriques-se-vendent-mieux-que-les-hybrides</link>
      <pubDate>Tue, 02 Dec 2025 10:34:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2895049_bascule-chez-byd-linvasion-internationale-commence-vraiment-et-les-voitures-electriques-se-vendent-mieux-que-les-hybrides</guid>
      <description>
Si les r&#233;sultats de BYD &#233;taient en demi-teinte au 3&#7497; trimestre 2025, les choses semblent s&#8217;&#234;tre arrang&#233;es. Le g&#233;ant chinois a vu ses ventes de voitures &#233;lectriques s&#8217;envoler en novembre, et il cartonne surtout &#224; l&#8217;&#233;tranger.
</description>
    </item>
    <item>
      <title>Swiss government urges people to ditch Microsoft 365 and others due to lack of proper encryption</title>
      <link>https://www.techradar.com/pro/security/swiss-government-urges-people-to-ditch-microsoft-365-and-others-due-to-lack-of-proper-encryption</link>
      <pubDate>Tue, 02 Dec 2025 10:20:00 +0000</pubDate>
      <guid isPermaLink="false">KS4yQgQENDccZRhbHD7iWS</guid>
      <description>A lack of E2EE and sufficient transparency has Switzerland worried about American hyperscalers.</description>
    </item>
    <item>
      <title>Jeep arrive fort en Europe avec ces deux nouvelles voitures &#233;lectriques pratiques qui sentent bon l&#8217;aventure</title>
      <link>https://www.frandroid.com/marques/jeep/2894977_jeep-arrive-fort-en-europe-avec-ces-deux-nouvelles-voitures-electriques-pratiques-qui-sentent-bon-laventure</link>
      <pubDate>Tue, 02 Dec 2025 10:14:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/jeep/2894977_jeep-arrive-fort-en-europe-avec-ces-deux-nouvelles-voitures-electriques-pratiques-qui-sentent-bon-laventure</guid>
      <description>
Si Jeep commercialise d&#233;j&#224; son Avenger, il veut &#233;toffer encore sa gamme de voitures &#233;lectriques en Europe. Au programme, deux SUV aux philosophies bien diff&#233;rentes qui verront le jour en 2026.
</description>
    </item>
    <item>
      <title>Taill&#233; pour la productivit&#233;, ce Dell 16 sur&#233;quip&#233; (Ryzen AI 7, 32 Go RAM, SSD 1 To) et dop&#233; &#224; l&#8217;IA s&#8217;all&#232;ge de 200 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2895025_taille-pour-la-productivite-ce-dell-16-surequipe-ryzen-ai-7-32-go-ram-ssd-1-to-et-dope-a-lia-sallege-de-200-e</link>
      <pubDate>Tue, 02 Dec 2025 10:12:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2895025_taille-pour-la-productivite-ce-dell-16-surequipe-ryzen-ai-7-32-go-ram-ssd-1-to-et-dope-a-lia-sallege-de-200-e</guid>
      <description>
Avec sa configuration pointue, le Dell 16 DC16256 est clairement un laptop id&#233;al pour le travail et la cr&#233;ation de contenus. Actuellement, la marque le propose en plus &#224; un excellent prix : 749 euros au lieu de 949 euros.
</description>
    </item>
    <item>
      <title>Applications de suivi de r&#232;gles&#160;: la r&#233;pression des fraudes sonne l&#8217;alerte</title>
      <link>https://www.01net.com/actualites/applications-de-suivi-de-regles-la-repression-des-fraudes-sonne-lalerte.html</link>
      <pubDate>Tue, 02 Dec 2025 10:12:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312966</guid>
      <description>Les applis de suivi du cycle menstruel ne doivent pas &#234;tre utilis&#233;es comme des moyens de contraception, rappelle le gendarme fran&#231;ais des consommateurs dans un communiqu&#233; publi&#233; ce mardi 2 d&#233;cembre.</description>
    </item>
    <item>
      <title>Cette nouvelle montre OnePlus profitera d&#8217;une fonction encore in&#233;dite sur les autres montres connect&#233;es</title>
      <link>https://www.frandroid.com/marques/oneplus/2895149_cette-nouvelle-montre-oneplus-profitera-dune-fonction-encore-inedite-sur-les-autres-montres-connectees</link>
      <pubDate>Tue, 02 Dec 2025 10:12:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/oneplus/2895149_cette-nouvelle-montre-oneplus-profitera-dune-fonction-encore-inedite-sur-les-autres-montres-connectees</guid>
      <description>
OnePlus a donn&#233; plus de d&#233;tails sur sa prochaine montre connect&#233;e, la OnePlus Watch Lite, attendue mi-d&#233;cembre. Elle sera notamment capable de se connecter simultan&#233;ment &#224; deux smartphones, dont un iPhone. 
</description>
    </item>
    <item>
      <title>400 apps dans le viseur&#160;: ce nouveau malware cherche &#224; vider votre compte et voler vos cryptos</title>
      <link>https://www.01net.com/actualites/400-apps-viseur-nouveau-malware-cherche-vider-votre-compte-voler-cryptos.html</link>
      <pubDate>Tue, 02 Dec 2025 10:02:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312928</guid>
      <description>Un nouveau malware Android, baptis&#233; Albiriox, permet &#224; des pirates de prendre le contr&#244;le total d&#8217;un smartphone. Le virus laisse surtout les hackers vider les comptes bancaires et les portefeuilles crypto sans &#233;veiller les soup&#231;ons. Il cible plus de 400 applications financi&#232;res.</description>
    </item>
    <item>
      <title>The Enshittification of Plex Is Kicking Off, Starting with Free Roku Users</title>
      <link>https://gizmodo.com/the-enshittification-of-plex-is-kicking-off-starting-with-free-roku-users-2000694283</link>
      <pubDate>Tue, 02 Dec 2025 10:00:40 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000694283</guid>
      <description>And it's just going to get worse from here.</description>
    </item>
    <item>
      <title>Marre de Google Assistant&#8201; sur vos enceintes Home ? Il existe une astuce pour (plus ou moins) forcer le passage sur Gemini</title>
      <link>https://www.frandroid.com/marques/google/2894991_marre-de-google-assistant-sur-vos-enceintes-home-il-existe-une-astuce-pour-plus-ou-moins-forcer-le-passage-sur-gemini</link>
      <pubDate>Tue, 02 Dec 2025 09:49:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2894991_marre-de-google-assistant-sur-vos-enceintes-home-il-existe-une-astuce-pour-plus-ou-moins-forcer-le-passage-sur-gemini</guid>
      <description>
Alors que Google Assistant continue pour le moment de squatter les enceintes intelligentes du g&#233;ant de la recherche, basculer vers la nouvelle IA Gemini n&#8217;a rien de tr&#232;s sorcier... Si vous avez de la chance.
</description>
    </item>
    <item>
      <title>Les voitures &#233;lectriques &#171; officielles &#187; chinoises arrivent en Europe avec une d&#233;cision forte de sens</title>
      <link>https://www.frandroid.com/marques/hongqi/2894907_les-voitures-electriques-officielles-chinoises-arrivent-en-europe-avec-une-decision-forte-de-sens</link>
      <pubDate>Tue, 02 Dec 2025 09:45:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/hongqi/2894907_les-voitures-electriques-officielles-chinoises-arrivent-en-europe-avec-une-decision-forte-de-sens</guid>
      <description>
Les constructeurs chinois arrivent massivement en Europe. Derni&#232;re preuve en date : le constructeur historique du gouvernement chinois, Hongqi, pr&#233;voit de construire une usine sur le Vieux continent.
</description>
    </item>
    <item>
      <title>Windows a du souci &#224; se faire ? Steam franchit un cap historique d&#8217;utilisateurs sur Linux</title>
      <link>https://www.frandroid.com/os/gnu-linux/2894905_windows-a-du-souci-a-se-faire-steam-franchit-un-cap-historique-dutilisateurs-sur-linux</link>
      <pubDate>Tue, 02 Dec 2025 09:43:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/gnu-linux/2894905_windows-a-du-souci-a-se-faire-steam-franchit-un-cap-historique-dutilisateurs-sur-linux</guid>
      <description>
Le syst&#232;me d'exploitation libre s&#233;duit de nouveaux joueurs et s'impose devant macOS en novembre 2025. 
</description>
    </item>
    <item>
      <title>Windows 11 : la grosse mise &#224; jour de novembre est l&#224;, voici toutes les nouveaut&#233;s</title>
      <link>https://www.frandroid.com/marques/microsoft/2894959_windows-11-la-grosse-mise-a-jour-de-novembre-est-la-voici-toutes-les-nouveautes</link>
      <pubDate>Tue, 02 Dec 2025 09:35:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2894959_windows-11-la-grosse-mise-a-jour-de-novembre-est-la-voici-toutes-les-nouveautes</guid>
      <description>
Windows 11 continue de s'am&#233;liorer avec une nouvelle mise &#224; jour riche en fonctionnalit&#233;s, allant de l'am&#233;lioration de l'interface, de nouvelles options de r&#233;cup&#233;ration ou encore des nouveaut&#233;s bienvenues pour les joueurs.
</description>
    </item>
    <item>
      <title>Amazon repousse encore les limites de la livraison avec cette nouveaut&#233;</title>
      <link>https://www.01net.com/actualites/amazon-repousse-limites-livraison-avec-cette-nouveaute.html</link>
      <pubDate>Tue, 02 Dec 2025 09:35:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312930</guid>
      <description>Amazon teste un service de livraison ultra-rapide capable de livrer certains produits en seulement 30 minutes.</description>
    </item>
    <item>
      <title>Google&#8217;s new Nano Banana Pro can turn literally anything into a beautiful infographic</title>
      <link>https://www.fastcompany.com/91448567/google-nano-banana-pro-turns-anything-into-beautiful-infographics</link>
      <pubDate>2025-12-02T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448567/google-nano-banana-pro-turns-anything-into-beautiful-infographics</guid>
      <description>It&#8217;s still not great at generating realistic AI photos, but in this area it excels.
AI image generators used to be terrible at handling text. Even once the models mastered hands with five fingers, the presence of mangled, nonsensical, vaguely Cyrillic-looking text was a dead giveaway that an image was generated by AI.</description>
    </item>
    <item>
      <title>Le nouvel Outlook ne peut plus ouvrir les fichiers Excel en pi&#232;ce jointe</title>
      <link>https://www.01net.com/actualites/le-nouvel-outlook-ne-peut-plus-ouvrir-les-fichiers-excel-en-piece-jointe.html</link>
      <pubDate>Tue, 02 Dec 2025 09:26:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312968</guid>
      <description>Le client de messagerie de Microsoft souffre d&#8217;un &#233;trange bug. Depuis plusieurs jours, chez certains utilisateurs, Outlook est incapable d&#8217;ouvrir les fichiers Excel re&#231;us en pi&#232;ces jointes dans les e-mails. Microsoft est au courant de la situation et travaille sur un correctif.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs c&#226;bles USB-C selon vos besoins ? Notre s&#233;lection</title>
      <link>https://www.frandroid.com/guide-dachat/1911109_quels-sont-les-meilleurs-cables-usb-c-selon-vos-besoins-notre-selection</link>
      <pubDate>Tue, 02 Dec 2025 09:15:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1911109_quels-sont-les-meilleurs-cables-usb-c-selon-vos-besoins-notre-selection</guid>
      <description>Plus que jamais, cette &#232;re de la tech est sous le signe de la connectique USB-C. En effet, l&#8217;Union europ&#233;enne ou encore la France ont impos&#233; cette norme pour tous les nouveaux produits tech lanc&#233;s. &#192; tel point que m&#234;me Apple a d&#251; c&#233;der avec la g&#233;n&#233;ration d&#8217;iPhone&#160;15. Toutefois, les c&#226;bles USB-C ne sont pas [&#8230;]</description>
    </item>
    <item>
      <title>Le Black Friday est termin&#233;, mais voici les offres encore en ligne qui m&#233;ritent votre attention</title>
      <link>https://www.frandroid.com/bons-plans/2894961_le-black-friday-est-termine-mais-voici-les-offres-encore-en-ligne-qui-meritent-votre-attention</link>
      <pubDate>Tue, 02 Dec 2025 09:10:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2894961_le-black-friday-est-termine-mais-voici-les-offres-encore-en-ligne-qui-meritent-votre-attention</guid>
      <description>
C&#8217;est officiel&#8230; Le Black Friday ainsi que le Cyber Monday sont termin&#233;s&#8201;! Toutefois, plusieurs offres sur des produits Tech populaires sont encore valables chez les diff&#233;rents e-commer&#231;ants, pratique pour celles et ceux qui ont loup&#233; le coche.
</description>
    </item>
    <item>
      <title>&#171; Pas d&#8217;autre solution &#187; : 40 % des employ&#233;s sont licenci&#233;s chez l&#8217;historique marque italienne Campagnolo, sp&#233;cialiste du v&#233;lo</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2894993_pas-dautre-solution-40-des-employes-sont-licencies-chez-lhistorique-marque-italienne-campagnolo-specialiste-du-velo</link>
      <pubDate>Tue, 02 Dec 2025 09:02:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2894993_pas-dautre-solution-40-des-employes-sont-licencies-chez-lhistorique-marque-italienne-campagnolo-specialiste-du-velo</guid>
      <description>
Campagnolo engage une restructuration profonde apr&#232;s trois exercices d&#233;ficitaires, avec la suppression de 40 % de ses effectifs &#224; Vicence. La direction affirme que ces mesures, malgr&#233; l&#8217;apport de 10 millions d&#8217;euros de l&#8217;actionnaire, sont devenues indispensables pour assurer la continuit&#233; de ses activit&#233;s.
</description>
    </item>
    <item>
      <title>The Gen Z playbook: What leaders need to know to collaborate better with them</title>
      <link>https://www.fastcompany.com/91442725/gen-z-playbook-leaders-collaboration-strategies</link>
      <pubDate>2025-12-02T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91442725/gen-z-playbook-leaders-collaboration-strategies</guid>
      <description>From the first interview to working together: Gen Z collaboration needs an overhaul. 
Below, Tim Elmore shares five key insights from his new book,&#160;The Future Begins with Z: Nine Strategies to Lead Generation Z as They Disrupt the Workplace.</description>
    </item>
  </channel>
</rss>
