<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 15 Dec 2025 14:30:13 GMT</lastBuildDate>
    <item>
      <title>Nvidia is reportedly weighs ramping up H200 production to meet surging demand in China</title>
      <link>https://techcrunch.com/2025/12/15/nvidia-is-reportedly-weighs-ramping-up-h200-production-to-meet-surging-demand-in-china/</link>
      <pubDate>Mon, 15 Dec 2025 14:28:20 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3075844</guid>
      <description>After successfully lobbying the Trump administration to approve the sales of its H200 chips to China, Nvidia is now thinking of adding capacity to produce more of the chips.</description>
    </item>
    <item>
      <title>Spotify is down for many &#8211;here's what we know so far</title>
      <link>https://www.techradar.com/news/live/spotify-down-december-2025</link>
      <pubDate>Mon, 15 Dec 2025 14:25:06 +0000</pubDate>
      <guid isPermaLink="false">rC4KSQEG3JKAZHo69vpFtg</guid>
      <description>Is Spotify down for you? You're not alone &#8211;many users are reporting problems with the app today.</description>
    </item>
    <item>
      <title>Samsung's P9 microSD Express card for Switch 2 is 40 percent off right now</title>
      <link>https://www.engadget.com/deals/samsungs-p9-microsd-express-card-for-switch-2-is-40-percent-off-right-now-141947128.html?src=rss</link>
      <pubDate>Mon, 15 Dec 2025 14:19:48 +0000</pubDate>
      <guid isPermaLink="false">50325636-eafa-42d9-b1ab-c62966fc036d</guid>
      <description>It was a big day in gaming history when Nintendo finally released its Switch sequel. But the Nintendo Switch 2 lacked many options for microSD Express cards. Samsung helped change that this fall, with the release of its P9 Express series of microSD Express cards, and now one of them is on sale.
Currently, you can pick up the 256GB Samsung P9 Express microSD Express Card for $33, down from $55. The 40 percent discount brings the microSD down to a new all-time low price. That means your new Nintendo Switch 2 gets a lot more memory with transfer speeds reaching 800MB/s. The specs are on par with ...</description>
    </item>
    <item>
      <title>&#171; Courir nu sur le Golden Gate &#187; : le patron de Xpeng veut rattraper Tesla et fait un &#233;tonnant pari avec ses &#233;quipes</title>
      <link>https://www.frandroid.com/marques/xpeng/2910009_courir-nu-sur-le-golden-gate-le-patron-de-xpeng-veut-rattraper-tesla-et-fait-un-etonnant-pari-avec-ses-equipes</link>
      <pubDate>Mon, 15 Dec 2025 14:11:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2910009_courir-nu-sur-le-golden-gate-le-patron-de-xpeng-veut-rattraper-tesla-et-fait-un-etonnant-pari-avec-ses-equipes</guid>
      <description>
He Xiaopeng, PDG et fondateur de Xpeng, est reparti essayer le syst&#232;me de conduite autonome de Tesla (le fameux FSD) aux &#201;tats-Unis. De quoi constater les progr&#232;s en un an, et de motiver ses &#233;quipes pour d&#233;velopper un syst&#232;me performant.
</description>
    </item>
    <item>
      <title>Home Depot reportedly left internal systems at risk for over a year</title>
      <link>https://www.techradar.com/pro/security/home-depot-reportedly-left-internal-systems-at-risk-for-over-a-year</link>
      <pubDate>Mon, 15 Dec 2025 14:05:00 +0000</pubDate>
      <guid isPermaLink="false">arfqdNN6vpnc2MoNVEWcdV</guid>
      <description>Security researcher finds Home Depot GitHub token left behind by mistake for more than a year.</description>
    </item>
    <item>
      <title>Nvidia Becomes a Major Model Maker With Nemotron 3</title>
      <link>https://www.wired.com/story/nvidia-becomes-major-model-maker-nemotron-3/</link>
      <pubDate>Mon, 15 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">693c57b0e61ec37a59554be3</guid>
      <description>The world&#8217;s top chipmaker wants open source AI to succeed&#8212;perhaps because closed models increasingly run on its rivals&#8217; silicon.</description>
    </item>
    <item>
      <title>Musicians are getting really tired of this AI clone &#8216;bullshit&#8217;</title>
      <link>https://www.theverge.com/report/844454/musicians-tired-of-ai-clones</link>
      <pubDate>2025-12-15T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=844454</guid>
      <description>"Not ideal." "Completely unacceptable." "Shameless." "Predatory." "Some bullshit." "Total bullshit." This is how musicians, producers, and others in the industry are describing the relentless spread of AI clones. Of course, AI fakes aren't new, but as the scammers have gotten more brazen, artists are responding with increasing furor. We got a taste back in 2023 [&#8230;]...</description>
    </item>
    <item>
      <title>What is the release date for Fallout season 2 episode 1 on Prime Video?</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/what-is-the-release-date-for-fallout-season-2-episode-1-on-prime-video</link>
      <pubDate>Mon, 15 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">FjyYzdgjz4JUyL4piTvvJ</guid>
      <description>The first episode of Fallout season 2 will be out shortly &#8211; find out when you can watch it where you live.</description>
    </item>
    <item>
      <title>Starlink fr&#244;le la catastrophe : une collision &#233;vit&#233;e avec un satellite chinois</title>
      <link>https://www.frandroid.com/telecom/2910393_starlink-frole-la-catastrophe-une-collision-evitee-avec-un-satellite-chinois</link>
      <pubDate>Mon, 15 Dec 2025 13:57:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2910393_starlink-frole-la-catastrophe-une-collision-evitee-avec-un-satellite-chinois</guid>
      <description>
La situation devient intenable l&#224;-haut. La semaine derni&#232;re, un satellite Starlink et un satellite chinois se sont crois&#233;s &#224; 200 m&#232;tres de distance. Une paille dans l'espace. Le probl&#232;me ? SpaceX affirme n'avoir re&#231;u aucune donn&#233;e de position. C'est un miracle qu'il n'y ait pas eu d'impact.
</description>
    </item>
    <item>
      <title>Ces lunettes AR taill&#233;es pour le streaming et le gaming nomade sont brad&#233;es &#224; moins de 200 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2910041_ces-lunettes-ar-taillees-pour-le-streaming-et-le-gaming-nomade-sont-bradees-a-moins-de-200-e</link>
      <pubDate>Mon, 15 Dec 2025 13:47:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2910041_ces-lunettes-ar-taillees-pour-le-streaming-et-le-gaming-nomade-sont-bradees-a-moins-de-200-e</guid>
      <description>
Les RayNeo Air 3s sont des lunettes &#224; r&#233;alit&#233; augment&#233;e capables de d&#233;ployer un immense &#233;cran virtuel de 201 pouces en Full HD &#224; 120 Hz. Cette paire est nettement plus int&#233;ressante maintenant qu'elle passe de 299 euros &#224; 199 euros. 
</description>
    </item>
    <item>
      <title>Resident Evil Requiem's Leon will make zombies cower 'with adrenaline-pumping action' while 'scaredy-cat' Grace will fight for survival</title>
      <link>https://www.techradar.com/gaming/resident-evil-requiems-leon-will-make-zombies-cower-with-adrenaline-pumping-action-while-scaredy-cat-grace-will-fight-for-survival</link>
      <pubDate>Mon, 15 Dec 2025 13:45:36 +0000</pubDate>
      <guid isPermaLink="false">gdvzyJymv6KXwJJcRGawpg</guid>
      <description>Capcom is doing exactly what I hoped for with Resident Evil Requiem, and it may lead to the best title in the franchise.</description>
    </item>
    <item>
      <title>The Samsung Galaxy Z Trifold could be the perfect mobile movie machine &#8211; and I can&#8217;t wait to try it out</title>
      <link>https://www.techradar.com/phones/samsung-galaxy-phones/the-samsung-galaxy-z-trifold-could-be-the-perfect-mobile-movie-machine-and-i-cant-wait-to-try-it-out</link>
      <pubDate>Mon, 15 Dec 2025 13:31:40 +0000</pubDate>
      <guid isPermaLink="false">k8p2DeEeBFvsTSZnX62Lqj</guid>
      <description>The Samsung Galaxy Z Trifold could become the device of choice for watching movies on the go, with a larger screen than any tablet-style folding phone before it</description>
    </item>
    <item>
      <title>Il est possible de recharger les piles non rechargeables, attention au pi&#232;ge sur la R5 &#233;lectrique et les v&#233;los &#233;lectriques contrefaits &#8211; R&#233;cap&#8217; Survolt&#233;s</title>
      <link>https://www.frandroid.com/survoltes/2910285_il-est-possible-de-recharger-les-piles-non-rechargeables-attention-au-piege-sur-la-r5-electrique-et-les-velos-electriques-contrefaits-recap-survoltes</link>
      <pubDate>Mon, 15 Dec 2025 13:28:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2910285_il-est-possible-de-recharger-les-piles-non-rechargeables-attention-au-piege-sur-la-r5-electrique-et-les-velos-electriques-contrefaits-recap-survoltes</guid>
      <description>
Entre une innovation qui pourrait changer notre rapport aux piles alcalines, des d&#233;sillusions pour les premiers acheteurs de la Renault 5 &#233;lectrique, un rappel urgent de v&#233;los &#224; cause d&#8217;un d&#233;faut critique, et de nouveaux concepts de voitures &#233;lectriques bluffants, il y a de quoi faire fr&#233;mir les passionn&#233;s de mobilit&#233; d&#233;carbon&#233;e. 
</description>
    </item>
    <item>
      <title>MasterClass subscriptions are on sale for 40 percent off for the holidays</title>
      <link>https://www.engadget.com/deals/masterclass-subscriptions-are-on-sale-for-40-percent-off-for-the-holidays-150520454.html?src=rss</link>
      <pubDate>Mon, 15 Dec 2025 13:23:39 +0000</pubDate>
      <guid isPermaLink="false">b02af539-ee42-4564-83c2-a1439939b074</guid>
      <description>If learning a new skill is one of your New Year's resolutions, then you might want to know that MasterClass subscriptions are currently 40 percent off. This brings the top-tier subscription with offline mode and use on up to six devices down from $240 annually to $144. The entry-level plan, which supports just one device and doesn't offer offline viewing, is marked down to $72 from $120.


Over the past few years, MasterClass has grown to over 200 classes, sessions and original series. You can learn about entrepreneurship from Richard Branson, screenwriting from Aaron Sorkin, cooking from Gord...</description>
    </item>
    <item>
      <title>Snag a $100 gift card when you buy the Meta Quest 3 VR headset at Amazon</title>
      <link>https://www.techradar.com/gaming/virtual-reality-gaming/snag-a-usd100-gift-card-when-you-buy-the-meta-quest-3-vr-headset-at-amazon</link>
      <pubDate>Mon, 15 Dec 2025 13:21:40 +0000</pubDate>
      <guid isPermaLink="false">4o6GFRWBiWb79ai2Nm2gwA</guid>
      <description>Amazon is throwing in a $100 gift card with the Meta Quest 3 VR headset right now</description>
    </item>
    <item>
      <title>Russian court ruling could see $129 million freeze on some of Google's French assets</title>
      <link>https://www.techradar.com/pro/security/russian-court-ruling-could-see-usd129-million-freeze-on-some-of-googles-french-assets</link>
      <pubDate>Mon, 15 Dec 2025 13:20:00 +0000</pubDate>
      <guid isPermaLink="false">TQgsovh57m5UaykuVGeC4</guid>
      <description>Google is facing a temporary freeze on &#8364;110 million in French assets.</description>
    </item>
    <item>
      <title>Your LG TV may get an unremovable Microsoft Copilot app in its next update, and yes, users are annoyed</title>
      <link>https://www.techradar.com/televisions/your-lg-tv-may-get-an-unremovable-microsoft-copilot-app-in-its-next-update-and-yes-users-are-annoyed</link>
      <pubDate>Mon, 15 Dec 2025 13:03:38 +0000</pubDate>
      <guid isPermaLink="false">Z7z5TFu2nm6GYgAApHTvu4</guid>
      <description>LG has added Microsoft Copilot to its customers' TVs &#8211;and they can't delete it</description>
    </item>
    <item>
      <title>James Gunn Denies Even More Brainiac Rumors for &#8216;Man of Tomorrow&#8217;</title>
      <link>https://gizmodo.com/james-gunn-man-of-tomorrow-brainiac-dave-bautista-2000699534</link>
      <pubDate>Mon, 15 Dec 2025 13:00:45 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000699534</guid>
      <description>Plus, get new looks at 'Lanterns' and the return of 'House of the Dragon'.</description>
    </item>
    <item>
      <title>Beat the RAM price rises with this free Windows 11 hack for an instant speed boost</title>
      <link>https://www.techradar.com/computing/windows/beat-the-ram-price-rises-with-this-free-windows-11-hack-for-an-instant-speed-boost</link>
      <pubDate>Mon, 15 Dec 2025 12:49:02 +0000</pubDate>
      <guid isPermaLink="false">nkBYRi7bgPviCP4fHTFzeT</guid>
      <description>I&#8217;ll show you how Windows 11&#8217;s virtual memory hack can help you beat RAM price rises.</description>
    </item>
    <item>
      <title>Les lunettes connect&#233;es d&#8217;Apple aurait un point commun avec l&#8217;Apple Watch</title>
      <link>https://www.01net.com/actualites/lunettes-connectees-apple-aurait-point-commun-avec-apple-watch.html</link>
      <pubDate>Mon, 15 Dec 2025 12:39:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315371</guid>
      <description>Apple pr&#233;parerait des lunettes connect&#233;es ultral&#233;g&#232;res avec une autonomie de haut vol. Pour parvenir &#224; concevoir l'accessoire, le g&#233;ant de Cupertino miserait sur une puce proche de celle de l'Apple Watch.</description>
    </item>
    <item>
      <title>Looking for a cheap SSD? Don't wait &#8211; Samsung could stop producing budget models soon</title>
      <link>https://www.techradar.com/computing/storage-backup/looking-for-a-cheap-ssd-dont-wait-samsung-could-stop-producing-budget-models-soon</link>
      <pubDate>Mon, 15 Dec 2025 12:37:04 +0000</pubDate>
      <guid isPermaLink="false">4qA9ZreQ58tyf8kgq7vnp6</guid>
      <description>SSD price rises could hit budget drives hard, so buy now, don't wait &#8211; and there's more RAM misery in the cards too.</description>
    </item>
    <item>
      <title>The DJI Power 2000 portable power station is down to its lowest-ever price &#8212; almost half off at Amazon</title>
      <link>https://mashable.com/article/dec-15-dji-power-2000-deal</link>
      <pubDate>Mon, 15 Dec 2025 12:36:07 +0000</pubDate>
      <guid isPermaLink="false">045MeUBFBgxsWgIbQoMBruq</guid>
      <description>The DJI Power 2000 is on sale at Amazon for $699, down from the list price of $1,299. That's a 46% discount.</description>
    </item>
    <item>
      <title>CEOs seem determined to keep spending on AI - despite mixed success</title>
      <link>https://www.techradar.com/pro/ceos-seem-determined-to-keep-spending-on-ai-despite-mixed-success</link>
      <pubDate>Mon, 15 Dec 2025 12:34:00 +0000</pubDate>
      <guid isPermaLink="false">6Q94ps86uvDMYycx8xK32j</guid>
      <description>Slightly more CEOs plan on spending cash on AI as positive economic outlooks dwindle.</description>
    </item>
    <item>
      <title>I tested Leica's divisive M EV1 &#8212; it's easier to the eye, but loses some of that rangefinder soul</title>
      <link>https://www.techradar.com/cameras/mirrorless-cameras/i-tested-leicas-divisive-m-ev1-its-easier-to-the-eye-but-loses-some-of-that-rangefinder-soul</link>
      <pubDate>Mon, 15 Dec 2025 12:33:37 +0000</pubDate>
      <guid isPermaLink="false">NXu4CCqetdRVVU2HjzNbiP</guid>
      <description>The Leica M EV1 is the first Leica rangefinder without... the optical rangefinder. In its place, a useful EVF, which can make manual focusing much simpler.</description>
    </item>
    <item>
      <title>Score $18 off the Lego Icons Dried Flower Centerpiece at Amazon</title>
      <link>https://mashable.com/article/dec-15-lego-icons-dried-flower-centerpiece-deal</link>
      <pubDate>Mon, 15 Dec 2025 12:32:48 +0000</pubDate>
      <guid isPermaLink="false">04u6Y9EPzkCqQmEAN1cSVQZ</guid>
      <description>As of Dec. 15, the Lego Icons Dried Flower Centerpiece is on sale at Amazon for $31.99 for a limited time. This is 36% off its list price of $49.99.</description>
    </item>
    <item>
      <title>Eureka&#8217;s Christmas Vacuum Deals Are Practically a Holiday Clean-Out, Make Your Home Shine Like Never Before</title>
      <link>https://gizmodo.com/eurekas-christmas-vacuum-deals-are-practically-a-holiday-clean-out-make-your-home-shine-like-never-before-2000695844</link>
      <pubDate>Mon, 15 Dec 2025 12:30:31 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000695844</guid>
      <description>There's a cleaning machine for every home available now at huge savings, from smart robots to amazingly versatile lightweight stick vacuums.</description>
    </item>
  </channel>
</rss>
