<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 28 Dec 2025 19:19:40 GMT</lastBuildDate>
    <item>
      <title>Ubisoft is rolling back Rainbow Six Siege servers after being forced to shut them down</title>
      <link>https://www.engadget.com/gaming/ubisoft-is-rolling-back-rainbow-six-siege-servers-after-being-forced-to-shut-them-down-191049440.html?src=rss</link>
      <pubDate>Sun, 28 Dec 2025 19:10:49 +0000</pubDate>
      <guid isPermaLink="false">d2c981d2-9e5e-43f8-8c4f-631cd763f890</guid>
      <description>Ubisoft has shut down Rainbow Six Siege's servers and is in the process of rolling back the fallout of a widespread breach that left various players with billions of in-game credits, ultra-rare skins of weapons, and banned accounts. As of Sunday afternoon, the status page on Rainbow Six Siege's website still shows "unplanned outage" on all servers across PC, PlayStation and Xbox.
Update: Siege and the Marketplace have been intentionally shut down while the team focuses on resolving the issue. https://t.co/7k6Jsa5CiM&#8212; Rainbow Six Siege X (@Rainbow6Game) December 27, 2025

The fiasco began Satur...</description>
    </item>
    <item>
      <title>The terrible Nintendo controller that helped make VR happen</title>
      <link>https://www.theverge.com/podcast/850556/nintendo-power-glove-version-history</link>
      <pubDate>2025-12-28T14:07:34-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=850556</guid>
      <description>The Nintendo Power Glove was not good. It's important that you know that. The Power Glove was ambitious, impressive, even important - one of the very first mainstream devices that let you control a game using your body instead of just your thumbs - but it was not good. In some ways, its not-good-ness is [&#8230;]</description>
    </item>
    <item>
      <title>Pourquoi une plan&#232;te dans la &#171; zone habitable &#187; n&#8217;est pas forc&#233;ment habitable : les experts nous l'expliquent</title>
      <link>https://www.futura-sciences.com/sciences/actualites/planetes-planete-zone-habitable-nest-pas-forcement-habitable-experts-nous-expliquent-128125/#xtor%3DRSS-8</link>
      <pubDate>Sun, 28 Dec 2025 20:03:45 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/planetes-planete-zone-habitable-nest-pas-forcement-habitable-experts-nous-expliquent-128125/#xtor%3DRSS-8</guid>
      <description>Trouver une plan&#232;te dans la &#171; zone habitable &#187; d&#8217;une &#233;toile est toujours un &#233;v&#233;nement, mais cela ne suffit cependant pas &#224; garantir qu&#8217;elle puisse accueillir la vie. De nouveaux travaux montrent en effet que l&#8217;habitabilit&#233; d&#233;pend d&#8217;un &#233;quilibre bien plus subtil : composition interne, richesse en...</description>
    </item>
    <item>
      <title>I&#8217;ve reviewed over 50 apps this year and these are my top five</title>
      <link>https://www.techradar.com/computing/websites-apps/my-top-five-apps-of-2025</link>
      <pubDate>Sun, 28 Dec 2025 19:00:00 +0000</pubDate>
      <guid isPermaLink="false">pUAVCV3Qr5G2AkEum6WH4f</guid>
      <description>Homescreen Heroes: Best of 2025</description>
    </item>
    <item>
      <title>Vous avez besoin d&#8217;une souris sans fil pas ch&#232;re ? La Xiaomi Lite 2 Mouse est &#224; moins de 10&#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2921281_vous-avez-besoin-dune-souris-sans-fil-pas-chere-la-xiaomi-lite-2-mouse-est-a-moins-de-10e</link>
      <pubDate>Sun, 28 Dec 2025 18:41:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2921281_vous-avez-besoin-dune-souris-sans-fil-pas-chere-la-xiaomi-lite-2-mouse-est-a-moins-de-10e</guid>
      <description>
La Xiaomi Lite 2 Mouse ne joue pas la carte de la d&#233;mesure ni des fonctions gadget. Elle va droit au but : d&#233;placer un curseur, cliquer juste, sans bruit ni fioritures. Une souris simple, efficace, presque honn&#234;te dans son approche. Et quand le prix tombe &#224; 9,90 euros au lieu de 15 euros sur Amazon, l&#8217;essentiel devient aussi une tr&#232;s bonne affaire.
...</description>
    </item>
    <item>
      <title>10 000 mAh et Snapdragon 8 Ultra : Honor arr&#234;te la subtilit&#233; et &#231;a marche</title>
      <link>https://www.frandroid.com/marques/2921691_10-000-mah-et-snapdragon-8-ultra-honor-arrete-la-subtilite-et-ca-marche</link>
      <pubDate>Sun, 28 Dec 2025 18:37:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2921691_10-000-mah-et-snapdragon-8-ultra-honor-arrete-la-subtilite-et-ca-marche</guid>
      <description>
Il semblerait que la subtilit&#233; ne paie plus. Honor vient de lancer sa nouvelle s&#233;rie WIN en Chine, et les chiffres donnent le vertige. On parle de ventes 10 fois sup&#233;rieures &#224; la g&#233;n&#233;ration pr&#233;c&#233;dente. Le secret ? Une fiche technique brutale et une batterie &#233;norme !
</description>
    </item>
    <item>
      <title>Did the foldable iPhone just get leaked? Seems like it.</title>
      <link>https://mashable.com/article/foldable-iphone-leaked</link>
      <pubDate>Sun, 28 Dec 2025 18:30:17 +0000</pubDate>
      <guid isPermaLink="false">03jw5mC54KSeUIJfRaXJJbX</guid>
      <description>Is this the foldable iPhone rumored to be released in 2026? YouTuber Jon Prosser says it is.</description>
    </item>
    <item>
      <title>LG corrige sa plus grosse erreur avec son nouveau moniteur OLED de 39 pouces</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/ecran-pc/2921679_lg-corrige-sa-plus-grosse-erreur-avec-son-nouveau-moniteur-oled-de-39-pouces</link>
      <pubDate>Sun, 28 Dec 2025 18:27:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/ecran-pc/2921679_lg-corrige-sa-plus-grosse-erreur-avec-son-nouveau-moniteur-oled-de-39-pouces</guid>
      <description>
LG annonce deux nouveaux moniteurs, dont un g&#233;ant de 52 pouces. Mais ne vous laissez pas aveugler par la taille. La vraie star, c'est le mod&#232;le OLED de 39 pouces qui adopte la technologie Tandem et une d&#233;finition 5K2K.
</description>
    </item>
    <item>
      <title>Samsung Music Studio : une r&#233;ponse cr&#233;dible &#224; l&#8217;&#233;cosyst&#232;me Sonos</title>
      <link>https://www.frandroid.com/marques/samsung/2921663_samsung-music-studio-une-reponse-credible-a-lecosysteme-sonos</link>
      <pubDate>Sun, 28 Dec 2025 18:15:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2921663_samsung-music-studio-une-reponse-credible-a-lecosysteme-sonos</guid>
      <description>
Vous trouvez les barres de son trop laides ? Samsung a une solution. Avec sa nouvelle gamme Music Studio, la marque tente de marier audio haute-fid&#233;lit&#233; et objet de d&#233;coration. Mais au-del&#224; du look, c'est surtout la technologie Q-Symphony qui risque de faire de l'ombre &#224; Sonos.
</description>
    </item>
    <item>
      <title>Polaroid, Instax : notre s&#233;lection des meilleurs appareils photo instantan&#233;s en 2025</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-photo-et-video/751529_polaroid-ou-instax-les-meilleurs-appareils-photos-instantanes</link>
      <pubDate>Sun, 28 Dec 2025 18:00:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-photo-et-video/751529_polaroid-ou-instax-les-meilleurs-appareils-photos-instantanes</guid>
      <description>
&#192; l'heure du tout num&#233;rique, les appareils photos instantan&#233;s (couramment surnomm&#233;s "Polaroid") connaissent un regain de popularit&#233;. D&#233;couvrez notre s&#233;lection compl&#232;te des meilleurs appareils photos instantan&#233;s pour immortaliser de pr&#233;cieux instants de vie.
</description>
    </item>
    <item>
      <title>Why WeTransfer co-founder is building another file transfer service</title>
      <link>https://techcrunch.com/2025/12/28/why-wetransfer-co-founder-is-building-another-file-transfer-service/</link>
      <pubDate>Sun, 28 Dec 2025 18:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078471</guid>
      <description>WeTransfer co-founder Nalden has a new file transfer service that users can use without logging in.</description>
    </item>
    <item>
      <title>Can public charging cables steal your data? Experts explain how to avoid 'juice jacking' in 2026</title>
      <link>https://www.techradar.com/phones/can-public-charging-cables-steal-your-data-experts-explain-how-to-avoid-juice-jacking-in-2026</link>
      <pubDate>Sun, 28 Dec 2025 18:00:00 +0000</pubDate>
      <guid isPermaLink="false">u8XnQLGkLDTjf8FJEBnpx7</guid>
      <description>We&#8217;ve all seen public charging cables in airports, taxis and cafes. But are they safe to use? We asked the experts.</description>
    </item>
    <item>
      <title>We Now Know What You&#8217;ll Be Charged if You Puke in a Tesla Robotaxi</title>
      <link>https://gizmodo.com/we-now-know-what-youll-be-charged-if-you-puke-in-a-tesla-robotaxi-2000703779</link>
      <pubDate>Sun, 28 Dec 2025 17:47:27 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703779</guid>
      <description>And we looked into how Tesla compares to its competition.</description>
    </item>
    <item>
      <title>Ayaneo's latest Game Boy remake will have an early bird starting price of $269</title>
      <link>https://www.engadget.com/gaming/ayaneos-latest-game-boy-remake-will-have-an-early-bird-starting-price-of-269-174553644.html?src=rss</link>
      <pubDate>Sun, 28 Dec 2025 17:45:54 +0000</pubDate>
      <guid isPermaLink="false">b28466b0-a7b7-48cf-b1b4-40efc6c6aad1</guid>
      <description>After the high price tag of the Ayaneo Pocket DMG turned some retro handheld fans away, Ayaneo is working on another remake of the classic Game Boy with a slightly more affordable cost. Ayaneo revealed the pricing for the Pocket Vert, which starts at $269 for early bird orders.
Compared to the Pocket DMG that retails for $449, Ayaneo skipped the OLED and configurations that go up to 16GB of memory and 1TB of storage for the Pocket Vert. Instead, the handheld maker went with a fully metal CNC body and an ultra-minimalist design with engraving-free buttons that resemble the Analogue Pocket's loo...</description>
    </item>
    <item>
      <title>The Samsung Galaxy Z TriFold is no match for an extreme torture test &#8212; here's what it says about durability</title>
      <link>https://www.techradar.com/phones/samsung-galaxy-phones/the-samsung-galaxy-z-trifold-is-no-match-for-an-extreme-torture-test-heres-what-it-says-about-durability</link>
      <pubDate>Sun, 28 Dec 2025 17:30:00 +0000</pubDate>
      <guid isPermaLink="false">MvqwigXbM5HcPqeEFqjeqZ</guid>
      <description>JerryRigEverything puts the Galaxy Z TriFold through a series of endurance and durability tests on camera.</description>
    </item>
    <item>
      <title>&#8216;Dune 3&#8217; May Fight &#8216;Avengers: Doomsday&#8217; For Your Holiday Time</title>
      <link>https://gizmodo.com/dune-3-may-fight-avengers-doomsday-for-your-holiday-time-2000703770</link>
      <pubDate>Sun, 28 Dec 2025 17:25:30 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703770</guid>
      <description>'Dune: Part 3' and 'Avengers: Doomsday' share the same December 2026 date. Are they another 'Barbenheimer,' or will one movie blink?</description>
    </item>
  </channel>
</rss>
