<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 11 Nov 2025 08:52:21 GMT</lastBuildDate>
    <item>
      <title>Le pack Nintendo Switch 2 avec Mario Kart World chute sous les 400 &#8364; pour le Single Day</title>
      <link>https://www.frandroid.com/bons-plans/2850515_le-pack-nintendo-switch-2-avec-mario-kart-world-chute-sous-les-400-euros-pour-le-single-day</link>
      <pubDate>Tue, 11 Nov 2025 08:49:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850515_le-pack-nintendo-switch-2-avec-mario-kart-world-chute-sous-les-400-euros-pour-le-single-day</guid>
      <description>
Sortie cet &#233;t&#233;, la Nintendo Switch 2 remet une pi&#232;ce dans la machine avec un design aff&#251;t&#233; et des muscles en plus sous la coque. Et pour les amateurs de carapaces bleues et de virages serr&#233;s, elle d&#233;barque avec Mario Kart World dans les bagages &#224; 388 euros au lieu de 509 euros sur AliExpress.
</description>
    </item>
    <item>
      <title>Mauvaise nouvelle pour l&#8217;arriv&#233;e des BYD qui se rechargent en 6 minutes en Europe</title>
      <link>https://www.frandroid.com/marques/denza/2863277_mauvaise-nouvelle-pour-larrivee-des-byd-qui-se-rechargent-en-6-minutes-en-europe</link>
      <pubDate>Tue, 11 Nov 2025 08:46:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/denza/2863277_mauvaise-nouvelle-pour-larrivee-des-byd-qui-se-rechargent-en-6-minutes-en-europe</guid>
      <description>
Denza, la filiale premium de BYD, devait faire son arriv&#233;e en France d&#8217;ici &#224; la fin de l&#8217;ann&#233;e 2025. Il faudra finalement attendre le printemps 2026 pour voir les voitures &#233;lectriques de la firme chinoise, capables de se recharger &#224; 1 000 kW.
</description>
    </item>
    <item>
      <title>Le n&#176;1 du v&#233;lo vit une ann&#233;e 2025 toujours compliqu&#233;e, mais consid&#232;re le v&#233;lo &#233;lectrique comme son sauveur</title>
      <link>https://www.frandroid.com/marques/giant/2862205_le-n1-du-velo-vit-une-annee-2025-toujours-compliquee-mais-considere-le-velo-electrique-comme-son-sauveur</link>
      <pubDate>Tue, 11 Nov 2025 08:45:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/giant/2862205_le-n1-du-velo-vit-une-annee-2025-toujours-compliquee-mais-considere-le-velo-electrique-comme-son-sauveur</guid>
      <description>
Avec une nouvelle chute de son chiffre d'affaires de 25 % au 3e trimestre, Giant montre que l&#8217;ann&#233;e 2025 n&#8217;est pas encore celle de la reprise. Mais le groupe ta&#239;wanais juge que le v&#233;lo &#233;lectrique sera son futur vecteur de croissance.
</description>
    </item>
    <item>
      <title>Gemini sur le Google TV Streamer&#160;: d&#233;but du d&#233;ploiement</title>
      <link>https://www.frandroid.com/marques/google/2863325_gemini-sur-le-google-tv-streamer-debut-du-deploiement</link>
      <pubDate>Tue, 11 Nov 2025 08:35:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2863325_gemini-sur-le-google-tv-streamer-debut-du-deploiement</guid>
      <description>
Google vient de d&#233;buter le d&#233;ploiement progressif de Gemini sur le Google TV Streamer. Voici ce que cela signifie.
</description>
    </item>
    <item>
      <title>Une moto &#233;lectrique &#224; moins de 3&#160;000 euros, qui peut faire mieux que la Tromox M05&#160;?</title>
      <link>https://www.01net.com/actualites/une-moto-electrique-a-moins-de-3-000-euros-qui-peut-faire-mieux-que-la-tromox-m05.html</link>
      <pubDate>Tue, 11 Nov 2025 08:31:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306836</guid>
      <description>Le fabricant chinois Tromox, pr&#233;sent &#224; l&#8217;EICMA, le grand salon du deux roues, a d&#233;voil&#233; sa nouveaut&#233;. Une moto &#233;lectrique pas ch&#232;re mais tr&#232;s ambitieuse, la M05.</description>
    </item>
    <item>
      <title>Souverainet&#233; num&#233;rique&#160;: les efforts de Microsoft pour rassurer les Europ&#233;ens</title>
      <link>https://www.01net.com/actualites/souverainete-numerique-microsoft-essaie-de-rassurer-les-europeens.html</link>
      <pubDate>Tue, 11 Nov 2025 08:01:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306755</guid>
      <description>La firme am&#233;ricaine, soumise &#224; la loi extraterritoriale am&#233;ricaine Cloud Act, a lanc&#233; une nouvelle s&#233;rie de services et de fonctionnalit&#233;s dans le cloud pour rassurer ses clients europ&#233;ens.</description>
    </item>
    <item>
      <title>This TikTok trend captures the delight of intergenerational work friends</title>
      <link>https://www.fastcompany.com/91437982/this-tiktok-trend-captures-the-joy-of-intergenerational-work-friendships</link>
      <pubDate>2025-11-11T08:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91437982/this-tiktok-trend-captures-the-joy-of-intergenerational-work-friendships</guid>
      <description>What lip-synching to a Nicki Minaj and 4 Non Blondes remix says about age-gap dynamics in the office.
For the first time in history, five generations are sharing the workplace. But grouping different generations under one roof doesn&#8217;t have to cause friction. Sometimes it means unlikely friendships blossom.&#160;</description>
    </item>
    <item>
      <title>AirPods Pro 3 : ces r&#233;cents (et bluffants) &#233;couteurs sans fil Apple profitent du Single Day pour baisser leur prix</title>
      <link>https://www.frandroid.com/bons-plans/2862267_airpods-pro-3-ces-recents-et-bluffants-ecouteurs-sans-fil-apple-profitent-du-single-day-pour-baisser-leur-prix</link>
      <pubDate>Tue, 11 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2862267_airpods-pro-3-ces-recents-et-bluffants-ecouteurs-sans-fil-apple-profitent-du-single-day-pour-baisser-leur-prix</guid>
      <description>
Not&#233;s 9/10 lors de notre test, les AirPods Pro 3 perfectionnent la formule de leurs pr&#233;d&#233;cesseurs, qui &#233;taient d&#233;j&#224; excellents. R&#233;duction de bruit active, autonomie, int&#233;gration dans l'&#233;cosyst&#232;me Apple... Ils cochent toutes les cases. En ce Single Day, vous trouverez ces AirPods Pro 3 &#224; 234,99 euros au lieu de 249 euros chez Rakuten.
</description>
    </item>
    <item>
      <title>Plus besoin d&#8217;&#233;tui pour profiter de la recharge Qi2 magn&#233;tique sur les prochains Galaxy S26&#160;?</title>
      <link>https://www.01net.com/actualites/plus-besoin-detui-pour-profiter-de-la-recharge-qi2-magnetique-sur-les-prochains-galaxy-s26.html</link>
      <pubDate>Tue, 11 Nov 2025 07:30:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306819</guid>
      <description>La plus grande innovation des futurs Galaxy S26 pourrait se nicher non pas dans l'&#233;cran, le processeur ou les capteurs photo, mais&#8230; dans des aimants. Une fuite laisse en effet esp&#233;rer que Samsung va finalement embrasser &#224; pleine bouche le standard Qi2 de recharge sans fil magn&#233;tique !</description>
    </item>
    <item>
      <title>$50 Target Coupon &amp; Promo Codes | November 2025</title>
      <link>https://www.wired.com/story/target-promo-code/</link>
      <pubDate>Tue, 11 Nov 2025 07:30:00 +0000</pubDate>
      <guid isPermaLink="false">671aae969d2d2bafd3d3cba6</guid>
      <description>Get $50 off your next order, 20% off sitewide, and up to 50% off with Target coupon codes and deals.</description>
    </item>
    <item>
      <title>Ce r&#233;cent TV QLED 4K 55&#8243; sign&#233; Xiaomi, avec Google TV, chute sous les 400 &#8364;&#160;gr&#226;ce au Single Day</title>
      <link>https://www.frandroid.com/bons-plans/2862815_ce-recent-tv-qled-4k-55-signe-xiaomi-avec-google-tv-chute-sous-les-400-e-grace-au-single-day</link>
      <pubDate>Tue, 11 Nov 2025 07:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2862815_ce-recent-tv-qled-4k-55-signe-xiaomi-avec-google-tv-chute-sous-les-400-e-grace-au-single-day</guid>
      <description>
Avec son TV A Pro 55 2026, Xiaomi rend le QLED plus abordable, sans compromettre la qualit&#233; d'image. Ce t&#233;l&#233;viseur polyvalent, anim&#233; par un Google TV toujours aussi fluide, est d'ailleurs propos&#233; &#224; un prix encore plus bas que d'habitude en ce Single Day : AliExpress le propose &#224; 376,99 euros au lieu de 449 euros.
</description>
    </item>
    <item>
      <title>Une s&#233;rie Amazon &#224; petit budget utilise l&#8217;IA g&#233;n&#233;rative pour ses effets sp&#233;ciaux et ne s&#8217;excuse pas</title>
      <link>https://www.01net.com/actualites/une-serie-amazon-a-petit-budget-utilise-lia-generative-pour-ses-effets-speciaux-et-ne-sexcuse-pas.html</link>
      <pubDate>Tue, 11 Nov 2025 07:01:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306800</guid>
      <description>Une partie de Hollywood regarde l'IA g&#233;n&#233;rative avec grande prudence, voire une certaine circonspection. Les plus petits studios et les productions moins prestigieuses ont moins de scrupules : cette technologie permet de pallier les probl&#232;mes de budget serr&#233; en g&#233;n&#233;rant rapidement et &#224; faible co&#251;t des effets sp&#233;ciaux plus ou moins spectaculaires.</description>
    </item>
    <item>
      <title>Stop saying &#8216;how are you?&#8217; and try these greetings instead</title>
      <link>https://www.fastcompany.com/91433612/stop-saying-how-are-you-and-try-these-greetings-instead</link>
      <pubDate>2025-11-11T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91433612/stop-saying-how-are-you-and-try-these-greetings-instead</guid>
      <description>Here&#8217;s what to say to make people feel seen and respected.
Every encounter with another person is an opportunity to shape that relationship. The first words out of your mouth are key in establishing the goodwill we all crave. Unfortunately, too often our opening lines damage that rapport.</description>
    </item>
    <item>
      <title>How AI became the scapegoat for the current wave of mass layoffs</title>
      <link>https://www.fastcompany.com/91435784/how-ai-became-the-scapegoat-for-the-current-wave-of-mass-layoffs</link>
      <pubDate>2025-11-11T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91435784/how-ai-became-the-scapegoat-for-the-current-wave-of-mass-layoffs</guid>
      <description>Labor experts reveal the truth behind AI job disruption, and why companies are so willing to cite AI as the excuse for slashing jobs. 
With a new season of mass layoffs upon us, it seems corporate America has found a new scapegoat.&#160;</description>
    </item>
    <item>
      <title>Galaxy Tab S10 FE : cette bonne tablette Samsung profite de 200 &#8364; de remise lors du Single Day</title>
      <link>https://www.frandroid.com/bons-plans/2862687_galaxy-tab-s10-fe-cette-bonne-tablette-samsung-profite-de-200-e-de-remise-lors-du-single-day</link>
      <pubDate>Tue, 11 Nov 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2862687_galaxy-tab-s10-fe-cette-bonne-tablette-samsung-profite-de-200-e-de-remise-lors-du-single-day</guid>
      <description>
La tablette tactile Samsung Galaxy Tab S10 FE profite du Single Day pour passer de 579 euros &#224; 379 euros sur AliExpress.
</description>
    </item>
  </channel>
</rss>
