<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 08 Dec 2025 16:34:03 GMT</lastBuildDate>
    <item>
      <title>Ce PC gaming Lenovo &#233;tire son &#233;cran &#224; la demande pour jouer plus confortablement</title>
      <link>https://www.frandroid.com/marques/lenovo/2901781_ce-pc-gaming-lenovo-etire-son-ecran-a-la-demande-pour-jouer-plus-confortablement</link>
      <pubDate>Mon, 08 Dec 2025 16:30:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lenovo/2901781_ce-pc-gaming-lenovo-etire-son-ecran-a-la-demande-pour-jouer-plus-confortablement</guid>
      <description>
Lenovo s&#8217;appr&#234;terait &#224; d&#233;voiler un PC portable de la gamme Legion capable d'&#233;largir son &#233;cran pour passer d'un format classique &#224; un affichage ultra-large.
</description>
    </item>
    <item>
      <title>Patient and staff data impacted by Cl0p ransomware attack on Barts Health NHS</title>
      <link>https://www.techradar.com/pro/security/patient-and-staff-data-impacted-by-cl0p-ransomware-attack-on-barts-health-nhs</link>
      <pubDate>Mon, 08 Dec 2025 16:25:00 +0000</pubDate>
      <guid isPermaLink="false">rkkQT55jeVmyPCRYqGLdS6</guid>
      <description>Barts Health was hit through Oracle E-Business Suite, and sensitive data was stolen.</description>
    </item>
    <item>
      <title>L&#8217;Apple Watch Ultra fa&#231;on Realme devient encore plus abordable &#224; moins de 40 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2902303_lapple-watch-ultra-facon-realme-devient-encore-plus-abordable-a-moins-de-40-e</link>
      <pubDate>Mon, 08 Dec 2025 16:24:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2902303_lapple-watch-ultra-facon-realme-devient-encore-plus-abordable-a-moins-de-40-e</guid>
      <description>
Avec son look d'Apple Watch Ultra, la Realme Watch 5 est pourtant une montre connect&#233;e qui se vend &#224; un prix bien plus accessible surtout avec cette offre : 36 euros contre 69 euros de base.  
</description>
    </item>
    <item>
      <title>Finie la jungle de la recharge des voitures &#233;lectriques : cet abonnement unique &#224; moins de 10 &#8364; va enfin vous simplifier la vie en baissant les prix</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2902061_finie-la-jungle-de-la-recharge-des-voitures-electriques-cet-abonnement-unique-a-moins-de-10-e-va-enfin-vous-simplifier-la-vie-en-baissant-les-prix</link>
      <pubDate>Mon, 08 Dec 2025 16:17:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2902061_finie-la-jungle-de-la-recharge-des-voitures-electriques-cet-abonnement-unique-a-moins-de-10-e-va-enfin-vous-simplifier-la-vie-en-baissant-les-prix</guid>
      <description>
Fini le casse-t&#234;te des applications multiples et des tarifs opaques. Electra vient de lancer Electra+ Boost, un abonnement unique qui promet de simplifier radicalement la vie des conducteurs de voitures &#233;lectriques en Europe.
</description>
    </item>
    <item>
      <title>Paramount makes a $108 billion hostile takeover bid for Warner Bros. Discovery</title>
      <link>https://www.engadget.com/big-tech/paramount-makes-a-108-billion-hostile-takeover-bid-for-warner-bros-discovery-152248473.html?src=rss</link>
      <pubDate>Mon, 08 Dec 2025 16:14:30 +0000</pubDate>
      <guid isPermaLink="false">889cb4f3-09c4-4ef3-b35d-213e37d0dc9a</guid>
      <description>Paramount has been none too pleased about Netflix striking an $82.7 billion deal to buy much of Warner Bros. Discovery (WBD). Now, Paramount is making a hostile takeover bid for WBD. It's making its pitch directly to WBD shareholders with an all-cash offer of $30 per share that expires on January 8.Late last week, the WBD board unanimously accepted Netflix's offer of $27.75 per share. That breaks down to $23.25 per share in cash and another $4.50 per share in Netflix stock. Netflix's overall bid is valued at $82.7 billion, while Paramount's totals $108.4 billion. There's a key difference when ...</description>
    </item>
    <item>
      <title>Fuite de donn&#233;es chez Lockbit&#160;: un chercheur expose l&#8217;infrastructure du roi des ransomwares</title>
      <link>https://www.01net.com/actualites/fuite-donnees-lockbit-chercheur-expose-infrastructure-roi-ransomwares.html</link>
      <pubDate>Mon, 08 Dec 2025 16:14:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314256</guid>
      <description>Lockbit est victime d'une fuite de donn&#233;es. En exploitant de simples informations publiques, un chercheur en cybers&#233;curit&#233; est parvenu &#224; exposer une partie de l'infrastructure du gang.</description>
    </item>
    <item>
      <title>Facebook and Instagram will let European users see fewer personal ads</title>
      <link>https://www.theverge.com/news/839927/meta-facebook-instagram-eu-ad-model-choice</link>
      <pubDate>2025-12-08T11:12:58-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=839927</guid>
      <description>Meta will soon give Instagram and Facebook users in the European Union the option to limit personalised ads, in an effort to comply with the bloc's tech rules. The European Commission announced that the new advertising options will be rolled out in January 2026, and that this is "the first time that such a choice [&#8230;]</description>
    </item>
    <item>
      <title>Magnetar's new 4K Blu-ray players are the last disc spinners you'll ever need &#8212; and they're now available to buy</title>
      <link>https://www.techradar.com/televisions/blu-ray/magnetars-new-4k-blu-ray-players-are-the-last-disc-spinners-youll-ever-need-and-theyre-now-available-to-buy</link>
      <pubDate>Mon, 08 Dec 2025 16:09:27 +0000</pubDate>
      <guid isPermaLink="false">VWzGXwiBZJnVh9Kb44dLPk</guid>
      <description>MKII versions of the 4K Blu-ray players Magnetar announced at CEDIA 2025 are now available to buy.</description>
    </item>
    <item>
      <title>&#8216;ONE RULE&#8217;: Trump says he&#8217;ll sign an executive order blocking state AI laws despite bipartisan pushback</title>
      <link>https://techcrunch.com/2025/12/08/one-rule-trump-says-hell-sign-an-executive-order-blocking-state-ai-laws-despite-bipartisan-pushback/</link>
      <pubDate>Mon, 08 Dec 2025 16:07:39 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3073707</guid>
      <description>&#8220;I will be doing a ONE RULE Executive Order this week,&#8221; Trump posted on social media. &#8220;You can&#8217;t expect a company to get 50 Approvals every time they want to do something.&#8221;</description>
    </item>
    <item>
      <title>The 22 best gift ideas for the remote worker in your life</title>
      <link>https://www.engadget.com/computing/accessories/the-22-best-gift-ideas-for-the-remote-worker-in-your-life-140037336.html?src=rss</link>
      <pubDate>Mon, 08 Dec 2025 16:00:37 +0000</pubDate>
      <guid isPermaLink="false">ac7354ab-106c-4b9a-ab03-3baa917ca395</guid>
      <description>It&#8217;s 2025, so chances are you have at least one person who works remotely on your gift list. While the work-from-home life has its perks &#8212; nobody likes a long commute &#8212; it certainly comes with its own set of challenges, from missing out on pro-level equipment to dealing with annoyances around the house. If you&#8217;re looking to buy a gift for someone who spends much of their time in their home office, we&#8217;ve rounded up a few techy ideas that should make their days a little more delightful &#8212; or at least easier to manage.
Best gifts for remote workers












































Check...</description>
    </item>
    <item>
      <title>Who&#8217;s the Worst Villain on &#8216;It: Welcome to Derry&#8217;? Take Your Pick</title>
      <link>https://gizmodo.com/whos-the-worst-villain-on-it-welcome-to-derry-take-your-pick-2000695978</link>
      <pubDate>Mon, 08 Dec 2025 16:00:29 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000695978</guid>
      <description>The penultimate episode of HBO&#8217;s Stephen King series empowered all its baddies at once&#8212;with devastating consequences.</description>
    </item>
    <item>
      <title>The Verge subscription turns one</title>
      <link>https://www.theverge.com/bulletin/839889/the-verge-subscription-turns-one</link>
      <pubDate>2025-12-08T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=839889</guid>
      <description>We're one year into the experiment of running The Verge with subscriptions, and so far things are going quite well - but we've heard a lot of feedback so far, and we've got some exciting changes in store to try and make this thing even better. We hit our subscriber goals for 2025, and an [&#8230;]</description>
    </item>
    <item>
      <title>Pebble just teased a mysterious new smartwatch, and we&#8217;re excited to see what it is</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/pebble-just-teased-a-mysterious-new-smartwatch-and-were-excited-to-see-what-it-is</link>
      <pubDate>Mon, 08 Dec 2025 15:54:35 +0000</pubDate>
      <guid isPermaLink="false">hLWh7mCyVKcq5doRxHKLjh</guid>
      <description>Pebble has hinted at a new smartwatch, and it could be an updated Pebble Time Round.</description>
    </item>
    <item>
      <title>Today is your last chance to grab Proton VPN's lowest price of 2025 &#8212; here's how to claim</title>
      <link>https://www.techradar.com/vpn/vpn-services/today-is-your-last-chance-to-grab-proton-vpns-lowest-price-of-2025-heres-how-to-claim</link>
      <pubDate>Mon, 08 Dec 2025 15:54:06 +0000</pubDate>
      <guid isPermaLink="false">8Rh2hjF43yBABxv39i7Dx9</guid>
      <description>Proton VPN's best price of 2025 comes to an end today. It's 75% off its 2-year plans, dropping it to a low only beaten once before. Grab it while you can!</description>
    </item>
    <item>
      <title>Frandroid Awards 2025 : pourquoi on a d&#233;cid&#233; de tout changer cette ann&#233;e</title>
      <link>https://www.frandroid.com/humanoid/2902049_frandroid-awards-2025-pourquoi-on-a-decide-de-tout-changer-cette-annee</link>
      <pubDate>Mon, 08 Dec 2025 15:52:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/2902049_frandroid-awards-2025-pourquoi-on-a-decide-de-tout-changer-cette-annee</guid>
      <description>
Les c&#233;r&#233;monies de remise de prix, c'est souvent long et un peu ennuyeux. Cette ann&#233;e, pour les Frandroid Awards 2025 avec Delos, on a d&#233;cid&#233; de tout r&#233;volutionner. Pas de plateau t&#233;l&#233;, pas de direct &#224; rallonge. On a tourn&#233; un vrai film de 45 minutes. &#199;a se passe dans un appartement, c'est dr&#244;le, et c'est surtout bourr&#233; de tech.
</description>
    </item>
    <item>
      <title>Genki&#8217;s colorful, powerful power strip is 25 percent off</title>
      <link>https://www.theverge.com/gadgets/839820/genki-moonbase-apple-watch-ultra-2-rtx-5070-deal-sale</link>
      <pubDate>2025-12-08T10:47:57-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=839820</guid>
      <description>Power strips are generally pretty boring. You plug stuff into them, then you try your best to hide the strip along with all of the cables feeding into it. But Genki&#8217;s Moonbase is meant to be displayed loud and proud on your desk. The retrofuturism-inspired strip we wrote about at the end of last year [&#8230;]</description>
    </item>
    <item>
      <title>01net Awards&#160;: le meilleur t&#233;l&#233;viseur de 2025 est&#8230;</title>
      <link>https://www.01net.com/actualites/01net-awards-le-meilleur-televiseur-de-2025-est.html</link>
      <pubDate>Mon, 08 Dec 2025 15:45:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314324</guid>
      <description>La r&#233;daction de 01net.com d&#233;signe les meilleurs produits de l&#8217;ann&#233;e. D&#233;couvrez tous les jours les vainqueurs de chaque cat&#233;gorie jusqu&#8217;&#224; la remise des prix le 10 d&#233;cembre, en live s&#8217;il vous plait !</description>
    </item>
    <item>
      <title>I swear by these 9 cameras and accessories for shooting TikTok content &#8212; and they all fit in one small sling bag</title>
      <link>https://www.techradar.com/cameras/i-swear-by-these-9-cameras-and-accessories-for-shooting-tiktok-content-and-they-all-fit-in-one-small-sling-bag</link>
      <pubDate>Mon, 08 Dec 2025 15:39:36 +0000</pubDate>
      <guid isPermaLink="false">Un5suVvsCwQtdhvTmjvziA</guid>
      <description>I can't live without these 9 portable cameras and accessories for making TikTok content.</description>
    </item>
    <item>
      <title>Moins de 100 &#8364; pour ce t&#233;l&#233;viseur Xiaomi anim&#233; par Google TV, id&#233;al dans une chambre</title>
      <link>https://www.frandroid.com/bons-plans/2902175_moins-de-100-e-pour-ce-televiseur-xiaomi-anime-par-google-tv-ideal-dans-une-chambre</link>
      <pubDate>Mon, 08 Dec 2025 15:38:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2902175_moins-de-100-e-pour-ce-televiseur-xiaomi-anime-par-google-tv-ideal-dans-une-chambre</guid>
      <description>
L'an dernier, Xiaomi a d&#233;voil&#233; plusieurs t&#233;l&#233;viseurs LCD d&#8217;entr&#233;e de gamme sous Google TV, parmi lesquels on trouvait le TV A 32. Un mod&#232;le de 32 pouces, donc, qui peut en ce moment vous revenir &#224; seulement 98,97 euros sur AliExpress, alors que la marque le propose sur son site &#224; 129,99 euros.
</description>
    </item>
    <item>
      <title>&#201;tats-Unis | Trump veut emp&#234;cher les &#201;tats de r&#233;guler l&#8217;intelligence artificielle</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-12-08/etats-unis/trump-veut-empecher-les-etats-de-reguler-l-intelligence-artificielle.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Mon, 08 Dec 2025 10:37:13 -0500</pubDate>
      <guid isPermaLink="false">250ed79647e23af695aadf8654ca1ee7</guid>
      <description>Donald Trump a annonc&#233; lundi qu&#8217;il allait signer un d&#233;cret dans la semaine pour emp&#234;cher les &#201;tats am&#233;ricains de r&#233;guler l&#8217;intelligence artificielle (IA) &#224; leur niveau, beaucoup ayant d&#233;j&#224; l&#233;gif&#233;r&#233; en l&#8217;absence d&#8217;un cadre f&#233;d&#233;ral.</description>
    </item>
    <item>
      <title>US gov wants Google and Apple to take down websites tracking ICE and friends</title>
      <link>https://www.techradar.com/pro/us-gov-wants-google-and-apple-to-take-down-websites-tracking-ice-and-friends</link>
      <pubDate>Mon, 08 Dec 2025 15:35:00 +0000</pubDate>
      <guid isPermaLink="false">tETDKHPD4k2ZJrv6gzY8Q</guid>
      <description>The US government wants to ensure that apps like ICEBlock don&#8217;t make it to online app stores.</description>
    </item>
    <item>
      <title>Data centers are throttling home building as infrastructure struggles to keep up with AI demands</title>
      <link>https://www.techradar.com/pro/data-centers-are-throttling-home-building-as-infrastructure-struggles-to-keep-up-with-ai-demands</link>
      <pubDate>Mon, 08 Dec 2025 15:35:00 +0000</pubDate>
      <guid isPermaLink="false">dTsSC6GCHvo7kqSNDTLyrC</guid>
      <description>Some housing projects in London have been delayed due to data center electricity demand.</description>
    </item>
    <item>
      <title>Quel est le meilleur PC portable &#224; acheter pour moins de 1000 &#8364; en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/638396_quels-sont-les-meilleurs-pc-portables-a-moins-de-1000-euros-en-2019</link>
      <pubDate>Mon, 08 Dec 2025 15:34:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/638396_quels-sont-les-meilleurs-pc-portables-a-moins-de-1000-euros-en-2019</guid>
      <description>
On trouve aujourd'hui d'excellents ordinateurs portables avec un rapport qualit&#233;/prix int&#233;ressant. Mais l'offre est tr&#232;s vari&#233;e, alors comment choisir ? Voici nos recommandations des meilleurs mod&#232;les de PC portables sous les 1000 euros.
</description>
    </item>
    <item>
      <title>Un Unlock Talk sp&#233;cial fin d&#8217;ann&#233;e et trois Matinales Tech&#8217; : voici notre programme Twitch de la semaine</title>
      <link>https://www.frandroid.com/humanoid/emissions/2632585_un-unlock-talk-special-fin-dannee-et-trois-matinales-tech-voici-notre-programme-twitch-de-la-semaine</link>
      <pubDate>Mon, 08 Dec 2025 15:34:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/emissions/2632585_un-unlock-talk-special-fin-dannee-et-trois-matinales-tech-voici-notre-programme-twitch-de-la-semaine</guid>
      <description>
Notre programme Twitch de la semaine du 8 d&#233;cembre, c&#8217;est juste ici&#160;: nous vous donnons rendez-vous mardi, mercredi, jeudi et vendredi sur notre cha&#238;ne Frandroidlive, autant pour siroter votre caf&#233; devant notre Matinale Tech' que pour profiter d'une &#233;dition Unlock Talk un poil sp&#233;ciale. 
</description>
    </item>
    <item>
      <title>Avatar: Fire &amp; Ash&#8217;s Golden Globes 2026 nominations are unhinged, but my pick for Best Picture winner isn&#8217;t</title>
      <link>https://www.techradar.com/streaming/entertainment/avatar-fire-and-ashs-golden-globes-2026-nominations-are-unhinged-but-my-pick-for-best-picture-winner-isnt</link>
      <pubDate>Mon, 08 Dec 2025 15:33:59 +0000</pubDate>
      <guid isPermaLink="false">hVJ7CRLLqx3GAMyPsoSACA</guid>
      <description>The Golden Globes 2026 nominations are now out &#8211; and judging by the Best Picture category, the best movie of 2025 hasn't even been released.</description>
    </item>
    <item>
      <title>Yep, Xbox Is Bleeding Out</title>
      <link>https://gizmodo.com/xbox-is-bleeding-out-black-friday-2025-sales-2000696718</link>
      <pubDate>Mon, 08 Dec 2025 15:33:20 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000696718</guid>
      <description>Microsoft really doesn&#8217;t care about consoles anymore.</description>
    </item>
    <item>
      <title>Fini la r&#233;installation obligatoire de Windows 11 : Microsoft d&#233;bloque enfin cette option de s&#233;curit&#233; cruciale</title>
      <link>https://www.frandroid.com/marques/microsoft/2902205_fini-la-reinstallation-obligatoire-de-windows-11-microsoft-debloque-enfin-cette-option-de-securite-cruciale</link>
      <pubDate>Mon, 08 Dec 2025 15:33:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2902205_fini-la-reinstallation-obligatoire-de-windows-11-microsoft-debloque-enfin-cette-option-de-securite-cruciale</guid>
      <description>
Microsoft retire un pr&#233;requis important pour l'utilisation d'une fonctionnalit&#233; propre &#224; Windows 11.
</description>
    </item>
    <item>
      <title>ChatGPT users are making a Spotify Wrapped for their year in AI &#8212; here's how to do it</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/chatgpt-users-are-making-a-spotify-wrapped-for-their-year-in-ai-heres-how-to-do-it</link>
      <pubDate>Mon, 08 Dec 2025 15:32:33 +0000</pubDate>
      <guid isPermaLink="false">YaaPe6T2SJaBDfWxsBPazR</guid>
      <description>This prompt gives you ChatGPT's version of Spotify Wrapped, and it's an excellent way to see how you've used AI over the last 12 months.</description>
    </item>
    <item>
      <title>Les 10 smartphones les plus populaires de la semaine sur Frandroid : Samsung toujours au sommet, talonn&#233; par Xiaomi</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2491986_les-10-smartphones-les-plus-populaires-de-la-semaine-sur-frandroid-samsung-toujours-au-sommet-talonne-par-xiaomi</link>
      <pubDate>Mon, 08 Dec 2025 15:30:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2491986_les-10-smartphones-les-plus-populaires-de-la-semaine-sur-frandroid-samsung-toujours-au-sommet-talonne-par-xiaomi</guid>
      <description>
Pour notre top 10 des smartphones les plus populaires de la semaine sur Frandroid, certaines marques prennent le dessus. Au programme de ce top, Samsung et Xiaomi sont omnipr&#233;sents.
</description>
    </item>
    <item>
      <title>Une loi qui a cout&#233; 100&#160;millions d&#8217;euros aux Fran&#231;ais&#160;? De quoi se plaint vraiment Amazon&#160;?</title>
      <link>https://www.01net.com/actualites/une-loi-qui-a-coute-100-millions-deuros-aux-francais-de-quoi-se-plaint-vraiment-amazon.html</link>
      <pubDate>Mon, 08 Dec 2025 15:22:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314262</guid>
      <description>Deux ans apr&#232;s la loi sur les frais de port obligatoires sur les livres, Amazon publie ce lundi 8 d&#233;cembre 2025 une tribune, dans laquelle il d&#233;plore le bilan jug&#233;&#160;catastrophique de cette mesure. Celle-ci aurait co&#251;t&#233; plus de 100 millions d'euros aux Fran&#231;ais, selon le g&#233;ant du commerce en ligne.</description>
    </item>
    <item>
      <title>OpenAI says it&#8217;s disabled ad-like app promotions in ChatGPT</title>
      <link>https://www.theverge.com/news/839882/openai-chatgpt-ads-app-promo-messages-turned-off</link>
      <pubDate>2025-12-08T10:21:21-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=839882</guid>
      <description>OpenAI has turned off some promotional app messages in ChatGPT after users complained that the chatbot was showing them ads. In a post on X, OpenAI's chief research officer, Mark Chen, said that the company is working to improve the experience after showing ChatGPT users in-app messages promoting companies like Peloton and Target, and that [&#8230;]</description>
    </item>
    <item>
      <title>Self-healing IT is no longer science fiction &#8211; It&#8217;s driving businesses forward</title>
      <link>https://www.techradar.com/pro/self-healing-it-is-no-longer-science-fiction-its-driving-businesses-forward</link>
      <pubDate>Mon, 08 Dec 2025 15:19:25 +0000</pubDate>
      <guid isPermaLink="false">vGrb36fby547RUD4htPvJG</guid>
      <description>Agentic AI is shifting IT from reactive firefighting to proactive, autonomous system resilience.</description>
    </item>
    <item>
      <title>The Boys is returning for its final season in April</title>
      <link>https://www.theverge.com/news/839879/the-boys-season-five-trailer-release-date-jason-padalecki</link>
      <pubDate>2025-12-08T10:16:16-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=839879</guid>
      <description>The Boys' fifth and final season is headed to Amazon Prime Video on April 8th, 2026. In addition to a release date, Prime Video revealed the trailer for season five during CCXP in Brazil, offering a look at the reunion between Supernatural costars Jared Padalecki and Jensen Ackles, as reported earlier by Variety. The Boys [&#8230;]</description>
    </item>
    <item>
      <title>Paramount goes to war with Netflix for Warner Bros. Discovery with hostile $108.4B bid</title>
      <link>https://techcrunch.com/2025/12/08/paramount-goes-to-war-with-netflix-for-warner-bros-discovery-with-hostile-108-4b-bid/</link>
      <pubDate>Mon, 08 Dec 2025 15:15:08 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3073693</guid>
      <description>Paramount Skydance on Monday launched a hostile, $108.4 billion bid to buy Warner Bros. Discovery, days after Warner Bros. agreed to be acquired by Netflix for $82.7 billion.</description>
    </item>
    <item>
      <title>Gartner advisory states AI browsers are NOT your friend &#8212; and they are putting your business at risk</title>
      <link>https://www.techradar.com/pro/security/gartner-advisory-states-ai-browsers-are-not-your-friend-and-are-putting-your-business-at-risk</link>
      <pubDate>Mon, 08 Dec 2025 15:14:04 +0000</pubDate>
      <guid isPermaLink="false">idMraAosKpsuryPwwXQxe7</guid>
      <description>AI browsers pose a threat to data protection, financial information, and security postures.</description>
    </item>
    <item>
      <title>Netflix-Warner : vous n&#8217;avez rien suivi ? voici notre foire aux questions sur le deal qui chamboule le cin&#233;ma et la SVoD</title>
      <link>https://www.frandroid.com/services/svod/2901563_netflix-warner-vous-navez-rien-suivi-voici-notre-foire-aux-questions-sur-le-deal-qui-chamboule-le-cinema-et-la-svod</link>
      <pubDate>Mon, 08 Dec 2025 15:13:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2901563_netflix-warner-vous-navez-rien-suivi-voici-notre-foire-aux-questions-sur-le-deal-qui-chamboule-le-cinema-et-la-svod</guid>
      <description>
S'il y a des personnes qui ont pass&#233; la derni&#232;re semaine sous un rocher, ou qui se sont simplement coup&#233;es de l'actualit&#233;, sachez que Netflix a annonc&#233; l'acquisition de Warner Bros. Cette fusion de deux titans de l'audiovisuel pose beaucoup de questions auxquelles nous apportons les r&#233;ponses ici.
</description>
    </item>
    <item>
      <title>In 2026, sustainability is the new stack</title>
      <link>https://www.techradar.com/pro/in-2026-sustainability-is-the-new-stack</link>
      <pubDate>Mon, 08 Dec 2025 15:09:39 +0000</pubDate>
      <guid isPermaLink="false">dpxFnDJFTEZhLpxggAxtqg</guid>
      <description>Make 2026 the year sustainably ceases to be a burden, and instead becomes an advantage.</description>
    </item>
    <item>
      <title>Netflix n&#8217;a pas encore rachet&#233; Warner Bros&#160;: son rival Paramount fait une offre folle</title>
      <link>https://www.01net.com/actualites/netflix-pas-encore-rachete-warner-bros-rival-paramount-fait-offre-folle.html</link>
      <pubDate>Mon, 08 Dec 2025 15:06:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314329</guid>
      <description>La bataille autour de Warner Bros. Discovery repart de plus belle. Apr&#232;s avoir &#233;t&#233; doubl&#233; par Netflix, Paramount Skydance revient &#224; la charge avec une contre-offre &#224; 108,4 milliards de dollars.</description>
    </item>
    <item>
      <title>The FBI is hunting for 'unjammable' drones &#8211; and these flying cameras use one very old-school trick to stop remote attacks</title>
      <link>https://www.techradar.com/cameras/drones/the-fbi-is-hunting-for-unjammable-drones-and-these-flying-cameras-use-one-very-old-school-trick-to-stop-remote-attacks</link>
      <pubDate>Mon, 08 Dec 2025 15:06:24 +0000</pubDate>
      <guid isPermaLink="false">TXCcwDPHJhhCoyRSQXGkoD</guid>
      <description>The FBI wants information from companies who can supply drones which use fixed optic fiber connections.</description>
    </item>
    <item>
      <title>Google Pixel 9a drops to its lowest price ever amidst Pixel 10a leaks &#8212; now $349 at Amazon</title>
      <link>https://www.techradar.com/phones/google-pixel-phones/google-pixel-9a-drops-to-lowest-price-ever-amidst-pixel-10a-leaks-now-usd349-at-amazon</link>
      <pubDate>Mon, 08 Dec 2025 15:05:31 +0000</pubDate>
      <guid isPermaLink="false">mED9VrgBLxhwGVNkk9Sqz3</guid>
      <description>The Google Pixel 9a drops to the lowest-ever price of $349 at Amazon</description>
    </item>
    <item>
      <title>Paramount Isn&#8217;t Letting Netflix Get Warner Bros. Without a Fight</title>
      <link>https://gizmodo.com/paramount-warner-bros-hostile-bid-netflix-trump-2000696720</link>
      <pubDate>Mon, 08 Dec 2025 15:00:52 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000696720</guid>
      <description>Still fresh off of the completion of its own megamerger, Paramount is staging a hostile bidding war in an attempt to disrupt Netflix and Warner Bros.' takeover.</description>
    </item>
    <item>
      <title>Square&#8217;s product chief on the death of the penny and the future of money</title>
      <link>https://www.theverge.com/podcast/839062/square-product-chief-willem-ave-block-jack-dorsey-ai-bitcoin-crypto</link>
      <pubDate>2025-12-08T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=839062</guid>
      <description>Today, I&#8217;m talking with Willem Av&#233;, who&#8217;s head of product at Square. You know Square &#8212; it was started by billionaire Jack Dorsey, of Twitter fame, more than 15 years ago, and it got big on the back of that little magnetic reader that plugged into the headphone jack of the iPhone and let small [&#8230;]</description>
    </item>
    <item>
      <title>Quordle hints and answers for Tuesday, December 9 (game #1415)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-9-december-2025</link>
      <pubDate>Mon, 08 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">KsfVSFzxTrmsCQiEKqTpbD</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Tuesday, December 9 (game #912)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-9-december-2025</link>
      <pubDate>Mon, 08 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">kMsr5HEeqoptqwaFLTRsGS</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Tuesday, December 9 (game #646)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-9-december-2025</link>
      <pubDate>Mon, 08 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">8d698ukk8rJFuGbmYusiyK</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>The Honor Magic 8 Lite has the best battery life of any phone I've ever tested &#8211; but it's not a total home run</title>
      <link>https://www.techradar.com/phones/honor-phones/honor-magic-8-lite-review</link>
      <pubDate>Mon, 08 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">QzkcXLiaEzgva7vnf43AP8</guid>
      <description>The Honor Magic 8 Lite boasts some of the best battery life on the market, but it's let down by middling cameras and average performance.</description>
    </item>
    <item>
      <title>Booking.com&#8217;s agent strategy: Disciplined, modular and already delivering 2&#215; accuracy</title>
      <link>https://venturebeat.com/ai/booking-coms-agent-strategy-disciplined-modular-and-already-delivering-2</link>
      <pubDate>Mon, 08 Dec 2025 15:00:00 GMT</pubDate>
      <guid isPermaLink="false">2Xt7X8jWpMO9dIym7Mtwr0</guid>
      <description>When many enterprises weren&#8217;t even thinking about agentic behaviors or infrastructures, Booking.com had already &#8220;stumbled&#8221; into them with its homegrown conversational recommendation system. 

This early experimentation has allowed the company to take a step back and avoid getting swept up in the frantic AI agent hype. Instead, it is taking a disciplined, layered, modular approach to model development: small, travel-specific models for cheap, fast inference; larger large language models (LLMs) for reasoning and understanding; and domain-tuned evaluations built in-house when precision is critica...</description>
    </item>
    <item>
      <title>IBM to acquire Confluent for $11B as it seeks to bolster its data offerings</title>
      <link>https://techcrunch.com/2025/12/08/ibm-to-acquire-confluent-for-11b-as-it-seeks-to-bolster-its-data-offerings/</link>
      <pubDate>Mon, 08 Dec 2025 14:56:10 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3073684</guid>
      <description>IBM is buying data infrastructure company Confluent for $11 billion in cash in a bid to to bolster its data and automation products as ever more companies move their tech operations to the cloud and deploy AI technology.</description>
    </item>
    <item>
      <title>Ultimate Ears Wonderboom Play :  cette enceinte Bluetooth est en promo &#224; -44 %</title>
      <link>https://www.frandroid.com/bons-plans/2593833_ultimate-ears-wonderboom-play-cette-enceinte-bluetooth-est-en-promo-a-moins-44-pourcents</link>
      <pubDate>Mon, 08 Dec 2025 14:53:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2593833_ultimate-ears-wonderboom-play-cette-enceinte-bluetooth-est-en-promo-a-moins-44-pourcents</guid>
      <description>
Celles et ceux qui cherchent une petite enceinte puissante et bien r&#233;sistante pourront se tourner vers la Wonderboom Play d'Ultimate Ears. En plus, elle est en promo et co&#251;te 49,99 euros au lieu de 89,99 euros sur fnac.com.
</description>
    </item>
    <item>
      <title>&#171;&#160;Je n&#8217;ai jamais vu une telle fluidit&#233;&#160;&#187; : la derni&#232;re mise &#224; jour des Pixel semblent faire des miracles</title>
      <link>https://www.frandroid.com/marques/google/2902067_je-nai-jamais-vu-une-telle-fluidite-la-derniere-mise-a-jour-des-pixel-semblent-faire-des-miracles</link>
      <pubDate>Mon, 08 Dec 2025 14:53:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2902067_je-nai-jamais-vu-une-telle-fluidite-la-derniere-mise-a-jour-des-pixel-semblent-faire-des-miracles</guid>
      <description>
Les d&#233;tenteurs d'un smartphone Pixel commencent &#224; recevoir la mise &#224; jour de d&#233;cembre 2025 et les premiers retours sont tr&#232;s enthousiastes.
</description>
    </item>
    <item>
      <title>I'm a marathon runner and these are the running gifts I wish someone would buy me, plus the ones I'd give to new starters</title>
      <link>https://www.techradar.com/health-fitness/im-a-marathon-runner-and-these-are-the-running-gifts-i-wish-someone-would-buy-me-plus-the-ones-id-give-to-new-starters</link>
      <pubDate>Mon, 08 Dec 2025 14:45:42 +0000</pubDate>
      <guid isPermaLink="false">kn3WSvivcZ7DweQkztmpsf</guid>
      <description>From top-tier running socks to training and recovery accessories, these are 12 running gifts sporty people will be glad to get.</description>
    </item>
    <item>
      <title>&#171;&#160;Risques de blessures&#160;&#187; : ne roulez plus avec ces v&#233;los vendus chez D&#233;cathlon et Nature &amp; D&#233;couvertes</title>
      <link>https://www.01net.com/actualites/alerte-velos-vendus-decathlon-nature-decouvertes-rappeles-risque-blessures.html</link>
      <pubDate>Mon, 08 Dec 2025 14:40:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314269</guid>
      <description>Un rappel national touche des v&#233;los-cargos vendus depuis plusieurs ann&#233;es chez D&#233;cathlon et Nature &amp; D&#233;couvertes. Une anomalie d&#233;tect&#233;e sur la fourche pourrait entra&#238;ner un risque de blessures.</description>
    </item>
    <item>
      <title>Paramount launches a hostile $108 billion bid to snatch Warner from Netflix</title>
      <link>https://www.theverge.com/news/839813/paramount-skydance-warner-bros-discovery-hostile-takeover-bid</link>
      <pubDate>2025-12-08T09:39:44-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=839813</guid>
      <description>Paramount has launched a $108.4 billion hostile takeover bid for Warner Bros. Discovery, calling Netflix's $83 billion arrangement to purchase the entertainment giant's studios and streaming service "inferior." The Paramount proposal, unlike Netflix's, would also include the linear networks owned by WBD. Paramount says its deal offers a "superior alternative to the Netflix transaction," citing [&#8230;]...</description>
    </item>
  </channel>
</rss>
