<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 09 Feb 2026 13:19:43 GMT</lastBuildDate>
    <item>
      <title>Pas de gros changements &#224; l&#8217;horizon pour iOS 27, Apple voudrait am&#233;liorer l&#8217;existant</title>
      <link>https://www.01net.com/actualites/pas-de-gros-changements-a-lhorizon-pour-ios-27-apple-voudrait-ameliorer-lexistant.html</link>
      <pubDate>Mon, 09 Feb 2026 13:17:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324868</guid>
      <description>Il n'y a pas que le mat&#233;riel dans la vie. Du moins chez Apple, qui certes devrait avoir une ann&#233;e 2026 bien remplie de ce c&#244;t&#233; &#8212; avec un iPhone 17e en ligne de mire pour tr&#232;s bient&#244;t ? &#8212;, mais qui a aussi plusieurs fers au feu au chapitre logiciel. Entre iOS 26.3 en version finale dans les prochains jours, iOS 26.4 avec le nouveau Siri dans ses bagages et iOS 27 &#224; l'horizon, les d&#233;veloppeurs de la firme &#224; la pomme sont bien occup&#233;s....</description>
    </item>
    <item>
      <title>PlayStation annonce un gros State of Play pour cette semaine</title>
      <link>https://www.frandroid.com/marques/sony/2970981_playstation-annonce-un-gros-state-of-play-pour-cette-semaine</link>
      <pubDate>Mon, 09 Feb 2026 13:17:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2970981_playstation-annonce-un-gros-state-of-play-pour-cette-semaine</guid>
      <description>
Sony annonce une grande conf&#233;rence State of Play avec de nouvelles annonces PlayStation Studios pour ce jeudi 12 f&#233;vrier 2026.
</description>
    </item>
    <item>
      <title>Test du Secretlab Magnus Evo : un bureau qui fait dispara&#238;tre les c&#226;bles (vraiment)</title>
      <link>https://www.frandroid.com/test/2962503_test-du-secretlab-magnus-evo-un-bureau-qui-fait-disparaitre-les-cables-vraiment</link>
      <pubDate>Mon, 09 Feb 2026 13:05:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/test/2962503_test-du-secretlab-magnus-evo-un-bureau-qui-fait-disparaitre-les-cables-vraiment</guid>
      <description>
Les c&#226;bles qui pendent sous un bureau, c'est le calvaire. Secretlab promet d'y rem&#233;dier avec le bureau assis-debout Magnus Evo : colonne d'alimentation int&#233;gr&#233;e dans le pied, rail magn&#233;tique sur toute la longueur, et surtout un &#233;cosyst&#232;me d'accessoires optionnels pour exploiter pleinement le concept.
</description>
    </item>
    <item>
      <title>HBO Max UK gets confirmed March launch date &#8212; and it'll be cheaper than Netflix</title>
      <link>https://www.techradar.com/streaming/hbo-max/hbo-max-uk-gets-confirmed-march-launch-date-and-itll-be-cheaper-than-netflix</link>
      <pubDate>Mon, 09 Feb 2026 13:04:16 +0000</pubDate>
      <guid isPermaLink="false">NXGy9K9RTU272FVUnt7cmR</guid>
      <description>HBO Max UK locks in its springtime launch date &#8211; and not only does it mean some huge changes, it's fantastic news for one of its most beloved shows.</description>
    </item>
    <item>
      <title>Nouvelle fuite de donn&#233;es en France&#160;: la plateforme de v&#233;rification d&#8217;identit&#233; Sumsub a &#233;t&#233; pirat&#233;e</title>
      <link>https://www.01net.com/actualites/nouvelle-fuite-donnees-france-plateforme-verification-identite-sumsub.html</link>
      <pubDate>Mon, 09 Feb 2026 13:00:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324866</guid>
      <description>Une fuite de donn&#233;es pass&#233;e sous les radars pendant dix&#8209;huit mois frappe l&#8217;un des principaux tiers de confiance du num&#233;rique en France. En exploitant une faille, un pirate est parvenu &#224; consulter les donn&#233;es personnelles d&#233;tenues par la soci&#233;t&#233; Sumsub.</description>
    </item>
    <item>
      <title>Two &#8216;Friday the 13th&#8217; Movies Return to Theaters This Week</title>
      <link>https://gizmodo.com/two-friday-the-13th-movies-return-to-theaters-this-week-2000719435</link>
      <pubDate>Mon, 09 Feb 2026 13:00:23 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000719435</guid>
      <description>Regal Cinemas is hoping you're in a slasher mood this Friday the 13th and want to see the first two 'Friday' movies on the big screen again.</description>
    </item>
    <item>
      <title>Ferrari&#8217;s New Jony Ive&#8211;Designed EV Is Swathed in Glass and Aluminum</title>
      <link>https://www.wired.com/story/ferrari-ev-jony-ive-design/</link>
      <pubDate>Mon, 09 Feb 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">6985127363de1feb1eefeacf</guid>
      <description>We got a peek at the interior of Ferrari&#8217;s new Luce electric car, which was dreamed up by famed ex-Apple designer and his firm, LoveFrom. It looks and feels a whole lot like an Apple product.</description>
    </item>
    <item>
      <title>Top photo ID apps leak user data - over 150,000 thought to have been affected</title>
      <link>https://www.techradar.com/pro/security/top-photo-id-apps-leak-user-data-over-150-000-thought-to-have-been-affected</link>
      <pubDate>Mon, 09 Feb 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">EqLxvLkQoVp3GoaXGokrVQ</guid>
      <description>Database misconfigurations resulted in a huge data leak which hackers already picked up on.</description>
    </item>
    <item>
      <title>Inside Ferrari's Luce EV: The Jony Ive interior is here</title>
      <link>https://www.engadget.com/transportation/evs/inside-ferraris-luce-ev-the-jony-ive-interior-is-here-130000211.html?src=rss</link>
      <pubDate>Mon, 09 Feb 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">66a8876f-55bd-464e-8410-3eefcde7c921</guid>
      <description>Since Apple finally put its mysterious and long-suffering Project Titan out to pasture, we've wondered what a Jony Ive-designed Apple Car might have looked like. Today, we might have a clue. This, though, is no Apple Car. It's the Ferrari Luce ("light" in Italian), the actual name for the EV formerly known as Elettrica, and I'm fresh from getting a walkthrough of the thing from Sir Ive himself. At a glance things look like you might have expected, but there are a few surprises here.While Ferrari has sold hybrids in some form or another since 2013's LaFerrari, Luce (n&#233;e Elettrica) will be the c...</description>
    </item>
    <item>
      <title>This superb 77-inch LG OLED deal has already won the President&#8217;s Day sales</title>
      <link>https://www.techradar.com/televisions/this-77-inch-lg-oled-deal-has-already-won-the-presidents-day-sales</link>
      <pubDate>Mon, 09 Feb 2026 12:59:39 +0000</pubDate>
      <guid isPermaLink="false">VpmCuRvC8T9MnR29y8Bwtm</guid>
      <description>The President's Day sales means big savings, and this deal on the LG B5 OLED TV is one you won't want to miss.</description>
    </item>
    <item>
      <title>I test new gaming audio gear every week &#8212; these are the products I can't game without</title>
      <link>https://www.techradar.com/gaming/gaming-accessories/i-test-new-gaming-audio-gear-every-week-these-are-the-products-i-cant-game-without</link>
      <pubDate>Mon, 09 Feb 2026 12:57:04 +0000</pubDate>
      <guid isPermaLink="false">TP5SBinAP4onheS8dEQoFQ</guid>
      <description>These are the gaming audio products that I rely on in my personal setup as someone that tests them for a living.</description>
    </item>
    <item>
      <title>Nothing beats this pro-grade 3D printer deal with $300 off - Bambu Lab P1S is just $399 with free shipping</title>
      <link>https://www.techradar.com/pro/nothing-beats-this-pro-grade-3d-printer-deal-with-usd300-off-bambu-lab-p1s-is-just-usd399-with-free-shipping</link>
      <pubDate>Mon, 09 Feb 2026 12:53:09 +0000</pubDate>
      <guid isPermaLink="false">gt2dPAGgqbcTfRjSZKPFhg</guid>
      <description>Bambu Lab&#8217;s P1S is now $300 off, down to $399 for a fast, fully enclosed CoreXY 3D printer with up to 20,000 mm/s&#178; acceleration and simple, out-of-the-box setup.</description>
    </item>
    <item>
      <title>La console portable Ayaneo Next 2 embarque jusqu&#8217;&#224; 128 Go de m&#233;moire unifi&#233;e : prix et caract&#233;ristiques techniques</title>
      <link>https://www.frandroid.com/produits-android/console/console-de-jeux/2970915_la-console-portable-ayaneo-next-2-embarque-jusqua-128-go-de-memoire-unifiee-prix-et-caracteristiques-techniques</link>
      <pubDate>Mon, 09 Feb 2026 12:49:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/console-de-jeux/2970915_la-console-portable-ayaneo-next-2-embarque-jusqua-128-go-de-memoire-unifiee-prix-et-caracteristiques-techniques</guid>
      <description>
Regardez bien cette machine. L'Ayaneo Next 2 ne cherche pas &#224; concurrencer la Nintendo Switch ou le Steam Deck. Avec son processeur Ryzen AI Max+ et sa batterie de 116 Wh, elle s'attaque directement aux PC portables de jeu les plus performants du moment.
</description>
    </item>
    <item>
      <title>The RAM crisis is so bad this new gaming handheld costs more than an RTX 5090</title>
      <link>https://www.techradar.com/gaming/the-ram-crisis-is-so-bad-this-new-gaming-handheld-costs-more-than-an-rtx-5090</link>
      <pubDate>Mon, 09 Feb 2026 12:48:59 +0000</pubDate>
      <guid isPermaLink="false">tj4UoUhsPQMq7QcNLvFEQb</guid>
      <description>No handheld needs 128GB of RAM, but Ayaneo doesn't care as its Next 2 handheld costs up to $4,299.</description>
    </item>
    <item>
      <title>How to watch Vanished online &#8211; stream Kaley Cuoco thriller from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/vanished-online-stream-kaley-cuoco-thriller-from-anywhere</link>
      <pubDate>Mon, 09 Feb 2026 12:41:01 +0000</pubDate>
      <guid isPermaLink="false">AaaMXbKv3LScSCeNcWxpkB</guid>
      <description>A romantic getaway spirals into secrets, danger, and deadly deception. Here&#8217;s how you can watch Vanished online and from anywhere.</description>
    </item>
    <item>
      <title>HBO Max is finally launching in the UK next month</title>
      <link>https://www.theverge.com/streaming/875668/hbo-max-is-finally-launching-in-the-uk-next-month</link>
      <pubDate>2026-02-09T07:33:51-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=875668</guid>
      <description>Warner Bros. Discovery has announced that streaming service HBO Max will make its long-awaited debut in the UK and Ireland on March 26th, having previously promised that a launch would happen in early 2026. Until now, most HBO content has been exclusively available in the UK through Sky or the streaming service Now TV. In [&#8230;]</description>
    </item>
    <item>
      <title>Renault&#160;: la justice allemande ordonne l&#8217;arr&#234;t des ventes de Clio et M&#233;gane, voici ce qui va se passer</title>
      <link>https://www.01net.com/actualites/renault-la-justice-allemande-ordonne-larret-des-ventes-de-clio-et-megane-voici-ce-qui-va-se-passer.html</link>
      <pubDate>Mon, 09 Feb 2026 12:33:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324837</guid>
      <description>Coup de tonnerre outre-Rhin. Le tribunal de Munich vient de prononcer une interdiction de vente contre certains mod&#232;les phares de Renault pour violation de brevet. Si la menace est r&#233;elle, le constructeur fran&#231;ais dispose encore de plusieurs leviers pour &#233;viter le pire.</description>
    </item>
    <item>
      <title>Best Ebike Locks (2026): Kryptonite, Litelok, Abus, Hiplok</title>
      <link>https://www.wired.com/gallery/best-electric-bike-locks/</link>
      <pubDate>Mon, 09 Feb 2026 12:30:00 +0000</pubDate>
      <guid isPermaLink="false">5f775dca65691defc2ab7d97</guid>
      <description>These are our favorite ebike locks for every ride, including the best bike locks designed to thwart angle grinders.</description>
    </item>
    <item>
      <title>No, the Nvidia RTX 5090 Ti GPU isn't coming out this year &#8212; here's why</title>
      <link>https://www.techradar.com/computing/gpu/no-the-nvidia-rtx-5090-ti-gpu-isnt-coming-out-this-year-heres-why</link>
      <pubDate>Mon, 09 Feb 2026 12:24:37 +0000</pubDate>
      <guid isPermaLink="false">52hZPiJSnkCgTs3zw8j8Rm</guid>
      <description>An Nvidia RTX 5090 Ti arriving in Q3 2026 is the least likely GPU rumor I've heard in a long while.</description>
    </item>
    <item>
      <title>Live Nation&#8217;s monopoly trial is reportedly fracturing Trump&#8217;s Justice Department</title>
      <link>https://www.theverge.com/policy/875665/live-nation-ticketmaster-settlement-doj-discussions-monopoly-trial</link>
      <pubDate>2026-02-09T07:22:41-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=875665</guid>
      <description>Live Nation executives have reportedly sidestepped the Justice Department's antitrust division to negotiate directly with more sympathetic senior officials in the hopes of avoiding a monopoly trial. Citing "people familiar with the matter," Semafor reports that some talks have excluded antitrust chief Gail Slater, who has pushed for a trial to take place in March [&#8230;]...</description>
    </item>
    <item>
      <title>Fresh leak reveals the full specs for the Sony WF-1000XM6 &#8211; and these wireless earbuds look like a serious upgrade</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/fresh-leak-reveals-the-full-specs-for-the-sony-wf-1000xm6-and-these-wireless-earbuds-look-like-a-serious-upgrade</link>
      <pubDate>Mon, 09 Feb 2026 12:22:18 +0000</pubDate>
      <guid isPermaLink="false">DkKeE5sBHMYJAEo3rh5Aj6</guid>
      <description>You'll soon be able to treat your ears to Sony's "next generation" wireless earbuds, and now we may know the specs.</description>
    </item>
    <item>
      <title>EU warns Meta over blocking rival AI chatbots on WhatsApp</title>
      <link>https://www.engadget.com/big-tech/eu-warns-meta-over-blocking-rival-ai-chatbots-on-whatsapp-121708895.html?src=rss</link>
      <pubDate>Mon, 09 Feb 2026 12:17:08 +0000</pubDate>
      <guid isPermaLink="false">59b104fd-27bb-44dd-9d97-bbb9f6d14283</guid>
      <description>The EU could take "interim measures" against WhatsApp as it investigates AI providers' access to the app. On Monday, the EU's regulatory arm announced its "preliminary view" that Meta, WhatsApp's parent company, violated antitrust laws by blocking third-party AI assistants from operating on WhatsApp.&#160;
The European Commission's is concerned that Meta's actions will limit competitors from entering the AI assistant market. "We must protect effective competition in this vibrant field, which means we cannot allow dominant tech companies to illegally leverage their dominance to give themselves an un...</description>
    </item>
    <item>
      <title>32 Go de RAM pour tenir la distance face &#224; la flamb&#233;e des prix : le ASUS TUF Gaming F16 &#224; moins de 1 000 &#8364; a de solides arguments</title>
      <link>https://www.frandroid.com/bons-plans/2970591_32-go-de-ram-pour-tenir-la-distance-face-a-la-flambee-des-prix-le-asus-tuf-gaming-f16-a-moins-de-1-000-e-a-de-solides-arguments</link>
      <pubDate>Mon, 09 Feb 2026 12:14:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2970591_32-go-de-ram-pour-tenir-la-distance-face-a-la-flambee-des-prix-le-asus-tuf-gaming-f16-a-moins-de-1-000-e-a-de-solides-arguments</guid>
      <description>
Si vous cherchez un bon laptop pour jouer, cr&#233;er ou travailler, vous avez l'Asus TUF Gaming F16 en promo &#224; 999,99 euros au lieu de 1199,99 euros sur Cdiscount.
</description>
    </item>
    <item>
      <title>I test coffee makers for a living, and this tiny De'Longhi espresso machine is the only one with a permanent spot on my own kitchen counter</title>
      <link>https://www.techradar.com/home/coffee-machines/i-test-coffee-makers-for-a-living-and-this-tiny-delonghi-espresso-machine-is-the-only-one-with-a-permanent-spot-on-my-own-kitchen-counter</link>
      <pubDate>Mon, 09 Feb 2026 12:12:41 +0000</pubDate>
      <guid isPermaLink="false">NLMtkAu2Rxp9RKWoq4feMB</guid>
      <description>The De'Longhi Dedica Duo is small but perfectly formed, and proves that great espresso doesn't have to be expensive.</description>
    </item>
    <item>
      <title>YouTube Music&#160;: vous voulez les paroles&#160;? Il faut payer</title>
      <link>https://www.01net.com/actualites/youtube-music-vous-voulez-les-paroles-il-faut-payer.html</link>
      <pubDate>Mon, 09 Feb 2026 12:08:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324825</guid>
      <description>YouTube Music durcit les r&#232;gles. La plateforme de streaming audio met en place une nouvelle restriction et r&#233;serve d&#233;sormais l&#8217;acc&#232;s complet aux paroles des chansons &#224; ses abonn&#233;s Premium.</description>
    </item>
    <item>
      <title>Aspirateur robot &#224; 1200 euros : l&#8217;investissement est-il vraiment rentable ?</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/aspirateurs-balais-sans-fil/2970891_aspirateur-robot-a-1200-euros-linvestissement-est-il-vraiment-rentable</link>
      <pubDate>Mon, 09 Feb 2026 12:06:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/aspirateurs-balais-sans-fil/2970891_aspirateur-robot-a-1200-euros-linvestissement-est-il-vraiment-rentable</guid>
      <description>
Chaque fois qu'on teste un robot &#224; 1 200 euros, certains commentaires s'enflamment. &#171; C'est le prix d'un MacBook ! &#187;, &#171; &#192; ce prix, je fais le m&#233;nage moi-m&#234;me ! &#187;. Mais avez-vous d&#233;j&#224; calcul&#233; la valeur de votre temps ? La r&#233;alit&#233; est math&#233;matique : ce n'est pas un luxe, c'est un investissement.
</description>
    </item>
    <item>
      <title>On a pass&#233; le smartphone avec sa batterie gigantesque de 10&#160;000 mAh au labo, voici comment il s&#8217;en est sorti dans notre test d&#8217;autonomie ind&#233;pendant</title>
      <link>https://www.01net.com/actualites/on-a-passe-le-smartphone-a-10000-mah-de-batterie-au-labo-voici-comment-il-sen-est-sorti-dans-notre-test-dautonomie-independant.html</link>
      <pubDate>Mon, 09 Feb 2026 12:03:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324820</guid>
      <description>Realme frappe fort avec son P4&#8239;Power&#8239;: un smartphone au format &#171; classique &#187; dot&#233; d&#8217;une batterie record de 10&#8239;001&#8239;mAh. Un exploit technique rendu possible par la technologie silicium-carbone, qui remet en question notre vision de l&#8217;autonomie mobile.</description>
    </item>
    <item>
      <title>The Next &#8216;Minions&#8217; Movie Is a Big Ol&#8217; Monster Mash</title>
      <link>https://gizmodo.com/minions-monsters-super-bowl-trailer-2000719453</link>
      <pubDate>Mon, 09 Feb 2026 12:00:09 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000719453</guid>
      <description>The chattering yellow guys of 'Despicable Me' are back in the all-new adventure 'Minions &amp; Monsters' due out in July.</description>
    </item>
    <item>
      <title>Soundcore Aerofit 2 Pro Review: Open Earbuds With ANC?</title>
      <link>https://www.wired.com/review/anker-soundcore-aerofit-2-pro/</link>
      <pubDate>Mon, 09 Feb 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">69838dc8089bf4cf8a1c07fe</guid>
      <description>The design of Soundcore's latest open earbuds magically transforms them into noise-cancelling buds, but does it actually work?</description>
    </item>
    <item>
      <title>No Company Has Admitted to Replacing Workers With AI in New York</title>
      <link>https://www.wired.com/story/no-company-has-admitted-to-replacing-workers-with-ai-in-new-york/</link>
      <pubDate>Mon, 09 Feb 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">69836c7e25425565f71aef56</guid>
      <description>New York state has required companies to disclose if &#8220;technological innovation or automation&#8221; was the cause of job loss for nearly a year. So far, none has.</description>
    </item>
    <item>
      <title>Openreach is planning major price hikes to force business users off old copper networks</title>
      <link>https://www.techradar.com/pro/openreach-is-planning-major-price-hikes-to-force-business-users-off-old-copper-networks</link>
      <pubDate>Mon, 09 Feb 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">gfymqLjMms9s9xmZEsDJEm</guid>
      <description>Three price hikes this year could see copper networks costing businesses twice as much as they did last year.</description>
    </item>
    <item>
      <title>How leaders at major consumer brands keep current with Gen Z</title>
      <link>https://www.fastcompany.com/91485367/how-leaders-at-major-consumer-brands-keep-current-with-gen-z</link>
      <pubDate>2026-02-09T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91485367/how-leaders-at-major-consumer-brands-keep-current-with-gen-z</guid>
      <description>Leaders at major brands like American Eagle, PepsiCo, and E.l.f. Beauty explain how they stay connected with Gen Z and Generation Alpha.
Hello and welcome to Modern CEO! I&#8217;m Stephanie Mehta, CEO and chief content officer of Mansueto Ventures. Each week this newsletter explores inclusive approaches to leadership drawn from conversations with executives and entrepreneurs, and from the pages of Inc. and Fast Company. If you received this newsletter from a friend, you can sign up to get it yourself every Monday morning....</description>
    </item>
    <item>
      <title>Ce que r&#233;v&#232;le un rapport sans concessions sur la d&#233;carbonation de l&#8217;aviation</title>
      <link>https://www.futura-sciences.com/sciences/actualites/aeronautique-ce-revele-rapport-concessions-decarbonation-aviation-131019/#xtor%3DRSS-8</link>
      <pubDate>Mon, 09 Feb 2026 12:59:25 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/aeronautique-ce-revele-rapport-concessions-decarbonation-aviation-131019/#xtor%3DRSS-8</guid>
      <description>Au c&#339;ur des pr&#233;occupations climatiques mondiales, le secteur de l'aviation se trouve sous une pression croissante pour r&#233;duire son empreinte carbone. Responsable d'environ 3&#8239;% des &#233;missions de CO&#8322;, l'aviation doit r&#233;pondre aux d&#233;fis pos&#233;s par l'Accord de Paris en alignant ses pratiques avec des...</description>
    </item>
    <item>
      <title>Don&#8217;t cancel yet &#8211; YouTube TV is giving some subscribers an $80 saving to stop a post-Super Bowl exodus, and here&#8217;s how to find it</title>
      <link>https://www.techradar.com/streaming/dont-cancel-yet-youtube-tv-is-giving-some-subscribers-an-usd80-saving-to-stop-a-post-super-bowl-exodus-and-heres-how-to-find-it</link>
      <pubDate>Mon, 09 Feb 2026 11:43:10 +0000</pubDate>
      <guid isPermaLink="false">HBEcWBuhehYLWXME9VzX9H</guid>
      <description>YouTube TV is offering a huge deal for existing subscribers, but the catch is that it's only available for a handful of lucky subscribers.</description>
    </item>
    <item>
      <title>The Pok&#233;mon TCG Trainer&#8217;s Toolkit is at a record-low price at Amazon &#8212; save over $20</title>
      <link>https://mashable.com/article/feb-9-pokemon-tcg-trainers-toolkit-2025-deal</link>
      <pubDate>Mon, 09 Feb 2026 11:42:20 +0000</pubDate>
      <guid isPermaLink="false">045Dmg3P0qe3YF5BUTsyXG0</guid>
      <description>The Pok&#233;mon TCG: Trainer&#8217;s Toolkit (2025) is down to $34.45 at Amazon, saving you $22 on a deck-building essential.</description>
    </item>
    <item>
      <title>Bad Bunny Super Bowl halftime show: See it now if you missed it</title>
      <link>https://mashable.com/video/bad-bunny-super-bowl-halftime-show-replay</link>
      <pubDate>Mon, 09 Feb 2026 11:38:04 +0000</pubDate>
      <guid isPermaLink="false">01MW9pLYwEj8njfYOlxng4N</guid>
      <description>The NFL has shared Bad Bunny's full Super Bowl LX halftime show on YouTube. Watch now.</description>
    </item>
    <item>
      <title>'This is not the way': Unimpressed Star Wars fans react to 'terrible' new Super Bowl TV spot for The Mandalorian and Grogu movie</title>
      <link>https://www.techradar.com/streaming/entertainment/this-is-not-the-way-unimpressed-star-wars-fans-react-to-terrible-new-super-bowl-tv-spot-for-the-mandalorian-and-grogu-movie</link>
      <pubDate>Mon, 09 Feb 2026 11:37:51 +0000</pubDate>
      <guid isPermaLink="false">fEmbNnCjZB3PNGogEa8QZ4</guid>
      <description>A new teaser for The Mandalorian and Grogu has been revealed &#8211; and Star Wars fans are struggling to see what the point of it is.</description>
    </item>
    <item>
      <title>1 140 chevaux et version hybride : la fiche technique d&#233;mente de la nouvelle Denza Z9 GT</title>
      <link>https://www.frandroid.com/marques/denza/2970775_1-140-chevaux-et-version-hybride-la-fiche-technique-demente-de-la-nouvelle-denza-z9-gt</link>
      <pubDate>Mon, 09 Feb 2026 11:37:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/denza/2970775_1-140-chevaux-et-version-hybride-la-fiche-technique-demente-de-la-nouvelle-denza-z9-gt</guid>
      <description>
Alors que l'Europe attend encore de voir d&#233;barquer la Denza Z9 GT sur ses routes, BYD ne ch&#244;me pas en Chine. Le constructeur vient de faire certifier une version mise &#224; jour de son immense break de chasse &#233;lectrique et hybride. Au programme : une puissance qui d&#233;passe l'entendement et, surtout, une batterie d'hybride rechargeable de la taille de celle d'une Tesla.
...</description>
    </item>
    <item>
      <title>The best Hulu deals and bundles in February 2026</title>
      <link>https://mashable.com/article/best-hulu-deals-february-2026</link>
      <pubDate>Mon, 09 Feb 2026 11:34:42 +0000</pubDate>
      <guid isPermaLink="false">01rsFgHy1o5kQ6fqGbVPfWS</guid>
      <description>In February 2026, Hulu is offering bundle deals with its service so you can stream excellent shows and movies at a discounted price.</description>
    </item>
    <item>
      <title>L&#8217;iPhone 17e arrive bient&#244;t : date de sortie, encoche, A19, MagSafe, voici tout ce que l&#8217;on sait</title>
      <link>https://www.frandroid.com/marques/apple/2970489_liphone-17e-arrive-bientot-date-de-sortie-encoche-a19-magsafe-voici-tout-ce-que-lon-sait</link>
      <pubDate>Mon, 09 Feb 2026 11:34:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2970489_liphone-17e-arrive-bientot-date-de-sortie-encoche-a19-magsafe-voici-tout-ce-que-lon-sait</guid>
      <description>
L'iPhone 17e ne se contenterait pas de corriger les errances ergonomiques de son a&#238;n&#233;. Il devrait enfin adopter la Dynamic Island ainsi qu'une charge MagSafe.
</description>
    </item>
    <item>
      <title>Le &#171;&#160;premier hardware ChatGPT&#160;&#187; : une pub OpenAI compl&#232;tement bidon enflamme Internet</title>
      <link>https://www.01net.com/actualites/premier-hardware-chatgpt-pub-openai-completement-bidon-enflamme-internet.html</link>
      <pubDate>Mon, 09 Feb 2026 11:33:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324824</guid>
      <description>Quelques jours avant le Super Bowl, une myst&#233;rieuse publicit&#233; OpenAI a &#233;t&#233; diffus&#233;e sur Internet. La vid&#233;o, montrant le &#171; premier hardware ChatGPT &#187;  con&#231;u avec Jony Ive, a enflamm&#233; les r&#233;seaux sociaux. Il s'av&#232;re finalement qu'il s'agissait d'un canular savamment orchestr&#233;.</description>
    </item>
    <item>
      <title>Best Buy's Presidents' Day sale is a return to Black Friday &#8212; shop my expert picks, including 50% off appliances, TVs, AirPods, and more</title>
      <link>https://www.techradar.com/live/news/best-buy-presidents-day-sale-live-2026</link>
      <pubDate>Mon, 09 Feb 2026 11:33:15 +0000</pubDate>
      <guid isPermaLink="false">uuKwPoDFrgkDioN7wixX5Q</guid>
      <description>Best Buy's huge President's Day sale is already live - these are the best deals I've found across the retailer's site today.</description>
    </item>
    <item>
      <title>AI Is Here to Replace Nuclear Treaties. Scared Yet?</title>
      <link>https://www.wired.com/story/satellites-ai-nuclear-treaties/</link>
      <pubDate>Mon, 09 Feb 2026 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">6985f39bb028fff37d1b080d</guid>
      <description>The last major nuclear arms treaty between the US and Russia just expired. Some experts believe a combination of satellite surveillance, AI, and human reviewers can take its place. Others, not so much.</description>
    </item>
    <item>
      <title>Oticon Zeal Review: A High Bar (and Price) for Hearing Aids</title>
      <link>https://www.wired.com/review/oticon-zeal/</link>
      <pubDate>Mon, 09 Feb 2026 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">69850ae95109724bd9905828</guid>
      <description>These ultra-tiny hearing aids push the boundary for high-quality audio in a minuscule prescription package.</description>
    </item>
    <item>
      <title>Google Pixel 10 Pro Fold : ce r&#233;cent smartphone pliant blind&#233; d&#8217;IA est d&#233;j&#224; &#224; prix cass&#233;</title>
      <link>https://www.frandroid.com/bons-plans/2924727_google-pixel-10-pro-fold-ce-recent-smartphone-pliant-blinde-dia-est-deja-a-prix-casse</link>
      <pubDate>Mon, 09 Feb 2026 11:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2924727_google-pixel-10-pro-fold-ce-recent-smartphone-pliant-blinde-dia-est-deja-a-prix-casse</guid>
      <description>
Le Google Pixel 10 Pro Fold est le smartphone le plus cher du catalogue de la firme de Mountain View. Mais en ce moment, la facture est un peu moins douloureuse puisque ce r&#233;cent mod&#232;le pliant est propos&#233; &#224; 1 499 euros au lieu de 1 899 euros.
</description>
    </item>
    <item>
      <title>What is the release date for School Spirits season 3 episode 5 on Paramount+?</title>
      <link>https://www.techradar.com/streaming/paramount-plus/school-spirits-season-3-episode-5-release-date-time</link>
      <pubDate>Mon, 09 Feb 2026 11:26:46 +0000</pubDate>
      <guid isPermaLink="false">wG2VSspNdgiEwhBMDKpVWg</guid>
      <description>Last week finally started to give us answers about the dark entity &#8211; but when does School Spirits season 3 episode 5 drop on Paramount+?</description>
    </item>
    <item>
      <title>&#171; &#199;a me fait flipper &#187; : on a &#233;t&#233; voir les robots que vous allez croiser dans votre Carrefour ou McDo</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/robot-aspirateur/2970011_ca-me-fait-flipper-pourquoi-vous-allez-croiser-les-robots-de-pudu-robotics-dans-votre-carrefour-ou-mcdo</link>
      <pubDate>Mon, 09 Feb 2026 11:24:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/robot-aspirateur/2970011_ca-me-fait-flipper-pourquoi-vous-allez-croiser-les-robots-de-pudu-robotics-dans-votre-carrefour-ou-mcdo</guid>
      <description>
On nous bassine avec l'Optimus de Tesla, mais la r&#233;alit&#233; du terrain est ailleurs. &#192; Shenzhen, chez Pudu Robotics, on ne vend pas du r&#234;ve humano&#239;de pour 2030. On fabrique des machines &#224; roulettes qui nettoient d&#233;j&#224; les sols de McDo et livrent des plateaux chez Carrefour avec une efficacit&#233; redoutable.
</description>
    </item>
    <item>
      <title>Quelle montre connect&#233;e Huawei choisir ? Tout comprendre &#224; la gamme</title>
      <link>https://www.frandroid.com/guide-dachat/2832955_quelle-montre-connectee-huawei-choisir-tout-comprendre-a-la-gamme</link>
      <pubDate>Mon, 09 Feb 2026 11:20:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2832955_quelle-montre-connectee-huawei-choisir-tout-comprendre-a-la-gamme</guid>
      <description>
Sur le march&#233; des smartwatchs, derri&#232;re Apple et Samsung, on retrouve Huawei. Le constructeur chinois propose un catalogue vari&#233; de wearables. Voici quelle montre connect&#233;e Huawei choisir.
</description>
    </item>
  </channel>
</rss>
