<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 26 Dec 2025 17:22:04 GMT</lastBuildDate>
    <item>
      <title>Samsung Refuses to Give Up on Glasses-Free 3D Gaming Monitors</title>
      <link>https://gizmodo.com/samsung-refuses-to-give-up-on-glasses-free-3d-gaming-monitors-2000703471</link>
      <pubDate>Fri, 26 Dec 2025 17:15:53 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703471</guid>
      <description>Samsung's got a whole family of new Odyssey gaming monitors, including a 32-inch 6K Odyssey 3D.</description>
    </item>
    <item>
      <title>Avec l&#8217;IA, les sites Web qui proposent de faux m&#233;dicaments contre l&#8217;ob&#233;sit&#233; se multiplient</title>
      <link>https://www.01net.com/actualites/avec-lia-les-sites-web-qui-proposent-de-faux-medicaments-contre-lobesite-se-multiplient.html</link>
      <pubDate>Fri, 26 Dec 2025 17:01:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317316</guid>
      <description>Des deepfakes pour de faux t&#233;moignages, des faux logos d'une autorit&#233; de sant&#233; destin&#233;e &#224; &#171; certifier &#187; telle vente... Avec l'intelligence artificielle, les sites proposant des produits pr&#233;sent&#233;s comme des &#233;quivalents aux Ozempic, Wegovy, Mounjaro, ces m&#233;dicaments prescrits comme l'ob&#233;sit&#233; et pl&#233;biscit&#233;s sur les r&#233;seaux sociaux comme coupe-faims miracles, se multiplient. Le mois dernier, l'ANSM, l'Agence nationale de s&#233;curit&#233; du m&#233;dicament et des produits de sant&#233;, avait d&#233;j&#224; tir&#233; la sonnette d'alarme....</description>
    </item>
    <item>
      <title>The best iPad accessories for 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-ipad-accessories-130018595.html?src=rss</link>
      <pubDate>Fri, 26 Dec 2025 17:01:27 +0000</pubDate>
      <guid isPermaLink="false">94f7e0a4-2c37-37fd-9879-739177ccbf4c</guid>
      <description>The best iPad accessories can make an aging tablet feel like new again, or give you additional ways to use that new slab you just bought. Whether it's a slim folio case, an Apple Pencil, a docking station or a paper-like screen protector, there are so many iPad accessories out there that can transform how you use your tablet on a regular basis &#8212; and make your iPad last longer, too. We've tested a plethora of accessories over the years, and these are the best iPad accessories you can get right now.
Table of contents

Which iPad generation do you own?
iPad cases
iPad stands and docks
iPad keyboa...</description>
    </item>
    <item>
      <title>Naware&#8217;s chemical-free weed killer tech could change how we treat lawns</title>
      <link>https://techcrunch.com/2025/12/26/nawares-chemical-free-weed-killer-tech-could-change-how-we-treat-lawns/</link>
      <pubDate>Fri, 26 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3062417</guid>
      <description>A classic hardware startup, Naware's founders set out with a problem -- kill weeds without chemicals -- and relentlessly tinkered until they found a solution.</description>
    </item>
    <item>
      <title>Mario Kart World vs Kirby Air Riders: which Nintendo Switch 2 racer is better?</title>
      <link>https://www.techradar.com/gaming/mario-kart-world-vs-kirby-air-riders</link>
      <pubDate>Fri, 26 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">Z6jnLk5JcZGg4DJjThUAzN</guid>
      <description>I love both Mario Kart World and Kirby Air Riders, and here I'm breaking down the differences between the two in a head-to-head battle.</description>
    </item>
    <item>
      <title>Manchester United vs Newcastle live streams: How to watch Premier League 2025-26 from anywhere in the world</title>
      <link>https://www.techradar.com/how-to-watch/football/manchester-united-vs-newcastle-live-streams-how-to-watch-premier-league-2025-26-from-anywhere-in-the-world</link>
      <pubDate>Fri, 26 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">ojLTvvmJrqYmZNFGFHaUbh</guid>
      <description>All the ways to watch Manchester United vs Newcastle live streams online and from anywhere in the only Premier League fixture on Boxing Day.</description>
    </item>
    <item>
      <title>You may soon be able to change your Gmail address</title>
      <link>https://www.engadget.com/computing/you-may-soon-be-able-to-change-your-gmail-address-165633905.html?src=rss</link>
      <pubDate>Fri, 26 Dec 2025 16:56:33 +0000</pubDate>
      <guid isPermaLink="false">7826f190-7502-418e-917f-ea696c8b9f0d</guid>
      <description>A Google support page in Hindi says the ability to change your Gmail address is on the way. The feature would allow you to replace your current @gmail.com address with another. Your old address would remain active as an alias on the account, and all your data would stick around, unaffected.The support page (translated) says that "the ability to change your Google Account email address is gradually rolling out to all users." The change was first spotted on a Google Pixel forum on Telegram and was first reported in the press by 9to5Google.Google hasn't made a formal announcement about the change...</description>
    </item>
    <item>
      <title>LG announces line of premium gaming monitors that offer 5K visuals</title>
      <link>https://www.engadget.com/computing/accessories/lg-announces-line-of-premium-gaming-monitors-that-offer-5k-visuals-165224945.html?src=rss</link>
      <pubDate>Fri, 26 Dec 2025 16:52:24 +0000</pubDate>
      <guid isPermaLink="false">2145f63f-e95d-4f36-82de-658cb8eb94a8</guid>
      <description>LG has revealed a new lineup of gaming monitors just ahead of CES. The UltraGear evo displays offer 5K visuals. Many incorporate on-device AI upscaling, taking some of the burden away from the GPU.&#160;
LG says the tech will let consumers skip out on some card upgrades. This could end up being extremely beneficial because the AI boom has been impacting GPU prices.
LG
There are three displays in the lineup so far, with more to come down the line. There's a 39-inch OLED (39GX950B) that includes the aforementioned AI upscaling to 5K, but also algorithms for scene optimization and sound. The company s...</description>
    </item>
    <item>
      <title>The New &#8216;Stranger Things&#8217; Episodes Chart a Propulsive Path to the Finale</title>
      <link>https://gizmodo.com/the-new-stranger-things-episodes-chart-a-propulsive-path-to-the-finale-2000703283</link>
      <pubDate>Fri, 26 Dec 2025 16:35:24 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703283</guid>
      <description>Season five's second volume has some familiar padding, but it mostly satisfies as the Netflix show races toward its end.</description>
    </item>
    <item>
      <title>Avec ses bras et ses mains, le robot de LG veut s&#8217;occuper des t&#226;ches domestiques</title>
      <link>https://www.01net.com/actualites/avec-ses-bras-et-ses-mains-le-robot-de-lg-veut-soccuper-des-taches-domestiques.html</link>
      <pubDate>Fri, 26 Dec 2025 16:30:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317414</guid>
      <description>M&#234;me s'ils sont encore tr&#232;s loin de convaincre, les robots capables d'effectuer des t&#226;ches domestiques repr&#233;sentent pour les constructeurs un march&#233; au potentiel gigantesque. Qui aime vraiment faire la vaisselle, sortir les poubelles ou plier le linge ? LG, acteur pr&#233;coce de la robotique grand public, veut sa part du g&#226;teau.</description>
    </item>
    <item>
      <title>My ultimate PS5 accessory picks - 12 essential extras to enhance your setup</title>
      <link>https://www.techradar.com/gaming/ps5/my-ultimate-ps5-accessory-picks-12-essential-extras-to-enhance-your-setup</link>
      <pubDate>Fri, 26 Dec 2025 16:30:00 +0000</pubDate>
      <guid isPermaLink="false">MgsT6yg3hLFiaNd87qCAUG</guid>
      <description>I'm rounding up my top 12 picks for hte best PS5 accessories you can buy to enhance and improve your PS5 or PS5 Pro setup.</description>
    </item>
    <item>
      <title>NYC Is Getting Hit Hard by the &#8216;Super Flu&#8217;&#8212;and the Worst Is Yet to Come</title>
      <link>https://gizmodo.com/nyc-is-getting-hit-hard-by-the-super-flu-and-the-worst-is-yet-to-come-2000703455</link>
      <pubDate>Fri, 26 Dec 2025 16:15:49 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703455</guid>
      <description>Subclade K could fuel one of the worst flu seasons seen in recent history.</description>
    </item>
    <item>
      <title>Cyberpunk 2077: Ultimate Edition and other Switch games are up to 50 percent off</title>
      <link>https://www.theverge.com/gadgets/850279/cyberpunk-2077-ultimate-edition-and-other-nintendo-games-are-up-to-50-percent-off</link>
      <pubDate>2025-12-26T11:08:50-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=850279</guid>
      <description>Unlike the day after Thanksgiving, when people are rushing online and to the stores to look for deals, the day after Christmas is usually a time to recover from the festivities and check your budget to see how much all that gifting has cost you. However, if you're in a shopping mood, or if you [&#8230;]</description>
    </item>
    <item>
      <title>Google May Finally Let Users Change Embarrassing Old Gmail Addresses</title>
      <link>https://gizmodo.com/google-may-finally-let-users-change-embarrassing-old-gmail-addresses-2000703487</link>
      <pubDate>Fri, 26 Dec 2025 16:05:05 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703487</guid>
      <description>Updated support pages in multiple languages suggest a long-requested feature is quietly rolling out worldwide.</description>
    </item>
    <item>
      <title>Google will finally let you change your embarrassing Gmail address</title>
      <link>https://www.fastcompany.com/91467138/google-will-finally-let-you-change-your-embarrassing-gmail-address</link>
      <pubDate>2025-12-26T16:04:08</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91467138/google-will-finally-let-you-change-your-embarrassing-gmail-address</guid>
      <description>A long-requested update will allow users to edit their Gmail username without creating a whole new account or losing old data.
If you&#8217;re embarrassed every time you have to hand over that Gmail address you came up with in 2006, you&#8217;re in luck. Google is finally allowing users to change their Gmail username without creating an entirely new account.&#160;</description>
    </item>
    <item>
      <title>Apr&#232;s le fiasco du m&#233;tavers, Zuckerberg est&#8209;il en train de plomber son pari sur l&#8217;IA&#160;?</title>
      <link>https://www.01net.com/actualites/ce-serait-deja-la-zizanie-entre-mark-zuckerberg-et-son-labo-ia.html</link>
      <pubDate>Fri, 26 Dec 2025 16:00:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317370</guid>
      <description>C'est l'heure des bilans annuels, et pour ce qui concerne Meta la grande affaire de 2025 aura &#233;t&#233; la pluie de dollars d&#233;vers&#233;e par Mark Zuckerberg pour s'offrir la cr&#232;me de la cr&#232;me des sp&#233;cialistes de l'IA. Mais la mainmise du fondateur de Facebook sur le fonctionnement du nouveau labo IA provoquerait d&#233;j&#224; des tensions en interne.</description>
    </item>
    <item>
      <title>Treat yourself: The best smart glasses to buy with your holiday gift money</title>
      <link>https://techcrunch.com/2025/12/26/treat-yourself-the-best-smart-glasses-to-buy-with-your-holiday-gift-money/</link>
      <pubDate>Fri, 26 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3075931</guid>
      <description>Whether you&#8217;re looking to get a pair yourself or just want to explore what&#8217;s available on the market today, we&#8217;ve compiled a list of the most compelling pairs available.</description>
    </item>
    <item>
      <title>The Switch 2 has had a brilliant first year, but cracks in performance are already starting to show</title>
      <link>https://www.techradar.com/gaming/nintendo/nintendo-year-in-review-2025</link>
      <pubDate>Fri, 26 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">37JkpgbRgQbB79xeUcd3HA</guid>
      <description>Nintendo&#8217;s year was dominated by Switch 2 speculation and the arrival of the system, but there&#8217;s plenty more that happened, too.</description>
    </item>
    <item>
      <title>Does swiping away apps save your phone&#8217;s battery life? The answer isn't what you think</title>
      <link>https://www.techradar.com/phones/does-swiping-away-apps-actually-save-your-phones-battery-life-the-answer-isnt-what-you-think</link>
      <pubDate>Fri, 26 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">3LAhcr3CkSMVb6m759zVmB</guid>
      <description>Most of us panic a little when we realize dozens of apps are 'open' on our phones. But does closing them actually help?</description>
    </item>
    <item>
      <title>Our favorite books we read in 2025</title>
      <link>https://www.engadget.com/entertainment/our-favorite-books-we-read-in-2025-160000704.html?src=rss</link>
      <pubDate>Fri, 26 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">af2913af-d234-4938-a346-77b820d4db0c</guid>
      <description>This was the kind of year that felt 100 years long, so who could blame us for leaning into a bit of escapism? Some of us buried our noses in books in 2025, and thankfully, there were plenty of good reads to get lost in. Here are some of the Engadget team&#8217;s top picks from the year.Wild Dark Shore by Charlotte McConaghyWild Dark Shore pulls off a magnificent balancing act of telling an intimate, personal story coupled with the backdrop of impending climate disaster. A father and two children are living on a remote island near Antarctica, taking care of a vast seed bank that was part of an abando...</description>
    </item>
    <item>
      <title>Pour la fin d&#8217;ann&#233;e, ce laptop gaming Lenovo sous RTX 5070 perd plus de 750 &#8364; &#224; la Fnac</title>
      <link>https://www.frandroid.com/bons-plans/2884759_pour-la-fin-dannee-ce-laptop-gaming-lenovo-sous-rtx-5070-perd-plus-de-750-euros-a-la-fnac</link>
      <pubDate>Fri, 26 Dec 2025 15:52:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2884759_pour-la-fin-dannee-ce-laptop-gaming-lenovo-sous-rtx-5070-perd-plus-de-750-euros-a-la-fnac</guid>
      <description>
Le Lenovo Legion 5 15IRX10 se place comme une petite p&#233;pite en mati&#232;re de PC portable d&#233;di&#233; au gaming. Aujourd'hui, la Fnac passe son prix de 1 999,99 euros &#224; 1 233,09 euros avec un code promo.
</description>
    </item>
    <item>
      <title>Tesla, Renault, Peugeot : voici les 10 voitures &#233;lectriques avec le plus d&#8217;autonomie &#233;ligibles au futur bonus de 5 700 &#8364;</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2904783_tesla-renault-peugeot-voici-les-10-voitures-electriques-avec-le-plus-dautonomie-eligibles-au-futur-bonus-de-5-700-e</link>
      <pubDate>Fri, 26 Dec 2025 15:52:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2904783_tesla-renault-peugeot-voici-les-10-voitures-electriques-avec-le-plus-dautonomie-eligibles-au-futur-bonus-de-5-700-e</guid>
      <description>
Contrairement aux id&#233;es re&#231;ues, il est possible de trouver une voiture &#233;lectrique &#224; grande autonomie affich&#233;e sous les 47 000 euros, ce qui la rend &#233;ligible au bonus &#233;cologique. Voici notre s&#233;lection des dix meilleurs mod&#232;les.
</description>
    </item>
    <item>
      <title>Xiaomi d&#233;gaine de nouveaux &#233;couteurs sans fil avec une belle autonomie</title>
      <link>https://www.frandroid.com/marques/xiaomi/2921333_xiaomi-degaine-de-nouveaux-ecouteurs-sans-fil-avec-une-belle-autonomie</link>
      <pubDate>Fri, 26 Dec 2025 15:47:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2921333_xiaomi-degaine-de-nouveaux-ecouteurs-sans-fil-avec-une-belle-autonomie</guid>
      <description>
Xiaomi a d&#233;voil&#233; de nouveaux &#233;couteurs Xiaomi Buds 6 en Chine. En plus d'une grande autonomie, ils ont aussi plusieurs atouts du c&#244;t&#233; de la qualit&#233; audio.
</description>
    </item>
    <item>
      <title>Google is letting some people change their @gmail address</title>
      <link>https://www.theverge.com/news/850237/google-change-your-gmail-address</link>
      <pubDate>2025-12-26T10:41:48-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=850237</guid>
      <description>If you've been saddled with some awful Gmail address you chose in high school (looking at you, LazySexyCool3030), help appears to be on the way. According to a Google account support page in Hindi the company is allowing some people to change their email address. According to the page (via Google Translate): If your Google [&#8230;]</description>
    </item>
    <item>
      <title>Xiaomi remet les pendules &#224; l&#8217;heure&#160;: sa nouvelle montre se pilote d&#8217;un simple pincement de doigts</title>
      <link>https://www.01net.com/actualites/xiaomi-remet-les-pendules-a-lheure-sa-nouvelle-montre-se-pilote-dun-simple-pincement-de-doigts.html</link>
      <pubDate>Fri, 26 Dec 2025 15:33:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317354</guid>
      <description>&#192; c&#244;t&#233; du Xiaomi&#160;17 Ultra, la marque renouvelle sa garde-robe connect&#233;e. Au menu : une montre endurante bard&#233;e de capteurs et des &#233;couteurs qui visent l'audio sans perte.</description>
    </item>
    <item>
      <title>Playmates Toys Rocked Its &#8216;Teenage Mutant Ninja Turtles&#8217; Era for Nearly 40 Years. It Ends in 2026</title>
      <link>https://gizmodo.com/playmates-will-no-longer-make-teenage-mutant-ninja-turtles-toys-tmnt-2000703454</link>
      <pubDate>Fri, 26 Dec 2025 15:30:01 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703454</guid>
      <description>Viacom and Playmates announced their licensing agreement with the longtime 'TMNT' toy manufacturer will expire next December.</description>
    </item>
    <item>
      <title>8 movies about our current relationship with AI</title>
      <link>https://www.techradar.com/ai-platforms-assistants/8-movies-about-our-current-relationship-with-ai</link>
      <pubDate>Fri, 26 Dec 2025 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">sMYvNfLZmDzMv5VLz7eVjZ</guid>
      <description>Films that feel like predictions and mirrors, revealing the themes of fear, trust, intimacy, and power shaping our relationship with AI today.</description>
    </item>
    <item>
      <title>How AI is changing the patient journey</title>
      <link>https://www.fastcompany.com/91467152/how-ai-is-changing-the-patient-journey</link>
      <pubDate>2025-12-26T15:29:53</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91467152/how-ai-is-changing-the-patient-journey</guid>
      <description>From automation to adaptive care, healthcare&#8217;s smartest machines are learning to care.
AI is no longer the future of healthcare; it&#8217;s already reshaping how patients are diagnosed and treated. Some of the most interesting developments involve systems that sense and respond to human emotion. Cedars-Sinai&#8217;s Connect platform, for example, adapts care based on patient sentiment; CompanionMx interprets vocal and facial cues to detect anxiety; and Feel Therapeutics uses emotion-sensing wearables to tailor interventions in real time....</description>
    </item>
    <item>
      <title>How China is retaliating against the U.S. after massive arms sales to Taiwan</title>
      <link>https://www.fastcompany.com/91467089/how-china-retaliating-against-u-s-after-massive-arms-sales-taiwan</link>
      <pubDate>2025-12-26T15:24:53</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91467089/how-china-retaliating-against-u-s-after-massive-arms-sales-taiwan</guid>
      <description>According to the Chinese foreign ministry, Beijing is imposing sanctions on 20 defense-related U.S. companies and 10 executives. 
Beijing imposed sanctions on Friday against 20 U.S. defense-related companies and 10 executives, a week after Washington announced large-scale arms sales to Taiwan.The sanctions entail freezing the companies&#8217; assets in China and banning individuals and organizations from dealing with them, according to the Chinese foreign ministry.The companies include Northrop Grumman Systems Corporation, L3Harris Maritime Services and Boeing in St. Louis, while defense firm Anduri...</description>
    </item>
  </channel>
</rss>
