<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 29 Jan 2026 11:35:06 GMT</lastBuildDate>
    <item>
      <title>Canal+ lance une nouvelle offre &#224; partir de 16,99&#160;&#8364;/mois, mais avec une concession majeure</title>
      <link>https://www.01net.com/actualites/canal-lance-nouvelle-offre-mais-avec-grosse-concession.html</link>
      <pubDate>Thu, 29 Jan 2026 11:32:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323248</guid>
      <description>Canal+ lance une nouvelle offre regroupant l&#8217;int&#233;gralit&#233; du football europ&#233;en et son catalogue cin&#233;ma d&#232;s 16,99 &#8364; par mois.</description>
    </item>
    <item>
      <title>6 Best Coffee Makers (2026): Drip Is Drippin&#8217;</title>
      <link>https://www.wired.com/gallery/best-coffee-makers/</link>
      <pubDate>Thu, 29 Jan 2026 11:31:00 +0000</pubDate>
      <guid isPermaLink="false">67c7c9d30d4970bb8712dac0</guid>
      <description>The old-fashioned drip coffee maker has come a long way. Our favorite machines here can turn your barista into a stranger.</description>
    </item>
    <item>
      <title>This Chinese Startup Wants to Build a New Brain-Computer Interface&#8212;No Implant Required</title>
      <link>https://www.wired.com/story/this-chinese-startup-wants-to-build-a-new-brain-computer-interface-no-implant-required-gestalta/</link>
      <pubDate>Thu, 29 Jan 2026 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">6931648e7899cde4862812ec</guid>
      <description>Gestala is the latest company to emerge from China&#8217;s burgeoning brain-computer interface industry. It plans to access the brain with noninvasive ultrasound technology.</description>
    </item>
    <item>
      <title>Amazon reveals 16,000 jobs cut worldwide, with AWS hit hard, as it looks at 'reducing layers, increasing ownership, and removing bureaucracy'</title>
      <link>https://www.techradar.com/pro/amazon-reveals-16-000-jobs-cut-worldwide-with-aws-hit-hard</link>
      <pubDate>Thu, 29 Jan 2026 11:25:00 +0000</pubDate>
      <guid isPermaLink="false">knRvEeErwBeFAqpQsp5pHG</guid>
      <description>Amazon announces 16,000 more job cuts, bringing the rolling six-month total to around 30,000.</description>
    </item>
    <item>
      <title>Malaise chez GOG : m&#234;me les graphistes de l&#8217;&#233;quipe d&#233;savouent les nouvelles banni&#232;res g&#233;n&#233;r&#233;es par IA</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2959567_malaise-chez-gog-meme-les-graphistes-de-lequipe-desavouent-les-nouvelles-bannieres-generees-par-ia</link>
      <pubDate>Thu, 29 Jan 2026 11:23:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2959567_malaise-chez-gog-meme-les-graphistes-de-lequipe-desavouent-les-nouvelles-bannieres-generees-par-ia</guid>
      <description>
Ouverte &#224; l'utilisation des outils d'intelligence artificielle, l'&#233;quipe derri&#232;re GOG utilise d&#233;sormais des visuels g&#233;n&#233;r&#233;s par IA pour la plateforme de vente en ligne GOG Galaxy... quitte &#224; accoucher d'images promotionnelles de pi&#232;tre qualit&#233;.
</description>
    </item>
    <item>
      <title>Most Brits worry about online privacy, but they trust the wrong apps</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/most-brits-worry-about-online-privacy-but-they-trust-the-wrong-apps</link>
      <pubDate>Thu, 29 Jan 2026 11:21:47 +0000</pubDate>
      <guid isPermaLink="false">MBbNazfFRLgTwvo2LvCfUf</guid>
      <description>Most people in the UK say online privacy matters, but a new study from Proton reveals that many users don't actually know how private their most-used apps are.</description>
    </item>
    <item>
      <title>Resident Evil Requiem director says there are 'many fans' of Leon S. Kennedy at the studio and that 'women in particular were pretty strict' when reviewing his 'hot uncle' design</title>
      <link>https://www.techradar.com/gaming/resident-evil-requiem-director-says-there-are-many-fans-of-leon-s-kennedy-at-the-studio-and-that-women-in-particular-were-pretty-strict-when-reviewing-his-hot-uncle-design</link>
      <pubDate>Thu, 29 Jan 2026 11:19:41 +0000</pubDate>
      <guid isPermaLink="false">ve8pParUR4VU7MQoA7aRQi</guid>
      <description>Leon S. Kennedy's design for Resident Evil Requiem took a long time to create and was refined by the female staff at Capcom, according to game director Koshi Nakanishi.</description>
    </item>
    <item>
      <title>How to watch Winmau World Masters 2026 online: free darts live streams, players, schedule</title>
      <link>https://www.techradar.com/how-to-watch/sport/winmau-world-masters-2026-darts</link>
      <pubDate>Thu, 29 Jan 2026 11:14:47 +0000</pubDate>
      <guid isPermaLink="false">u95cJFbKnrMCUytvZLZ22h</guid>
      <description>Here's how to watch free Winmau World Masters 2026 live streams online from anywhere in the world.</description>
    </item>
    <item>
      <title>&#171; Le dispositif a franchi un cap &#187; : voici le bilan officiel du Bonus R&#233;paration en France qui vous aide &#224; payer moins</title>
      <link>https://www.frandroid.com/culture-tech/economie/2955255_le-dispositif-a-franchi-un-cap-voici-le-bilan-officiel-du-bonus-reparation-en-france-qui-vous-aide-a-payer-moins</link>
      <pubDate>Thu, 29 Jan 2026 11:14:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/economie/2955255_le-dispositif-a-franchi-un-cap-voici-le-bilan-officiel-du-bonus-reparation-en-france-qui-vous-aide-a-payer-moins</guid>
      <description>
1,9 million de r&#233;parations ont &#233;t&#233; soutenues en France par le Bonus R&#233;paration depuis le lancement du dispositif. C'est encourageant, mais pas encore pleinement satisfaisant.
</description>
    </item>
    <item>
      <title>Contre la musique g&#233;n&#233;r&#233;e l&#8217;IA, Deezer prend une d&#233;cision historique pour aider Spotify et Apple Music</title>
      <link>https://www.frandroid.com/services/streaming-musical/2959527_contre-la-musique-generee-lia-deezer-prend-une-decision-historique-pour-aider-spotify-et-apple-music</link>
      <pubDate>Thu, 29 Jan 2026 11:09:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/streaming-musical/2959527_contre-la-musique-generee-lia-deezer-prend-une-decision-historique-pour-aider-spotify-et-apple-music</guid>
      <description>
Pour lutter contre la propagation de musique g&#233;n&#233;r&#233;e par intelligence artificielle, Deezer souhaite mettre &#224; disposition de ses concurrents son outil de d&#233;tection.
</description>
    </item>
    <item>
      <title>Voici l&#8217;autonomie r&#233;elle d&#8217;une voiture &#233;lectrique apr&#232;s 240 000 km : une excellente surprise</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2959815_voici-lautonomie-reelle-dune-voiture-electrique-apres-240-000-km-une-excellente-surprise</link>
      <pubDate>Thu, 29 Jan 2026 11:08:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2959815_voici-lautonomie-reelle-dune-voiture-electrique-apres-240-000-km-une-excellente-surprise</guid>
      <description>
Doit-on remplacer la (co&#251;teuse) batterie d'une voiture &#233;lectrique apr&#232;s 3 ans ? &#192; cette id&#233;e re&#231;ue, une &#233;tude vient de r&#233;pondre apr&#232;s l'analyse de mod&#232;les avec 240 000 km au compteur : la batterie ne s'use presque pas, et la situation s'am&#233;liore chaque ann&#233;e.
</description>
    </item>
    <item>
      <title>Guerre ouverte chez les bracelets connect&#233;s : pourquoi Whoop attaque ses concurrents en justice</title>
      <link>https://www.frandroid.com/marques/whoop/2959789_guerre-ouverte-chez-les-bracelets-connectes-pourquoi-whoop-attaque-ses-concurrents-en-justice</link>
      <pubDate>Thu, 29 Jan 2026 11:07:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/whoop/2959789_guerre-ouverte-chez-les-bracelets-connectes-pourquoi-whoop-attaque-ses-concurrents-en-justice</guid>
      <description>
Alors que le march&#233; des bracelets connect&#233;s sans &#233;cran s'&#233;toffe de plus en plus, la marque Whoop veut garder son pr&#233; carr&#233; et a lanc&#233; de nouvelles proc&#233;dures contre le bracelet Luna Band. 
</description>
    </item>
    <item>
      <title>Les g&#233;ants du gaming Linux s&#8217;unissent pour enterrer Windows</title>
      <link>https://www.frandroid.com/produits-android/console/2959841_les-geants-du-gaming-linux-sunissent-pour-enterrer-windows</link>
      <pubDate>Thu, 29 Jan 2026 11:03:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2959841_les-geants-du-gaming-linux-sunissent-pour-enterrer-windows</guid>
      <description>
Les plus grands noms du d&#233;veloppement sur Linux se r&#233;unissent pour am&#233;liorer l'exp&#233;rience de jeu sur Linux. Un projet ultra prometteur.
</description>
    </item>
    <item>
      <title>Google disables Take a Message on older Pixel phones amid audio leak bug</title>
      <link>https://www.theverge.com/news/869965/google-pixel-4-5-take-a-message-disabled-audio-leak</link>
      <pubDate>2026-01-29T05:51:52-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=869965</guid>
      <description>Google is disabling some Phone app features on older Pixel devices after acknowledging a bug that inadvertently leaked audio to callers. The issue has specifically been linked to the Take a Message feature released last year, which automatically answers and transcribes voicemails when you miss a call, with a handful of Pixel 4 and 5 [&#8230;]</description>
    </item>
    <item>
      <title>Ce laptop gamer OLED MSI avec Ryzen AI 9 + RTX 5080 est vendu &#224; perte pendant les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2959429_ce-laptop-gamer-oled-msi-avec-ryzen-ai-9-rtx-5080-est-vendu-a-perte-pendant-les-soldes</link>
      <pubDate>Thu, 29 Jan 2026 10:34:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2959429_ce-laptop-gamer-oled-msi-avec-ryzen-ai-9-rtx-5080-est-vendu-a-perte-pendant-les-soldes</guid>
      <description>
La configuration du PC portable MSI Stealth A16 AI+ est tellement solide qu'on s'attend forc&#233;ment &#224; un prix d&#233;mesur&#233;. Pourtant, en cette fin de soldes d'hiver, Cdiscount le propose &#224; 2 999 euros au lieu de 3 848 euros.
</description>
    </item>
    <item>
      <title>Elon Musk Made Tesla Fans Think Unsupervised Robotaxis Had Arrived. They Can&#8217;t Find Them</title>
      <link>https://gizmodo.com/elon-musk-made-tesla-fans-think-unsupervised-robotaxis-had-arrived-they-cant-find-them-2000715299</link>
      <pubDate>Thu, 29 Jan 2026 10:30:26 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715299</guid>
      <description>If you're in Austin and you're trying to ride in a truly driverless Tesla robotaxi, you may be on a wild goose chase.</description>
    </item>
    <item>
      <title>Sony really, really, wants PS4 players to switch to the PS5 &#8212; 'Now's the perfect time to upgrade your PS5 console'</title>
      <link>https://www.techradar.com/gaming/sony-really-really-wants-ps4-players-to-switch-to-the-ps5-nows-the-perfect-time-to-upgrade-your-ps5-console</link>
      <pubDate>Thu, 29 Jan 2026 10:30:21 +0000</pubDate>
      <guid isPermaLink="false">cQP4hvohxd95zDiULWGp7N</guid>
      <description>PS4 users are receiving messages from Sony, encouraging them to upgrade to the PS5, and it could be tied to a PS6 launch delay.</description>
    </item>
    <item>
      <title>Drinking coffee can add years to your life&#8212;but only if you do this, research shows</title>
      <link>https://www.fastcompany.com/91480353/drinking-coffee-can-add-years-to-your-life-but-only-if-you-do-this-research-shows</link>
      <pubDate>2026-01-29T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480353/drinking-coffee-can-add-years-to-your-life-but-only-if-you-do-this-research-shows</guid>
      <description>A study of more than 40,000 people reveals how you can reap coffee&#8217;s benefits.
Is drinking coffee good for your health? The answer appears to be yes. Quite a lot of research shows that&#160;coffee drinkers&#160;stay mentally sharper and may live longer than those who don&#8217;t. That&#8217;s welcome news to many entrepreneurs and business leaders who depend on coffee to stay alert and productive. ...</description>
    </item>
    <item>
      <title>Une &#171;&#160;m&#233;connaissance des principes essentiels de s&#233;curit&#233;&#160;&#187; : France Travail devra payer une amende sal&#233;e apr&#232;s le hack de mars 2024</title>
      <link>https://www.01net.com/actualites/une-meconnaissance-des-principes-essentiels-de-securite-france-travail-devra-payer-une-amende-salee-apres-le-hack-de-mars-2024.html</link>
      <pubDate>Thu, 29 Jan 2026 10:24:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323219</guid>
      <description>5 millions d'euros, et des obligations de renforcement de sa cybers&#233;curit&#233; : voici &#224; quoi France Travail vient d'&#234;tre condamn&#233; apr&#232;s la cyberattaque de mars 2024 qui avait concern&#233; pr&#232;s de 37 millions de Fran&#231;ais.</description>
    </item>
    <item>
      <title>Connexion satellite et &#233;cran microLED : Amazfit attaquerait Garmin frontalement avec sa nouvelle T-Rex Ultra 2</title>
      <link>https://www.frandroid.com/marques/amazfit/2959689_connexion-satellite-et-ecran-microled-amazfit-attaquerait-garmin-frontalement-avec-sa-nouvelle-t-rex-ultra-2</link>
      <pubDate>Thu, 29 Jan 2026 10:21:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazfit/2959689_connexion-satellite-et-ecran-microled-amazfit-attaquerait-garmin-frontalement-avec-sa-nouvelle-t-rex-ultra-2</guid>
      <description>
D'apr&#232;s une fuite, Amazfit pourrait lancer tr&#232;s prochainement sa nouvelle montre de sport haut de gamme, l'Amazfit T-Rex Ultra 2. Un mod&#232;le qui viendrait s'attaquer directement &#224; la Garmin Fenix 8 Pro microLED. 
</description>
    </item>
    <item>
      <title>Tesla : la vraie raison du retour des batteries &#171;&#160;maison&#160;&#187; dans son Model Y</title>
      <link>https://www.frandroid.com/marques/tesla/2959451_tesla-la-vraie-raison-du-retour-des-batteries-maison-dans-son-model-y</link>
      <pubDate>Thu, 29 Jan 2026 10:19:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2959451_tesla-la-vraie-raison-du-retour-des-batteries-maison-dans-son-model-y</guid>
      <description>
Si Tesla avait abandonn&#233; la production de sa Model Y dot&#233;e de ses cellules 4680, le constructeur change encore de strat&#233;gie. La voiture &#233;lectrique y a &#224; nouveau droit, pour une raison tr&#232;s simple.
</description>
    </item>
    <item>
      <title>Google Pixel : une faille critique supprime une fonctionnalit&#233; historique</title>
      <link>https://www.frandroid.com/marques/google/2959719_google-pixel-une-faille-critique-supprime-une-fonctionnalite-historique</link>
      <pubDate>Thu, 29 Jan 2026 10:18:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2959719_google-pixel-une-faille-critique-supprime-une-fonctionnalite-historique</guid>
      <description>
Google a pris la d&#233;cision radicale de d&#233;sactiver la fonctionnalit&#233; &#171; Prendre un message &#187; sur ses Pixel 4 et Pixel 5. En cause, une faille de s&#233;curit&#233; majeure qui transforme cette option en un v&#233;ritable espion de poche.
</description>
    </item>
    <item>
      <title>Need to keep your home office warm and toasty? I can't live without this Dreo heater - and it's currently cheaper than ever</title>
      <link>https://www.techradar.com/pro/need-to-keep-your-home-office-warm-and-toasty-i-cant-live-without-this-dreo-heater-and-its-currently-cheaper-than-ever</link>
      <pubDate>Thu, 29 Jan 2026 10:13:50 +0000</pubDate>
      <guid isPermaLink="false">BbALFnnUqc9bUKKV87n6MS</guid>
      <description>The Dreo Solaris 718 space heater is proving invaluable for me right now - and it's currently cheaper than ever,</description>
    </item>
    <item>
      <title>9 millions d&#8217;Android compromis&#160;: Google d&#233;mant&#232;le l&#8217;un des plus grands r&#233;seaux pirates du monde</title>
      <link>https://www.01net.com/actualites/cyberattaque-android-google-demantele-lun-des-plus-grands-reseaux-pirates-du-monde.html</link>
      <pubDate>Thu, 29 Jan 2026 10:11:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323189</guid>
      <description>Google vient de neutraliser Ipidea, un g&#233;ant chinois des proxys r&#233;sidentiels. Accus&#233; d&#8217;avoir enr&#244;l&#233; en douce des millions de smartphones, PC et TV connect&#233;es pour les louer &#224; des cybercriminels, le groupe chinois est aussi impliqu&#233; dans la cr&#233;ation de plusieurs botnets d'envergure. Google indique avoir lib&#233;r&#233; environ 9 millions d&#8217;appareils Android au cours de l'op&#233;ration....</description>
    </item>
    <item>
      <title>25+ unique Valentines Day gift for your wife: How to spoil your forever best friend</title>
      <link>https://mashable.com/gifts/best-valentines-day-gifts-for-your-wife</link>
      <pubDate>Thu, 29 Jan 2026 10:06:34 +0000</pubDate>
      <guid isPermaLink="false">04gcatR8ES99ryDBD9Jt2HZ</guid>
      <description>Don't get your wife the same old Valentine's Day present this year. Get creative with our unique gift ideas that are fully heart eyes-inducing.</description>
    </item>
    <item>
      <title>Malgr&#233; les critiques, Windows 11 franchit un cap historique, bien devant Windows 10</title>
      <link>https://www.frandroid.com/marques/microsoft/2959563_malgre-les-critiques-windows-11-franchit-un-cap-historique-bien-devant-windows-10</link>
      <pubDate>Thu, 29 Jan 2026 10:05:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2959563_malgre-les-critiques-windows-11-franchit-un-cap-historique-bien-devant-windows-10</guid>
      <description>
Windows 11 a atteint le milliard d'utilisateurs plus rapidement que Windows 10. Un succ&#232;s dont se f&#233;licite grandement Microsoft malgr&#233; les critiques faites &#224; son OS.
</description>
    </item>
    <item>
      <title>The best ereaders for 2026</title>
      <link>https://www.engadget.com/mobile/tablets/best-ereader-130013808.html?src=rss</link>
      <pubDate>Thu, 29 Jan 2026 10:01:26 +0000</pubDate>
      <guid isPermaLink="false">51dccbcd-ac65-4fc0-99d3-6d9cd389acb1</guid>
      <description>Color is the buzziest feature in ereaders right now, but is it necessary? It makes the covers more fun, and readers of comics and graphic novels will appreciate the added hues (though they may be happier with an E Ink tablet for better image detail). Color is just one factor to consider when picking out the best ereader. The lights, screen quality, housing and buttons make a difference too. Then there&#8217;s the software: Do you want to stay in the Kindle ecosystem or get a device that can handle lots of apps? We tested more than a dozen ereaders to come up with our recommendations. This guide also...</description>
    </item>
    <item>
      <title>Microsoft&#8217;s AI Spend Is Starting To Spook Investors</title>
      <link>https://gizmodo.com/microsofts-ai-spend-is-starting-to-spook-investors-2000715208</link>
      <pubDate>Thu, 29 Jan 2026 10:00:56 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715208</guid>
      <description>Microsoft showed record spending but slowing cloud growth and a big reliance on OpenAI</description>
    </item>
    <item>
      <title>Where is Donald Trump&#8217;s strategic Bitcoin reserve?</title>
      <link>https://www.fastcompany.com/91482053/where-is-donald-trumps-strategic-bitcoin-reserve</link>
      <pubDate>2026-01-29T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91482053/where-is-donald-trumps-strategic-bitcoin-reserve</guid>
      <description>The government seems to be amassing more Bitcoin. But little work seems to be happening to enact the terms of the executive order Trump signed to start the &#8216;strategic reserve.&#8217;
Last March, President Donald Trump signed an executive order declaring that the government would launch a strategic reserve of Bitcoin. For the crypto industry, the move was a major win, the next step in its quest to normalize digital assets.&#160;...</description>
    </item>
    <item>
      <title>I test-drove the new ScreenX movie format. Here&#8217;s what I thought of it</title>
      <link>https://www.fastcompany.com/91482924/i-test-drove-the-new-screenx-movie-format-heres-what-i-thought-of-it</link>
      <pubDate>2026-01-29T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91482924/i-test-drove-the-new-screenx-movie-format-heres-what-i-thought-of-it</guid>
      <description>Essentially, you get three screens in one. But does that add much?
Whenever my wife and I go to watch a movie together, lately we tend to pick a new theater close to where we live that&#8217;s called 109 Cinemas Premium Shinjuku. There are reclining seats, you get free popcorn in a chill lounge when you arrive, and the supposedly best-in-Japan sound system was tuned by the late music legend Ryuichi Sakamoto. What&#8217;s not to like?...</description>
    </item>
    <item>
      <title>A parents guide to keeping kids safe on Roblox</title>
      <link>https://mashable.com/article/roblox-parents-child-safety-guide</link>
      <pubDate>Thu, 29 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">04UtzJVAEe38ijo75KS3KOw</guid>
      <description>Half of the U.S. population under the age of 16 are playing Roblox. Here's how to keep your kids safe on the platform.</description>
    </item>
    <item>
      <title>Enjoy a peaceful internet experience for life with this $20 tool</title>
      <link>https://mashable.com/article/jan-29-adguard-family-plan-lifetime-subscription</link>
      <pubDate>Thu, 29 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">05Hq7tVC0YM84Ob7FdiPNyk</guid>
      <description>Protect your data and your peace online with a lifetime subscription to AdGuard Family Plan, now only $19.97 until Feb. 8.</description>
    </item>
    <item>
      <title>Whats new to streaming this week? (Jan. 30, 2026)</title>
      <link>https://mashable.com/article/new-to-streaming-january-30-2026</link>
      <pubDate>Thu, 29 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02Yzyla4mGiQj0DxeIiEfdL</guid>
      <description>What&#8217;s new to streaming for the week of Jan. 30, 2026, on Netflix, Disney+, Paramount+, and more? We've got you covered.</description>
    </item>
    <item>
      <title>Give your PC a big upgrade for a small price with this Microsoft bundle</title>
      <link>https://mashable.com/article/jan-29-the-ultimate-microsoft-office-professional-2021-for-windows</link>
      <pubDate>Thu, 29 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01YIjGbFXaprY6t8GaPJU8o</guid>
      <description>Get new tools and a fresh operating system with the Microsoft Office Professional 2021 for Windows Lifetime License and Windows 11 Pro Bundle, on sale now for just $39.97 through Feb. 1.</description>
    </item>
    <item>
      <title>I tested sleep earbuds for months: Here are the 3 Id buy, and the one Id skip</title>
      <link>https://mashable.com/roundup/best-sleep-earbuds</link>
      <pubDate>Thu, 29 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01mtt5K1NAhb11M67rjRZQw</guid>
      <description>We tried sleep earbuds and earplugs from Ozlo, Anker Soundcore, 1More, and Loop &#8212; these are the three we'd buy.</description>
    </item>
    <item>
      <title>The Insignia 32-inch Class F20 TV is down to its lowest-ever price at Amazon &#8212; get it for under $70</title>
      <link>https://mashable.com/article/jan-29-insignia-fire-tv-deal</link>
      <pubDate>Thu, 29 Jan 2026 09:58:59 +0000</pubDate>
      <guid isPermaLink="false">04aH9MAhj9s6J73Ls9fj7aS</guid>
      <description>Get the best cheap TV deal. Save 46% on the Insignia 32-inch Class F20 at Amazon.</description>
    </item>
    <item>
      <title>The Dyson V8 vacuum is on sale at Amazon &#8212; get $40 off right now</title>
      <link>https://mashable.com/article/jan-29-dyson-v8-deal</link>
      <pubDate>Thu, 29 Jan 2026 09:56:03 +0000</pubDate>
      <guid isPermaLink="false">04MxoBwSLWQQjWtNbdokWax</guid>
      <description>Find the best vacuum deal at Amazon. Save 10% on the Dyson V8 at Amazon.</description>
    </item>
    <item>
      <title>Vous ne devinerez jamais sur quoi se base le nouveau plan de Mark Zuckerberg pour d&#233;velopper ses r&#233;seaux</title>
      <link>https://www.frandroid.com/marques/meta/2959285_vous-ne-devinerez-jamais-sur-quoi-se-base-le-nouveau-plan-de-mark-zuckerberg-pour-developper-ses-reseaux</link>
      <pubDate>Thu, 29 Jan 2026 09:54:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2959285_vous-ne-devinerez-jamais-sur-quoi-se-base-le-nouveau-plan-de-mark-zuckerberg-pour-developper-ses-reseaux</guid>
      <description>
Le m&#233;tavers semble loin dans l&#8217;esprit de Mark Zuckerberg. Le patron de Meta affiche une nouvelle vision strat&#233;gique en misant sur l&#8217;intelligence artificielle comme levier de croissance.
</description>
    </item>
    <item>
      <title>When AI can make anything, choosing what to make is everything</title>
      <link>https://www.fastcompany.com/91479583/when-ai-can-make-anything-choosing-what-to-make-is-everything-ai-strategy</link>
      <pubDate>2026-01-29T09:49:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91479583/when-ai-can-make-anything-choosing-what-to-make-is-everything-ai-strategy</guid>
      <description>In 2026, the question &#8216;Should we build this?&#8217; will matter more than &#8216;Can we build this?&#8217;
We&#8217;re witnessing an unprecedented explosion in creative capability. Voice interfaces are removing barriers for billions who found keyboards cumbersome. AI image generators can mock up virtually any creative direction instantly. The technical constraints that once defined creative work are dissolving....</description>
    </item>
    <item>
      <title>The Google Pixel 9a is back on sale at Amazon &#8212; save $100 for a limited time</title>
      <link>https://mashable.com/article/jan-29-google-pixel-9a-deal</link>
      <pubDate>Thu, 29 Jan 2026 09:48:14 +0000</pubDate>
      <guid isPermaLink="false">02OumzF8Pfd5IjZ0GB3uWZh</guid>
      <description>Get the best smartphone deal at Amazon. Save 17% on the Google Pixel 9 at Amazon.</description>
    </item>
    <item>
      <title>Nintendo Switch 2 en f&#233;vrier 2026 : l&#8217;une des plus grandes sagas du jeu d&#8217;horreur arrive ! Voici les jeux &#224; ne pas manquer</title>
      <link>https://www.frandroid.com/marques/nintendo/2959397_nintendo-switch-2-en-fevrier-2026-lune-des-plus-grandes-sagas-du-jeu-dhorreur-arrive-voici-les-jeux-a-ne-pas-manquer</link>
      <pubDate>Thu, 29 Jan 2026 09:48:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nintendo/2959397_nintendo-switch-2-en-fevrier-2026-lune-des-plus-grandes-sagas-du-jeu-dhorreur-arrive-voici-les-jeux-a-ne-pas-manquer</guid>
      <description>
Fans de Nintendo et de Resident Evil ? L'heure est venue de retrouver les derniers jeux de la saga horrifique de Capcom sur la Nintendo Switch 2 dont le tr&#232;s attendu Requiem. Pour ceux moins adeptes des jeux d'horreur, il y a la version remasteris&#233;e de Dragon Quest VII.
</description>
    </item>
    <item>
      <title>Encore plus d&#8217;autonomie et une charge en 12 minutes&#160;: la nouvelle Xpeng X9 &#233;lectrique frappe tr&#232;s fort</title>
      <link>https://www.frandroid.com/marques/xpeng/2959363_encore-plus-dautonomie-et-une-charge-en-12-minutes-la-nouvelle-xpeng-x9-electrique-frappe-tres-fort</link>
      <pubDate>Thu, 29 Jan 2026 09:47:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2959363_encore-plus-dautonomie-et-une-charge-en-12-minutes-la-nouvelle-xpeng-x9-electrique-frappe-tres-fort</guid>
      <description>
D&#233;voil&#233; en 2024, le Xpeng X9 s&#8217;offre une nouvelle version qui &#233;volue sur plusieurs points. La voiture &#233;lectrique familiale revoit son autonomie &#224; la hausse et n&#8217;a besoin que de 12 minutes pour se recharger. Reste &#224; savoir quand elle arrivera en Europe.
</description>
    </item>
    <item>
      <title>Une trottinette &#233;lectrique Xiaomi &#224; moins de 300 &#8364;, c&#8217;est aussi &#231;a la magie des soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2953109_une-trottinette-electrique-xiaomi-a-moins-de-300-e-cest-aussi-ca-la-magie-des-soldes-dhiver</link>
      <pubDate>Thu, 29 Jan 2026 09:46:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2953109_une-trottinette-electrique-xiaomi-a-moins-de-300-e-cest-aussi-ca-la-magie-des-soldes-dhiver</guid>
      <description>
La Xiaomi Electric Scooter 4 n'est pas la plus jeune du catalogue de la marque chinoise, mais elle a l'avantage d'&#234;tre toujours aussi agr&#233;able en ville, et surtout bien moins ch&#232;re qu'&#224; sa sortie. Pendant les soldes d'hiver 2026, Darty l'affiche &#224; 279,99 euros au lieu de 402,99 euros.
</description>
    </item>
    <item>
      <title>Nouveaux smartphones pliants, lunettes connect&#233;es&#160;: Samsung d&#233;voile ses plans pour 2026</title>
      <link>https://www.01net.com/actualites/smartphones-plus-fins-nouveaux-pliants-lunettes-ar-ce-que-prepare-samsung-2026.html</link>
      <pubDate>Thu, 29 Jan 2026 09:45:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323175</guid>
      <description>Samsung d&#233;voile une feuille de route ambitieuse pour 2026 avec pas mal de nouveaut&#233;s au programme.</description>
    </item>
    <item>
      <title>This robot snow blower is trending &#8212; and its $400 off right now at Amazon</title>
      <link>https://mashable.com/article/jan-27-yarbo-robot-snow-blower</link>
      <pubDate>Thu, 29 Jan 2026 09:41:25 +0000</pubDate>
      <guid isPermaLink="false">05ue5GBdARhxaX5Zn2HvLFC</guid>
      <description>The Yarbo Snow Blower Robot will clear your driveway, walkway, and yard of snow so you never have to shovel again.</description>
    </item>
    <item>
      <title>Clawdbot users are snapping up the Mac Mini &#8212; buy now for under $550 at Amazon</title>
      <link>https://mashable.com/article/jan-28-apple-mac-mini-deal</link>
      <pubDate>Thu, 29 Jan 2026 09:37:46 +0000</pubDate>
      <guid isPermaLink="false">06uSgcPuSkch3GbcvSpHI0K</guid>
      <description>The M4 Mac Mini is on sale at Amazon for $549, down from the normal price of $599.</description>
    </item>
  </channel>
</rss>
