<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 31 Jan 2026 18:39:30 GMT</lastBuildDate>
    <item>
      <title>Comparatif : quelles sont les meilleures enceintes Bluetooth en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guide-audio/722626_guide-meilleures-enceintes-portables</link>
      <pubDate>Sat, 31 Jan 2026 18:00:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-audio/722626_guide-meilleures-enceintes-portables</guid>
      <description>
Compactes et nomades, les enceintes Bluetooth s'invitent partout : du salon &#224; la plage, elles sont devenues indispensables. Bienvenue sur notre s&#233;lection des meilleurs mod&#232;les test&#233;s par nos soins.
</description>
    </item>
    <item>
      <title>SpaceX wants to launch a constellation of a million satellites to power AI needs</title>
      <link>https://www.engadget.com/science/space/spacex-wants-to-launch-a-constellation-of-a-million-satellites-to-power-ai-needs-175607771.html?src=rss</link>
      <pubDate>Sat, 31 Jan 2026 17:56:07 +0000</pubDate>
      <guid isPermaLink="false">8157e4a8-80fe-448b-b150-9465cfaecc57</guid>
      <description>Elon Musk and his aerospace company have requested to build a network that's 100 times the number of satellites that are currently in orbit. On Friday, SpaceX filed an application with the Federal Communications Commission (FCC) to launch a million satellites meant to create an "orbital data center." This isn't the first time we're hearing of Musk's plans to build an orbital data center, as it was mentioned by company insiders following the news that the CEO was reportedly preparing to take SpaceX public.
According to the filing spotted by PCMag, this data center would run off solar power and ...</description>
    </item>
    <item>
      <title>Nvidia CEO pushes back against report that his company&#8217;s $100B OpenAI investment has stalled</title>
      <link>https://techcrunch.com/2026/01/31/nvidia-ceo-pushes-back-against-report-that-his-companys-100b-openai-investment-has-stalled/</link>
      <pubDate>Sat, 31 Jan 2026 17:54:12 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3088494</guid>
      <description>Nvidia CEO Jensen Huang said that a recent report of friction between his company and OpenAI was &#8220;nonsense.&#8221;</description>
    </item>
    <item>
      <title>Liverpool vs Newcastle Live Streams: TV Channels, Preview &amp; Team News for Premier League 2025/26 clash at Anfield</title>
      <link>https://www.techradar.com/how-to-watch/football/liverpool-vs-newcastle-live-premier-league-2025-26</link>
      <pubDate>Sat, 31 Jan 2026 17:30:00 +0000</pubDate>
      <guid isPermaLink="false">Cj63LWEATSDviMvPnsj3Yi</guid>
      <description>All the ways to watch Liverpool vs Newcastle as the Reds eye a first Premier League win of 2026 against Eddie Howe's Mags.</description>
    </item>
    <item>
      <title>WWE Royal Rumble 2026 &#8212; Stream it *FREE* from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/sport/wwe-royal-rumble-2026-free-anywhere</link>
      <pubDate>Sat, 31 Jan 2026 17:30:00 +0000</pubDate>
      <guid isPermaLink="false">cSdKj6WzZTjAnSzsYadxEW</guid>
      <description>Here's a quick guide on how to watch Royal Rumble 2026 for free as WWE's premium event hits our screens this weekend.</description>
    </item>
    <item>
      <title>The Original &#8216;Saw&#8217; Team Is Leading the Franchise&#8217;s Return</title>
      <link>https://gizmodo.com/the-original-saw-team-is-leading-the-franchises-return-2000716238</link>
      <pubDate>Sat, 31 Jan 2026 17:25:38 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000716238</guid>
      <description>James Wan and Leigh Whannell are reuniting to revitalize 'Saw' and make it scary franchise again.</description>
    </item>
    <item>
      <title>RayNeo Air 3s Pro review: Getting my mind to adjust to the 201-inch screen simulation took a while - but once it did, these display glasses proved impressive</title>
      <link>https://www.techradar.com/pro/rayneo-air-3s-pro-smart-glasses-review</link>
      <pubDate>Sat, 31 Jan 2026 17:20:00 +0000</pubDate>
      <guid isPermaLink="false">iKjcgpezcCue4vwwAAfD8K</guid>
      <description>Are you missing the cinematic experience, huddling over a small screen on your daily commute? Then the Neo Air 3S Pro wearable display glasses are the solution. Simply plug them into your phone and suddenly you have access to a simulated 201-inch projection screen, all in a device no larger than a standard pair of spectacles.</description>
    </item>
    <item>
      <title>Heated Rivalry lived up to the hype &#8212; here are 9 other movies and shows I wish I&#8217;d watched sooner</title>
      <link>https://www.techradar.com/streaming/heated-rivalry-lived-up-to-the-hype-here-are-9-other-movies-and-shows-i-wish-id-watched-sooner</link>
      <pubDate>Sat, 31 Jan 2026 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">6d2fd3y2ZwoecgxPykqb</guid>
      <description>Heated Rivalry was just one of the many movies and shows that left a mark on me this month, alongside The Lord of the Rings and a heart-breaking romantic drama.</description>
    </item>
    <item>
      <title>Un oc&#233;an disparu refait surface : cette d&#233;couverte sur Mars bouleverse les scientifiques</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-ocean-disparu-refait-surface-cette-decouverte-mars-bouleverse-scientifiques-w2t8-130549/#xtor%3DRSS-8</link>
      <pubDate>Sat, 31 Jan 2026 18:00:00 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-ocean-disparu-refait-surface-cette-decouverte-mars-bouleverse-scientifiques-w2t8-130549/#xtor%3DRSS-8</guid>
      <description>En analysant les donn&#233;es sismiques collect&#233;es par les instruments de&#160;l'atterrisseur Insight de la Nasa&#160;il y a plusieurs ann&#233;es, des g&#233;ophysiciens pensent avoir trouv&#233; des preuves de l'existence d'un grand r&#233;servoir souterrain d'eau liquide dans la cro&#251;te de Mars, suffisamment pour remplir les...</description>
    </item>
    <item>
      <title>Test du Canon EOS R6 Mark III : la mise &#224; jour tant attendue d&#8217;un best-seller polyvalent</title>
      <link>https://www.frandroid.com/marques/canon/2955611_test-du-canon-eos-r6-mark-iii-la-mise-a-jour-tant-attendue-dun-best-seller-polyvalent</link>
      <pubDate>Sat, 31 Jan 2026 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/canon/2955611_test-du-canon-eos-r6-mark-iii-la-mise-a-jour-tant-attendue-dun-best-seller-polyvalent</guid>
      <description>
Cinq ans apr&#232;s la sortie du tr&#232;s appr&#233;ci&#233; EOS R6 Mark II, Canon est revenu fin 2025 avec l'un des bo&#238;tiers les plus attendus de l'ann&#233;e. Proposant une mise &#224; jour pens&#233;e comme un peaufinage plut&#244;t qu'une r&#233;volution, la marque affiche d&#233;sormais un nouvel &#233;tendard de polyvalence face &#224; la concurrence.
</description>
    </item>
  </channel>
</rss>
