<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 23 Dec 2025 10:29:00 GMT</lastBuildDate>
    <item>
      <title>La solide Xiaomi Pad 7 Pro dot&#233;e d&#8217;une puce Snapdragon 8s Gen 3 perd plus de 230 &#8364; aujourd&#8217;hui</title>
      <link>https://www.frandroid.com/bons-plans/2919023_la-solide-xiaomi-pad-7-pro-dotee-dune-puce-snapdragon-8s-gen-3-perd-plus-de-230-e-aujourdhui</link>
      <pubDate>Tue, 23 Dec 2025 10:27:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2919023_la-solide-xiaomi-pad-7-pro-dotee-dune-puce-snapdragon-8s-gen-3-perd-plus-de-230-e-aujourdhui</guid>
      <description>
La Xiaomi Pad 7 Pro a l'ambition des plus grands avec un prix r&#233;duit. Preuve en est, la tablette chute &#224; moins de 300 euros chez AliExpress avec le code FRBD25.
</description>
    </item>
    <item>
      <title>Cette innovation du Xiaomi 17 Ultra va enterrer les zooms de nos smartphones</title>
      <link>https://www.frandroid.com/marques/xiaomi/2919111_cette-innovation-du-xiaomi-17-ultra-va-enterrer-les-zooms-de-nos-smartphones</link>
      <pubDate>Tue, 23 Dec 2025 10:26:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2919111_cette-innovation-du-xiaomi-17-ultra-va-enterrer-les-zooms-de-nos-smartphones</guid>
      <description>
Xiaomi s'appr&#234;te &#224; frapper un grand coup sur le march&#233; de la photographie mobile. Le constructeur chinois a confirm&#233; le lancement imminent du Xiaomi 17 Ultra, un fleuron qui inaugure un syst&#232;me de zoom optique continu de 200 m&#233;gapixels, promettant une qualit&#233; d'image constante entre 75 mm et 100 mm.
</description>
    </item>
    <item>
      <title>Steam passe enfin au 64 bits sur Windows : ce que &#231;a change</title>
      <link>https://www.frandroid.com/marques/2918989_steam-passe-enfin-au-64-bits-sur-windows-ce-que-ca-change</link>
      <pubDate>Tue, 23 Dec 2025 10:24:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2918989_steam-passe-enfin-au-64-bits-sur-windows-ce-que-ca-change</guid>
      <description>
Valve fait &#233;voluer son client vers l'architecture 64 bits de Windows. Un changement technique qui apporte avant tout une meilleure compatibilit&#233; mat&#233;rielle.
</description>
    </item>
    <item>
      <title>Google Cloud reveals all-new channel program - here's all the key details</title>
      <link>https://www.techradar.com/pro/google-cloud-reveals-all-new-channel-program-heres-all-the-key-details</link>
      <pubDate>Tue, 23 Dec 2025 10:23:42 +0000</pubDate>
      <guid isPermaLink="false">grFXEBTf4aNQZX7jjNE6Nf</guid>
      <description>Google says it's making the Partner Network simpler for 2026 with new automation aids, but partners might not retain their status.</description>
    </item>
    <item>
      <title>Amazon Prime Video en janvier 2026 : voici les films et s&#233;ries &#224; voir, dont la saison 2 de The Night Manager et les Mission Impossible</title>
      <link>https://www.frandroid.com/marques/amazon/2919049_amazon-prime-video-en-janvier-2026-voici-les-films-et-series-a-voir-dont-la-saison-2-de-the-night-manager-et-les-mission-impossible</link>
      <pubDate>Tue, 23 Dec 2025 10:23:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazon/2919049_amazon-prime-video-en-janvier-2026-voici-les-films-et-series-a-voir-dont-la-saison-2-de-the-night-manager-et-les-mission-impossible</guid>
      <description>
De grands classiques, des blockbusters, du spectacle, de nouveaux arrivages et du basket ! Amazon d&#233;voile le catalogue de son service Prime Video pour janvier 2026, voyons ce qu'il y a &#224; regarder.
</description>
    </item>
    <item>
      <title>LG Display abandonne le sous-pixel blanc pour ses dalles de moniteurs gaming OLED et monte jusqu&#8217;&#224; 240Hz voire 480 Hz</title>
      <link>https://www.frandroid.com/events/ces/2919287_lg-display-abandonne-le-sous-pixel-blanc-pour-ses-dalles-de-moniteurs-gaming-oled-et-monte-jusqua-240hz-voire-480-hz</link>
      <pubDate>Tue, 23 Dec 2025 10:16:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/events/ces/2919287_lg-display-abandonne-le-sous-pixel-blanc-pour-ses-dalles-de-moniteurs-gaming-oled-et-monte-jusqua-240hz-voire-480-hz</guid>
      <description>
LG Display vient d&#8217;annoncer au CES 2026 la pr&#233;sentation du premier panneau OLED pour moniteurs combinant une d&#233;finition 4K sur 27 pouces, structure de sous-pixels RVB en ligne et fr&#233;quence de rafra&#238;chissement de 240Hz, une combinaison encore in&#233;dite sur ce segment.
</description>
    </item>
    <item>
      <title>Renault franchit un cap : 1000 km d&#8217;autonomie en conditions r&#233;elles avec cette voiture &#233;lectrique hors du commun</title>
      <link>https://www.frandroid.com/marques/renault/2918981_renault-franchit-un-cap-1000-km-dautonomie-en-conditions-reelles-avec-cette-voiture-electrique-hors-du-commun</link>
      <pubDate>Tue, 23 Dec 2025 10:16:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2918981_renault-franchit-un-cap-1000-km-dautonomie-en-conditions-reelles-avec-cette-voiture-electrique-hors-du-commun</guid>
      <description>
D&#233;voil&#233;e en d&#233;but d&#8217;ann&#233;e 2025, la Renault Filante Record a parcouru 1 008 kilom&#232;tres en seulement 9 heures et 52 minutes. Dot&#233;e d&#8217;une batterie &#233;quivalente &#224; celle du Sc&#233;nic E-Tech, la voiture &#233;lectrique s'attaque directement &#224; Mercedes et son concept Vision EQXX.
</description>
    </item>
    <item>
      <title>574 pirates arr&#234;t&#233;s, 6 ransomwares d&#233;chiffr&#233;s&#160;: la police frappe &#224; nouveau la cybercriminalit&#233; africaine</title>
      <link>https://www.01net.com/actualites/574-pirates-arretes-6-ransomwares-dechiffres-police-frappe-nouveau-cybercriminalite-africaine.html</link>
      <pubDate>Tue, 23 Dec 2025 10:01:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316765</guid>
      <description>Interpol vient de porter un coup majeur &#224; l&#8217;industrie criminelle africaine. Avec l'aide des forces de l'ordre locales, les enqu&#234;teurs ont interpell&#233; plus de 570 pirates et d&#233;chiffr&#233; six ransomwares. Les activit&#233;s vis&#233;es ont abouti &#224; des pertes financi&#232;res de plus de 21 millions de dollars.</description>
    </item>
    <item>
      <title>Watch These Live Cams of the Los Angeles Area Rain and Flood Risk During Christmas Week</title>
      <link>https://gizmodo.com/watch-these-live-cams-of-the-los-angeles-area-rain-and-flood-risk-during-christmas-week-2000702793</link>
      <pubDate>Tue, 23 Dec 2025 10:00:52 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702793</guid>
      <description>Southern California is bracing for mudslides and other hazards during the holiday week.</description>
    </item>
    <item>
      <title>The best SSDs in 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-ssds-140014262.html?src=rss</link>
      <pubDate>Tue, 23 Dec 2025 10:00:36 +0000</pubDate>
      <guid isPermaLink="false">de01e79a-abbe-42cf-88a9-a820abb3b1bd</guid>
      <description>Upgrading to a good SSD can make your computer feel brand new again. Apps open faster, files move in a blink and even older machines start to feel a lot more responsive. It is one of the easiest ways to breathe life into a laptop or desktop without replacing the whole system, and the performance boost is something you notice right away.There are plenty of SSDs to choose from, though, and the naming alone can be confusing if you are not already familiar with the specs. Some drives are built for simple upgrades, while others offer speeds that benefit creators or gamers. To help you sort through ...</description>
    </item>
    <item>
      <title>Want a home security camera without a subscription? I test smart home tech for a living, and these are my 3 recommendations</title>
      <link>https://www.techradar.com/home/home-security/top-3-subscription-free-home-security-cameras</link>
      <pubDate>Tue, 23 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">2enyf8GqqromzVEtRBNiSk</guid>
      <description>These feature-packed home security cameras offer crisp 4K footage, solar charging, local storage for your videos, and AI smarts too &#8211; with no extra fees.</description>
    </item>
    <item>
      <title>The Amandaland Christmas special has a hilarious Motherland Easter egg only a true superfan can spot</title>
      <link>https://www.techradar.com/streaming/entertainment/the-amandaland-christmas-special-has-a-hilarious-motherland-easter-egg-only-a-true-superfan-can-spot</link>
      <pubDate>Tue, 23 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">HMk5SUVfCyoN7gzatpQCs5</guid>
      <description>The Amandaland Christmas special is a British sitcom masterpiece, so keep your eye out for an extra crafty Motherland Easter egg.</description>
    </item>
    <item>
      <title>How &#8216;Cyberchase&#8217; keeps up</title>
      <link>https://www.fastcompany.com/91450169/cyberchase-pbs-ai-children-wnet</link>
      <pubDate>2025-12-23T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91450169/cyberchase-pbs-ai-children-wnet</guid>
      <description>The beloved kids television show is adapting to the age of streaming&#8212;and AI.
In the world of the long-running kids show Cyberchase, Motherboard, a sort of digital queen and literal technocrat, is the beneficent but impaired leader of all of cyberspace. She is&#8212;we are to understand&#8212;a legitimate ruler, yet faces constant attacks from the odious Hacker, a green-skinned android who dresses like a vampire and whose only goal is to sow chaos and eventually take control of Motherboard&#8217;s realm, which we might describe as something akin to a metaverse, or ever-expanding digital world....</description>
    </item>
    <item>
      <title>As health insurance costs rise, lawmakers remain undecided on who should pay for healthcare</title>
      <link>https://www.fastcompany.com/91463843/as-health-insurance-costs-rise-lawmakers-remain-undecided-on-who-should-pay-for-health-care</link>
      <pubDate>2025-12-23T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463843/as-health-insurance-costs-rise-lawmakers-remain-undecided-on-who-should-pay-for-health-care</guid>
      <description>Without finding resolution on this core issue, the U.S. will likely still be embroiled in the same debate for years.
December 15, 2025&#8212;the deadline for enrolling in a marketplace plan through the Affordable Care Act for 2026&#8212;came and went without an agreement on the federal subsidies that kept ACA plans more affordable for many Americans. Despite a last-ditch attempt in the House to extend ACA subsidies, with Congress adjourning for the year on December 19, it&#8217;s looking almost certain that Americans relying on ACA subsidies will face a steep increase in healthcare costs in 2026....</description>
    </item>
    <item>
      <title>What drives people to work during the holidays</title>
      <link>https://www.fastcompany.com/91463941/what-drives-people-to-work-during-the-holidays</link>
      <pubDate>2025-12-23T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463941/what-drives-people-to-work-during-the-holidays</guid>
      <description>There&#8217;s psychology behind why some sabotage their own work-life balance.
By the end of October, David, who works at a roughly 2,000-person finance firm in New York, already knew he&#8217;d be working during the holiday season this year. Usually at the office, he learned he&#8217;d at least get to work remotely between December 26 and January 1&#8212;with the way the financial calendar fell, it was inevitable that he couldn&#8217;t just disappear for clients (like institutional investors and family offices) during that time.&#160;...</description>
    </item>
    <item>
      <title>How will AI transform business in 2026?</title>
      <link>https://www.fastcompany.com/91464688/how-will-ai-transform-business-in-2026</link>
      <pubDate>2025-12-23T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464688/how-will-ai-transform-business-in-2026</guid>
      <description>AI scientist, entrepreneur, and &#8216;Pioneers of AI&#8217; podcast host Rana el Kaliouby shares her predictions for the year ahead.
How should leaders prepare for AI&#8217;s accelerating impact on work and everyday life? AI scientist, entrepreneur, and Pioneers of AI podcast host Rana el Kaliouby shares her predictions for the year ahead&#8212;from physical AI entering the real world to what it means to onboard AI into your org chart. El Kaliouby cuts through today&#8217;s biggest AI headlines, bringing to light the insights that will matter most in the months to come....</description>
    </item>
    <item>
      <title>&#171; L&#8217;ill&#233;gal qui devient payant ET compliqu&#233; &#187; : YGG provoque un scandale dans le milieu du piratage fran&#231;ais</title>
      <link>https://www.frandroid.com/culture-tech/web/2918897_lillegal-qui-devient-payant-et-complique-ygg-provoque-un-scandale-dans-le-milieu-du-piratage-francais</link>
      <pubDate>Tue, 23 Dec 2025 09:47:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/web/2918897_lillegal-qui-devient-payant-et-complique-ygg-provoque-un-scandale-dans-le-milieu-du-piratage-francais</guid>
      <description>
L'arriv&#233;e d'un mode Turbo modifiant le fonctionnement du site de piratage YGG Torrent provoque un scandale. Une partie des utilisateurs pr&#233;pare l'exode.
</description>
    </item>
    <item>
      <title>iOS 26.3 transforme vos &#233;couteurs Bluetooth en Airpods sur iPhone</title>
      <link>https://www.frandroid.com/marques/apple/2918901_ios-26-3-transforme-vos-ecouteurs-bluetooth-en-airpods-sur-iphone</link>
      <pubDate>Tue, 23 Dec 2025 09:45:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2918901_ios-26-3-transforme-vos-ecouteurs-bluetooth-en-airpods-sur-iphone</guid>
      <description>
Pour se mettre en conformit&#233; avec l'Union europ&#233;enne, Apple permet aux &#233;couteurs Bluetooth tiers de profiter de la m&#234;me connexion simplifi&#233;e que les Airpods.&#160;
</description>
    </item>
    <item>
      <title>&#171; &#28189;AD0001Z &#187; : pourquoi cette plaque d&#8217;immatriculation est importante pour le d&#233;veloppement des voitures autonomes</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2918913_%e6%b8%9dad0001z-pourquoi-cette-plaque-dimmatriculation-est-importante-pour-le-developpement-des-voitures-autonomes</link>
      <pubDate>Tue, 23 Dec 2025 09:39:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2918913_%e6%b8%9dad0001z-pourquoi-cette-plaque-dimmatriculation-est-importante-pour-le-developpement-des-voitures-autonomes</guid>
      <description>
C&#8217;est officiel, la Chine a remis la toute premi&#232;re plaque d&#8217;immatriculation &#224; une voiture autonome de niveau 3. Une grande premi&#232;re, qui marque une nouvelle &#233;tape dans le d&#233;veloppement de cette technologie.
</description>
    </item>
    <item>
      <title>Detecting AI-written text is challenging, even for&#160;AI. Here&#8217;s why</title>
      <link>https://www.fastcompany.com/91462947/ai-written-text-detection-verification</link>
      <pubDate>2025-12-23T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91462947/ai-written-text-detection-verification</guid>
      <description>AI text detection is part of an escalating arms race.
People and institutions are grappling with the consequences of AI-written text. Teachers want to know whether students&#8217; work reflects their own understanding; consumers want to know whether an advertisement was written by a human or a machine.</description>
    </item>
    <item>
      <title>Voici les prix fran&#231;ais du Kia EV5 : pourquoi cette voiture &#233;lectrique rivale du Peugeot 3008 part avec un handicap</title>
      <link>https://www.frandroid.com/marques/kia/2918889_voici-les-prix-francais-du-kia-ev5-pourquoi-cette-voiture-electrique-rivale-du-peugeot-3008-part-avec-un-handicap</link>
      <pubDate>Tue, 23 Dec 2025 09:17:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/kia/2918889_voici-les-prix-francais-du-kia-ev5-pourquoi-cette-voiture-electrique-rivale-du-peugeot-3008-part-avec-un-handicap</guid>
      <description>
Lanc&#233;e en 2024 en Chine, la nouvelle Kia EV5 d&#233;barque enfin sur les routes europ&#233;ennes. La voiture &#233;lectrique cor&#233;enne d&#233;marre &#224; moins de 45 000 euros dans sa version d&#8217;entr&#233;e de gamme avec une autonomie d&#233;cente, mais n'est pas &#233;ligible au bonus &#233;cologique.
</description>
    </item>
    <item>
      <title>Voici le laptop gaming sous RTX 5060 le moins cher de No&#235;l</title>
      <link>https://www.frandroid.com/bons-plans/2768285_voici-le-laptop-gaming-sous-rtx-5060-le-moins-cher-de-noel</link>
      <pubDate>Tue, 23 Dec 2025 09:16:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2768285_voici-le-laptop-gaming-sous-rtx-5060-le-moins-cher-de-noel</guid>
      <description>
Puce Intel Core i7 de 13e g&#233;n&#233;ration, carte graphique RTX 5060, grande dalle rafra&#238;chie &#224; 165 Hz... Il ne manque quasiment rien au Gigabyte Gaming A16, pas m&#234;me un prix avantageux : chez PC Componentes, on le trouve &#224; 859 euros au lieu de 1 199,90 euros.
</description>
    </item>
    <item>
      <title>Pourquoi le prix des iPhone, iPad et Mac risque d&#8217;augmenter fortement en 2026</title>
      <link>https://www.frandroid.com/marques/apple/2918871_pourquoi-le-prix-des-iphone-ipad-et-mac-risque-daugmenter-fortement-en-2026</link>
      <pubDate>Tue, 23 Dec 2025 09:15:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2918871_pourquoi-le-prix-des-iphone-ipad-et-mac-risque-daugmenter-fortement-en-2026</guid>
      <description>
La p&#233;nurie de m&#233;moire vive n'&#233;pargnera pas Apple en 2026. On apprend que l'accord qui lie Samsung et SK Hynix au g&#233;ant de Cupertino prend fin en janvier. Cela risque fort de conduire ces deux acteurs &#224; revoir leurs prix &#224; la hausse... avec un potentiel impact sur le tarif des iPhone, iPad et autres Mac dans les prochains mois.
</description>
    </item>
    <item>
      <title>Cyberattaque La Poste&#160;: c&#8217;est quoi l&#8217;attaque par &#171;&#160;d&#233;ni de service&#160;&#187; qui bloque encore Colissimo&#160;?</title>
      <link>https://www.01net.com/actualites/cyberattaque-la-poste-cest-quoi-lattaque-par-deni-de-service-qui-bloque-encore-colissimo.html</link>
      <pubDate>Tue, 23 Dec 2025 09:03:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316762</guid>
      <description>L'acc&#232;s aux comptes bancaires revient progressivement ce mardi matin, mais le site de Colissimo reste inaccessible. Le groupe La Poste a confirm&#233; subir une attaque par &#171; d&#233;ni de service &#187; (DDoS). Derri&#232;re ce terme technique se cache une strat&#233;gie d'&#233;touffement num&#233;rique qui explique pourquoi le retour &#224; la normale se fait en ordre dispers&#233;.</description>
    </item>
    <item>
      <title>Les v&#233;los &#233;lectriques boost&#233;s par les moteurs Brose vont avoir droit &#224; leur petite r&#233;volution</title>
      <link>https://www.frandroid.com/marques/brose/2918979_les-velos-electriques-boostes-par-les-moteurs-brose-vont-avoir-droit-a-leur-petite-revolution</link>
      <pubDate>Tue, 23 Dec 2025 09:02:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/brose/2918979_les-velos-electriques-boostes-par-les-moteurs-brose-vont-avoir-droit-a-leur-petite-revolution</guid>
      <description>
L&#8217;application Brose d&#233;di&#233;e aux v&#233;los &#233;lectriques va bient&#244;t changer de nom pour devenir QORE, dans un contexte marqu&#233; par le rachat de la division moteurs &#233;lectriques de Brose par Yamaha Motor. Cette &#233;volution s&#8217;accompagne de nouvelles fonctionnalit&#233;s logicielles importantes.
</description>
    </item>
    <item>
      <title>Quel smartphone photo acheter en 2025 ? Notre guide complet</title>
      <link>https://www.frandroid.com/guide-dachat/smartphones/367607_meilleurs-smartphones-photos</link>
      <pubDate>Tue, 23 Dec 2025 09:00:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/smartphones/367607_meilleurs-smartphones-photos</guid>
      <description>
L'appareil photo est souvent un point majeur lorsqu&#8217;il s&#8217;agit de choisir un nouveau t&#233;l&#233;phone. Lors de nos tests, c'est un domaine que nous scrutons pr&#233;cis&#233;ment. Voici notre s&#233;lection des meilleurs smartphones photo du march&#233;.
</description>
    </item>
    <item>
      <title>3 canceled Netflix shows in 2025 that are still worth watching</title>
      <link>https://www.techradar.com/streaming/netflix/3-canceled-netflix-shows-in-2025-that-are-still-worth-watching</link>
      <pubDate>Tue, 23 Dec 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">ge8SKHjQxZVX86QN8JBGY5</guid>
      <description>From crime comedies to spy thrillers via the latest from the creator of Dawson's Creek, here are three canceled Netflix shows from 2025 that are still worth checking out.</description>
    </item>
    <item>
      <title>5 mindsets about running that help you move forward in life</title>
      <link>https://www.fastcompany.com/91452455/running-mindsets-move-forward-in-life</link>
      <pubDate>2025-12-23T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91452455/running-mindsets-move-forward-in-life</guid>
      <description>You have to push yourself if you want to get better, but the most important part is learning to run every day.
Below, Nicholas Thompson shares five key insights from his new book, The Running Ground: A Father, a Son, and the Simplest of Sports.</description>
    </item>
    <item>
      <title>Here&#8217;s how to protect your privacy when using AI assistants</title>
      <link>https://www.fastcompany.com/91453915/heres-how-to-protect-your-privacy-when-using-ai-assistants</link>
      <pubDate>2025-12-23T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91453915/heres-how-to-protect-your-privacy-when-using-ai-assistants</guid>
      <description>Do you share your innermost thoughts with ChatGPT? You might want to think twice&#8212;or at least change your settings fast.&#160;&#160;
Do you share your innermost thoughts with ChatGPT? You might want to think twice&#8212;or at least change your settings fast.&#160;&#160;</description>
    </item>
    <item>
      <title>La Banque Postale en panne : la banque en ligne et les services de La Poste toujours inaccessibles au lendemain de la cyberattaque</title>
      <link>https://www.frandroid.com/services/banque-en-ligne/2917771_la-banque-postale-est-en-panne-cest-confirme-une-cyberattaque-touche-tous-les-services-de-la-poste</link>
      <pubDate>Tue, 23 Dec 2025 08:50:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/banque-en-ligne/2917771_la-banque-postale-est-en-panne-cest-confirme-une-cyberattaque-touche-tous-les-services-de-la-poste</guid>
      <description>
La cyberattaque qui touche plusieurs services de La Poste (La Banque Postale, Colissimo, Digiposte) est toujours en cours ce matin du mardi 23 d&#233;cembre, plus de 24 heures apr&#232;s les premiers signalements. Mais un retour &#224; la normale pourrait bient&#244;t survenir.
</description>
    </item>
    <item>
      <title>Nissan annonce avoir subi une fuite de donn&#233;es</title>
      <link>https://www.01net.com/actualites/nissan-annonce-avoir-subi-fuite-donnees.html</link>
      <pubDate>Tue, 23 Dec 2025 08:46:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316756</guid>
      <description>Nissan reconna&#238;t une nouvelle fuite de donn&#233;es. Les informations de 21 000 clients ont &#233;t&#233; compromises durant le hack d'un prestataire, &#224; savoir Red Hat. La marque japonaise promet de muscler la surveillance de ses sous-traitants.</description>
    </item>
    <item>
      <title>Seth Meyers releases 7 minutes of bonus Day Drinking footage with Sabrina Carpenter</title>
      <link>https://mashable.com/video/seth-meyers-sabrina-carpenter-bonus-day-drinking</link>
      <pubDate>Tue, 23 Dec 2025 08:45:12 +0000</pubDate>
      <guid isPermaLink="false">00E2aVMvuymnh2KcV8sLYtm</guid>
      <description>Seth Meyers has released bonus footage from "Day Drinking" with Sabrina Carpenter.</description>
    </item>
  </channel>
</rss>
