<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 24 Dec 2025 10:27:11 GMT</lastBuildDate>
    <item>
      <title>How to watch Shortland Street online for FREE from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/how-to-watch-shortland-street-online-for-free-from-anywhere</link>
      <pubDate>Wed, 24 Dec 2025 10:24:28 +0000</pubDate>
      <guid isPermaLink="false">PuzYvv4wLcKBQbDVcXNLDb</guid>
      <description>Here's our guide on how to watch Shortland Street for FREE on TVNZ+ from anywhere in the world.</description>
    </item>
    <item>
      <title>La Poste et La Banque Postale toujours en panne : le timing de l&#8217;attaque DDoS est parfait pour les pirates, horrible pour vous</title>
      <link>https://www.frandroid.com/culture-tech/securite-applications/2920513_la-poste-et-la-banque-postale-toujours-en-panne-le-timing-de-lattaque-ddos-est-parfait-pour-les-pirates-horrible-pour-vous</link>
      <pubDate>Wed, 24 Dec 2025 10:20:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/securite-applications/2920513_la-poste-et-la-banque-postale-toujours-en-panne-le-timing-de-lattaque-ddos-est-parfait-pour-les-pirates-horrible-pour-vous</guid>
      <description>
Le timing ne pouvait pas &#234;tre pire. En pleine "semaine de l'enfer" pour la logistique de No&#235;l, La Poste encaisse une cyberattaque d'ampleur. Des hackers prorusses revendiquent, le gouvernement enqu&#234;te, et vos applications rament. On fait le point sur ce qui fonctionne (et ce qui est cass&#233;).
</description>
    </item>
    <item>
      <title>En pleine d&#233;b&#226;cle sur la voiture &#233;lectrique, Ford a trouv&#233; une excellente id&#233;e pour recycler son alliance avec le N&#176;1 mondial des batteries</title>
      <link>https://www.frandroid.com/marques/ford/2920341_en-pleine-debacle-sur-la-voiture-electrique-ford-a-trouve-une-excellente-idee-pour-recycler-son-alliance-avec-le-n1-mondial-des-batteries</link>
      <pubDate>Wed, 24 Dec 2025 10:16:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/ford/2920341_en-pleine-debacle-sur-la-voiture-electrique-ford-a-trouve-une-excellente-idee-pour-recycler-son-alliance-avec-le-n1-mondial-des-batteries</guid>
      <description>
En plein recul sur la voiture &#233;lectrique, Ford a d&#233;cid&#233; de prolonger son partenariat avec CATL, le leader mondial des batteries. L&#8217;id&#233;e : travailler avec le g&#233;ant chinois pour d&#233;velopper ses solutions de stockage stationnaire, notamment &#224; destination des data centers.
</description>
    </item>
    <item>
      <title>Orange d&#233;ploie un gros changement de Wi-Fi sur les anciennes Livebox et Sosh : votre d&#233;bit peut &#234;tre impact&#233;</title>
      <link>https://www.frandroid.com/marques/orange/2920473_orange-deploie-un-gros-changement-de-wi-fi-sur-les-anciennes-livebox-et-sosh-votre-debit-peut-etre-impacte</link>
      <pubDate>Wed, 24 Dec 2025 10:06:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/orange/2920473_orange-deploie-un-gros-changement-de-wi-fi-sur-les-anciennes-livebox-et-sosh-votre-debit-peut-etre-impacte</guid>
      <description>
Orange a d&#233;cid&#233; d'activer par d&#233;faut une gestion agressive du Wifi sur ses anciennes box, y compris chez Sosh. Le principe est simple : votre box &#233;teint la bande des 5 GHz quand elle juge que vous n'en avez pas besoin. 
</description>
    </item>
    <item>
      <title>Ils ont pli&#233; le Samsung Galaxy Z TriFold pendant 8 jours et ses charni&#232;res n&#8217;ont pas du tout aim&#233; &#231;a</title>
      <link>https://www.frandroid.com/marques/samsung/2920389_ils-ont-plie-le-samsung-galaxy-z-trifold-pendant-8-jours-et-ses-charnieres-nont-pas-du-tout-aime-ca</link>
      <pubDate>Wed, 24 Dec 2025 10:04:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2920389_ils-ont-plie-le-samsung-galaxy-z-trifold-pendant-8-jours-et-ses-charnieres-nont-pas-du-tout-aime-ca</guid>
      <description>
Apr&#232;s huit jours de manipulations incessantes, les charni&#232;res du Galaxy Z TriFold montrent des signes de faiblesse.
</description>
    </item>
    <item>
      <title>Pillage de donn&#233;es sur Chrome&#160;: 2 extensions malveillantes siphonnent vos identifiants et mots de passe</title>
      <link>https://www.01net.com/actualites/pillage-donnees-chrome-2-extensions-malveillantes-siphonnent-identifiants-mots-passe.html</link>
      <pubDate>Wed, 24 Dec 2025 10:01:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316971</guid>
      <description>Deux extensions Chrome malveillantes ont &#233;t&#233; prises la main dans le sac en train de piller vos donn&#233;es. Elles sont capables de d&#233;tourner tout votre trafic web vers des serveurs contr&#244;l&#233;s par des pirates , ce qui permet d'intercepter mots de passe, identifiants et donn&#233;es bancaires.</description>
    </item>
    <item>
      <title>Dangerous WebRAT malware now being spread by GitHub repositories</title>
      <link>https://www.techradar.com/pro/security/dangerous-webrat-malware-now-being-spread-by-github-repositories</link>
      <pubDate>Wed, 24 Dec 2025 10:00:45 +0000</pubDate>
      <guid isPermaLink="false">qqZNuU6cDZgvRJjNiJi9Ui</guid>
      <description>Security researchers find 15 malicious repositories, all deploying a dropper for the WebRAT backdoor.</description>
    </item>
    <item>
      <title>The best streaming services in 2026</title>
      <link>https://www.engadget.com/entertainment/streaming/best-streaming-services-154527042.html?src=rss</link>
      <pubDate>Wed, 24 Dec 2025 10:00:36 +0000</pubDate>
      <guid isPermaLink="false">0be6f8f4-074d-390f-96d4-13e40bbd63a2</guid>
      <description>With so many streaming platforms out there, it is easy to feel like you are constantly sorting through menus instead of watching something you enjoy. Every service has its own vibe, whether it is big cinematic releases, long documentary deep dives or shows you put on in the background while you unwind. Some people even swap cable for live TV streaming.Here, we are looking at the on-demand services that deliver the most value for everyday use. Whether you are settling in for a weekend binge, watching with family or catching up on a favorite series during your commute, these are the best streami...</description>
    </item>
    <item>
      <title>People Love This Porsche Christmas Ad Because It Doesn&#8217;t Look Like AI Was Involved</title>
      <link>https://gizmodo.com/people-love-this-porsche-christmas-ad-because-it-doesnt-look-like-ai-was-involved-2000703180</link>
      <pubDate>Wed, 24 Dec 2025 10:00:25 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703180</guid>
      <description>The McDonald's Christmas AI monstrosity has left people desperate for something to like.</description>
    </item>
    <item>
      <title>AlphaFold Changed Science. After 5 Years, It&#8217;s Still Evolving</title>
      <link>https://www.wired.com/story/alphafold-changed-science-after-5-years-its-still-evolving/</link>
      <pubDate>Wed, 24 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">694571960d8cb17860889094</guid>
      <description>WIRED spoke with DeepMind&#8217;s Pushmeet Kohli about the recent past&#8212;and promising future&#8212;of the Nobel Prize-winning research project that changed biology and chemistry forever.</description>
    </item>
    <item>
      <title>SteelSeries Arctis Nova 7P Gen 2 review: a highly versatile headset that&#8217;s become my daily driver</title>
      <link>https://www.techradar.com/gaming/steelseries-arctis-nova-7p-gen-2-review</link>
      <pubDate>Wed, 24 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">MHhpEBHbGXRs5E8ucfT6L3</guid>
      <description>The SteelSeries Arctis Nova 7P Gen 2 wireless headset pairs Bluetooth and 2.4Ghz connected audio with a comfortable design and a deep suite of software features. Here&#8217;s our full review.</description>
    </item>
    <item>
      <title>I tested 30 pairs of headphones in 2025, and these are the 4 I still want to use</title>
      <link>https://www.techradar.com/audio/headphones/i-tested-30-pairs-of-headphones-in-2025-and-these-are-the-4-i-still-want-to-use</link>
      <pubDate>Wed, 24 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">DBRzFuu8TumrsS7ui6pbKR</guid>
      <description>Narrowing the bunch to a wishlist</description>
    </item>
    <item>
      <title>American workers had a rough 2025. Will 2026 be any different?</title>
      <link>https://www.fastcompany.com/91464803/american-workers-had-a-rough-2025-will-2026-be-any-different</link>
      <pubDate>2025-12-24T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464803/american-workers-had-a-rough-2025-will-2026-be-any-different</guid>
      <description>Americans were too afraid to ask for a raise in this year&#8217;s uncertain economy, relying on side gigs to make ends meet.
It&#8217;s been a rough year for American workers. Unfortunately, 2026 isn&#8217;t looking all that much better.</description>
    </item>
    <item>
      <title>Ubiquiti sort un routeur de voyage : g&#233;nial pour l&#8217;&#233;cosyst&#232;me, d&#233;cevant sur un point</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/routeur/2920449_ubiquiti-sort-un-routeur-de-voyage-genial-pour-lecosysteme-decevant-sur-un-point</link>
      <pubDate>Wed, 24 Dec 2025 09:59:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/routeur/2920449_ubiquiti-sort-un-routeur-de-voyage-genial-pour-lecosysteme-decevant-sur-un-point</guid>
      <description>
Vous connaissez l'enfer du Wi-Fi d'h&#244;tel ? D&#233;bits difficiles, s&#233;curit&#233; douteuse et ce portail captif qui vous demande votre num&#233;ro de chambre toutes les deux heures. Ubiquiti a (enfin) une solution. Le UniFi Travel Router arrive, il co&#251;te 79 dollars, et c'est peut-&#234;tre le meilleur ami de votre sac &#224; dos.
</description>
    </item>
    <item>
      <title>iPhone 17 : le meilleur smartphone Apple du moment revient en promo pour No&#235;l</title>
      <link>https://www.frandroid.com/bons-plans/2888777_iphone-17-le-meilleur-smartphone-apple-du-moment-revient-en-promo-pour-noel</link>
      <pubDate>Wed, 24 Dec 2025 09:48:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2888777_iphone-17-le-meilleur-smartphone-apple-du-moment-revient-en-promo-pour-noel</guid>
      <description>
L'une des meilleures offres de No&#235;l, c'est l'iPhone 17, aka le meilleur mod&#232;le actuel de la Pomme, qui est propos&#233; &#224; 859 euros au lieu de 969 euros chez Rakuten.
</description>
    </item>
    <item>
      <title>CES Picks 2026 Awards - entry deadline extended, so act now</title>
      <link>https://www.techradar.com/pro/ces-picks-2026-awards-entry-deadline-extended-so-act-now</link>
      <pubDate>Wed, 24 Dec 2025 09:30:32 +0000</pubDate>
      <guid isPermaLink="false">exwStvCxgbvBdokeNNGZr9</guid>
      <description>Enter now for the 2026 CES Picks Awards.</description>
    </item>
    <item>
      <title>Voiture &#233;lectrique : le chiffre hallucinant que BYD s&#8217;appr&#234;te &#224; atteindre hors de Chine</title>
      <link>https://www.frandroid.com/marques/byd/2920353_voiture-electrique-le-chiffre-hallucinant-que-byd-sapprete-a-atteindre-hors-de-chine</link>
      <pubDate>Wed, 24 Dec 2025 09:29:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2920353_voiture-electrique-le-chiffre-hallucinant-que-byd-sapprete-a-atteindre-hors-de-chine</guid>
      <description>
Selon les estimations, BYD pourrait atteindre la barre du million de v&#233;hicules export&#233;s en dehors de la Chine en 2025. Le num&#233;ro 1 mondial de la voiture &#233;lectrique a enregistr&#233; une hausse impressionnante de 144&#160;% de ses ventes &#224; l'&#233;tranger par rapport &#224; 2024.
</description>
    </item>
    <item>
      <title>Elle se vend 5 fois plus que la Renault 5 : cette voiture &#233;lectrique chinoise &#224; 8 000 &#8364; cartonne et arrive bient&#244;t en Europe</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2920319_elle-se-vend-5-fois-plus-que-la-renault-5-cette-voiture-electrique-chinoise-a-8-000-e-cartonne-et-arrive-bientot-en-europe</link>
      <pubDate>Wed, 24 Dec 2025 09:09:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2920319_elle-se-vend-5-fois-plus-que-la-renault-5-cette-voiture-electrique-chinoise-a-8-000-e-cartonne-et-arrive-bientot-en-europe</guid>
      <description>
Encore m&#233;connue en Europe, la nouvelle Geely EX2 fait d&#233;j&#224; un carton en Chine. Lanc&#233;e en m&#234;me temps que la Renault 5 E-Tech, cette petite voiture &#233;lectrique totalise d&#233;j&#224; plus de 500 000 immatriculations en &#224; peine un an, soit cinq fois plus que la R5 sur la m&#234;me p&#233;riode.
</description>
    </item>
    <item>
      <title>Save Christmas with these last minute PlayStation gift card deals</title>
      <link>https://www.techradar.com/gaming/save-christmas-with-these-last-minute-playstation-gift-card-deals</link>
      <pubDate>Wed, 24 Dec 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">GPmmsBoGtHKvGY6HBL9pyN</guid>
      <description>These PlayStation gift cards are fantastic last minute Christmas gifts.</description>
    </item>
    <item>
      <title>Google is betting on carbon capture tech to lower data center emissions. Here&#8217;s how it works</title>
      <link>https://www.fastcompany.com/91452438/google-data-center-power-carbon-capture-tech-emissions</link>
      <pubDate>2025-12-24T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91452438/google-data-center-power-carbon-capture-tech-emissions</guid>
      <description>Google&#8217;s power plant is designed to capture about 90% of its carbon dioxide emissions and permanently store them underground in a deep saline aquifer.
As AI data centers spring up across the country, their energy demand and resulting greenhouse gas emissions are raising concerns. With servers and energy-intensive cooling systems constantly running, these buildings can use anywhere from a few megawatts of power for a small data center to more than 100 megawatts for a hyperscale data center. To put that in perspective, the average large natural gas power plant built in the U.S. generates less th...</description>
    </item>
    <item>
      <title>Amazon fait un super prix ce SSD externe ultra&#8209;rapide de 4 To avant la flamb&#233;e des prix du stockage</title>
      <link>https://www.frandroid.com/bons-plans/2910611_amazon-fait-un-super-prix-ce-ssd-externe-ultrarapide-de-4-to-avant-la-flambee-des-prix-du-stockage</link>
      <pubDate>Wed, 24 Dec 2025 08:59:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2910611_amazon-fait-un-super-prix-ce-ssd-externe-ultrarapide-de-4-to-avant-la-flambee-des-prix-du-stockage</guid>
      <description>
&#192; l&#8217;heure o&#249; les prix de la m&#233;moire vive s&#8217;envolent et que la p&#233;nurie menace les composants, le Crucial X10 Pro se pr&#233;sente comme une solution de stockage rapide, robuste et abordable. Actuellement en promotion dans sa version 4 To, ce SSD externe devient un alli&#233; pr&#233;cieux.
</description>
    </item>
  </channel>
</rss>
