<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 06 Nov 2025 09:41:17 GMT</lastBuildDate>
    <item>
      <title>Samsung Galaxy S26 Ultra : ce petit changement de design qui saute aux yeux gr&#226;ce &#224; ces images</title>
      <link>https://www.frandroid.com/actualites-generales/2857305_samsung-galaxy-s26-ultra-ce-petit-changement-de-design-qui-saute-aux-yeux-grace-a-ces-images</link>
      <pubDate>Thu, 06 Nov 2025 09:40:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2857305_samsung-galaxy-s26-ultra-ce-petit-changement-de-design-qui-saute-aux-yeux-grace-a-ces-images</guid>
      <description>
Deux montages photo permettent de mieux observer l'arrondi plus prononc&#233; des angles du Samsung Galaxy S26 Ultra.
</description>
    </item>
    <item>
      <title>Harley-Davidson passe au scooter &#233;lectrique avec ce mod&#232;le puissant tout droit venu du futur et on l&#8217;a vu</title>
      <link>https://www.frandroid.com/survoltes/scooters-electriques/2855095_harley-davidson-passe-au-scooter-electrique-avec-ce-modele-puissant-tout-droit-venu-du-futur-et-on-la-vu</link>
      <pubDate>Thu, 06 Nov 2025 09:37:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/scooters-electriques/2855095_harley-davidson-passe-au-scooter-electrique-avec-ce-modele-puissant-tout-droit-venu-du-futur-et-on-la-vu</guid>
      <description>
Quelques mois apr&#232;s les rendus num&#233;riques et les premi&#232;res photos, nous avons enfin d&#233;couvert en vrai les nouvelles LiveWire S4 Honcho et le prototype de maxi-scooter S2 &#224; l&#8217;EICMA 2025. 
</description>
    </item>
    <item>
      <title>JBL Partybox 710 : l&#8217;enceinte ultime pour animer vos soir&#233;es est &#224; -30 % lors du pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2534355_jbl-partybox-710-lenceinte-ultime-pour-animer-vos-soirees-est-a-moins-30-pourcents-lors-du-pre-black-friday</link>
      <pubDate>Thu, 06 Nov 2025 09:27:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2534355_jbl-partybox-710-lenceinte-ultime-pour-animer-vos-soirees-est-a-moins-30-pourcents-lors-du-pre-black-friday</guid>
      <description>
En qu&#234;te d'une giga enceinte pour ambiancer vos soir&#233;es cet &#233;t&#233; ? Alors bonne nouvelle, l'impressionnante JBL Partybox 710, avec son caisson de basses int&#233;gr&#233;, son syst&#232;me d&#8217;&#233;clairage dynamique et surtout, sa puissance de 800 W, est &#224; prix r&#233;duit sur Amazon : au lieu de 799 euros, elle passe &#224; 559 euros. 
</description>
    </item>
    <item>
      <title>Black Friday en avant-premi&#232;re sur les tablettes tactiles : la s&#233;lection des offres en or sur les Samsung Galaxy Tab, Xiaomi Pad et autres</title>
      <link>https://www.frandroid.com/bons-plans/2850637_black-friday-en-avant-premiere-sur-les-tablettes-tactiles-la-selection-des-offres-en-or-sur-les-samsung-galaxy-tab-xiaomi-pad-et-autres</link>
      <pubDate>Thu, 06 Nov 2025 09:27:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850637_black-friday-en-avant-premiere-sur-les-tablettes-tactiles-la-selection-des-offres-en-or-sur-les-samsung-galaxy-tab-xiaomi-pad-et-autres</guid>
      <description>
Les tablettes tactiles se vendent moins qu'il y a quelques ann&#233;es, certes, mais on leur trouve toujours une utilit&#233;. Notamment pour certaines t&#226;ches comme le montage photo ou vid&#233;o, avec un stylet, y a pas plus agr&#233;able. Pendant l'avant-premi&#232;re du Black Friday, nombre de ces dalles sont en promo.
</description>
    </item>
    <item>
      <title>Ce n&#8217;est plus de la science-fiction, la voiture volante sort de l&#8217;usine de ce constructeur chinois</title>
      <link>https://www.01net.com/actualites/ce-nest-plus-de-la-science-fiction-la-voiture-volante-sort-de-lusine-de-ce-constructeur-chinois.html</link>
      <pubDate>Thu, 06 Nov 2025 09:24:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305596</guid>
      <description>XPeng transforme la science-fiction en r&#233;alit&#233;. La production de sa voiture volante modulaire est lanc&#233;e, le carnet de commandes explose &#224; 7 000 unit&#233;s.</description>
    </item>
    <item>
      <title>Voici la nouvelle Formule E : encore plus de puissance et des technologies bient&#244;t dans nos voitures &#233;lectriques de s&#233;rie</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2856553_voici-la-nouvelle-formule-e-encore-plus-de-puissance-et-des-technologies-bientot-dans-nos-voitures-electriques-de-serie</link>
      <pubDate>Thu, 06 Nov 2025 09:24:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2856553_voici-la-nouvelle-formule-e-encore-plus-de-puissance-et-des-technologies-bientot-dans-nos-voitures-electriques-de-serie</guid>
      <description>
La Formule E d&#233;voile sa nouvelle voiture &#233;lectrique pour la saison 2026/2027. Avec jusqu'&#224; 815 chevaux et une transmission int&#233;grale permanente, la GEN4 promet un spectacle in&#233;dit. Mais derri&#232;re les chiffres impressionnants, le championnat saura-t-il enfin convaincre au-del&#224; du discours &#233;cologique ?
</description>
    </item>
    <item>
      <title>On a vu la nouvelle Peugeot 103 &#233;lectrique : le retour de la mythique mobylette, mais en bien mieux</title>
      <link>https://www.frandroid.com/marques/peugeot/2856809_on-a-vu-la-nouvelle-peugeot-103-electrique-le-retour-de-la-mythique-mobylette-mais-en-bien-mieux</link>
      <pubDate>Thu, 06 Nov 2025 09:17:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/peugeot/2856809_on-a-vu-la-nouvelle-peugeot-103-electrique-le-retour-de-la-mythique-mobylette-mais-en-bien-mieux</guid>
      <description>
Peugeot d&#233;voile enfin sa nouvelle mobylette 103 &#233;lectrique. Un deux roues n&#233;o-r&#233;tro qui s'am&#233;liore &#233;norm&#233;ment, avec une puissance revue &#224; la hausse, mais pas seulement. Nous avons pu l'approcher, voici tout ce qu'il faut en retenir.
</description>
    </item>
    <item>
      <title>Un plan de sauvetage est en cours pour l&#8217;un des leaders des kits d&#8217;&#233;lectrification pour v&#233;lo</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2857311_un-plan-de-sauvetage-est-en-cours-pour-lun-des-leaders-des-kits-delectrification-pour-velo</link>
      <pubDate>Thu, 06 Nov 2025 09:16:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2857311_un-plan-de-sauvetage-est-en-cours-pour-lun-des-leaders-des-kits-delectrification-pour-velo</guid>
      <description>
Visiblement en difficult&#233; financi&#232;re, Swytch tente de se restructurer &#224; travers un plan de sauvetage soutenu par ses investisseurs historiques. Le sp&#233;cialiste britannique des kits d&#8217;&#233;lectrification pour v&#233;los esp&#232;re ainsi s&#233;curiser sa tr&#233;sorerie.
</description>
    </item>
    <item>
      <title>Fnac et Darty multiplient les offres durant le pr&#233;-Black Friday: les 18 offres qui valent le coup</title>
      <link>https://www.frandroid.com/bons-plans/2849237_fnac-et-darty-bradent-de-nombreux-produits-tech-lors-du-pre-black-friday-les-17-offres-a-retenir</link>
      <pubDate>Thu, 06 Nov 2025 09:13:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849237_fnac-et-darty-bradent-de-nombreux-produits-tech-lors-du-pre-black-friday-les-17-offres-a-retenir</guid>
      <description>
Apr&#232;s avoir pris de court ses concurrents en lan&#231;ant son op&#233;ration Black Friday avant l&#8217;heure, Boulanger a d&#233;clench&#233; une v&#233;ritable course aux promotions. Pour ne pas se laisser distancer, la Fnac et Darty ont &#224; leur tour d&#233;gain&#233; leurs offres sp&#233;ciales. Pour vous y retrouver, nous avons s&#233;lectionn&#233; les meilleures offres disponibles chez les deux enseignes. 
...</description>
    </item>
    <item>
      <title>Nintendo Switch&#160;: c&#8217;est le d&#233;but de la fin</title>
      <link>https://www.01net.com/actualites/cest-debut-fin-pour-nintendo-switch.html</link>
      <pubDate>Thu, 06 Nov 2025 09:07:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305617</guid>
      <description>Nintendo pr&#233;pare doucement la fin de la Switch. L&#8217;entreprise japonaise veut d&#233;sormais concentrer ses efforts sur sa nouvelle console, la Switch 2, devenue son principal axe de d&#233;veloppement.</description>
    </item>
    <item>
      <title>Perplexity s&#8217;invite dans Snapchat suite &#224; un deal &#224; 400 millions de dollars</title>
      <link>https://www.01net.com/actualites/perplexity-invite-snapchat-suite-400-millions-dollars.html</link>
      <pubDate>Thu, 06 Nov 2025 09:01:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305614</guid>
      <description>Snapchat s&#8217;allie &#224; Perplexity AI. Le moteur de recherche dop&#233; &#224; l&#8217;intelligence artificielle fera bient&#244;t son entr&#233;e sur le r&#233;seau social. Le ticket d'entr&#233;e pay&#233; par la start-up IA est de 400 millions de dollars. Cette collaboration strat&#233;gique illustre la volont&#233; de Snap de transformer son r&#233;seau social en v&#233;ritable plateforme d&#8217;accueil pour les g&#233;ants de l&#8217;IA....</description>
    </item>
    <item>
      <title>Ventures Platform, one of Africa&#8217;s most active early-stage investors, has raised another $64 million</title>
      <link>https://techcrunch.com/2025/11/06/nigeria-backs-ventures-platform-as-seed-fund-hits-64m-first-close/</link>
      <pubDate>Thu, 06 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3065253</guid>
      <description>The Lagos-based firm and one of Africa&#8217;s most active early-stage investors is targeting a final close of $75 million for its second fund.</description>
    </item>
    <item>
      <title>How to watch All Her Fault online from anywhere for FREE &#8211; stream new suburban thriller</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/all-her-fault-free</link>
      <pubDate>Thu, 06 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">hg7JQjgLgRStYNwbBC5p7f</guid>
      <description>When a woman goes to collect her son from a playdate, what she discovers is every parent's worst nightmare. Here's how to watch All Her Fault online no matter where in the world you are.</description>
    </item>
    <item>
      <title>Hi-fi legend Focal is launching an astounding Dolby Atmos soundbar &#8211; but can your living room handle it?</title>
      <link>https://www.techradar.com/televisions/soundbars/hi-fi-legend-focal-is-launching-an-astounding-dolby-atmos-soundbar-but-can-your-living-room-handle-it</link>
      <pubDate>Thu, 06 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">E7R3XZ7BCKi8jVtZMPARWG</guid>
      <description>The new Mu-so Hekla is a 660W, 15-driver soundbar with Dolby Atmos and Hi-Res streaming</description>
    </item>
    <item>
      <title>When you&#8217;re asked to apply for a promotion&#8212;but you&#8217;re not sure you want it</title>
      <link>https://www.fastcompany.com/91431442/promotion-youre-not-sure</link>
      <pubDate>2025-11-06T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91431442/promotion-youre-not-sure</guid>
      <description>How to evaluate the opportunity without being swept away by it.
Being asked to apply for a promotion is often framed as an unqualified win: validation that your work is seen and your potential recognized. Yet for many high-achieving professionals, that invitation can spark as much ambivalence as excitement.</description>
    </item>
    <item>
      <title>Tic-tac ! Le Black Friday est en avance sur les montres connect&#233;es Apple, Garmin, Huawei et autres&#8230; Voici notre top des offres</title>
      <link>https://www.frandroid.com/bons-plans/2854639_tic-tac-le-black-friday-est-en-avance-sur-les-montres-connectees-apple-garmin-huawei-et-autres-voici-notre-top-des-offres</link>
      <pubDate>Thu, 06 Nov 2025 08:55:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2854639_tic-tac-le-black-friday-est-en-avance-sur-les-montres-connectees-apple-garmin-huawei-et-autres-voici-notre-top-des-offres</guid>
      <description>
Des promotions qui arrivent bien avant l'heure ! Le Black Friday en avant-premi&#232;re s'attaque aux montres connect&#233;es ainsi qu'aux bracelets, des mod&#232;les lifestyle &#224; ceux d&#233;di&#233;s au sport. Voici ce que les e-commer&#231;ants ont en r&#233;serve en termes de bonnes affaires.
</description>
    </item>
    <item>
      <title>La Fnac et Darty retirent 800 &#8364; &#224; ce puissant laptop gaming Acer de 18 pouces (RTX 5070, Ultra 9 et 240 Hz)</title>
      <link>https://www.frandroid.com/bons-plans/2856601_la-fnac-et-darty-retirent-800-e-a-ce-puissant-laptop-gaming-acer-de-18-pouces-rtx-5070-ultra-9-et-240-hz</link>
      <pubDate>Thu, 06 Nov 2025 08:53:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2856601_la-fnac-et-darty-retirent-800-e-a-ce-puissant-laptop-gaming-acer-de-18-pouces-rtx-5070-ultra-9-et-240-hz</guid>
      <description>
V&#233;ritable bijou de technologie pour les gamers, l'Acer Predator Neo 18" AI conna&#238;t une belle baisse de prix sur Darty passant de 2 699,99 euros &#224; 1 899,99 euros.
</description>
    </item>
    <item>
      <title>Windows 10/11&#160;: un nouveau bug paralyse des milliers de PC. Que faire ?</title>
      <link>https://www.frandroid.com/marques/microsoft/2857221_windows-10-11-un-nouveau-bug-paralyse-des-milliers-de-pc-que-faire</link>
      <pubDate>Thu, 06 Nov 2025 08:52:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2857221_windows-10-11-un-nouveau-bug-paralyse-des-milliers-de-pc-que-faire</guid>
      <description>
Via une mise &#224; jour un peu trop rapidement d&#233;ploy&#233;e, Microsoft a r&#233;ussi &#224; bloquer des tonnes de machines en les faisant d&#233;marrer directement sur l&#8217;&#233;cran de r&#233;cup&#233;ration de Bitlocker. Si c&#8217;est votre cas, il existe cependant une solution.
</description>
    </item>
    <item>
      <title>I tested the EcoFlow Rapid Pro X and found it to be a high-capacity, fast-charging power bank that oozes quality while being user-friendly</title>
      <link>https://www.techradar.com/pro/ecoflow-rapid-pro-x-review</link>
      <pubDate>Thu, 06 Nov 2025 08:47:09 +0000</pubDate>
      <guid isPermaLink="false">jvccmj34Ty2nBgrZmhayEA</guid>
      <description>EcoFlow&#8217;s new power bank provides an alternative power source for up to three portable devices.</description>
    </item>
    <item>
      <title>Bonne nouvelle &#224; venir en 2026 pour les voitures (&#233;lectriques) en Europe ? Ces chiffres rassurent</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2856579_bonne-nouvelle-a-venir-en-2026-pour-les-voitures-electriques-en-europe-ces-chiffres-rassurent</link>
      <pubDate>Thu, 06 Nov 2025 08:46:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2856579_bonne-nouvelle-a-venir-en-2026-pour-les-voitures-electriques-en-europe-ces-chiffres-rassurent</guid>
      <description>
Apr&#232;s avoir encaiss&#233; les coups en 2025, les constructeurs automobiles europ&#233;ens misent sur un rebond en 2026. Plans de restructuration, subventions pour les voitures &#233;lectriques et r&#233;duction des co&#251;ts : les analystes rehaussent leurs pr&#233;visions. Mais cette reprise annonc&#233;e repose sur des fondamentaux encore fragiles.
</description>
    </item>
    <item>
      <title>Le v&#233;lo &#233;lectrique VanMoof S3 fait son retour, mais pas comme vous le pensez</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2856863_le-velo-electrique-vanmoof-s3-fait-son-retour-mais-pas-comme-vous-le-pensez</link>
      <pubDate>Thu, 06 Nov 2025 08:40:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2856863_le-velo-electrique-vanmoof-s3-fait-son-retour-mais-pas-comme-vous-le-pensez</guid>
      <description>
Une s&#233;rie limit&#233;e de 100 anciens v&#233;los &#233;lectriques VanMoof S3 revient &#224; la vente, mais sans assistance &#233;lectrique sous le nom d&#8217;Analog gr&#226;ce &#224; la marque Roetz, &#224; un prix tr&#232;s attractif.
</description>
    </item>
    <item>
      <title>5 failles d&#233;couvertes dans Chrome&#160;: Google d&#233;ploie une mise &#224; jour de toute urgence</title>
      <link>https://www.01net.com/actualites/5-failles-decouvertes-chrome-google-deploie-mise-jour-toute-urgence.html</link>
      <pubDate>Thu, 06 Nov 2025 08:29:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305579</guid>
      <description>Google publie en urgence une mise &#224; jour de Chrome. Celle-ci doit corriger cinq failles de s&#233;curit&#233; majeures d&#233;couvertes dans le code du navigateur. Ces vuln&#233;rabilit&#233;s, dont trois sont jug&#233;es critiques, permettent &#224; des pirates de prendre le contr&#244;le d&#8217;un ordinateur simplement en incitant la victime &#224; visiter un site pi&#233;g&#233;.</description>
    </item>
    <item>
      <title>M&#234;me Microsoft trouve le menu clic droit de Windows est bord&#233;lique</title>
      <link>https://www.frandroid.com/marques/microsoft/2857185_meme-microsoft-trouve-le-menu-clic-droit-de-windows-est-bordelique</link>
      <pubDate>Thu, 06 Nov 2025 08:19:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2857185_meme-microsoft-trouve-le-menu-clic-droit-de-windows-est-bordelique</guid>
      <description>
Le menu contextuel de Windows 11 va &#234;tre retravaill&#233; dans une future mise &#224; jour pour &#234;tre bien moins encombr&#233;.
</description>
    </item>
    <item>
      <title>Cette bonne trottinette &#233;lectrique endurante sur 45 km perd 100 &#8364; de son prix pour le pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2856289_cette-bonne-trottinette-electrique-endurante-sur-45-km-perd-100-e-de-son-prix-pour-le-pre-black-friday</link>
      <pubDate>Thu, 06 Nov 2025 08:05:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2856289_cette-bonne-trottinette-electrique-endurante-sur-45-km-perd-100-e-de-son-prix-pour-le-pre-black-friday</guid>
      <description>
Une vadrouilleuse du bitume propuls&#233;e avec un moteur &#224; 710 W, la Pure Electric Air5 profite du Pr&#233; Black Friday pour faire sa maligne : 100 euros de moins chez Darty et sur le Fnac.
</description>
    </item>
    <item>
      <title>L&#8217;ancienne architecture domotique d&#8217;Apple a droit &#224; un dernier tour de piste</title>
      <link>https://www.01net.com/actualites/lancienne-architecture-domotique-dapple-a-droit-a-un-dernier-tour-de-piste.html</link>
      <pubDate>Thu, 06 Nov 2025 08:00:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305551</guid>
      <description>Les utilisateurs de HomeKit r&#233;ticents &#224; passer au nouveau syst&#232;me domotique d&#8217;Apple peuvent souffler un peu : la firme &#224; la pomme leur accorde un nouveau d&#233;lai avant l&#8217;abandon de l&#8217;ancienne architecture. La date butoir, initialement pr&#233;vue pour l&#8217;automne 2025, est d&#233;sormais fix&#233;e au 10 f&#233;vrier 2026.</description>
    </item>
    <item>
      <title>Windows 11&#160;: Microsoft va faire le m&#233;nage dans le menu contextuel de l&#8217;Explorateur de fichiers</title>
      <link>https://www.01net.com/actualites/windows-11-microsoft-va-faire-le-menage-dans-le-menu-contextuel-de-lexplorateur-de-fichiers.html</link>
      <pubDate>Thu, 06 Nov 2025 07:41:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305599</guid>
      <description>Les ing&#233;nieurs de Microsoft vont modifier le fonctionnement du menu contextuel du clic droit, dans l'Explorateur de fichiers de Windows 11. Ils planchent sur une version dynamique qui n&#8217;affichera que des &#233;l&#233;ments pertinents en fonction de la s&#233;lection de l'utilisateur.</description>
    </item>
  </channel>
</rss>
