<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 10 Jan 2026 08:32:18 GMT</lastBuildDate>
    <item>
      <title>Oppo confirme avoir plusieurs smartphones pliables en trois : voici pourquoi ils restent secrets</title>
      <link>https://www.frandroid.com/marques/oppo/2938247_oppo-confirme-avoir-plusieurs-smartphones-pliables-en-trois-voici-pourquoi-ils-restent-secrets</link>
      <pubDate>Sat, 10 Jan 2026 08:23:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/oppo/2938247_oppo-confirme-avoir-plusieurs-smartphones-pliables-en-trois-voici-pourquoi-ils-restent-secrets</guid>
      <description>
Alors que la concurrence commence &#224; s'agiter sur le segment des smartphones pliables en trois, Oppo a officiellement confirm&#233; poss&#233;der ses propres prototypes fonctionnels de smartphones pliables en trois. Pourtant, le constructeur chinois a pris la d&#233;cision de ne pas les lancer sur le march&#233;.
</description>
    </item>
    <item>
      <title>Mieux que l&#8217;original ? Narwal s&#8217;inspire fortement de Dyson pour r&#233;volutionner l&#8217;aspirateur balai</title>
      <link>https://www.frandroid.com/marques/narwal/2935479_mieux-que-loriginal-narwal-sinspire-fortement-de-dyson-pour-revolutionner-laspirateur-balai</link>
      <pubDate>Sat, 10 Jan 2026 08:14:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/narwal/2935479_mieux-que-loriginal-narwal-sinspire-fortement-de-dyson-pour-revolutionner-laspirateur-balai</guid>
      <description>
Narwal n&#8217;est plus seulement un challenger du monde des robots aspirateurs. La marque, devenue l&#8217;un des cinq plus grands constructeurs mondiaux, muscle sa gamme avec des aspirateurs balais ultra l&#233;gers, dont un prototype con&#231;u pour concurrencer directement le Dyson PencilVac.
</description>
    </item>
    <item>
      <title>Les 10 innovations les plus bluffantes du CES 2026</title>
      <link>https://www.01net.com/actualites/les-10-innovations-les-plus-bluffantes-du-ces-2026.html</link>
      <pubDate>Sat, 10 Jan 2026 07:34:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318952</guid>
      <description>Le salon de Las Vegas a encore r&#233;serv&#233; quelques belles surprises &#224; ses visiteurs. Voici les 10 nouveaut&#233;s les plus int&#233;ressantes du CES, notre premier bilan du salon.</description>
    </item>
    <item>
      <title>I tested the Vari CoreChair and it's one of my favorites for active sitting and focused tasks, but it's not for every professional</title>
      <link>https://www.techradar.com/pro/vari-corechair-office-chair-review</link>
      <pubDate>Sat, 10 Jan 2026 07:15:00 +0000</pubDate>
      <guid isPermaLink="false">UPcxBx8tgKNKoGhKmAQJQH</guid>
      <description>The Vari CoreChair is an intentionally hyper-mobile task chair focusing on engaging your core while sitting to keep you focused and productive throughout your workday.</description>
    </item>
    <item>
      <title>What to do when your boss is blocking your promotion</title>
      <link>https://www.fastcompany.com/91470056/what-to-do-when-your-boss-is-blocking-your-promotion</link>
      <pubDate>2026-01-10T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91470056/what-to-do-when-your-boss-is-blocking-your-promotion</guid>
      <description>If your boss controls your future, it&#8217;s time to change the game. 6 strategies to move forward when promotions stall.
You&#8217;ve put in the hours, delivered results, and earned the respect of your peers. But when it comes to moving up, the biggest obstacle isn&#8217;t performance or policy&#8212;it&#8217;s your boss.</description>
    </item>
    <item>
      <title>5G offerte et -50 % pendant six mois sur les forfaits mobiles : cet op&#233;rateur c&#233;l&#232;bre la nouvelle ann&#233;e en grande pompe [Sponso]</title>
      <link>https://www.frandroid.com/telecom/forfait-mobile/2933643_5g-offerte-et-50-pendant-six-mois-sur-les-forfaits-mobiles-cet-operateur-celebre-la-nouvelle-annee-en-grande-pompe</link>
      <pubDate>Sat, 10 Jan 2026 06:47:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/forfait-mobile/2933643_5g-offerte-et-50-pendant-six-mois-sur-les-forfaits-mobiles-cet-operateur-celebre-la-nouvelle-annee-en-grande-pompe</guid>
      <description>
Et si la bonne r&#233;solution de 2026 &#233;tait d&#8217;arr&#234;ter de payer son forfait mobile trop cher ? C&#8217;est ce que semble sugg&#233;rer La Poste Mobile avec son offre de rentr&#233;e qui permet d&#8217;&#233;conomiser 50 % sur le prix de ses abonnements mensuels pendant six mois.
</description>
    </item>
  </channel>
</rss>
