<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 07 Feb 2026 11:26:18 GMT</lastBuildDate>
    <item>
      <title>Gear News of the Week: Google's Pixel 10a Arrives Soon, and Valve Delays Its Steam Hardware</title>
      <link>https://www.wired.com/story/gear-news-of-the-week-googles-pixel-10a-arrives-soon-and-valve-delays-its-steam-hardware/</link>
      <pubDate>Sat, 07 Feb 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">6984e3f274b2174a2a669195</guid>
      <description>Plus: Dexcom updates its app, Fitbit founders create a new family caregiving app, and Blink has a new outdoor security camera.</description>
    </item>
    <item>
      <title>Speed Skating at Winter Olympics 2026 Free Streams: TV Channels, Schedule &amp; Preview</title>
      <link>https://www.techradar.com/how-to-watch/sport/speed-skating-at-winter-olympics-2026-free-streams-milano-cortina</link>
      <pubDate>Sat, 07 Feb 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">bPnbGKmctuH4bDS48TWLAJ</guid>
      <description>All the ways to watch Winter Olympics Speed Skating 2026 live streams for FREE, with all the drama and elegance you'd expect with the sport.</description>
    </item>
    <item>
      <title>I've owned OLED TVs for a decade &#8212; but the new RGB mini-LED sets have me itching to switch sides</title>
      <link>https://www.techradar.com/televisions/ive-owned-oled-tvs-for-a-decade-but-the-new-rgb-mini-led-sets-have-me-itching-to-switch-sides</link>
      <pubDate>Sat, 07 Feb 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">aVKGLz684jmyGHFdzsvncV</guid>
      <description>No one loves OLED TVs more than I do, but even this self-emissive zealot is at a tipping point.</description>
    </item>
    <item>
      <title>Windows 11 est en crise : voici les 6 am&#233;liorations qu&#8217;on aimerait voir arriver en 2026</title>
      <link>https://www.frandroid.com/marques/microsoft/2963615_windows-11-est-en-crise-voici-les-6-ameliorations-quon-aimerait-voir-arriver-en-2026</link>
      <pubDate>Sat, 07 Feb 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2963615_windows-11-est-en-crise-voici-les-6-ameliorations-quon-aimerait-voir-arriver-en-2026</guid>
      <description>
Windows 11 vit sa pire p&#233;riode depuis ses d&#233;buts. Entre bugs en rafales, mises &#224; jour d&#233;faillantes, performances en berne et int&#233;grations de Copilot critiqu&#233;es, l'OS de Microsoft est attaqu&#233; de toute part. Voici ce qu'on aimerait voir dans Windows 11 en 2026.
</description>
    </item>
    <item>
      <title>Ryzen AI 400 et dalles OLED : Lenovo a mis le paquet pour ses nouveaux PC de 2026 [Sponso]</title>
      <link>https://www.frandroid.com/marques/2969771_ryzen-ai-400-et-dalles-oled-lenovo-a-mis-le-paquet-pour-ses-nouveaux-pc-de-2026</link>
      <pubDate>Sat, 07 Feb 2026 10:50:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2969771_ryzen-ai-400-et-dalles-oled-lenovo-a-mis-le-paquet-pour-ses-nouveaux-pc-de-2026</guid>
      <description>
Contre vents et mar&#233;es, Lenovo parvient &#224; maintenir des prix tr&#232;s abordables pour ses nouvelles gammes de PC portables les plus populaires. Et sans entraver les performances !
</description>
    </item>
    <item>
      <title>Insta360 Ace Pro 2 Xplorer Grip Pro Kit Review: An Even Better Action Camera</title>
      <link>https://www.wired.com/review/insta360-ace-pro-2-xplorer-grip-pro-kit/</link>
      <pubDate>Sat, 07 Feb 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">6981ef175d028c72b58c784b</guid>
      <description>Want to turn your action camera into a point-and-shoot? Insta360&#8217;s new accessory makes the Ace Pro 2 into a great pocket camera alternative.</description>
    </item>
    <item>
      <title>Ce v&#233;lo &#233;lectrique urbain Decathlon ne perd pas les p&#233;dales avec cette r&#233;duction de 300 &#8364; et un moteur central silencieux</title>
      <link>https://www.frandroid.com/bons-plans/2967773_ce-velo-electrique-urbain-decathlon-ne-perd-pas-les-pedales-avec-cette-reduction-de-300-e-et-un-moteur-central-silencieux</link>
      <pubDate>Sat, 07 Feb 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2967773_ce-velo-electrique-urbain-decathlon-ne-perd-pas-les-pedales-avec-cette-reduction-de-300-e-et-un-moteur-central-silencieux</guid>
      <description>
Ce mod&#232;le de v&#233;lo &#233;lectrique Elops 920 E Connect HF est un v&#233;lo &#233;lectrique haut de gamme sign&#233; Decathlon con&#231;u pour les trajets quotidiens, &#224; retrouver pour 1 599 euros au lieu de 1 899,99 euros sur le site marchand.
</description>
    </item>
    <item>
      <title>Italy vs Scotland Free Streams: How to watch Six Nations 2026 online from anywhere, TV Channels, Preview</title>
      <link>https://www.techradar.com/how-to-watch/rugby/italy-vs-scotland-six-nations-2026-free</link>
      <pubDate>Sat, 07 Feb 2026 10:10:00 +0000</pubDate>
      <guid isPermaLink="false">b6vVxT7NcY3CJicN4Q3Q88</guid>
      <description>All the ways to watch Italy vs Scotland live streams online &#8211; including for FREE &#8211; as Rome hosts a crucial 2026 Six Nations fixture.</description>
    </item>
    <item>
      <title>7 Steps to Better Financial Health You Can Take Right Now</title>
      <link>https://www.wired.com/story/your-annual-personal-finance-checklist/</link>
      <pubDate>Sat, 07 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">69852e00bd7d9782a84c5a3b</guid>
      <description>The beginning of the year is a great time to take a hard look at your expenses and savings. Take these concrete steps to fix up your finances in about a day.</description>
    </item>
    <item>
      <title>Snowboarding at Winter Olympics 2026 Free Streams: TV Channels, Medal Events &amp; Preview</title>
      <link>https://www.techradar.com/how-to-watch/sport/snowboarding-at-winter-olympics-2026-free-streams-milano-cortina</link>
      <pubDate>Sat, 07 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">nvrU27oDGrhPiTjEE5RkCJ</guid>
      <description>All the ways to watch Winter Olympics snowboarding 2026 live streams for FREE, with 11 events across five disciplines taking place in Livigno.</description>
    </item>
    <item>
      <title>ICYMI: the week's 7 biggest tech stories from Alexa+ leaving early access to the Fitbit founders' a new health tracking platform</title>
      <link>https://www.techradar.com/tech/icymi-the-weeks-7-biggest-tech-stories-from-alexa-leaving-early-access-to-the-fitbit-founders-a-new-health-tracking-platform</link>
      <pubDate>Sat, 07 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">KKrybyfdRLbYT2mvKnxHJX</guid>
      <description>The week's biggets tech news stories from Amazon, Bethesda, Space X, Disney and more for February 7, 2026.</description>
    </item>
    <item>
      <title>Those unsolicited credit card offers in your mailbox leave you vulnerable. Here&#8217;s how to get them to stop</title>
      <link>https://www.fastcompany.com/91484988/unsolicited-credit-card-offers-mail-mailbox-vulnerable-how-to-stop-privacy-security-risk</link>
      <pubDate>2026-02-07T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91484988/unsolicited-credit-card-offers-mail-mailbox-vulnerable-how-to-stop-privacy-security-risk</guid>
      <description>For one thing, do not just chuck those envelopes.
We&#8217;ve all opened our mailboxes to discover an unsolicited credit card offer (or three) inside. Although there must be people out there who take advantage of these offers, most of us simply throw the unopened envelopes in the trash. Yet simply tossing these pieces of snail mail can leave you and your finances vulnerable. Here&#8217;s why, and how you can get those unsolicited offers to stop for good....</description>
    </item>
    <item>
      <title>Quand des d&#233;bris spatiaux s&#8217;&#233;crasent sur Terre, voici comment les scientifiques peuvent d&#233;sormais les rep&#233;rer</title>
      <link>https://www.futura-sciences.com/sciences/actualites/debris-spatiaux-debris-spatiaux-ecrasent-terre-voici-scientifiques-peuvent-desormais-reperer-130474/#xtor%3DRSS-8</link>
      <pubDate>Sat, 07 Feb 2026 10:59:11 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/debris-spatiaux-debris-spatiaux-ecrasent-terre-voici-scientifiques-peuvent-desormais-reperer-130474/#xtor%3DRSS-8</guid>
      <description>Les d&#233;bris spatiaux peuvent poser un v&#233;ritable risque lorsqu'ils retombent dans l'atmosph&#232;re&#160;et qu'ils peuvent heurter la Terre. Des chercheurs ont test&#233; une nouvelle m&#233;thode pour les suivre en temps r&#233;el, et elle implique des d&#233;tecteurs de s&#233;ismes qui pourraient capter les ondes provoqu&#233;es par...</description>
    </item>
    <item>
      <title>Siri plus tout seul &#224; bord de CarPlay&#160;? On pourrait bient&#244;t discuter avec ChatGPT ou Gemini</title>
      <link>https://www.01net.com/actualites/siri-plus-tout-seul-a-bord-de-carplay-on-pourrait-bientot-discuter-avec-chatgpt-ou-gemini.html</link>
      <pubDate>Sat, 07 Feb 2026 09:29:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324709</guid>
      <description>Dans quelques mois, les automobilistes devraient pouvoir discuter avec ChatGPT ou Gemini directement depuis CarPlay sans avoir &#224; bidouiller. Apple aurait en effet l'intention de faire une place aux assistants IA, &#224; c&#244;t&#233; de Siri.</description>
    </item>
  </channel>
</rss>
