<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 22 Jan 2026 10:33:50 GMT</lastBuildDate>
    <item>
      <title>Prime Video unveils first look at Grand Regent Thragg and Universa in new images for Invincible season 4 &#8212; but where are its release date and trailer, William?</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/prime-video-unveils-first-look-at-grand-regent-thragg-and-universa-in-new-images-for-invincible-season-4-but-where-are-its-release-date-and-trailer-william</link>
      <pubDate>Thu, 22 Jan 2026 10:31:54 +0000</pubDate>
      <guid isPermaLink="false">esLyxMWNKLHdedWXxMsTbc</guid>
      <description>The first images for Invincible season 4 have revealed the new villains we'll meet in the Amazon TV Original.</description>
    </item>
    <item>
      <title>'Pin-sharp 4K footage' &#8211; the 3 best security cameras to protect your home, recommended by a smart home tech editor</title>
      <link>https://www.techradar.com/home/home-security/pin-sharp-4k-footage-the-3-best-security-cameras-to-protect-your-home-recommended-by-a-smart-home-tech-editor</link>
      <pubDate>Thu, 22 Jan 2026 10:19:53 +0000</pubDate>
      <guid isPermaLink="false">XDUR2hYh48vsN9efGzkm9a</guid>
      <description>Monitor your property with pin-sharp footage, great battery life, and even AI-powered facial recognition.</description>
    </item>
    <item>
      <title>Roborock has launched a new flagship robovac, and that's your cue to go and buy the old version for a massively reduced price</title>
      <link>https://www.techradar.com/home/vacuums/roborock-has-launched-a-new-flagship-robovac-and-thats-your-cue-to-go-and-buy-the-old-version-for-a-massively-reduced-price</link>
      <pubDate>Thu, 22 Jan 2026 10:18:24 +0000</pubDate>
      <guid isPermaLink="false">XmbiKtu6nwGaM6cgeRB8pn</guid>
      <description>I've tested dozens of robot vacuums, but this is the one that has a permanent spot in my home &#8211; and it's never let me down.</description>
    </item>
    <item>
      <title>Darty solde &#224; -44 % ce puissant laptop Asus avec &#233;cran Oled et pesant moins de 1 kilo</title>
      <link>https://www.frandroid.com/bons-plans/2814585_darty-solde-a-44-ce-puissant-laptop-asus-avec-ecran-oled-et-pesant-moins-de-1-kilo</link>
      <pubDate>Thu, 22 Jan 2026 10:17:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2814585_darty-solde-a-44-ce-puissant-laptop-asus-avec-ecran-oled-et-pesant-moins-de-1-kilo</guid>
      <description>
Le Zenbook UX3407 avec sa configuration ARM est en promotion chez Darty pour les soldes d'hiver. Une ristourne int&#233;ressante qui permet d'avoir ce tr&#232;s bon laptop &#224; presque moiti&#233; prix.
</description>
    </item>
    <item>
      <title>7500 mAh dans un petit smartphone, l&#8217;ultime exploit technique de OnePlus avant de dispara&#238;tre ?</title>
      <link>https://www.frandroid.com/marques/oneplus/2951657_7500-mah-dans-un-petit-smartphone-lultime-exploit-technique-de-oneplus-avant-de-disparaitre</link>
      <pubDate>Thu, 22 Jan 2026 10:16:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/oneplus/2951657_7500-mah-dans-un-petit-smartphone-lultime-exploit-technique-de-oneplus-avant-de-disparaitre</guid>
      <description>
Alors que les rumeurs sur une possible disparition de la marque s'intensifient, le OnePlus 15T fait parler de lui. Le futur appareil embarquerait une batterie gargantuesque, tentant une derni&#232;re fois de s&#233;duire les utilisateurs avant un potentiel d&#233;mant&#232;lement.
</description>
    </item>
    <item>
      <title>Fnac et Darty multiplient les deals pour la 3e d&#233;marque des soldes : les 18 meilleures offres &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-multiplient-les-deals-pour-la-3e-demarque-des-soldes-les-18-meilleures-offres-a-retenir</link>
      <pubDate>Thu, 22 Jan 2026 10:08:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-multiplient-les-deals-pour-la-3e-demarque-des-soldes-les-18-meilleures-offres-a-retenir</guid>
      <description>
La 3&#7497; d&#233;marque des soldes d'hiver est lanc&#233;e ! &#192; cette occasion, la Fnac et Darty ouvrent une nouvelle vague de promotions sur les produits Tech. Smartphones, tablettes, ordinateurs&#8230; les bonnes affaires se multiplient, avec notamment le r&#233;cent Galaxy&#8201;Z&#8201;Flip&#8201;7 affich&#233; &#224; prix cass&#233;.
</description>
    </item>
    <item>
      <title>Votre smartphone Xiaomi est devenu lent&#160;? D&#233;sinstallez ces 6 apps Android truff&#233;es de virus</title>
      <link>https://www.01net.com/actualites/votre-smartphone-xiaomi-est-devenu-lent-desinstallez-ces-6-apps-android-truffees-de-virus.html</link>
      <pubDate>Thu, 22 Jan 2026 10:03:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321779</guid>
      <description>Un nouveau malware s&#8217;invite dans des applications Android distribu&#233;es sur la boutique de Xiaomi. Truff&#233;es de malwares, ces six apps transforment votre smartphone en machine &#224; cliquer sur des pubs gr&#226;ce &#224; l&#8217;IA. Tandis que les pirates empochent les revenus publicitaires, votre smartphone va se mettre &#224; ramer et &#224; chauffer...</description>
    </item>
    <item>
      <title>The best fitness trackers for 2026</title>
      <link>https://www.engadget.com/wearables/best-fitness-trackers-133053484.html?src=rss</link>
      <pubDate>Thu, 22 Jan 2026 10:00:35 +0000</pubDate>
      <guid isPermaLink="false">4ad1be40-0a29-3f30-89c3-c8f1a9034ccf</guid>
      <description>If you're looking to get fit, sleep better or just keep a closer eye on your health, a fitness wearable is a great place to start. Whether you're into intense workouts or just want to hit your step goal each day, the best fitness trackers available today can offer loads of helpful features, from sleep tracking and resting heart rate monitoring to built-in GPS and stress tracking. Some are even subtle enough to wear 24/7, like smart rings, while others double as stylish smartwatches.There are great options out there for beginners as well as more advanced users, and the variety of features means...</description>
    </item>
    <item>
      <title>&#171; Reprogrammation de votre colis &#187; : Attention &#224; cette arnaque qui peut vous viser et c&#8217;est la faute de Free</title>
      <link>https://www.frandroid.com/culture-tech/securite-applications/2951665_reprogrammation-de-votre-colis-attention-a-cette-arnaque-qui-peut-vous-viser-et-cest-la-faute-de-free</link>
      <pubDate>Thu, 22 Jan 2026 10:00:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/securite-applications/2951665_reprogrammation-de-votre-colis-attention-a-cette-arnaque-qui-peut-vous-viser-et-cest-la-faute-de-free</guid>
      <description>
Une campagne d'hame&#231;onnage se faisant passer pour Mondial Relay cible les victimes du piratage de Free de 2024.
</description>
    </item>
    <item>
      <title>Tesla : cette assurance in&#233;dite divise son prix par 2 en cas de FSD activ&#233;, mais &#224; une lourde condition</title>
      <link>https://www.frandroid.com/marques/tesla/2951503_tesla-cette-assurance-inedite-divise-son-prix-par-2-en-cas-de-fsd-active-mais-a-une-lourde-condition</link>
      <pubDate>Thu, 22 Jan 2026 09:59:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2951503_tesla-cette-assurance-inedite-divise-son-prix-par-2-en-cas-de-fsd-active-mais-a-une-lourde-condition</guid>
      <description>
La compagnie d&#8217;assurance am&#233;ricaine Lemonade propose une offre in&#233;dite pour les conducteurs de Tesla dot&#233;s de la conduite autonome FSD. Elle leur offre une remise de 50&#160;%, jugeant que cette technologie permet de r&#233;duire les accidents.
</description>
    </item>
    <item>
      <title>Windows 11 : Paint se transforme en cahier de coloriage infini gr&#226;ce &#224; cette mise &#224; jour</title>
      <link>https://www.frandroid.com/marques/microsoft/2951629_windows-11-paint-se-transforme-en-cahier-de-coloriage-infini-grace-a-cette-mise-a-jour</link>
      <pubDate>Thu, 22 Jan 2026 09:51:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2951629_windows-11-paint-se-transforme-en-cahier-de-coloriage-infini-grace-a-cette-mise-a-jour</guid>
      <description>
Microsoft d&#233;voile plusieurs nouveaut&#233;s pour le Bloc-notes et Paint, avec notamment la possibilit&#233; de cr&#233;er de vrais cahiers de coloriage gr&#226;ce &#224; l'IA.
</description>
    </item>
    <item>
      <title>Windows 11&#160;: Paint pourra bient&#244;t g&#233;n&#233;rer des coloriages pour vos enfants</title>
      <link>https://www.01net.com/actualites/windows-11-paint-pourra-bientot-generer-des-coloriages-pour-vos-enfants.html</link>
      <pubDate>Thu, 22 Jan 2026 09:48:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321834</guid>
      <description>Microsoft a d&#233;ploy&#233; plusieurs nouveaut&#233;s pour le Bloc-Notes et Paint aupr&#232;s des Insiders. Le Bloc-Notes va afficher un nouvel &#233;cran d&#8217;accueil tandis que Paint va pouvoir g&#233;n&#233;rer des coloriages gr&#226;ce &#224; l&#8217;IA.</description>
    </item>
    <item>
      <title>Bouygues Telecom d&#233;voile son nouveau d&#233;codeur&#160;b.tv&#160;&#171;&#160;boost&#233; &#224; l&#8217;IA&#160;&#187;, et il y a d&#233;j&#224; quelque chose qui cloche</title>
      <link>https://www.frandroid.com/marques/bouygues-telecom/2951483_bouygues-telecom-devoile-son-nouveau-decodeur-b-tv-booste-a-lia-et-il-y-a-deja-quelque-chose-qui-cloche</link>
      <pubDate>Thu, 22 Jan 2026 09:35:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bouygues-telecom/2951483_bouygues-telecom-devoile-son-nouveau-decodeur-b-tv-booste-a-lia-et-il-y-a-deja-quelque-chose-qui-cloche</guid>
      <description>
En m&#234;me temps que trois nouvelles Bbox ainsi qu'une cl&#233; TV, Bouygues Telecom a pr&#233;sent&#233; lors de sa conf&#233;rence de presse du 20 janvier un tout nouveau d&#233;codeur TV. Le d&#233;codeur b.tv est le premier d&#233;codeur TV d'un FAI fran&#231;ais &#224; &#234;tre boost&#233; &#224; l'IA pour le upscaling, un argument qui peine &#224; convaincre aujourd'hui.
</description>
    </item>
    <item>
      <title>Pirater la derni&#232;re nouveaut&#233; de ChatGPT est un vrai jeu d&#8217;enfant</title>
      <link>https://www.01net.com/actualites/pirater-derniere-nouveaute-chatgpt-vrai-jeu-enfant.html</link>
      <pubDate>Thu, 22 Jan 2026 09:32:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321760</guid>
      <description>&#171; Traduire avec ChatGPT &#187;, l'alternative &#224; Google Traduction d'OpenAI, vient de se faire pirater par des chercheurs. Ils ont r&#233;ussi &#224; prouver que l'IA oublie facilement ses restrictions dans le cadre d'une injection par injection de requ&#234;te. ChatGPT ne voit alors aucun probl&#232;me &#224; fournir la recette d'un cocktail Molotov.</description>
    </item>
    <item>
      <title>Why your solo business needs an operational backbone</title>
      <link>https://www.fastcompany.com/91474956/why-your-solo-business-needs-an-operational-backbone</link>
      <pubDate>2026-01-22T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91474956/why-your-solo-business-needs-an-operational-backbone</guid>
      <description>3 systems to keep your business running smoothly.
It&#8217;s Friday afternoon, and a potential client just emailed, asking about your services. You scramble to find your pricing. (Where did you save that document?) You dig through old emails for a proposal you sent six months ago that you could adapt. You piece something together and curse your past self for not being more organized.&#160;...</description>
    </item>
    <item>
      <title>Amazon profite de la 3e d&#233;marque des soldes pour d&#233;stocker &#224; petit prix de nombreux produits Tech : le TOP 15 des offres</title>
      <link>https://www.frandroid.com/bons-plans/2933045_amazon-profite-de-la-3e-demarque-des-soldes-pour-destocker-a-petit-prix-de-nombreux-produits-tech</link>
      <pubDate>Thu, 22 Jan 2026 09:28:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933045_amazon-profite-de-la-3e-demarque-des-soldes-pour-destocker-a-petit-prix-de-nombreux-produits-tech</guid>
      <description>
Le top d&#233;part de la 3&#7497; d&#233;marque est lanc&#233; ! Les soldes d&#8217;hiver se poursuivent avec des offres toujours aussi attractives chez Amazon, accessibles &#224; tous, m&#234;me sans abonnement Prime. Mieux encore, certains produits Tech r&#233;cents voient leurs prix chuter &#224; cette occasion &#8212; &#224; l&#8217;image du tout nouveau OnePlus&#8201;15, d&#233;j&#224; affich&#233; &#224; prix r&#233;duit.
</description>
    </item>
    <item>
      <title>What is the best Shark robot vacuum? Here are my top 3 picks after testing at home.</title>
      <link>https://mashable.com/roundup/best-shark-robot-vacuums-2026</link>
      <pubDate>Thu, 22 Jan 2026 09:26:12 +0000</pubDate>
      <guid isPermaLink="false">06RmwEFUoy1ULM2jQ954wxR</guid>
      <description>Should you get a Shark instead of a Roomba? After testing 30+ robot vacuums at home, these are the best options from Shark.</description>
    </item>
    <item>
      <title>Samsung d&#233;voile par erreur l&#8217;une des plus grosses nouveaut&#233;s du Galaxy S26 Ultra</title>
      <link>https://www.01net.com/actualites/samsung-devoile-par-erreur-grosses-nouveautes-galaxy-s26-ultra.html</link>
      <pubDate>Thu, 22 Jan 2026 09:25:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321787</guid>
      <description>En partageant des captures d'&#233;cran de son application Good Lock, Samsung a malencontreusement confirm&#233; une des fonctionnalit&#233;s phares du Galaxy S26 Ultra.</description>
    </item>
    <item>
      <title>This Resident Evil Requiem Switch 2 deal is so good, I'm wondering if it's a mistake &#8211; and you should snap it up right now just in case</title>
      <link>https://www.techradar.com/gaming/this-has-to-be-a-mistake-resident-evil-requiem-on-switch-2-is-less-than-gbp20-to-pre-order-in-the-uk-right-now</link>
      <pubDate>Thu, 22 Jan 2026 09:21:02 +0000</pubDate>
      <guid isPermaLink="false">g8PBDTB3s8RBZkrK3bAWgm</guid>
      <description>This Resident Evil Requeim pre-order deal is so good it looks like a pricing error - order it now for a ridiculously low price.</description>
    </item>
    <item>
      <title>Windows 11 : vos applications ne se lancent plus ? Voici la solution pour corriger l&#8217;erreur 0x803f8001</title>
      <link>https://www.frandroid.com/marques/microsoft/2951557_windows-11-vos-applications-ne-se-lancent-plus-voici-la-solution-pour-corriger-lerreur-0x803f8001</link>
      <pubDate>Thu, 22 Jan 2026 09:16:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2951557_windows-11-vos-applications-ne-se-lancent-plus-voici-la-solution-pour-corriger-lerreur-0x803f8001</guid>
      <description>
Plusieurs applications ne semblent plus fonctionner sur Windows 11 depuis quelques jours. Plusieurs solutions existent cependant.
</description>
    </item>
    <item>
      <title>Klipsch ProMedia Lumina : mettez de la couleur sur votre bureau et profitez d&#8217;un son chaud en 2.1</title>
      <link>https://www.frandroid.com/marques/klipsch/2951213_klipsch-promedia-lumina-mettez-de-la-couleur-sur-votre-bureau-et-profitez-dun-son-chaud-en-2-1</link>
      <pubDate>Thu, 22 Jan 2026 09:15:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/klipsch/2951213_klipsch-promedia-lumina-mettez-de-la-couleur-sur-votre-bureau-et-profitez-dun-son-chaud-en-2-1</guid>
      <description>
Le fabricant am&#233;ricain Klipsch pr&#233;sente ProMedia Lumina, un syst&#232;me 2.1 de bureau avec &#233;clairage LED destin&#233; aux gamers, cr&#233;ateurs de contenus, t&#233;l&#233;travailleurs et m&#233;lomanes, qui veut associer des performances audio haut rendement, une connectivit&#233; moderne et un design soign&#233; avec une pointe d&#8217;&#233;clairage.
</description>
    </item>
    <item>
      <title>Une recharge aussi rapide qu&#8217;une voiture : l&#8217;argument choc de Mercedes pour ses camions &#233;lectriques</title>
      <link>https://www.frandroid.com/marques/mercedes-benz/2951447_une-recharge-aussi-rapide-quune-voiture-largument-choc-de-mercedes-pour-ses-camions-electriques</link>
      <pubDate>Thu, 22 Jan 2026 09:14:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/mercedes-benz/2951447_une-recharge-aussi-rapide-quune-voiture-largument-choc-de-mercedes-pour-ses-camions-electriques</guid>
      <description>
Mercedes va r&#233;aliser un test grandeur nature de sa technologie de recharge ultra-rapide en m&#233;gawatt, capable de recharger l'immense batterie de ses poids lourds aussi rapidement qu'une voiture. Au total, deux camions &#233;lectriques vont parcourir 2 400 kilom&#232;tres entre l&#8217;Allemagne et la Su&#232;de.
</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver : la 3e d&#233;marque d&#233;marre fort, voici les offres qui m&#233;ritent votre argent</title>
      <link>https://www.frandroid.com/bons-plans/2949895_soldes-dhiver-3e-demarque-meilleures-offres-en-direct</link>
      <pubDate>Thu, 22 Jan 2026 09:05:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2949895_soldes-dhiver-3e-demarque-meilleures-offres-en-direct</guid>
      <description>
Cela fait d&#233;j&#224; deux semaines que les soldes d'hiver ont commenc&#233; en France et que les e-commer&#231;ants tels qu'Amazon, Fnac, Darty, Boulanger ou encore Cdiscount partagent des offres. Depuis hier, c'est la 3e d&#233;marque et les promotions se multiplient. 
</description>
    </item>
    <item>
      <title>Linux, Android et Windows&#160;11 sur un seul et m&#234;me smartphone, &#231;a vous dit&#8201;?</title>
      <link>https://www.frandroid.com/android/rom-custom-2/2951515_linux-android-et-windows-11-sur-un-seul-et-meme-smartphone-ca-vous-dit</link>
      <pubDate>Thu, 22 Jan 2026 09:04:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/rom-custom-2/2951515_linux-android-et-windows-11-sur-un-seul-et-meme-smartphone-ca-vous-dit</guid>
      <description>
Et si nos smartphones n&#8217;&#233;taient pas artificiellement brid&#233;s pour ne fonctionner qu&#8217;avec un seul syst&#232;me d&#8217;exploitation&#8201;? Et s&#8217;il &#233;tait possible de go&#251;ter au meilleur des mondes PC et mobiles sur un seul appareil&#8201;? C&#8217;est le monde que tente, maladroitement, de nous faire imaginer le NexPhone.
</description>
    </item>
    <item>
      <title>Hack chez Tesla&#160;: 2 failles ont &#233;t&#233; d&#233;couvertes dans le tableau de bord des voitures &#233;lectriques</title>
      <link>https://www.01net.com/actualites/hack-chez-tesla-2-failles-decouvertes-tableau-bord-voitures-electriques.html</link>
      <pubDate>Thu, 22 Jan 2026 09:01:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321744</guid>
      <description>Des chercheurs fran&#231;ais ont d&#233;couvert deux failles zero day dans le tableau de bord de Tesla. En exploitant ces deux vuln&#233;rabilit&#233;s critiques, ils ont pu prendre le contr&#244;le du syst&#232;me et potentiellement voler des donn&#233;es sensibles.</description>
    </item>
    <item>
      <title>Four questions that will determine the future of business for good</title>
      <link>https://www.fastcompany.com/91477966/four-questions-that-will-determine-the-future-of-business-for-good</link>
      <pubDate>2026-01-22T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91477966/four-questions-that-will-determine-the-future-of-business-for-good</guid>
      <description>How conscious consumer spending is evolving will shape the strategies of mission-driven companies.
In the midst of economic uncertainty, polarizing politics, global conflict and a future that is largely out of focus, many consumers are continuing to fight the good fight when it comes to using their dollars to drive positive change. </description>
    </item>
    <item>
      <title>9 nonfiction books to kick-start 2026</title>
      <link>https://www.fastcompany.com/91478623/9-non-fiction-books-to-kickstart-2026</link>
      <pubDate>2026-01-22T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91478623/9-non-fiction-books-to-kickstart-2026</guid>
      <description>These must-read titles cover a variety of subjects, from how to create a meaningful life to following through on what you start.
Every season, the Next Big Idea Club editorial team reviews dozens of upcoming books to curate a selection of the most exciting, must-read nonfiction titles. We start with a broad pool of nominees from which we identify a small handful of finalists and, ultimately, an official season selection....</description>
    </item>
    <item>
      <title>How to craft a recipe for creative breakthroughs</title>
      <link>https://www.fastcompany.com/91478633/how-to-craft-a-recipe-for-creative-breakthroughs</link>
      <pubDate>2026-01-22T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91478633/how-to-craft-a-recipe-for-creative-breakthroughs</guid>
      <description>Every new experience is like a spice or herb that goes in your pantry and expands the creativity within it.
Below, Melissa Bernstein shares five key insights from her new book, The Heart of Entrepreneurship: Crafting Your Authentic Recipe for Success.</description>
    </item>
    <item>
      <title>La derni&#232;re Pixel Watch de Google est d&#233;j&#224; 130 &#8364; moins ch&#232;re gr&#226;ce &#224; cette offre des soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2893591_la-derniere-pixel-watch-de-google-est-deja-130-euros-moins-chere-grace-a-cette-offre-des-soldes-dhiver</link>
      <pubDate>Thu, 22 Jan 2026 08:58:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2893591_la-derniere-pixel-watch-de-google-est-deja-130-euros-moins-chere-grace-a-cette-offre-des-soldes-dhiver</guid>
      <description>
La r&#233;cente Pixel Watch 4 profite d&#233;j&#224; d&#8217;une belle remise &#224; l&#8217;occasion des soldes d&#8217;hiver&#8239;: 269 euros au lieu de 399&#8239;euros. La montre connect&#233;e de Google atteint son prix le plus bas &#224; ce jour. 
</description>
    </item>
    <item>
      <title>Le Volvo EX60 &#233;lectrique aux 810 km d&#8217;autonomie re&#231;oit d&#233;j&#224; une nouvelle version pour tra&#238;ner dans la boue</title>
      <link>https://www.frandroid.com/marques/volvo/2951377_le-volvo-ex60-electrique-aux-810-km-dautonomie-recoit-deja-une-nouvelle-version-pour-trainer-dans-la-boue</link>
      <pubDate>Thu, 22 Jan 2026 08:50:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volvo/2951377_le-volvo-ex60-electrique-aux-810-km-dautonomie-recoit-deja-une-nouvelle-version-pour-trainer-dans-la-boue</guid>
      <description>
Tout juste d&#233;voil&#233;, le nouveau Volvo EX60 se d&#233;cline &#233;galement en une version Cross Country au look plus baroudeur. Mais sous le capot, la fiche technique de la voiture &#233;lectrique ne change pas.
</description>
    </item>
    <item>
      <title>Rachat SFR&#160;: Orange, Bouygues et Free font une mise au point sur les &#171;&#160;rumeurs&#160;&#187;</title>
      <link>https://www.01net.com/actualites/rachat-sfr-les-discussions-ont-repris-entre-bouygues-iliad-orange-et-altice.html</link>
      <pubDate>Thu, 22 Jan 2026 08:36:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321769</guid>
      <description>Du nouveau dans le dossier du rachat de SFR ? Bouygues Telecom, Orange et Free (groupe Iliad) annoncent ce jeudi 22 janvier avoir repris les n&#233;gociations avec Altice. Les trois soci&#233;t&#233;s pourraient rehausser leur offre de trois milliards d'euros, pour atteindre les 20 milliards.</description>
    </item>
  </channel>
</rss>
