<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 16 Jan 2026 11:24:16 GMT</lastBuildDate>
    <item>
      <title>Redmi Buds 8 Lite : des &#233;couteurs &#224; moins de 30 euros avec r&#233;duction de bruit&#160;!</title>
      <link>https://www.frandroid.com/marques/xiaomi/2945269_redmi-buds-8-lite-des-ecouteurs-a-moins-de-30-euros-avec-reduction-de-bruit</link>
      <pubDate>Fri, 16 Jan 2026 11:23:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2945269_redmi-buds-8-lite-des-ecouteurs-a-moins-de-30-euros-avec-reduction-de-bruit</guid>
      <description>
Qui a dit qu&#8217;il fallait d&#233;penser des sommes folles pour profiter d&#8217;une fonction de r&#233;duction de bruit sur des &#233;couteurs&#160;? En tout cas, Xiaomi semble vouloir r&#233;pondre &#224; cette probl&#233;matique avec les Redmi Buds 8 Lite.
</description>
    </item>
    <item>
      <title>Powering the AI data center boom: the infrastructure upgrades behind innovation</title>
      <link>https://www.techradar.com/pro/powering-the-ai-data-center-boom-the-infrastructure-upgrades-behind-innovation</link>
      <pubDate>Fri, 16 Jan 2026 11:19:56 +0000</pubDate>
      <guid isPermaLink="false">thARjF5fR3fPYesCQZSJSQ</guid>
      <description>AI&#8217;s GPU boom is forcing radical upgrades across power, cooling, connectivity, and delivery models.</description>
    </item>
    <item>
      <title>Heirs to the Empire: can Star Wars' new leadership team save the spluttering sci-fi franchise?</title>
      <link>https://www.techradar.com/streaming/entertainment/heirs-to-the-empire-can-star-wars-new-leadership-team-save-the-spluttering-sci-fi-franchise</link>
      <pubDate>Fri, 16 Jan 2026 11:19:56 +0000</pubDate>
      <guid isPermaLink="false">hasenmEqR84EphwD3s3btU</guid>
      <description>Dave Filoni and Lynwen Brennan are set to replace Kathleen Kennedy as overlords of the Star Wars universe.</description>
    </item>
    <item>
      <title>Xiaomi profite des soldes pour brader ses produits les plus populaires, m&#234;me les plus r&#233;cents</title>
      <link>https://www.frandroid.com/bons-plans/2936033_xiaomi-profite-des-soldes-pour-brader-ses-produits-les-plus-populaires-meme-les-plus-recents</link>
      <pubDate>Fri, 16 Jan 2026 11:15:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2936033_xiaomi-profite-des-soldes-pour-brader-ses-produits-les-plus-populaires-meme-les-plus-recents</guid>
      <description>
Le week-end approche et Xiaomi d&#233;gaine de belles offres pour la deuxi&#232;me d&#233;marque des soldes&#8239;! La marque lance une pluie de bons plans sur l&#8217;ensemble de son catalogue. Parmi les offres les plus all&#233;chantes, le tout nouveau Redmi&#8239;Note&#8239;15&#8239;Pro, d&#233;j&#224; not&#233; 8/10 par notre r&#233;daction, b&#233;n&#233;ficie d&#8217;une belle r&#233;duction &#224; ne pas manquer.
</description>
    </item>
    <item>
      <title>55 000 000 $ : Nothing a imagin&#233; le smartphone le plus cher du monde pour un YouTubeur</title>
      <link>https://www.frandroid.com/actualites-generales/2944951_55-000-000-nothing-a-imagine-le-smartphone-le-plus-cher-du-monde-pour-un-youtubeur</link>
      <pubDate>Fri, 16 Jan 2026 11:14:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2944951_55-000-000-nothing-a-imagine-le-smartphone-le-plus-cher-du-monde-pour-un-youtubeur</guid>
      <description>
Nothing a d&#233;voil&#233; un concept de smartphone ultra-perfectionn&#233;e et modulaire, l'appareil soi-disant r&#234;v&#233; du cr&#233;ateur de contenus IShowSpeed. Entre un &#233;cran trifold, une coque en Kevlar et un co&#251;t de recherche et d&#233;veloppement abyssal, ce concept est grandiloquent.
</description>
    </item>
    <item>
      <title>Xiaomi commercialise ses premi&#232;res lunettes connect&#233;es en France : voici les prix et les fonctions</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/lunettes-intelligentes/2945207_xiaomi-commercialise-ses-premieres-lunettes-connectees-en-france-voici-les-prix-et-les-fonctions</link>
      <pubDate>Fri, 16 Jan 2026 11:12:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/lunettes-intelligentes/2945207_xiaomi-commercialise-ses-premieres-lunettes-connectees-en-france-voici-les-prix-et-les-fonctions</guid>
      <description>
Xiaomi vend des smartphones, des friteuses, des voitures et maintenant&#8230; des lunettes.
</description>
    </item>
    <item>
      <title>Inutile de jouer &#224; ce jeu si vous n&#8217;avez pas de smartphone pliant</title>
      <link>https://www.01net.com/actualites/inutile-jouer-ce-jeu-si-pas-smartphone-pliant.html</link>
      <pubDate>Fri, 16 Jan 2026 11:04:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320603</guid>
      <description>Ce nouveau jeu ind&#233;pendant transforme le fait de plier votre smartphone en m&#233;canique de jeu. Un simulateur d&#8217;origami tr&#232;s malin qui utilise la charni&#232;re de l&#8217;appareil.</description>
    </item>
    <item>
      <title>I've spent all week shopping Best Buy's winter sale - here are 19 deals worth buying, including 50% off TVs, laptops, Apple, and more</title>
      <link>https://www.techradar.com/seasonal-sales/ive-spent-all-week-shopping-best-buys-winter-sale-here-are-19-deals-worth-buying-including-50-percent-off-tvs-laptops-apple-and-more</link>
      <pubDate>Fri, 16 Jan 2026 11:01:13 +0000</pubDate>
      <guid isPermaLink="false">Ss8fq925yd5nKqAenpzfjC</guid>
      <description>Best Buy's winter sale is ending soon, and as TechRadar's deals editor who's been shopping for offers all week, I've hand-picked the 19 best deals worth buying.</description>
    </item>
    <item>
      <title>Deezer transforme l&#8217;&#233;coute de la musique sur Google TV avec une application enti&#232;rement repens&#233;e.</title>
      <link>https://www.frandroid.com/services/streaming-musical/2945149_deezer-transforme-lecoute-de-la-musique-sur-google-tv-avec-une-application-entierement-repensee</link>
      <pubDate>Fri, 16 Jan 2026 11:00:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/streaming-musical/2945149_deezer-transforme-lecoute-de-la-musique-sur-google-tv-avec-une-application-entierement-repensee</guid>
      <description>
Deezer annonce une refonte compl&#232;te de son application Android TV, avec une interface modernis&#233;e, de nouvelles fonctionnalit&#233;s de d&#233;couverte musicale et l&#8217;arriv&#233;e de la qualit&#233; HiFi et des paroles synchronis&#233;es fa&#231;on karaok&#233; sur le grand &#233;cran du salon.
</description>
    </item>
    <item>
      <title>RFK Jr. Says He&#8217;s Ending the War on Protein. It Doesn&#8217;t Exist</title>
      <link>https://www.wired.com/story/rfk-jr-says-hes-ending-the-war-on-protein-it-doesnt-exist/</link>
      <pubDate>Fri, 16 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">696671535b3d008e7671c0c3</guid>
      <description>There is no war on protein. But pretending there is goes hand-in-hand with the Trump administration&#8217;s appeal to traditional masculinity.</description>
    </item>
    <item>
      <title>This chip maker mounted a challenge to Intel's Pentium range - so AMD bought it</title>
      <link>https://www.techradar.com/pro/this-chip-maker-mounted-a-challenge-to-intels-pentium-range-so-amd-bought-it</link>
      <pubDate>Fri, 16 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">EfTPqJTfF5cBqe3ptpHpkG</guid>
      <description>AMD acquired NexGen for a bumper fee in the mid-1990s in a bid to boost its own chip range</description>
    </item>
    <item>
      <title>Voici comment le groupe Stellantis veut am&#233;liorer drastiquement l&#8217;autonomie de ses voitures &#233;lectriques</title>
      <link>https://www.frandroid.com/marques/leapmotor/2944833_voici-comment-le-groupe-stellantis-veut-ameliorer-drastiquement-lautonomie-de-ses-voitures-electriques</link>
      <pubDate>Fri, 16 Jan 2026 10:54:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/leapmotor/2944833_voici-comment-le-groupe-stellantis-veut-ameliorer-drastiquement-lautonomie-de-ses-voitures-electriques</guid>
      <description>
Le groupe Stellantis envisagerait de recourir au prolongateur d&#8217;autonomie d&#233;j&#224; adopt&#233; par Leapmotor. Ce qui permettrait de rendre ses voitures &#233;lectriques encore plus polyvalentes, mais avec un gros inconv&#233;nient.
</description>
    </item>
    <item>
      <title>Google Wallet se rapproche de votre appli bancaire sur Android</title>
      <link>https://www.frandroid.com/marques/google/2944695_google-wallet-se-rapproche-de-votre-appli-bancaire-sur-android</link>
      <pubDate>Fri, 16 Jan 2026 10:47:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2944695_google-wallet-se-rapproche-de-votre-appli-bancaire-sur-android</guid>
      <description>
Une mise &#224; jour de Google Wallet offrirait aux utilisateurs la possibilit&#233; d&#8217;acc&#233;der &#224; un historique complet de vos transactions.
</description>
    </item>
    <item>
      <title>Android : votre smartphone va bient&#244;t cliquer &#224; votre place, voici comment</title>
      <link>https://www.frandroid.com/marques/google/2944721_android-votre-smartphone-va-bientot-cliquer-a-votre-place-voici-comment</link>
      <pubDate>Fri, 16 Jan 2026 10:46:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2944721_android-votre-smartphone-va-bientot-cliquer-a-votre-place-voici-comment</guid>
      <description>
Laisseriez-vous ChatGPT, Gemini ou Claude naviguer sur votre t&#233;l&#233;phone &#224; votre place&#8201;? Google l&#8217;esp&#232;re, puisque l&#8217;entreprise est en train d&#8217;int&#233;grer doucement cette possibilit&#233; sur Android.
</description>
    </item>
    <item>
      <title>Amazon&#160;lance&#160;une myriade d&#8217;offres&#160;durant les soldes : les 18 meilleures offres</title>
      <link>https://www.frandroid.com/bons-plans/2933045_amazon-lance-une-myriade-doffres-durant-les-soldes-les-18-meilleures-offres</link>
      <pubDate>Fri, 16 Jan 2026 10:46:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933045_amazon-lance-une-myriade-doffres-durant-les-soldes-les-18-meilleures-offres</guid>
      <description>
Pendant les soldes d&#8217;hiver, Amazon ne r&#233;serve pas ses bonnes affaires aux seuls membres Prime&#8239;: chacun peut profiter d&#8217;une large s&#233;lection de remises. Pour le week-end de la deuxi&#232;me d&#233;marque, le g&#233;ant am&#233;ricain multiplie les offres et met en avant de nombreuses promotions &#224; saisir sans attendre.
</description>
    </item>
    <item>
      <title>Porsche : les ventes continuent leur chute, mais une voiture &#233;lectrique &#233;vite le pire</title>
      <link>https://www.frandroid.com/marques/porsche/2944749_porsche-les-ventes-continuent-leur-chute-mais-une-voiture-electrique-evite-le-pire</link>
      <pubDate>Fri, 16 Jan 2026 10:45:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/porsche/2944749_porsche-les-ventes-continuent-leur-chute-mais-une-voiture-electrique-evite-le-pire</guid>
      <description>
Les r&#233;sultats de Porsche viennent de tomber, et ils sont en baisse sur quasiment tous les march&#233;s, avec une d&#233;gringolade en Chine. Seul baume au c&#339;ur : si le Taycan continue de s'effondrer, l'arriv&#233;e du Macan permet au constructeur d'atteindre ses objectifs de ventes de voitures &#233;lectriques en 2025. 
</description>
    </item>
    <item>
      <title>&#201;lu meilleur op&#233;rateur, Bouygues Telecom frappe fort avec un forfait mobile &#224; prix cass&#233; [Sponso]</title>
      <link>https://www.frandroid.com/telecom/forfait-mobile/2940649_elu-meilleur-operateur-bouygues-telecom-frappe-fort-avec-un-forfait-mobile-a-prix-casse</link>
      <pubDate>Fri, 16 Jan 2026 10:42:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/forfait-mobile/2940649_elu-meilleur-operateur-bouygues-telecom-frappe-fort-avec-un-forfait-mobile-a-prix-casse</guid>
      <description>
Bouygues Telecom entame l&#8217;ann&#233;e tambour battant avec une offre mobile sans engagement parfaitement calibr&#233;e : excellentes performances, services impeccables et m&#234;me abonnement gratuit &#224; une IA performante sont au programme, pour un prix d&#233;fiant toute concurrence.
</description>
    </item>
    <item>
      <title>Soldes : 200 &#8364; de remise pour ce vid&#233;oprojecteur Full HD 180&#8243; avec Google TV qui transforme votre salon en salle de cin&#233;ma</title>
      <link>https://www.frandroid.com/bons-plans/2793527_soldes-200-de-remise-pour-ce-videoprojecteur-full-hd-180-avec-google-tv-qui-transforme-votre-salon-en-salle-de-cinema</link>
      <pubDate>Fri, 16 Jan 2026 10:38:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2793527_soldes-200-de-remise-pour-ce-videoprojecteur-full-hd-180-avec-google-tv-qui-transforme-votre-salon-en-salle-de-cinema</guid>
      <description>
Dans le cadre de ses offres des soldes d'hiver, Darty propose le vid&#233;oprojecteur nomade JMGO N1S Nano pour 399,99 euros au lieu de 599,99 euros. Vous pouvez m&#234;me obtenir 30 euros en carte-cadeau avec le code promo SOLDES15.
</description>
    </item>
    <item>
      <title>Feux stop, clignotants et &#233;cran couleur : le nouveau v&#233;lo &#233;lectrique en libre-service de Bolt frappe fort</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2944973_feux-stop-clignotants-et-ecran-couleur-le-nouveau-velo-electrique-en-libre-service-de-bolt-frappe-fort</link>
      <pubDate>Fri, 16 Jan 2026 10:32:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2944973_feux-stop-clignotants-et-ecran-couleur-le-nouveau-velo-electrique-en-libre-service-de-bolt-frappe-fort</guid>
      <description>
Bolt a d&#233;voil&#233; un nouveau mod&#232;le de v&#233;lo &#233;lectrique destin&#233; &#224; son service en libre-service en Europe. L&#8217;op&#233;rateur met en avant une refonte compl&#232;te du VAE.
</description>
    </item>
    <item>
      <title>Roblox launched age-verification rules. Days later, age-verified accounts were available on eBay</title>
      <link>https://www.fastcompany.com/91475982/roblox-launched-age-verification-rules-days-later-age-verified-accounts-were-available-on-ebay</link>
      <pubDate>2026-01-16T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91475982/roblox-launched-age-verification-rules-days-later-age-verified-accounts-were-available-on-ebay</guid>
      <description>Roblox announced it was implementing the system to prevent children younger than 16 from communicating with adults.
A new mandatory safety feature requires Roblox users in the U.S. to submit to facial age estimation via the app to access its chat feature. The online gaming platform announced it was implementing the system to prevent children younger than 16 from communicating with adults. About 42% of Roblox users are younger than 13.&#160;...</description>
    </item>
    <item>
      <title>How to watch Suddenly Amish online from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/suddenly-amish-online-from-anywhere</link>
      <pubDate>Fri, 16 Jan 2026 10:17:48 +0000</pubDate>
      <guid isPermaLink="false">y9GBmjQMBcVbeLzfi26g5c</guid>
      <description>Want to watch Suddenly Amish from anywhere? Stream every culture clash as six outsiders confront Amish life head-on.</description>
    </item>
    <item>
      <title>Boulanger multiplie les r&#233;ductions durant les soldes : les 14 deals &#224; saisir ce weeke-end</title>
      <link>https://www.frandroid.com/bons-plans/2931541_boulanger-multiplie-les-reductions-durant-les-soldes-les-14-deals-a-saisir-ce-weeke-end</link>
      <pubDate>Fri, 16 Jan 2026 10:10:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931541_boulanger-multiplie-les-reductions-durant-les-soldes-les-14-deals-a-saisir-ce-weeke-end</guid>
      <description>
&#192; l&#8217;occasion du week-end de la deuxi&#232;me d&#233;marque des soldes, Boulanger propose de belles offres pour se faire plaisir. L&#8217;enseigne affiche d&#8217;importantes r&#233;ductions sur les smartphones haut de gamme, comme l&#8217;ancien flagship de Google ou le r&#233;cent milieu de gamme de Xiaomi.
</description>
    </item>
    <item>
      <title>How to watch Molly-Mae: Behind It All &#8212; stream the love islander-turned influencer star's next chapter</title>
      <link>https://www.techradar.com/how-to-watch/molly-mae-behind-it-all</link>
      <pubDate>Fri, 16 Jan 2026 10:09:58 +0000</pubDate>
      <guid isPermaLink="false">BwmqyTHkEmX9AMYFot7w7g</guid>
      <description>Can Molly and Tommy get things back on track after rekindling their relationship? Here&#8217;s how you can watch Molly-Mae: Behind It All online and from anywhere.</description>
    </item>
    <item>
      <title>L&#8217;Europe veut enfin corriger sa plus grosse erreur sur les voitures hybrides chinoises</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/voitures-hybrides/2944811_leurope-veut-enfin-corriger-sa-plus-grosse-erreur-sur-les-voitures-hybrides-chinoises</link>
      <pubDate>Fri, 16 Jan 2026 10:07:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/voitures-hybrides/2944811_leurope-veut-enfin-corriger-sa-plus-grosse-erreur-sur-les-voitures-hybrides-chinoises</guid>
      <description>
Si les voitures &#233;lectriques chinoises sont assujetties &#224; une forte surtaxe douani&#232;re europ&#233;enne depuis 2024, les hybrides en &#233;taient exempt&#233;es. Une situation qui pourrait bien changer, d'apr&#232;s la Commission europ&#233;enne.
</description>
    </item>
    <item>
      <title>Face cach&#233;e de la Lune : un impact g&#233;ant pourrait expliquer sa profonde diff&#233;rence</title>
      <link>https://www.futura-sciences.com/sciences/actualites/lune-face-cachee-lune-impact-geant-pourrait-expliquer-profonde-difference-130209/#xtor%3DRSS-8</link>
      <pubDate>Fri, 16 Jan 2026 11:05:17 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/lune-face-cachee-lune-impact-geant-pourrait-expliquer-profonde-difference-130209/#xtor%3DRSS-8</guid>
      <description>La Lune poss&#232;de deux visages bien diff&#233;rents. Mais comment l&#8217;expliquer ? Voil&#224; une question qui intrigue depuis longtemps les scientifiques. Une nouvelle &#233;tude, fond&#233;e sur des roches rapport&#233;es par la mission chinoise Chang&#8217;e 6, apporte aujourd&#8217;hui des indices in&#233;dits reliant cette &#233;trange...</description>
    </item>
    <item>
      <title>Lego Pok&#233;mon are officially available for preorder, plus more of the best new Lego sets available now</title>
      <link>https://mashable.com/article/best-new-lego-sets-jan-2026</link>
      <pubDate>Fri, 16 Jan 2026 10:05:06 +0000</pubDate>
      <guid isPermaLink="false">01Tpu58Q6GA8f5aFPvbpuvZ</guid>
      <description>Lego's January releases include the first-ever collaboration with Pok&#233;mon, new brick technology, new Botanicals sets &#8212; here are the best ones our reporter tracked down.</description>
    </item>
    <item>
      <title>National Popcorn Day 2026 deals: How to get free popcorn on Jan. 19</title>
      <link>https://mashable.com/article/national-popcorn-day-2026-free-deals</link>
      <pubDate>Fri, 16 Jan 2026 10:03:39 +0000</pubDate>
      <guid isPermaLink="false">051QY2JzjJFWMBHaHLNGzza</guid>
      <description>The best National Popcorn Day 2026 include free popcorn from Cinemark, Regal, Marcus Theaters, and more.</description>
    </item>
    <item>
      <title>The best midrange smartphone for 2026</title>
      <link>https://www.engadget.com/mobile/smartphones/best-midrange-smartphone-183006463.html?src=rss</link>
      <pubDate>Fri, 16 Jan 2026 10:01:27 +0000</pubDate>
      <guid isPermaLink="false">f4dc766d-adb0-3650-a21a-0f9a423a6e0d</guid>
      <description>Gone are the days in which you needed to spend a fortune to get a good smartphone. In 2026, features once exclusive to high-end smartphones &#8211; big batteries, multi-camera arrays, high refresh rate OLED displays and more &#8211; have made their way down to more affordable models. Yes, you&#8217;ll still need to buy a flagship smartphone to get the best camera or fastest processor, but you don't have to make nearly as many compromises as you once did if you have a strict budget to adhere to when you go shopping for your next smartphone. If you have less than $600 to spend, let us help you figure out what fea...</description>
    </item>
    <item>
      <title>I tested every Kindle to find the absolute best Amazon e-reader</title>
      <link>https://mashable.com/roundup/best-kindles-2026</link>
      <pubDate>Fri, 16 Jan 2026 10:00:34 +0000</pubDate>
      <guid isPermaLink="false">075BHRyIknVFjS6g55iHeyI</guid>
      <description>To find the best Kindle for your library, Mashable tested and reviewed Amazon's latest e-readers. Compare the Kindle, Kindle Kids, Paperwhite, and Scribe.</description>
    </item>
    <item>
      <title>Galaxy&#8217;s Edge is no longer locked to one Star Wars timeline &#8212; and that&#8217;s a big deal for Disneyland fans</title>
      <link>https://www.techradar.com/streaming/entertainment/galaxys-edge-is-no-longer-locked-to-one-star-wars-timeline-and-thats-a-big-deal-for-disneyland-fans</link>
      <pubDate>Fri, 16 Jan 2026 10:00:18 +0000</pubDate>
      <guid isPermaLink="false">F4KBJwtqvWQRVYywgEY4zg</guid>
      <description>Disneyland is updating Galaxy&#8217;s Edge by bringing classic characters like Darth Vader, Luke, Leia, and Han as permanent fixtures, expanding the land beyond a single Star Wars era.</description>
    </item>
    <item>
      <title>Are we ready for OpenAI to put ads into ChatGPT?</title>
      <link>https://www.fastcompany.com/91472395/openai-chatgpt-advertising-television-trust</link>
      <pubDate>2026-01-16T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91472395/openai-chatgpt-advertising-television-trust</guid>
      <description>What it could mean to insert advertising into a 1-to-1 relationship.
Imagine you&#8217;re talking to someone and they suddenly start to add advertising to the exchange. What might that look like?&#160;In a 1965 episode of the classic sitcom I Dream of Jeannie, the protagonist uses her magical powers to create fake parents for herself in order to impress a date. She crafts them to be &#8220;just like the people on television commercials,&#8221; making them speak using sentences from commercials. Her synthetic &#8220;parents&#8221; appear friendly and normal&#8212;until they start talking, reciting ads verbatim&#160;for products like &#8220;strea...</description>
    </item>
    <item>
      <title>The world is getting tougher on kids&#8217; online safety in 2026</title>
      <link>https://www.fastcompany.com/91474179/the-world-is-getting-tougher-on-kids-online-safety-in-2026</link>
      <pubDate>2026-01-16T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91474179/the-world-is-getting-tougher-on-kids-online-safety-in-2026</guid>
      <description>A slew of new laws around the globe are trying to curb minors&#8217; access to social media&#8212;but legal challenges are afoot.
The new year is a time for resolutions. This year, governments, platforms, and campaigners all seem to have hit on the same ones: Children should spend less time online, and companies should know exactly how old their users are.</description>
    </item>
    <item>
      <title>NASA says Artemis II can fly without its big, broken deep space antenna</title>
      <link>https://mashable.com/article/nasa-artemis-2-deep-space-network-antenna-failure</link>
      <pubDate>Fri, 16 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00bHYtbsff8kVRWC6xMI4Rc</guid>
      <description>Despite its largest radio antenna being broken, NASA is confident Artemis II, which could launch in February, won't be affected by it.</description>
    </item>
    <item>
      <title>Why are there no dragons in A Knight of the Seven Kingdoms?</title>
      <link>https://mashable.com/article/why-are-there-no-dragons-in-a-knight-of-the-seven-kingdoms-explainer</link>
      <pubDate>Fri, 16 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">07bjMCgjEuapibmmFpi2Swf</guid>
      <description>"A Knight of the Seven Kingdoms" is the first dragon-less Game of Thrones show. Here's why.</description>
    </item>
    <item>
      <title>This classic Microsoft Office suite is back &#8212; and only $20</title>
      <link>https://mashable.com/article/jan-16-microsoft-office-professional-plus-2019-for-windows</link>
      <pubDate>Fri, 16 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">04IlS9UiPPg2Pa08YOlpim9</guid>
      <description>Get lifetime access to Microsoft Office Professional Plus 2019 for Windows &#8212; including Word, Excel, and PowerPoint &#8212; for a one-time $19.97.</description>
    </item>
    <item>
      <title>How to watch the 2026 T20 World Cup online for free</title>
      <link>https://mashable.com/article/t20-world-cup-2026-live-stream-for-free</link>
      <pubDate>Fri, 16 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02twd7vpkkCMI0opSL1l0ob</guid>
      <description>How to watch T20 World Cup for free. Live stream the 2026 T20 World Cup for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Past Wordle answers &#8211; every solution so far, alphabetical and by date</title>
      <link>https://www.techradar.com/news/past-wordle-answers</link>
      <pubDate>Fri, 16 Jan 2026 09:53:05 +0000</pubDate>
      <guid isPermaLink="false">p9nbucEtdfofUvHMEWoLAQ</guid>
      <description>Knowing past Wordle answers can help with today's game. Here's the full list so far.</description>
    </item>
    <item>
      <title>The 11 best headphones of 2026 &#8212; see the top contenders from Sony, Apple, Bose, and Beats</title>
      <link>https://mashable.com/roundup/best-headphones-2026</link>
      <pubDate>Fri, 16 Jan 2026 09:45:30 +0000</pubDate>
      <guid isPermaLink="false">00qrsf3wCFjMiU3WmxGY9h9</guid>
      <description>We tested the best headphones from Sony, Bose, Apple, Marshall, and Bowers &amp; Wilkins. See all the wireless and noise-cancelling cans we personally recommend.</description>
    </item>
    <item>
      <title>Taxe Gafam de 6&#160;% au lieu de 15&#160;% : comment la pression am&#233;ricaine a fait plier les d&#233;put&#233;s fran&#231;ais</title>
      <link>https://www.01net.com/actualites/taxe-gafam-de-6-au-lieu-de-15-comment-la-pression-americaine-a-fait-plier-les-deputes-francais.html</link>
      <pubDate>Fri, 16 Jan 2026 09:32:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320579</guid>
      <description>En octobre dernier, les d&#233;put&#233;s fran&#231;ais se sont mis d'accord sur une augmentation de la taxe Gafam de 6 %, contre les 15 % initialement propos&#233;s. La raison de ce recul : un courrier du Congr&#232;s am&#233;ricain, vent debout contre une mesure qui p&#233;naliserait selon eux les champions am&#233;ricains, et qui pourrait devenir un pr&#233;c&#233;dent suivi par d'autres pays, r&#233;v&#232;le Radio France, ce vendredi 16 janvier....</description>
    </item>
  </channel>
</rss>
