<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 06 Jan 2026 11:23:34 GMT</lastBuildDate>
    <item>
      <title>Fini les tapis mouill&#233;s avec le nouvel Ecovacs Deebot X12 OmniCyclone</title>
      <link>https://www.01net.com/actualites/fini-tapis-mouilles-avec-nouvel-ecovacs-deebot-x12-omnicyclone.html</link>
      <pubDate>Tue, 06 Jan 2026 11:19:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318334</guid>
      <description>Ecovacs d&#233;voile son Deebot X12 OmniCyclone, un robot aspirateur haut de gamme qui int&#232;gre une protection pour les tapis et un syst&#232;me de pr&#233;traitement pour mieux nettoyer les t&#226;ches tenaces.</description>
    </item>
    <item>
      <title>CD Projekt Red is reportedly working on a new expansion for The Witcher 3 ahead of The Witcher 4's release &#8212; and I'll be there day one</title>
      <link>https://www.techradar.com/gaming/cd-projekt-red-is-reportedly-working-on-a-new-expansion-for-the-witcher-3-ahead-of-the-witcher-4s-release-and-ill-be-there-day-one</link>
      <pubDate>Tue, 06 Jan 2026 11:19:26 +0000</pubDate>
      <guid isPermaLink="false">oehLWizRUeEgEaWrKykRD6</guid>
      <description>CD Projekt Red has hinted that "new content" for an unnamed game will be released this year ahead of The Witcher 4, and an industry insider has claimed that it's the long-rumored The Witcher 3: The Wild Hunt expansion.</description>
    </item>
    <item>
      <title>Everything announced at CES 2026</title>
      <link>https://www.engadget.com/general/everything-announced-at-ces-2026-130124802.html?src=rss</link>
      <pubDate>Tue, 06 Jan 2026 11:15:04 +0000</pubDate>
      <guid isPermaLink="false">fd3b4bbf-1b78-4e34-9914-70a2e6f85389</guid>
      <description>It's the first week of a new year and there's no time for the tech world to slowly ease back into things following the holidays. That's because CES 2026 is in full swing, with all manner of companies descending on Las Vegas to reveal their latest innovations and what they're planning to bring your way in the near future.&#160;Many of the Engadget crew are on the ground to check out as much of the new tech as possible. Of course, we're keeping tabs on all of the major CES press conferences too. Samsung has already held its First Look presentation, which focuses on home products, while LG has shown o...</description>
    </item>
    <item>
      <title>Non, ce n&#8217;est pas la fin de Microsoft Office</title>
      <link>https://www.01net.com/actualites/non-ce-nest-pas-la-fin-de-microsoft-office.html</link>
      <pubDate>Tue, 06 Jan 2026 11:06:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318351</guid>
      <description>Plusieurs publications sur les r&#233;seaux sociaux s&#8217;affolent au sujet d&#8217;un pr&#233;tendu rebranding de la suite Office de Microsoft en Microsoft 365 Copilot. C&#8217;est faux, et c&#8217;est en r&#233;alit&#233; un peu plus complexe que &#231;a.</description>
    </item>
    <item>
      <title>Intel Core Ultra Series 3 vs Qualcomm Snapdragon X2 : voici le duel des processeurs de PC portables de 2026</title>
      <link>https://www.frandroid.com/marques/intel/2930721_intel-core-ultra-series-3-vs-qualcomm-snapdragon-x2-voici-le-duel-des-processeurs-de-pc-portables-de-2026</link>
      <pubDate>Tue, 06 Jan 2026 11:05:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/intel/2930721_intel-core-ultra-series-3-vs-qualcomm-snapdragon-x2-voici-le-duel-des-processeurs-de-pc-portables-de-2026</guid>
      <description>
D'un c&#244;t&#233;, Intel joue sa survie technique avec son proc&#233;d&#233; 18A et promet des performances graphiques d&#233;lirantes. De l'autre, Qualcomm d&#233;mocratise ses puces ARM avec le Snapdragon X2 Plus et Elite. Vous cherchez un nouveau PC portable cette ann&#233;e ? Voici le match sanglant qui se pr&#233;pare.
</description>
    </item>
    <item>
      <title>The Samsung Galaxy S26 Ultra might have just been caught on camera</title>
      <link>https://www.techradar.com/phones/samsung-galaxy-phones/the-samsung-galaxy-s26-ultra-might-have-just-been-caught-on-camera</link>
      <pubDate>Tue, 06 Jan 2026 11:00:45 +0000</pubDate>
      <guid isPermaLink="false">d4i2Mj2YLTPDTcMmKLnfji</guid>
      <description>This leaked video seemingly shows both the Samsung Galaxy S26 Ultra and its retail box, but there's some doubt about its authenticity.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs smartphones pliables ? Samsung Galaxy Z, Honor Magic V, Motorola Razr&#8230; notre comparatif</title>
      <link>https://www.frandroid.com/guide-dachat/1617799_meilleur-smartphone-pliant-quel-telephone-pliable-choisir</link>
      <pubDate>Tue, 06 Jan 2026 11:00:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1617799_meilleur-smartphone-pliant-quel-telephone-pliable-choisir</guid>
      <description>
Les smartphones pliants ont une belle place sur le march&#233;. Tr&#232;s compacts une fois referm&#233;s, ils d&#233;ploient de grands &#233;crans pour une exp&#233;rience visuelle plus agr&#233;able. D&#233;couvrez ici notre s&#233;lection des meilleurs mod&#232;les pliables, test&#233;s et approuv&#233;s par nos soins.
</description>
    </item>
    <item>
      <title>Garmin, Coros, Apple&#8230; voici les marques de montres les plus populaires chez les coureurs en France</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2930651_garmin-coros-apple-voici-les-marques-de-montres-les-plus-populaires-chez-les-coureurs-en-france</link>
      <pubDate>Tue, 06 Jan 2026 11:00:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2930651_garmin-coros-apple-voici-les-marques-de-montres-les-plus-populaires-chez-les-coureurs-en-france</guid>
      <description>
Le m&#233;dia fran&#231;ais Run'ix, d&#233;di&#233; &#224; la course &#224; pied, a publi&#233; le classement des marques de montres les plus utilis&#233;es par sa communaut&#233;. 
</description>
    </item>
    <item>
      <title>13 Best Tablets (2026), Tested and Reviewed</title>
      <link>https://www.wired.com/gallery/the-best-tablets/</link>
      <pubDate>Tue, 06 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">5af4622ff2b84f222a2e5fc8</guid>
      <description>We&#8217;ve tested all the top slates, from Apple&#8217;s iPads to Android and Windows devices, and rounded up our favorites.</description>
    </item>
    <item>
      <title>We recommend the Victrix Pro BFG for its excellent back-paddles and modular design, and you can now pick it up for cheap as part of some excellent New Year&#8217;s deals</title>
      <link>https://www.techradar.com/gaming/we-recommend-the-victrix-pro-bfg-for-its-excellent-back-paddles-and-modular-design-and-you-can-now-pick-it-up-for-cheap-as-part-of-some-excellent-new-years-deals</link>
      <pubDate>Tue, 06 Jan 2026 10:57:18 +0000</pubDate>
      <guid isPermaLink="false">RDV28FmyiKnBUZWCQ3juKg</guid>
      <description>One of the best premium game controllers is still heavily discounted for the New Year. Get excellent savings on one of our favorite PS5 and Xbox gamepads.</description>
    </item>
    <item>
      <title>In not remotely shocking news, Xbox has reportedly suffered its 'worst year on record' for console sales</title>
      <link>https://www.techradar.com/gaming/in-not-remotely-shocking-news-xbox-has-reportedly-suffered-its-worst-year-on-record-for-console-sales</link>
      <pubDate>Tue, 06 Jan 2026 10:55:52 +0000</pubDate>
      <guid isPermaLink="false">dkX2inK7HJL5CpNpaXQuRV</guid>
      <description>Xbox reportedly had its 'worst year on record' in 2025 in news that should surprise no one.</description>
    </item>
    <item>
      <title>Audio-Technica just updated one of its best ever turntables at CES 2026, and I want it</title>
      <link>https://www.techradar.com/audio/turntables/audio-technica-just-updated-one-of-its-best-ever-turntables-at-ces-2026-and-i-want-it</link>
      <pubDate>Tue, 06 Jan 2026 10:55:44 +0000</pubDate>
      <guid isPermaLink="false">SdRQBSv3nJjiyngVfotcMd</guid>
      <description>The new AT-LP7X updates an already talented turntable &#8211;and just look at it!</description>
    </item>
    <item>
      <title>30 heures d&#8217;autonomie : Samsung sort l&#8217;artillerie lourde avec le Galaxy Book6 Ultra</title>
      <link>https://www.frandroid.com/marques/samsung/2930691_30-heures-dautonomie-samsung-sort-lartillerie-lourde-avec-le-galaxy-book6-ultra</link>
      <pubDate>Tue, 06 Jan 2026 10:55:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2930691_30-heures-dautonomie-samsung-sort-lartillerie-lourde-avec-le-galaxy-book6-ultra</guid>
      <description>
Samsung profite de l'ouverture du CES 2026 pour annoncer sa nouvelle gamme de PC portables. Avec la nouvelle s&#233;rie Galaxy Book6, le constructeur cor&#233;en en profite pour affiner son design et annoncer une autonomie toujours plus folle.
</description>
    </item>
    <item>
      <title>Foldy Bird : ce jeu insolite va d&#233;truire l&#8217;&#233;cran de votre smartphone pliant en 5 minutes</title>
      <link>https://www.frandroid.com/android/applications/2930731_foldy-bird-ce-jeu-insolite-va-detruire-lecran-de-votre-smartphone-pliant-en-5-minutes</link>
      <pubDate>Tue, 06 Jan 2026 10:55:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/applications/2930731_foldy-bird-ce-jeu-insolite-va-detruire-lecran-de-votre-smartphone-pliant-en-5-minutes</guid>
      <description>
Vous pensiez que Flappy Bird &#233;tait frustrant ? Attendez de tester cette version pour smartphones pliants. Pour faire voler votre oiseau, il ne faut plus tapoter l'&#233;cran, mais plier et d&#233;plier votre t&#233;l&#233;phone. C&#8217;est brillant, mais c'est surtout le meilleur moyen d'achever votre charni&#232;re.
</description>
    </item>
    <item>
      <title>No,&#160;Microsoft&#160;didn&#8217;t&#160;rebrand Office to&#160;Microsoft&#160;365 Copilot</title>
      <link>https://www.theverge.com/tech/856149/microsoft-365-office-rebrand-copilot</link>
      <pubDate>2026-01-06T05:48:29-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=856149</guid>
      <description>Microsoft has got the internet confused, again. Over the past couple of days posts on Reddit, Hacker News, and X have claimed Microsoft has rebranded Microsoft Office to Microsoft 365 Copilot. As much as Microsoft loves to shove its Copilot branding everywhere, Office hasn't been renamed to "Microsoft 365 Copilot app." The confusion comes from [&#8230;]</description>
    </item>
    <item>
      <title>240 i/s en 4K&#160;: NVIDIA repousse les limites avec le DLSS 4.5 sur les cartes graphiques RTX</title>
      <link>https://www.01net.com/actualites/240-i-s-en-4k-nvidia-repousse-les-limites-avec-le-dlss-4-5-sur-les-cartes-graphiques-rtx.html</link>
      <pubDate>Tue, 06 Jan 2026 10:43:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318321</guid>
      <description>Un an apr&#232;s la sortie des RTX 50, NVIDIA profite du CES 2026 pour booster ses GPU via le logiciel. Le DLSS 4.5 am&#233;liore l'image de toutes les cartes et promet un mode &#171; 6x &#187; d&#233;lirant pour le printemps.</description>
    </item>
    <item>
      <title>Compacte et endurante, cette tablette Lenovo n&#8217;est qu&#8217;&#224; 79 &#8364; gr&#226;ce &#224; cette nouvelle offre de 2026</title>
      <link>https://www.frandroid.com/bons-plans/2901807_compacte-et-endurante-cette-tablette-lenovo-nest-qua-79-euros-grace-a-cette-nouvelle-offre-de-2026</link>
      <pubDate>Tue, 06 Jan 2026 10:42:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2901807_compacte-et-endurante-cette-tablette-lenovo-nest-qua-79-euros-grace-a-cette-nouvelle-offre-de-2026</guid>
      <description>
La Lenovo Tab One est une petite tablette id&#233;ale pour le streaming vid&#233;o et la navigation web. Simple et efficace, elle est actuellement affich&#233;e &#224; 79 euros au lieu de 139 euros chez E.Leclerc.
</description>
    </item>
    <item>
      <title>Product teams are losing confidence &#8211; here&#8217;s how they can get it back</title>
      <link>https://www.techradar.com/pro/product-teams-are-losing-confidence-heres-how-they-can-get-it-back</link>
      <pubDate>Tue, 06 Jan 2026 10:35:21 +0000</pubDate>
      <guid isPermaLink="false">ydpLiw6QGNLut8BBCHKyym</guid>
      <description>By bringing information for teams need into one place, AI makes it easier to collaborate.</description>
    </item>
    <item>
      <title>6 Best Gym Bags for Every Workout and Commute (2026)</title>
      <link>https://www.wired.com/story/best-gym-bags/</link>
      <pubDate>Tue, 06 Jan 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">693840205424e17d7409792d</guid>
      <description>New year, new gym bag. I put over 20 models to the test in 2025 so you can start 2026 with the best.</description>
    </item>
    <item>
      <title>Liti&#232;re, fontaine, tracker GPS&#8230; quels objets connect&#233;s pour nos animaux de compagnie ?</title>
      <link>https://www.frandroid.com/guide-dachat/1876803_distributeur-de-croquettes-litiere-connectee-gps-pour-chat-et-chien-les-meilleurs-accessoires-pour-nos-animaux-de-compagnie</link>
      <pubDate>Tue, 06 Jan 2026 10:28:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1876803_distributeur-de-croquettes-litiere-connectee-gps-pour-chat-et-chien-les-meilleurs-accessoires-pour-nos-animaux-de-compagnie</guid>
      <description>
Votre animal de compagnie m&#233;rite le meilleur. Liti&#232;re connect&#233;e, collier traceur GPS, fontaine &#224; eau, ou m&#234;me distributeur de croquettes automatique : on a s&#233;lectionn&#233; les meilleurs accessoires connect&#233;s pour votre chien ou chat !
</description>
    </item>
    <item>
      <title>I got blue lips and weak knees on my first day at CES 2026, and I couldn't be happier</title>
      <link>https://www.techradar.com/tech-events/i-got-blue-lips-and-weak-knees-on-my-first-day-at-ces-2026-and-i-couldnt-be-happier</link>
      <pubDate>Tue, 06 Jan 2026 10:26:13 +0000</pubDate>
      <guid isPermaLink="false">7cdZx73H3Fj5Vu6bGMRyqb</guid>
      <description>24 hours of CES 2026 have already been a wild ride.</description>
    </item>
    <item>
      <title>Apr&#232;s des ann&#233;es d&#8217;attente, la premi&#232;re voiture &#233;lectrique de Sony franchit enfin une &#233;tape d&#233;cisive</title>
      <link>https://www.frandroid.com/marques/sony/2930265_apres-des-annees-dattente-la-premiere-voiture-electrique-de-sony-franchit-enfin-une-etape-decisive</link>
      <pubDate>Tue, 06 Jan 2026 10:23:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2930265_apres-des-annees-dattente-la-premiere-voiture-electrique-de-sony-franchit-enfin-une-etape-decisive</guid>
      <description>
Apr&#232;s des ann&#233;es d'attente, Sony Honda Mobility vient de lancer la production pilote de sa premi&#232;re voiture &#233;lectrique, l&#8217;Afeela 1. Assembl&#233;e aux &#201;tats-Unis, la berline devrait d&#233;barquer sur les routes de la Californie courant 2026.
</description>
    </item>
    <item>
      <title>Samsung Galaxy S26 Ultra : une premi&#232;re vid&#233;o de d&#233;ballage s&#232;me le doute</title>
      <link>https://www.frandroid.com/marques/samsung/2930643_samsung-galaxy-s26-ultra-une-premiere-video-de-deballage-seme-le-doute</link>
      <pubDate>Tue, 06 Jan 2026 10:20:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2930643_samsung-galaxy-s26-ultra-une-premiere-video-de-deballage-seme-le-doute</guid>
      <description>
Une vid&#233;o montrant le futur Galaxy S26 Ultra dans sa bo&#238;te de vente vient de surgir sur le web. Si l'emballage semble tr&#232;s r&#233;aliste, plusieurs d&#233;tails clochent et sugg&#232;rent qu'il s'agit d'une unit&#233; factice. On fait le point.
</description>
    </item>
    <item>
      <title>Google set to end POP3 support - here's what we know</title>
      <link>https://www.techradar.com/pro/google-set-to-end-pop3-support-heres-what-we-know</link>
      <pubDate>Tue, 06 Jan 2026 10:19:10 +0000</pubDate>
      <guid isPermaLink="false">oN93NaVtKZKjXihghU3KLB</guid>
      <description>Google is ending POP3 support &#8211; you can fetch emails from other providers in your mobile app via IMAP, but it's the end for your computer.</description>
    </item>
    <item>
      <title>Un doute sur un lien ? Orange lance un outil gratuit pour d&#233;tecter les arnaques (et tout le monde peut l&#8217;utiliser)</title>
      <link>https://www.frandroid.com/marques/orange/2930237_un-doute-sur-un-lien-orange-lance-un-outil-gratuit-pour-detecter-les-arnaques-et-tout-le-monde-peut-lutiliser</link>
      <pubDate>Tue, 06 Jan 2026 10:16:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/orange/2930237_un-doute-sur-un-lien-orange-lance-un-outil-gratuit-pour-detecter-les-arnaques-et-tout-le-monde-peut-lutiliser</guid>
      <description>
L&#8217;op&#233;rateur met &#224; disposition de tous les internautes un outil gratuit permettant de v&#233;rifier la l&#233;gitimit&#233; d&#8217;un lien avant de cliquer dessus.
</description>
    </item>
    <item>
      <title>Cyberattaque sur Windows&#160;: m&#233;fiez-vous de l&#8217;&#233;cran bleu de la mort, c&#8217;est peut-&#234;tre un pi&#232;ge</title>
      <link>https://www.01net.com/actualites/cyberattaque-sur-windows-attention-ecran-bleu-mort-peut-etre-piege.html</link>
      <pubDate>Tue, 06 Jan 2026 10:11:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318310</guid>
      <description>Une nouvelle cyberattaque vise les ordinateurs Windows d'Europe. Les attaques commencent par de faux mails Booking.com qui d&#233;clenchent l'apparition d'un faux &#233;cran bleu de la mort. Celui-ci va ensuite pousser la cible &#224; installer un virus.</description>
    </item>
    <item>
      <title>Pourquoi &#171;&#160;l&#8217;iPhone Pro&#160;sous Android&#160;&#187; et sa batterie de 10 080 mAh risquent de nous passer sous le nez</title>
      <link>https://www.frandroid.com/marques/honor/2930597_pourquoi-liphone-pro-sous-android-et-sa-batterie-de-10-080-mah-risquent-de-nous-passer-sous-le-nez</link>
      <pubDate>Tue, 06 Jan 2026 10:07:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/honor/2930597_pourquoi-liphone-pro-sous-android-et-sa-batterie-de-10-080-mah-risquent-de-nous-passer-sous-le-nez</guid>
      <description>
C'est absurde. Dans le bon sens du terme. Honor vient de pr&#233;senter le Power2, un smartphone qui embarque une batterie de 10 080 mAh et la nouvelle puce Dimensity 8500 Elite.
</description>
    </item>
    <item>
      <title>The Best Ventless Fireplaces for Cozy Vibes (2026)</title>
      <link>https://www.wired.com/gallery/the-best-ventless-fireplace/</link>
      <pubDate>Tue, 06 Jan 2026 10:03:00 +0000</pubDate>
      <guid isPermaLink="false">68acd1a4ed841e3f132854c9</guid>
      <description>No chimney? No problem. LED and gel fuel fireplaces are excellent alternatives for those who can&#8217;t or don&#8217;t want to burn wood. We tried one of each to see which method is best.</description>
    </item>
    <item>
      <title>The 5 best Mint alternatives to replace the budgeting app that shut down</title>
      <link>https://www.engadget.com/apps/the-best-budgeting-apps-to-replace-mint-143047346.html?src=rss</link>
      <pubDate>Tue, 06 Jan 2026 10:00:38 +0000</pubDate>
      <guid isPermaLink="false">dd1282c3-99ed-4ddc-b8ab-c10c60d4e70c</guid>
      <description>As a long-time Mint user, I was frustrated to say the least when news broke at the end of 2023 that Intuit would shut Mint down. I, like millions of others, enjoyed how easily Mint allowed us to track all accounts in one place and monitor credit scores. I also used it regularly to track spending, set goals like pay my mortgage down faster and with general money management.So I set out to find the best Mint alternatives in the wake of its disappointing demise. I gave Credit Karma, Intuit&#8217;s other financial app, a try but found it to be a poor Mint substitute. The following guide lays out my expe...</description>
    </item>
    <item>
      <title>This speaker by Victrola sits underneath turntables and streams audio via Bluetooth</title>
      <link>https://www.engadget.com/audio/speakers/this-speaker-by-victrola-sits-underneath-turntables-and-streams-audio-via-bluetooth-100021991.html?src=rss</link>
      <pubDate>Tue, 06 Jan 2026 10:00:21 +0000</pubDate>
      <guid isPermaLink="false">8864ef63-e91d-4180-a1b5-74eb6ebcdfec</guid>
      <description>Noted turntable manufacturer Victrola just announced the Soundstage speaker at CES. This thin little doodad actually sits underneath turntables, removing the need for a full stereo set-up. The Soundstage isn't the first speaker that offers this functionality, but this one has tech-forward features.
It offers multiple connection options, including Bluetooth. Many newer Victrola turntables can do Bluetooth streaming, so adding this speaker to a setup would be extremely simple. Otherwise, companies offer Bluetooth receivers for turntables.
It also allows for traditional wired connections, and the...</description>
    </item>
    <item>
      <title>Report from OpenAI Claims ChatGPT Is Becoming an Important Complement to U.S. Healthcare</title>
      <link>https://gizmodo.com/report-from-openai-claims-chatgpt-is-becoming-an-important-complement-to-u-s-healthcare-2000705721</link>
      <pubDate>Tue, 06 Jan 2026 10:00:19 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705721</guid>
      <description>Is it a sign of a good healthcare system when millions of people turn to a hallucinating robot for help?</description>
    </item>
    <item>
      <title>The 3 Keys to Understanding Trump&#8217;s Retro Coup in Venezuela</title>
      <link>https://www.wired.com/story/3-keys-understanding-trumps-retro-coup-in-venezuela/</link>
      <pubDate>Tue, 06 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">695bf5b157ce7d546c5289cb</guid>
      <description>This weekend&#8217;s invasion was both a throwback to the last century and a new, uniquely Trumpian nightmare&#8212;one that&#8217;s just beginning.</description>
    </item>
    <item>
      <title>Cambridge has unveiled three active bookshelf speakers at CES and it&#8217;s not hard to see the KEF resemblance</title>
      <link>https://www.techradar.com/tech-events/cambridge-has-unveiled-three-active-bookshelf-speakers-at-ces-and-its-not-hard-to-see-the-kef-resemblance</link>
      <pubDate>Tue, 06 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">bPUYj9MakpyoRiEgK2Mvoc</guid>
      <description>I&#8217;ll take a set in orange: Cambridge&#8217;s new active bookshelf speakers are so thoroughly un-Cambridge &#8211; in the best way</description>
    </item>
    <item>
      <title>This new turntable speaker is a perfect space-saving buy for new vinyl owners</title>
      <link>https://www.techradar.com/audio/turntables/this-new-turntable-speaker-is-a-perfect-space-saving-buy-for-new-vinyl-owners</link>
      <pubDate>Tue, 06 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">TEawnqDGGiNJcfbmgY8HqW</guid>
      <description>CES offers up the perfect turntable companion in the form of the Victrola Soundstage, which goes on sale in the summer.</description>
    </item>
    <item>
      <title>Cambridge Audio unveils three wireless bookshelf speakers at CES</title>
      <link>https://www.engadget.com/audio/speakers/cambridge-audio-unveils-three-wireless-bookshelf-speakers-at-ces-100000178.html?src=rss</link>
      <pubDate>Tue, 06 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">5e76e609-818b-4aa4-9abc-c2c548375b5c</guid>
      <description>Cambridge Audio has three new active speakers at CES 2026. The L/R Series is a trio of active bookshelf-style speakers, each with wired and wireless modes.The flagship L/R X is an 800W model (400W per speaker). The largest of the three, it unsurprisingly carries the highest price, at $2,299. It uses a 2.5-way acoustic design: a 28mm Torus tweeter alongside dual 5-inch woofers. The L/R X has a pair of 6-inch force-canceling passive radiators, a 64-bit audio pipeline, DynamEQ and Wi-Fi streaming (via Cambridge Audio's StreamMagic app). It even adds LED underlighting for an extra aesthetic touch....</description>
    </item>
    <item>
      <title>Email inboxes are AI&#8217;s next gold mine</title>
      <link>https://www.fastcompany.com/91448556/email-inboxes-are-the-next-ai-gold-mine</link>
      <pubDate>2026-01-06T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448556/email-inboxes-are-the-next-ai-gold-mine</guid>
      <description>Despite texts, DMs, and Slack, tech companies are racing to own your inbox. Why? It&#8217;s the key to unlocking personalized AI. &#160;
The founder of Slack once deemed email &#8220;the cockroach of the internet.&#8221; He wasn&#8217;t the first to lament the extreme survivability of our inbox. From text messages to social media to office messaging platforms, all sorts of communication technologies have teased the promise of killing email by connecting us to others in faster, richer ways.&#160;...</description>
    </item>
    <item>
      <title>Michael Jordan says his Bulls contract had a clause he&#8217;s positive no players today have. It&#8217;s the secret to becoming the best</title>
      <link>https://www.fastcompany.com/91469202/michael-jordan-bulls-contract-love-of-the-game-clause</link>
      <pubDate>2026-01-06T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91469202/michael-jordan-bulls-contract-love-of-the-game-clause</guid>
      <description>In a recent interview, the Hall of Famer speaks about the &#8216;love of the game&#8217; clause from his playing days, and how that helped shape the player he became.
Michael Jordan&#160;is widely recognized as one of the best basketball players to ever live.&#160;In a recent interview, Jordan revealed one of the secrets to his success:</description>
    </item>
    <item>
      <title>A class-action lawsuit against McDonald&#8217;s boldly asks: Is the McRib really rib?</title>
      <link>https://www.fastcompany.com/91469268/mcdonalds-class-action-lawsuit-mcrib-meat</link>
      <pubDate>2026-01-06T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91469268/mcdonalds-class-action-lawsuit-mcrib-meat</guid>
      <description>To rib, or not to rib? That all depends on whether you are a fan of &#8216;reconstructed meat product.&#8217;
McDonald&#8217;s limited-time McRib sandwich is a cultural icon. And like any item of its ilk, it&#8217;s divisive. On the one hand, the saucy, vaguely rib-esque boneless pork sandwich has a fan base so dedicated that it&#8217;s inspired its own Reddit megathread, merch, and a website called the McRib Locator. ...</description>
    </item>
    <item>
      <title>Yann LeCun: Meta &#8216;fudged a little bit&#8217; when benchmark-testing Llama 4 model</title>
      <link>https://www.fastcompany.com/91469583/yann-lecun-meta-llama-4-model-zuckerberg</link>
      <pubDate>2026-01-06T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91469583/yann-lecun-meta-llama-4-model-zuckerberg</guid>
      <description>The testing sparked internal frustration about the progress of the Llama models.
Yann LeCun, Meta&#8217;s outgoing chief AI scientist, says his employer tested its latest Llama model in a way that may have made the model look better than it really was.&#160;</description>
    </item>
    <item>
      <title>La Presse au CES 2026 de Las&#160;Vegas | Les tendances techno de&#160;l&#8217;ann&#233;e</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-01-06/la-presse-au-ces-2026-de-las-vegas/les-tendances-techno-de-l-annee.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Tue, 06 Jan 2026 05:00:00 -0500</pubDate>
      <guid isPermaLink="false">6e4fb2e3455a30259d6ed47b5dfa45b8</guid>
      <description>L&#8217;ann&#233;e&#160;2026 n&#8217;est pas vieille d&#8217;une semaine que d&#233;j&#224;, l&#8217;actualit&#233; nous rattrape sur tous les fronts. Les technos n&#8217;y &#233;chappent pas. Cette semaine se tient le Consumer Electronics Show (CES) de Las&#160;Vegas qui, au fil de ses 59&#160;&#233;ditions, s&#8217;est &#233;largi au-del&#224; de l&#8217;&#233;lectronique domestique pour couvrir les nouveaut&#233;s d&#8217;intelligence artificielle (IA), d&#8217;informatique, d&#8217;automobile et tutti quanti. Voici donc les cinq principales tendances du CES qui d&#233;finiront 2026....</description>
    </item>
    <item>
      <title>Le patron de Xiaomi a trouv&#233; une solution radicale pour faire taire les rumeurs sur ses voitures &#233;lectriques</title>
      <link>https://www.frandroid.com/marques/xiaomi/2930207_le-patron-de-xiaomi-a-trouve-une-solution-radicale-pour-faire-taire-les-rumeurs-sur-ses-voitures-electriques</link>
      <pubDate>Tue, 06 Jan 2026 09:57:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2930207_le-patron-de-xiaomi-a-trouve-une-solution-radicale-pour-faire-taire-les-rumeurs-sur-ses-voitures-electriques</guid>
      <description>
Face aux critiques sur ses voitures &#233;lectriques, le patron de Xiaomi a trouv&#233; &#224; une solution &#233;tonnante, mais efficace. L&#8217;homme d&#8217;affaires a tout simplement d&#233;mont&#233; un YU7 en direct.
</description>
    </item>
    <item>
      <title>Mati&#232;re noire : ce que Hubble vient d&#8217;observer n&#8217;aurait jamais d&#251; &#234;tre visible !</title>
      <link>https://www.futura-sciences.com/sciences/actualites/matiere-noire-matiere-noire-ce-hubble-vient-observer-naurait-jamais-etre-visible-129815/#xtor%3DRSS-8</link>
      <pubDate>Tue, 06 Jan 2026 10:57:35 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/matiere-noire-matiere-noire-ce-hubble-vient-observer-naurait-jamais-etre-visible-129815/#xtor%3DRSS-8</guid>
      <description>Le t&#233;lescope spatial Hubble a r&#233;v&#233;l&#233; l&#8217;existence d&#8217;un nouvel objet astronomique fascinant : Cloud-9, un nuage de mati&#232;re noire riche en hydrog&#232;ne neutre et &#233;tonnamment d&#233;pourvu d&#8217;&#233;toiles. Consid&#233;r&#233; comme un vestige des premi&#232;res &#233;tapes de la formation des galaxies, cet objet unique pourrait...</description>
    </item>
    <item>
      <title>&#171;&#160;Le roi de l&#8217;autonomie sur x86&#160;&#187; : Intel lance sa contre-attaque massive avec ses processeurs Panther Lake</title>
      <link>https://www.frandroid.com/marques/2930197_le-roi-de-lautonomie-sur-x86-intel-lance-sa-contre-attaque-massive-avec-ses-processeurs-panther-lake</link>
      <pubDate>Tue, 06 Jan 2026 09:55:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2930197_le-roi-de-lautonomie-sur-x86-intel-lance-sa-contre-attaque-massive-avec-ses-processeurs-panther-lake</guid>
      <description>
Intel aurait-il repris le dessus ? Sa nouvelle architecture Panther Lake, pr&#233;sent&#233;e au CES 2026 &#224; Las Vegas, promet de s&#233;rieux gains en performances, mais aussi en autonomie pour nos PC portables.
</description>
    </item>
    <item>
      <title>Ce Tamagotchi dop&#233; &#224; ChatGPT peut voyager seul et vous raconter ses aventures : voici Sweekar</title>
      <link>https://www.frandroid.com/produits-android/accessoires/2929505_ce-tamagotchi-dope-a-chatgpt-peut-voyager-seul-et-vous-raconter-ses-aventures-voici-sweekar</link>
      <pubDate>Tue, 06 Jan 2026 09:48:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires/2929505_ce-tamagotchi-dope-a-chatgpt-peut-voyager-seul-et-vous-raconter-ses-aventures-voici-sweekar</guid>
      <description>
La startup Takway a profit&#233; du CES 2026 pour d&#233;voiler Sweekar, un compagnon virtuel au format de poche. Entre nostalgie des ann&#233;es 90 et int&#233;gration massive de l'intelligence artificielle, ce petit robot promet de ne jamais vous quitter, tout en d&#233;veloppant une personnalit&#233; propre au fil de ses aventures.
</description>
    </item>
    <item>
      <title>Pour d&#233;tr&#244;ner Whoop, ce bracelet sans &#233;cran mise tout sur la discr&#233;tion et la voix, sans n&#233;cessiter d&#8217;abonnement</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/bracelets-connectes/2930365_pour-detroner-whoop-ce-bracelet-sans-ecran-mise-tout-sur-la-discretion-et-la-voix-sans-necessiter-dabonnement</link>
      <pubDate>Tue, 06 Jan 2026 09:48:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/bracelets-connectes/2930365_pour-detroner-whoop-ce-bracelet-sans-ecran-mise-tout-sur-la-discretion-et-la-voix-sans-necessiter-dabonnement</guid>
      <description>
Durant le CES, la marque indienne Luna a d&#233;voil&#233; un nouveau bracelet connect&#233; sans &#233;cran, et sans abonnement, le Luna Band, visant &#224; concurrencer les bracelets Whoop.
</description>
    </item>
    <item>
      <title>What is the release date for The Pitt season 2 episode 1 on HBO Max?</title>
      <link>https://www.techradar.com/streaming/hbo-max/the-pitt-season-2-episode-1-release-date-time</link>
      <pubDate>Tue, 06 Jan 2026 09:45:49 +0000</pubDate>
      <guid isPermaLink="false">EnaxauraNJrRzdShXkCeje</guid>
      <description>It's been a year since our last trip to the emergency room, and the story picks up 10 months on. But when is The Pitt season 2 episode 1 on HBO Max?</description>
    </item>
    <item>
      <title>Galaxy Book 6&#160;: Samsung d&#233;fie le MacBook avec un nouveau design et les derni&#232;res puces Intel</title>
      <link>https://www.01net.com/actualites/galaxy-book-6-samsung-defie-le-macbook-avec-un-nouveau-design-et-les-dernieres-puces-intel.html</link>
      <pubDate>Tue, 06 Jan 2026 09:32:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318297</guid>
      <description>Samsung d&#233;voile sa s&#233;rie Galaxy Book6. Au programme : design sym&#233;trique fa&#231;on Apple, puces Intel surpuissantes et une IA omnipr&#233;sente pour booster votre productivit&#233;. La concurrence est pr&#233;venue.</description>
    </item>
    <item>
      <title>Is this the folding iPhone&amp;#8217;s creaseless display?</title>
      <link>https://www.theverge.com/news/856141/samsung-display-creaseless-panel-foldable-iphone-ces</link>
      <pubDate>2026-01-06T04:25:15-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=856141</guid>
      <description>Samsung Display showcased a new foldable OLED panel at CES that doesn't have a visible crease - something that currently blights every foldable phone on the market. This could be our first look at the panel used in the next generation of Samsung's Galaxy foldables and even the folding iPhone, given that Samsung Display is [&#8230;]</description>
    </item>
  </channel>
</rss>
