<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 27 Nov 2025 14:42:45 GMT</lastBuildDate>
    <item>
      <title>Triple port, 20 000 mAh, 165 W : cette puissante batterie externe perd 40 % de son prix la veille du Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2887935_triple-port-20-000-mah-165-w-cette-puissante-batterie-externe-perd-40-de-son-prix-la-veille-du-black-friday</link>
      <pubDate>Thu, 27 Nov 2025 14:32:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2887935_triple-port-20-000-mah-165-w-cette-puissante-batterie-externe-perd-40-de-son-prix-la-veille-du-black-friday</guid>
      <description>
Compacte, puissante et dot&#233;e d'un c&#226;ble USB-C r&#233;tractable bien pratique, la batterie externe Ugreen Nexode 165 W est un outil qui peut vite se rendre indispensable. En pleine Black Friday Week, vous la trouverez affich&#233;e &#224; 53,41 euros au lieu de 89,99 euros sur Amazon.
</description>
    </item>
    <item>
      <title>The best Black Friday handheld gaming PCs, alongside the Steam Deck, picked by a gaming expert</title>
      <link>https://www.techradar.com/seasonal-sales/the-best-black-friday-handheld-gaming-pcs-alongside-the-steam-deck-picked-by-a-gaming-expert</link>
      <pubDate>Thu, 27 Nov 2025 14:31:32 +0000</pubDate>
      <guid isPermaLink="false">fF8Fyt727mSNfknzKWPcDR</guid>
      <description>The Steam Deck leads Black Friday handheld gaming PC sales, alongside MSI and Lenovo handheld deals, which can save you up to 40%.</description>
    </item>
    <item>
      <title>Why can&#8217;t ChatGPT tell time?</title>
      <link>https://www.theverge.com/report/829137/openai-chatgpt-time-date</link>
      <pubDate>2025-11-27T09:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=829137</guid>
      <description>ChatGPT, like many chatbots, is pitched as a hyper-competent personal assistant. But among the many things that confuse it, one is particularly confounding: It cannot tell time. When I ask ChatGPT what time it is, I'm never quite sure what I'll get. Sometimes, it tells me it can't do it. "I don't have access to [&#8230;]</description>
    </item>
    <item>
      <title>This devious botnet tried a trial run during the recent AWS outage - so when will it be back?</title>
      <link>https://www.techradar.com/pro/security/this-devious-botnet-tried-a-trial-run-during-the-recent-aws-outage-so-when-will-it-be-back</link>
      <pubDate>Thu, 27 Nov 2025 14:27:00 +0000</pubDate>
      <guid isPermaLink="false">xWnKiEGACTihNcthDpMKrZ</guid>
      <description>Another child of Mirai was spotted in the wild - but this one flashed only briefly.</description>
    </item>
    <item>
      <title>Razer has slashed the price of its best mobile controller for Black Friday</title>
      <link>https://www.techradar.com/gaming/razer-has-slashed-the-price-of-its-best-mobile-controller-for-black-friday</link>
      <pubDate>Thu, 27 Nov 2025 14:17:00 +0000</pubDate>
      <guid isPermaLink="false">ZfcAwvwVTdZ8kpoBUACYKo</guid>
      <description>The Kishi Ultra is heavily discounted for Black Friday in both the US and UK.</description>
    </item>
    <item>
      <title>The best wireless headphones, chosen by our experts for all budgets</title>
      <link>https://www.techradar.com/audio/wireless-headphones/the-best-wireless-headphones</link>
      <pubDate>Thu, 27 Nov 2025 14:16:51 +0000</pubDate>
      <guid isPermaLink="false">mhqgjnSCnRZDNTL5D3jYja</guid>
      <description>These are the best Bluetooth headphones we've tested, whatever your budget or your priority.</description>
    </item>
    <item>
      <title>Around 500 million PCs are holding off upgrading to Windows 11, says Dell</title>
      <link>https://www.theverge.com/news/831364/dell-windows-11-upgrade-numbers-earnings-call-q3-2025</link>
      <pubDate>2025-11-27T09:15:20-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=831364</guid>
      <description>Windows users are transitioning to Windows 11 at a slower rate than the upgrade to Windows 10. Microsoft&#8217;s 10-year-old operating system, which just hit the end of support phase, is still proving popular among consumers and businesses. Dell revealed this week that around 500 million machines are capable of upgrading to Windows 11, but are [&#8230;]</description>
    </item>
    <item>
      <title>Black Friday Week : Les smartphones au meilleur rapport qualit&#233;-prix (moins de 500 euros) deviennent encore plus abordables</title>
      <link>https://www.frandroid.com/bons-plans/2856691_black-friday-week-les-smartphones-au-meilleur-rapport-qualite-prix-moins-de-500-euros-deviennent-encore-plus-abordables</link>
      <pubDate>Thu, 27 Nov 2025 14:13:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2856691_black-friday-week-les-smartphones-au-meilleur-rapport-qualite-prix-moins-de-500-euros-deviennent-encore-plus-abordables</guid>
      <description>
Le vrai Black Friday approche mais cela fait d&#233;j&#224; plusieurs semaines que les bons plans s'encha&#238;nent dans l'univers des smartphones. Pour se faire plaisir ou pour offrir &#224; un proche, certains mod&#232;les haut de gamme nous font le plaisir de tomber sous la barre des 500 euros. Les voici.
</description>
    </item>
    <item>
      <title>Voici les 25 meilleures offres du Black Friday, tout simplement</title>
      <link>https://www.frandroid.com/bons-plans/2885171_voici-les-20-meilleures-offres-du-black-friday-tout-simplement</link>
      <pubDate>Thu, 27 Nov 2025 14:11:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2885171_voici-les-20-meilleures-offres-du-black-friday-tout-simplement</guid>
      <description>
Le Black Friday commence officiellement ce vendredi 28 novembre, mais la plupart des marchands comme Amazon, Fnac, Darty ou encore Boulanger, ont d&#233;j&#224; partag&#233; la plupart de leurs offres. Nous vous avons alors pr&#233;par&#233; un petit floril&#232;ge des meilleures promotions disponibles actuellement. 
</description>
    </item>
    <item>
      <title>UBTech strikes deal with China to assist at border crossings, and this isn't a dystopian nightmare at all</title>
      <link>https://www.techradar.com/ai-platforms-assistants/ubtech-strikes-deal-with-china-to-assist-at-border-crossings-and-this-isnt-a-dystopian-nightmare-at-all</link>
      <pubDate>Thu, 27 Nov 2025 14:09:17 +0000</pubDate>
      <guid isPermaLink="false">7oUng72enqjnAyVt4iGykL</guid>
      <description>UBTech Walker S2, one of the first mass-produced humanoid robots, is about to start a border patrol job in China. What does this mean for humanity?</description>
    </item>
    <item>
      <title>&#171;&#160;C&#8217;est du chantage&#160;&#187; : la r&#233;ponse cinglante de Bruxelles aux exigences du gouvernement Trump</title>
      <link>https://www.01net.com/actualites/le-gouvernement-de-donald-trump-revient-a-la-charge-sur-les-lois-numeriques-de-lue.html</link>
      <pubDate>Thu, 27 Nov 2025 14:07:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310931</guid>
      <description>Le ministre am&#233;ricain du Commerce a d&#233;clar&#233;, lors d'une visite &#224; Bruxelles lundi 24 novembre, que l'assouplissement des lois num&#233;riques europ&#233;ennes &#233;tait un pr&#233;alable &#224; toute n&#233;gociation sur l'acier et l'aluminium. Ce malgr&#233; la pr&#233;sentation du projet de simplification des lois num&#233;riques de la Commission europ&#233;enne la semaine derni&#232;re, analys&#233;e comme un geste destin&#233; &#224; apaiser le gouvernement am&#233;ricain... qui n'aura pas suffi....</description>
    </item>
    <item>
      <title>The best OLED TVs for all budgets, as reviewed by our experts</title>
      <link>https://www.techradar.com/televisions/the-best-oled-tvs</link>
      <pubDate>Thu, 27 Nov 2025 14:05:08 +0000</pubDate>
      <guid isPermaLink="false">Q7HriTuMYAvdxKYJ8ANqp5</guid>
      <description>With infinite contrast and phenomenal picture quality, the best OLED TVs will change how you experience your favorite movies and shows.</description>
    </item>
    <item>
      <title>6 Best Smart Speakers (2025): Alexa, Google Assistant, Siri</title>
      <link>https://www.wired.com/story/best-smart-speakers/</link>
      <pubDate>Thu, 27 Nov 2025 14:03:00 +0000</pubDate>
      <guid isPermaLink="false">5a9720a9086151385ac8524e</guid>
      <description>Looking to add a smart speaker to your house so Alexa, Google, or Siri can help you out? Here are the best ones to get.</description>
    </item>
    <item>
      <title>11 Fantastic Movies From 2025 to Catch Up on This Holiday Season</title>
      <link>https://gizmodo.com/best-2025-movies-streaming-scifi-horror-fantasy-thanksgiving-2000690902</link>
      <pubDate>Thu, 27 Nov 2025 14:00:39 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000690902</guid>
      <description>You don't even have to leave the house to see 11 of 2025's best movies.</description>
    </item>
    <item>
      <title>Joachim Trier finds his place</title>
      <link>https://www.theverge.com/entertainment/830079/sentimental-value-joachim-trier-interview</link>
      <pubDate>2025-11-27T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=830079</guid>
      <description>It might surprise you to hear that one of this year's awards season contenders is a Norwegian film. But it's not the first time. In 2022, Joachim Trier's sly, POV-shifting relationship drama The Worst Person in the World snuck into the Academy Awards with nods for Best International Film and Best Original Screenplay. His family-anchored [&#8230;]</description>
    </item>
    <item>
      <title>Cette action cam tout aussi performante qu&#8217;une GoPro n&#8217;a jamais &#233;t&#233; aussi peu ch&#232;re qu&#8217;au Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2584397_cette-action-cam-tout-aussi-performante-quune-gopro-na-jamais-ete-aussi-peu-chere-quau-black-friday</link>
      <pubDate>Thu, 27 Nov 2025 13:58:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2584397_cette-action-cam-tout-aussi-performante-quune-gopro-na-jamais-ete-aussi-peu-chere-quau-black-friday</guid>
      <description>
La DJI Osmo Action 4 baisse r&#233;guli&#232;rement de prix, notamment depuis la sortie du mod&#232;le 5 Pro. Pendant le Black Friday, elle est vendue au rabais : 174 euros seulement au lieu de 419 euros &#224; son lancement. 
</description>
    </item>
    <item>
      <title>The Battlefield 6 week-long free-to-play period is now live &#8211; here's everything you need to know</title>
      <link>https://www.techradar.com/gaming/the-battlefield-6-week-long-free-to-play-period-is-now-live-heres-everything-you-need-to-know</link>
      <pubDate>Thu, 27 Nov 2025 13:57:56 +0000</pubDate>
      <guid isPermaLink="false">qWz79k9CAYtBYiUrY3mukL</guid>
      <description>As Battlefield 6 continues to boast an impressive player count, EA has released the game's first post-launch free trial.</description>
    </item>
    <item>
      <title>I've tested dozens of Chromebooks, and these are the ones I'd actually recommend buying this Black Friday</title>
      <link>https://www.techradar.com/computing/chromebooks/ive-tested-dozens-of-chromebooks-and-these-are-the-ones-id-actually-recommend-buying-this-black-friday</link>
      <pubDate>Thu, 27 Nov 2025 13:57:42 +0000</pubDate>
      <guid isPermaLink="false">8n8aqCzEZjsHuWtVe3XkTi</guid>
      <description>I've been a Chromebook lover for years - these are my top Black Friday Chromebook deals in 2025.</description>
    </item>
    <item>
      <title>La Black Friday Week fait fondre les stocks de smartphones pas chers ! Les meilleurs deals sur les mod&#232;les abordables (moins de 300 &#8364;)</title>
      <link>https://www.frandroid.com/bons-plans/2876001_la-black-friday-week-fait-fondre-les-stocks-de-smartphones-pas-chers-les-meilleurs-deals-sur-les-modeles-abordables-moins-de-300</link>
      <pubDate>Thu, 27 Nov 2025 13:49:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2876001_la-black-friday-week-fait-fondre-les-stocks-de-smartphones-pas-chers-les-meilleurs-deals-sur-les-modeles-abordables-moins-de-300</guid>
      <description>
Pas envie de d&#233;penser des mille et des cents sur un smartphone flambant neuf ? Il est possible de s'offrir un mod&#232;le tout &#224; fait correct avec moins de 300 euros en poche. Et cette s&#233;lection des meilleurs bons plans de la Black Friday Week est bien l&#224; pour vous convaincre.
</description>
    </item>
    <item>
      <title>Want a Garmin Forerunner? I'm begging you to look at this Coros Pace 3 Black Friday deal instead</title>
      <link>https://www.techradar.com/health-fitness/want-a-garmin-forerunner-im-begging-you-to-look-at-this-coros-pace-3-black-friday-deal-instead</link>
      <pubDate>Thu, 27 Nov 2025 13:47:59 +0000</pubDate>
      <guid isPermaLink="false">YTtZELCpMdifJDiJgEB5Bk</guid>
      <description>The Coros Pace 3 just hit a lowest-ever price, but its better value than the Garmin Forerunner 165 on its best day.</description>
    </item>
    <item>
      <title>Le patron de Xpeng le confirme : sa voiture &#233;lectrique chinoise aux 1 600 km d&#8217;autonomie pourrait &#234;tre vendue en Europe</title>
      <link>https://www.frandroid.com/marques/xpeng/2888505_le-patron-de-xpeng-le-confirme-sa-voiture-electrique-chinoise-aux-1-600-km-dautonomie-pourrait-etre-vendue-en-europe</link>
      <pubDate>Thu, 27 Nov 2025 13:47:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2888505_le-patron-de-xpeng-le-confirme-sa-voiture-electrique-chinoise-aux-1-600-km-dautonomie-pourrait-etre-vendue-en-europe</guid>
      <description>
Le constructeur chinois Xpeng envisage d'introduire ses voitures &#233;lectriques &#224; prolongateur d'autonomie en Europe d'ici fin 2026. Une strat&#233;gie qui pourrait s&#233;duire les automobilistes encore r&#233;ticents &#224; passer au 100 % &#233;lectrique.
</description>
    </item>
    <item>
      <title>BMW veut recycler une vieille technologie pour booster l&#8217;autonomie de ses voitures &#233;lectriques</title>
      <link>https://www.frandroid.com/marques/bmw/2888213_bmw-veut-recycler-une-vieille-technologie-pour-booster-lautonomie-de-ses-voitures-electriques</link>
      <pubDate>Thu, 27 Nov 2025 13:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bmw/2888213_bmw-veut-recycler-une-vieille-technologie-pour-booster-lautonomie-de-ses-voitures-electriques</guid>
      <description>
Lanc&#233;e puis abandonn&#233;e quelques ann&#233;es apr&#232;s sur sa petite i3, BMW pourrait relancer l'&#233;lectrique &#224; prolongateur d'autonomie en Chine sur ses mod&#232;les les plus haut de gamme afin de faire face &#224; la concurrence locale. De quoi d&#233;passer les 1 000 km d'autonomie.
</description>
    </item>
    <item>
      <title>7 Best Alexa Speakers (2025): Echo Dot Max, Echo Show 11, Echo Studio</title>
      <link>https://www.wired.com/gallery/best-alexa-and-amazon-echo-speakers/</link>
      <pubDate>Thu, 27 Nov 2025 13:37:00 +0000</pubDate>
      <guid isPermaLink="false">5df1238e4a6a5900092a0c89</guid>
      <description>We&#8217;ve rounded up our favorite smart speakers that let you talk to Alexa, from the popular Echo Dot to the newest Echo Studio.</description>
    </item>
    <item>
      <title>The Apple Watch Series 11 just hit a new best-ever price for Black Friday &#8212; save $60 at Amazon</title>
      <link>https://mashable.com/article/black-friday-deal-2025-apple-watch-series-11</link>
      <pubDate>Thu, 27 Nov 2025 13:31:19 +0000</pubDate>
      <guid isPermaLink="false">008YwvHdirlEIOnvPNd54Mq</guid>
      <description>Get the best Apple Watch deal in Black Friday 2025. The Apple Watch Series 11 is on sale for $339 in the Amazon Black Friday sale.</description>
    </item>
    <item>
      <title>Stranger Things a fait planter Netflix</title>
      <link>https://www.01net.com/actualites/stranger-things-a-fait-planter-netflix.html</link>
      <pubDate>Thu, 27 Nov 2025 13:31:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311722</guid>
      <description>Netflix a fait monter la sauce autour de l'ultime saison de sa s&#233;rie phare, *Stranger Things*&#8230; sans assurer l'intendance derri&#232;re. R&#233;sultat : la horde de fans qui s'est pr&#233;cipit&#233;e sur la premi&#232;re salve d'&#233;pisodes ont &#233;t&#233; accueillis par un &#233;cran noir.</description>
    </item>
    <item>
      <title>Black Friday 2025: Live updates on the latest deals from Amazon, Target, Walmart, and more</title>
      <link>https://mashable.com/live/black-friday-live-deals-updates-amazon-target-walmart-2025</link>
      <pubDate>Thu, 27 Nov 2025 13:29:15 +0000</pubDate>
      <guid isPermaLink="false">07K5cH98cfqENnWlTb2iTIP</guid>
      <description>Get live updates on Black Friday sales. We found savings of $150 on Dyson Supersonic hair dryers, $300 off Samsung TVs, and record prices on AirPods.</description>
    </item>
    <item>
      <title>The awesome Mac mini M4 just dropped to $479 at Best Buy &#8211; that's a new record low</title>
      <link>https://www.techradar.com/computing/macs/the-awesome-mac-mini-m4-just-dropped-to-usd479-at-best-buy-thats-a-new-record-low</link>
      <pubDate>Thu, 27 Nov 2025 13:26:45 +0000</pubDate>
      <guid isPermaLink="false">T54cgQ4dPcUKdi2EcBLAAB</guid>
      <description>The latest Apple Mac mini with M4 chip is the cheapest it's ever been this Black Friday &#8211; don't miss out!</description>
    </item>
    <item>
      <title>A huge Black Friday streaming deal has gone live: Get Paramount+ for $2.99 per month</title>
      <link>https://mashable.com/article/black-friday-deal-2025-streaming-paramount-plus</link>
      <pubDate>Thu, 27 Nov 2025 13:24:54 +0000</pubDate>
      <guid isPermaLink="false">04T1dTrk7nDPGlZ3VrUtz5N</guid>
      <description>The latest Black Friday streaming deal offers two months of Paramount+ Premium or Essential for $2.99 per month.</description>
    </item>
    <item>
      <title>Get up to 47% off AirPods: every AirPods Pro 3, AirPods Pro 2 and AirPods 4 Black Friday deal live now &#8211;run!</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/get-up-to-47-percent-off-airpods-every-airpods-pro-3-airpods-pro-2-and-airpods-4-black-friday-deal-live-now-run</link>
      <pubDate>Thu, 27 Nov 2025 13:24:00 +0000</pubDate>
      <guid isPermaLink="false">SJ55iHAsnhEoWJPD99Vhb4</guid>
      <description>Grab huge discounts on Apple's flagship AirPods today with our lowest-seen prices across all retailers, wherever you live</description>
    </item>
    <item>
      <title>Black Friday VPN : NordVPN, ProtonVPN, ExpressVPN et tous les autres l&#226;chent leurs promotions du Vendredi Noir !</title>
      <link>https://www.frandroid.com/bons-plans/2875107_black-friday-vpn-nordvpn-protonvpn-expressvpn-et-tous-les-autres-lachent-leurs-promotions-du-vendredi-noir</link>
      <pubDate>Thu, 27 Nov 2025 13:22:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2875107_black-friday-vpn-nordvpn-protonvpn-expressvpn-et-tous-les-autres-lachent-leurs-promotions-du-vendredi-noir</guid>
      <description>
Il n'y a pas que les smartphones, &#233;couteurs sans fil, vid&#233;oprojecteurs et consoles de jeux qui profitent du Black Friday. De nombreux services baissent &#233;galement le montant de leurs abonnements tels que les forfaits mobiles, les plateformes de streaming ainsi que les VPN dont voici la s&#233;lection.
</description>
    </item>
    <item>
      <title>The 11-inch Apple iPad has dropped to a new record-low price for Black Friday &#8212; save $75 at Amazon</title>
      <link>https://mashable.com/article/black-friday-deal-2025-11-inch-apple-ipad</link>
      <pubDate>Thu, 27 Nov 2025 13:21:28 +0000</pubDate>
      <guid isPermaLink="false">01AKlSadQ8tGJSWFDpQwwYM</guid>
      <description>Get the best iPad deal over Black Friday. The 11-inch Apple iPad is on sale for $274 in the Amazon Black Friday sale.</description>
    </item>
    <item>
      <title>How to watch Zattoo from anywhere&#8211; stream Zattoo from abroad</title>
      <link>https://www.techradar.com/how-to-watch/how-to-watch-zattoo-from-anywhere</link>
      <pubDate>Thu, 27 Nov 2025 13:17:51 +0000</pubDate>
      <guid isPermaLink="false">njaYuxw5SeH96gWGbGjxjn</guid>
      <description>How to watch Zattoo from anywhere with a VPN. It carries the channels of many of Europe's biggest public service broadcasters, including the BBC, ITV, Channel 4, Rai, ORF and France TV.</description>
    </item>
    <item>
      <title>Design unique et puissance XXL : ce v&#233;lo &#233;lectrique gravel n&#8217;a peur de rien</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2887869_design-unique-et-puissance-xxl-ce-velo-electrique-gravel-na-peur-de-rien</link>
      <pubDate>Thu, 27 Nov 2025 13:16:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2887869_design-unique-et-puissance-xxl-ce-velo-electrique-gravel-na-peur-de-rien</guid>
      <description>
Osant dans la forme de ses cadres comme &#224; son habitude, la firme suisse se lance pour la premi&#232;re fois dans le v&#233;lo &#233;lectrique gravel avec l&#8217;eb1 Panorama, g&#233;n&#233;reux en style autant qu&#8217;en carbone et en assistance.
</description>
    </item>
    <item>
      <title>How to watch TVA Canada from anywhere- stream TVA from outside Canada</title>
      <link>https://www.techradar.com/how-to-watch/watch-tva-canada-from-anywhere</link>
      <pubDate>Thu, 27 Nov 2025 13:09:40 +0000</pubDate>
      <guid isPermaLink="false">7zNcHaPVJdjCEw8824w3v3</guid>
      <description>How to watch TVA Canada from anywhere with a VPN. The free-to-air platform features uniquely French-Canadian TV shows and films, like MasterChef Quebec.</description>
    </item>
    <item>
      <title>L&#8217;excellente manette de la Nintendo Switch 2 est enfin compatible avec vos jeux Steam, mais &#224; une condition</title>
      <link>https://www.frandroid.com/marques/nintendo/2887917_la-manette-switch-2-pro-est-enfin-compatible-avec-steam-mais-a-une-condition</link>
      <pubDate>Thu, 27 Nov 2025 13:09:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nintendo/2887917_la-manette-switch-2-pro-est-enfin-compatible-avec-steam-mais-a-une-condition</guid>
      <description>
Steam vient d'ajouter le support de deux manettes Nintendo pour le jeu sur PC : la manette Switch 2 Pro ainsi que la manette GameCube.
</description>
    </item>
    <item>
      <title>China&#8217;s Alibaba brings removable batteries to the smart glasses race</title>
      <link>https://www.theverge.com/news/831354/alibaba-quark-smart-glasses</link>
      <pubDate>2025-11-27T08:07:54-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=831354</guid>
      <description>Chinese tech giant Alibaba entered the AI-powered smart glasses race on Thursday with the release of its Quark headsets in China. Notably, the batteries can be swapped out for all day usage unlike competitors.&#160; Alibaba said the Quark AI glasses come in two variants, the S1 flagship and the &#8220;lifestyle-focused&#8221; G1, in multiple colors and [&#8230;]</description>
    </item>
    <item>
      <title>Meta Quest 4 : le futur casque VR/MR se pr&#233;cise (et ne s&#8217;appellera pas Quest)</title>
      <link>https://www.frandroid.com/marques/meta/2888219_meta-quest-4-le-futur-casque-vr-mr-se-precise-et-ne-sappellera-pas-quest</link>
      <pubDate>Thu, 27 Nov 2025 13:05:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2888219_meta-quest-4-le-futur-casque-vr-mr-se-precise-et-ne-sappellera-pas-quest</guid>
      <description>
Attendu courant 2026, le prochain casque de r&#233;alit&#233; mixte de Meta, le &#171; Quest 4 &#187;, a fait l'objet d'une intervention d'un v&#233;t&#233;ran de la VR sur X. L'int&#233;ress&#233; corrobore plusieurs informations int&#233;ressantes sur l'appareil.
</description>
    </item>
    <item>
      <title>La guerre des pixels est relanc&#233;e&#160;: Sony d&#233;voile son premier capteur 200 Mpx pour smartphone</title>
      <link>https://www.01net.com/actualites/la-guerre-des-pixels-est-relancee-sony-devoile-son-premier-capteur-200-mpx.html</link>
      <pubDate>Thu, 27 Nov 2025 13:04:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311684</guid>
      <description>Sony d&#233;voile son premier capteur photo de 200 m&#233;gapixels, le LYTIA 901, marquant son entr&#233;e sur un terrain jusqu&#8217;ici r&#233;serv&#233; &#224; Samsung. Plus grand et plus avanc&#233; sur le papier, il promet des images plus d&#233;taill&#233;es et une meilleure gestion de la lumi&#232;re.</description>
    </item>
    <item>
      <title>The best Black Friday MacBook deals - save 25% on my all-time favorite model</title>
      <link>https://www.techradar.com/computing/macbooks/the-best-black-friday-macbook-deals-save-25-percent-on-my-all-time-favorite-model</link>
      <pubDate>Thu, 27 Nov 2025 13:04:21 +0000</pubDate>
      <guid isPermaLink="false">z2Rd8Cq2szyQPFFMDVCj34</guid>
      <description>All the best MacBook Air and MacBook Pro deals, chosen by a diehard Mac fan.</description>
    </item>
    <item>
      <title>The best deals from Apples Black Friday sale: Score savings on AirPods, Apple TV, and gift cards</title>
      <link>https://mashable.com/article/apple-store-black-friday-cyber-monday-sale-2025-gift-cards</link>
      <pubDate>Thu, 27 Nov 2025 13:03:56 +0000</pubDate>
      <guid isPermaLink="false">06d6WPOWtCh2K5xkhV70UqG</guid>
      <description>The best Black Friday deals from Apple's Black Friday sale 2025. Find deals on AirPods, MacBooks, Gift Cards, and much more.</description>
    </item>
    <item>
      <title>Beat the DJI ban before it hits with this incredible Mavic 3 Pro Black Friday saving, now $1,200 off</title>
      <link>https://www.techradar.com/cameras/drones/beat-the-dji-ban-before-it-hits-with-this-incredible-mavic-3-pro-black-friday-saving-now-usd1-200-off</link>
      <pubDate>Thu, 27 Nov 2025 13:02:01 +0000</pubDate>
      <guid isPermaLink="false">uRCYmwDaYcRf6KF94rGydZ</guid>
      <description>B&amp;H Photo has slashed the price of the triple-camera Mavic 3 Pro Fly More Combo with pro controller drone kit, which is now $2,689 (was $3,889)</description>
    </item>
    <item>
      <title>Black Friday : Dreame d&#233;gaine des promotions rarement vues sur ses mod&#232;les premium [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/aspirateurs-balais-sans-fil/aspirateur-laveur/2880955_black-friday-dreame-degaine-des-promotions-rarement-vues-sur-ses-modeles-premium</link>
      <pubDate>Thu, 27 Nov 2025 13:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/aspirateurs-balais-sans-fil/aspirateur-laveur/2880955_black-friday-dreame-degaine-des-promotions-rarement-vues-sur-ses-modeles-premium</guid>
      <description>
Dreame lance ses offres du Black Friday avec des remises massives sur ses aspirateurs et robots premium, avec des r&#233;ductions pouvant atteindre 1 200 euros. Si vous aviez pr&#233;vu de vous &#233;quiper ou d&#8217;automatiser une partie du m&#233;nage, la p&#233;riode ne pouvait pas mieux tomber.
</description>
    </item>
    <item>
      <title>Chinese Robot Sets Guinness World Record With 66-Mile Walk</title>
      <link>https://gizmodo.com/chinese-robot-sets-guinness-world-record-with-66-mile-walk-2000692336</link>
      <pubDate>Thu, 27 Nov 2025 13:00:45 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000692336</guid>
      <description>The U.S.-China robot race is getting more literal.</description>
    </item>
    <item>
      <title>The Dell 14 Plus Just Hit a New Rock Bottom Price (2025)</title>
      <link>https://www.wired.com/story/dell-14-plus-black-friday-2025/</link>
      <pubDate>Thu, 27 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">6920d8f075beddc93cd6818a</guid>
      <description>With a new low price, Dell just launched the best laptop deal from Black Friday I've seen so far.</description>
    </item>
    <item>
      <title>My favorite e-reader is at its lowest price ever for Black Friday</title>
      <link>https://www.theverge.com/gadgets/828242/kobo-libra-colour-e-reader-black-friday-deal-sale-2025</link>
      <pubDate>2025-11-27T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=828242</guid>
      <description>Amazon&#8217;s Kindle Colorsoft Signature Edition might be heavily discounted for Black Friday, but we&#8217;d argue that the Kobo Libra Colour is actually the better option for those not already embedded in the Amazon ecosystem. It offers more features for slightly less &#8212; and right now, the color e-reader has returned to its all-time low of [&#8230;]</description>
    </item>
    <item>
      <title>Pluribus gets even more lonely &#8212; and dangerous &#8212; in episode 5</title>
      <link>https://www.theverge.com/tech/829885/pluribus-episode-5-discussion-apple-tv</link>
      <pubDate>2025-11-27T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=829885</guid>
      <description>After the last two episodes of Pluribus - in which Carol (Rhea Seehorn) was involved with an exploding hand grenade and an ill-advised truth serum - I couldn't help but wonder just how long the hive mind would tolerate her destructive ways. Well, here we are in episode 5, and I have an answer. "We [&#8230;]</description>
    </item>
    <item>
      <title>20 superb 4K monitors under $200 you must check out this Black Friday</title>
      <link>https://www.techradar.com/computing/monitors/20-superb-4k-monitors-under-usd200-you-must-check-out-this-black-friday</link>
      <pubDate>Thu, 27 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">wtURwLLPVUSBefbNAs2UpQ</guid>
      <description>Save up to 20% on the world's cheapest 4K monitor at just $95 and grab a 55-inch display for less than $170 this Black Friday.</description>
    </item>
    <item>
      <title>Galaxy Buds 3 Pro &#224; 109 &#8364; : Samsung casse le prix de ses meilleurs &#233;couteurs et &#231;a vaut le coup</title>
      <link>https://www.frandroid.com/marques/samsung/2888519_galaxy-buds-3-pro-a-109-e-samsung-casse-le-prix-de-ses-meilleurs-ecouteurs-et-ca-vaut-le-coup</link>
      <pubDate>Thu, 27 Nov 2025 12:59:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2888519_galaxy-buds-3-pro-a-109-e-samsung-casse-le-prix-de-ses-meilleurs-ecouteurs-et-ca-vaut-le-coup</guid>
      <description>
&#192; leur sortie, on a beaucoup ri du design "AirPods-like" et de ces lumi&#232;res sur les tiges. Mais aujourd'hui, le rire laisse place &#224; la stup&#233;faction.
</description>
    </item>
    <item>
      <title>NordVPN is compatible with new Amazon Fire Sticks &#8211; and it's up to 77% off this Black Friday</title>
      <link>https://www.techradar.com/vpn/vpn-services/this-is-one-of-the-only-vpn-compatible-with-new-amazon-fire-sticks-and-its-up-to-77-percent-off-this-black-friday</link>
      <pubDate>Thu, 27 Nov 2025 12:56:41 +0000</pubDate>
      <guid isPermaLink="false">uNaayVTD2uXcNyFwJVsJr8</guid>
      <description>If you are picking up the latest Amazon Fire TV Stick this Black Friday, you might be in for a surprise regarding app compatibility. Here is the best way to secure your streaming and save money doing it.</description>
    </item>
    <item>
      <title>Score an eye-catching Black Friday deal on an eye-catching TV &#8212; $350 off the Hisense 55-inch CanvasTV</title>
      <link>https://mashable.com/article/black-friday-deal-2025-hisense-canvas-tv-55-inch</link>
      <pubDate>Thu, 27 Nov 2025 12:51:03 +0000</pubDate>
      <guid isPermaLink="false">034luzYCzE9bsCgV8Skh8jy</guid>
      <description>Get $350 off the Hisense 55-inch CanvasTV for Black Friday. Now priced at $649.99 at Amazon.</description>
    </item>
  </channel>
</rss>
