<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 22 Feb 2026 08:38:21 GMT</lastBuildDate>
    <item>
      <title>Bon plan : le pack Samsung Galaxy A56 et la montre Fit 3 chute &#224; 419 euros</title>
      <link>https://www.frandroid.com/bons-plans/2982853_bon-plan-le-pack-samsung-galaxy-a56-et-la-montre-fit-3-chute-a-419-euros</link>
      <pubDate>Sun, 22 Feb 2026 08:34:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2982853_bon-plan-le-pack-samsung-galaxy-a56-et-la-montre-fit-3-chute-a-419-euros</guid>
      <description>
Derri&#232;re la gamme des Galaxy S, les Galaxy A ont trouv&#233; leur place sur le march&#233; du milieu de gamme gr&#226;ce &#224; des smartphones offrant des performances correctes au quotidien. Boulanger l'accompagne de la montre connect&#233;e, la Samsung Galaxy Fit 3 et l'ensemble chute &#224; 419 euros.
</description>
    </item>
    <item>
      <title>Fuite de donn&#233;es bancaires&#160;: comment prot&#233;ger votre compte en banque des arnaques&#160;?</title>
      <link>https://www.01net.com/actualites/fuite-de-donnees-bancaires-comment-proteger-votre-compte-en-banque-des-arnaques.html</link>
      <pubDate>Sun, 22 Feb 2026 08:17:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326863</guid>
      <description>Un pirate a r&#233;ussi &#224; p&#233;n&#233;trer dans le FICOBA, le fichier national des comptes bancaires, et &#224; d&#233;rober les donn&#233;es de 1,2 million de comptes. RIB, IBAN, adresses... des donn&#233;es tr&#232;s sensibles ont &#233;t&#233; compromises. Voici ce que vous risquez concr&#232;tement, et comment prot&#233;ger votre compte en banque contre les cyberattaques.</description>
    </item>
    <item>
      <title>Oubliez Waze et Google Maps, on a test&#233; le GPS fran&#231;ais qui cartonne</title>
      <link>https://www.01net.com/actualites/oubliez-waze-et-google-maps-on-a-teste-le-gps-francais-qui-cartonne.html</link>
      <pubDate>Sun, 22 Feb 2026 08:14:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326898</guid>
      <description>Au pays des applis de navigation, Waze et Google Maps ont largement le monopole dans le quotidien des utilisateurs. Mais un concurrent fran&#231;ais, qui semble &#224; tirer son &#233;pingle du jeu, commence &#224; s&#8217;imposer sur le podium des applis de navigation sur l&#8217;App Store et le Google Play Store.</description>
    </item>
    <item>
      <title>How to watch BAFTAs 2026 for *FREE* &#8212; stream 79th British Academy Film Awards from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/how-to-watch-baftas-2026-for-free-stream-79th-british-academy-film-awards-from-anywhere</link>
      <pubDate>Sun, 22 Feb 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">pje6H4yUEjTE4gjveHgA9M</guid>
      <description>With Emma Stone, Ethan Hawke, Leonardo DiCaprio, Michael B. Jordan, Timothee Chalamet, Jessie Buckley and Paul Mescal amongst the nominees, here's how to watch BAFTAs 2026 for free.</description>
    </item>
    <item>
      <title>How to watch Men's Ice Hockey Final: Stream USA vs Canada for free, TV Channels, Preview</title>
      <link>https://www.techradar.com/how-to-watch/sport/mens-ice-hockey-final-stream-usa-vs-canada-free</link>
      <pubDate>Sun, 22 Feb 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">CwpzsiMUscPMiDsnbRbqsb</guid>
      <description>All the ways to watch Winter Olympics men's ice hockey final 2026 live streams for FREE, to see which hockey superpower will prevail in last event of the games.</description>
    </item>
    <item>
      <title>Alerte&#160;: 3 milliards d&#8217;adresses mail ont &#233;t&#233; compromises et diffus&#233;es sur le dark web</title>
      <link>https://www.01net.com/actualites/3-milliards-adresses-mail-compromises-diffusees-dark-web.html</link>
      <pubDate>Sun, 22 Feb 2026 07:13:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326109</guid>
      <description>Un cybercriminel a diffus&#233; 6,8 milliards d'adresses e-mail sur le dark web. Apr&#232;s analyse, les experts estiment que 3 milliards d'entre elles sont valides. Ces donn&#233;es vont servir &#224; alimenter des campagnes de phishing massives et acc&#233;l&#233;rer les cyberattaques. Le pirate pr&#233;tend agir en lanceur d'alerte et incite les victimes &#224; changer leurs mots de passe....</description>
    </item>
    <item>
      <title>Essai Porsche Macan GTS&#160;: on a test&#233; le SUV &#233;lectrique &#224; plus de 100&#160;000 euros</title>
      <link>https://www.01net.com/actualites/essai-porsche-macan-gts-on-a-teste-le-suv-electrique-a-plus-de-100-000-euros.html</link>
      <pubDate>Sun, 22 Feb 2026 07:12:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327081</guid>
      <description>Le SUV le plus populaire de Porsche est pass&#233; en &#233;lectrique et nous on l'a test&#233;. Voici l'essai de la version GTS.</description>
    </item>
    <item>
      <title>Dyson worked out how to make a teeny tiny motor, and now it just can't stop miniaturizing its appliances</title>
      <link>https://www.techradar.com/home/vacuums/dyson-worked-out-how-to-make-a-teeny-tiny-motor-and-now-it-just-cant-stop-miniaturizing-its-appliances</link>
      <pubDate>Sun, 22 Feb 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">KwnQf8in5p7DJgtmjXav8J</guid>
      <description>A new ultra-streamlined appliance has joined the Dyson lineup, and I can't wait to see what it shrinks down next.</description>
    </item>
  </channel>
</rss>
