<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 26 Dec 2025 11:22:48 GMT</lastBuildDate>
    <item>
      <title>La dure prise de conscience de Microsoft : Copilot serait loin d&#8217;avoir le succ&#232;s escompt&#233; (mais la firme d&#233;ment)</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/microsoft-copilot/2921171_la-dure-prise-de-conscience-de-microsoft-copilot-serait-loin-davoir-le-succes-escompte-mais-la-firme-dement</link>
      <pubDate>Fri, 26 Dec 2025 11:16:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/microsoft-copilot/2921171_la-dure-prise-de-conscience-de-microsoft-copilot-serait-loin-davoir-le-succes-escompte-mais-la-firme-dement</guid>
      <description>
Des sources chez Microsoft expliquent que la firme fait face &#224; des chiffres d&#233;cevants pour Copilot, mais la firme d&#233;ment officiellement ces informations.
</description>
    </item>
    <item>
      <title>L&#8217;iPhone Air 2 en avance&#160;? Apple serait press&#233; de corriger ses erreurs d&#232;s 2026</title>
      <link>https://www.01net.com/actualites/liphone-air-2-en-avance-apple-serait-presse-de-corriger-ses-erreurs-des-2026.html</link>
      <pubDate>Fri, 26 Dec 2025 11:04:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317296</guid>
      <description>Rebondissement dans le calendrier d'Apple. Alors que les derni&#232;res rumeurs annon&#231;aient un report de l'iPhone Air 2 au printemps 2027 suite &#224; l'&#233;chec commercial du premier mod&#232;le, de nouvelles informations sugg&#232;rent qu'Apple pourrait finalement d&#233;gainer plus t&#244;t que pr&#233;vu. Le successeur du smartphone ultra-fin serait d&#233;sormais attendu d&#232;s septembre 2026....</description>
    </item>
    <item>
      <title>&#8216;We Ain&#8217;t Seen Nothing Yet&#8217;&#8212;Trump&#8217;s Mass Deportations Will Only Grow From Here</title>
      <link>https://www.wired.com/story/expired-tired-wired-constitutional-sheriffs/</link>
      <pubDate>Fri, 26 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">691cb37da03cadd1b9e06b08</guid>
      <description>Militias and far-right extremists believed they would be central to Trump&#8217;s mass deportation plans. Instead he militarized law enforcement agencies.</description>
    </item>
    <item>
      <title>I&#8217;ve been playing Plants vs Zombies for years, and this remake is the definitive edition &#8212; with a catch</title>
      <link>https://www.techradar.com/gaming/plants-vs-zombies-replanted-review</link>
      <pubDate>Fri, 26 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">5wwEyyiMuAw5Tj3kJzifGH</guid>
      <description>Plants vs. Zombies: Replanted: Replanted pulls all the flora vs walking dead gaming together in definitive package, but arguably lacks the purity of the 2009 original game.</description>
    </item>
    <item>
      <title>Harmon Kardon Luna : cette puissante et &#233;l&#233;gante enceinte Bluetooth est enfin &#224; moiti&#233; prix</title>
      <link>https://www.frandroid.com/bons-plans/2880069_harmon-kardon-luna-cette-puissante-et-elegante-enceinte-bluetooth-est-enfin-a-moitie-prix</link>
      <pubDate>Fri, 26 Dec 2025 10:48:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2880069_harmon-kardon-luna-cette-puissante-et-elegante-enceinte-bluetooth-est-enfin-a-moitie-prix</guid>
      <description>
L'enceinte nomade Harman Kardon Luna a beau &#234;tre un petit gabarit, elle se r&#233;v&#232;le &#233;tonnamment puissante et vraiment pr&#233;cise. La bonne nouvelle, c'est que Boulanger l'affiche &#224; 89,99 euros au lieu de 179,99 euros, soit 50 % de remise imm&#233;diate.
</description>
    </item>
    <item>
      <title>Xiaomi 17 Ultra&#160;: le coup de gr&#226;ce photographique qui veut enterrer l&#8217;iPhone</title>
      <link>https://www.01net.com/actualites/xiaomi-17-ultra-le-coup-de-grace-photographique-qui-veut-enterrer-liphone.html</link>
      <pubDate>Fri, 26 Dec 2025 10:34:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317314</guid>
      <description>Si les Xiaomi 17 et 17 Pro Max ont pos&#233; les bases de l'offensive contre Apple, le mod&#232;le Ultra d&#233;voil&#233; ce 25 d&#233;cembre en est l'arme fatale. Avec un t&#233;l&#233;objectif p&#233;riscopique de 200 m&#233;gapixels et une &#233;dition Leica munie d'une v&#233;ritable bague m&#233;canique, le constructeur chinois ne cherche plus seulement &#224; concurrencer l'iPhone, mais &#224; le rendre obsol&#232;te sur le terrain de la photo....</description>
    </item>
    <item>
      <title>Comparisons Between Waymo and Tesla Miss How Strange the Robotaxi Race Is</title>
      <link>https://gizmodo.com/comparisons-between-waymo-and-tesla-miss-how-strange-the-robotaxi-race-is-2000703406</link>
      <pubDate>Fri, 26 Dec 2025 10:30:50 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703406</guid>
      <description>Elon Musk is making wackier promises than Very Serious People seem to realize.</description>
    </item>
    <item>
      <title>HP ZBook 8 Gli 14-Inch Review: An Unimpressive Workstation</title>
      <link>https://www.wired.com/review/hp-zbook-8-gli-14-inch/</link>
      <pubDate>Fri, 26 Dec 2025 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">69495502923ea800f6470b08</guid>
      <description>Billed as a workstation (and priced accordingly), HP&#8217;s Zbook 8 falls short of dazzling.</description>
    </item>
    <item>
      <title>Gmail may finally be giving users the chance to change their primary email address</title>
      <link>https://www.techradar.com/computing/gmail-may-finally-be-giving-users-the-chance-to-change-their-primary-email-address</link>
      <pubDate>Fri, 26 Dec 2025 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">GAeke92HjQ7C3mrb7ucAbM</guid>
      <description>It seems Google is rolling out the ability to set a new primary @gmail.com account, while keeping your old one.</description>
    </item>
    <item>
      <title>I tested the We Are Rewind boombox &#8211; and it rekindled joyful memories of splicing together mixtapes</title>
      <link>https://www.techradar.com/audio/wireless-bluetooth-speakers/i-tested-the-we-are-rewind-boombox-and-it-rekindled-joyful-memories-of-splicing-together-mixtapes</link>
      <pubDate>Fri, 26 Dec 2025 10:27:00 +0000</pubDate>
      <guid isPermaLink="false">wb3UFFwKuygAskLa39xvG5</guid>
      <description>We Are Rewind&#8217;s GB-001 boombox is perfect for recording mixtapes and blasting bass.</description>
    </item>
    <item>
      <title>The Brick screen time blocker is an even better value when multiple people use it</title>
      <link>https://mashable.com/article/brick-screen-time-multi-user-hack</link>
      <pubDate>Fri, 26 Dec 2025 10:05:45 +0000</pubDate>
      <guid isPermaLink="false">03jPbSoLtda4IDfUXps13Zq</guid>
      <description>Can multiple people use the same Brick? Luckily, yes. Here's how to share your Brick with other people.</description>
    </item>
    <item>
      <title>&#171;&#160;D&#233;sol&#233;, mais nous n&#8217;allons pas revenir sur notre r&#233;glementation&#160;&#187; sur le Num&#233;rique, tacle la num&#233;ro 2 de Bruxelles</title>
      <link>https://www.01net.com/actualites/desole-mais-nous-nallons-pas-revenir-sur-notre-reglementation-sur-le-numerique-tacle-la-numero-2-de-bruxelles.html</link>
      <pubDate>Fri, 26 Dec 2025 10:05:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317281</guid>
      <description>Pour Teresa Ribera, la Commissaire europ&#233;enne charg&#233;e de la Concurrence, l'Union europ&#233;enne doit &#233;couter, mais ne jamais c&#233;der aux exigences de l'administration am&#233;ricaine.</description>
    </item>
    <item>
      <title>Xiaomi 17 Ultra : une bonne et une mauvaise nouvelle pour la France</title>
      <link>https://www.frandroid.com/marques/xiaomi/2921101_xiaomi-17-ultra-une-bonne-et-une-mauvaise-nouvelle-pour-la-france</link>
      <pubDate>Fri, 26 Dec 2025 10:01:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2921101_xiaomi-17-ultra-une-bonne-et-une-mauvaise-nouvelle-pour-la-france</guid>
      <description>
On a de tr&#232;s bonnes raisons d'esp&#233;rer une sortie du Xiaomi 17 Ultra en France, mais comme pour son pr&#233;d&#233;cesseur, un compromis serait fait sur la batterie.
</description>
    </item>
    <item>
      <title>The best SSDs for PS5 in 2026</title>
      <link>https://www.engadget.com/gaming/playstation/best-ssd-for-ps5-130004175.html?src=rss</link>
      <pubDate>Fri, 26 Dec 2025 10:00:35 +0000</pubDate>
      <guid isPermaLink="false">e75133dc-8c16-459b-9bf8-6f3892cd7c77</guid>
      <description>Storage fills up fast on a PS5, especially when a single game can take up as much space as an entire last-gen library. Adding moreSSD space is the easiest way to stop playing Tetris with your installs, and once it is set up, your console loads games just as quickly as it does from the built-in drive. It is a small upgrade that makes a big difference if you jump between several titles at once.The tricky part is knowing which SSDs actually work with the PS5. You need a drive that meets Sony&#8217;s speed requirements and stays cool under long play sessions. Some models include a heatsink, while others...</description>
    </item>
    <item>
      <title>Massive Boxing Day sale is live at Amazon UK &#8212; here are the 28 best deals picked by a shopping expert</title>
      <link>https://www.techradar.com/seasonal-sales/massive-boxing-day-sale-is-live-at-amazon-uk-here-are-the-27-best-deals-picked-by-a-shopping-expert</link>
      <pubDate>Fri, 26 Dec 2025 10:00:18 +0000</pubDate>
      <guid isPermaLink="false">TW7SDRh3FvrbDFj9tAA4wD</guid>
      <description>I've searched through the Boxing Day sale at Amazon UK and hand-picked the 28 best deals on appliances, laptops, TVs, and more top tech.</description>
    </item>
    <item>
      <title>More Than 50 People Became AI Billionaires in 2025</title>
      <link>https://gizmodo.com/more-than-50-people-became-ai-billionaires-in-2025-2000703396</link>
      <pubDate>Fri, 26 Dec 2025 10:00:03 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703396</guid>
      <description>AI hype has lost its luster, but a lot of AI people are super rich now.</description>
    </item>
    <item>
      <title>&#8216;Meme depression,&#8217; Ghibli-gate, 6-7: An internet-culture roundup for 2025</title>
      <link>https://www.fastcompany.com/91464167/meme-depression-ghibli-gate-6-7-internet-culture-2025</link>
      <pubDate>2025-12-26T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464167/meme-depression-ghibli-gate-6-7-internet-culture-2025</guid>
      <description>In a divided time, the biggest moments in digital life brought us together this year. 
For the chronically online, 2025 was the year of &#8220;brain rot&#8221;, AI slop, and &#8220;rage bait,&#8221; a time of consuming Labubu matcha Dubai chocolate to the sound of &#8220;nothing beats a Jet2 holiday&#8221;&#160;and &#8220;six-seven,&#8221; on repeat, as a form of torture.&#160;</description>
    </item>
    <item>
      <title>Keep a scanner in your pocket with this handy app &#8212; now $28 for life</title>
      <link>https://mashable.com/article/dec-26-iscanner-app-lifetime-subscription</link>
      <pubDate>Fri, 26 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">03TizmejndOirt2DXL67fbu</guid>
      <description>Digitize anything from anywhere with this lifetime subscription to the iScanner App, on sale now for just $27.99 (reg. $199.90) with code FLASH through Jan. 11.</description>
    </item>
    <item>
      <title>Make PDFs do exactly what you want forever with one $24 payment</title>
      <link>https://mashable.com/article/dec-26-pdf-converter-pro-lifetime-license</link>
      <pubDate>Fri, 26 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">04rGvmypw8HyjGGAwmechgJ</guid>
      <description>Get a lifetime PDF Converter &amp; Editor license for $23.99 (reg. $99.99) and take full control of your document workflow.</description>
    </item>
    <item>
      <title>Samsung Galaxy Z Flip 7 vs Samsung Galaxy Z Flip 6&#160;: comment choisir le meilleur smartphone pliant &#224; clapet&#160;?</title>
      <link>https://www.frandroid.com/versus/2762871_samsung-galaxy-z-flip-7-vs-samsung-galaxy-z-flip-6-comment-choisir-le-meilleur-smartphone-pliant-a-clapet</link>
      <pubDate>Fri, 26 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/versus/2762871_samsung-galaxy-z-flip-7-vs-samsung-galaxy-z-flip-6-comment-choisir-le-meilleur-smartphone-pliant-a-clapet</guid>
      <description>
Les Z Flip de chez Samsung sont les smartphones pliants les plus vendus au monde. Proposant un entre-deux original entre les smartphones et les t&#233;l&#233;phones &#224; clapet des ann&#233;es 2000, ils s&#233;duisent tout type de public. Alors comment s'en sort le Samsung Galaxy Z Flip 7 par rapport &#224; son pr&#233;d&#233;cesseur&#160;?
</description>
    </item>
    <item>
      <title>Un syst&#232;me de Garmin fait atterrir un avion sans pilote</title>
      <link>https://www.01net.com/actualites/un-systeme-de-garmin-fait-atterrir-un-avion-sans-pilote.html</link>
      <pubDate>Fri, 26 Dec 2025 09:36:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317307</guid>
      <description>Un avion l&#233;ger en situation d'urgence a pu compter sur le syst&#232;me Autoland de Garmin pour effectuer un atterrissage sans intervention ses pilotes.</description>
    </item>
    <item>
      <title>Xiaomi's 17 Ultra Leica Edition smartphone comes with a manual zoom ring</title>
      <link>https://www.engadget.com/mobile/smartphones/xiaomis-17-ultra-leica-edition-smartphone-comes-with-a-manual-zoom-ring-093502893.html?src=rss</link>
      <pubDate>Fri, 26 Dec 2025 09:35:02 +0000</pubDate>
      <guid isPermaLink="false">d606a47e-5a7a-4677-845a-45a0f7212978</guid>
      <description>Xiaomi just launched its flagship 17 Ultra by Leica phone that may make you feel bad about your current device's cameras. Naturally it's a spec monster, with a 1-inch sensor 50MP f/1.67 main camera and 1/1.4-inch 200MP periscope telephoto camera. But it also offers an interesting new mechanical feature: a manual zoom ring that also activates the camera automatically when you rotate it.
Both the regular Xiaomi 17 Ultra and Leica edition come with a Snapdragon 8 Elite Gen 5 SoC with up to 16GB of LPDDR5X RAM and 1TB of UFS 4.1 storage, along with a 6.9-inch 120Hz AMOLED display that can hit up t...</description>
    </item>
  </channel>
</rss>
