<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 16 Jan 2026 15:29:15 GMT</lastBuildDate>
    <item>
      <title>Kathleen Kennedy Says Rian Johnson Was &#8216;Spooked&#8217; From His &#8216;Star Wars&#8217; Return</title>
      <link>https://gizmodo.com/kathleen-kennedy-rian-johnson-last-jedi-star-wars-2000711065</link>
      <pubDate>Fri, 16 Jan 2026 15:26:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711065</guid>
      <description>Speaking as she departs as Lucasfilm president, Kennedy didn't outright confirm Johnson's potential trilogy of films was truly dead&#8212;but suggested the 'Last Jedi' backlash pushed the director away for the forseeable future.</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver : les PC portables bureautiques et gaming se plient en deux pour proposer les meilleurs prix !</title>
      <link>https://www.frandroid.com/bons-plans/2935325_soldes-dhiver-les-pc-portables-bureautiques-et-gaming-se-plient-en-deux-pour-proposer-les-meilleurs-prix</link>
      <pubDate>Fri, 16 Jan 2026 15:19:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2935325_soldes-dhiver-les-pc-portables-bureautiques-et-gaming-se-plient-en-deux-pour-proposer-les-meilleurs-prix</guid>
      <description>
Les soldes d'hiver 2026 ont d&#233;marr&#233; depuis plus d'une semaine et on trouve de tr&#232;s belles offres, notamment du c&#244;t&#233; des PC portables. Que vous chercher une machine pour faire tourner vos jeux AAA ou d'un laptop ultrafin et performant pour bosser, vous devriez trouver votre bonheur dans cette s&#233;lection. 
</description>
    </item>
    <item>
      <title>Le MacBook Pro avec &#233;cran Oled arriverait plus t&#244;t que pr&#233;vu</title>
      <link>https://www.frandroid.com/marques/apple/2945783_le-macbook-pro-avec-ecran-oled-arriverait-plus-tot-que-prevu</link>
      <pubDate>Fri, 16 Jan 2026 15:17:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2945783_le-macbook-pro-avec-ecran-oled-arriverait-plus-tot-que-prevu</guid>
      <description>
La production des dalles OLED pour les futurs MacBook Pro aurait pris de l'avance, promettant une machine radicalement nouvelle d&#232;s cette ann&#233;e.
</description>
    </item>
    <item>
      <title>5 income streams you can add to your website right now</title>
      <link>https://www.techradar.com/pro/software-services/5-income-streams-you-can-add-to-your-website-right-now</link>
      <pubDate>Fri, 16 Jan 2026 15:16:43 +0000</pubDate>
      <guid isPermaLink="false">v8rDVV9YWbgNBVEKBcGta9</guid>
      <description>Discover five practical ways to monetize your website using built-in tools from popular website builders like Wix, Hostinger, and WordPress.</description>
    </item>
    <item>
      <title>The key to the UK's AI success lies in closing the skills gap</title>
      <link>https://www.techradar.com/pro/the-key-to-the-uks-ai-success-lies-in-closing-the-skills-gap</link>
      <pubDate>Fri, 16 Jan 2026 15:16:16 +0000</pubDate>
      <guid isPermaLink="false">vYAEbBzrUW6DWC8wfXb2MH</guid>
      <description>The UK&#8217;s ambition to become a global AI superpower is being stifled by a widening skills gap.</description>
    </item>
    <item>
      <title>La crise de la RAM fait bondir les ventes de PC, mais &#231;a ne va clairement pas durer</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/2945719_la-crise-de-la-ram-fait-bondir-les-ventes-de-pc-mais-ca-ne-va-clairement-pas-durer</link>
      <pubDate>Fri, 16 Jan 2026 15:15:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/2945719_la-crise-de-la-ram-fait-bondir-les-ventes-de-pc-mais-ca-ne-va-clairement-pas-durer</guid>
      <description>
L'ann&#233;e 2025 se termine bien pour les revendeurs de PC avec une belle augmentation des ventes.
</description>
    </item>
    <item>
      <title>I tested the ProtoArc Flexer Pro - a comfortable office chair with lumbar support that's going to be divisive</title>
      <link>https://www.techradar.com/pro/protoarc-flexer-pro-se-office-chair-review</link>
      <pubDate>Fri, 16 Jan 2026 15:15:00 +0000</pubDate>
      <guid isPermaLink="false">tqC5ownMdjjUhkoJ7KHVEQ</guid>
      <description>A classic ergonomic office chair with a surprisingly comfortable price tag.</description>
    </item>
    <item>
      <title>"It does look like a giant donut": IKEA's latest Varmblixt smart light is a viral sensation, but it's not the only show-stopping product coming in 2026</title>
      <link>https://www.techradar.com/home/smart-home/it-does-look-like-a-giant-donut-ikeas-latest-varmblixt-smart-light-is-a-viral-sensation-but-its-not-the-only-show-stopping-product-coming-in-2026</link>
      <pubDate>Fri, 16 Jan 2026 15:15:00 +0000</pubDate>
      <guid isPermaLink="false">Rk5hd9VyT2Rc3ssjsdjqRA</guid>
      <description>As discussed on the TechRadar Podcast it's clear that IKEA was the big winner of CES 2026.</description>
    </item>
    <item>
      <title>AMD pourrait transformer ses processeurs Ryzen avec cette nouvelle technologie</title>
      <link>https://www.frandroid.com/marques/amd/2945807_amd-pourrait-transformer-ses-processeurs-ryzen-avec-cette-nouvelle-technologie</link>
      <pubDate>Fri, 16 Jan 2026 15:04:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amd/2945807_amd-pourrait-transformer-ses-processeurs-ryzen-avec-cette-nouvelle-technologie</guid>
      <description>
AMD pr&#233;pare peut&#8209;&#234;tre la prochaine grosse &#233;volution de ses processeurs Ryzen X3D. Un nouveau brevet laisse entendre que la c&#233;l&#232;bre 3D V&#8209;Cache pourrait aller encore plus loin, avec une hi&#233;rarchie de cache repens&#233;e pour gagner en puissance et en efficacit&#233;.
</description>
    </item>
    <item>
      <title>Italy investigates Activision Blizzard for pushing in-game purchases</title>
      <link>https://techcrunch.com/2026/01/16/italy-investigates-activision-blizzard-for-pushing-in-game-purchases/</link>
      <pubDate>Fri, 16 Jan 2026 15:02:49 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083320</guid>
      <description>Italy has launched two investigations into Microsoft's Activision Blizzard, alleging the company has engaged in "misleading and aggressive" sales practices for two of its most popular smartphone games.</description>
    </item>
    <item>
      <title>Fuite de donn&#233;es au Service Public&#160;: 160&#160;000 documents administratifs ont &#233;t&#233; pirat&#233;s, c&#8217;est officiel</title>
      <link>https://www.01net.com/actualites/fuite-donnees-service-public-pieces-justificatives-identifiants-ont-ete-compromis.html</link>
      <pubDate>Fri, 16 Jan 2026 15:01:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320314</guid>
      <description>Service-public.gouv.fr, le portail pour les d&#233;marches administratives en ligne, vient d&#8217;&#234;tre victime d'une fuite de donn&#233;es. Suite &#224; un incident chez un sous-traitant, des identifiants et des documents sensibles ont &#233;t&#233; compromis.</description>
    </item>
    <item>
      <title>This 3D-scanned insole is another example of placebo tech</title>
      <link>https://www.theverge.com/column/863144/optimizer-groov-insoles-shoes-wearables-wellness-placebo-tech</link>
      <pubDate>2026-01-16T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=863144</guid>
      <description>This is Optimizer, a weekly newsletter sent every Friday from Verge senior reviewer Victoria Song that dissects and discusses the latest phones, smartwatches, apps, and other gizmos that swear they're going to change your life. Optimizer arrives in our subscribers' inboxes at 10AM ET. Opt in for Optimizer here. I take my feet seriously. Which [&#8230;]</description>
    </item>
    <item>
      <title>Quordle hints and answers for Saturday, January 17 (game #1454)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-17-january-2026</link>
      <pubDate>Fri, 16 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">o8iRbENWsSQiwohJHWUvxm</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Saturday, January 17 (game #951)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-17-january-2026</link>
      <pubDate>Fri, 16 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">e5pkSArqchxHDjyF5Ewqtb</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Saturday, January 17 (game #685)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-17-january-2026</link>
      <pubDate>Fri, 16 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">ri4LJ6cetBMu5H2qn5tZ5e</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>7 new movies and TV shows to watch on Netflix, HBO Max, Disney+ and more this weekend (January 16)</title>
      <link>https://www.techradar.com/streaming/7-new-movies-and-tv-shows-to-watch-on-netflix-hbo-max-disney-and-more-this-weekend-january-16</link>
      <pubDate>Fri, 16 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">EiuuFTiTaYdFckZ5pb2Jed</guid>
      <description>From the next Game of Thrones show to that divisive Stranger Things docufilm, here's what's worth watching this weekend.</description>
    </item>
    <item>
      <title>Spartacus: House of Ashur episode 8 reveals the most distressing gladiator death in the Starz show to date &#8212; and its cast 'felt completely shaken' after filming</title>
      <link>https://www.techradar.com/streaming/entertainment/spartacus-house-of-ashur-episode-8-reveals-the-most-distressing-gladiator-death-in-the-starz-show-to-date-and-its-cast-felt-completely-shaken-after-filming</link>
      <pubDate>Fri, 16 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">KEPLEhRVp9VdhKkSJZX84j</guid>
      <description>The final scene of a Spartacus: House of Ashur episode is always a shocker, but episode 8 is the most deeply upsetting yet... even for its cast.</description>
    </item>
    <item>
      <title>Engadget Podcast: Why did Apple choose Gemini for next-gen Siri?</title>
      <link>https://www.engadget.com/computing/engadget-podcast-why-did-apple-choose-gemini-for-next-gen-siri-150000993.html?src=rss</link>
      <pubDate>Fri, 16 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">1e28b5af-2efe-4700-9d64-d8a7a3b110b8</guid>
      <description>Apple's next-gen Siri is still far off, but this week the company announced that it'll be using Google's Gemini AI for its new foundation models. In this episode, Devindra and Engadget's Igor Bonifacic discuss why Apple teamed up with Google again, instead of OpenAI or Anthropic. Also, they chat about Meta's Reality Lab layoffs, which is refocusing the company on AI hardware like its smart glasses.Subscribe!iTunesSpotifyPocket CastsStitcherGoogle PodcastsTopicsMeta announces 1000+ layoffs, closes 3 VR studios as it shifts focus to AI hardware &#8211; 2:12Gemini can now pull context from the rest of ...</description>
    </item>
    <item>
      <title>Le prix du Google Pixel 9 Pro XL fond comme neige au soleil pendant les soldes (-40 %)</title>
      <link>https://www.frandroid.com/bons-plans/2823769_le-prix-du-google-pixel-9-pro-xl-fond-comme-neige-au-soleil-pendant-les-soldes</link>
      <pubDate>Fri, 16 Jan 2026 14:53:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2823769_le-prix-du-google-pixel-9-pro-xl-fond-comme-neige-au-soleil-pendant-les-soldes</guid>
      <description>
C'est une belle affaire des soldes sur Boulanger, pendant laquelle le Google Pixel 9 Pro XL chute &#224; seulement 729 euros alors qu'il en valait 1 199 euros &#224; son lancement en 2024.
</description>
    </item>
    <item>
      <title>Quelles sont les meilleures voitures &#233;lectriques en 2026 ? Notre comparatif complet</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-survoltes/guides-dachat-voitures/1032457_comparatif-meilleures-voitures-electriques-a-choisir</link>
      <pubDate>Fri, 16 Jan 2026 14:52:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-survoltes/guides-dachat-voitures/1032457_comparatif-meilleures-voitures-electriques-a-choisir</guid>
      <description>
Les v&#233;hicules &#233;lectriques sont devenus de v&#233;ritables alternatives aux v&#233;hicules thermiques. Que ce soit une citadine, un SUV ou une berline, nous avons choisi les meilleures voitures &#233;lectriques que la r&#233;daction de Frandroid et de Survolt&#233;s ont pu tester.
</description>
    </item>
    <item>
      <title>China&#8217;s Proposed Megaconstellations Would Flood Orbit With 200,000 Satellites</title>
      <link>https://gizmodo.com/china-wants-to-launch-200000-satellites-to-earth-orbit-outnumbering-all-other-constellations-2000710704</link>
      <pubDate>Fri, 16 Jan 2026 14:45:43 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000710704</guid>
      <description>Around 12,000 satellites are active in orbit today, most of them operated by SpaceX.</description>
    </item>
    <item>
      <title>Get $100 off Apple's Mac mini M4 desktop</title>
      <link>https://www.engadget.com/deals/get-100-off-apples-mac-mini-m4-desktop-141615926.html?src=rss</link>
      <pubDate>Fri, 16 Jan 2026 14:45:36 +0000</pubDate>
      <guid isPermaLink="false">98566005-6c41-40d6-af1c-de63d6ff0d35</guid>
      <description>The holiday season is fully in the rear view mirror and real life is here to stay. But that doesn't mean the time for gifts is over &#8212; especially ones for yourself. You can still take advantage of great January sales on some awesome tech products.
Take the Apple Mac mini M4, which is down to $500 from $599. The 17 percent discount gives you 16GB of RAM and 256GB of SSD for only about $20 more than the computer's Black Friday sale. Its beefier models are also on sale: opting for 512GB of SSD will cost you $690, down from $799, while also upping your RAM to 24GB is available for $890, dropping fr...</description>
    </item>
    <item>
      <title>Google a une tr&#232;s bonne id&#233;e pour prolonger la dur&#233;e de vie des smartphones pliables</title>
      <link>https://www.frandroid.com/marques/google/2945567_google-a-une-tres-bonne-idee-pour-prolonger-la-duree-de-vie-des-smartphones-pliables</link>
      <pubDate>Fri, 16 Jan 2026 14:41:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2945567_google-a-une-tres-bonne-idee-pour-prolonger-la-duree-de-vie-des-smartphones-pliables</guid>
      <description>
Google r&#233;fl&#233;chit &#224; un moyen de rendre les appareils pliables plus faciles &#224; r&#233;parer sur un point fondamental.
</description>
    </item>
    <item>
      <title>Spotify just announced another price hike. Here&#8217;s what&#8217;s really driving it</title>
      <link>https://www.fastcompany.com/91475742/spotify-just-announced-another-price-hike-heres-whats-really-driving-it</link>
      <pubDate>2026-01-16T14:33:08</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91475742/spotify-just-announced-another-price-hike-heres-whats-really-driving-it</guid>
      <description>The streaming giant is lifting Premium prices again&#8212;but the context matters more than the cost.
Everything from coffee to a used car is more expensive these days, and now your music streaming service is too. Spotify announced this week that it will raise prices for U.S. subscribers&#8212;again.&#160;</description>
    </item>
    <item>
      <title>Attention, la derni&#232;re mise &#224; jour de Windows 11 peut emp&#234;cher votre PC de s&#8217;&#233;teindre</title>
      <link>https://www.frandroid.com/marques/microsoft/2945231_attention-la-derniere-mise-a-jour-de-windows-11-peut-empecher-votre-pc-de-seteindre</link>
      <pubDate>Fri, 16 Jan 2026 14:32:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2945231_attention-la-derniere-mise-a-jour-de-windows-11-peut-empecher-votre-pc-de-seteindre</guid>
      <description>
Certains PC ne peuvent plus s'&#233;teindre depuis la mise &#224; jour de Windows 11 mardi dernier. Le souci a &#233;t&#233; reconnu par Microsoft, qui travaille d&#233;j&#224; sur un correctif.
</description>
    </item>
    <item>
      <title>NordVPN just made it easier to browse from 30 'hard-to-reach' countries</title>
      <link>https://www.techradar.com/vpn/vpn-services/nordvpn-just-made-it-easier-to-browse-from-30-hard-to-reach-countries</link>
      <pubDate>Fri, 16 Jan 2026 14:32:12 +0000</pubDate>
      <guid isPermaLink="false">mpDy3Yygww6HwK4nRHZ4Ja</guid>
      <description>NordVPN has expanded its server network with nearly 30 new virtual locations, granting users IP addresses in regions where physical infrastructure is scarce or insecure. Crucially, the provider is staying transparent about where those servers are actually located.</description>
    </item>
    <item>
      <title>Sur TikTok, tricher sur son &#226;ge devient plus risqu&#233; en Europe</title>
      <link>https://www.01net.com/actualites/sur-tiktok-tricher-sur-son-age-devient-plus-risque-en-europe.html</link>
      <pubDate>Fri, 16 Jan 2026 14:31:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320682</guid>
      <description>TikTok renforce sa politique de v&#233;rification de l'&#226;ge en Europe. Test&#233;e depuis un an, une technologie de d&#233;tection automatis&#233;e combinant l'analyse des contenus et les comportements va &#234;tre d&#233;ploy&#233;e dans les prochaines semaines pour emp&#234;cher les moins de 13 ans d'acc&#233;der &#224; la plateforme.</description>
    </item>
    <item>
      <title>Redwire and the power that&#8217;ll fuel NASA&#8217;s Gateway Lunar Space Station</title>
      <link>https://www.fastcompany.com/91448551/redwire-roll-out-array-lunar-gateway-solar-power</link>
      <pubDate>2026-01-16T14:31:27</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448551/redwire-roll-out-array-lunar-gateway-solar-power</guid>
      <description>Space company Redwire&#8217;s self-extending solar arrays are all over space. Soon, they&#8217;ll be on the station orbiting the moon.
In two years, there could be a space station orbiting the moon. NASA&#8217;s Gateway Lunar Space Station, set to launch as early as 2027, will support the Artemis IV and V moon missions and, eventually, be a jumping-off point for missions to Mars. And maybe, one day, a colony....</description>
    </item>
    <item>
      <title>Siri is a Gemini</title>
      <link>https://www.theverge.com/podcast/863340/siri-is-a-gemini</link>
      <pubDate>2026-01-16T09:21:05-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=863340</guid>
      <description>We know how the next-generation Siri is supposed to work. Apple showed it off in 2024, made commercials about it, and generally promised that AI would change the way we used our gadgets forever. And then, well, none of that came to pass. So Apple made a deal: It tapped Google's Gemini technology to help [&#8230;]</description>
    </item>
    <item>
      <title>Arizona Man Gets 5 Years in Prison for Setting Fire to Cybertruck</title>
      <link>https://gizmodo.com/arizona-man-gets-5-years-in-prison-for-setting-fire-to-cybertruck-2000710896</link>
      <pubDate>Fri, 16 Jan 2026 14:20:48 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000710896</guid>
      <description>Elon Musk remains at large.</description>
    </item>
    <item>
      <title>French court backs LFP and orders top VPNs to block illegal football streams</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/french-court-backs-lfp-and-orders-top-vpns-to-block-illegal-football-streams</link>
      <pubDate>Fri, 16 Jan 2026 14:20:06 +0000</pubDate>
      <guid isPermaLink="false">nydPwwmn3Czp3hHmy92TkA</guid>
      <description>A court in France has served its third blocking order against NordVPN, Surfshark, Proton VPN, ExpressVPN, and CyberGhost since May 2025, as the fight against online piracy heats up. Here's what at stake.</description>
    </item>
    <item>
      <title>Soldes TV et vid&#233;oprojecteurs : la deuxi&#232;me d&#233;marque s&#8217;attaque &#224; encore plus de mod&#232;les avec des r&#233;ductions &#224; plus de 1 000 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2933417_soldes-tv-et-videoprojecteurs-la-deuxieme-demarque-sattaque-a-encore-plus-de-modeles-avec-des-reductions-a-plus-de-1-000</link>
      <pubDate>Fri, 16 Jan 2026 14:19:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933417_soldes-tv-et-videoprojecteurs-la-deuxieme-demarque-sattaque-a-encore-plus-de-modeles-avec-des-reductions-a-plus-de-1-000</guid>
      <description>
Nous sommes dans le deuxi&#232;me d&#233;marque des soldes d'hiver avec encore plus d'offres sur les TV 4K et les vid&#233;oprojecteurs foisonnent chez les e-commer&#231;ants. Si l'heure est venue de changer d'&#233;cran, voici notre s&#233;lection des meilleures offres sur les TV 4K et les vid&#233;oprojecteurs.
</description>
    </item>
    <item>
      <title>Our favorite 3-in-1 wireless charger is on sale for 32 percent off</title>
      <link>https://www.engadget.com/deals/our-favorite-3-in-1-wireless-charger-is-on-sale-for-32-percent-off-214707127.html?src=rss</link>
      <pubDate>Fri, 16 Jan 2026 14:15:36 +0000</pubDate>
      <guid isPermaLink="false">3cc4c398-0e79-409e-bf43-095a0740d354</guid>
      <description>Now that the winter holidays are well and truly past, now's the perfect time to take stock of your tech setup. If you were gifted (or gifted yourself) some new gear in December, make sure that you've got the proper accessories to keep that gear performing at its best. If a new way to power all those batteries would be a benefit, Amazon's currently running a discount on an excellent wireless charging pad. The UGREEN MagFlow Qi2 3-in-1 Charger Station 25W is on sale for $95. That's only a little bit above the lowest price we've ever seen for the product (which was $90), and it's still a 32 perce...</description>
    </item>
    <item>
      <title>The rise of &#8216;micro&#8217; apps: non-developers are writing apps instead of buying them</title>
      <link>https://techcrunch.com/2026/01/16/the-rise-of-micro-apps-non-developers-are-writing-apps-instead-of-buying-them/</link>
      <pubDate>Fri, 16 Jan 2026 14:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3082739</guid>
      <description>A new era of app creation is here. It's fun, it's fast, and it's fleeting.</description>
    </item>
    <item>
      <title>Sony, Anker, and other headphones have a serious Google Fast Pair security vulnerability</title>
      <link>https://www.theverge.com/tech/863338/google-fast-pair-whisperpair-security-vulnerability-bluetooth-headphones-speakers</link>
      <pubDate>2026-01-16T09:13:55-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=863338</guid>
      <description>Several Bluetooth audio devices from companies like Sony, Anker, and Nothing are susceptible to a new flaw that can allow attackers to listen in on conversations or track devices that use Google's Find Hub network, as reported by Wired. Researchers from KU Leuven University's Computer Security and Industrial Cryptography group in Belgium discovered several vulnerabilities [&#8230;]...</description>
    </item>
    <item>
      <title>Netflix will give WBD movies 45-day theater exclusivity if deal goes through</title>
      <link>https://www.engadget.com/entertainment/tv-movies/netflix-will-give-wbd-movies-45-day-theater-exclusivity-if-deal-goes-through-141223786.html?src=rss</link>
      <pubDate>Fri, 16 Jan 2026 14:12:23 +0000</pubDate>
      <guid isPermaLink="false">edff5e5c-58a3-46cc-ae59-ade329f56281</guid>
      <description>The fate of Warner Bros. Discovery remains the biggest story in Hollywood, with Paramount Skydance refusing to back down from its rival bid to the proposed Netflix acquisition of the company. If the Netflix deal does go through, the company&#8217;s co-chief executive, Ted Sarandos, has attempted to ease concerns around what that could mean for theaters.
In an interview with The New York Times, Sarandos responded to a question about his company&#8217;s commitment to the theatrical business by insisting that he has no interest in bringing a swift end to it. "We will run that business largely like it is toda...</description>
    </item>
    <item>
      <title>The maker of our favorite affordable wired audiophile headphones has a new mid-range model &#8212; but mid-range is relative, isn't it&#8230;</title>
      <link>https://www.techradar.com/audio/headphones/the-maker-of-our-favorite-affordable-wired-audiophile-headphones-has-a-new-mid-range-model-but-mid-range-is-relative-isnt-it</link>
      <pubDate>Fri, 16 Jan 2026 14:12:00 +0000</pubDate>
      <guid isPermaLink="false">dcnGniwVch7eFN4iJHb9Ck</guid>
      <description>Austrian Audio fills the gap between its affordable and audiophile models</description>
    </item>
    <item>
      <title>Samsung built a stunning micro-LED TV where the bezel is also a screen &#8212; and I saw it in action</title>
      <link>https://www.techradar.com/televisions/samsung-built-a-stunning-micro-led-tv-where-the-bezel-is-also-a-screen-and-i-saw-it-in-action</link>
      <pubDate>Fri, 16 Jan 2026 14:07:20 +0000</pubDate>
      <guid isPermaLink="false">binLds6Y8cpy2kNDpu2cKk</guid>
      <description>Samsung's 140-inch next-gen TV shows how micro-LED can create very cool new design opportunities</description>
    </item>
    <item>
      <title>Grubhub says hackers stole company data in recent breach - here's what we know</title>
      <link>https://www.techradar.com/pro/security/grubhub-says-hackers-stole-company-data-in-recent-breach-heres-what-we-know</link>
      <pubDate>Fri, 16 Jan 2026 14:05:00 +0000</pubDate>
      <guid isPermaLink="false">Aqm6GNMJsVbX2GvwqhuwYZ</guid>
      <description>Grubhub hack is being linked to ShinyHunters and the August 2025 Salesloft Drift fiasco.</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver : voici les offres &#224; saisir avant de partir en week-end</title>
      <link>https://www.frandroid.com/bons-plans/2941853_soldes-dhiver-2026-offres-week-end-2e-demarque</link>
      <pubDate>Fri, 16 Jan 2026 14:04:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2941853_soldes-dhiver-2026-offres-week-end-2e-demarque</guid>
      <description>
Les soldes d'hiver suivent leur chemin et nous arrivons au d&#233;j&#224; au deuxi&#232;me week-end ! Au programme : toujours plus d'offres Tech &#224; prix cass&#233;s, que ce soient les smartphones, les tablettes, les t&#233;l&#233;viseurs 4K, et surtout les ordinateurs portables, gaming ou de bureautique. M&#234;me le gaming s'invite avec la PS5 en promo. 
</description>
    </item>
    <item>
      <title>Meta sacrifie la VR professionnelle</title>
      <link>https://www.01net.com/actualites/meta-sacrifie-la-vr-professionnelle.html</link>
      <pubDate>Fri, 16 Jan 2026 14:02:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320667</guid>
      <description>Que reste-t-il du m&#233;tavers ? Plus grand chose depuis l'annonce cette semaine de la charrette de licenciements au sein des Reality Labs de Meta. Mais dans le d&#233;tail, la purge est pire que pr&#233;vue.</description>
    </item>
    <item>
      <title>Jon Bernthal Promises a &#8216;High Octane&#8217; Punisher in &#8216;Spider-Man: Brand New Day&#8217;</title>
      <link>https://gizmodo.com/jon-bernthal-spider-man-brand-new-day-punisher-tone-2000710927</link>
      <pubDate>Fri, 16 Jan 2026 14:00:15 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000710927</guid>
      <description>Plus, Cate Blanchett will return for the live-action 'How to Train Your Dragon' sequel.</description>
    </item>
    <item>
      <title>Why Everyone Is Suddenly in a &#8216;Very Chinese Time&#8217; in Their Lives</title>
      <link>https://www.wired.com/story/made-in-china-chinese-time-of-my-life/</link>
      <pubDate>Fri, 16 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">69652f49d61f8a53819e4204</guid>
      <description>The viral meme isn&#8217;t really about China or actual Chinese people. It's a symbol of what Americans believe their own country has lost.</description>
    </item>
    <item>
      <title>Visions of Four Heroes is Dynasty Warriors Origins at its best, but issues I had with the base game remain</title>
      <link>https://www.techradar.com/gaming/visions-of-four-heroes-is-dynasty-warriors-origins-at-its-best-but-issues-i-had-with-the-base-game-remain</link>
      <pubDate>Fri, 16 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">U2jHNNpSEjWer3CnQJBmUg</guid>
      <description>Dynasty Warriors Origins&#8217; Visions of Four Heroes expansion trims the fat to deliver a near uncompromised musou experience.</description>
    </item>
    <item>
      <title>What is the release date for A Knight of the Seven Kingdoms episode 1 on HBO Max?</title>
      <link>https://www.techradar.com/streaming/hbo-max/what-is-the-release-date-for-a-knight-of-the-seven-kingdoms-episode-1-on-hbo-max</link>
      <pubDate>Fri, 16 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">hkV32NiwjGjsFSGTiDzzCg</guid>
      <description>HBO's new Game of Thrones TV adaptation comes out soon &#8211; here's when and where you can watch it.</description>
    </item>
    <item>
      <title>Pink Floyd: Live at Pompeii MCMLXXII is getting the 4K Blu-ray and Dolby Atmos treatment at long last</title>
      <link>https://www.techradar.com/televisions/blu-ray/pink-floyd-live-at-pompeii-mcmlxxii-is-getting-the-4k-blu-ray-and-dolby-atmos-treatment-at-long-last</link>
      <pubDate>Fri, 16 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">e988m2LJ2y4WvnhkqQtve3</guid>
      <description>Pink Floyd's classic concert is coming to 4K Blu-ray for the first time</description>
    </item>
    <item>
      <title>Meta is closing down its VR meeting rooms as part of its wider cull</title>
      <link>https://www.engadget.com/big-tech/meta-is-closing-down-its-vr-meeting-rooms-as-part-of-its-wider-cull-140000422.html?src=rss</link>
      <pubDate>Fri, 16 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">b688365f-2f22-4cf6-9ce1-bc4dbbd6d64e</guid>
      <description>Meta is killing the standalone Workrooms app on February 16, 2026. The company presented Workrooms as a virtual reality space where teams can meet and collaborate in an immersive environment when it launched the product. Now Meta says its Horizon platform has evolved enough to support &#8220;a wide range of productivity apps and tools,&#8221; so it &#8220;made the decision to discontinue Workrooms as a standalone app.&#8221;The company recently slashed its spending on the metaverse and started the process to lay off more than 1,000 employees from its Reality Labs division. Due to those layoffs and organizational chan...</description>
    </item>
    <item>
      <title>I tested ChatGPT Translate against Google Translate &#8212; here's which one wins</title>
      <link>https://www.techradar.com/ai-platforms-assistants/i-tested-chatgpt-translate-against-google-translate-heres-which-one-wins</link>
      <pubDate>Fri, 16 Jan 2026 13:58:34 +0000</pubDate>
      <guid isPermaLink="false">xKQ2PFhryBWgbnnACDotr8</guid>
      <description>ChatGPT Translate challenges Google Translate in a head-to-head test</description>
    </item>
    <item>
      <title>Italian regulators are investigating Activision Blizzard's monetization practices</title>
      <link>https://www.engadget.com/gaming/italian-regulators-are-investigating-activision-blizzards-monetization-practices-135057481.html?src=rss</link>
      <pubDate>Fri, 16 Jan 2026 13:50:57 +0000</pubDate>
      <guid isPermaLink="false">22d4c6b1-a620-4031-92d5-6e08fef57131</guid>
      <description>The Italian Competition Authority (AGCM) has opened two investigations into Microsoft-owned game studio Activision Blizzard, centered around the mobile games Diablo Immortal and Call of Duty: Mobile. The AGCM alleges the free-to-play games use "misleading and aggressive practices" to encourage in-game purchases.
Regulators say the games rely on a "deceptive user interface design" meant to encourage longer and more frequent play sessions while bombarding players with reminders and opportunities to spend real money in-game. Players might be reminded to buy a limited-time item before it's gone or...</description>
    </item>
    <item>
      <title>Apple's latest MagSafe charger is on sale for $30</title>
      <link>https://www.engadget.com/deals/apples-latest-magsafe-charger-is-on-sale-for-30-141707636.html?src=rss</link>
      <pubDate>Fri, 16 Jan 2026 13:50:37 +0000</pubDate>
      <guid isPermaLink="false">2ce1496f-1e48-428a-bb64-aefda025bc79</guid>
      <description>One way you can reduce the number of cables you have to deal with on the regular is by investing in a few wireless chargers. Those with iPhones should consider Apple's own MagSafe charger not only because of its sleek and effective design, but also because it's on sale right now at Amazon. The Qi2.2-rated MagSafe charger is down to $30 for the one-meter version, or $40 for the two-meter version.


If you have an iPhone 16, iPhone 17 or iPhone Air, this cable can charge your device at 25W as long as it's connected to a 30W power adapter on the other end. While you'll need a more recent iPhone t...</description>
    </item>
    <item>
      <title>Dreame has expanded its remit to 'literally anything' and I'm not sure it's good news for one of my favorite vacuum brands</title>
      <link>https://www.techradar.com/home/robot-vacuums/dreame-has-expanded-its-remit-to-literally-anything-and-im-not-sure-its-good-news-for-one-of-my-favorite-vacuum-brands</link>
      <pubDate>Fri, 16 Jan 2026 13:50:09 +0000</pubDate>
      <guid isPermaLink="false">rR2KdwspXogy2CX6xUc85K</guid>
      <description>From action cameras to TVs to coffee machines to smart rings, Dreame has it covered</description>
    </item>
    <item>
      <title>Dans l&#8217;espace, le feu devient une sph&#232;re&#8230; et c&#8217;est un cauchemar pour les astronautes</title>
      <link>https://www.futura-sciences.com/sciences/actualites/espace-espace-feu-devient-sphere-cest-cauchemar-astronautes-130245/#xtor%3DRSS-8</link>
      <pubDate>Fri, 16 Jan 2026 14:49:03 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/espace-espace-feu-devient-sphere-cest-cauchemar-astronautes-130245/#xtor%3DRSS-8</guid>
      <description>Dans l&#8217;espace, le feu ne se comporte&#160;pas comme sur Terre. En apesanteur, la flamme se pr&#233;sente en effet sous une forme fascinante&#8230; mais dangereuse. Face &#224; ce comportement atypique et au risque accru d&#8217;incendie, la Nasa et des chercheurs, comme ceux du projet Firespace, cherchent &#224; comprendre...</description>
    </item>
    <item>
      <title>Baisse de prix pour le Xpeng G6 en France, la voiture &#233;lectrique rivale du Tesla Model Y qui se recharge en 12 minutes</title>
      <link>https://www.frandroid.com/marques/xpeng/2945477_baisse-de-prix-pour-le-xpeng-g6-en-france-la-voiture-electrique-rivale-du-tesla-model-y-qui-se-recharge-en-12-minutes</link>
      <pubDate>Fri, 16 Jan 2026 13:48:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2945477_baisse-de-prix-pour-le-xpeng-g6-en-france-la-voiture-electrique-rivale-du-tesla-model-y-qui-se-recharge-en-12-minutes</guid>
      <description>
Au royaume des SUV &#233;lectriques, le Tesla Model Y est toujours le roi, mais son h&#233;g&#233;monie est mise &#224; mal par une concurrence de plus en plus f&#233;roce. &#192; commencer par le Xpeng G6, qui se dote d'une nouvelle version plus abordable mais qui se recharge toujours en 12 minutes.
</description>
    </item>
    <item>
      <title>Id&#233;al pour les familles, le v&#233;lo &#233;lectrique Nakamura E-Cross City s&#8217;all&#232;ge de 200 &#8364; lors des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2560353_ideal-pour-les-familles-le-velo-electrique-nakamura-e-cross-city-sallege-de-200-euros-lors-des-soldes</link>
      <pubDate>Fri, 16 Jan 2026 13:41:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2560353_ideal-pour-les-familles-le-velo-electrique-nakamura-e-cross-city-sallege-de-200-euros-lors-des-soldes</guid>
      <description>
Le Nakamura E-Cross City, un v&#233;lo &#233;lectrique que l'on pourrait qualifier de midtail, est un mod&#232;le taill&#233; pour les familles, gr&#226;ce notamment &#224; son porte-bagages pouvant supporter jusqu'&#224; 60 kg de charge ; parfait pour transporter un enfant, par exemple. Actuellement, on trouve ce VAE affich&#233; &#224; 1 099,99 euros au lieu de 1 299,99 euros pendant les soldes chez Intersport.
...</description>
    </item>
    <item>
      <title>Nia DaCosta and Jack OConnell dive into 28 Years Later: The Bone Temple</title>
      <link>https://mashable.com/video/say-more-nia-dacosta-jack-oconnell-bone-temple</link>
      <pubDate>Fri, 16 Jan 2026 13:36:30 +0000</pubDate>
      <guid isPermaLink="false">03XjXXQ1IRyTNvJvJ83LLGQ</guid>
      <description>Danny Boyle hands over the reins of his zombie saga to great and grateful hands with "28 Years Later: The Bone Temple," directed by Nia DaCosta.</description>
    </item>
    <item>
      <title>Pixel Watch : cette nouvelle fonctionnalit&#233; d&#8217;alerte pourrait bien sauver votre journ&#233;e</title>
      <link>https://www.frandroid.com/marques/google/2945499_pixel-watch-cette-nouvelle-fonctionnalite-dalerte-pourrait-bien-sauver-votre-journee</link>
      <pubDate>Fri, 16 Jan 2026 13:35:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2945499_pixel-watch-cette-nouvelle-fonctionnalite-dalerte-pourrait-bien-sauver-votre-journee</guid>
      <description>
Google travaillerait &#224; une nouvelle fonction d'alerte sur ses montres Pixel Watch. Elle permettrait de pr&#233;venir l'utilisateur lorsqu'il s'&#233;loigne trop de son smartphone et risque de l'oublier. 
</description>
    </item>
    <item>
      <title>The Jackery HomePower 3000 power station is $1,400 off at Amazon &#8212; act fast to save huge</title>
      <link>https://mashable.com/article/jan-16-jackery-homepower-power-station-deal</link>
      <pubDate>Fri, 16 Jan 2026 13:34:09 +0000</pubDate>
      <guid isPermaLink="false">047wKa0H6c3cgJLU2sbYjXc</guid>
      <description>Get the best power station deal at Amazon. Save 47% on the Jackery HomePower 3000 at Amazon.</description>
    </item>
    <item>
      <title>XREAL files lawsuit against rival smart glass maker Viture</title>
      <link>https://www.engadget.com/wearables/xreal-files-lawsuit-against-rival-smart-glass-maker-viture-133018692.html?src=rss</link>
      <pubDate>Fri, 16 Jan 2026 13:30:18 +0000</pubDate>
      <guid isPermaLink="false">2e519e04-ca2b-46bc-8145-ca18295fa581</guid>
      <description>San Francisco-founded Smart glasses maker Viture has been sued in a US court by rival XREAL over claims it infringed on its patents, XREAL announced in a press release. The complaint, lodged in a federal Texas court, accuses Viture of illegally incorporating XREAL's patented tech into its products including the Luma Pro, Luma Ultra and Beast models.&#160;
"The lawsuit is not merely about enforcing a single patent," the company wrote. "It is about stopping a pattern of intellectual property infringement that undermines the integrity of innovation and endangers continued technological development in ...</description>
    </item>
    <item>
      <title>Dos Equis brings back the Most Interesting Man&#8212;and bets nostalgia still sells beer</title>
      <link>https://www.fastcompany.com/91475751/dos-equis-brings-back-the-most-interesting-man-and-bets-nostalgia-still-sells-beer</link>
      <pubDate>2026-01-16T13:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91475751/dos-equis-brings-back-the-most-interesting-man-and-bets-nostalgia-still-sells-beer</guid>
      <description>Dos Equis is reviving its most iconic campaign, bringing back Jonathan Goldsmith and a familiar catchphrase.
The Most Interesting Man is set to make a return to television.</description>
    </item>
  </channel>
</rss>
