<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 18 Dec 2025 08:35:31 GMT</lastBuildDate>
    <item>
      <title>Fuite massive de donn&#233;es &#224; la CAF&#160;: les informations de 8,6 millions de Fran&#231;ais compromises</title>
      <link>https://www.01net.com/actualites/fuite-massive-donnees-caf-informations-86-millions-francais-compromises.html</link>
      <pubDate>Thu, 18 Dec 2025 08:18:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315984</guid>
      <description>Une fuite massive frappe la Caisse des Allocations Familiales (CAF). Des pirates ont pu exfiltrer plus de 22 millions de donn&#233;es personnelles. Plus de huit millions de Fran&#231;ais seraient touch&#233;s. Les hackers du minist&#232;re de l'Int&#233;rieur sont bien d&#233;cid&#233;s &#224; montrer qu'ils ne plaisantent pas&#8230;</description>
    </item>
    <item>
      <title>La premi&#232;re barre de son Dolby Atmos Flex Connect au monde est sign&#233;e LG</title>
      <link>https://www.frandroid.com/marques/lg/2914411_la-premiere-barre-de-son-dolby-atmos-flex-connect-au-monde-est-signee-lg</link>
      <pubDate>Thu, 18 Dec 2025 08:17:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lg/2914411_la-premiere-barre-de-son-dolby-atmos-flex-connect-au-monde-est-signee-lg</guid>
      <description>
En amont du CES 2026, LG annonce l&#8217;arriv&#233;e sur le march&#233; de la toute premi&#232;re barre de son au monde &#224; embarquer la technologie Dolby Atmos Flex Connect permettant non seulement de synchroniser les haut-parleurs d&#8217;un t&#233;l&#233;viseur de la marque avec ceux de la barre de son mais &#233;galement un auto calibrage qui prend en compte les caract&#233;ristiques acoustiques et physiques de la pi&#232;ce.
...</description>
    </item>
    <item>
      <title>Amazon casse d&#233;j&#224; le prix du nouveau smartphone pas cher d&#8217;Oppo avec un &#233;cran AMOLED 120 Hz et une autonomie XXL</title>
      <link>https://www.frandroid.com/bons-plans/2913717_amazon-casse-deja-le-prix-du-nouveau-smartphone-pas-cher-doppo-avec-un-ecran-amoled-120-hz-et-une-autonomie-xxl</link>
      <pubDate>Thu, 18 Dec 2025 08:08:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2913717_amazon-casse-deja-le-prix-du-nouveau-smartphone-pas-cher-doppo-avec-un-ecran-amoled-120-hz-et-une-autonomie-xxl</guid>
      <description>
Avec un budget inf&#233;rieur &#224; 300 euros, il est possible de se procurer un bon smartphone sans trop de compromis. C'est le cas du Oppo A6 Pro 5G, qui pr&#233;sente une belle fiche technique pour un prix bien bas : 249 euros contre 299 euros de base.  
</description>
    </item>
    <item>
      <title>Emily in Paris season 5 ending explained: does Emily return to Paris, do Emily and Gabriel get back together and our season 6 predictions</title>
      <link>https://www.techradar.com/streaming/netflix/emily-in-paris-season-5-ending-explained</link>
      <pubDate>Thu, 18 Dec 2025 08:02:00 +0000</pubDate>
      <guid isPermaLink="false">TNvjATHMDtRoPkSvwJ5V5J</guid>
      <description>Goodbye Paris, hello Rome! The ending of Emily in Paris season 5 shakes things up once again &#8211; here are the answers to all of your burning questions.</description>
    </item>
    <item>
      <title>The best multi-device wireless charging pads for 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-multi-device-wireless-charging-pads-120557582.html?src=rss</link>
      <pubDate>Thu, 18 Dec 2025 08:01:26 +0000</pubDate>
      <guid isPermaLink="false">92afccad-7a6d-4b3e-b701-91c6301fd52f</guid>
      <description>There&#8217;s a good chance you own a couple of gadgets that support wireless charging now, be it your iPhone or Android phone, wireless earbuds or smartwatch. Multi-device wireless chargers can help power them all up in one place, without the need for a bunch of cords messing up your space. There are dozens of these accessories out there today, and we&#8217;ve tested a bunch of the most popular models. You&#8217;ll find out top picks below for the best wireless charging pads, plus some advice on how to choose the right one for your needs.
Table of contents

Best wireless charging pads
Do wireless charging pads...</description>
    </item>
    <item>
      <title>Emily in Paris season 5 isn't home sweet Rome, but an Italian holiday from hell &#8212; and Marcello is the biggest disappointment of all</title>
      <link>https://www.techradar.com/streaming/netflix/emily-in-paris-season-5-review</link>
      <pubDate>Thu, 18 Dec 2025 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">RDsKuNkeUNK4oYe33y5BRJ</guid>
      <description>Emily in Paris season 5 is proof that the concept doesn't work in another city &#8211; and Marcello might just be Emily's worst boyfriend yet.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs ultraportables en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/1661013_meilleurs-pc-ultraportables-quel-modele-de-pc-nomade-choisir</link>
      <pubDate>Thu, 18 Dec 2025 08:00:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1661013_meilleurs-pc-ultraportables-quel-modele-de-pc-nomade-choisir</guid>
      <description>
Vous &#234;tes &#224; la recherche d&#8217;un ordinateur portable &#224; la fois l&#233;ger, compact et performant ? Les ultraportables, aussi appel&#233;s ultrabooks, sont faits pour vous. Voici notre s&#233;lection des meilleurs mod&#232;les, soigneusement test&#233;s par l&#8217;&#233;quipe de Frandroid.
</description>
    </item>
    <item>
      <title>SFR a &#233;t&#233; pirat&#233; et les donn&#233;es de ses clients sont dans la nature</title>
      <link>https://www.frandroid.com/marques/sfr/2914357_sfr-a-ete-pirate-et-les-donnees-de-ses-clients-sont-dans-la-nature</link>
      <pubDate>Thu, 18 Dec 2025 07:55:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sfr/2914357_sfr-a-ete-pirate-et-les-donnees-de-ses-clients-sont-dans-la-nature</guid>
      <description>
SFR a une nouvelle fois &#233;t&#233; victime d'un piratage massif des donn&#233;es de ses clients. Heureusement, les informations bancaires n'ont pas &#233;t&#233; d&#233;voil&#233;es.
</description>
    </item>
    <item>
      <title>I tested the Geekom AX8 Max - and this mini PC is ideally balanced for the office, but I&#8217;m not sold on the color</title>
      <link>https://www.techradar.com/computing/geekom-ax8-max-mini-pc-review</link>
      <pubDate>Thu, 18 Dec 2025 07:47:00 +0000</pubDate>
      <guid isPermaLink="false">6Qa8qVHGe9xwk6aTKxEPtH</guid>
      <description>The Geekom AX8 Max is a mid-range mini PC sporting an AMD Ryzen 7 8745HS with integrated Radeon 780M, enabling it to handle day-to-day office tasks, multimedia, and a touch of gaming, whilst maintaining a small form factor and footprint.</description>
    </item>
    <item>
      <title>Kuxiu&#8217;s S3 MagSafe power bank is bigger and better and probably won&#8217;t explode</title>
      <link>https://www.theverge.com/reviews/846094/kuxiu-s3-solid-state-power-bank-review</link>
      <pubDate>2025-12-18T02:30:14-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/846094/the-espresso-pro-portable-monitor-is-a-revolution-for-remote-work</guid>
      <description>Kuxiu is back with a new S3 portable battery that addresses most of the issues I had during my review of the S2, aka the "world's first" semi-solid state power bank. It also introduces a few new ones, while adding useful features like a kickstand and integrated USB-C cable. As a reminder, these are not [&#8230;]</description>
    </item>
    <item>
      <title>Cyberattaque contre le minist&#232;re de l&#8217;Int&#233;rieur&#160;: la police arr&#234;te un hacker de 22 ans &#224; Limoges</title>
      <link>https://www.01net.com/actualites/cyberattaque-contre-ministere-de-linterieur-la-police-arrete-hacker-22-ans-limoges.html</link>
      <pubDate>Thu, 18 Dec 2025 07:30:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315975</guid>
      <description>L'enqu&#234;te sur le piratage du minist&#232;re de l'Int&#233;rieur progresse. Alors que les pirates pr&#233;tendent toujours avoir exfiltr&#233; des millions de donn&#233;es, un hacker de 22 ans a &#233;t&#233; interpell&#233; &#224; Limoges.</description>
    </item>
    <item>
      <title>Ce drone 4K brad&#233; &#224; -20 % sur Amazon est une bonne alternative &#224; DJI</title>
      <link>https://www.frandroid.com/bons-plans/2913941_ce-drone-4k-brade-a-20-sur-amazon-est-une-bonne-alternative-a-dji</link>
      <pubDate>Thu, 18 Dec 2025 07:23:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2913941_ce-drone-4k-brade-a-20-sur-amazon-est-une-bonne-alternative-a-dji</guid>
      <description>
Pas besoin d'exploser son budget pour avoir un petit drone qui filme en 4K : le Potensic ATOM 2 devient encore plus int&#233;ressant avec cette belle remise qui fait passer son prix initial de 329 euros &#224; 263 euros sur Amazon. 
</description>
    </item>
    <item>
      <title>La CAF aurait &#233;t&#233; pirat&#233;e : 22 millions de comptes fran&#231;ais dans la nature ?</title>
      <link>https://www.frandroid.com/culture-tech/securite-applications/2914333_la-caf-aurait-ete-piratee-22-millions-de-comptes-francais-dans-la-nature</link>
      <pubDate>Thu, 18 Dec 2025 07:21:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/securite-applications/2914333_la-caf-aurait-ete-piratee-22-millions-de-comptes-francais-dans-la-nature</guid>
      <description>
Une base de donn&#233;es de 22 millions de comptes de la CAF a &#233;t&#233; partag&#233;e sur le darkweb, mais la Caisse d'allocations familiales a-t-elle &#233;t&#233; vraiment pirat&#233;e ?
</description>
    </item>
    <item>
      <title>&#171; Apr&#232;s 3 ans de gal&#232;re, nous commen&#231;ons &#224; voir une reprise &#187; : Brompton et ses v&#233;los &#233;lectriques pliants envoient un joli signal</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2913327_apres-3-ans-de-galere-nous-commencons-a-voir-une-reprise-brompton-et-ses-velos-electriques-pliants-envoient-un-joli-signal</link>
      <pubDate>Thu, 18 Dec 2025 07:14:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2913327_apres-3-ans-de-galere-nous-commencons-a-voir-une-reprise-brompton-et-ses-velos-electriques-pliants-envoient-un-joli-signal</guid>
      <description>
Sous l&#8217;impulsion de son r&#233;cent 20 pouces G Line et d&#8217;un service de location plus rentable, Brompton publie de meilleurs r&#233;sultats financiers en 2025, et se dit optimiste avec une reprise en 2026.
</description>
    </item>
    <item>
      <title>Avec Gemini 3 Flash, Google fait passer son IA au niveau sup&#233;rieur</title>
      <link>https://www.01net.com/actualites/gemini-2-flash-google-fait-passer-son-ia-niveau-superieur.html</link>
      <pubDate>Thu, 18 Dec 2025 07:09:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315959</guid>
      <description>Google vient de pr&#233;senter Gemini 3 Flash, son nouveau mod&#232;le plus rapide et polyvalent, qui arrive dans plusieurs services du g&#233;ant am&#233;ricain.</description>
    </item>
    <item>
      <title>Votre smartwatch Wear OS peut maintenant localiser votre smartphone Android</title>
      <link>https://www.01net.com/actualites/votre-smartwatch-wear-os-peut-maintenant-localiser-votre-smartphone-android.html</link>
      <pubDate>Thu, 18 Dec 2025 07:06:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315969</guid>
      <description>Google vient de mettre &#224; jour son application Localiser. D&#233;sormais compatible Wear OS, elle permet de localiser votre smartphone et de le faire sonner &#224; distance depuis votre smartwatch.</description>
    </item>
    <item>
      <title>Cowboy saddles up with a new owner</title>
      <link>https://www.theverge.com/news/847097/cowboy-acquired-by-rebirth-recycles-bankruptcy</link>
      <pubDate>2025-12-18T02:02:10-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=847097</guid>
      <description>The Brussels-based electric bike company has officially closed its deal to be acquired by ReBirth Group Holding, which also owns cycling brands Peugeot, Gitane, and Solex. The transaction includes new, undisclosed funding from ReBirth as well as &#8364;15 million ($17.6 million) from existing shareholders. The funding will be used to restart production and deal with [&#8230;]...</description>
    </item>
    <item>
      <title>The introvert&#8217;s networking playbook</title>
      <link>https://www.fastcompany.com/91457229/the-introverts-networking-playbook</link>
      <pubDate>2025-12-18T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91457229/the-introverts-networking-playbook</guid>
      <description>From pre-event prep to follow-through, these tips break down the tactics for people who get anxious at conferences.
I am an introverted person who feels shy at events. Early in my career, I found conferences to be so overwhelming that I&#8217;d sometimes just hide in the bathroom, go into an anxious spiral of fear and guilt, and then try to convince myself to get out and talk to at least one person. Watching how other people seemed to enjoy these events and easily talk to everyone made me think something was wrong with me. The truth is that 36% of young people have anxiety. But knowing that didn&#8217;t m...</description>
    </item>
    <item>
      <title>How to spot culture risks at your company when you can still fix them</title>
      <link>https://www.fastcompany.com/91457403/how-to-spot-culture-risks-at-your-company-when-you-can-still-fix-them</link>
      <pubDate>2025-12-18T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91457403/how-to-spot-culture-risks-at-your-company-when-you-can-still-fix-them</guid>
      <description>Having a thriving culture requires more than an engagement survey; it means paying attention to lived experiences. 
A headline catches your eye: A company you admire, known for its market performance and strong culture, is embroiled in a massive scandal. It causes reputational harm, profitability tanks, and customers notice. The details feel depressingly familiar&#8212;enough to fill books (most recently The Dark Pattern)....</description>
    </item>
    <item>
      <title>What dating is like in 2025 for the unemployed</title>
      <link>https://www.fastcompany.com/91462207/what-dating-is-like-in-2025-for-the-unemployed</link>
      <pubDate>2025-12-18T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91462207/what-dating-is-like-in-2025-for-the-unemployed</guid>
      <description>A new report reveals how unemployment is changing dating expectations in 2025.
Dating in 2025 has been rough. According to articles, data, and personal narratives on social media, it seems that it&#8217;s never been more challenging to find a partner. But, according to a new report, when it comes to one qualification, daters may actually be lowering the bar.&#160;...</description>
    </item>
    <item>
      <title>Voici la meilleure montre de sport de l&#8217;ann&#233;e &#8211; Frandroid Awards 2025</title>
      <link>https://www.frandroid.com/marques/garmin/2902173_voici-la-meilleure-montre-de-sport-de-2025-frandroid-awards-2025</link>
      <pubDate>Thu, 18 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/garmin/2902173_voici-la-meilleure-montre-de-sport-de-2025-frandroid-awards-2025</guid>
      <description>
Cette ann&#233;e, la r&#233;daction de Frandroid a test&#233; de nombreuses montres GPS d&#233;di&#233;es au sport. C'est la Garmin Forerunner 970 qui sort du lot et re&#231;oit le Frandroid Awards avec Delos. 
</description>
    </item>
    <item>
      <title>Face &#224; Google et Samsung, Meta &#171;&#160;met en pause&#160;&#187; son ambition de devenir l&#8217;Android de la VR</title>
      <link>https://www.frandroid.com/marques/meta/2914323_face-a-google-et-samsung-meta-met-en-pause-son-ambition-de-devenir-landroid-de-la-vr</link>
      <pubDate>Thu, 18 Dec 2025 06:52:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2914323_face-a-google-et-samsung-meta-met-en-pause-son-ambition-de-devenir-landroid-de-la-vr</guid>
      <description>
Alors que le groupe de Mark Zuckerberg avait accumul&#233; une avance non n&#233;gligeable dans le monde de la r&#233;alit&#233; virtuelle et augment&#233;e, il se fait doucement rattraper par la concurrence. &#192; tel point qu&#8217;il r&#233;duit d&#233;sormais ses ambitions.
</description>
    </item>
    <item>
      <title>Si vous avez un Google Pixel 10, cette mise &#224; jour va faire du bien</title>
      <link>https://www.frandroid.com/marques/google/2914319_si-vous-avez-un-google-pixel-10-cette-mise-a-jour-va-faire-du-bien</link>
      <pubDate>Thu, 18 Dec 2025 06:43:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2914319_si-vous-avez-un-google-pixel-10-cette-mise-a-jour-va-faire-du-bien</guid>
      <description>
Google met &#224; jour le pilote de la puce graphique des Google Pixel 10 pour am&#233;liorer les performances des smartphones.
</description>
    </item>
  </channel>
</rss>
