<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 06 Feb 2026 08:51:45 GMT</lastBuildDate>
    <item>
      <title>La &#171;&#160;recharge&#160;&#187; en 3 minutes fonctionne vraiment en Europe comme le prouve ce chiffre</title>
      <link>https://www.frandroid.com/marques/nio/2968373_la-recharge-en-3-minutes-fonctionne-vraiment-en-europe-comme-le-prouve-ce-chiffre</link>
      <pubDate>Fri, 06 Feb 2026 08:50:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nio/2968373_la-recharge-en-3-minutes-fonctionne-vraiment-en-europe-comme-le-prouve-ce-chiffre</guid>
      <description>
Si elles restent encore discr&#232;tes en Europe, les stations d&#8217;&#233;change de batteries pour les voitures &#233;lectriques de Nio fonctionnent &#224; plein r&#233;gime. La barre des 250 000 &#171;&#160;swaps&#160;&#187; vient juste d&#8217;&#234;tre franchie sur le continent.
</description>
    </item>
    <item>
      <title>Voitures &#233;lectriques : ce nouveau record de la Chine qui fait trembler les constructeurs europ&#233;ens</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2968357_voitures-electriques-ce-nouveau-record-de-la-chine-qui-fait-trembler-les-constructeurs-europeens</link>
      <pubDate>Fri, 06 Feb 2026 08:43:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2968357_voitures-electriques-ce-nouveau-record-de-la-chine-qui-fait-trembler-les-constructeurs-europeens</guid>
      <description>
Nouveau record pour la Chine. Avec une part de march&#233; de d&#233;passant les 36&#160;%, le pays s&#8217;impose de plus en plus dans le monde. Et certains constructeurs de voitures &#233;lectriques cartonnent particuli&#232;rement.
</description>
    </item>
    <item>
      <title>La nouvelle gamme d&#8217;appareils domotiques Ikea a de s&#233;rieux probl&#232;mes</title>
      <link>https://www.01net.com/actualites/la-nouvelle-gamme-dappareils-domotiques-ikea-a-de-serieux-problemes.html</link>
      <pubDate>Fri, 06 Feb 2026 08:29:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324409</guid>
      <description>Il y a quelque chose qui ne va pas dans la nouvelle gamme d'appareils domotiques Ikea. De nombreux utilisateurs se plaignent du mauvais fonctionnement de ces produits, dont la particularit&#233; est de s'appuyer sur le standard Matter. Le constructeur est sur le coup.</description>
    </item>
    <item>
      <title>Apr&#232;s les r&#233;seaux sociaux, Emmanuel Macron envisage l&#8217;interdiction des IA et des jeux vid&#233;o pour les jeunes</title>
      <link>https://www.frandroid.com/culture-tech/politique/2968377_apres-les-reseaux-sociaux-emmanuel-macron-envisage-linterdiction-des-ia-et-des-jeux-video-pour-les-jeunes</link>
      <pubDate>Fri, 06 Feb 2026 08:14:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/politique/2968377_apres-les-reseaux-sociaux-emmanuel-macron-envisage-linterdiction-des-ia-et-des-jeux-video-pour-les-jeunes</guid>
      <description>
Emmanuel Macron semble mener une croisade pour limiter l&#8217;exposition des jeunes aux num&#233;riques sous toutes ses formes. Missionn&#233; par le pr&#233;sident de la R&#233;publique, un comit&#233; d&#8217;expert devra statuer sur l&#8217;impact des jeux vid&#233;o et de l&#8217;IA sur la sant&#233; mentale des jeunes.
</description>
    </item>
    <item>
      <title>Spotify : la traduction des paroles arrive enfin en France, voici comment en profiter</title>
      <link>https://www.frandroid.com/services/streaming-musical/2968365_spotify-la-traduction-des-paroles-arrive-enfin-en-france-voici-comment-en-profiter</link>
      <pubDate>Fri, 06 Feb 2026 08:10:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/streaming-musical/2968365_spotify-la-traduction-des-paroles-arrive-enfin-en-france-voici-comment-en-profiter</guid>
      <description>
Spotify d&#233;ploie une mise &#224; jour majeure de son interface de paroles. Attendue depuis 2022, la traduction instantan&#233;e des titres est d&#233;sormais accessible aux utilisateurs fran&#231;ais, accompagn&#233;s de la prise en charge hors ligne et d'un nouvel aper&#231;u visuel.
</description>
    </item>
    <item>
      <title>Anthropic et OpenAI lancent de nouveaux mod&#232;les IA capables de mieux g&#233;rer des projets entiers</title>
      <link>https://www.01net.com/actualites/anthropic-et-openai-lancent-de-nouveaux-modeles-ia-capables-de-mieux-gerer-des-projets-entiers.html</link>
      <pubDate>Fri, 06 Feb 2026 08:02:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324423</guid>
      <description>En l&#8217;espace de quelques heures, Anthropic et OpenAI ont d&#233;gain&#233; deux mises &#224; jour majeures de leurs mod&#232;les les plus avanc&#233;s. Claude Opus 4.6 d&#8217;un c&#244;t&#233;, GPT-5.3-Codex de l&#8217;autre. Ce sont deux approches diff&#233;rentes, mais l'objectif est le m&#234;me dans tous les cas : pousser plus loin l&#8217;autonomie des IA et leur capacit&#233; &#224; g&#233;rer des projets de bout en bout....</description>
    </item>
    <item>
      <title>Massacre en cours sur le march&#233; crypto&#160;: le Bitcoin touche les 60&#160;000 dollars, la chute libre continue</title>
      <link>https://www.01net.com/actualites/massacre-marche-crypto-bitcoin-chute-libre-milliards-dollars-envoles-week-end.html</link>
      <pubDate>Fri, 06 Feb 2026 07:52:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323667</guid>
      <description>Le Bitcoin vient de vivre un semaine particuli&#232;rement brutale. Le cours de la crypto s'est effondr&#233; sous les 70 000 dollars en quelques jours. Le march&#233; crypto a enregistr&#233; une nouvelle vague de liquidations forc&#233;es, laissant les investisseurs exsangues.</description>
    </item>
    <item>
      <title>Ray Tracing : pourquoi les futurs Galaxy S26 pourraient devenir les meilleurs smartphones gaming</title>
      <link>https://www.frandroid.com/marques/2968355_ray-tracing-pourquoi-les-futurs-galaxy-s26-pourraient-devenir-les-meilleurs-smartphones-gamer</link>
      <pubDate>Fri, 06 Feb 2026 07:29:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2968355_ray-tracing-pourquoi-les-futurs-galaxy-s26-pourraient-devenir-les-meilleurs-smartphones-gamer</guid>
      <description>
De r&#233;cents benchmarks de l'Exynos 2600 montrent que la future puce cor&#233;enne devancerait sa concurrente de chez Qualcomm, le Snapdragon 8 Elite Gen 5, sur le terrain du ray tracing.
</description>
    </item>
    <item>
      <title>AirDrop pour Android, bient&#244;t pour davantage de smartphones</title>
      <link>https://www.01net.com/actualites/airdrop-pour-android-bientot-pour-davantage-de-smartphones.html</link>
      <pubDate>Fri, 06 Feb 2026 07:29:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324418</guid>
      <description>Depuis la fin de l'ann&#233;e derni&#232;re, les smartphones Pixel sont en mesure de partager des documents avec des iPhone via AirDrop. Oui, c'est normalement une technologie exclusive aux plateformes d'Apple, mais Google a trouv&#233; la martingale pour passer outre&#8230; mais uniquement pour ses propres smartphones. Une expansion est cependant pr&#233;vue pour cette ann&#233;e....</description>
    </item>
    <item>
      <title>Sosh mobile&#160;: la TV d&#8217;Orange devient gratuite pour tous, mais attention &#224; ce gros d&#233;tail</title>
      <link>https://www.01net.com/actualites/sosh-mobile-tv-orange-devient-gratuite-attention-gros-detail.html</link>
      <pubDate>Fri, 06 Feb 2026 07:24:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324454</guid>
      <description>Sosh r&#233;pond &#224; Free en int&#233;grant gratuitement dans tous ses forfaits mobiles l'acc&#232;s &#224; 150 cha&#238;nes via la TV d&#8217;Orange.</description>
    </item>
    <item>
      <title>Fnac associe le Google Pixel 10 Pro XL &#224; une enceinte Bang &amp; Olufsen dans ce pack &#224; -33 %</title>
      <link>https://www.frandroid.com/bons-plans/2967455_fnac-associe-le-google-pixel-10-pro-xl-a-une-enceinte-bang-olufsen-dans-ce-pack-a-33</link>
      <pubDate>Fri, 06 Feb 2026 07:18:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2967455_fnac-associe-le-google-pixel-10-pro-xl-a-une-enceinte-bang-olufsen-dans-ce-pack-a-33</guid>
      <description>
Il arrive souvent que Fnac fasse des packs de plusieurs produits &#224; prix cass&#233;, c'est comme &#231;a qu'on retrouve le smartphone Google Pixel 10 Pro XL avec l'enceinte Bluetooth Bang &amp; Olufsen Beosound Explore pour 1 029 euros au lieu de 1 548 euros.
</description>
    </item>
    <item>
      <title>I&#8217;ve been using the Acer TravelMate P6 14 AI for a couple of months now - and it's easily one of the best ultra-light machines I&#8217;ve used</title>
      <link>https://www.techradar.com/pro/acer-travelmate-p6-14-ai-laptop-review</link>
      <pubDate>Fri, 06 Feb 2026 07:15:00 +0000</pubDate>
      <guid isPermaLink="false">BiZt7tvJ3afMgiPKtTDRdc</guid>
      <description>The Acer TravelMate P6 14 AI middle-of-the-road laptop that uses a 200-series Core Ultra processor to maximum effect.</description>
    </item>
    <item>
      <title>En retard sur la sant&#233; connect&#233;e, Apple aurait renonc&#233; &#224; son coach sur abonnement</title>
      <link>https://www.01net.com/actualites/en-retard-sur-la-sante-connectee-apple-aurait-renonce-a-son-coach-sur-abonnement.html</link>
      <pubDate>Fri, 06 Feb 2026 07:02:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324450</guid>
      <description>Le &#171;&#160;coach sant&#233; &#187;&#160;sur abonnement qu'Apple d&#233;veloppait depuis quelques ann&#233;es ne sortira probablement jamais des labos de Cupertino. Le constructeur voudrait plut&#244;t int&#233;grer quelques unes des fonctions imagin&#233;es pour ce service dans l'app Sant&#233;.</description>
    </item>
  </channel>
</rss>
