<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 12 Feb 2026 09:56:19 GMT</lastBuildDate>
    <item>
      <title>Fin de la 2G : Free communique toutes les dates de la fermeture progressive du r&#233;seau d&#8217;Orange</title>
      <link>https://www.frandroid.com/marques/free/2974549_fin-de-la-2g-free-communique-a-ses-abonnes-toutes-les-dates-de-la-fermeture-progressive-du-reseau</link>
      <pubDate>Thu, 12 Feb 2026 09:47:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2974549_fin-de-la-2g-free-communique-a-ses-abonnes-toutes-les-dates-de-la-fermeture-progressive-du-reseau</guid>
      <description>
La fin de la 2G approche &#224; grands pas, plus que quelques semaines encore avant l'extinction d&#233;finitive des premiers sites. Cette fermeture progressive commencera dans une poign&#233;e de d&#233;partements avant de s'&#233;tendre au reste de la m&#233;tropole.
</description>
    </item>
    <item>
      <title>Amazon baisse de plus en plus le prix des nouveaux AirPods Pro 3 : les excellents &#233;couteurs d&#8217;Apple sont &#224; un prix in&#233;dit</title>
      <link>https://www.frandroid.com/bons-plans/2862267_amazon-baisse-de-plus-en-plus-le-prix-des-nouveaux-airpods-pro-3-les-excellents-ecouteurs-dapple-sont-a-un-prix-inedit</link>
      <pubDate>Thu, 12 Feb 2026 09:41:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2862267_amazon-baisse-de-plus-en-plus-le-prix-des-nouveaux-airpods-pro-3-les-excellents-ecouteurs-dapple-sont-a-un-prix-inedit</guid>
      <description>
Les AirPods Pro 3 cumulent les qualit&#233;s : performance acoustique, r&#233;duction de bruit active, autonomie, int&#233;gration dans l'&#233;cosyst&#232;me Apple... Ils cochent toutes les cases. On les trouve en ce moment &#224; 219,99 euros au lieu de 249 euros. 
</description>
    </item>
    <item>
      <title>Emmanuel Macron a raison : &#171; Elon Musk est un gars sursubventionn&#233; &#187;</title>
      <link>https://www.frandroid.com/marques/spacex/2974619_emmanuel-macron-a-raison-elon-musk-est-un-gars-sursubventionne</link>
      <pubDate>Thu, 12 Feb 2026 09:39:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/spacex/2974619_emmanuel-macron-a-raison-elon-musk-est-un-gars-sursubventionne</guid>
      <description>
Elon Musk est-il un pur produit du lib&#233;ralisme ? Pas vraiment selon Emmanuel Macron. Le pr&#233;sident fran&#231;ais a rappel&#233; une r&#233;alit&#233; souvent occult&#233;e : sans les milliards de dollars des agences f&#233;d&#233;rales am&#233;ricaines, Tesla et SpaceX n'existeraient probablement pas aujourd'hui.
</description>
    </item>
    <item>
      <title>Windows 11 : une faille critique dans le Bloc-notes corrig&#233;e par la derni&#232;re mise &#224; jour</title>
      <link>https://www.frandroid.com/marques/microsoft/2974471_windows-11-une-faille-critique-dans-le-bloc-notes-corrigee-par-la-derniere-mise-a-jour</link>
      <pubDate>Thu, 12 Feb 2026 09:37:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2974471_windows-11-une-faille-critique-dans-le-bloc-notes-corrigee-par-la-derniere-mise-a-jour</guid>
      <description>
Les r&#233;cents efforts de modernisation du Bloc-notes par Microsoft ont provoqu&#233; une faille de s&#233;curit&#233; critique qui vient heureusement d'&#234;tre corrig&#233;e.
</description>
    </item>
    <item>
      <title>Windows 11 veut renforcer sa &#171;&#160;s&#233;curit&#233; de base&#160;&#187; avec de nouvelles permissions</title>
      <link>https://www.frandroid.com/marques/microsoft/2974505_windows-11-veut-renforcer-sa-securite-de-base-avec-de-nouvelles-permissions</link>
      <pubDate>Thu, 12 Feb 2026 09:36:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2974505_windows-11-veut-renforcer-sa-securite-de-base-avec-de-nouvelles-permissions</guid>
      <description>
Les &#233;quipes de Microsoft veulent renforcer la s&#233;curit&#233; de Windows 11 en ajoutant de nouvelles permissions. De quoi informer les utilisateurs des donn&#233;es auxquelles ont acc&#232;s leurs applications.
</description>
    </item>
    <item>
      <title>Cette marque de PC va encore augmenter ses prix : la crise continue</title>
      <link>https://www.frandroid.com/marques/framework/2974541_cette-marque-de-pc-va-encore-augmenter-ses-prix-la-crise-continue</link>
      <pubDate>Thu, 12 Feb 2026 09:33:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/framework/2974541_cette-marque-de-pc-va-encore-augmenter-ses-prix-la-crise-continue</guid>
      <description>
La marque ind&#233;pendante de PC modulaire Framework annonce une nouvelle vague d'augmentation de prix. En cause, une nouvelle fois, le prix de la m&#233;moire.
</description>
    </item>
    <item>
      <title>R&#233;seau CB : tout comprendre sur l&#8217;alternative fran&#231;aise &#224; Visa et Mastercard</title>
      <link>https://www.frandroid.com/services/banque-en-ligne/2974535_reseau-cb-tout-comprendre-sur-lalternative-francaise-a-visa-et-mastercard</link>
      <pubDate>Thu, 12 Feb 2026 09:30:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/banque-en-ligne/2974535_reseau-cb-tout-comprendre-sur-lalternative-francaise-a-visa-et-mastercard</guid>
      <description>
On l'utilise tous les jours, on en parle tout le temps, mais on ne sait pas vraiment ce que c'est. Le r&#233;seau CB, ce petit logo sur votre carte, est au c&#339;ur d'une bataille de souverainet&#233; et de gros sous. 
</description>
    </item>
    <item>
      <title>Apple acquires Severance and will produce future seasons in-house</title>
      <link>https://www.engadget.com/entertainment/streaming/apple-acquires-severance-and-will-produce-future-seasons-in-house-092405747.html?src=rss</link>
      <pubDate>Thu, 12 Feb 2026 09:24:05 +0000</pubDate>
      <guid isPermaLink="false">ff0f7a2e-c20f-46e3-bd0b-f1f0a990ff93</guid>
      <description>Apple&#8217;s in-house studio will be producing the future seasons of Severance, according to Deadline. The company has reportedly acquired the show&#8217;s IP and all rights from its original studio, Fifth Season, back in December in a deal that was worth approximately $70 million. Fifth Season will remain as an executive producer, but Apple Studios will now be in charge of the show. Severance will be one of Apple&#8217;s marquee titles, alongside other shows like Owen Wilson&#8217;s Stick and Kristen Wiig&#8217;s Palm Royale. Apple also previously acquired sci-fi dystopian series Silo after its first season.Deadline repo...</description>
    </item>
    <item>
      <title>DJI (Avinox) pr&#233;parerait deux nouveaux moteurs pour v&#233;lo &#233;lectrique : l&#8217;un surpuissant, l&#8217;autre pour les VAE urbains</title>
      <link>https://www.frandroid.com/marques/dji/2974575_dji-avinox-preparerait-deux-nouveaux-moteurs-pour-velo-electrique-lun-surpuissant-lautre-pour-les-vae-urbains</link>
      <pubDate>Thu, 12 Feb 2026 09:22:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dji/2974575_dji-avinox-preparerait-deux-nouveaux-moteurs-pour-velo-electrique-lun-surpuissant-lautre-pour-les-vae-urbains</guid>
      <description>
Le motoriste Avinox, d&#233;sormais ind&#233;pendant de DJI, pourrait pr&#233;senter d&#232;s le mois d&#8217;avril 2026 deux nouvelles motorisations pour v&#233;los &#233;lectriques, dont une version haute performance destin&#233;e aux VTTAE et une d&#233;clinaison all&#233;g&#233;e orient&#233;e vers les usages urbains.
</description>
    </item>
    <item>
      <title>Xiaomi d&#233;fie Apple&#160;: le Xiaomi Tag arrive &#224; moins de 20&#160;&#8364;</title>
      <link>https://www.01net.com/actualites/xiaomi-defie-apple-le-xiaomi-tag-arrive-a-moins-de-20-e.html</link>
      <pubDate>Thu, 12 Feb 2026 09:16:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325550</guid>
      <description>Apr&#232;s l&#8217;AirTag d&#8217;Action, Xiaomi pr&#233;pare son propre traqueur Bluetooth, le Xiaomi Tag, qui arrivera &#224; un prix bien plus abordable. Selon WinFuture et une page officielle Mi, il serait livr&#233; autour de 18 euros l&#8217;unit&#233; et 60 euros les quatre, avec une autonomie d&#8217;environ un an et une connectivit&#233; Bluetooth 5.4 et NFC, sans garantie d&#8217;UWB pour le moment....</description>
    </item>
    <item>
      <title>C&#8217;est historique : AMD signe sa meilleure ann&#233;e sur le march&#233; des processeurs</title>
      <link>https://www.frandroid.com/marques/amd/2974499_cest-historique-amd-signe-sa-meilleure-annee-sur-le-marche-des-processeurs</link>
      <pubDate>Thu, 12 Feb 2026 09:08:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amd/2974499_cest-historique-amd-signe-sa-meilleure-annee-sur-le-marche-des-processeurs</guid>
      <description>
AMD affiche une excellente sant&#233; financi&#232;re en 2025 et atteint des parts de march&#233; encore jamais vues depuis l'arriv&#233;e de l'architecture Ryzen.
</description>
    </item>
    <item>
      <title>How the 4-day workweek allows workers to get more done</title>
      <link>https://www.fastcompany.com/91480452/how-the-four-day-workweek-allows-workers-to-get-more-done</link>
      <pubDate>2026-02-12T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480452/how-the-four-day-workweek-allows-workers-to-get-more-done</guid>
      <description>Companies that adopt a shorter workweek typically use it to address significant challenges related to employee well-being, recruitment, or tech adoption.
Below, co-authors Jared Lindzon and Joe O&#8217;Connor share five key insights from their new book,&#160;Do More in Four: Why It&#8217;s Time for a Shorter Workweek.</description>
    </item>
    <item>
      <title>Apr&#232;s la chute de sa femme, il invente le v&#233;lo &#233;lectrique id&#233;al pour les s&#233;niors</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2973989_apres-la-chute-de-sa-femme-il-invente-le-velo-electrique-ideal-pour-les-seniors</link>
      <pubDate>Thu, 12 Feb 2026 08:49:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2973989_apres-la-chute-de-sa-femme-il-invente-le-velo-electrique-ideal-pour-les-seniors</guid>
      <description>
Id&#233;e du designer industriel Laurent Lamballais, l&#8217;Ad&#233;lid&#233;laa est un v&#233;lo &#233;lectrique dot&#233; d'une g&#233;om&#233;trie sp&#233;ciale et &#233;tudi&#233;e pour offrir une excellente stabilit&#233;, notamment pour rassurer les s&#233;niors.
</description>
    </item>
    <item>
      <title>Google Meet introduit une nouvelle option attendue de longue date par les utilisateurs</title>
      <link>https://www.01net.com/actualites/google-meet-introduit-une-nouvelle-option-attendue-de-longue-date-par-les-utilisateurs.html</link>
      <pubDate>Thu, 12 Feb 2026 08:38:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325546</guid>
      <description>Google est en train de d&#233;ployer une importante nouveaut&#233; dans Google Meet. L&#8217;application de visioconf&#233;rence va enfin permettre aux participants de d&#233;placer le contenu partag&#233; dans l&#8217;&#233;cran principal au sein d&#8217;une nouvelle fen&#234;tre.</description>
    </item>
    <item>
      <title>Temp&#234;te Nils&#160;: le kit de survie num&#233;rique pour ne pas finir coup&#233; du monde</title>
      <link>https://www.01net.com/actualites/tempete-nils-le-kit-de-survie-numerique-pour-ne-pas-finir-coupe-du-monde.html</link>
      <pubDate>Thu, 12 Feb 2026 08:38:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325534</guid>
      <description>La temp&#234;te Nils gronde et le risque de coupure &#233;lectrique est r&#233;el. Avant que tout ne saute, voici la check-list vitale pour garder votre smartphone en vie.</description>
    </item>
    <item>
      <title>Il veut prendre la place de votre TV : ce vid&#233;oprojecteur laser &#224; ultra courte focale 4K est en promo</title>
      <link>https://www.frandroid.com/bons-plans/2973469_il-veut-prendre-la-place-de-votre-tv-ce-videoprojecteur-laser-a-ultra-courte-focale-4k-est-en-promo</link>
      <pubDate>Thu, 12 Feb 2026 08:23:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2973469_il-veut-prendre-la-place-de-votre-tv-ce-videoprojecteur-laser-a-ultra-courte-focale-4k-est-en-promo</guid>
      <description>
Si vous aimez voir les choses en grand, le vid&#233;oprojecteur laser Hisense PX3 peut projeter une image 4K de 150 pouces pour 1 799 euros au lieu de 1 990 euros.
</description>
    </item>
    <item>
      <title>Alerte sur l&#8217;iPhone&#160;: Apple met en garde contre une cyberattaque &#171;&#160;extr&#234;mement sophistiqu&#233;e&#160;&#187;</title>
      <link>https://www.01net.com/actualites/faille-iphone-apple-met-garde-contre-cyberattaque-extremement-sophistiquee.html</link>
      <pubDate>Thu, 12 Feb 2026 08:16:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325531</guid>
      <description>Une faille de s&#233;curit&#233; zero day a &#233;t&#233; d&#233;couverte sur l'iPhone. D&#233;busqu&#233;e par Google, la vuln&#233;rabilit&#233; est exploit&#233;e dans le cadre d'une cyberattaque visant des utilisateurs Apple. La firme parle d&#8217;attaque &#171; extr&#234;mement sophistiqu&#233;e &#187; et pousse en urgence une mise &#224; jour de s&#233;curit&#233; sur les smartphones concern&#233;s.</description>
    </item>
    <item>
      <title>The best budgeting apps for 2026</title>
      <link>https://www.engadget.com/apps/best-budgeting-apps-120036303.html?src=rss</link>
      <pubDate>Thu, 12 Feb 2026 08:01:26 +0000</pubDate>
      <guid isPermaLink="false">1bf1c17b-7ece-4b18-b17b-dc7b5e70f411</guid>
      <description>As a former Mint user, I had to find a new budgeting app not too long ago. Intuit, parent company of Mint, shut down the service in March 2024, and prompted users to transition to its other financial app, Credit Karma. However, after testing Credit Karma myself, I found it to be a poor Mint replacement &#8212; that meant I needed to branch out and look elsewhere for a trusted app to track all of my financial accounts, monitor my credit score, follow a monthly spending plan and set goals like building a rainy-day fund and paying down my mortgage faster.I tried out Mint's top competitors in the hopes ...</description>
    </item>
    <item>
      <title>How to Get to Heaven from Belfast review: Derry Girls creator is 2 for 2 as new Netflix show pairs Irish wit with unhinged trauma &#8212; and it works</title>
      <link>https://www.techradar.com/streaming/netflix/how-to-get-to-heaven-from-belfast-review</link>
      <pubDate>Thu, 12 Feb 2026 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">Z57kpKrjjkp9rehF8hGguD</guid>
      <description>How to Get to Heaven from Belfast has all the Derry Girls Easter eggs you could possibly want, only its Irish charm comes with a dark side.</description>
    </item>
    <item>
      <title>How to Get to Heaven From Belfast review: A must-watch for Derry Girls fans</title>
      <link>https://mashable.com/article/how-to-get-to-heaven-from-belfast-review</link>
      <pubDate>Thu, 12 Feb 2026 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">030qlX6sOP1NccqY43o1fUu</guid>
      <description>Lisa McGee is back with a hilarious and dark mystery, "How to Get to Heaven From Belfast." Review.</description>
    </item>
    <item>
      <title>How to Get to Heaven From Belfast has a perfect Derry Girls Easter egg</title>
      <link>https://mashable.com/article/how-to-get-to-heaven-from-belfast-derry-girls-easter-egg</link>
      <pubDate>Thu, 12 Feb 2026 08:00:01 +0000</pubDate>
      <guid isPermaLink="false">04SM1mU95dCm75BcljFuxPN</guid>
      <description>"Derry Girls" creator Lisa McGee included a reference to her high school comedy in her new Netflix show "How to Get to Heaven From Belfast."</description>
    </item>
    <item>
      <title>Ubisoft workers strike in protest of job cuts and return-to-office mandate</title>
      <link>https://mashable.com/article/ubisoft-strike-restructure-layoffs</link>
      <pubDate>Thu, 12 Feb 2026 07:58:12 +0000</pubDate>
      <guid isPermaLink="false">06jeVI37uIOcx2SVn6Oagrf</guid>
      <description>At least 1,200 employees Ubisoft employees are striking after it announced a major restructure resulting in job losses.</description>
    </item>
  </channel>
</rss>
