<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 03 Feb 2026 11:38:04 GMT</lastBuildDate>
    <item>
      <title>Tesla lance un Model Y 4&#215;4 &#224; prix cass&#233; : pourquoi vous ne le verrez sans doute jamais en FranceTesla Model Y AWD USA</title>
      <link>https://www.frandroid.com/marques/tesla/2964437_tesla-lance-un-model-y-4x4-a-prix-casse-pourquoi-vous-ne-le-verrez-sans-doute-jamais-en-francetesla-model-y-awd-usa</link>
      <pubDate>Tue, 03 Feb 2026 11:32:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2964437_tesla-lance-un-model-y-4x4-a-prix-casse-pourquoi-vous-ne-le-verrez-sans-doute-jamais-en-francetesla-model-y-awd-usa</guid>
      <description>
Tesla d&#233;gaine une nouvelle version de son best-seller outre-Atlantique. Un Model Y "Standard" mais en transmission int&#233;grale, qui en dit long sur la capacit&#233; d'adaptation (ou d'improvisation) de la firme d'Elon Musk.
</description>
    </item>
    <item>
      <title>'It's time to demand AI that is safe by design': What AI experts think will matter most in 2026</title>
      <link>https://www.techradar.com/ai-platforms-assistants/its-time-to-demand-ai-that-is-safe-by-design-what-ai-experts-think-will-matter-most-in-2026</link>
      <pubDate>Tue, 03 Feb 2026 11:31:57 +0000</pubDate>
      <guid isPermaLink="false">u9P48DoaXNwnCTbwmUSXUJ</guid>
      <description>The hopes, expectations, and AI trends to look out for over the next year, according to the experts.</description>
    </item>
    <item>
      <title>Galaxy S24 FE : cette version sp&#233;ciale du smartphone de Samsung est presque &#224; moiti&#233; prix</title>
      <link>https://www.frandroid.com/bons-plans/2964013_galaxy-s24-fe-cette-version-speciale-du-smartphone-de-samsung-est-presque-a-moitie-prix</link>
      <pubDate>Tue, 03 Feb 2026 11:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2964013_galaxy-s24-fe-cette-version-speciale-du-smartphone-de-samsung-est-presque-a-moitie-prix</guid>
      <description>
Le Samsung Galaxy S24 FE Entreprise Edition est similaire au mod&#232;le classique, avec quelques fonctions logicielles suppl&#233;mentaires. On le trouve aujourd'hui &#224; 399 euros au lieu de 749 euros au lancement.
</description>
    </item>
    <item>
      <title>All the Sports You Won&#8217;t See at the 2026 Winter Olympics</title>
      <link>https://www.wired.com/story/winter-olympics-2026-long-lost-events/</link>
      <pubDate>Tue, 03 Feb 2026 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">69752a6ff37decb34891d5c8</guid>
      <description>The makeup of the Winter Olympics has changed many times in the 100-plus years of the Games. Here are some sports that haven&#8217;t stood the test of time.</description>
    </item>
    <item>
      <title>12 Athletes to Watch at the 2026 Winter Olympics</title>
      <link>https://www.wired.com/story/12-atletes-to-watch-2026-winter-olympics-historic/</link>
      <pubDate>Tue, 03 Feb 2026 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">6978cf417ea082ec474e0ac6</guid>
      <description>History is already being made at the Milano Cortina Games&#8212;and they haven&#8217;t even started.</description>
    </item>
    <item>
      <title>Nick Goepper&#8217;s Starter Pack: Winter Olympics 2026</title>
      <link>https://www.wired.com/story/freestyle-skier-nick-goeppers-olympic-starter-pack/</link>
      <pubDate>Tue, 03 Feb 2026 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">696a902eb35feb809a8fe07f</guid>
      <description>What a three-time Olympic medalist packs for the Milano Cortina Winter Games.</description>
    </item>
    <item>
      <title>Ikea d&#233;voile une enceinte pour enfants &#224; 15 euros en forme de souris</title>
      <link>https://www.01net.com/actualites/ikea-devoile-une-enceinte-a-15-euros-en-forme-de-souris-pour-les-enfants.html</link>
      <pubDate>Tue, 03 Feb 2026 11:26:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323900</guid>
      <description>Apr&#232;s la Kallsup, sa petite enceinte Bluetooth &#224; 5&#8239;euros, Ikea continue d&#8217;investir dans l&#8217;audio avec un nouveau mod&#232;le d&#8217;entr&#233;e de gamme. Destin&#233;e aux enfants, la Grejsimojs mise sur un design ludique en forme de souris, une conception r&#233;sistante et un prix toujours tr&#232;s accessible de 14,99&#8239;euros.</description>
    </item>
    <item>
      <title>Ce journaliste a recharg&#233; une voiture &#233;lectrique en 3 minutes : voici comment il y est arriv&#233;</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2964233_ce-journaliste-a-recharge-une-voiture-electrique-en-3-minutes-voici-comment-il-y-est-arrive</link>
      <pubDate>Tue, 03 Feb 2026 11:25:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2964233_ce-journaliste-a-recharge-une-voiture-electrique-en-3-minutes-voici-comment-il-y-est-arrive</guid>
      <description>
La startup britannique Nyobolt continue le d&#233;veloppement de sa batterie &#224; la recharge ultra-rapide. Install&#233;e sur une voiture &#233;lectrique exp&#233;rimentale, elle peut passer de 30 &#224; 80 % en 3 minutes seulement &#8211; aussi vite qu'un plein d'essence. L'arriv&#233;e est pr&#233;vue en s&#233;rie avant 2030.
</description>
    </item>
    <item>
      <title>Notepad++ hit by suspected Chinese state-sponsored hackers - here's what we know so far</title>
      <link>https://www.techradar.com/pro/security/notepad-hit-by-suspected-chinese-state-sponsored-hackers-heres-what-we-know-so-far</link>
      <pubDate>Tue, 03 Feb 2026 11:25:00 +0000</pubDate>
      <guid isPermaLink="false">nBG7XeGVDHRcmLiBc97znM</guid>
      <description>Notepad++ targeted and used to deliver poisoned updates to a select group of victims.</description>
    </item>
    <item>
      <title>After entering administration last month, Frasers Group-owned UK retailer Game is officially closing the rest of its standalone stores</title>
      <link>https://www.techradar.com/gaming/after-entering-administration-last-month-frasers-group-owned-uk-retailer-game-is-officially-closing-the-rest-of-its-standalone-stores</link>
      <pubDate>Tue, 03 Feb 2026 11:23:04 +0000</pubDate>
      <guid isPermaLink="false">cj5tVnXRkqQy8VVnJY9sni</guid>
      <description>Long-running UK retailer Game is officially closing the last of its standalone stores, after entering administration last month. It's also confirmed that managing director Nick Arran is exiting the company after nine years.</description>
    </item>
    <item>
      <title>Plus que quelques heures pour profiter des 10 meilleures offres chez Carrefour</title>
      <link>https://www.frandroid.com/bons-plans/2941339_plus-que-quelques-heures-pour-profiter-des-10-meilleures-offres-chez-carrefour</link>
      <pubDate>Tue, 03 Feb 2026 11:21:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2941339_plus-que-quelques-heures-pour-profiter-des-10-meilleures-offres-chez-carrefour</guid>
      <description>
Les soldes d&#8217;hiver se terminent ce soir et Carrefour continue de baisser le prix de plusieurs produits Tech. Des TV, aux smartphones, en passant par les tablettes, il y en a pour tous les go&#251;ts ! Retrouvez notre s&#233;lection des derni&#232;res offres &#224; saisir chez l&#8217;enseigne.&#160;
</description>
    </item>
    <item>
      <title>Sony imagine une nouvelle manette r&#233;volutionnaie sans aucun bouton physique et qui pr&#233;voit vos actions</title>
      <link>https://www.frandroid.com/marques/sony/2964201_sony-imagine-une-nouvelle-manette-revolutionnaie-sans-aucun-bouton-physique-et-qui-prevoit-vos-actions</link>
      <pubDate>Tue, 03 Feb 2026 11:19:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2964201_sony-imagine-une-nouvelle-manette-revolutionnaie-sans-aucun-bouton-physique-et-qui-prevoit-vos-actions</guid>
      <description>
Sony vient de voir un de ses brevets valid&#233;s pour une manette &#224; &#233;cran tactile sans le moindre bouton. De quoi offrir une modularit&#233; exemplaire aux joueurs.
</description>
    </item>
    <item>
      <title>Panneaux solaires chinois : aucune preuve d&#8217;espionnage, mais une faille de s&#233;curit&#233; persiste</title>
      <link>https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2964075_panneaux-solaires-chinois-aucune-preuve-despionnage-mais-une-faille-de-securite-persiste</link>
      <pubDate>Tue, 03 Feb 2026 11:19:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2964075_panneaux-solaires-chinois-aucune-preuve-despionnage-mais-une-faille-de-securite-persiste</guid>
      <description>
Les onduleurs des panneaux solairs chinois ne seraient-ils finalement pas si risqu&#233;s&#8201;? Selon une recherche men&#233;e par les Am&#233;ricains, il n&#8217;existe aucune preuve que ces &#233;quipements aient &#233;t&#233; utilis&#233;s pour espionner ou perturber le r&#233;seau. N&#233;anmoins, ces appareils pr&#233;sentent certaines vuln&#233;rabilit&#233;s qui pourraient &#234;tre exploit&#233;es pour affecter les syst&#232;mes &#233;lectriques.
...</description>
    </item>
    <item>
      <title>Microsoft Teams will now let you shout about how great you are at work</title>
      <link>https://www.techradar.com/pro/microsoft-teams-will-now-let-you-shout-about-how-great-you-are-at-work</link>
      <pubDate>Tue, 03 Feb 2026 11:18:05 +0000</pubDate>
      <guid isPermaLink="false">sL8bNCPso9DaRACMGjvZDm</guid>
      <description>Show off your 'skills' with an updated profile on Microsoft Teams</description>
    </item>
    <item>
      <title>Logitech just revealed a surprisingly affordable gaming headset it says is designed to help you 'chill anywhere' &#8212; it's stylish and offers a 24 hour battery life</title>
      <link>https://www.techradar.com/gaming/gaming-accessories/logitech-just-revealed-a-surprisingly-affordable-gaming-headset-it-says-is-designed-to-help-you-chill-anywhere-its-stylish-and-offers-a-24-hour-battery-life</link>
      <pubDate>Tue, 03 Feb 2026 11:16:00 +0000</pubDate>
      <guid isPermaLink="false">A7GpLFSfFZzuV8QSjMuEKY</guid>
      <description>Logitech has just revealed the new G325 Lightspeed, a wireless gaming headset at a budget price.</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : voici les ultimes offres &#224; saisir pour ce dernier jour de promotions</title>
      <link>https://www.frandroid.com/bons-plans/2957561_soldes-dhiver-2026-voici-les-ultimes-offres-a-saisir-pour-ce-dernier-jour-de-promotions</link>
      <pubDate>Tue, 03 Feb 2026 11:08:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2957561_soldes-dhiver-2026-voici-les-ultimes-offres-a-saisir-pour-ce-dernier-jour-de-promotions</guid>
      <description>
Il ne faut pas se le cacher, la derni&#232;re d&#233;marque des soldes est souvent le moment o&#249; l'on trouve les meilleures offres, car les e-commer&#231;ants comme Amazon, Fnac, Darty ou encore Boulanger veulent &#233;couler les derniers stocks. Et c'est encore plus le cas pendant le dernier jour de l'&#233;v&#233;nement... 
</description>
    </item>
    <item>
      <title>X's Paris HQ raided by French prosecutors</title>
      <link>https://www.engadget.com/social-media/xs-paris-hq-raided-by-french-prosecutors-110411170.html?src=rss</link>
      <pubDate>Tue, 03 Feb 2026 11:04:11 +0000</pubDate>
      <guid isPermaLink="false">06a0419b-a1f3-4338-aaa7-b5442b1f07a4</guid>
      <description>Paris prosecutors announced that a search was underway at offices belong to Elon Musk&#8217;s X platform as part of an ongoing investigation first launched in January 2025. The raid is being conducted by Paris and national cybercrime units, with support from Interpol, according to post from Paris prosecutors on X. Officials from X have yet to comment on the matter.  At the same time, Paris prosecutors issued summonses to Elon Musk and Linda Yaccarino for &#8220;voluntary interviews&#8221; on April 20, 2026 in Paris. The prosecutors also announced they would no longer use X and would only communicate on LinkedIn...</description>
    </item>
    <item>
      <title>Malwarebytes and ChatGPT team up to check all of those suspicious texts, emails, and URLs with one simple phrase</title>
      <link>https://www.techradar.com/pro/security/malwarebytes-and-chatgpt-team-up-to-check-all-of-those-suspicious-texts-emails-and-urls-with-one-simple-phrase</link>
      <pubDate>Tue, 03 Feb 2026 11:03:07 +0000</pubDate>
      <guid isPermaLink="false">vpcck3MJdwEZwtG77Wkq8J</guid>
      <description>Malwarebytes and ChatGPT are teaming up to provide quick, easy, and free scam checking with just one simple phrase</description>
    </item>
    <item>
      <title>Linux devient plus populaire chez les joueurs, mais pourquoi au juste ?</title>
      <link>https://www.frandroid.com/os/gnu-linux/2963877_linux-devient-plus-populaire-chez-les-joueurs-mais-pourquoi-au-juste</link>
      <pubDate>Tue, 03 Feb 2026 11:01:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/gnu-linux/2963877_linux-devient-plus-populaire-chez-les-joueurs-mais-pourquoi-au-juste</guid>
      <description>
Les derni&#232;res donn&#233;es Steam Survey d&#233;montrent qu'un nombre croissant de joueurs utilisent Linux. Si l'OS reste employ&#233; tr&#232;s marginalement par rapport &#224; Windows, son taux d'adoption, chaque ann&#233;e un peu plus important, dit quelque chose.
</description>
    </item>
    <item>
      <title>Notepad ++ a &#233;t&#233; pirat&#233; sur plusieurs mois par la Chine : voici ce qu&#8217;il faut savoir</title>
      <link>https://www.frandroid.com/culture-tech/securite-applications/2963933_notepad-a-ete-pirate-sur-plusieurs-mois-par-la-chine-voici-ce-quil-faut-savoir</link>
      <pubDate>Tue, 03 Feb 2026 11:00:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/securite-applications/2963933_notepad-a-ete-pirate-sur-plusieurs-mois-par-la-chine-voici-ce-quil-faut-savoir</guid>
      <description>
L&#8217;&#233;diteur de texte open source Notepad++ a indiqu&#233; avoir &#233;t&#233; victime d&#8217;une attaque de la part de hackers soutenus par la Chine.
</description>
    </item>
    <item>
      <title>&#8216;She Has a Presence&#8217;: The &#8216;Melania&#8217; Superfans Who Turned Up for Opening Weekend</title>
      <link>https://www.wired.com/story/she-has-a-presence-the-melania-superfans-who-turned-up-for-opening-weekend/</link>
      <pubDate>Tue, 03 Feb 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">697cf7e2cec7b395a9761b3f</guid>
      <description>WIRED attended two documentary screening parties&#8212;one on each coast&#8212;for the First Lady&#8217;s film. What a time.</description>
    </item>
    <item>
      <title>How Data Brokers Can Fuel Violence Against Public Servants</title>
      <link>https://www.wired.com/story/how-data-brokers-can-fuel-violence-against-public-servants/</link>
      <pubDate>Tue, 03 Feb 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">697d1aadebbd70548ef50cbb</guid>
      <description>A new report from the Public Service Alliance finds state privacy laws offer public servants few ways to protect their private data, even as threats against them are on the rise.</description>
    </item>
    <item>
      <title>How to tear gas children</title>
      <link>https://www.theverge.com/policy/872783/tear-gas-children-portland-ice-labor</link>
      <pubDate>2026-02-03T06:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=872783</guid>
      <description>The day after the second general strike in Minneapolis, the labor unions of Portland, Oregon, marched in solidarity. It was the warmest day that Portland had seen in a while, with sun peeking out from the clouds here and there. Many people had brought their entire families; not just older children, but toddlers in strollers [&#8230;]</description>
    </item>
    <item>
      <title>Avalanche thinks the fusion power industry should think smaller</title>
      <link>https://techcrunch.com/2026/02/03/avalanche-thinks-the-fusion-power-industry-should-think-smaller/</link>
      <pubDate>Tue, 03 Feb 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3088849</guid>
      <description>Avalanche has raised $29 million in fresh funding to pursue its unique approach to fusion power, which can currently fit on a table.</description>
    </item>
    <item>
      <title>Les voitures &#233;lectriques chinoises de Volkswagen vendues en Europe sont les premi&#232;res &#224; b&#233;n&#233;ficier du nouveau tarif plancher</title>
      <link>https://www.frandroid.com/marques/volkswagen/2964253_les-voitures-electriques-chinoises-de-volkswagen-vendues-en-europe-sont-les-premieres-a-beneficier-du-nouveau-tarif-plancher</link>
      <pubDate>Tue, 03 Feb 2026 10:58:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2964253_les-voitures-electriques-chinoises-de-volkswagen-vendues-en-europe-sont-les-premieres-a-beneficier-du-nouveau-tarif-plancher</guid>
      <description>
Volkswagen est le premier constructeur au monde &#224; appliquer le nouveau m&#233;canisme de prix plancher pr&#233;vu par l'Europe pour les voitures &#233;lectriques produites en Chine. Le Cupra Tavascan est le premier v&#233;hicule &#224; b&#233;n&#233;ficier de cette nouvelle l&#233;gislation, et ce n'est pas forc&#233;ment une bonne nouvelle pour le consommateur europ&#233;en.
</description>
    </item>
    <item>
      <title>The inevitable has happened &#8212; the Switch has finally outsold the DS, making it Nintendo's all-time best-selling console</title>
      <link>https://www.techradar.com/gaming/the-inevitable-has-happened-the-switch-has-finally-outsold-the-ds-making-it-nintendos-all-time-best-selling-console</link>
      <pubDate>Tue, 03 Feb 2026 10:49:17 +0000</pubDate>
      <guid isPermaLink="false">4GeEt29uSp7w69dXWnwDmg</guid>
      <description>The original Nintendo Switch continues to do gangbusters, finally surpassing the DS's monstrous lifetime sales.</description>
    </item>
    <item>
      <title>Amazon lance une grande braderie pour le tout dernier jour des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2933045_amazon-lance-une-grande-braderie-pour-le-tout-dernier-jour-des-soldes</link>
      <pubDate>Tue, 03 Feb 2026 10:43:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933045_amazon-lance-une-grande-braderie-pour-le-tout-dernier-jour-des-soldes</guid>
      <description>
Jusqu&#8217;&#224; ce soir 23h59, Amazon continue de faire profiter de belles offres sur de nombreux produits Tech pour le dernier jour des soldes. Voici celles qui valent r&#233;ellement le coup avant la fin. 
</description>
    </item>
    <item>
      <title>Jimmy Kimmel slams Trump and Musk over latest Epstein files release</title>
      <link>https://mashable.com/video/jimmy-kimmel-donald-trump-elon-musk-epstein-files</link>
      <pubDate>Tue, 03 Feb 2026 10:40:55 +0000</pubDate>
      <guid isPermaLink="false">02X6QM1uGZwuZLdr5z2uoZn</guid>
      <description>Jimmy Kimmel has unpacked the latest Epstein file release, including new mentions of Donald Trump and Elon Musk.</description>
    </item>
    <item>
      <title>Shark&#8217;s self-emptying four-star cordless vac hits lowest price since Black Friday</title>
      <link>https://www.techradar.com/home/vacuums/sharks-self-emptying-four-star-cordless-vac-hits-lowest-price-since-black-friday</link>
      <pubDate>Tue, 03 Feb 2026 10:38:59 +0000</pubDate>
      <guid isPermaLink="false">LpS6Vqy7Rzmm6TPKGBYyyh</guid>
      <description>Save over &#163;50 on the Shark Detect Clean &amp; Empty at Amazon</description>
    </item>
    <item>
      <title>Quels sont les meilleurs smartphones gaming en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/smartphones/529525_quels-sont-les-meilleurs-smartphones-pour-jouer-a-fortnite-en-2018-notre-selection</link>
      <pubDate>Tue, 03 Feb 2026 10:35:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/smartphones/529525_quels-sont-les-meilleurs-smartphones-pour-jouer-a-fortnite-en-2018-notre-selection</guid>
      <description>
Vous &#234;tes en qu&#234;te d'un bon smartphone gaming ? Gr&#226;ce &#224; cette s&#233;lection, vous trouverez le mod&#232;le de t&#233;l&#233;phone qu'il vous faut pour jouer &#224; des jeux exigeants tels que Fortnite, PUBG ou Genshin Impact.
</description>
    </item>
    <item>
      <title>'Beauty and farming are not often thought of in the same breath, but we&#8217;ve brought them together' &#8211; James Dyson on why the brand's farms are playing a key role in its new haircare launch</title>
      <link>https://www.techradar.com/home/hair-care/beauty-and-farming-are-not-often-thought-of-in-the-same-breath-but-weve-brought-them-together-james-dyson-on-why-the-brands-farms-are-playing-a-key-role-in-its-new-haircare-launch</link>
      <pubDate>Tue, 03 Feb 2026 10:30:53 +0000</pubDate>
      <guid isPermaLink="false">xhvzbdom3hofpb4PuqcrvH</guid>
      <description>Dyson has launched a bubble scalp treatment that uses a surprising ingredient to tackle hair loss, banish excess oil and guard against flakes.</description>
    </item>
    <item>
      <title>Rising Temperatures Are Taking a Toll on Sleep Health</title>
      <link>https://www.wired.com/story/climate-change-heat-sleep-apnea/</link>
      <pubDate>Tue, 03 Feb 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">6980a81905b7bc67ee36cca8</guid>
      <description>As nights get hotter around the globe due to climate change, the prevalence of sleep apnea is expected to increase by as much as threefold.</description>
    </item>
    <item>
      <title>Saudi Arabia&#8217;s newest superlative: The world&#8217;s largest, fastest, and longest roller coaster</title>
      <link>https://www.fastcompany.com/91485191/saudi-arabia-falcons-flight-roller-coaster</link>
      <pubDate>2026-02-03T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91485191/saudi-arabia-falcons-flight-roller-coaster</guid>
      <description>The Falcons Flight ride at Six Flags Qiddiya City uses magnets to reach peak speeds of 155 mph. 
The record-breaking Falcons Flight roller coaster starts out slow, but don&#8217;t be fooled. Seconds into the ride at the new Six Flags Qiddiya City in Saudi Arabia, passengers are jolted into a high-speed journey that ascends mountainsides, passes through dark tunnels, and then does it all over again....</description>
    </item>
    <item>
      <title>Apr&#232;s ChatGPT et Atlas, OpenAI lance Codex sur macOS</title>
      <link>https://www.01net.com/actualites/apres-chatgpt-et-atlas-openai-lance-codex-sur-macos.html</link>
      <pubDate>Tue, 03 Feb 2026 10:28:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323894</guid>
      <description>OpenAI d&#233;voile une troisi&#232;me application pour macOS. Apr&#232;s ChatGPT et Atlas, Codex vous permettra de superviser plusieurs agents d&#8217;intelligence artificielle depuis une interface unique.</description>
    </item>
    <item>
      <title>Perquisitions dans les locaux de Twitter / X : le Parquet de Paris quitte la plateforme</title>
      <link>https://www.frandroid.com/culture-tech/2964095_perquisitions-dans-les-locaux-de-twitter-x-le-parquet-de-paris-quitte-la-plateforme</link>
      <pubDate>Tue, 03 Feb 2026 10:27:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/2964095_perquisitions-dans-les-locaux-de-twitter-x-le-parquet-de-paris-quitte-la-plateforme</guid>
      <description>
C'est une annonce majeure que vient de faire le Parquet de Paris : les locaux fran&#231;ais de X sont en cours de perquisition. Par coh&#233;rence, le compte officiel annonce le d&#233;part du r&#233;seau social d'Elon Musk.
</description>
    </item>
    <item>
      <title>La volte-face de Porsche sur la voiture &#233;lectrique se poursuit : un projet all&#233;chant pourrait &#234;tre tout bonnement annul&#233;</title>
      <link>https://www.frandroid.com/marques/porsche/2963935_la-volte-face-de-porsche-sur-la-voiture-electrique-se-poursuit-un-projet-allechant-pourrait-etre-tout-bonnement-annule</link>
      <pubDate>Tue, 03 Feb 2026 10:22:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/porsche/2963935_la-volte-face-de-porsche-sur-la-voiture-electrique-se-poursuit-un-projet-allechant-pourrait-etre-tout-bonnement-annule</guid>
      <description>
Le nouveau PDG de Porsche serait tent&#233; d'annuler le projet d'une sportive &#233;lectrique, rempla&#231;ante de la 718. Une &#233;ni&#232;me preuve de la volte-face de la marque sur la voiture &#233;lectrique.
</description>
    </item>
    <item>
      <title>Ce laptop gaming Lenovo boost&#233; &#224; la RTX 5060 avec 32 Go de RAM est &#224; un super prix, l&#8217;offre id&#233;ale pour s&#8217;&#233;quiper sans trop d&#233;penser</title>
      <link>https://www.frandroid.com/bons-plans/2963815_ce-laptop-gaming-booste-a-la-rtx-5060-avec-32-go-de-ram-chute-sous-les-1-000-e-pour-la-fin-des-soldes</link>
      <pubDate>Tue, 03 Feb 2026 10:22:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2963815_ce-laptop-gaming-booste-a-la-rtx-5060-avec-32-go-de-ram-chute-sous-les-1-000-e-pour-la-fin-des-soldes</guid>
      <description>
Si vous cherchez un PC portable solide &#224; prix attractif, E.Leclerc fait une offre sur le Lenovo LOQ 15AHP10 &#224; 999 euros au lieu de 1199 euros qui assure avec son &#233;cran Full HD 144 Hz.
</description>
    </item>
    <item>
      <title>How to watch The Housemaid: When is Sydney Sweeney and Amanda Seyfrieds thriller streaming?</title>
      <link>https://mashable.com/article/how-to-watch-the-housemaid</link>
      <pubDate>Tue, 03 Feb 2026 10:15:34 +0000</pubDate>
      <guid isPermaLink="false">05N6d1dS464Dn753KLcEIhK</guid>
      <description>Find out how to watch "The Housemaid' at home, including when and where the Freida McFadden adaptation is streaming.</description>
    </item>
    <item>
      <title>The Shark AV2501S AI Ultra robot vacuum is on sale for under $300 at Amazon &#8212; save $250</title>
      <link>https://mashable.com/article/feb-3-shark-av2501s-ai-ultra-robot-vacuum-deal</link>
      <pubDate>Tue, 03 Feb 2026 10:12:05 +0000</pubDate>
      <guid isPermaLink="false">075EkVTkvP6NUJGb95TJpFi</guid>
      <description>As of Feb. 3, the Shark AV2501S AI Ultra robot vacuum is discounted at Amazon to $299.99, 45% off its list price of $549.99.</description>
    </item>
    <item>
      <title>Virgin Media O2 owners seal &#163;2bn Netomnia deal in major UK fibre network consolidation</title>
      <link>https://www.techradar.com/pro/virgin-media-o2-owners-seal-gbp2bn-netomnia-deal-in-major-uk-fibre-network-consolidation</link>
      <pubDate>Tue, 03 Feb 2026 10:11:44 +0000</pubDate>
      <guid isPermaLink="false">pyAP3osLRs82dJNtTXSH4M</guid>
      <description>Netomnia could be acquired by Virgin Media O2, but the deal will likely be subject to intense regulatory scrutiny.</description>
    </item>
    <item>
      <title>Upgrade your streaming setup with the Google TV Streamer 4K &#8212; save $20 right now</title>
      <link>https://mashable.com/article/feb-3-google-tv-streamer-deal</link>
      <pubDate>Tue, 03 Feb 2026 10:02:43 +0000</pubDate>
      <guid isPermaLink="false">03Yf10AWbfz4ftO5nyUK0dT</guid>
      <description>Get the best streaming deal. Save 20% on the Google TV streamer 4K at Amazon.</description>
    </item>
    <item>
      <title>The best iPhone 17 and iPhone 17 Pro cases for 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-iphone-cases-153035988.html?src=rss</link>
      <pubDate>Tue, 03 Feb 2026 10:00:35 +0000</pubDate>
      <guid isPermaLink="false">c25c0747-f87d-4c8f-a382-4b76f91b2265</guid>
      <description>Finding the best iPhone 17 case or the best iPhone 17 Pro cases is about more than basic drop protection. The best iPhone cases add useful features like MagSafe compatibility, grippy finishes and protection for camera lenses, all without adding unnecessary bulk to your new iPhone.Whether you prefer slim, scratch resistant designs, matte finishes or leather cases that feel a bit more premium, there are plenty of strong top picks to choose from. We&#8217;ve rounded up the best picks for both the iPhone 17 and 17 Pro, so you don&#8217;t have to waste time scrolling through endless listings.
Best iPhone 17 ca...</description>
    </item>
    <item>
      <title>The Apple AirTag 4-pack is on sale for under $70 at Amazon &#8212; stock up on the older model</title>
      <link>https://mashable.com/article/feb-3-apple-airtags-deal</link>
      <pubDate>Tue, 03 Feb 2026 10:00:33 +0000</pubDate>
      <guid isPermaLink="false">04KU21rHq7TZ3dq3sVYnzdy</guid>
      <description>Find the best Apple AirTag deal at Amazon. Save 29% on the Apple AirTag four-pack at Amazon.</description>
    </item>
    <item>
      <title>Trump Announces Minerals Stockpile Way Too Late for It to Spare Him From Embarrassment by China</title>
      <link>https://gizmodo.com/trump-announces-minerals-stockpile-way-too-late-for-it-to-spare-him-from-embarrassment-by-china-2000717079</link>
      <pubDate>Tue, 03 Feb 2026 10:00:22 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000717079</guid>
      <description>China whacked Trump on the head with rare earth mineral restrictions during the trade war. He's finally buying a hard hat.</description>
    </item>
    <item>
      <title>Why America losing the global EV race hurts its own auto&#160;industry</title>
      <link>https://www.fastcompany.com/91483508/why-america-losing-the-global-ev-race-hurts-its-own-auto-industry</link>
      <pubDate>2026-02-03T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91483508/why-america-losing-the-global-ev-race-hurts-its-own-auto-industry</guid>
      <description>The U.S. risks becoming a follower in the industry it once defined.
At the 2026 Detroit Auto Show, the spotlight quietly shifted. Electric vehicles, once framed as the inevitable future of the industry, were no longer the centerpiece. Instead, automakers emphasized hybrids, updated gasoline models and incremental efficiency improvements.</description>
    </item>
    <item>
      <title>How to watch Patriots vs. Seahawks in the NFL online for free</title>
      <link>https://mashable.com/article/patriots-seahawks-nfl-2026-live-stream-for-free</link>
      <pubDate>Tue, 03 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02P4B9OIpxVBJPFDehtz6oe</guid>
      <description>How to watch NFL for free. Live stream Patriots vs. Seahawks in the 2026 Big Game for free from anywhere in the world.</description>
    </item>
    <item>
      <title>How to watch the 2026 Winter Olympics opening ceremony online for free</title>
      <link>https://mashable.com/article/winter-olympics-opening-ceremony-2026-live-stream-for-free</link>
      <pubDate>Tue, 03 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">04GxSMoMin4Aiw3Ri0y4SNR</guid>
      <description>How to watch opening ceremony for free. Live stream the 2026 Winter Olympics opening ceremony for free from anywhere in the world.</description>
    </item>
    <item>
      <title>How to watch Arsenal vs. Chelsea online for free</title>
      <link>https://mashable.com/article/arsenal-chelsea-efl-cup-2025-live-stream-for-free</link>
      <pubDate>Tue, 03 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">04pkMMdFaHEHasLQYOJfRYq</guid>
      <description>How to watch EFL Cup for free. Live stream Arsenal vs. Chelsea in the EFL Cup for free.</description>
    </item>
    <item>
      <title>From first notes to full songs &#8212; learn the piano at home with this app</title>
      <link>https://mashable.com/article/feb-3-flowkey-classic-plan-3-year-subscription</link>
      <pubDate>Tue, 03 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02ecmtxPoeIwAwDV5qXJ9vZ</guid>
      <description>Learn piano at home with flowkey&#8217;s interactive lessons, real-time feedback, and thousands of songs &#8212; at your own pace, on your own schedule.</description>
    </item>
    <item>
      <title>Dreame X60 Max Ultra first impressions: Its tied for the most powerful robot vacuum of 2026. OK, prove it.</title>
      <link>https://mashable.com/article/dreame-x60-max-ultra-robot-vacuum-first-impressions</link>
      <pubDate>Tue, 03 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">06eslTPmAPiwKbMqdmQrvcU</guid>
      <description>With the X60 Max Ultra, Dreame ties with Roborock for the most powerful robot vacuum right now. I got to try it on my own floors early.</description>
    </item>
    <item>
      <title>Everything we know about The Studio Season 2</title>
      <link>https://mashable.com/article/the-studio-season-2-release-date-everything-we-know</link>
      <pubDate>Tue, 03 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01bir7jSzo6KnOlLCXyiULs</guid>
      <description>"The Studio" is already shooting its second season. Here's what we know, from cast to a possible release date.</description>
    </item>
    <item>
      <title>Everything we know about Severance Season 3</title>
      <link>https://mashable.com/article/severance-season-3-release-date-everything-we-know</link>
      <pubDate>Tue, 03 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">05HNQ2UaXxPuTF5HbfGkWMh</guid>
      <description>"Severance" Season 3 is on its way. Here's what we know, from cast to potential release date.</description>
    </item>
    <item>
      <title>Everything we know about Pluribus Season 2</title>
      <link>https://mashable.com/article/pluribus-seaon-2-release-date-cast-everything-we-know-about</link>
      <pubDate>Tue, 03 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">022dekq3Spmw9vsEizhwcfg</guid>
      <description>"Pluribus" Season 2 is in the works. When can we expect it, and who will be in it? We break it down.</description>
    </item>
    <item>
      <title>How to watch the 2026 Six Nations online for free</title>
      <link>https://mashable.com/article/six-nations-2026-live-stream-for-free</link>
      <pubDate>Tue, 03 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01a11WhFMlBMgAx5LntdRxx</guid>
      <description>How to watch the Six Nations for free. Live stream the 2026 Six Nations for free from anywhere in the world.</description>
    </item>
    <item>
      <title>How to watch the 2026 Winter Olympics online for free</title>
      <link>https://mashable.com/article/winter-olympics-2026-live-stream-for-free</link>
      <pubDate>Tue, 03 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">03vQSsvHkcKVuzcuskR6s5p</guid>
      <description>How to watch Winter Olympics for free. Live stream the 2026 Winter Olympics for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Intelligence artificielle | Les risques croissent plus vite que les solutions, dit Yoshua Bengio</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-02-03/intelligence-artificielle/les-risques-croissent-plus-vite-que-les-solutions-dit-yoshua-bengio.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Tue, 03 Feb 2026 05:00:00 -0500</pubDate>
      <guid isPermaLink="false">6864c2bbc8fc3a028ae2067998f1ee92</guid>
      <description>L&#8217;intelligence artificielle continue de progresser en 2026, mais pas toujours dans la direction souhait&#233;e. D&#8217;un c&#244;t&#233;, des agents d&#8217;IA de plus en plus autonomes se sont dot&#233;s de leur propre forum web. De l&#8217;autre, des IA insuffisamment test&#233;es avant d&#8217;&#234;tre publi&#233;es accroissent les risques d&#8217;une application n&#233;faste de la technologie. Et entre les deux, les solutions pour &#233;viter les d&#233;rapages semblent de moins en moins nombreuses&#8230;...</description>
    </item>
    <item>
      <title>R&#233;seau social Moltbook | Un forum de discussion r&#233;serv&#233; aux agents d&#8217;IA</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-02-03/reseau-social-moltbook/un-forum-de-discussion-reserve-aux-agents-d-ia.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Tue, 03 Feb 2026 05:00:00 -0500</pubDate>
      <guid isPermaLink="false">c049c6c616ad383bbb1d3a567ef108f5</guid>
      <description>L&#8217;intelligence artificielle continue de progresser en 2026, mais pas toujours dans la direction souhait&#233;e. D&#8217;un c&#244;t&#233;, des agents d&#8217;IA de plus en plus autonomes se sont dot&#233;s de leur propre forum web. De l&#8217;autre, des IA insuffisamment test&#233;es avant d&#8217;&#234;tre publi&#233;es accroissent les risques d&#8217;une application n&#233;faste de la technologie. Et entre les deux, les solutions pour &#233;viter les d&#233;rapages semblent de moins en moins nombreuses&#8230;...</description>
    </item>
    <item>
      <title>The Roku Streaming Stick Plus just got a $15 discount at Amazon</title>
      <link>https://mashable.com/article/feb-3-roku-streaming-stick-deal</link>
      <pubDate>Tue, 03 Feb 2026 09:58:37 +0000</pubDate>
      <guid isPermaLink="false">040NfbmXWEKL6amRVqn8p05</guid>
      <description>Find the best streaming stick deal. Save 40% on the Roku Streaming Stick Plus at Amazon.</description>
    </item>
    <item>
      <title>The Insignia 50-inch Class F50 TV is at its lowest-ever price at Amazon &#8212; save $130</title>
      <link>https://mashable.com/article/feb-3-insignia-class-f50-tv-deal</link>
      <pubDate>Tue, 03 Feb 2026 09:52:01 +0000</pubDate>
      <guid isPermaLink="false">04J5OTtWFmk3fve83iLuysk</guid>
      <description>Get the best TV deal at Amazon. Save 43% on the Insignia 50-inch Class F50 at Amazon.</description>
    </item>
    <item>
      <title>Google Home&#160;: ces nouveaux d&#233;clencheurs vont booster vos automatisations</title>
      <link>https://www.01net.com/actualites/google-home-nouveaux-declencheurs-booster-automatisations.html</link>
      <pubDate>Tue, 03 Feb 2026 09:43:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323874</guid>
      <description>La derni&#232;re mise &#224; jour de Google Home ajoute de nouvelles options pour les automatisations et en profite pour r&#233;soudre un probl&#232;me r&#233;current des vid&#233;os.</description>
    </item>
    <item>
      <title>Super Bowl 2026 deals: Score free food from Applebees, Buffalo Wild Wings, Denny&#8217;s, Popeyes, and more</title>
      <link>https://mashable.com/article/super-bowl-2026-free-food-deals</link>
      <pubDate>Tue, 03 Feb 2026 09:43:02 +0000</pubDate>
      <guid isPermaLink="false">03nKvQDxUnQ3cF4Fxn4tHHQ</guid>
      <description>The best Super Bowl 2026 free food deals. How to get free food from Applebee's, Buffalo Wild Wings, Denny&#8217;s, Fazoli&#8217;s, and more.</description>
    </item>
  </channel>
</rss>
