<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 22 Feb 2026 09:36:20 GMT</lastBuildDate>
    <item>
      <title>How to watch India vs South Africa: Free Streams, TV Channels &amp; Preview for T20 World Cup 2026 match</title>
      <link>https://www.techradar.com/how-to-watch/cricket/india-vs-south-africa-t20-world-cup-2026-free</link>
      <pubDate>Sun, 22 Feb 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">EfX2Wt9xzZCtvjQCw4yBt7</guid>
      <description>Here's how to watch India vs South Africa T20 World Cup streams as two heavyweights collide in high-stakes Super 8 action.</description>
    </item>
    <item>
      <title>Avis Mullvad VPN en 2026 : Le VPN qui se rapproche le plus du vrai anonymat en ligne, mais &#224; quel prix ?</title>
      <link>https://www.frandroid.com/services/vpn/2975371_avis-mullvad-vpn</link>
      <pubDate>Sun, 22 Feb 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/vpn/2975371_avis-mullvad-vpn</guid>
      <description>
Dans le monde des VPN, Mullvad est un peu le discret de la bande, l'homme de l'ombre qui fait bien son travail et dispara&#238;t sans un mot, et c'est plut&#244;t bon signe dans ce milieu. Cela n'emp&#234;che pas non plus le VPN su&#233;dois de se tailler une r&#233;putation d'ayatollah de la protection des donn&#233;es. Voici ce que nous en pensons dans ce test.
</description>
    </item>
    <item>
      <title>Bient&#244;t le clap de fin pour la Dacia Spring &#233;lectrique : voici la voiture qui la remplacera sur les lignes de production chinoises</title>
      <link>https://www.frandroid.com/marques/dacia/2985431_bientot-le-clap-de-fin-pour-la-dacia-spring-electrique-voici-la-voiture-qui-la-remplacera-sur-les-lignes-de-production-chinoises</link>
      <pubDate>Sun, 22 Feb 2026 09:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dacia/2985431_bientot-le-clap-de-fin-pour-la-dacia-spring-electrique-voici-la-voiture-qui-la-remplacera-sur-les-lignes-de-production-chinoises</guid>
      <description>
La Dacia Spring telle que nous la connaissons s'appr&#234;te &#224; faire ses adieux. Pour la remplacer sur ses lignes de production chinoises, le constructeur roumain pr&#233;pare un projet radical : le Dacia Hipster. Un micro-v&#233;hicule &#233;lectrique &#224; moins de 15 000 euros qui pourrait voir le jour fin 2027.
</description>
    </item>
    <item>
      <title>Move over, Apple: Meet the alternative app stores available in the EU and elsewhere</title>
      <link>https://techcrunch.com/2026/02/22/move-over-apple-meet-the-alternative-app-stores-available-in-the-eu-and-elsewhere/</link>
      <pubDate>Sun, 22 Feb 2026 09:00:21 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=2838099</guid>
      <description>A list of some of the alternative app stores iPhone users in the EU can try today.</description>
    </item>
    <item>
      <title>Bon plan : le pack Samsung Galaxy A56 et la montre Fit 3 chute &#224; 419 euros</title>
      <link>https://www.frandroid.com/bons-plans/2982853_bon-plan-le-pack-samsung-galaxy-a56-et-la-montre-fit-3-chute-a-419-euros</link>
      <pubDate>Sun, 22 Feb 2026 08:34:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2982853_bon-plan-le-pack-samsung-galaxy-a56-et-la-montre-fit-3-chute-a-419-euros</guid>
      <description>
Derri&#232;re la gamme des Galaxy S, les Galaxy A ont trouv&#233; leur place sur le march&#233; du milieu de gamme gr&#226;ce &#224; des smartphones offrant des performances correctes au quotidien. Boulanger l'accompagne de la montre connect&#233;e, la Samsung Galaxy Fit 3 et l'ensemble chute &#224; 419 euros.
</description>
    </item>
    <item>
      <title>Fuite de donn&#233;es bancaires&#160;: comment prot&#233;ger votre compte en banque des arnaques&#160;?</title>
      <link>https://www.01net.com/actualites/fuite-de-donnees-bancaires-comment-proteger-votre-compte-en-banque-des-arnaques.html</link>
      <pubDate>Sun, 22 Feb 2026 08:17:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326863</guid>
      <description>Un pirate a r&#233;ussi &#224; p&#233;n&#233;trer dans le FICOBA, le fichier national des comptes bancaires, et &#224; d&#233;rober les donn&#233;es de 1,2 million de comptes. RIB, IBAN, adresses... des donn&#233;es tr&#232;s sensibles ont &#233;t&#233; compromises. Voici ce que vous risquez concr&#232;tement, et comment prot&#233;ger votre compte en banque contre les cyberattaques.</description>
    </item>
    <item>
      <title>Oubliez Waze et Google Maps, on a test&#233; le GPS fran&#231;ais qui cartonne</title>
      <link>https://www.01net.com/actualites/oubliez-waze-et-google-maps-on-a-teste-le-gps-francais-qui-cartonne.html</link>
      <pubDate>Sun, 22 Feb 2026 08:14:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326898</guid>
      <description>Au pays des applis de navigation, Waze et Google Maps ont largement le monopole dans le quotidien des utilisateurs. Mais un concurrent fran&#231;ais, qui semble &#224; tirer son &#233;pingle du jeu, commence &#224; s&#8217;imposer sur le podium des applis de navigation sur l&#8217;App Store et le Google Play Store.</description>
    </item>
    <item>
      <title>How to watch BAFTAs 2026 for *FREE* &#8212; stream 79th British Academy Film Awards from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/how-to-watch-baftas-2026-for-free-stream-79th-british-academy-film-awards-from-anywhere</link>
      <pubDate>Sun, 22 Feb 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">pje6H4yUEjTE4gjveHgA9M</guid>
      <description>With Emma Stone, Ethan Hawke, Leonardo DiCaprio, Michael B. Jordan, Timothee Chalamet, Jessie Buckley and Paul Mescal amongst the nominees, here's how to watch BAFTAs 2026 for free.</description>
    </item>
    <item>
      <title>How to watch Men's Ice Hockey Final: Stream USA vs Canada for free, TV Channels, Preview</title>
      <link>https://www.techradar.com/how-to-watch/sport/mens-ice-hockey-final-stream-usa-vs-canada-free</link>
      <pubDate>Sun, 22 Feb 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">CwpzsiMUscPMiDsnbRbqsb</guid>
      <description>All the ways to watch Winter Olympics men's ice hockey final 2026 live streams for FREE, to see which hockey superpower will prevail in last event of the games.</description>
    </item>
  </channel>
</rss>
