<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 03 Dec 2025 17:46:55 GMT</lastBuildDate>
    <item>
      <title>Anthropic hires lawyers as it preps for IPO</title>
      <link>https://techcrunch.com/2025/12/03/anthropic-hires-lawyers-as-it-preps-for-ipo/</link>
      <pubDate>Wed, 03 Dec 2025 17:42:37 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3072188</guid>
      <description>Anthropic is reportedly prepping for an IPO that could come as early as 2026.</description>
    </item>
    <item>
      <title>Cette sonde f&#234;te ses 30 ans et elle est devenue l&#8217;instrument solaire le plus productif de l&#8217;histoire : voici ce qu&#8217;elle a vu</title>
      <link>https://www.futura-sciences.com/sciences/actualites/soleil-cette-sonde-fete-30-ans-elle-devenue-instrument-solaire-plus-productif-histoire-voici-ce-quelle-vu-128191/#xtor%3DRSS-8</link>
      <pubDate>Wed, 03 Dec 2025 18:41:37 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/soleil-cette-sonde-fete-30-ans-elle-devenue-instrument-solaire-plus-productif-histoire-voici-ce-quelle-vu-128191/#xtor%3DRSS-8</guid>
      <description>Le 2&#160;d&#233;cembre 1995, l&#8217;Agence spatiale europ&#233;enne (ESA) et la Nasa lan&#231;aient Soho, l&#8217;Observatoire solaire et h&#233;liosph&#233;rique. Les donn&#233;es qu&#8217;il a renvoy&#233;es en 30 ans ont r&#233;volutionn&#233; le regard que les astronomes posent sur notre &#201;toile. Et m&#234;me un peu plus&#8230;</description>
    </item>
    <item>
      <title>"A disaster waiting to happen" &#8211; The privacy tech world reacts to the new Chat Control bill</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/a-disaster-waiting-to-happen-the-privacy-tech-world-reacts-to-the-new-chat-control-bill</link>
      <pubDate>Wed, 03 Dec 2025 17:37:15 +0000</pubDate>
      <guid isPermaLink="false">4Lyq2cNSRxuhTyGGNCvzt8</guid>
      <description>While an agreemnet on "voluntary" chat scanning has now been reached, Italy, the Czech Republic, Poland, and the Netherlands are still against the compromise. And privacy experts aren't celebrating.</description>
    </item>
    <item>
      <title>Pour r&#233;duire leur d&#233;pendance &#224; la Chine, les industries europ&#233;ennes bient&#244;t contraintes de se fournir en partie en Europe&#160;?</title>
      <link>https://www.01net.com/actualites/pour-reduire-leur-dependance-a-la-chine-les-industries-europeennes-bientot-contraintes-de-se-fournir-en-partie-en-europe.html</link>
      <pubDate>Wed, 03 Dec 2025 17:32:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313376</guid>
      <description>Des biens critiques, jusque-l&#224; fournis par la Chine, seraient bient&#244;t obligatoirement fabriqu&#233;s en Europe : c'est l'id&#233;e d'une future loi europ&#233;enne qui sera pr&#233;sent&#233;e le 10 d&#233;cembre prochain &#224; Bruxelles. Elle pourrait contraindre nos industries &#224; s'approvisionner obligatoirement aupr&#232;s d'entreprises du Vieux continent, dans certains secteurs cl&#233;s. Reste &#224; d&#233;finir les seuils, les composants et les produits concern&#233;s : autant d'&#233;l&#233;ments sur lesquels la Commission europ&#233;enne resterait divis&#233;e....</description>
    </item>
    <item>
      <title>Thursday's Cold Moon Is the Last Supermoon of the Year. Here's How and When to View It</title>
      <link>https://www.wired.com/story/cold-moon-supermoon-december-how-to-view/</link>
      <pubDate>Wed, 03 Dec 2025 17:30:42 +0000</pubDate>
      <guid isPermaLink="false">693043999cc8afb0969c31e9</guid>
      <description>The best opportunity to view this spectacle will be shortly after sunset on December 4.</description>
    </item>
    <item>
      <title>Liverpool vs Sunderland live streams: watch Premier League 2025/26 match</title>
      <link>https://www.techradar.com/how-to-watch/football/liverpool-vs-sunderland-premier-league-2025-26</link>
      <pubDate>Wed, 03 Dec 2025 17:30:00 +0000</pubDate>
      <guid isPermaLink="false">9Jtoem63WnDB4qbYB9SQYd</guid>
      <description>We'll show you all the ways you can watch Liverpool vs Sunderland in the Premier League this Wednesday, as Arne Slot looks for successive EPL wins.</description>
    </item>
    <item>
      <title>Not&#233; 9/10 et s&#233;duisant avec sa dalle incurv&#233;e QD-OLED 34&#8243; &#224; 240 Hz, cet &#233;cran Dell perd plus de 200 &#8364; de son prix</title>
      <link>https://www.frandroid.com/bons-plans/2897565_note-9-10-et-seduisant-avec-sa-dalle-incurvee-qd-oled-34-a-240-hz-cet-ecran-dell-perd-plus-de-200-e-de-son-prix</link>
      <pubDate>Wed, 03 Dec 2025 17:22:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2897565_note-9-10-et-seduisant-avec-sa-dalle-incurvee-qd-oled-34-a-240-hz-cet-ecran-dell-perd-plus-de-200-e-de-son-prix</guid>
      <description>
Dell fait une promotion plus int&#233;ressante que pendant le Black Friday sur l'&#233;cran Alienware AW3425DW qui se retrouve &#224; 641,39 euros au lieu de 849 euros sur le site de Dell.
</description>
    </item>
    <item>
      <title>The annual app recaps for 2025: all Wrapped up</title>
      <link>https://www.theverge.com/news/837280/spotify-wrapped-2025-recap-annual-best-of-data</link>
      <pubDate>2025-12-03T12:21:49-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?post_type=vm_stream&amp;p=837280</guid>
      <description>Spotify may have popularized the Wrapped user recap trend, but more companies are jumping on that bandwagon every year. From rival music streaming providers like Apple, Amazon, YouTube, and Deezer, to completely unrelated services across tech, gaming, and other industries, a huge range of companies are using fun visuals, stats, and personalization features to show [&#8230;]...</description>
    </item>
    <item>
      <title>How to watch 2025 Wrangler National Finals Rodeo online: live stream event from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/sport/2025-wrangler-national-finals-rodeo</link>
      <pubDate>Wed, 03 Dec 2025 17:14:21 +0000</pubDate>
      <guid isPermaLink="false">CtMGnCwCyXoR4epSf2LtQT</guid>
      <description>It's all eyes on Sin City for the 'Super Bowl of rodeo' &#8211; here's how to watch 2025 Wrangler National Finals Rodeo live streams no matter where in the world you are.</description>
    </item>
    <item>
      <title>&#171;&#160;C&#8217;est un choix de vie&#160;&#187; : le Galaxy Z TriFold est lourd, cher, mais fascinant</title>
      <link>https://www.frandroid.com/marques/2897819_cest-un-choix-de-vie-le-galaxy-z-trifold-est-lourd-cher-mais-fascinant</link>
      <pubDate>Wed, 03 Dec 2025 17:13:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2897819_cest-un-choix-de-vie-le-galaxy-z-trifold-est-lourd-cher-mais-fascinant</guid>
      <description>
Est-ce qu'on assiste &#224; la mort de la tablette ? C'est la question que l'on se pose devant le nouveau Galaxy Z TriFold de Samsung. Le constructeur cor&#233;en concr&#233;tise enfin son r&#234;ve : un smartphone qui se d&#233;plie en trois volets. C'est impressionnant, c'est bourr&#233; de technologies comme le Snapdragon 8 Elite, mais attendez de voir le poids de la b&#234;te.
</description>
    </item>
    <item>
      <title>This new Honeywell Home smart thermostat can answer your Ring doorbell</title>
      <link>https://www.theverge.com/news/837246/honeywell-home-x8s-smart-thermostat-launches-matter-ring-compatibility</link>
      <pubDate>2025-12-03T12:11:47-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=837246</guid>
      <description>Resideo&#8217;s newest thermostat looks like a compelling alternative to Nest or Ecobee if you&#8217;re looking for a premium smart thermostat. The&#160;Honeywell Home X8S is compatible with Matter, supports room sensors, and features a sleek 5-inch touchscreen that works as an intercom for Ring and First Alert video doorbells. The $219.99 thermostat launches this week, and [&#8230;]...</description>
    </item>
    <item>
      <title>ExpressVPN's latest update boosts connection speeds and revamps its Mac app</title>
      <link>https://www.techradar.com/vpn/vpn-services/expressvpns-latest-update-boosts-connection-speeds-and-revamps-its-mac-app</link>
      <pubDate>Wed, 03 Dec 2025 17:08:11 +0000</pubDate>
      <guid isPermaLink="false">QfaZgtNU9vUUMpm3kGYebH</guid>
      <description>ExpressVPN launched two major updates: a new 'Fastest Location' feature and a native macOS app that aim to deliver a quicker and more seamless user experience.</description>
    </item>
    <item>
      <title>Amazon has a massive sale on best-selling gifts - here are the 21 best from Apple, Keurig, Ninja, and more</title>
      <link>https://www.techradar.com/seasonal-sales/amazon-has-a-massive-sale-on-best-selling-gifts-here-are-the-21-best-from-apple-keurig-ninja-and-more</link>
      <pubDate>Wed, 03 Dec 2025 17:07:22 +0000</pubDate>
      <guid isPermaLink="false">6RdMvnvQBWghy554QXZdN4</guid>
      <description>Amazon has a huge holiday sale on best-selling Christmas gift ideas, and I'm rounding up my 21 favorite deals from Apple, Ninja, Keurig, Tonies, and more.</description>
    </item>
    <item>
      <title>I tested the MSI Cubi NUC AI+ 2MG and it's perfectly placed if you want a simple productivity mini PC with onboard AI</title>
      <link>https://www.techradar.com/pro/msi-cubi-nuc-ai-2mg-mini-pc-review</link>
      <pubDate>Wed, 03 Dec 2025 17:07:00 +0000</pubDate>
      <guid isPermaLink="false">CS7YvHdeR3oZoRSr2Qf7HH</guid>
      <description>The MSI Cubi NUC AI+ 2MG is a pint-sized productivity machine with a surprisingly great port offering, ideal for those out-of-sight machines that run multiple displays, share content over large displays in a lobby or on a sign, or on a front desk.</description>
    </item>
    <item>
      <title>Apr&#232;s la col&#232;re des fans, Amazon retire l&#8217;atroce doublage IA de plusieurs anime</title>
      <link>https://www.01net.com/actualites/apres-la-colere-des-fans-amazon-retire-latroce-doublage-ia-de-plusieurs-anime.html</link>
      <pubDate>Wed, 03 Dec 2025 17:03:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313596</guid>
      <description>Ridicule, embarrassant, insultant : les qualificatifs n'ont pas manqu&#233; de fuser chez les fans d'anime quand Amazon s'est piqu&#233; de proposer un doublage IA de plusieurs s&#233;ries japonaises. Comme chacun aurait pu le pr&#233;voir, c'est une catastrophe et apr&#232;s les cris d'horreur des fans et des com&#233;diens de doublage, l'entreprise a fait marche arri&#232;re.</description>
    </item>
    <item>
      <title>Google Drive : la fonction qu&#8217;on attendait tous arrive</title>
      <link>https://www.frandroid.com/android/applications/google-apps/2897809_google-drive-la-fonction-quon-attendait-tous-arrive</link>
      <pubDate>Wed, 03 Dec 2025 17:02:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/applications/google-apps/2897809_google-drive-la-fonction-quon-attendait-tous-arrive</guid>
      <description>
C'est le cauchemar de tout le monde : un dossier Google Drive rempli de 50 PDF aux noms incompr&#233;hensibles. Google a enfin la solution. L'entreprise d&#233;ploie une fonctionnalit&#233; qui utilise Gemini pour r&#233;sumer le contenu de tout un dossier en une seconde.
</description>
    </item>
    <item>
      <title>An unsettling indie game about horses keeps getting banned from stores</title>
      <link>https://www.theverge.com/news/837278/horses-banned-steam-epic-games-store</link>
      <pubDate>2025-12-03T12:00:03-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=837278</guid>
      <description>Horses, a first-person narrative horror game, was banned from the Epic Games Store just hours before it was set to launch on December 2nd. Then, a day after launch, the Humble store banned it as well. The decision shocked the developers at Santa Ragione, makers of the critically respected Saturnalia, as these storefronts were the [&#8230;]</description>
    </item>
    <item>
      <title>One day, AI might be better than you at surfing the web. That day isn&#8217;t today.</title>
      <link>https://www.theverge.com/tech/837287/ai-browsers-comet-chatgpt-atlas-edge-copilot-chrome-gemini</link>
      <pubDate>2025-12-03T12:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=837287</guid>
      <description>All I wanted was a pair of New Balances. I was done trusting stylish influencers who swore Vans, Converse, and Allbirds were up to the challenge of walking 20,000 steps day in and day out. They are not. Fall is the season of holiday sales, so there's no better time to shop&#8230; if you're immune [&#8230;]</description>
    </item>
    <item>
      <title>Arsenal vs Brentford live streams: How to watch Premier League 2025-26 from anywhere in the world</title>
      <link>https://www.techradar.com/how-to-watch/football/arsenal-vs-brentford-live-streams-premier-league-2025-26</link>
      <pubDate>Wed, 03 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">UqTVL996bb5uYcboUuMGi4</guid>
      <description>We'll show you all the ways you can watch Arsenal vs Brentford in the Premier League this Wednesday from anywhere in the world.</description>
    </item>
    <item>
      <title>A leading kids safety bill has been poison pilled, supporters say</title>
      <link>https://www.theverge.com/policy/837123/house-energy-commerce-kids-online-safety-package-hearing</link>
      <pubDate>2025-12-03T11:57:35-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=837123</guid>
      <description>Last year, the House of Representatives was the place where a leading kids online safety bill came to die. On Tuesday, a powerful House committee positioned itself as the place where that bill could be resurrected&#8230; along with 18 other proposals. During a three-hour hearing, an Energy and Commerce subcommittee discussed 19 bills recently packaged [&#8230;]...</description>
    </item>
    <item>
      <title>These PS5 and Xbox controller accessories revolutionized my gaming experience &#8211; and are perfect gift material this holiday</title>
      <link>https://www.techradar.com/gaming/gaming-accessories/these-ps5-and-xbox-controller-accessories-revolutionized-my-gaming-experience-and-are-perfect-gift-material-this-holiday</link>
      <pubDate>Wed, 03 Dec 2025 16:56:31 +0000</pubDate>
      <guid isPermaLink="false">vXvGqX3bS9PFyB3Hykka2W</guid>
      <description>These simple and cheap PS5 controller accessories have changed the way I game - and can be yours for less right now.</description>
    </item>
    <item>
      <title>Google Home : le m&#233;nage continue et supprime une fonction que les utilisateurs adoraient</title>
      <link>https://www.frandroid.com/marques/2897795_google-home-le-menage-continue-et-supprime-une-fonction-que-les-utilisateurs-adoraient</link>
      <pubDate>Wed, 03 Dec 2025 16:55:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2897795_google-home-le-menage-continue-et-supprime-une-fonction-que-les-utilisateurs-adoraient</guid>
      <description>
C'est une habitude d&#233;testable chez Google, mais on ne s'y fait jamais. Vous utilisiez votre smartphone pour appeler en vid&#233;o le Nest Hub de votre cuisine pour parler aux enfants ? C'est fini. Sans annonce, sans notification, Google a supprim&#233; cette fonction de l'application Google Home. Et le plus frustrant, c'est que ce n'est pas un bug.
</description>
    </item>
    <item>
      <title>Cartes graphiques Nvidia : les meilleurs mod&#232;les GeForce en 2025</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-hardware/1919367_cartes-graphiques-nvidia-tout-comprendre-a-la-gamme-des-gpu</link>
      <pubDate>Wed, 03 Dec 2025 16:52:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-hardware/1919367_cartes-graphiques-nvidia-tout-comprendre-a-la-gamme-des-gpu</guid>
      <description>
Les cartes graphiques Nvidia sont les r&#233;f&#233;rences du march&#233;. Vous &#234;tes int&#233;ress&#233;s par un GPU de la marque, mais h&#233;sitez sur le mod&#232;le &#224; choisir ? Frandroid vous explique tout ce qu'il y a &#224; savoir sur les meilleures cartes graphiques de Nvidia.
</description>
    </item>
    <item>
      <title>Netflix celebrates Kpop Demon Hunters' Spotify Wrapped 2025 success with heartfelt HUNTR/X 'thank you' message &#8211; but some fans think it was made by AI</title>
      <link>https://www.techradar.com/streaming/netflix/netflix-celebrates-kpop-demon-hunters-spotify-wrapped-2025-success-with-heartfelt-huntr-x-thank-you-message-but-some-fans-think-it-was-made-by-ai</link>
      <pubDate>Wed, 03 Dec 2025 16:52:14 +0000</pubDate>
      <guid isPermaLink="false">Tj54N5zEErW7az2mTXDNgY</guid>
      <description>Spotify Wrapped 2025 reveals how popular Kpop Demon Hunters' soundtrack really was, and HUNTR/X want to thank you for your support.</description>
    </item>
    <item>
      <title>Wake Up Dead Man still isn&#8217;t on Netflix yet &#8211; but a better new Knives Out mystery is streaming now</title>
      <link>https://www.techradar.com/streaming/netflix/wake-up-dead-man-still-isnt-on-netflix-yet-but-a-better-new-knives-out-mystery-is-streaming-now</link>
      <pubDate>Wed, 03 Dec 2025 16:47:54 +0000</pubDate>
      <guid isPermaLink="false">NkNERkD2CkczSAami8A4VP</guid>
      <description>Benoit Blanc and Knives Out take on the world of Sesame Street on Netflix this week, and we're inching ever closer to a full-on Muppets movie.</description>
    </item>
    <item>
      <title>A Snorkeler in Nova Scotia Thought This Was a Leaf, but It Was Something Far Weirder</title>
      <link>https://gizmodo.com/a-snorkeler-in-nova-scotia-thought-this-was-a-leaf-but-it-was-something-far-weirder-2000694844</link>
      <pubDate>Wed, 03 Dec 2025 16:45:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000694844</guid>
      <description>Studying Elysia chlorotica could be consequential for human industries, but the creatures have proven incredibly enigmatic.</description>
    </item>
    <item>
      <title>Iranian hacker group deploys malicious Snake game to target Egyptian and Israeli critical infrastructure</title>
      <link>https://www.techradar.com/pro/security/iranian-hacker-group-deploys-malicious-snake-game-to-target-egyptian-and-israeli-critical-infrastructure</link>
      <pubDate>Wed, 03 Dec 2025 16:44:00 +0000</pubDate>
      <guid isPermaLink="false">vTMjn2EaXzPYvxxYAyz9RS</guid>
      <description>MuddyWater has deployed more sophisticated techniques and malware in a string of attacks targeting Israel and Egypt.</description>
    </item>
    <item>
      <title>Will chatbots ever be funny? Why these comedians aren&#8217;t worried about an AI takeover, yet</title>
      <link>https://www.fastcompany.com/91453237/will-chatbots-ever-funny-why-these-comedians-arent-worried-about-ai-takeover-yet</link>
      <pubDate>2025-12-03T16:43:45</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91453237/will-chatbots-ever-funny-why-these-comedians-arent-worried-about-ai-takeover-yet</guid>
      <description>Although comedian Jon Lajoie uses AI in his work, he says AI chatbots aren&#8217;t &#8216;inherently funny.&#8217;
A baby and his family dog sit across from each other in a podcast studio.&#8220;Welcome to the talking baby podcast,&#8221; says the infant, wearing headphones and sounding like a deep-voiced radio broadcaster. &#8220;On today&#8217;s episode, we&#8217;ll be talking to the weird-looking person who lives at my house.&#8221;So begins a series of humorous interactions between two characters animated by artificial intelligence that&#8217;s attracted millions of views on social media. They&#8217;re a nod to the 1989 movie &#8220;Look Who&#8217;s Talking&#8221; but pro...</description>
    </item>
    <item>
      <title>Grab a free Fortnite skin with your Backbone Pro</title>
      <link>https://www.techradar.com/gaming/grab-a-free-fortnite-skin-with-your-backbone-pro</link>
      <pubDate>Wed, 03 Dec 2025 16:42:54 +0000</pubDate>
      <guid isPermaLink="false">V3rRWDNQAddBUQQYvDq8ZD</guid>
      <description>Backbone Pro owners can claim a free Fortnite skin right now.</description>
    </item>
    <item>
      <title>Elon Musk is on a racist posting spree again</title>
      <link>https://www.theverge.com/news/837423/elon-musk-x-racist-posts-minnesota</link>
      <pubDate>2025-12-03T11:35:43-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=837423</guid>
      <description>Billionaire Elon Musk &#8212; who&#8217;s long used his X (formerly Twitter) platform to stoke anger at immigrants and support antisemitic conspiracy theories &#8212;&#160;has spent the past day spreading and praising claims that &#8220;White people are on the verge of extinction,&#8221; Somali immigrants have &#8220;no right to be in America,&#8221; and nonprofits who support them are [&#8230;]</description>
    </item>
    <item>
      <title>AWS doubles down on custom&#160;LLMs with&#160;features meant to simplify model creation</title>
      <link>https://techcrunch.com/2025/12/03/aws-doubles-down-on-custom-llms-with-features-meant-to-simplify-model-creation/</link>
      <pubDate>Wed, 03 Dec 2025 16:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3072194</guid>
      <description>AWS is launching more capabilities in both Amazon Bedrock and Amazon SageMaker AI to make building custom models easier.</description>
    </item>
    <item>
      <title>Big screen TV deal still live: Get a 75-inch Hisense QLED 4K TV for under $400</title>
      <link>https://mashable.com/article/dec-3-hisense-e6-cinema-qled-tv-deal</link>
      <pubDate>Wed, 03 Dec 2025 16:29:09 +0000</pubDate>
      <guid isPermaLink="false">02UwV3BrnbS6KVHMSK7dX6U</guid>
      <description>The Hisense 75-inch E6 Cinema QLED 4K TV is still on sale for $399.99 post-Cyber Monday. That's 25% off its usual cost.</description>
    </item>
    <item>
      <title>Que se passe-t-il si le Galaxy Z TriFold est pli&#233; dans le mauvais sens&#160;?</title>
      <link>https://www.01net.com/actualites/que-se-passe-t-il-si-le-galaxy-z-trifold-est-plie-dans-le-mauvais-sens.html</link>
      <pubDate>Wed, 03 Dec 2025 16:27:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313133</guid>
      <description>C&#8217;est officiel, le nouveau smartphone pliant Samsung vient d&#8217;&#234;tre annonc&#233;. Le Galaxy Z TriFold est le premier t&#233;l&#233;phone &#224; double pliage de la marque. Mais alors dans quel sens devra-t-on plier ce nouveau smartphone pour &#234;tre s&#251;r de ne pas l&#8217;abimer d&#232;s les premi&#232;res utilisations ?</description>
    </item>
    <item>
      <title>En rupture de stock sur le site officiel, le Xiaomi Poco M7 Pro 5G (12 + 512 Go) est dispo et en promo &#224; -40 % sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2897353_en-rupture-de-stock-sur-le-site-officiel-le-xiaomi-poco-m7-pro-5g-12-512-go-est-dispo-et-en-promo-a-40-sur-amazon</link>
      <pubDate>Wed, 03 Dec 2025 16:27:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2897353_en-rupture-de-stock-sur-le-site-officiel-le-xiaomi-poco-m7-pro-5g-12-512-go-est-dispo-et-en-promo-a-40-sur-amazon</guid>
      <description>
Le Poco M7 Pro 5G est un t&#233;l&#233;phone d'entr&#233;e de gamme qui propose une configuration solide pour un prix abordable de 169 euros sur Amazon au lieu de 283 euros dans sa version 12 + 512 Go. 
</description>
    </item>
    <item>
      <title>Linux usage on Steam hits a record high for the second month in a row</title>
      <link>https://www.theverge.com/news/837364/linux-usage-steam-hardware-survey-november-2025</link>
      <pubDate>2025-12-03T11:19:48-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=837364</guid>
      <description>After finally passing the 3 percent mark in October, Linux usage on Steam has peaked again in the November Steam Hardware &amp; Software Survey. As of last month, Linux users accounted for 3.2 percent of all Steam users. That pales in comparison to Windows usage (94.79 percent), but it&#8217;s still a boost from October and [&#8230;]</description>
    </item>
    <item>
      <title>Supercharge your weekly clean with the iRobot Roomba 105 robot vacuum, still on sale now</title>
      <link>https://mashable.com/article/dec-3-irobot-roomba-105-deal</link>
      <pubDate>Wed, 03 Dec 2025 16:17:42 +0000</pubDate>
      <guid isPermaLink="false">01UacCeC6HU4LQaIVYjkyhZ</guid>
      <description>As of Dec. 3, get the iRobot Roomba 105 robot vacuum for $150.99 off at Amazon.</description>
    </item>
    <item>
      <title>Russian Cosmonaut Kicked Off SpaceX Mission Over Alleged National Security Violation</title>
      <link>https://gizmodo.com/russian-cosmonaut-kicked-off-spacex-mission-over-alleged-national-security-violation-2000695097</link>
      <pubDate>Wed, 03 Dec 2025 16:15:49 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000695097</guid>
      <description>The incident could strain Roscosmos&#8217;s partnership with NASA as the agency finds itself more reliant on the U.S. than ever.</description>
    </item>
    <item>
      <title>The Trump Administration Wants Immigrants to Self-Deport. It&#8217;s a Shit Show</title>
      <link>https://www.wired.com/story/trump-administration-wants-immigrants-to-self-deport/</link>
      <pubDate>Wed, 03 Dec 2025 16:15:00 +0000</pubDate>
      <guid isPermaLink="false">692f71543d6b88543adde4b3</guid>
      <description>The Trump administration has been virtually begging immigrants in the US to self-deport, even offering money. But some immigrants say it&#8217;s been nearly impossible.</description>
    </item>
    <item>
      <title>What is Bending Spoons? Everything to know about Eventbrite&#8217;s acquirer</title>
      <link>https://techcrunch.com/2025/12/03/what-is-bending-spoons-everything-to-know-about-aols-acquirer/</link>
      <pubDate>Wed, 03 Dec 2025 16:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3064419</guid>
      <description>Bending Spoons remains largely unknown, even as its portfolio of products has served more than a billion people.</description>
    </item>
    <item>
      <title>I&#8217;ve tested the latest Switch 2 controllers, and this one is the best</title>
      <link>https://www.theverge.com/tech/791574/best-switch-2-controllers</link>
      <pubDate>2025-12-03T11:10:50-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=791574</guid>
      <description>If you choose to get an extra controller for your Nintendo Switch 2, you can spend a lot &#8212; and get a lot in return. Buying Nintendo&#8217;s own $89.99 Switch 2 Pro Controller, for instance, will net you the console&#8217;s only wireless controller with a 3.5mm headphone jack, not to mention great rumble, OS-level rear [&#8230;]</description>
    </item>
    <item>
      <title>Nows your chance to get the PlayStation VR2 "Horizon Call of The Mountain" Bundle for a record-low price</title>
      <link>https://mashable.com/article/dec-3-playstation-vr2-bundle-deal</link>
      <pubDate>Wed, 03 Dec 2025 16:09:26 +0000</pubDate>
      <guid isPermaLink="false">00KvDFHrHag0MojUnoHSg89</guid>
      <description>The PlayStation VR2 Horizon Call of The Mountain Bundle is on sale at Amazon for $299, down from the list price of $399.99. That's a 25% discount.</description>
    </item>
    <item>
      <title>#FrandroidOffreMoi un excellent casque JBL Tour One M3</title>
      <link>https://www.frandroid.com/humanoid/concours/2893197_frandroidoffremoi-un-excellent-casque-jbl-tour-one-m3</link>
      <pubDate>Wed, 03 Dec 2025 16:08:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/concours/2893197_frandroidoffremoi-un-excellent-casque-jbl-tour-one-m3</guid>
      <description>
L'excellent casque JBL Tour One M3 reviendra gratuitement &#224; la personne qui remportera le concours du 3e jour de notre calendrier de l'Avent 2025 #FrandroidOffreMoi.
</description>
    </item>
    <item>
      <title>Another bid to block state AI regulation has failed&#8230; for now</title>
      <link>https://techcrunch.com/2025/12/03/another-bid-to-block-state-ai-regulation-has-failedfor-now/</link>
      <pubDate>Wed, 03 Dec 2025 16:06:35 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3072223</guid>
      <description>Republicans&#8217; attempt to ban state AI regulations was removed from the defense bill after bipartisan opposition, underscoring tensions between tech-industry demands, consumer protection concerns, and Trump&#8217;s push for sweeping federal preemption.</description>
    </item>
    <item>
      <title>Laifen Goes All-In for Post Black Friday With 40% Off Its Best-Selling Hair Dryers, Toothbrushes, and Shavers</title>
      <link>https://gizmodo.com/laifen-goes-all-in-for-early-black-friday-with-40-off-its-best-selling-hair-dryers-toothbrushes-and-shavers-2000685697</link>
      <pubDate>Wed, 03 Dec 2025 16:05:56 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000685697</guid>
      <description>Laifen&#8217;s Black Friday sale shaves 40% off its highly-rated products, but the stock might sell out soon.</description>
    </item>
    <item>
      <title>Test du MacBook Pro 14 M5 : de quoi me faire abandonner mon MacBook Air</title>
      <link>https://www.frandroid.com/marques/apple/2873797_test-du-macbook-pro-14-m5-de-quoi-me-faire-abandonner-mon-macbook-air</link>
      <pubDate>Wed, 03 Dec 2025 16:05:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2873797_test-du-macbook-pro-14-m5-de-quoi-me-faire-abandonner-mon-macbook-air</guid>
      <description>
Nouvelle ann&#233;e, nouveau MacBook Pro. Si la puce M5 fait encore des miracles en 2025, c'est toujours l'&#233;cran de ce mod&#232;le qui nous bluffe chaque ann&#233;e. Voici notre test du dernier MacBook Pro avant la grande refonte attendue de 2026.
</description>
    </item>
    <item>
      <title>Garmin&#8217;s new satellite communicator adds a touchscreen and photo sharing</title>
      <link>https://www.theverge.com/news/837313/garmin-inreach-mini-3-plus-satellite-communicator-color-touchscreen-messaging</link>
      <pubDate>2025-12-03T11:03:52-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=837313</guid>
      <description>Garmin announced a new version of its inReach satellite communicator with major upgrades that expand and improve the ways you can keep in touch while you&#8217;re adventuring outside cellphone coverage. The new inReach Mini 3 Plus now features a color display with touchscreen capabilities and adds voice messaging, longer text messages, and the ability to [&#8230;]...</description>
    </item>
    <item>
      <title>Trop de promesses mal tenues&#160;: les entreprises n&#8217;ach&#232;tent pas l&#8217;IA de Microsoft</title>
      <link>https://www.01net.com/actualites/trop-de-promesses-mal-tenues-les-entreprises-nachetent-pas-lia-de-microsoft.html</link>
      <pubDate>Wed, 03 Dec 2025 16:02:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313555</guid>
      <description>Microsoft a du mal &#224; vendre son IA aupr&#232;s des entreprises. Beaucoup d'entre elles sont toujours r&#233;ticentes &#224; acheter des services IA, car la fiabilit&#233; n'est pas forc&#233;ment au rendez-vous. R&#233;sultat : le g&#233;ant du logiciel ainsi que d'autres &#233;diteurs auraient revu les ambitions de leurs commerciaux &#224; la baisse pour refl&#233;ter la r&#233;alit&#233; de l'engouement tout relatif des clients....</description>
    </item>
    <item>
      <title>Character.ai launches Stories to keep teens engaged as it scales back open-ended chat for under-18s</title>
      <link>https://www.techradar.com/ai-platforms-assistants/character-ai-launches-stories-to-keep-teens-engaged-as-it-scales-back-open-ended-chat-for-under-18s</link>
      <pubDate>Wed, 03 Dec 2025 16:02:02 +0000</pubDate>
      <guid isPermaLink="false">vfkvJTL7QhuZz8LUdqnPnE</guid>
      <description>Character.ai is phasing out open chat for teens, and Stories is its plan to keep them entertained.</description>
    </item>
    <item>
      <title>The Characters Who Helped Us Survive 2025</title>
      <link>https://gizmodo.com/best-tv-movie-game-characters-2025-2000694062</link>
      <pubDate>Wed, 03 Dec 2025 16:00:47 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000694062</guid>
      <description>Here's to the terrific, the unpleasant and vindictive, the singers, and other characters who enchanted us throughout 2025.</description>
    </item>
    <item>
      <title>Sony is slowly improving the ergonomics of its cameras, but it&#8217;s still not enough</title>
      <link>https://www.theverge.com/gadgets/837066/sony-mirrorless-camera-ergonomics-a7v-a1-a9iii-canon-nikon</link>
      <pubDate>2025-12-03T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=837066</guid>
      <description>I was stoked to learn that the recently announced Sony A7 V had improved ergonomics. Just like I was happy to first hear that Sony's flagship A9 III and A1 II cameras got new ergonomic grip designs before that. I actually bought an A9 III to replace my aging A9 II for my wedding photography. [&#8230;]</description>
    </item>
    <item>
      <title>Google Photos&#8217; 2025 Recap turns to Gemini to find your highlights</title>
      <link>https://techcrunch.com/2025/12/03/google-photos-2025-recap-turns-to-gemini-to-find-your-highlights/</link>
      <pubDate>Wed, 03 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3072203</guid>
      <description>The Google Photos Recap will use Gemini's AI to find your memorable moments throughout the year, and adds new metrics, like a 'selfie' count.</description>
    </item>
    <item>
      <title>The search for missing Malaysian Airlines Flight MH370 is back on. Here&#8217;s what to know</title>
      <link>https://www.fastcompany.com/91453235/search-missing-malaysian-airlines-flight-mh370-back-on-heres-what-know</link>
      <pubDate>2025-12-03T15:57:09</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91453235/search-missing-malaysian-airlines-flight-mh370-back-on-heres-what-know</guid>
      <description>Investigators are still unable to pinpoint exactly what happened to the plane or its 239 passengers and crew.
More than a decade ago, Malaysia Airlines Flight MH370 vanished without a trace, sparking one of aviation&#8217;s most baffling mysteries.Despite years of multinational searches, investigators still do not know exactly what happened to the plane or its 239 passengers and crew.On Wednesday, Malaysia&#8217;s government said American marine robotics company Ocean Infinity would resume a seabed hunt for the missing plane on Dec. 30, reigniting hopes that the plane might finally be found.A massive sear...</description>
    </item>
    <item>
      <title>Amazon Fire TV&#8217;s new AI feature lets you jump to scenes by describing them to Alexa+</title>
      <link>https://techcrunch.com/2025/12/03/amazon-fire-tvs-new-ai-feature-lets-you-jump-to-scenes-by-describing-them-to-alexa/</link>
      <pubDate>Wed, 03 Dec 2025 15:54:58 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3072205</guid>
      <description>Amazon says you can describe the scene to Alexa by mentioning details like the actor or character's name, or a memorable quote.</description>
    </item>
    <item>
      <title>The final 3 best Cyber Monday laptop deals still alive</title>
      <link>https://mashable.com/article/best-cyber-monday-laptop-deals-2025</link>
      <pubDate>Wed, 03 Dec 2025 15:51:12 +0000</pubDate>
      <guid isPermaLink="false">06hn04cnN7xzlnz9oLOBNN4</guid>
      <description>Our editor found the final three laptop deals still live after Cyber Monday. Score the M4 MacBook Air, Alienware gaming PC, or a budget Chromebook for up to $350 off.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs thermostats connect&#233;s en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/322031_thermostats-connectes-temps-dy-penser</link>
      <pubDate>Wed, 03 Dec 2025 15:47:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/322031_thermostats-connectes-temps-dy-penser</guid>
      <description>
Ces derni&#232;res ann&#233;es, les prix du gaz et de l'&#233;lectricit&#233; ont explos&#233;. Il est ainsi devenu urgent de r&#233;duire notre impact &#233;cologique et nos factures. Les thermostats intelligents sont des alli&#233;s de choix pour faire des &#233;conomies d'&#233;nergie. D&#233;couvrez notre s&#233;lection des meilleurs thermostats connect&#233;s.
</description>
    </item>
  </channel>
</rss>
