<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 21 Jan 2026 13:53:14 GMT</lastBuildDate>
    <item>
      <title>Quels sont les meilleurs &#233;crans pour le t&#233;l&#233;travail et la bureautique en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-ordinateurs/898135_quels-sont-les-meilleurs-ecrans-pc-pour-la-bureautique</link>
      <pubDate>Wed, 21 Jan 2026 13:49:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-ordinateurs/898135_quels-sont-les-meilleurs-ecrans-pc-pour-la-bureautique</guid>
      <description>
Souvent n&#233;glig&#233;, un bon &#233;cran d'ordinateur est indispensable pour travailler confortablement. Nous avons choisi pour vous les meilleurs moniteurs pour une utilisation bureautique, notamment pour le t&#233;l&#233;travail.
</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver : la 3e d&#233;marque d&#233;marre fort, voici les offres qui m&#233;ritent votre argent</title>
      <link>https://www.frandroid.com/bons-plans/2949895_soldes-dhiver-3e-demarque-meilleures-offres-en-direct</link>
      <pubDate>Wed, 21 Jan 2026 13:42:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2949895_soldes-dhiver-3e-demarque-meilleures-offres-en-direct</guid>
      <description>
Cela fait d&#233;j&#224; deux semaines que les soldes d'hiver ont commenc&#233; en France et que les e-commer&#231;ants tels qu'Amazon, Fnac, Darty, Boulanger ou encore Cdiscount partagent des offres. Aujourd'hui, c'est la 3e d&#233;marque et les promotions se multiplient. 
</description>
    </item>
    <item>
      <title>Xbox Game Pass adds Death Stranding DC, Ninja Gaiden, Talos Principle 2 and more</title>
      <link>https://www.engadget.com/gaming/xbox-game-pass-adds-death-stranding-dc-ninja-gaiden-talos-principle-2-and-more-134126315.html?src=rss</link>
      <pubDate>Wed, 21 Jan 2026 13:41:26 +0000</pubDate>
      <guid isPermaLink="false">41076f89-09c6-4d7b-aede-d3ac8c45c807</guid>
      <description>Microsoft has announced some solid additions to Game Pass this month, ranging from AAA titles to indies, including some of our favorites from 2024 and 2025.  Topping the list is Death Stranding Director&#8217;s Cut, an extended version of Hideo Kojima&#8217;s 2019 sci-fi action game (now available). Other key inclusions are Warhammer 40,000: Space Marine 2 (January 29) and puzzle game The Talos Principle 2  (January 27). We&#8217;re also seeing some award winners including Indika (February 2), a surreal tale about the devil living inside a nun&#8217;s head, one of Engadget&#8217;s 2024 games of the year. Last year&#8217;s Ninja ...</description>
    </item>
    <item>
      <title>Top online mentor site UStrive admits breach exposed data on children</title>
      <link>https://www.techradar.com/pro/security/top-online-mentor-site-ustrive-admits-breach-exposed-data-on-children</link>
      <pubDate>Wed, 21 Jan 2026 13:40:00 +0000</pubDate>
      <guid isPermaLink="false">vvbvQsnZcRw3zAt2Caq23b</guid>
      <description>An error in its website allowed anyone to view sensitive user data, including names and email addresses.</description>
    </item>
    <item>
      <title>Detective games get extra cryptic with TR-49&#8217;s code-breaking mystery</title>
      <link>https://www.theverge.com/games/864630/tr49-review-steam-iphone</link>
      <pubDate>2026-01-21T08:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864630</guid>
      <description>We're living in a pretty great time for detective games. Over the last few years, developers have been experimenting with all kinds of different ways of turning the act of investigation into a compelling game, which has led to the likes of Her Story, Return of the Obra Dinn, and the Golden Idol series, to [&#8230;]</description>
    </item>
    <item>
      <title>Lemonade launches an insurance product for Tesla Full Self-Driving customers</title>
      <link>https://techcrunch.com/2026/01/21/lemonade-launches-an-insurance-product-for-tesla-full-self-driving-customers/</link>
      <pubDate>Wed, 21 Jan 2026 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3084463</guid>
      <description>Lemonade says it worked with Tesla to gain access to previously-restricted vehicle telemetry data, but declined to offer specifics.</description>
    </item>
    <item>
      <title>L&#8217;IA doit justifier son co&#251;t pour la soci&#233;t&#233;, affirme le patron de Microsoft</title>
      <link>https://www.01net.com/actualites/lia-doit-justifier-son-cout-pour-la-societe-affirme-le-patron-de-microsoft.html</link>
      <pubDate>Wed, 21 Jan 2026 13:25:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321577</guid>
      <description>L&#8217;IA g&#233;n&#233;rative risque de perdre sa &#171; permission sociale &#187; si elle ne d&#233;montre pas son utilit&#233; aupr&#232;s de la soci&#233;t&#233;, a expliqu&#233; Satya Nadella. &#192; ses yeux, la technologie ne pourra justifier durablement sa voracit&#233; &#233;nerg&#233;tique que si elle produit des effets tangibles dans l&#8217;&#233;conomie r&#233;elle.</description>
    </item>
    <item>
      <title>Get TurboTax Deluxe for only $45 ahead of tax season</title>
      <link>https://www.engadget.com/deals/get-turbotax-deluxe-for-only-45-ahead-of-tax-season-204848842.html?src=rss</link>
      <pubDate>Wed, 21 Jan 2026 13:16:31 +0000</pubDate>
      <guid isPermaLink="false">8d4b28c6-34f1-44bb-800a-eec732a96ded</guid>
      <description>Tax season is fast approaching, and unfortunately for 2026, Direct File isn't an option anymore. The free, government-provided service was shut down, so you'll need to look to other federal programs, including IRS Free File, to file your paperwork. If you don't qualify for Free File, TurboTax might be your best bet for a relatively cheap, efficient way to file your taxes. While it pains us to suggest you give money to a company that has spent decades lobbying to ensure America's tax system remains a nightmare, we can at least help you save a bit of cash if you've determined TurboTax is a neces...</description>
    </item>
    <item>
      <title>Le sort s&#8217;acharne sur Rad Power Bikes : apr&#232;s la faillite, un &#233;norme incendie ravage l&#8217;un de ses magasins</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2950337_le-sort-sacharne-sur-rad-power-bikes-apres-la-faillite-un-enorme-incendie-ravage-lun-de-ses-magasins</link>
      <pubDate>Wed, 21 Jan 2026 13:05:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2950337_le-sort-sacharne-sur-rad-power-bikes-apres-la-faillite-un-enorme-incendie-ravage-lun-de-ses-magasins</guid>
      <description>
Mise en faillite suite &#224; un rappel de batteries de v&#233;los &#233;lectriques et de grosses difficult&#233;s financi&#232;res cumul&#233;es au cours des derni&#232;res ann&#233;es, la marque am&#233;ricaine Rad Power Bikes essuie un nouveau coup dur : un incendie de son site de Los Angeles (&#201;tats-Unis), dont la cause n&#8217;est pas encore d&#233;termin&#233;e.
</description>
    </item>
    <item>
      <title>Eternal CEO Deepinder Goyal hands over reins to Blinkit chief as quick commerce takes off</title>
      <link>https://techcrunch.com/2026/01/21/eternal-ceo-deepinder-goyal-hands-over-reins-to-blinkit-chief-as-quick-commerce-takes-off/</link>
      <pubDate>Wed, 21 Jan 2026 13:05:48 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3084454</guid>
      <description>Deepinder Goyal will remain on Eternal's board as its vice chairman.</description>
    </item>
    <item>
      <title>Does It Matter If Dunk Was Really Knighted on &#8216;A Knight of the Seven Kingdoms&#8217;?</title>
      <link>https://gizmodo.com/does-it-matter-if-dunk-was-really-knighted-on-a-knight-of-the-seven-kingdoms-2000712266</link>
      <pubDate>Wed, 21 Jan 2026 13:00:59 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000712266</guid>
      <description>Showrunner Ira Parker weighs in on the character's murky status on the HBO 'Game of Thrones' spin-off.</description>
    </item>
    <item>
      <title>Forfaits YouPrice : les meilleures offres de l&#8217;op&#233;rateur virtuel avec les r&#233;seaux mobiles d&#8217;Orange, SFR et Bouygues Telecom</title>
      <link>https://www.frandroid.com/services/operateurs-mobiles/1693719_youprice-notre-avis-sur-ce-jeune-operateur-prometteur</link>
      <pubDate>Wed, 21 Jan 2026 13:00:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/operateurs-mobiles/1693719_youprice-notre-avis-sur-ce-jeune-operateur-prometteur</guid>
      <description>
Arriv&#233; dans le paysage des MVNO en 2022, YouPrice est un tout jeune MVNO qui a la particularit&#233; de proposer trois r&#233;seaux mobiles, ceux d'Orange, de Bouygues Telecom et de SFR. Avec son catalogue de forfaits mobiles pas chers, que vaut encore cet op&#233;rateur virtuel, un des rares &#224; &#234;tre encore ind&#233;pendants ? Voici les meilleurs forfaits de chez YouPrice.
...</description>
    </item>
    <item>
      <title>Zanskar thinks 1 TW of geothermal power is being overlooked</title>
      <link>https://techcrunch.com/2026/01/21/zanskar-thinks-1-tw-of-geothermal-power-is-being-overlooked/</link>
      <pubDate>Wed, 21 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083882</guid>
      <description>Zanskar has raised $115 million to find about a dozen geothermal resources that could help power the grid throughout the U.S. West.</description>
    </item>
    <item>
      <title>What to expect at Samsung Galaxy Unpacked 2026</title>
      <link>https://www.engadget.com/mobile/smartphones/what-to-expect-at-samsung-galaxy-unpacked-2026-130000003.html?src=rss</link>
      <pubDate>Wed, 21 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">7b516dbb-4749-48f0-b5c0-b244aed8b2b9</guid>
      <description>Samsung&#8217;s 2025 was filled with new foldables, an ultra-thin new form factor and the launch of Google's XR platform. After making some announcements at CES 2026, the company is expected to host its first Galaxy Unpacked of the year in February to introduce the Galaxy S26 lineup.Engadget will be covering Galaxy Unpacked live, and we'll most likely have hands-on coverage of Samsung's new smartphones soon after they're announced. While we wait for an official invite, here's everything we expect Samsung will introduce at the first Galaxy Unpacked event of 2026.Galaxy S26, S26+ and S26 UltraSamsung ...</description>
    </item>
    <item>
      <title>How to check if your VPN is working</title>
      <link>https://www.engadget.com/cybersecurity/vpn/how-to-check-if-your-vpn-is-working-130000817.html?src=rss</link>
      <pubDate>Wed, 21 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">ad438649-8381-4f78-9b36-c3fd08a05109</guid>
      <description>One of the disconcerting things about using a virtual private network (VPN) is that it can be hard to tell when it's doing its job. The best VPNs all work in the background to keep your IP address hidden and your communications with their servers encrypted. The better the VPN, the less you notice it, which can make a top-performing VPN feel (uncomfortably) like one that isn't working at all.Luckily, you've got options for checking whether your VPN is working &#8212; other than just taking the app at its word. In this article, I'll cover the basics, then go through five different tests you can run to...</description>
    </item>
    <item>
      <title>Bo&#238;te de r&#233;ception | &#201;conomie de l&#8217;abonnement, coffre-fort num&#233;rique et t&#233;moins refus&#233;s</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-01-21/boite-de-reception/economie-de-l-abonnement-coffre-fort-numerique-et-temoins-refuses.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 21 Jan 2026 08:00:00 -0500</pubDate>
      <guid isPermaLink="false">5792a2e9b05a389e9a82d537a96ab554</guid>
      <description>Chaque mercredi, notre journaliste r&#233;pond &#224; vos questions en lien avec le num&#233;rique et les nouvelles technologies. Cette semaine, on d&#233;joue les renouvellements automatis&#233;s, on revisite la s&#233;curit&#233; des gestionnaires de mots de passe et on se questionne sur la pertinence des fichiers t&#233;moins.</description>
    </item>
    <item>
      <title>Whats going on with Elon Musk and Ryanair?</title>
      <link>https://mashable.com/article/elon-musk-ryanair</link>
      <pubDate>Wed, 21 Jan 2026 12:48:51 +0000</pubDate>
      <guid isPermaLink="false">06yo7SNzXDmMH32EziZyjvU</guid>
      <description>Starlink CEO Elon Musk and Ryanair CEO Michael O'Leary have experienced turbulence of late, but what exactly has occurred?</description>
    </item>
    <item>
      <title>Daily Show brutally mocks Trumps desperate bid for the Nobel Peace Prize</title>
      <link>https://mashable.com/video/daily-show-mocks-trump-nobel-peace-prize</link>
      <pubDate>Wed, 21 Jan 2026 12:44:35 +0000</pubDate>
      <guid isPermaLink="false">04LvdFzZ1nZZWqtZ2QNzSQV</guid>
      <description>"Daily Show" host Josh Johnson has recapped Donald Trump's obsession with the Nobel Peace Price.</description>
    </item>
    <item>
      <title>Hyundai just unveiled the Staria Camper Concept &#8211; and it looks like my ultimate off-grid EV</title>
      <link>https://www.techradar.com/vehicle-tech/hybrid-electric-vehicles/hyundai-just-unveiled-the-staria-camper-concept-and-it-looks-like-my-ultimate-off-grid-ev</link>
      <pubDate>Wed, 21 Jan 2026 12:43:36 +0000</pubDate>
      <guid isPermaLink="false">t2CfjEF8NgwXuqSJHxAKk3</guid>
      <description>It's just a concept for now, but the Staria Camper has to be the most luxurious way to venture off the beaten path.</description>
    </item>
    <item>
      <title>Some fantastic games are coming to Xbox Game Pass this month &#8212; here are the ones I'd recommend trying first</title>
      <link>https://www.techradar.com/gaming/xbox/some-fantastic-games-are-coming-to-xbox-game-pass-this-month-here-are-the-ones-id-recommend-trying-first</link>
      <pubDate>Wed, 21 Jan 2026 12:42:00 +0000</pubDate>
      <guid isPermaLink="false">UL7UcS87Q4pFuUwWiDLdeN</guid>
      <description>A leaker claims that the next Resident Evil remake will be a fresh version of an underrated spin-off.</description>
    </item>
    <item>
      <title>Stuff Your Kindle Day is live &#8212; download free sports fiction ebooks until Jan. 24</title>
      <link>https://mashable.com/article/stuff-your-kindle-day-free-sports-fiction</link>
      <pubDate>Wed, 21 Jan 2026 12:31:04 +0000</pubDate>
      <guid isPermaLink="false">060lMZNflaHww7BJZnIRJHG</guid>
      <description>Don&#8217;t miss the latest Stuff Your Kindle Day. Download free sports fiction ebooks for your Kindle before the giveaway ends on Jan. 24.</description>
    </item>
    <item>
      <title>'You don&#8217;t have endless options': Amazon CEO Andy Jassy warns tariffs are already raising prices</title>
      <link>https://www.techradar.com/pro/you-dont-have-endless-options-amazon-ceo-andy-jassy-warns-tariffs-are-already-raising-prices</link>
      <pubDate>Wed, 21 Jan 2026 12:30:00 +0000</pubDate>
      <guid isPermaLink="false">F7JooSqdGtvfdwHWN8o5QV</guid>
      <description>Stockpiling bought consumers some time, but Trump's tariffs are pushing up prices across retail now.</description>
    </item>
    <item>
      <title>Avengers: Doomsday's action will 'eclipse everything else Marvel has ever done', insider says &#8212; and details about its first scene seem to have leaked online</title>
      <link>https://www.techradar.com/streaming/entertainment/avengers-doomsdays-action-will-eclipse-everything-else-marvel-has-ever-done-insider-says-and-details-about-its-first-scene-seem-to-have-leaked-online</link>
      <pubDate>Wed, 21 Jan 2026 12:26:47 +0000</pubDate>
      <guid isPermaLink="false">HLy5TmtjdjdhBABu2xibka</guid>
      <description>Fresh details about Avengers: Doomsday's reportedly action-heavy opening appear to have leaked online.</description>
    </item>
    <item>
      <title>Magic: The Gathering Lorwyn Eclipsed Play Booster Box preorders are $14 off at Amazon</title>
      <link>https://mashable.com/article/jan-21-magic-the-gathering-lorwyn-eclipsed-play-booster-box-preorder-deal</link>
      <pubDate>Wed, 21 Jan 2026 12:24:30 +0000</pubDate>
      <guid isPermaLink="false">074USze12STdyOEhXnIYYzV</guid>
      <description>Preorder the Magic: The Gathering Lorwyn Eclipsed Play Booster Box for $150.90 on Amazon and lock in the great low price before release.</description>
    </item>
    <item>
      <title>The Final Fantasy VII Remake Intergrade Switch 2 version is better than I expected &#8212; it isn&#8217;t flawless, but the game is still absolutely brilliant</title>
      <link>https://www.techradar.com/gaming/final-fantasy-7-remake-intergrade-switch-2-review</link>
      <pubDate>Wed, 21 Jan 2026 12:20:30 +0000</pubDate>
      <guid isPermaLink="false">T4zsWje39pNQYWHqqYjwZ</guid>
      <description>Final Fantasy VII Remake Intergrade is incredible, and while the Nintendo Switch 2 version is a step down, I still love it.</description>
    </item>
    <item>
      <title>Looking for a rice cooker? I test kitchen tech for a living, and these are my 3 recommendations for perfectly fluffy results</title>
      <link>https://www.techradar.com/home/multi-cookers/looking-for-a-rice-cooker-i-test-kitchen-tech-for-a-living-and-these-are-my-3-recommendations-for-perfectly-fluffy-results</link>
      <pubDate>Wed, 21 Jan 2026 12:17:49 +0000</pubDate>
      <guid isPermaLink="false">95YZT9YAvNrCb5T4A7SdbU</guid>
      <description>The best rice cookers give consistently great results with any grain &#8211; and a lot more besides.</description>
    </item>
    <item>
      <title>Pendant que le prix des SSD ne cesse d&#8217;augmenter, cet HDD externe de 12 To perd 21 % de son prix chez Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2950065_pendant-que-le-prix-des-ssd-ne-cesse-daugmenter-cet-hdd-externe-de-12-to-perd-21-de-son-prix-chez-amazon</link>
      <pubDate>Wed, 21 Jan 2026 12:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2950065_pendant-que-le-prix-des-ssd-ne-cesse-daugmenter-cet-hdd-externe-de-12-to-perd-21-de-son-prix-chez-amazon</guid>
      <description>
Avec ses 12 To de stockage et sa vitesse de transfert &#233;lev&#233;e, cet HDD de Western Digital se pr&#233;sente comme une excellente alternative &#224; un SSD. Contrairement &#224; ce dernier, il voit son prix baisser chez Amazon et, pendant les soldes d'hiver, il est vendu pour 248,64 euros.
</description>
    </item>
    <item>
      <title>Last chance to score the DJI Power 2000 power station for its best-ever price at Amazon &#8212; save $600</title>
      <link>https://mashable.com/article/jan-21-dji-power-2000-portable-power-station-deal</link>
      <pubDate>Wed, 21 Jan 2026 12:07:04 +0000</pubDate>
      <guid isPermaLink="false">05AZiMjNCv6brg7AAOP22YF</guid>
      <description>As of Jan. 21, the DJI Power 2000 portable power station is back to its lowest-ever price of $699 at Amazon, 46% off its list price of $1,299.</description>
    </item>
    <item>
      <title>Level Lock Pro Review (2026): Smart but Stylish</title>
      <link>https://www.wired.com/review/level-lock-pro/</link>
      <pubDate>Wed, 21 Jan 2026 12:06:00 +0000</pubDate>
      <guid isPermaLink="false">6966a691c163ae9f4c8e4315</guid>
      <description>You&#8217;d never guess Level&#8217;s Lock Pro is smart by looking at it, and that&#8217;s my favorite part.</description>
    </item>
    <item>
      <title>Modern head-fi specialist Meze Audio has a beautiful new pair of closed-back wired headphones that promise the detail and expansiveness of open backs &#8212; and it says they'll last for 'decades'</title>
      <link>https://www.techradar.com/audio/headphones/modern-head-fi-specialist-meze-audio-has-a-beautiful-new-pair-of-closed-back-wired-headphones-that-promise-the-detail-and-expansiveness-of-open-backs-and-it-says-theyll-last-for-decades</link>
      <pubDate>Wed, 21 Jan 2026 12:04:22 +0000</pubDate>
      <guid isPermaLink="false">cNEuNPQUhmJ9Wa6TVqsQz6</guid>
      <description>Meze's new dynamic headphones promise the best of both headphone worlds</description>
    </item>
    <item>
      <title>&#8216;Maybe you&#8217;re developing a case of selective hearing&#8217;: Alexa+ gets sassy with user after they accuse it of making up false commands</title>
      <link>https://www.techradar.com/ai-platforms-assistants/maybe-youre-developing-a-case-of-selective-hearing-alexa-gets-sassy-with-user-after-they-accuse-it-of-making-up-false-commands</link>
      <pubDate>Wed, 21 Jan 2026 12:03:00 +0000</pubDate>
      <guid isPermaLink="false">UfLNkJNF8yq3gD3GbPiTd8</guid>
      <description>Users are reporting that Alexa+ could be making up false requests, and it's giving them a sassy attitude in return.</description>
    </item>
    <item>
      <title>How to watch NRL live streams online for free</title>
      <link>https://mashable.com/article/nrl-live-stream-for-free</link>
      <pubDate>Wed, 21 Jan 2026 12:01:18 +0000</pubDate>
      <guid isPermaLink="false">05fZ9UpeJMjZENG8f8Ozg5A</guid>
      <description>How to watch NRL for free. Live stream the 2026 NRL for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Holy Crap, So Many People Watched &#8216;KPop Demon Hunters&#8217; Last Year</title>
      <link>https://gizmodo.com/holy-crap-so-many-people-watched-kpop-demon-hunters-last-year-2000712204</link>
      <pubDate>Wed, 21 Jan 2026 12:00:37 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000712204</guid>
      <description>A new report puts the animated sensation even above recent seasons of heavy-hitters 'Stranger Things' and 'Wednesday.'</description>
    </item>
    <item>
      <title>Burritos from Heaven: Are drones the future of delivery?</title>
      <link>https://www.theverge.com/tech/864601/zipline-drone-delivery-food-takeout-texas</link>
      <pubDate>2026-01-21T07:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864601</guid>
      <description>On a blustery afternoon late last year, on the lawn just outside City Hall in Rowlett, Texas, a strange-looking craft cleared the trees just before me. It hovered overhead for a moment before lowering a second craft on a thin rope all the way to a parched patch of grass. The little, white thing deposited [&#8230;]</description>
    </item>
    <item>
      <title>What a Sony and TCL partnership means for the future of TVs</title>
      <link>https://www.theverge.com/tech/864745/sony-tcl-tvs-partnership-explained</link>
      <pubDate>2026-01-21T07:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864745</guid>
      <description>I'm not sure anyone saw this news coming, but the TV landscape as we know it could change considerably over the next year or two. Sony, the storied Japanese TV brand, has announced that it has signed a memorandum of understanding with its Chinese competitor TCL. This potential partnership - with TCL set to hold [&#8230;]</description>
    </item>
    <item>
      <title>Language learning marketplace Preply&#8217;s unicorn status embodies Ukrainian resilience</title>
      <link>https://techcrunch.com/2026/01/21/language-learning-marketplace-preplys-unicorn-status-embodies-ukrainian-resilience/</link>
      <pubDate>Wed, 21 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3084284</guid>
      <description>Language learning marketplace Preply is now valued at $1.2 billion after raising a $150 million that marks a new chapter for the 14-year-old company.</description>
    </item>
    <item>
      <title>Netflix mobile app redesign will offer 'deeper integration' of vertical video</title>
      <link>https://www.engadget.com/entertainment/streaming/netflix-mobile-app-redesign-will-offer-deeper-integration-of-vertical-video-120000820.html?src=rss</link>
      <pubDate>Wed, 21 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">5272da15-d189-446b-8863-2ad66636a33c</guid>
      <description>After testing the feature for the last six months or so, Netflix said it will bring vertical videos to its mobile app sometime later in 2026, TechCrunch reported. So far, the feature has been used to show clips promoting Netflix films and TV shows, letting you swipe to move to the next one &#224; la TikTok or YouTube Shorts. Going forward, though, it could also serve as a promotion tool for new types of programs. &#8220;You can imagine us bringing more clips based on new content types, like video podcasts,&#8221; co-CEO Greg Peters said in an earnings call. That was another subject of discussion, as Netflix is...</description>
    </item>
    <item>
      <title>New Balance&#8217;s secret to winning? Think like a challenger</title>
      <link>https://www.fastcompany.com/91476532/new-balances-secret-to-winning-think-like-a-challenger</link>
      <pubDate>2026-01-21T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91476532/new-balances-secret-to-winning-think-like-a-challenger</guid>
      <description>CMO Chris Davis shares how New Balance stays an underdog with superstars like Cooper Flagg and Shohei Ohtani.
Back on December 15th, Dallas Mavericks rookie Cooper Flagg became the youngest player in NBA history to score more than 40 points in a game. It was also just the third time a teenager had 40 points, five rebounds, and five assists in the league&#8217;s 79-year history.&#160;...</description>
    </item>
    <item>
      <title>We rate the GoPro Hero 13 Black as 'the best action camera for most people' &#8212; and right now it has a superb deal at Adorama</title>
      <link>https://www.techradar.com/cameras/action-cameras/we-rate-the-gopro-hero-13-black-as-the-best-action-camera-for-most-people-and-right-now-it-has-a-superb-deal-at-adorama</link>
      <pubDate>Wed, 21 Jan 2026 11:55:01 +0000</pubDate>
      <guid isPermaLink="false">fu6wc86itgPNrCRhPEWmRE</guid>
      <description>Adorama has the excellent GoPro Hero 13 Black at the same price we saw on Black Friday, but this deal is due to end in just a few days.</description>
    </item>
    <item>
      <title>Windows 11 update is breaking sleep mode on some PCs &#8212; but there's one trick that might help</title>
      <link>https://www.techradar.com/computing/windows/windows-11-update-is-breaking-sleep-mode-on-some-pcs-but-theres-one-trick-that-might-help</link>
      <pubDate>Wed, 21 Jan 2026 11:54:04 +0000</pubDate>
      <guid isPermaLink="false">HVjquW7EDhJmYw678KvyEo</guid>
      <description>Microsoft might have fixed that bug with shutdowns, but its latest Windows 11 update means sleep mode now locks up some PCs.</description>
    </item>
  </channel>
</rss>
