<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 14 Dec 2025 17:20:46 GMT</lastBuildDate>
    <item>
      <title>TechCrunch Mobility: Rivian&#8217;s survival plan involves more than cars</title>
      <link>https://techcrunch.com/2025/12/14/rivians-survival-plan-involves-more-than-cars/</link>
      <pubDate>Sun, 14 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3075731</guid>
      <description>Welcome back to TechCrunch Mobility &#8212; your central hub for news and insights on the future of transportation.</description>
    </item>
    <item>
      <title>OnePlus 15 vs Samsung Galaxy S25&#160;: comment choisir le meilleur smartphone haut de gamme&#160;?</title>
      <link>https://www.frandroid.com/versus/2906247_oneplus-15-vs-samsung-galaxy-s25-comment-choisir-le-meilleur-smartphone-haut-de-gamme</link>
      <pubDate>Sun, 14 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/versus/2906247_oneplus-15-vs-samsung-galaxy-s25-comment-choisir-le-meilleur-smartphone-haut-de-gamme</guid>
      <description>
Se tourner vers Samsung est une &#233;vidence, lorsqu'on cherche un smartphone Android. Mais d'autres marques ont &#233;galement des produits haut de gamme de tr&#232;s bon standing, comme le OnePlus 15 qui met tout le monde d'accord en cette fin d'ann&#233;e.
</description>
    </item>
    <item>
      <title>Voici les meilleurs &#233;couteurs ouverts de l&#8217;ann&#233;e &#8211; Frandroid Awards 2025</title>
      <link>https://www.frandroid.com/produits-android/audio/ecouteurs-true-wireless/2900209_voici-les-meilleurs-ecouteurs-ouverts-de-lannee-frandroid-awards-2025</link>
      <pubDate>Sun, 14 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/audio/ecouteurs-true-wireless/2900209_voici-les-meilleurs-ecouteurs-ouverts-de-lannee-frandroid-awards-2025</guid>
      <description>
Les meilleurs &#233;couteurs ouverts test&#233;s par Frandroid sont les Shokz OpenFit 2 Plus. D&#233;couvrez pourquoi ce produit a re&#231;u le Frandroid Awards avec Delos de sa cat&#233;gorie. 
</description>
    </item>
    <item>
      <title>Ayaneo's first smartphone is a major callback to the Xperia Play</title>
      <link>https://www.engadget.com/mobile/smartphones/ayaneos-first-smartphone-is-a-major-callback-to-the-xperia-play-165206332.html?src=rss</link>
      <pubDate>Sun, 14 Dec 2025 16:52:06 +0000</pubDate>
      <guid isPermaLink="false">37c20788-2f29-4c24-ab11-1c9ec3442072</guid>
      <description>Close enough, welcome back Xperia Play. After releasing a teaser video in early November, Ayaneo fully revealed its first smartphone called the Pocket Play. As suspected, the Ayaneo Pocket Play features a sliding mechanism that transforms it from a chunky smartphone into a gaming handheld.


In its gaming configuration, the Pocket Play features a controller setup with a D-pad, ABXY buttons and four shoulder buttons. However, Ayaneo has modernized the Xperia Play design by incorporating two touchpads, which will also be seen in the handheld maker's next flagship device called the Next II. Accor...</description>
    </item>
    <item>
      <title>Boulanger r&#233;gale les gamers avec cet &#233;cran Samsung QHD de 27&#8243; et 350 Hz brad&#233; &#224; un super prix</title>
      <link>https://www.frandroid.com/bons-plans/2907955_boulanger-regale-les-gamers-avec-cet-ecran-samsung-qhd-de-27-et-350-hz-brade-a-un-super-prix</link>
      <pubDate>Sun, 14 Dec 2025 16:12:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2907955_boulanger-regale-les-gamers-avec-cet-ecran-samsung-qhd-de-27-et-350-hz-brade-a-un-super-prix</guid>
      <description>
L'&#233;cran PC Samsung Odyssey G6 G60F est affich&#233; &#224; 399,99 euros au lieu de 499,99 euros sur Boulanger, de quoi s'&#233;quiper avec du mat&#233;riel de qualit&#233; pour jouer dans de bonnes conditions.
</description>
    </item>
    <item>
      <title>Want to know which 2025 LG OLED TV to buy? I tested three models side-by-side, and there's one clear winner</title>
      <link>https://www.techradar.com/televisions/want-to-know-which-2025-lg-oled-tv-to-buy-i-tested-three-models-side-by-side-and-theres-one-clear-winner</link>
      <pubDate>Sun, 14 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">XRWcRCXXivMFQVQupXxrU8</guid>
      <description>I evaluated the G5, C5 and B5 side-by-side to find out which is the best overall value.</description>
    </item>
    <item>
      <title>&#8216;The Batman Part II&#8217; May Have Scarlett Johansson For a Killer Role</title>
      <link>https://gizmodo.com/the-batman-part-ii-may-have-scarlett-johansson-for-a-killer-role-2000699523</link>
      <pubDate>Sun, 14 Dec 2025 15:30:28 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000699523</guid>
      <description>Johansson may wind up playing someone most people wouldn't have guessed (or known) for 'The Batman Part II.'</description>
    </item>
    <item>
      <title>Inside the high drama of the iPhone 4</title>
      <link>https://www.theverge.com/podcast/844408/inside-the-high-drama-of-the-iphone-4</link>
      <pubDate>2025-12-14T10:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=844408</guid>
      <description>By 2010, the iPhone era was in full swing. Smartphones were still a new and unfinished idea - the iPhone had only just gotten copy and paste! - but it was clear that these big slabs of glass were going to change the way we did pretty much everything. Apple was also already on an [&#8230;]</description>
    </item>
  </channel>
</rss>
