<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 09 Feb 2026 10:11:56 GMT</lastBuildDate>
    <item>
      <title>Trump Mobile d&#233;voile les caract&#233;ristiques techniques de son smartphone T1</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2970447_trump-mobile-devoile-les-caracteristiques-techniques-de-son-smartphone-t1</link>
      <pubDate>Mon, 09 Feb 2026 10:07:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2970447_trump-mobile-devoile-les-caracteristiques-techniques-de-son-smartphone-t1</guid>
      <description>
Regardez bien les nouvelles images du Trump T1, car le smartphone pr&#233;sidentiel ne ressemble plus du tout &#224; ce qu'on nous avait promis. Plus cher, moins "local" et dot&#233; d'une fiche technique moins int&#233;ressante.
</description>
    </item>
    <item>
      <title>Linux : tout savoir sur l&#8217;OS libre de droit pour d&#233;buter</title>
      <link>https://www.frandroid.com/os/gnu-linux/2964985_linux-tout-savoir-sur-los-libre-de-droit-pour-debuter</link>
      <pubDate>Mon, 09 Feb 2026 10:04:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/gnu-linux/2964985_linux-tout-savoir-sur-los-libre-de-droit-pour-debuter</guid>
      <description>
Le monde des OS sur PC n'est pas s&#233;par&#233; en une dichotomie entre Windows et macOS. Linux constitue une alternative int&#233;ressante, libre de droits qui plus est, mais qui peut para&#238;tre obscur au grand public. Voici tout ce qu'il faut savoir &#224; propos de Linux. 
</description>
    </item>
    <item>
      <title>L&#8217;iPhone 17e est juste au coin de la rue, avec un nouvel iPad et un iPad Air</title>
      <link>https://www.01net.com/actualites/liphone-17e-est-juste-au-coin-de-la-rue-avec-un-nouvel-ipad-et-un-ipad-air.html</link>
      <pubDate>Mon, 09 Feb 2026 10:02:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324808</guid>
      <description>F&#233;vrier &#233;tait d&#233;j&#224; bien charg&#233; en gros lancements de smartphones, entre les tr&#232;s attendus Pixel 10a et Galaxy S26, et voil&#224; que Bloomberg annonce une pr&#233;sentation &#171; imminente &#187; de l&#8217;iPhone 17e. Positionn&#233; dans la continuit&#233; de l&#8217;iPhone 16e, ce nouveau mod&#232;le d&#8217;entr&#233;e de gamme conserverait son ch&#226;ssis fa&#231;on iPhone 14 mais gagnerait une puce A19 et surtout la charge sans fil MagSafe, sans augmenter le ticket d&#8217;entr&#233;e....</description>
    </item>
    <item>
      <title>The best Apple AirTag accessories for 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-apple-airtag-cases-holders-accessories-123036404.html?src=rss</link>
      <pubDate>Mon, 09 Feb 2026 10:00:36 +0000</pubDate>
      <guid isPermaLink="false">aea1250f-fbc3-4936-91b0-e91b46e44afb</guid>
      <description>Apple&#8217;s AirTag makes it easy to keep tabs on everyday items like keys, wallets and bags, but the tracker itself is only part of the equation. The best AirTag accessories help you attach it securely, protect it from wear and tear and fit it naturally into how you carry your stuff. A good holder can make the difference between an AirTag that&#8217;s always with you and one that&#8217;s easy to forget.Accessories range from slim wallet inserts and low-profile key rings to more rugged mounts designed for bikes, luggage or pet collars. Materials vary just as widely, from leather and silicone to hard plastic sh...</description>
    </item>
    <item>
      <title>For Some Reason, Someone Who Generates AI Slop Books Has Unmasked Herself</title>
      <link>https://gizmodo.com/for-some-reason-someone-who-generates-ai-slop-books-has-unmasked-herself-2000719325</link>
      <pubDate>Mon, 09 Feb 2026 10:00:11 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000719325</guid>
      <description>Someone who calls herself "Coral Hart" is telling the world all her tricks.</description>
    </item>
    <item>
      <title>Bonne nouvelle : les futures fonctions sant&#233; d&#8217;Apple pourraient finalement &#234;tre gratuites</title>
      <link>https://www.frandroid.com/marques/apple/2970139_bonne-nouvelle-les-futures-fonctions-sante-dapple-pourraient-finalement-etre-gratuites</link>
      <pubDate>Mon, 09 Feb 2026 09:56:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2970139_bonne-nouvelle-les-futures-fonctions-sante-dapple-pourraient-finalement-etre-gratuites</guid>
      <description>
Alors qu'Apple semble avoir abandonn&#233; son projet d'abonnement li&#233; &#224; la sant&#233; Health+, le journaliste Mark Gurman indique que les fonctions pr&#233;vues seraient finalement propos&#233;es gratuitement. 
</description>
    </item>
    <item>
      <title>Tesla d&#233;voile enfin la fiche technique impressionnante de son Semi &#233;lectrique : des bonnes surprises mais aussi quelques regressions</title>
      <link>https://www.frandroid.com/marques/tesla/2970033_tesla-devoile-enfin-la-fiche-technique-impressionnante-de-son-semi-electrique-des-bonnes-surprises-mais-aussi-quelques-regressions</link>
      <pubDate>Mon, 09 Feb 2026 09:51:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2970033_tesla-devoile-enfin-la-fiche-technique-impressionnante-de-son-semi-electrique-des-bonnes-surprises-mais-aussi-quelques-regressions</guid>
      <description>
D&#233;voil&#233; en 2017, le Tesla Semi nous en dit un peu plus &#224; son sujet. Le camion &#233;lectrique d&#233;voile enfin ses informations techniques d&#233;taill&#233;es.
</description>
    </item>
    <item>
      <title>Avec 40 % de remise, Xiaomi fait croustiller le prix de son Air Fryer connect&#233; 6.5 L pour rassasier toute la famille</title>
      <link>https://www.frandroid.com/bons-plans/2970079_avec-40-de-remise-xiaomi-fait-croustiller-le-prix-de-son-air-fryer-connecte-6-5-l-pour-rassasier-toute-la-famille</link>
      <pubDate>Mon, 09 Feb 2026 09:48:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2970079_avec-40-de-remise-xiaomi-fait-croustiller-le-prix-de-son-air-fryer-connecte-6-5-l-pour-rassasier-toute-la-famille</guid>
      <description>
Chez Xiaomi, tout est connect&#233;, m&#234;me la friteuse &#224; air chaud : le Xiaomi Air Fryer 6,5 L se dirige &#224; distance et est &#224; retrouver pour 59,99 euros au lieu de 99 euros.
</description>
    </item>
    <item>
      <title>BYD annonce la production en Europe de l&#8217;un de ses mod&#232;les les plus abordables : bonne nouvelle pour le prix de l&#8217;Atto 2</title>
      <link>https://www.frandroid.com/marques/byd/2970067_byd-annonce-la-production-en-europe-de-lun-de-ses-modeles-les-plus-abordables-bonne-nouvelle-pour-le-prix-de-latto-2</link>
      <pubDate>Mon, 09 Feb 2026 09:40:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2970067_byd-annonce-la-production-en-europe-de-lun-de-ses-modeles-les-plus-abordables-bonne-nouvelle-pour-le-prix-de-latto-2</guid>
      <description>
Apr&#232;s la Dolphin Surf, ce sera bient&#244;t au tour du BYD Atto 2 d&#8217;&#234;tre assembl&#233; en Europe, au sein de l&#8217;usine situ&#233;e en Hongrie. La voiture &#233;lectrique devrait d&#233;marrer sa production en Europe sous peu.
</description>
    </item>
    <item>
      <title>En difficult&#233;s financi&#232;res, le n&#176;1 du v&#233;lo en Europe contraint de vendre une nouvelle marque historique</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2970219_en-difficultes-financieres-le-n1-du-velo-en-europe-contraint-de-vendre-une-nouvelle-marque-historique</link>
      <pubDate>Mon, 09 Feb 2026 09:29:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2970219_en-difficultes-financieres-le-n1-du-velo-en-europe-contraint-de-vendre-une-nouvelle-marque-historique</guid>
      <description>
Le fabricant turc Kron rach&#232;te la marque de v&#233;los Nishiki au groupe Accell, une op&#233;ration qui s&#8217;inscrit &#224; la fois dans la strat&#233;gie d&#8217;expansion europ&#233;enne de Kron et dans la poursuite des cessions d&#8217;actifs engag&#233;es par Accell dans un contexte financier tendu.
</description>
    </item>
    <item>
      <title>Samsung Galaxy S26 : voici d&#233;j&#224; des images officielles avant qu&#8217;elles ne soient officielles</title>
      <link>https://www.frandroid.com/marques/samsung/2970141_samsung-galaxy-s26-voici-deja-des-images-officielles-avant-quelles-ne-soient-officielles</link>
      <pubDate>Mon, 09 Feb 2026 09:28:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2970141_samsung-galaxy-s26-voici-deja-des-images-officielles-avant-quelles-ne-soient-officielles</guid>
      <description>
Le leaker Evan Blass partage plusieurs visuels qui devraient &#234;tre officiellement utilis&#233;s pendant la commercialisation des Samsung Galaxy S26, S26 Plus et S26 Ultra.
</description>
    </item>
    <item>
      <title>Apr&#232;s Spotify, YouTube Music serre la vis sur les paroles pour ses utilisateurs gratuits</title>
      <link>https://www.frandroid.com/services/streaming-musical/2970101_apres-spotify-youtube-music-serre-la-vis-sur-les-paroles-pour-ses-utilisateurs-gratuits</link>
      <pubDate>Mon, 09 Feb 2026 09:21:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/streaming-musical/2970101_apres-spotify-youtube-music-serre-la-vis-sur-les-paroles-pour-ses-utilisateurs-gratuits</guid>
      <description>
YouTube Music semble tester une nouvelle restriction : l'acc&#232;s aux paroles des chansons devient limit&#233; pour les utilisateurs ne poss&#233;dant pas d'abonnement Premium.
</description>
    </item>
    <item>
      <title>OpenClaw&#160;: l&#8217;IA open source se tourne vers Google pour chasser les virus de son &#233;cosyst&#232;me</title>
      <link>https://www.01net.com/actualites/openclaw-lia-open-source-tourne-vers-google-chasser-virus-ecosysteme.html</link>
      <pubDate>Mon, 09 Feb 2026 09:19:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324774</guid>
      <description>OpenClaw cherche &#224; am&#233;liorer sa s&#233;curit&#233;. Apr&#232;s la d&#233;couverte de centaines de &#171;&#8239;skills&#8239;&#187; pi&#233;g&#233;s sur sa plateforme Clawhub, l'IA autonome s'est tourn&#233;e vers VirusTotal, une soci&#233;t&#233; qui fait partie de Google. Chaque skill est d&#233;sormais pass&#233; au crible avant d'&#234;tre mis en ligne. Ce nouveau pare-feu n'est cependant pas capable de combler toutes les br&#232;ches&#8230;...</description>
    </item>
    <item>
      <title>Crypto&#160;: la police fran&#231;aise interpelle six ravisseurs apr&#232;s le rapt d&#8217;une magistrate</title>
      <link>https://www.01net.com/actualites/crypto-magistrate-francaise-enlevee-rancon-16-million-deuros.html</link>
      <pubDate>Mon, 09 Feb 2026 09:10:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324561</guid>
      <description>Une magistrate et sa m&#232;re ont &#233;t&#233; enlev&#233;es par un commando de criminels. Les ravisseurs ont demand&#233; 1,6 million d&#8217;euros en bitcoins. Ce rapt survient alors que les enl&#232;vements et agressions visant les d&#233;tenteurs de cryptomonnaies se multiplient en France.</description>
    </item>
    <item>
      <title>Pourquoi est&#8209;ce que l&#8217;on a du mal &#224; vous conseiller, pour l&#8217;instant, les docks tiers sur Nintendo Switch&#8239;2 ?</title>
      <link>https://www.frandroid.com/guide-dachat/2951769_pourquoi-est-ce-que-lon-a-du-mal-a-vous-conseiller-pour-linstant-les-docks-tiers-sur-nintendo-switch-2</link>
      <pubDate>Mon, 09 Feb 2026 09:06:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2951769_pourquoi-est-ce-que-lon-a-du-mal-a-vous-conseiller-pour-linstant-les-docks-tiers-sur-nintendo-switch-2</guid>
      <description>
Depuis toujours, les accessoiristes proposent des alternatives aux produits officiels pour nos consoles de jeux vid&#233;o. La Nintendo Switch 2 ne d&#233;roge pas &#224; la r&#232;gle, mais l'un des accessoires pose question : le dock.
</description>
    </item>
    <item>
      <title>We&#8217;re wired to sync with one another&#8212;and that shapes attraction, trust, and belonging</title>
      <link>https://www.fastcompany.com/91480405/were-wired-to-sync-that-shapes-attraction-trust-and-belonging</link>
      <pubDate>2026-02-09T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480405/were-wired-to-sync-that-shapes-attraction-trust-and-belonging</guid>
      <description>Bring two or more people together and they will immediately begin to synchronize or fall into rhythm with one another. 
Below, Kate Murphy shares five key insights from her new book, Why We Click: The Emerging Science of Interpersonal Synchrony.</description>
    </item>
    <item>
      <title>Tr&#232;s mauvaise nouvelle pour les batteries des voitures &#233;lectriques de Stellantis avec cette double d&#233;cision radicale d&#8217;ACC</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2970025_tres-mauvaise-nouvelle-pour-les-batteries-des-voitures-electriques-de-stellantis-avec-cette-double-decision-radicale-dacc</link>
      <pubDate>Mon, 09 Feb 2026 08:59:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2970025_tres-mauvaise-nouvelle-pour-les-batteries-des-voitures-electriques-de-stellantis-avec-cette-double-decision-radicale-dacc</guid>
      <description>
Rencontrant actuellement des difficult&#233;s, ACC aurait tir&#233; un trait sur ses deux usines de batteries pour voitures &#233;lectriques. Ces derni&#232;res devaient &#234;tre situ&#233;es en Allemagne et en Italie.
</description>
    </item>
    <item>
      <title>Ce chargeur ultra-rapide de 120 W co&#251;te moins de 20 &#8364; gr&#226;ce &#224; cette offre sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2919507_ce-chargeur-ultra-rapide-de-120-w-coute-moins-de-20-euros-grace-a-cette-offre-sur-amazon</link>
      <pubDate>Mon, 09 Feb 2026 08:57:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2919507_ce-chargeur-ultra-rapide-de-120-w-coute-moins-de-20-euros-grace-a-cette-offre-sur-amazon</guid>
      <description>
Compact et puissant, le chargeur Realme SuperVOOC de 120 W permet aux appareils compatibles d'atteindre les 100 % en un rien de temps. Actuellement, Amazon le propose &#224; 19,99 euros au lieu de 29,99 euros.
</description>
    </item>
    <item>
      <title>&#171; Confisqu&#233; et d&#233;truit &#187; : l&#8217;Australie d&#233;clare la guerre aux v&#233;los &#233;lectriques ill&#233;gaux</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2970107_confisque-et-detruit-laustralie-declare-la-guerre-aux-velos-electriques-illegaux</link>
      <pubDate>Mon, 09 Feb 2026 08:54:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2970107_confisque-et-detruit-laustralie-declare-la-guerre-aux-velos-electriques-illegaux</guid>
      <description>
L&#8217;Australie durcit le ton envers les v&#233;los &#233;lectriques en ciblant en priorit&#233; les mod&#232;les ill&#233;gaux import&#233;s, face &#224; la hausse des accidents et &#224; l&#8217;explosion du nombre d&#8217;engins non conformes en circulation.
</description>
    </item>
    <item>
      <title>Le design des Moto Buds 2 Plus fuite avec un bo&#238;tier repens&#233; et un son by Bose</title>
      <link>https://www.frandroid.com/marques/motorola/2970115_le-design-des-moto-buds-2-plus-fuite-avec-un-boitier-repense-et-un-son-by-bose</link>
      <pubDate>Mon, 09 Feb 2026 08:53:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/motorola/2970115_le-design-des-moto-buds-2-plus-fuite-avec-un-boitier-repense-et-un-son-by-bose</guid>
      <description>
Deux ans apr&#232;s le lancement des Moto Buds+, Motorola pr&#233;pare une nouvelle g&#233;n&#233;ration d'&#233;couteurs sans fil. Des visuels venant de fuiter r&#233;v&#232;lent un changement notable dans la conception du bo&#238;tier de charge.
</description>
    </item>
    <item>
      <title>&#171;&#8201;TikTok fait basculer le cerveau en mode pilote automatique&#8201;&#187;&#160;: pourquoi le r&#233;seau social pourrait-il &#234;tre forc&#233; de changer de fond en comble</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2970091_tiktok-fait-basculer-le-cerveau-en-mode-pilote-automatique-pourquoi-le-reseau-social-pourrait-il-etre-force-de-changer-de-fond-en-comble</link>
      <pubDate>Mon, 09 Feb 2026 08:52:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2970091_tiktok-fait-basculer-le-cerveau-en-mode-pilote-automatique-pourquoi-le-reseau-social-pourrait-il-etre-force-de-changer-de-fond-en-comble</guid>
      <description>
TikTok est pens&#233; pour &#234;tre addictif, estime l&#8217;Union europ&#233;enne. Apr&#232;s deux ans d&#8217;enqu&#234;te, Bruxelles menace le r&#233;seau social d&#8217;une amende sal&#233;e &#224; moins qu&#8217;il ne change compl&#232;tement sa mani&#232;re de fonctionner.
</description>
    </item>
  </channel>
</rss>
