<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 21 Feb 2026 08:37:11 GMT</lastBuildDate>
    <item>
      <title>Amazfit Active Max : cette montre connect&#233;e de sport abordable et endurante, not&#233;e 9/10, vient de sortir, mais elle est d&#233;j&#224; en promo</title>
      <link>https://www.frandroid.com/bons-plans/2984437_amazfit-active-max-cette-montre-connectee-de-sport-abordable-et-endurante-notee-9-10-vient-de-sortir-mais-elle-est-deja-en-promo</link>
      <pubDate>Sat, 21 Feb 2026 08:34:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2984437_amazfit-active-max-cette-montre-connectee-de-sport-abordable-et-endurante-notee-9-10-vient-de-sortir-mais-elle-est-deja-en-promo</guid>
      <description>
Autonomie bluffante, &#233;cran Amoled bien lisible, bon suivi GPS... L'Amazfit Active Max peut tout &#224; fait accompagner les sportifs au quotidien. En plus, cette excellente montre connect&#233;e est encore plus abordable que d'habitude : lanc&#233;e &#224; 169,90 euros, elle est d&#233;sormais propos&#233;e &#224; 159,99 euros par Alltricks.
</description>
    </item>
    <item>
      <title>JO Milan-Cortina 2026&#160;: les drones agacent certains spectateurs mais bouleversent l&#8217;image TV</title>
      <link>https://www.01net.com/actualites/jo-milan-cortina-2026-les-drones-agacent-certains-spectateurs-mais-bouleversent-limage-tv.html</link>
      <pubDate>Sat, 21 Feb 2026 08:31:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327229</guid>
      <description>Aux JO de Milan-Cortina 2026, les drones FPV propulsent la diffusion TV dans une nouvelle dimension. Si leur bourdonnement fait r&#233;agir, les sportifs valident &#224; 100 %.</description>
    </item>
    <item>
      <title>Wero s&#8217;attaque &#224; Visa et Mastercard&#160;: &#171;&#160;La perte de contr&#244;le de l&#8217;Europe sur les moyens de paiement est un vrai probl&#232;me&#160;&#187;</title>
      <link>https://www.01net.com/actualites/wero-sattaque-a-visa-et-mastercard-la-perte-de-controle-de-leurope-sur-les-moyens-de-paiement-est-un-vrai-probleme.html</link>
      <pubDate>Sat, 21 Feb 2026 08:27:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326430</guid>
      <description>50 millions d'utilisateurs, un lancement sur le e-commerce cet &#233;t&#233;, une alliance europ&#233;enne pour cr&#233;er un hub de paiement alternatif &#224; MasterCard et &#224; Visa... Depuis plusieurs mois, les &#233;tapes s'encha&#238;nent pour la championne fran&#231;aise du paiement instantan&#233; entre particuliers. Toutes visent &#224; atteindre un graal : prendre la place des am&#233;ricains Visa et Mastercard. Son directeur strat&#233;gie et d&#233;veloppement, Ludovic Francesconi, nous expose la strat&#233;gie et les d&#233;fis &#224; venir....</description>
    </item>
    <item>
      <title>I tested the Blackview Xplore 2 Satellite - and this rugged phone can call from remote places, if the stars align</title>
      <link>https://www.techradar.com/pro/phone-communications/blackview-xplore-2-satellite-rugged-phone-review</link>
      <pubDate>Sat, 21 Feb 2026 08:20:00 +0000</pubDate>
      <guid isPermaLink="false">aw4bNHW6GnCvbTjbti3hLC</guid>
      <description>The Blackview Xplore 2 Satellite is a heavyweight rugged phone built with the ability to make calls and send messages via the Skylo satellite service.</description>
    </item>
    <item>
      <title>Les meilleures applis pour votre voiture &#233;lectrique&#160;: notre s&#233;lection</title>
      <link>https://www.01net.com/actualites/les-meilleures-applis-pour-votre-voiture-electrique-notre-selection.html</link>
      <pubDate>Sat, 21 Feb 2026 08:10:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318204</guid>
      <description>Une s&#233;lection d&#8217;applications indispensables si vous poss&#233;dez une voiture &#233;lectrique. Charger, trouver le meilleur itin&#233;raire ou le prix au kWh... tout ce qu'il vous faut sur votre smartphone est dans cette liste.</description>
    </item>
    <item>
      <title>'Modern technologies have revolutionised virtually every aspect of sport': Get ready for more AI coming to all the sports you love</title>
      <link>https://www.techradar.com/pro/modern-technologies-have-revolutionised-virtually-every-aspect-of-sport-get-ready-for-more-ai-coming-to-all-the-sports-you-love</link>
      <pubDate>Sat, 21 Feb 2026 08:05:00 +0000</pubDate>
      <guid isPermaLink="false">JiUBLBvatPjmDLt8WqGYEF</guid>
      <description>Nearly 100 per cent of sport organisations plan to increase AI use going forward, report finds.</description>
    </item>
    <item>
      <title>Le patron de Renault explique pourquoi la R5 &#233;lectrique n&#8217;a pas encore le droit &#224; la batterie qui ferait chuter son prix</title>
      <link>https://www.frandroid.com/marques/renault/2985341_le-patron-de-renault-explique-pourquoi-la-r5-electrique-na-pas-encore-le-droit-a-la-batterie-qui-ferait-chuter-son-prix</link>
      <pubDate>Sat, 21 Feb 2026 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2985341_le-patron-de-renault-explique-pourquoi-la-r5-electrique-na-pas-encore-le-droit-a-la-batterie-qui-ferait-chuter-son-prix</guid>
      <description>
Le patron de Renault a profit&#233; de la pr&#233;sentation des r&#233;sultats financiers pour revenir en d&#233;tail sur les nouvelles batteries LFP sans cobalt. Si elles sont bien pr&#233;vues pour les nouvelles Twingo et M&#233;gane, la R5 manque &#224; l'appel pour le moment. Et la raison est tr&#232;s simple.
</description>
    </item>
    <item>
      <title>Anker&#8217;s powerful home theater on wheels is pure chaos</title>
      <link>https://www.theverge.com/tech/881788/soundcore-nebula-x1-pro-review-comparison-x1</link>
      <pubDate>2026-02-21T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/881788/djis-first-robovac-is-an-autonomous-cleaning-drone-you-cant-trust</guid>
      <description>The Soundcore Nebula X1 Pro is too weird to exist. It takes the excellent 4K projector and karaoke microphones from Anker's Nebula X1 and stuffs them inside a powerful five-speaker Google TV party on wheels. It's so absurd that it feels like a gadget fever dream - and I'm here for it. At the heart [&#8230;]</description>
    </item>
    <item>
      <title>What CES 2026 didn&#8217;t show: The quiet crisis in wireless capacity nobody is talking about</title>
      <link>https://www.techradar.com/pro/what-ces-2026-didnt-show-the-quiet-crisis-in-wireless-capacity-nobody-is-talking-about</link>
      <pubDate>Sat, 21 Feb 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">vx5hBAPwtYPUsG9eyrZ65h</guid>
      <description>There&#8217;s a quiet crisis unfolding: capacity is collapsing. Light beams can unleash the internet.</description>
    </item>
    <item>
      <title>Pirat&#233;s &#224; la sortie de l&#8217;usine&#160;: des milliers de smartphones ont &#233;t&#233; infect&#233;s par un malware chinois</title>
      <link>https://www.01net.com/actualites/pirates-sortie-usine-milliers-smartphones-infectes-malware-chinois.html</link>
      <pubDate>Sat, 21 Feb 2026 07:30:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326586</guid>
      <description>Un malware est parvenu &#224; infecter des milliers de smartphones Android avant m&#234;me leur sortie de l'usine. Baptis&#233; Keenadu, le virus transforme les t&#233;l&#233;phones en machines pour la fraude publicitaire. Le logiciel est aussi capable de piller les donn&#233;es d'un smartphone.</description>
    </item>
    <item>
      <title>How a good file helped me break free of Yahoo! Mail</title>
      <link>https://www.techradar.com/pro/how-a-good-file-helped-me-break-free-of-yahoo-mail</link>
      <pubDate>Sat, 21 Feb 2026 07:15:00 +0000</pubDate>
      <guid isPermaLink="false">SBQtbWZphjeVhgeCNM2Krc</guid>
      <description>When Yahoo! Mail changed its quota to 2% of its previous quota, two tools came to the rescue.</description>
    </item>
    <item>
      <title>How to watch Super 8 at T20 World Cup 2026: Free Streams, TV Channels, Schedule</title>
      <link>https://www.techradar.com/how-to-watch/cricket/t20-world-cup-super-8-2026-free</link>
      <pubDate>Sat, 21 Feb 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">tQnjhfcSgehDKwKT7AiiLk</guid>
      <description>All the ways to watch T20 World Cup Super 8 2026 live streams online from anywhere for FREE, to see who will progress to the semi-finals.</description>
    </item>
    <item>
      <title>Which of Dyson's wet-floor cleaners should you buy? Here's what I'd recommend</title>
      <link>https://www.techradar.com/home/vacuums/dyson-pencilwash-vs-washg1-vs-clean-wash-hygiene</link>
      <pubDate>Sat, 21 Feb 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">wdMM2vEm5B7eLtRTYBhjSV</guid>
      <description>The Dyson WashG1, Clean+Wash Hygiene and new PencilWash go head-to-head in a battle of the mops.</description>
    </item>
    <item>
      <title>Thinking about getting the Google Pixel 10a? I've looked through every network's deals and these are the biggest discounts</title>
      <link>https://www.techradar.com/phones/google-pixel-phones/thinking-about-getting-the-google-pixel-10a-ive-looked-through-every-networks-deals-and-these-are-the-biggest-discounts</link>
      <pubDate>Sat, 21 Feb 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">KY58tPd7mZkePyE5dg82nc</guid>
      <description>I've looked through all of this week's initial preorder promotions for the brand new Google Pixel 10a &#8212; here are the biggest discounts from all the usual suspects.</description>
    </item>
    <item>
      <title>I've trawled through the Amazon UK weekend sale and picked the 15 best tech deals that'll please any bargain hunter</title>
      <link>https://www.techradar.com/tech/ive-trawled-through-the-amazon-uk-weekend-sale-and-picked-the-15-best-tech-deals-thatll-please-any-bargain-hunter</link>
      <pubDate>Sat, 21 Feb 2026 06:55:00 +0000</pubDate>
      <guid isPermaLink="false">LvN2V6wbWwhkyDVjsQDMJF</guid>
      <description>I've taken yet another look through the sales section at Amazon UK and picked out 15 of the best tech deals that I recommend buying if you're in the mood to go shopping.</description>
    </item>
  </channel>
</rss>
