<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 11 Jan 2026 08:32:27 GMT</lastBuildDate>
    <item>
      <title>Ce smartphone premium sign&#233; Motorola avec &#233;cran OLED 144 Hz et charge 125W solde &#224; -50 % devient Ultra int&#233;ressant</title>
      <link>https://www.frandroid.com/marques/2937389_ce-smartphone-premium-signe-motorola-avec-ecran-oled-144-hz-et-charge-125w-solde-a-50-devient-ultra-interessant</link>
      <pubDate>Sun, 11 Jan 2026 08:22:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2937389_ce-smartphone-premium-signe-motorola-avec-ecran-oled-144-hz-et-charge-125w-solde-a-50-devient-ultra-interessant</guid>
      <description>
Le Motorola Edge 50 Ultra n'a jamais aussi bien port&#233; son nom qu'en ces soldes d'hiver 2026 puisque chez Darty, il voit son prix divis&#233; quasiment par deux et tombe &#224; 502 euros. 
</description>
    </item>
    <item>
      <title>Masters Snooker 2026 Free Streams: TV Channels, Preview and Schedule as Shaun Murphy looks to defend his title</title>
      <link>https://www.techradar.com/how-to-watch/sport/masters-snooker-2026-free</link>
      <pubDate>Sun, 11 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">THNgNHUJNUKnegqBHuzoPZ</guid>
      <description>Here are the TV channels, broadcasters, live streams and start times for the 2026 Masters snooker. Who will claim the crown in London?</description>
    </item>
    <item>
      <title>Une semaine &#224; Las Vegas&#160;: notre bilan du CES 2026</title>
      <link>https://www.01net.com/actualites/une-semaine-a-las-vegas-notre-bilan-du-ces-2026.html</link>
      <pubDate>Sun, 11 Jan 2026 07:38:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318964</guid>
      <description>Au-del&#224; des produits et des technologies stars, que faut-il vraiment retenir de cette &#233;dition 2026 du CES ? De la robotique au RGB en passant par le nouveau vocabulaire de l&#8217;IA, voici ce qu&#8217;on retiendra de cette semaine au c&#339;ur du plus grand salon d&#233;di&#233; aux nouvelles technologies.</description>
    </item>
    <item>
      <title>Votre enfant est trop jeune pour avoir un smartphone ? Voici une alternative pas ch&#232;re qui rassure les parents [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2931285_votre-enfant-est-trop-jeune-pour-avoir-un-smartphone-voici-une-alternative-pas-chere-qui-rassure-les-parents</link>
      <pubDate>Sun, 11 Jan 2026 07:11:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2931285_votre-enfant-est-trop-jeune-pour-avoir-un-smartphone-voici-une-alternative-pas-chere-qui-rassure-les-parents</guid>
      <description>
Avec la Kids Watch, Bouygues Telecom offre une solution pratique, ludique et peu on&#233;reuse pour accompagner les premiers pas de votre enfant dans l&#8217;univers num&#233;rique&#8230; tout en gardant un &#339;il sur ses d&#233;placements.
</description>
    </item>
    <item>
      <title>The ultimate mobile office loadout: Turn your backpack into a mobile HQ with the pro-grade gear you need to work absolutely anywhere</title>
      <link>https://www.techradar.com/pro/the-ultimate-mobile-office-loadout-turn-your-backpack-into-a-mobile-hq-with-the-pro-grade-gear-you-need-to-work-absolutely-anywhere</link>
      <pubDate>Sun, 11 Jan 2026 07:05:00 +0000</pubDate>
      <guid isPermaLink="false">oaNbJo4pGHHg5MqFnATSf7</guid>
      <description>Here's everything you need to stay productive when working on the go.</description>
    </item>
    <item>
      <title>I tested the Marinamantra Flow - a standing desk that goes so low you can work while sitting cross-legged on the floor</title>
      <link>https://www.techradar.com/pro/marinamantra-flow-standing-desk-review</link>
      <pubDate>Sun, 11 Jan 2026 07:05:00 +0000</pubDate>
      <guid isPermaLink="false">BWzSS75daZYWZSryddrAK8</guid>
      <description>The Marinamantra Flow is a premium minimalist standing desk for those who want a calm and simple workspace. It may be a first generation model, but it&#8217;s got a lot of things going right.</description>
    </item>
    <item>
      <title>Arnaque &#224; la fausse carte bancaire&#160;: une nouvelle escroquerie envahit les bo&#238;tes aux lettres en France</title>
      <link>https://www.01net.com/actualites/arnaque-fausse-carte-bancaire-nouvelle-escroquerie-envahit-boites-lettres-france.html</link>
      <pubDate>Sun, 11 Jan 2026 07:02:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318586</guid>
      <description>Les escrocs ne se contentent plus d'envahir votre bo&#238;te mail. Les arnaques s&#8217;invitent d&#233;sormais dans vos bo&#238;tes aux lettres. Pour berner les Fran&#231;ais, les cybercriminels glissent une carte bancaire factice dans le courriel. La lettre pr&#233;tend que la carte doit &#234;tre activ&#233;e de toute urgence&#8230; en scannant un QR code.</description>
    </item>
    <item>
      <title>How leaders can harness productivity to unlock creativity</title>
      <link>https://www.fastcompany.com/91470075/how-leaders-can-harness-productivity-to-unlock-creativity</link>
      <pubDate>2026-01-11T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91470075/how-leaders-can-harness-productivity-to-unlock-creativity</guid>
      <description>The most effective leaders don&#8217;t choose between productivity and creativity. Instead, they build habits that make each stronger.
Most business leaders view themselves primarily as &#8220;productive&#8221; rather than &#8220;creative.&#8221; Productivity is often associated with measurable outcomes, such as efficiency, consistency, and task completion. Creativity, by contrast, is frequently perceived as spontaneous, unpredictable, and elusive. Yet, productivity and creativity are not at odds. In fact, they reinforce each other powerfully. ...</description>
    </item>
  </channel>
</rss>
