<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 22 Dec 2025 17:22:43 GMT</lastBuildDate>
    <item>
      <title>RFK Jr. Tried to Wreck the Childhood Vaccine Schedule Over the Weekend</title>
      <link>https://gizmodo.com/rfk-jr-tried-to-wreck-the-childhood-vaccine-schedule-over-the-weekend-2000702477</link>
      <pubDate>Mon, 22 Dec 2025 17:20:17 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702477</guid>
      <description>HHS officials reportedly feared the abrupt change would incur a successful lawsuit.</description>
    </item>
    <item>
      <title>Elevate your home bar with these mixology gadgets</title>
      <link>https://techcrunch.com/2025/12/22/elevate-your-home-bar-with-these-mixology-gadgets/</link>
      <pubDate>Mon, 22 Dec 2025 17:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3072960</guid>
      <description>From robotic bartenders to smart coasters that ensure the perfect pour, here are some cool gadgets to elevate your home bar.</description>
    </item>
    <item>
      <title>#FrandroidOffreMoi le super TV TCL55C79K</title>
      <link>https://www.frandroid.com/marques/tcl/2917335_frandroidoffremoi-le-super-tv-tcl55c79k</link>
      <pubDate>Mon, 22 Dec 2025 17:12:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tcl/2917335_frandroidoffremoi-le-super-tv-tcl55c79k</guid>
      <description>
La 22e case du concours #FrandroidOffreMoi s'ouvre sur un tr&#232;s beau cadeau, le TCL55C79K ! Voici comment gagner ce t&#233;l&#233;viseur.
</description>
    </item>
    <item>
      <title>Objectif impossible pour Xbox : Microsoft d&#233;ment le chiffre, sans nous convaincre</title>
      <link>https://www.frandroid.com/marques/microsoft/2918479_objectif-impossible-pour-xbox-microsoft-dement-le-chiffre-sans-nous-convaincre</link>
      <pubDate>Mon, 22 Dec 2025 17:06:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2918479_objectif-impossible-pour-xbox-microsoft-dement-le-chiffre-sans-nous-convaincre</guid>
      <description>
Microsoft r&#233;pond &#224; une enqu&#234;te de Bloomberg dat&#233;e d'octobre 2025. La firme d&#233;ment le chiffre donn&#233; par le m&#233;dia am&#233;ricain : Xbox n'aurait pas un devoir de marge b&#233;n&#233;ficiaire de 30 %.
</description>
    </item>
    <item>
      <title>Amazon is reportedly being deluged with North Korean job applicants eager to break inside its walls</title>
      <link>https://www.techradar.com/pro/security/amazon-is-being-reportedly-deluged-with-fake-north-korean-job-applicants</link>
      <pubDate>Mon, 22 Dec 2025 17:05:00 +0000</pubDate>
      <guid isPermaLink="false">nuoym4WfHx7cDXEF7Ups37</guid>
      <description>Amazon detections are up 27%, with Microsoft also worried about North Korean remote job applications.</description>
    </item>
    <item>
      <title>Netflix doesn&amp;#8217;t stream its &amp;#8216;Originals&amp;#8217; forever, here are some that may leave in 2026</title>
      <link>https://www.theverge.com/news/849044/netflix-original-leaving-streaming-platform-2026</link>
      <pubDate>2025-12-22T12:03:13-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=849044</guid>
      <description>Although Netflix Originals are shows the streamer produces itself or has exclusive licensing arrangements for, they aren't always available on the platform indefinitely. What's on Netflix has compiled a comprehensive list of 100 Netflix Originals movies and series set to be removed from the platform throughout 2026. The list includes several animated series like seasons [&#8230;]...</description>
    </item>
    <item>
      <title>Conduite autonome&#160;: pendant que Tesla teste en Europe, Xiaomi passe au niveau sup&#233;rieur en Chine</title>
      <link>https://www.01net.com/actualites/conduite-autonome-pendant-que-tesla-teste-en-europe-xiaomi-passe-au-niveau-superieur-en-chine.html</link>
      <pubDate>Mon, 22 Dec 2025 17:02:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316677</guid>
      <description>Le g&#233;ant de la tech ne perd pas de temps. Moins de deux ans apr&#232;s son entr&#233;e fracassante dans l'automobile, Xiaomi vient d'obtenir l'autorisation officielle de tester sa conduite autonome de niveau 3 sur route ouverte. Une &#233;tape cl&#233; qui permet de l&#226;cher le volant (et les yeux) dans certaines conditions, l&#224; o&#249; la plupart des concurrents restent bloqu&#233;s au niveau 2....</description>
    </item>
    <item>
      <title>The Best Sci-Fi, Fantasy, and Horror Films of 2025</title>
      <link>https://gizmodo.com/best-sci-fi-fantasy-horror-films-2025-2000701867</link>
      <pubDate>Mon, 22 Dec 2025 17:00:59 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000701867</guid>
      <description>io9 picks its favorite genre movies of the year, including 'KPop Demon Hunters,' 'Superman,' 'Bugonia,' and more.</description>
    </item>
    <item>
      <title>5 of the best free movies to stream on Tubi, Pluto TV, Samsung TV Plus, and more this week (December 22)</title>
      <link>https://www.techradar.com/streaming/5-of-the-best-free-movies-to-stream-on-tubi-pluto-tv-samsung-tv-plus-and-more-this-week-december-22</link>
      <pubDate>Mon, 22 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">Qt8PDzapaD9JkkDNNsNdeS</guid>
      <description>From Christmas classics to horror hits, there's lots of movies to watch for free this week.</description>
    </item>
    <item>
      <title>Voici quel est le meilleur aspirateur balai de l&#8217;ann&#233;e &#8211; Frandroid Awards 2025</title>
      <link>https://www.frandroid.com/produits-android/2917233_voici-quel-est-le-meilleur-aspirateur-balai-de-lannee-frandroid-awards-2025</link>
      <pubDate>Mon, 22 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2917233_voici-quel-est-le-meilleur-aspirateur-balai-de-lannee-frandroid-awards-2025</guid>
      <description>
Les aspirateurs balais viennent d'appara&#238;tre sur le comparateur de Frandroid, l'occasion pour nous de r&#233;compenser le meilleur mod&#232;le. C'est le Roborock F25 Ultra qui a re&#231;u le Frandroid Awards de sa cat&#233;gorie.
</description>
    </item>
    <item>
      <title>Splat&#8217;s app uses AI to turn your photos into coloring pages for kids</title>
      <link>https://techcrunch.com/2025/12/22/splats-app-uses-ai-to-turn-your-photos-into-coloring-pages-for-kids/</link>
      <pubDate>Mon, 22 Dec 2025 16:55:48 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078249</guid>
      <description>The app turns your own photos into pages for your kids to color, via AI.</description>
    </item>
    <item>
      <title>The Beats Studio Pro headphones are $200 off today</title>
      <link>https://www.theverge.com/gadgets/849065/beats-headphones-pixel-10-paperwhite-deals-sales</link>
      <pubDate>2025-12-22T11:52:40-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=849065</guid>
      <description>Christmas Eve is in two days, and if you&#8217;ve got a problem with procrastination, it&#8217;s time to, well, stop procrastinating. There are still some really good deals to be gotten out there, some of which may arrive just in the nick. (Worse comes to worst, you can say it&#8217;s a New Year&#8217;s gift, right?) One [&#8230;]</description>
    </item>
    <item>
      <title>Russia Is Developing Orbiting Clouds of Shrapnel to Take Down Starlinks, NATO Suspects</title>
      <link>https://gizmodo.com/russia-is-developing-orbiting-clouds-of-shrapnel-to-take-down-starlinks-nato-suspects-2000702532</link>
      <pubDate>Mon, 22 Dec 2025 16:50:38 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702532</guid>
      <description>The intelligence findings are alarming, but some space security experts aren&#8217;t convinced Russia would take such a misguided risk.</description>
    </item>
    <item>
      <title>Amazon just quietly dropped its best Google Pixel 10 deal ever &#8211; it's now officially cheaper than Black Friday</title>
      <link>https://www.techradar.com/phones/google-pixel-phones/amazon-just-quietly-dropped-its-best-google-pixel-10-deal-ever-its-now-officially-cheaper-than-black-friday</link>
      <pubDate>Mon, 22 Dec 2025 16:49:48 +0000</pubDate>
      <guid isPermaLink="false">WvqXpoTBXNdzrwDhvmMsEg</guid>
      <description>Amazon just dropped the best unlocked Google Pixel 10 deal yet thanks to an easy-to-miss coupon code.</description>
    </item>
    <item>
      <title>The Indie Game Awards snatches back two trophies from Clair Obscur over its use of generative AI</title>
      <link>https://www.engadget.com/gaming/the-indie-game-awards-snatches-back-two-trophies-from-clair-obscur-over-its-use-of-generative-ai-164730842.html?src=rss</link>
      <pubDate>Mon, 22 Dec 2025 16:47:30 +0000</pubDate>
      <guid isPermaLink="false">ac46a86b-0d9a-4172-88bd-37d4ab7f1820</guid>
      <description>The Indie Game Awards has stripped Clair Obscur: Expedition 33 of two major awards, including Game of the Year and Debut Game. This is due to developer Sandfall Interactive's use of generative AI, as reported by Mashable.
This looks to be fairly cut and dry. The awards ceremony clearly states in its FAQ that any game that uses generative AI in the development process would be "strictly ineligible" for nominations. It was recently revealed that Sandfall did indeed use generative AI while making Clair Obscur.
Correct me if I'm wrong, but it appears as though Clair Obscure: Expedition 33 used gen...</description>
    </item>
    <item>
      <title>12 versions pour une seule voiture : l&#8217;&#233;trange strat&#233;gie de Xpeng pour sa nouvelle Mona M03</title>
      <link>https://www.frandroid.com/marques/xpeng/2918553_12-versions-pour-une-seule-voiture-letrange-strategie-de-xpeng-pour-sa-nouvelle-mona-m03</link>
      <pubDate>Mon, 22 Dec 2025 16:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2918553_12-versions-pour-une-seule-voiture-letrange-strategie-de-xpeng-pour-sa-nouvelle-mona-m03</guid>
      <description>
Le constructeur chinois Xpeng peaufine sa berline &#233;lectrique Mona M03 avec une strat&#233;gie pour le moins originale : proposer pas moins de 12 configurations d'autonomie diff&#233;rentes. Entre 485 et 640 kilom&#232;tres, ce catalogue pl&#233;thorique interroge autant qu'il intrigue.
</description>
    </item>
    <item>
      <title>I correctly predicted ChatGPT. Here are my 6 AI predictions for 2026</title>
      <link>https://www.fastcompany.com/91461250/i-correctly-predicted-chatgpt-my-6-ai-predictions-2026</link>
      <pubDate>2025-12-22T16:43:56</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91461250/i-correctly-predicted-chatgpt-my-6-ai-predictions-2026</guid>
      <description>It feels like AI moves so quickly that it&#8217;s impossible to know what&#8217;s coming next.
Just when you think you&#8217;ve wrapped your mind around computers that can put your dog in front of the Eiffel Tower or chatbots that act like your best friend (or lover), the AI behemoths surprise you with a fully AI-powered TikTok or the ability to virtually bring back your dead relatives....</description>
    </item>
    <item>
      <title>Warner Bros. : Larry Ellison pose 40 milliards et sa carte &#171;&#160;ami de Trump&#160;&#187; pour &#233;craser Netflix</title>
      <link>https://www.frandroid.com/services/svod/2918781_warner-bros-larry-ellison-pose-40-milliards-et-sa-carte-ami-de-trump-pour-ecraser-netflix</link>
      <pubDate>Mon, 22 Dec 2025 16:43:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2918781_warner-bros-larry-ellison-pose-40-milliards-et-sa-carte-ami-de-trump-pour-ecraser-netflix</guid>
      <description>
L'histoire est digne d'un &#233;pisode de Succession. Netflix pensait avoir s&#233;curis&#233; le catalogue HBO et Harry Potter pour 82,7 milliards. Mais c'&#233;tait sans compter sur l'ego de la famille Ellison. David (le fils) appelle Larry (le p&#232;re, 246 milliards de fortune) &#224; la rescousse pour garantir le financement. 
</description>
    </item>
    <item>
      <title>OpenAI&#8217;s Child Exploitation Reports Increased Sharply This Year</title>
      <link>https://www.wired.com/story/openai-child-safety-reports-ncmec/</link>
      <pubDate>Mon, 22 Dec 2025 16:32:20 +0000</pubDate>
      <guid isPermaLink="false">69433c793ca6882eee093d75</guid>
      <description>The company made 80 times as many reports to the National Center for Missing &amp; Exploited Children during the first six months of 2025 as it did in the same period a year prior.</description>
    </item>
    <item>
      <title>Instacart scraps AI pricing tests that made some products more expensive</title>
      <link>https://www.theverge.com/news/849061/instacart-ends-ai-pricing-tests-eversight</link>
      <pubDate>2025-12-22T11:32:17-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=849061</guid>
      <description>Instacart is ending its AI-powered pricing tests, which led some users to see higher prices on certain products than others. "Now, if two families are shopping for the same items, at the same time, from the same store location on Instacart, they see the same prices - period," Instacart writes in a blog post on [&#8230;]</description>
    </item>
    <item>
      <title>Smartphones pliants&#160;: Apple et Samsung seraient pr&#234;ts &#224; enterrer les &#233;crans allong&#233;s</title>
      <link>https://www.01net.com/actualites/smartphones-pliants-apple-et-samsung-seraient-prets-a-enterrer-les-ecrans-allonges.html</link>
      <pubDate>Mon, 22 Dec 2025 16:31:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316679</guid>
      <description>L'iPhone pliant attendu avant la fin de l'ann&#233;e prochaine pourrait red&#233;finir le format d'&#233;cran standard pour les appareils au design type &#171; livre &#187;. Il se murmure en effet qu'une fois d&#233;pli&#233;, le futur smartphone d'Apple aura une dalle 4:3, &#224; l'image d'un iPad. Samsung pourrait lui aussi y passer franchement avec un futur mod&#232;le de Galaxy Z Fold.</description>
    </item>
    <item>
      <title>Colorado Windstorm Causes 4.8 Microsecond Glitch in Official U.S. Time</title>
      <link>https://gizmodo.com/colorado-windstorm-causes-4-8-microsecond-glitch-in-official-u-s-time-2000702524</link>
      <pubDate>Mon, 22 Dec 2025 16:30:47 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702524</guid>
      <description>A destructive windstorm disrupted the power supply to more than a dozen atomic clocks that keep official time in the United States.</description>
    </item>
    <item>
      <title>Uber allows violent felons to drive on its platform, investigation finds</title>
      <link>https://www.engadget.com/big-tech/uber-allows-violent-felons-to-drive-on-its-platform-investigation-finds-162721155.html?src=rss</link>
      <pubDate>Mon, 22 Dec 2025 16:27:21 +0000</pubDate>
      <guid isPermaLink="false">5f49c81d-f1e7-4989-98c4-a5737806376b</guid>
      <description>An investigation by the New York Times into Uber's background checks and safety procedures for its drivers found a patchwork approach that opens the door for violent felons to drive for the ride-hailing platform.
Uber outright rejects applicants convicted of murder, sexual assault, kidnapping and terrorism. However, in 22 states, the Times found Uber can approve applicants convicted of many other offenses including child abuse, assault and stalking, if the convictions are at least seven years old. The extensive investigation also found that in 35 states, these checks are based largely on where...</description>
    </item>
    <item>
      <title>Pirate Activists Announce They Scraped Spotify in Massive 300 Terabyte Archive</title>
      <link>https://gizmodo.com/activists-announce-theyve-to-scrape-all-of-spotify-in-massive-300-terabyte-archive-2000702508</link>
      <pubDate>Mon, 22 Dec 2025 16:25:47 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702508</guid>
      <description>Anna&#8217;s Archive claims it scraped millions of tracks from Spotify in the name of preservation.</description>
    </item>
    <item>
      <title>Faut-il vraiment conserver les lois de Newton pour expliquer les galaxies avec de la mati&#232;re noire ? Partie I</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-faut-il-vraiment-conserver-lois-newton-expliquer-galaxies-matiere-noire-partie-i-128103/#xtor%3DRSS-8</link>
      <pubDate>Mon, 22 Dec 2025 17:25:47 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-faut-il-vraiment-conserver-lois-newton-expliquer-galaxies-matiere-noire-partie-i-128103/#xtor%3DRSS-8</guid>
      <description>Depuis presque 40 ans, les astrophysiciens d&#233;battent pour savoir si l'on doit introduire de nouvelles particules, celles de la fameuse mati&#232;re noire, ou au contraire modifier la physique de Newton pour expliquer les observations concernant les galaxies, les amas de galaxies et la plus vieille...</description>
    </item>
    <item>
      <title>Uber and Lyft to test Baidu robotaxis in London next year, joining Waymo</title>
      <link>https://techcrunch.com/2025/12/22/uber-and-lyft-to-test-baidu-robotaxis-in-london-next-year-joining-waymo/</link>
      <pubDate>Mon, 22 Dec 2025 16:25:19 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078247</guid>
      <description>The geographic expansions continue for the ride-hailing companies' robotaxi plans.</description>
    </item>
    <item>
      <title>Huawei Watch GT 6 Pro : d&#233;j&#224; pr&#232;s de 100 &#8364; de remise pour cette r&#233;cente montre connect&#233;e qui combine &#233;l&#233;gance et fonctions sportives</title>
      <link>https://www.frandroid.com/bons-plans/2918551_huawei-watch-gt-6-pro-deja-pres-de-100-e-de-remise-pour-cette-recente-montre-connectee-qui-combine-elegance-et-fonctions-sportives</link>
      <pubDate>Mon, 22 Dec 2025 16:19:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2918551_huawei-watch-gt-6-pro-deja-pres-de-100-e-de-remise-pour-cette-recente-montre-connectee-qui-combine-elegance-et-fonctions-sportives</guid>
      <description>
Endurante, pr&#233;cise dans ses donn&#233;es et tr&#232;s styl&#233;e, la Huawei Watch GT 6 Pro est une montre connect&#233;e r&#233;ussie. Actuellement, AliExpress la vend &#224; 286,90 euros au lieu de 379,99 euros.
</description>
    </item>
    <item>
      <title>M&#234;me le label &#171; Vendu et exp&#233;di&#233; par Amazon &#187; n&#8217;est plus s&#251;r : m&#233;fiez-vous, de la fausse RAM circule</title>
      <link>https://www.frandroid.com/produits-android/hardware/memoire/2918685_meme-le-label-vendu-et-expedie-par-amazon-nest-plus-sur-mefiez-vous-de-la-fausse-ram-circule</link>
      <pubDate>Mon, 22 Dec 2025 16:19:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/memoire/2918685_meme-le-label-vendu-et-expedie-par-amazon-nest-plus-sur-mefiez-vous-de-la-fausse-ram-circule</guid>
      <description>
Les prix de la RAM grimpent, et les fraudes avec. Un utilisateur Reddit vient d'en faire les frais en recevant un bricolage grossier &#224; la place de sa m&#233;moire DDR5. Si vous comptez monter une machine prochainement, lisez bien ce qui suit avant de cliquer sur "Acheter".
</description>
    </item>
    <item>
      <title>HPE tells customers to patch OneView immediately as top-level security flaw spotted</title>
      <link>https://www.techradar.com/pro/security/hpe-tells-customers-to-patch-oneview-immediately-as-top-level-security-flaw-spotted</link>
      <pubDate>Mon, 22 Dec 2025 16:15:00 +0000</pubDate>
      <guid isPermaLink="false">QTfm67aD3q4tGozWsNGLmF</guid>
      <description>A 10/10 RCE flaw was found in HPE OneView, but it's not yet being abused.</description>
    </item>
    <item>
      <title>The Oura Ring 4 is our health &amp; fitness device of the year &#8212; and it&#8217;s just dropped to a record-low price</title>
      <link>https://www.techradar.com/health-fitness/the-oura-ring-4-is-our-health-and-fitness-device-of-the-year-and-its-just-dropped-to-a-record-low-price</link>
      <pubDate>Mon, 22 Dec 2025 16:12:02 +0000</pubDate>
      <guid isPermaLink="false">VVDvojma5GpuQwmwnsu5xA</guid>
      <description>The Oura Ring 4 is our favorite health &amp; fitness device in 2025. It's back to its all-time low Black Friday price for a limited time &#8211; and it arrives before Christmas.</description>
    </item>
    <item>
      <title>Eureka Ergonomic Ark EL Executive Standing Desk</title>
      <link>https://www.techradar.com/pro/eureka-ergonomic-ark-el-executive-standing-desk</link>
      <pubDate>Mon, 22 Dec 2025 16:05:00 +0000</pubDate>
      <guid isPermaLink="false">ThvFefRQJyiwiqF3X7ifDP</guid>
      <description>The Eureka Ergonomic Ark EL Executive is an attractive and functional standing desk, but its higher price may put off those not looking to spend on a statement piece.</description>
    </item>
    <item>
      <title>Les 10 smartphones les plus populaires de la semaine sur Frandroid : le Galaxy Z TriFold attire toutes les convoitises</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2491986_les-10-smartphones-les-plus-populaires-de-la-semaine-sur-frandroid-le-galaxy-z-trifold-attire-toutes-les-convoitises</link>
      <pubDate>Mon, 22 Dec 2025 16:03:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2491986_les-10-smartphones-les-plus-populaires-de-la-semaine-sur-frandroid-le-galaxy-z-trifold-attire-toutes-les-convoitises</guid>
      <description>
Pour notre top 10 des smartphones les plus populaires de la semaine sur Frandroid, certaines marques prennent le dessus. Sur ce classement, nous retrouvons la nouvelle innovation de chez Samsung.
</description>
    </item>
    <item>
      <title>Adieu Charles de Gaulle, bonjour PA-NG&#160;: la France lance la construction de son nouveau nouveau porte-avions</title>
      <link>https://www.01net.com/actualites/adieu-charles-de-gaulle-bonjour-pa-ng-la-france-lance-la-construction-de-son-nouveau-nouveau-porte-avions.html</link>
      <pubDate>Mon, 22 Dec 2025 16:03:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316657</guid>
      <description>Depuis les &#201;mirats arabes unis, Emmanuel Macron a valid&#233; ce dimanche le lancement de la construction du Porte-Avions de Nouvelle G&#233;n&#233;ration (PA-NG). Un chantier titanesque &#224; 10 milliards d&#8217;euros pour un navire qui devra assurer la souverainet&#233; fran&#231;aise jusqu&#8217;en 2080.</description>
    </item>
    <item>
      <title>1 000 km d&#8217;autonomie en voiture &#233;lectrique : pourquoi il faudra attendre plus longtemps que pr&#233;vu pour la batterie r&#233;volutionnaire</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2918507_1-000-km-dautonomie-en-voiture-electrique-pourquoi-il-faudra-attendre-plus-longtemps-que-prevu-pour-la-batterie-revolutionnaire</link>
      <pubDate>Mon, 22 Dec 2025 16:02:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2918507_1-000-km-dautonomie-en-voiture-electrique-pourquoi-il-faudra-attendre-plus-longtemps-que-prevu-pour-la-batterie-revolutionnaire</guid>
      <description>
Dongfeng vient d'annoncer un report d'un an pour la production de s&#233;rie de ses batteries solides, repoussant l'&#233;ch&#233;ance de septembre 2026 &#224; 2027. Un contretemps assez r&#233;v&#233;lateur des d&#233;fis que repr&#233;sente l'industrialisation de cette technologie promise comme r&#233;volutionnaire.
</description>
    </item>
    <item>
      <title>Get Ready for Tandem OLED TVs, but What the Hell is &#8216;WOLED?&#8217;</title>
      <link>https://gizmodo.com/get-ready-for-tandem-oled-tvs-but-what-the-hell-is-woled-2000702501</link>
      <pubDate>Mon, 22 Dec 2025 16:00:07 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702501</guid>
      <description>Micro RGB is going to have to compete against brighter OLED screens.</description>
    </item>
    <item>
      <title>Chipwrecked</title>
      <link>https://www.theverge.com/ai-artificial-intelligence/848988/nvidia-chip-loans-coreweave-gpu-debt-ai-neocloud</link>
      <pubDate>2025-12-22T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=848988</guid>
      <description>The AI data center build-out, as it currently stands, is dependent on two things: Nvidia chips and borrowed money. Perhaps it was inevitable that people would begin using Nvidia chips to borrow money. As the craze has gone on, I have begun to worry about the weaknesses of the AI data center boom; looking deeper [&#8230;]</description>
    </item>
    <item>
      <title>Fulham vs Nottingham Forest live streams: How to watch Premier League 2025-26 clash from anywhere in the world.</title>
      <link>https://www.techradar.com/how-to-watch/football/fulham-vs-nottingham-forest-premier-league-2025-26</link>
      <pubDate>Mon, 22 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">A5hB5eSMc6iFAL5kkwEgG3</guid>
      <description>We'll show you all the ways you can watch Fulham vs Nottingham Forest in the Premier League this Monday from anywhere in the world.</description>
    </item>
    <item>
      <title>Hisense mise gros sur le home cin&#233;ma avec deux vid&#233;oprojecteurs phares annonc&#233;s pour le CES 2026</title>
      <link>https://www.frandroid.com/marques/hisense/2918611_hisense-mise-gros-sur-le-home-cinema-avec-deux-videoprojecteurs-phares-annonces-pour-le-ces-2026</link>
      <pubDate>Mon, 22 Dec 2025 15:58:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/hisense/2918611_hisense-mise-gros-sur-le-home-cinema-avec-deux-videoprojecteurs-phares-annonces-pour-le-ces-2026</guid>
      <description>
Hisense pr&#233;sentera au CES 2026 une nouvelle g&#233;n&#233;ration de Laser Home Cin&#233;ma avec deux mod&#232;les phares, le XR10 et le PX4-Pro, con&#231;us pour offrir une tr&#232;s grande image &#224; domicile, une forte luminosit&#233; et une large couverture colorim&#233;trique, en s&#8217;appuyant sur la technologie laser TriChroma.&#8203;&#8203;
</description>
    </item>
    <item>
      <title>A comprehensive list of 2025 tech layoffs</title>
      <link>https://techcrunch.com/2025/12/22/tech-layoffs-2025-list/</link>
      <pubDate>Mon, 22 Dec 2025 15:57:49 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=2607662</guid>
      <description>A complete list of all the known layoffs in tech, from Big Tech to startups, broken down by month throughout 2025.</description>
    </item>
    <item>
      <title>730 km d&#8217;autonomie et recharge ultra-rapide : Volkswagen frappe un grand coup avec son nouveau SUV &#233;lectrique avec Xpeng en Chine</title>
      <link>https://www.frandroid.com/marques/volkswagen/2918473_730-km-dautonomie-et-recharge-ultra-rapide-volkswagen-frappe-un-grand-coup-avec-son-nouveau-suv-electrique-avec-xpeng-en-chine</link>
      <pubDate>Mon, 22 Dec 2025 15:56:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2918473_730-km-dautonomie-et-recharge-ultra-rapide-volkswagen-frappe-un-grand-coup-avec-son-nouveau-suv-electrique-avec-xpeng-en-chine</guid>
      <description>
Volkswagen d&#233;voile les caract&#233;ristiques techniques de son nouveau SUV &#233;lectrique, l'ID.Unyx 08, destin&#233; au march&#233; chinois. Avec des batteries allant jusqu'&#224; 95 kWh et une autonomie maximale de 730 km, le constructeur allemand tente de rattraper son retard par rapport aux acteurs locaux.
</description>
    </item>
    <item>
      <title>Cut through camera roll chaos with these Christmas cloud storage deals - including a huge saving on our top choice</title>
      <link>https://www.techradar.com/pro/cut-through-camera-roll-chaos-with-these-christmas-cloud-storage-deals-including-a-huge-saving-on-our-top-choice</link>
      <pubDate>Mon, 22 Dec 2025 15:51:51 +0000</pubDate>
      <guid isPermaLink="false">RZ4wAPw458KTANF9HzMjLj</guid>
      <description>Christmas videos are some of our most precious memories - keep them safe this festive season with our top storage deals.</description>
    </item>
    <item>
      <title>What&#8217;s really going on with the TikTok deal</title>
      <link>https://www.fastcompany.com/91464665/tiktok-bytedance-china-trump-oracle</link>
      <pubDate>2025-12-22T15:51:37</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464665/tiktok-bytedance-china-trump-oracle</guid>
      <description>A big win for national security? Or a shakedown?
The author of The Art of the Deal always likes to claim he&#8217;s a big winner when it comes to any business arrangement he makes. And in some ways, Donald Trump appears to have won big by finalizing a deal that will see Oracle, Silver Lake, and MGX take part-ownership of a new joint venture designed to oversee operations in the United States of TikTok, the wildly popular social video appl. But dig into the details and you&#8217;ll see that what Trump&#8217;s White House is keen to present as a big win for national security looks more like a standard business de...</description>
    </item>
    <item>
      <title>This gift-wrapping robot is quite funny, actually</title>
      <link>https://www.techradar.com/ai-platforms-assistants/this-gift-wrapping-robot-is-quite-funny-actually</link>
      <pubDate>Mon, 22 Dec 2025 15:45:27 +0000</pubDate>
      <guid isPermaLink="false">vCfRYSFHT9QGntyoJEYb9J</guid>
      <description>Humanoid's HMND 01 Alpha Bipedal robot tries to tackle a new holiday-themed task</description>
    </item>
    <item>
      <title>ChatGPT: Everything you need to know about the AI-powered chatbot</title>
      <link>https://techcrunch.com/2025/12/22/chatgpt-everything-to-know-about-the-ai-chatbot/</link>
      <pubDate>Mon, 22 Dec 2025 15:43:15 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=2607630</guid>
      <description>A timeline of ChatGPT product updates and releases, starting with the latest, which we&#8217;ve been updating throughout the year.</description>
    </item>
    <item>
      <title>Pourquoi Apple est-il condamn&#233; en Italie pour abus de position dominante&#160;?</title>
      <link>https://www.01net.com/actualites/pourquoi-apple-est-il-condamne-en-italie-pour-abus-de-position-dominante.html</link>
      <pubDate>Mon, 22 Dec 2025 15:36:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316622</guid>
      <description>98,6 millions d'euros : voil&#224; le ch&#232;que que devra signer Apple en cette fin d'ann&#233;e 2025 en Europe. Neuf mois plus t&#244;t, la marque &#224; la pomme a &#233;t&#233; condamn&#233;e &#224; une amende similaire en France, pour les m&#234;mes raisons.</description>
    </item>
    <item>
      <title>Le nouveau Amazon Fire TV Stick 4K Plus et sa compatibilit&#233; avec le Dolby Atmos et Vision conna&#238;t une perte importante de 57 % de son prix</title>
      <link>https://www.frandroid.com/bons-plans/2918185_le-nouveau-amazon-fire-tv-stick-4k-plus-et-sa-compatibilite-avec-le-dolby-atmos-et-vision-connait-une-perte-importante-de-57-de-son-prix</link>
      <pubDate>Mon, 22 Dec 2025 15:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2918185_le-nouveau-amazon-fire-tv-stick-4k-plus-et-sa-compatibilite-avec-le-dolby-atmos-et-vision-connait-une-perte-importante-de-57-de-son-prix</guid>
      <description>
En cette fin d'ann&#233;e 2025, Amazon brade son Fire TV Stick 4K Plus puisqu'il conna&#238;t une baisse de 57 %. Une offre qui va vous permettre d'emmener le Dolby Vision et l'Atmos dans votre salon &#224; moindre co&#251;t.
</description>
    </item>
    <item>
      <title>Quelles sont les meilleures cartes graphiques ? Le comparatif des GPU</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-gaming/815386_meilleures-cartes-graphiques</link>
      <pubDate>Mon, 22 Dec 2025 15:30:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-gaming/815386_meilleures-cartes-graphiques</guid>
      <description>
La carte graphique (GPU) est un &#233;l&#233;ment essentiel de tout bon PC gamer. Face &#224; un march&#233; en perp&#233;tuelle &#233;volution, avec des g&#233;n&#233;rations de GPU qui s&#8217;encha&#238;nent et des technologies qui progressent sans cesse, il peut &#234;tre difficile de s&#8217;y retrouver. Bienvenue sur notre guide s&#233;lectif qui vous aidera &#224; choisir la carte graphique la plus pertinente selon votre budget.
...</description>
    </item>
    <item>
      <title>It Sure Seems Like the Foldable iPhone Will Be a Wide Boi</title>
      <link>https://gizmodo.com/it-sure-seems-like-the-foldable-iphone-will-be-a-wide-boi-2000702475</link>
      <pubDate>Mon, 22 Dec 2025 15:30:20 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702475</guid>
      <description>It does make sense if you think about it.</description>
    </item>
  </channel>
</rss>
