<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 25 Dec 2025 08:34:24 GMT</lastBuildDate>
    <item>
      <title>Beats Pill : not&#233;e 9/10, cette enceinte nomade &#233;tanche et ultra-endurante (24 h) est quasiment &#224; moiti&#233; prix</title>
      <link>https://www.frandroid.com/bons-plans/2918281_beats-pill-notee-9-10-cette-enceinte-nomade-etanche-et-ultra-endurante-24-h-est-quasiment-a-moitie-prix</link>
      <pubDate>Thu, 25 Dec 2025 08:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2918281_beats-pill-notee-9-10-cette-enceinte-nomade-etanche-et-ultra-endurante-24-h-est-quasiment-a-moitie-prix</guid>
      <description>
Design, performances audio, autonomie... L'enceinte Bluetooth Beats Pill a coch&#233; toutes les cases lors de notre test. Un excellent mod&#232;le qu'Amazon propose actuellement &#224; 90 euros au lieu de 169,95 euros. 
</description>
    </item>
    <item>
      <title>Amazon est-il all&#233; trop loin dans la surveillance de ses salari&#233;s&#160;? Non selon le Conseil d&#8217;&#201;tat</title>
      <link>https://www.01net.com/actualites/amazon-est-il-alle-trop-loin-dans-la-surveillance-de-ses-salaries-non-selon-le-conseil-detat.html</link>
      <pubDate>Thu, 25 Dec 2025 08:01:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317213</guid>
      <description>Non, Amazon ne surveille pas excessivement ses salari&#233;s, estime la plus haute juridiction administrative, &#224; l'inverse de ce qu'avait d&#233;cid&#233; deux ans plus t&#244;t la CNIL. Mais le g&#233;ant de l'e-commerce est tout de m&#234;me condamn&#233; &#224; une amende de 15 millions d'euros. Voici pourquoi.</description>
    </item>
    <item>
      <title>The best microSD cards in 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-microsd-card-130038282.html?src=rss</link>
      <pubDate>Thu, 25 Dec 2025 08:00:36 +0000</pubDate>
      <guid isPermaLink="false">f411cada-3f1e-487d-8d9a-cb5d30c19fba</guid>
      <description>Most microSD cards are fast enough for stashing photos, recording video and transferring files, but some will get you a little more bang for your buck than others. If you&#8217;re looking to boost the storage of your Nintendo Switch 2, Steam Deck, GoPro or any other device that still accepts microSD cards, we can help. We&#8217;ve thoroughly researched the market and several cards through a suite of benchmark tests. Here are the best that we&#8217;ve tested, along with some general advice on what to look for when buying a new card.
Table of contents

Best microSD cards of 2026
Best microSD Express cards for the...</description>
    </item>
    <item>
      <title>Comment revendre ses cadeaux tech re&#231;us &#224; No&#235;l ?</title>
      <link>https://www.frandroid.com/guide-dachat/185894_comment-revendre-vos-anciens-appareils-apres-noel</link>
      <pubDate>Thu, 25 Dec 2025 08:00:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/185894_comment-revendre-vos-anciens-appareils-apres-noel</guid>
      <description>
Vous avez re&#231;u &#224; No&#235;l un cadeau qui ne vous convient pas, que vous avez d&#233;j&#224; ou dont vous n'avez pas besoin ? Vous pr&#233;voyez de changer de smartphone ou d'ordinateur portable et souhaitez revendre l'ancien ? Vous voulez revendre votre Nintendo Switch ? Voici tous nos conseils pour bien revendre vos appareils tech.
</description>
    </item>
    <item>
      <title>How to watch Call the Midwife 2025 Christmas specials online &#8212; stream latest festive installment of hit period drama</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/call-the-midwife-2025-christmas-specials</link>
      <pubDate>Thu, 25 Dec 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">n8h8WxApe32o6SU5np6BG6</guid>
      <description>With time running out, the Nonnatus head on a rescue mission to Hong Kong. Here's how to watch the Call the Widwife 2025 Christmas specials online anywhere.</description>
    </item>
    <item>
      <title>Tuft &amp; Needle Promo Codes: 20% Off | December 2025</title>
      <link>https://www.wired.com/story/tuft-and-needle-promo-code/</link>
      <pubDate>Thu, 25 Dec 2025 07:10:00 +0000</pubDate>
      <guid isPermaLink="false">681239065a838ce371cf4250</guid>
      <description>Save 20% on best-selling mattresses with our top Tuft &amp; Needle coupon codes.</description>
    </item>
    <item>
      <title>How to watch NFL Week 17: free live streams, TV channels, schedule for Judgment Day</title>
      <link>https://www.techradar.com/how-to-watch/american-football/how-to-watch-nfl-week-17-free</link>
      <pubDate>Thu, 25 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">u9JR98VVTnBoAEncATzZRV</guid>
      <description>All the ways to watch NFL Week 17 live streams online from anywhere for FREE, as the Baltimore Ravens, Detroit Lions and Tampa Bay Buccaneers face elimination.</description>
    </item>
    <item>
      <title>Here&#8217;s why visiting museums between Christmas and New Year&#8217;s makes me a better leader</title>
      <link>https://www.fastcompany.com/91461312/heres-why-taking-time-off-made-me-a-better-leader</link>
      <pubDate>2025-12-25T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91461312/heres-why-taking-time-off-made-me-a-better-leader</guid>
      <description>Stepping away from startup chaos during the holidays unlocked clarity, sharper strategy, and bolder decisions.
My working days often unfold in either Zoom minimalist workplaces or glass-walled conference rooms with sleek windows, filled with entrepreneurs pitching ideas. As a marketing executive and startup mentor, I lead strategies for companies of various sizes, guide founders at startup accelerators TechStars and Founder Institute, and serve as an awards jury member. My calendar overflows with executive consultations, brand campaign planning, and deadline sprints....</description>
    </item>
    <item>
      <title>Une enveloppe g&#233;n&#233;reuse &#224; un mini prix : ce forfait 5G propose 150 Go &#224; moins de 10 &#8364;/mois</title>
      <link>https://www.frandroid.com/bons-plans/2919449_une-enveloppe-genereuse-a-un-mini-prix-ce-forfait-5g-propose-160-go-a-moins-de-9-e-mois</link>
      <pubDate>Thu, 25 Dec 2025 06:46:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2919449_une-enveloppe-genereuse-a-un-mini-prix-ce-forfait-5g-propose-160-go-a-moins-de-9-e-mois</guid>
      <description>
Si vous &#234;tes un gros consommateur de donn&#233;es 5G, mais que votre budget n'est pas extensible, surtout en cette fin d'ann&#233;e 2025, le forfait mobile actuellement propos&#233; par Auchan T&#233;l&#233;com pourrait bien vous convenir. Chez ce MVNO, les 150 Go de 5G co&#251;tent seulement 9,99 euros par mois.
</description>
    </item>
  </channel>
</rss>
