<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 28 Jan 2026 10:34:26 GMT</lastBuildDate>
    <item>
      <title>Windows 11&#160;: Microsoft pourrait bien &#234;tre oblig&#233; de revoir son nouveau menu D&#233;marrer</title>
      <link>https://www.01net.com/actualites/windows-11-microsoft-pourrait-bien-etre-oblige-de-revoir-son-nouveau-menu-demarrer.html</link>
      <pubDate>Wed, 28 Jan 2026 10:33:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322919</guid>
      <description>Le nouveau menu D&#233;marrer de Windows 11 ne fait pas l&#8217;unanimit&#233;. Interpell&#233; par les utilisateurs quant &#224; l&#8217;impossibilit&#233; d&#8217;organiser manuellement les cat&#233;gories, Microsoft indique &#234;tre &#224; l&#8217;&#233;coute des critiques.</description>
    </item>
    <item>
      <title>Ted Lasso season 4 gets big release-window update from Apple &#8212; and we don't have long to wait until we can believe in the hit Apple TV show again</title>
      <link>https://www.techradar.com/streaming/apple-tv-plus/ted-lasso-season-4-gets-big-release-window-update-from-apple-and-we-dont-have-long-to-wait-until-we-can-believe-in-the-hit-apple-tv-show-again</link>
      <pubDate>Wed, 28 Jan 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">cSR9YTmhJWzm69Fm6zN7qR</guid>
      <description>Apple has tentatively confirmed when Ted Lasso season 4 will be released &#8212; and revealed a first look at his new assistant coach.</description>
    </item>
    <item>
      <title>Les meilleures offres tombent pour la derni&#232;re d&#233;marque des soldes d&#8217;hiver : voici le TOP 25</title>
      <link>https://www.frandroid.com/bons-plans/2957561_les-meilleures-offres-tombent-pour-la-derniere-demarque-des-soldes-dhiver-voici-le-top-25</link>
      <pubDate>Wed, 28 Jan 2026 10:29:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2957561_les-meilleures-offres-tombent-pour-la-derniere-demarque-des-soldes-dhiver-voici-le-top-25</guid>
      <description>
Il ne faut pas se le cacher, la derni&#232;re d&#233;marque des soldes est souvent le moment o&#249; l'on trouve les meilleures offres, car les e-commer&#231;ants comme Amazon, Fnac, Darty ou encore Boulanger veulent &#233;couler les derniers stocks. Avec cet article, vous serez s&#251;rs de ne manquer aucun deal Tech int&#233;ressant. 
</description>
    </item>
    <item>
      <title>Voici le plan de Lucid pour concurrencer le Tesla Model Y, le Rivian R2&#8230; et sauver sa peau</title>
      <link>https://www.frandroid.com/marques/2957855_voici-le-plan-de-lucid-pour-concurrencer-le-tesla-model-y-le-rivian-r2-et-sauver-sa-peau</link>
      <pubDate>Wed, 28 Jan 2026 10:26:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2957855_voici-le-plan-de-lucid-pour-concurrencer-le-tesla-model-y-le-rivian-r2-et-sauver-sa-peau</guid>
      <description>
Lucid fabrique parmi les meilleures voitures &#233;lectriques du monde, mais perd une fortune sur chaque exemplaire vendu. Le salut passera par un SUV compact &#224; 50 000 euros capable de tenir t&#234;te &#224; Tesla.
</description>
    </item>
    <item>
      <title>Tout un symbole : en 2025, la Xiaomi SU7 a d&#233;tr&#244;n&#233; la Tesla Model 3 en Chine</title>
      <link>https://www.frandroid.com/marques/xiaomi/2957589_tout-un-symbole-en-2025-la-xiaomi-su7-a-detrone-la-tesla-model-3-en-chine</link>
      <pubDate>Wed, 28 Jan 2026 10:25:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2957589_tout-un-symbole-en-2025-la-xiaomi-su7-a-detrone-la-tesla-model-3-en-chine</guid>
      <description>
Avec plus de 258 000 exemplaires vendus en 2025, la Xiaomi SU7 a battu la Tesla Model 3 en Chine. La voiture &#233;lectrique asiatique confirme son leadership sur son march&#233; natal, alors que la firme d&#8217;Elon Musk voit ses immatriculations chuter.
</description>
    </item>
    <item>
      <title>&#171;&#160;Linux est notre prochaine grande fronti&#232;re&#160;&#187; : GOG pr&#233;pare enfin une nouvelle version de son application</title>
      <link>https://www.frandroid.com/produits-android/console/2957741_linux-est-notre-prochaine-grande-frontiere-gog-prepare-enfin-une-nouvelle-version-de-son-application</link>
      <pubDate>Wed, 28 Jan 2026 10:20:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2957741_linux-est-notre-prochaine-grande-frontiere-gog-prepare-enfin-une-nouvelle-version-de-son-application</guid>
      <description>
La plateforme de jeu r&#233;tro et ind&#233;pendante GOG va elle aussi miser sur Linux en 2026 alors qu'une version native est visiblement en projet.
</description>
    </item>
    <item>
      <title>How to monetize your brand with print-on-demand</title>
      <link>https://www.techradar.com/pro/software-services/how-to-monetize-your-brand-with-print-on-demand</link>
      <pubDate>Wed, 28 Jan 2026 10:15:18 +0000</pubDate>
      <guid isPermaLink="false">RMUxiEWFAPDvmBbhC2BVKD</guid>
      <description>Print-on-demand services let you sell custom merchandise without inventory costs. Here's how to set it up with integrated website builder features.</description>
    </item>
    <item>
      <title>Boulanger met le paquet pour la derni&#232;re d&#233;marque des soldes avec de belles promotions</title>
      <link>https://www.frandroid.com/bons-plans/2931541_boulanger-met-le-paquet-pour-la-derniere-demarque-des-soldes-avec-de-belles-promotions</link>
      <pubDate>Wed, 28 Jan 2026 10:14:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931541_boulanger-met-le-paquet-pour-la-derniere-demarque-des-soldes-avec-de-belles-promotions</guid>
      <description>
Les soldes d'hiver touchent bient&#244;t &#224; leur fin ! Pour la derni&#232;re d&#233;marque, Boulanger ne l&#233;sine pas sur les offres : enceinte bluetooth, &#233;cran gaming g&#233;ant de 40", nouveau Redmi Note 15 en promo... Il y a de quoi se faire plaisir, mais plus pour longtemps. 
</description>
    </item>
    <item>
      <title>Oops &#8212; Walmart may just have leaked a couple of banger GameCube games for Nintendo Switch Online</title>
      <link>https://www.techradar.com/gaming/oops-walmart-may-just-have-leaked-a-couple-of-banger-gamecube-games-for-nintendo-switch-online</link>
      <pubDate>Wed, 28 Jan 2026 10:14:30 +0000</pubDate>
      <guid isPermaLink="false">pjtnLmXwhcjnq5rPvt8g8o</guid>
      <description>Two upcoming GameCube titles for Nintendo Switch Online may just have leaked courtesy of Walmart &#8212; and they're among the console's very best.</description>
    </item>
    <item>
      <title>HBO Max en f&#233;vrier 2026 : l&#8217;hiver va &#234;tre chaud avec ce catalogue ! Voici les films et s&#233;ries &#224; ne pas manquer</title>
      <link>https://www.frandroid.com/services/svod/2957555_hbo-max-en-fevrier-2026-lhiver-va-etre-chaud-avec-ce-catalogue-voici-les-films-et-series-a-ne-pas-manquer</link>
      <pubDate>Wed, 28 Jan 2026 10:11:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2957555_hbo-max-en-fevrier-2026-lhiver-va-etre-chaud-avec-ce-catalogue-voici-les-films-et-series-a-ne-pas-manquer</guid>
      <description>
HBO Max vient de d&#233;voiler son catalogue de f&#233;vrier et &#231;a ne manque pas de piquant entre la s&#233;rie-&#233;v&#233;nement Heated Rivalry et le retour de la s&#233;rie produite par Salma Hayek, Chocolat amer. Voici tout ce qu'il ne faut pas manquer ce mois-ci.
</description>
    </item>
    <item>
      <title>6 milliards d&#8217;identifiants et de mots de passe pirat&#233;s&#160;: une base massive de donn&#233;es est apparue sur le dark web</title>
      <link>https://www.01net.com/actualites/6-milliards-identifiants-mots-passe-pirates-base-massive-donnees-apparue-dark-web.html</link>
      <pubDate>Wed, 28 Jan 2026 10:11:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322910</guid>
      <description>Une gigantesque base de donn&#233;es vol&#233;es a &#233;t&#233; d&#233;couverte sur le dark web. Le r&#233;pertoire est compos&#233; de six milliards d'identifiants, dont de nombreux mots de passe recycl&#233;s par les internautes. On y trouve notamment des donn&#233;es appartenant &#224; des comptes de Fran&#231;ais, dont des comptes li&#233;s au gouvernement&#8230;</description>
    </item>
    <item>
      <title>Zotac, Gigabyte, ASRock, MSI, Palit, PNY, XFX&#8230; il va y avoir de la casse</title>
      <link>https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2957615_zotac-gigabyte-asrock-msi-palit-pny-xfx-il-va-y-avoir-de-la-casse</link>
      <pubDate>Wed, 28 Jan 2026 10:08:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2957615_zotac-gigabyte-asrock-msi-palit-pny-xfx-il-va-y-avoir-de-la-casse</guid>
      <description>
L'intelligence artificielle est en train de d&#233;vorer le monde du gaming, et pas de la mani&#232;re dont vous l'imaginez. En siphonnant toute la m&#233;moire disponible, elle laisse les fabricants comme Zotac ou MSI sur le carreau. 
</description>
    </item>
    <item>
      <title>Avec les nouveaux AirTags, votre Apple Watch devient encore plus pratique pour trouver vos objets perdus</title>
      <link>https://www.frandroid.com/marques/apple/2957575_avec-les-nouveaux-airtags-votre-apple-watch-devient-encore-plus-pratique-pour-trouver-vos-objets-perdus</link>
      <pubDate>Wed, 28 Jan 2026 10:02:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2957575_avec-les-nouveaux-airtags-votre-apple-watch-devient-encore-plus-pratique-pour-trouver-vos-objets-perdus</guid>
      <description>
Avec la sortie des nouveaux AirTags de deuxi&#232;me g&#233;n&#233;ration, les montres connect&#233;es d'Apple s'enrichissent d'une fonction bien pratique pour retrouver vos objets &#233;gar&#233;s. 
</description>
    </item>
    <item>
      <title>The best robot vacuums on a budget for 2026</title>
      <link>https://www.engadget.com/home/smart-home/best-budget-robot-vacuums-133030847.html?src=rss</link>
      <pubDate>Wed, 28 Jan 2026 10:01:28 +0000</pubDate>
      <guid isPermaLink="false">2efe7003-0f06-49dd-bf75-650fb81c222c</guid>
      <description>If vacuuming is your least favorite chore, employing a robot vacuum can save you time and stress while also making sure your home stays clean. While once most robo-vacs landed on the higher end of the price spectrum, that&#8217;s not the case anymore. Sure, you could pick up a $1,000 cleaning behemoth with mopping features, but it would be incorrect to assume that you need to spend that much money to get a good machine.Now, you can get an autonomous dirt-sucker with serious cleaning chops for $500 &#8212; sometimes even $300 or less. But you get what you pay for in this space; don&#8217;t expect affordable robo...</description>
    </item>
    <item>
      <title>The UK government gets it spectacularly wrong on AI &#8211; just 3% of the public agree with its stance on copyright law changes</title>
      <link>https://www.techradar.com/ai-platforms-assistants/the-uk-government-gets-it-spectacularly-wrong-on-ai-just-3-percent-of-the-public-agree-with-its-stance-on-copyright-law-changes</link>
      <pubDate>Wed, 28 Jan 2026 10:00:47 +0000</pubDate>
      <guid isPermaLink="false">tm6JyQNvVE6ij8sDxBrK5V</guid>
      <description>A major public consultation revealed overwhelming opposition to the UK government's AI copyright proposal</description>
    </item>
    <item>
      <title>WhatsApp : une fonction de s&#233;curit&#233; ultra renforc&#233;e est maintenant disponible</title>
      <link>https://www.frandroid.com/marques/meta/2957551_whatsapp-une-fonction-de-securite-ultra-renforcee-est-maintenant-disponible</link>
      <pubDate>Wed, 28 Jan 2026 09:59:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2957551_whatsapp-une-fonction-de-securite-ultra-renforcee-est-maintenant-disponible</guid>
      <description>
Une fonction de s&#233;curit&#233; renforc&#233;e pour les &#233;changes WhatsApp arrive cette semaine sur le service. Plus restrictive, mais aussi plus protectrice de vos donn&#233;es, cette derni&#232;re est principalement destin&#233;e aux personnalit&#233;s publique. N'importe qui peut n&#233;anmoins l'activer.
</description>
    </item>
    <item>
      <title>Facebook et Instagram testent un tout nouvel abonnement payant</title>
      <link>https://www.frandroid.com/marques/meta/2957529_facebook-et-instagram-testent-un-tout-nouvel-abonnement-payant</link>
      <pubDate>Wed, 28 Jan 2026 09:55:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2957529_facebook-et-instagram-testent-un-tout-nouvel-abonnement-payant</guid>
      <description>
Les &#233;quipes de Meta testent actuellement (en 2026) une formule payante permettant de se passer de publicit&#233;s sur leurs r&#233;seaux sociaux, tout en donnant acc&#232;s &#224; de nouvelles fonctionnalit&#233;s comme des agents d&#8217;intelligence artificielle.
</description>
    </item>
    <item>
      <title>Nissan d&#233;voile une &#233;tonnante voiture &#233;lectrique solaire : pourquoi on a de s&#233;rieux doutes</title>
      <link>https://www.frandroid.com/marques/nissan/2957471_nissan-devoile-une-etonnante-voiture-electrique-solaire-pourquoi-on-a-de-serieux-doutes</link>
      <pubDate>Wed, 28 Jan 2026 09:53:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nissan/2957471_nissan-devoile-une-etonnante-voiture-electrique-solaire-pourquoi-on-a-de-serieux-doutes</guid>
      <description>
Le constructeur japonais Nissan vient de lever le voile sur un in&#233;dit concept de voiture &#233;lectrique dot&#233;e d&#8217;un toit solaire. De quoi r&#233;cup&#233;rer jusqu&#8217;&#224; 23 kilom&#232;tres d&#8217;&#233;nergie par jour en conditions id&#233;ales... mais &#224; quel prix ?
</description>
    </item>
    <item>
      <title>Le Nothing Phone (4a) Pro aurait 50% d&#8217;autonomie en plus, selon l&#8217;Union Europ&#233;enne</title>
      <link>https://www.frandroid.com/marques/nothing/2957505_le-nothing-phone-4a-pro-aurait-50-dautonomie-en-plus-selon-lunion-europeenne</link>
      <pubDate>Wed, 28 Jan 2026 09:50:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nothing/2957505_le-nothing-phone-4a-pro-aurait-50-dautonomie-en-plus-selon-lunion-europeenne</guid>
      <description>
Les Phone (4a) et (4a) Pro de Nothing ont &#233;t&#233; rep&#233;r&#233;s dans le Registre europ&#233;en des produits pour l'&#233;tiquetage &#233;nerg&#233;tique (EPREL). Des am&#233;liorations sont &#224; attendre du c&#244;t&#233; de la batterie et la robustesse.
</description>
    </item>
    <item>
      <title>Payer pour incliner son si&#232;ge&#160;? Face au toll&#233;, cette compagnie a&#233;rienne fait machine arri&#232;re</title>
      <link>https://www.01net.com/actualites/payer-pour-incliner-siege-face-tolle-compagnie-aerienne-fait-machine-arriere.html</link>
      <pubDate>Wed, 28 Jan 2026 09:45:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322913</guid>
      <description>Face &#224; la fronde massive des voyageurs sur les r&#233;seaux sociaux, la compagnie low cost WestJet renonce finalement &#224; ses si&#232;ges non inclinables.</description>
    </item>
    <item>
      <title>Fnac et Darty multiplient les bonnes affaires avec ces derni&#232;res offres &#224; saisir avant la fin des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-multiplient-les-bonnes-affaires-avec-ces-dernieres-offres-a-saisir-avant-la-fin-des-soldes</link>
      <pubDate>Wed, 28 Jan 2026 09:37:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-multiplient-les-bonnes-affaires-avec-ces-dernieres-offres-a-saisir-avant-la-fin-des-soldes</guid>
      <description>
C'est l'heure de la derni&#232;re d&#233;marque ! Il reste encore quelques jours pour profiter des soldes d'hiver, et les enseignes Fnac et Darty n'ont pas dit leur dernier mot. On trouve tout un tas d'offres Tech int&#233;ressantes sur les 2 sites : voici celles qui ont retenu notre attention. 
</description>
    </item>
    <item>
      <title>L&#8217;IA rafle tout : ce g&#233;ant de la m&#233;moire a d&#233;j&#224; vendu toute sa production pour 2026</title>
      <link>https://www.frandroid.com/produits-android/hardware/memoire/2957545_lia-rafle-tout-ce-geant-de-la-memoire-a-deja-vendu-toute-sa-production-pour-2026</link>
      <pubDate>Wed, 28 Jan 2026 09:32:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/memoire/2957545_lia-rafle-tout-ce-geant-de-la-memoire-a-deja-vendu-toute-sa-production-pour-2026</guid>
      <description>
SK Hynix, l'un des principaux fournisseurs de m&#233;moire du monde, d&#233;voile des r&#233;sultats records pour l'ann&#233;e 2025. Et au vu de la situation actuelle du march&#233;, cela ne fait que commencer. 
</description>
    </item>
    <item>
      <title>Grado's S750 open-back wired headphones offer crystal clarity and a wide soundstage, but the fit isn't a hit</title>
      <link>https://www.techradar.com/audio/headphones/grado-signature/s750/review</link>
      <pubDate>Wed, 28 Jan 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">Yjpst956BfUpQPwCJ2z5MF</guid>
      <description>Grado's new B cushion brings you closer to the music for a superb soundtrack</description>
    </item>
    <item>
      <title>How K-12 schools are left on their&#160;own to develop AI policies</title>
      <link>https://www.fastcompany.com/91479517/k-12-schools-are-left-on-their-own-to-develop-ai-policies</link>
      <pubDate>2026-01-28T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91479517/k-12-schools-are-left-on-their-own-to-develop-ai-policies</guid>
      <description>Education policymakers have raised ethical concerns about AI, including student safety, data privacy, and negative impacts on student learning.
Generative artificial intelligence technology is rapidly reshaping education in unprecedented ways. With its potential benefits and risks, K-12 schools are actively trying to adapt teaching and learning.</description>
    </item>
    <item>
      <title>Google just leaked a first look at Android for PC in action</title>
      <link>https://www.theverge.com/news/869142/google-leak-aluminium-os-android-pc-bug-report-video</link>
      <pubDate>2026-01-28T04:26:01-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=869142</guid>
      <description>We've been waiting months for our first look at Android running on a PC in Google's upcoming ChromeOS / Android hybrid platform, codenamed Aluminium OS. Now we've seen it in action, and have Google to thank for the leak. 9to5Google spotted a bug report related to Chrome Incognito tabs published to the Google Issue Tracker [&#8230;]</description>
    </item>
    <item>
      <title>On monte un PC en partant de z&#233;ro : ce soir, Unlock Talk met les mains dans le cambouis !</title>
      <link>https://www.frandroid.com/humanoid/emissions/2957583_on-monte-un-pc-en-partant-de-zero-ce-soir-unlock-talk-met-les-mains-dans-le-cambouis</link>
      <pubDate>Wed, 28 Jan 2026 09:20:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/emissions/2957583_on-monte-un-pc-en-partant-de-zero-ce-soir-unlock-talk-met-les-mains-dans-le-cambouis</guid>
      <description>
La 41e d&#8217;Unlock Talk aura lieu ce mercredi 28 janvier 2026, &#224; 17h, sur notre cha&#238;ne Twitch Frandroidlive. Au menu du jour : de l&#8217;actualit&#233; bien &#233;videmment, mais aussi et surtout un montage PC from scratch, avec deux experts en la mati&#232;re.
</description>
    </item>
    <item>
      <title>Municipales 2026&#160;: pourquoi des candidates d&#233;clarent la guerre &#224; Meta</title>
      <link>https://www.01net.com/actualites/municipales-2026-pourquoi-des-candidates-declarent-la-guerre-a-meta.html</link>
      <pubDate>Wed, 28 Jan 2026 09:11:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322688</guid>
      <description>Une centaine d'&#233;lues montent au cr&#233;neau contre la m&#233;canique de diffusion de Facebook et Instagram. Elles d&#233;noncent une &#171; bulle masculine &#187; qui risque de transformer leur campagne politique en site de rencontres, mena&#231;ant le pluralisme du d&#233;bat.</description>
    </item>
    <item>
      <title>It's not Dante's Inferno 2, but this upcoming indie game takes inspiration from the same classic poem and could be the sequel to Visceral's 2010 game I've been hoping for all these years</title>
      <link>https://www.techradar.com/gaming/the-alighieri-circle-dantes-bloodline-reveal-news</link>
      <pubDate>Wed, 28 Jan 2026 09:08:34 +0000</pubDate>
      <guid isPermaLink="false">452DQRt2D9feWWJWHp94mG</guid>
      <description>Upcoming indie game The Alighieri Circle Dante's Bloodline looks like an intriguing psychological thriller, and taking its inspiration from the classic poem, The Divine Comedy, has its hooks in me already.</description>
    </item>
    <item>
      <title>How to watch Champions League Gameweek 8: Free Streams &amp; TV Channels</title>
      <link>https://www.techradar.com/how-to-watch/football/champions-league-gameweek-8-free</link>
      <pubDate>Wed, 28 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">wmsjMUwBxhxDSrtAaTexj3</guid>
      <description>All the ways to watch Champions League 2025/26 Matchday 8 live streams online and from anywhere, as the league phase reaches its fascinating conclusion.</description>
    </item>
    <item>
      <title>The rise of weather influencers</title>
      <link>https://www.fastcompany.com/91482080/the-rise-of-weather-influencers</link>
      <pubDate>2026-01-28T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91482080/the-rise-of-weather-influencers</guid>
      <description>As TV news viewership declines, people still need to get their weather report somewhere. And they&#8217;re turning to social media.
&#8220;Snow Will Fall Too Fast for Plows,&#8221; &#8220;ICE STORM APOCALYPSE,&#8221; and &#8220;Another Big Storm May Be Coming &#8230;&#8221; were all headlines posted on YouTube this past weekend as the biggest snowstorm in years hit New York City.&#160;</description>
    </item>
    <item>
      <title>Google Wallet&#160;: d&#233;couvrez la nouvelle interface pour acc&#233;der plus vite &#224; vos cartes</title>
      <link>https://www.01net.com/actualites/google-wallet-decouvrez-nouvelle-interface-acceder-plus-vite-cartes.html</link>
      <pubDate>Wed, 28 Jan 2026 08:41:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322887</guid>
      <description>Google pr&#233;pare une refonte visuelle majeure de son application Wallet afin de simplifier l'acc&#232;s aux cartes que vous utilisez le plus souvent.</description>
    </item>
  </channel>
</rss>
