<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 13 Nov 2025 11:31:24 GMT</lastBuildDate>
    <item>
      <title>Le Steam Frame enterre ce casque VR, Valve arr&#234;te les casques filaires</title>
      <link>https://www.frandroid.com/marques/valve/2867623_le-steam-frame-enterre-ce-casque-vr-valve-arrete-les-casques-filaires</link>
      <pubDate>Thu, 13 Nov 2025 11:28:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/valve/2867623_le-steam-frame-enterre-ce-casque-vr-valve-arrete-les-casques-filaires</guid>
      <description>
C'est officiel, Valve arr&#234;te de produire son casque VR Valve Index. L'information a &#233;t&#233; confirm&#233;e &#224; The Verge par le concepteur Lawrence Yang. 
</description>
    </item>
    <item>
      <title>New legislation looks to toughen UK cyberdefences and critical infrastructure</title>
      <link>https://www.techradar.com/pro/security/new-legislation-looks-to-toughen-uk-cyberdefences-and-critical-infrastructure</link>
      <pubDate>Thu, 13 Nov 2025 11:28:00 +0000</pubDate>
      <guid isPermaLink="false">cUKN3Fgjf2FZkc8JjdTPec</guid>
      <description>Critical services like water, energy, and healthcare will get special protections under new security bill.</description>
    </item>
    <item>
      <title>Ce r&#233;cent vid&#233;oprojecteur compact Full HD est d&#233;j&#224; &#224; -44 % pour le pr&#233;-Black Friday chez Boulanger</title>
      <link>https://www.frandroid.com/bons-plans/2867083_ce-recent-videoprojecteur-compact-full-hd-est-deja-a-44-pour-le-pre-black-friday-chez-boulanger</link>
      <pubDate>Thu, 13 Nov 2025 11:26:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2867083_ce-recent-videoprojecteur-compact-full-hd-est-deja-a-44-pour-le-pre-black-friday-chez-boulanger</guid>
      <description>
Le Philips NeoPix 950 Smart a d&#233;barqu&#233; tout r&#233;cemment sur le march&#233; des vid&#233;oprojecteurs compacts que l'on peut d&#233;placer facilement d'une pi&#232;ce &#224; l'autre. Lumineux et capable de projeter des images jusqu'&#224; 150 pouces de diagonale, ce cin&#233;ma de poche est propos&#233; &#224; 499 euros au lieu de 899 euros chez Boulanger pendant le pr&#233;-Black Friday. 
</description>
    </item>
    <item>
      <title>Les meilleures box internet en 5G : voici notre comparatif des forfaits chez Free, SFR, Orange et Bouygues T&#233;l&#233;com</title>
      <link>https://www.frandroid.com/services/2438090_box-5g-a-la-maison-voici-notre-comparatif-des-meilleures-alternatives-aux-offres-triple-play</link>
      <pubDate>Thu, 13 Nov 2025 11:25:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/2438090_box-5g-a-la-maison-voici-notre-comparatif-des-meilleures-alternatives-aux-offres-triple-play</guid>
      <description>
On peut avoir une mauvaise connexion fibre chez soi, et m&#234;me pas du tout, mais un bon r&#233;seau mobile. C'est un des cas de figure o&#249; les box internet en 4G ou en 5G sont une bonne alternative. Voici notre comparatif des meilleures box internet en 5G.
</description>
    </item>
    <item>
      <title>Black Friday 2025 : les promotions sont d&#233;j&#224; tr&#232;s fortes sur Amazon &amp; Co, voici les meilleures offres en DIRECT</title>
      <link>https://www.frandroid.com/bons-plans/2864479_black-friday-2025-meilleures-offres-en-direct-amazon</link>
      <pubDate>Thu, 13 Nov 2025 11:16:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2864479_black-friday-2025-meilleures-offres-en-direct-amazon</guid>
      <description>
Avant le coup d'envoi officiel du vendredi noir &#224; la fin du mois, les offres se multiplient et deviennent de plus en plus int&#233;ressantes. D'un c&#244;t&#233;, il y a le pr&#233;-Black Friday chez la majorit&#233; des e-commer&#231;ants fran&#231;ais comme Boulanger, Fnac Darty, Amazon et Cdiscount, et de l'autre c&#244;t&#233;, il y a aussi le Singles Day, ou 11.11, chez AliExpress et consorts. Vous retrouverez les meilleures offres des deux &#233;v&#233;nements dans cet article. 
...</description>
    </item>
    <item>
      <title>Nintendo has announced its Black Friday discounts, including $0 off the Switch 2</title>
      <link>https://www.techradar.com/gaming/nintendo/nintendo-has-announced-its-black-friday-discounts-including-usd0-off-the-switch-2</link>
      <pubDate>Thu, 13 Nov 2025 11:14:26 +0000</pubDate>
      <guid isPermaLink="false">cozk32oLePDRmJSC2ja8yR</guid>
      <description>Nintendo has revealed its Black Friday discounts for 2025.</description>
    </item>
    <item>
      <title>The Samsung Galaxy Z TriFold could have a massive battery and launch on December 5</title>
      <link>https://www.techradar.com/phones/samsung-galaxy-phones/the-samsung-galaxy-z-trifold-could-have-a-massive-battery-and-launch-on-december-5</link>
      <pubDate>Thu, 13 Nov 2025 11:08:25 +0000</pubDate>
      <guid isPermaLink="false">6joCBFvspYRqVuP5tzpxWS</guid>
      <description>The Samsung Galaxy Z TriFold's possible specs, name, release date, and price have all now leaked.</description>
    </item>
    <item>
      <title>The Devil Wears Prada 2 teaser trailer is absolute perfection, but why is nobody talking about the most obvious real-life link?</title>
      <link>https://www.techradar.com/streaming/entertainment/the-devil-wears-prada-2-teaser-trailer-is-absolute-perfection-but-why-is-nobody-talking-about-the-most-obvious-real-life-link</link>
      <pubDate>Thu, 13 Nov 2025 11:06:33 +0000</pubDate>
      <guid isPermaLink="false">beYvHW9kJPw6LiHjTbDNAU</guid>
      <description>The first teaser trailer for The Devil Wears Prada 2 has landed, and we need to talk about the details.</description>
    </item>
    <item>
      <title>Forget Blink &#8211; this award-winning security camera is half price for Black Friday, and it's subscription-free</title>
      <link>https://www.techradar.com/seasonal-sales/forget-blink-this-award-winning-security-camera-is-half-price-for-black-friday-and-its-subscription-free</link>
      <pubDate>Thu, 13 Nov 2025 11:05:20 +0000</pubDate>
      <guid isPermaLink="false">crGN4U7zWAXQC3rMmbiNhT</guid>
      <description>The Reolink Altas PT Ultra took this year's TechRadar Choice Award for best home security camera, and it's never been cheaper.</description>
    </item>
    <item>
      <title>Jackrabbit MG Doble Review: Powerful, But Not Bike Path Legal</title>
      <link>https://www.wired.com/review/jackrabbit-mg-doble/</link>
      <pubDate>Thu, 13 Nov 2025 11:02:00 +0000</pubDate>
      <guid isPermaLink="false">690e861228bcfe7aa7fe706f</guid>
      <description>Don&#8217;t let this micro vehicle&#8217;s mini fa&#231;ade fool you. It&#8217;s powerful.</description>
    </item>
    <item>
      <title>Adam Grant on lessons from the pandemic, datum versus data, and how abstract numbers can lead to very real human outcomes</title>
      <link>https://www.fastcompany.com/91439562/adam-grant-on-lessons-from-the-pandemic-datum-versus-data-and-how-abstract-numbers-can-lead-to-very-real-human-outcomes-data-interpretation-adam-grant-management-advice</link>
      <pubDate>2025-11-13T11:02:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91439562/adam-grant-on-lessons-from-the-pandemic-datum-versus-data-and-how-abstract-numbers-can-lead-to-very-real-human-outcomes-data-interpretation-adam-grant-management-advice</guid>
      <description>In this excerpt from the new book &#8216;Speak Data,&#8217; the Wharton professor and best-selling author shares his thoughts on how we interpret and communicate information
Data is an omnipresent facet of modern existence, yet the current discourse around it is often too technical, academic, and inaccessible to the average person. Speak Data, the book I&#8217;ve just published with my coauthor Phillip Cox, emerges from more than 15 years of living and working with data, both as designers and as human beings.Instead of a textbook or how-to manual for designers, we imagined a more accessible exploration of the h...</description>
    </item>
    <item>
      <title>Black Friday has arrived early at Dyson &#8211; several top cordless vacuums just plummeted to new cheapest-ever prices</title>
      <link>https://www.techradar.com/home/vacuums/black-friday-has-arrived-early-at-dyson-several-top-cordless-vacuums-just-plummeted-to-new-cheapest-ever-prices</link>
      <pubDate>Thu, 13 Nov 2025 11:01:50 +0000</pubDate>
      <guid isPermaLink="false">kDvRXuLi6MShD9EFShFkqX</guid>
      <description>If you were hoping to snag a cheap Dyson cordless vacuum this Black Friday, you don't need to wait any longer.</description>
    </item>
    <item>
      <title>Rosamund Pike Agrees: &#8216;Wheel of Time&#8217; Season 1 Was Rough</title>
      <link>https://gizmodo.com/rosamund-pike-agrees-wheel-of-time-season-1-was-rough-2000685124</link>
      <pubDate>Thu, 13 Nov 2025 11:00:44 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000685124</guid>
      <description>The star of Prime Video's fantasy show also thinks it improved over time&#8212;and regrets that it was cancelled.</description>
    </item>
    <item>
      <title>OpenAI&#8217;s Open-Weight Models Are Coming to the US Military</title>
      <link>https://www.wired.com/story/open-ai-artificial-intelligence-open-weight-model/</link>
      <pubDate>Thu, 13 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">68894c3652442bd1b904e922</guid>
      <description>The gpt-oss models are being tested for use on sensitive military computers. But some defense insiders say that OpenAI is still behind the competition.</description>
    </item>
    <item>
      <title>Cash App debuts a new AI assistant that answers questions about your finances</title>
      <link>https://techcrunch.com/2025/11/13/cash-app-debuts-a-new-ai-assistant-that-answers-questions-about-your-finances/</link>
      <pubDate>Thu, 13 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3067455</guid>
      <description>Cash App is adding a map to its app to let users discover places that accept bitcoin</description>
    </item>
    <item>
      <title>How to cancel PIA without losing a penny</title>
      <link>https://www.techradar.com/vpn/vpn-services/how-to-cancel-pia-without-losing-a-penny</link>
      <pubDate>Thu, 13 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">jWdmaVWmdpCyrfByRgvVPD</guid>
      <description>Want to get your money back from PIA? It's nice and easy.</description>
    </item>
    <item>
      <title>How goal-stacking got me out of a motivation rut</title>
      <link>https://www.fastcompany.com/91428346/how-goal-stacking-got-me-out-of-a-motivation-rut</link>
      <pubDate>2025-11-13T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91428346/how-goal-stacking-got-me-out-of-a-motivation-rut</guid>
      <description>Pursuing a low-stakes (but scary) goal gave me the courage and energy to start taking action on goals that have higher stakes. 
Motivation comes and go, but consistency is what will get you the results. That&#8217;s a principle I&#8217;ve tried to live by for as long as I can remember. For the most part, it has served me pretty well. But as I&#8217;ve gotten older, I&#8217;ve learned that being consistent while being unmotivated can be energy draining. And when mental and physical energy is lacking, it can be difficult to be consistent....</description>
    </item>
    <item>
      <title>The delegation trap every senior leader faces</title>
      <link>https://www.fastcompany.com/91434818/the-delegation-trap-every-senior-leader-faces</link>
      <pubDate>2025-11-13T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91434818/the-delegation-trap-every-senior-leader-faces</guid>
      <description>Why stepping back too far can be just as risky as micromanaging.
Delegation is supposed to get easier the higher you rise. In reality, it becomes challenging in a different way,</description>
    </item>
    <item>
      <title>How the over-65 crowd is propping up colleges right now</title>
      <link>https://www.fastcompany.com/91436983/how-the-over-65-crowd-is-propping-up-colleges-right-now</link>
      <pubDate>2025-11-13T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91436983/how-the-over-65-crowd-is-propping-up-colleges-right-now</guid>
      <description>Older Americans may be the answer to financially challenged colleges, as developers adapt campuses into senior living facilities.
College across the country may soon start seeing a much older demographic roaming their campuses.</description>
    </item>
    <item>
      <title>Creators are suffering from a mental health crisis, new study shows</title>
      <link>https://www.fastcompany.com/91440198/tiktok-mental-health-suicide-influencer</link>
      <pubDate>2025-11-13T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91440198/tiktok-mental-health-suicide-influencer</guid>
      <description>One in ten creators in North America reported having suicidal thoughts tied to their work, a rate that&#8217;s nearly double the national average.
From the outside looking in, the life of a content creator is enviable. Shopping, jet-setting, star-studded events, all documented for their audience of thousands. But new research tells a different story.&#160;</description>
    </item>
    <item>
      <title>Jack Schlossberg is branding a next-gen Kennedy campaign</title>
      <link>https://www.fastcompany.com/91440275/jack-schlossberg-is-branding-a-next-gen-kennedy-campaign</link>
      <pubDate>2025-11-13T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91440275/jack-schlossberg-is-branding-a-next-gen-kennedy-campaign</guid>
      <description>&#8216;Let&#8217;s Back Jack,&#8217; reinvented for 2026. 
Jack Schlossberg announced he&#8217;s running for Congress. And instead of using his last name in his campaign logo, the 32-year-old&#8212;born John Bouvier Kennedy Schlossberg&#8212;is using the nickname he shares with his famous grandfather, John F. Kennedy.</description>
    </item>
    <item>
      <title>Black Friday Sony headphones deal klaxon! WH-1000XM5 noise-cancelling over-ears now 47% off at Amazon</title>
      <link>https://www.techradar.com/audio/wireless-headphones/black-friday-sony-headphones-deal-klaxon-wh-1000xm5-noise-cancelling-over-ears-now-47-percent-off-at-amazon</link>
      <pubDate>Thu, 13 Nov 2025 10:58:10 +0000</pubDate>
      <guid isPermaLink="false">EtgTceiRtaa8KvBjfCP3QX</guid>
      <description>Don't miss Amazon's deal on the Sony WH-1000XM5 today &#8211; they're back down to a sub-&#163;200 price-tag!</description>
    </item>
    <item>
      <title>Cdiscount d&#233;gaine de belles offres pour le pr&#233;-Black Friday : voici les 12 deals &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2850059_cdiscount-degaine-de-belles-offres-pour-le-pre-black-friday-voici-les-12-deals-a-retenir</link>
      <pubDate>Thu, 13 Nov 2025 10:57:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850059_cdiscount-degaine-de-belles-offres-pour-le-pre-black-friday-voici-les-12-deals-a-retenir</guid>
      <description>
Cdiscount a lanc&#233; son pr&#233;-Black Friday, il y a d&#233;j&#224; une semaine, et de nouvelles offres continuent de voir le jour avec des prix particuli&#232;rement attractifs. Il y a des r&#233;ductions sur une large s&#233;lection de produits tech, allant des smartphones aux TV en passant par les consoles de jeux. D&#233;couvrez les offres les plus int&#233;ressantes du moment.
</description>
    </item>
    <item>
      <title>Galaxy Z Flip 8&#160;: Samsung passerait enfin &#224; la vitesse sup&#233;rieure</title>
      <link>https://www.01net.com/actualites/galaxy-z-flip-8-samsung-passerait-enfin-vitesse-superieure.html</link>
      <pubDate>Thu, 13 Nov 2025 10:57:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1307676</guid>
      <description>Samsung pr&#233;pare visiblement un vrai tournant pour son Galaxy Z Flip 8, notamment gr&#226;ce &#224; un design nettement plus fin et plus l&#233;ger.</description>
    </item>
    <item>
      <title>Adieu le passeport physique &#224; l&#8217;a&#233;roport ? Les am&#233;ricains vont parfois pouvoir le remplacer par leur iPhone</title>
      <link>https://www.frandroid.com/marques/apple/2867075_adieu-le-passeport-physique-a-laeroport-les-americains-vont-parfois-pouvoir-le-remplacer-par-leur-iphone</link>
      <pubDate>Thu, 13 Nov 2025 10:55:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2867075_adieu-le-passeport-physique-a-laeroport-les-americains-vont-parfois-pouvoir-le-remplacer-par-leur-iphone</guid>
      <description>
Apple vient d'annoncer le lancement aux &#201;tats-Unis de son service Digital ID, avec la prise en charge d'un document majeur &#224; la cl&#233; : le passeport des utilisateurs am&#233;ricains. Ce dernier peut donc d&#233;sormais s'int&#233;grer directement &#224; l'application Apple Cartes.
</description>
    </item>
    <item>
      <title>La Tesla Model Y s&#8217;appr&#234;te &#224; battre un record d&#8217;autonomie gr&#226;ce &#224; cette nouvelle batterie</title>
      <link>https://www.frandroid.com/marques/tesla/2867337_la-tesla-model-y-sapprete-a-battre-un-record-dautonomie-grace-a-cette-nouvelle-batterie</link>
      <pubDate>Thu, 13 Nov 2025 10:51:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2867337_la-tesla-model-y-sapprete-a-battre-un-record-dautonomie-grace-a-cette-nouvelle-batterie</guid>
      <description>
L'autonomie du Tesla Model Y Premium va bient&#244;t augmenter avec l'arriv&#233;e d'une nouvelle batterie. D&#233;j&#224; pr&#233;sente sur les versions Performance et Transmission Int&#233;grale, elle permettra &#224; la voiture &#233;lectrique de titiller les 700 km en une charge.
</description>
    </item>
    <item>
      <title>CISOs fear getting the blame for mega data breaches</title>
      <link>https://www.techradar.com/pro/security/cisos-fear-getting-the-blame-for-mega-data-breaches</link>
      <pubDate>Thu, 13 Nov 2025 10:50:37 +0000</pubDate>
      <guid isPermaLink="false">XJZuYVBKaCSkGneLzZDo59</guid>
      <description>Threats are evolving, incident costs are rising, and CISOs are struggling with their responsibilities.</description>
    </item>
    <item>
      <title>Le Black Friday roule sur les prix des v&#233;los &#233;lectriques : les meilleures offres et deals qu&#8217;on vous conseille</title>
      <link>https://www.frandroid.com/bons-plans/2860283_pre-black-friday-2025-top-deals-et-promos-velos-electriques</link>
      <pubDate>Thu, 13 Nov 2025 10:50:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860283_pre-black-friday-2025-top-deals-et-promos-velos-electriques</guid>
      <description>
Les premi&#232;res offres du Black Friday sont tomb&#233;es en avance cette ann&#233;e et sur tous les domaines. Les v&#233;los &#233;lectriques b&#233;n&#233;ficient eux aussi de promotions et c'est ce que nous vous d&#233;voilons dans notre s&#233;lection des meilleures promos sur les VAE. 
</description>
    </item>
    <item>
      <title>L&#8217;application WhatsApp peut ralentir votre PC sur Windows 11</title>
      <link>https://www.frandroid.com/marques/meta/2867257_lapplication-whatsapp-peut-ralentir-votre-pc-sur-windows-11</link>
      <pubDate>Thu, 13 Nov 2025 10:43:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2867257_lapplication-whatsapp-peut-ralentir-votre-pc-sur-windows-11</guid>
      <description>
En passant d'une application native &#224; une version Web, WhatsApp pourrait d&#233;grader l'exp&#233;rience de nombreux utilisateurs sur PC. 
</description>
    </item>
    <item>
      <title>Pourquoi la Steam Machine est bloqu&#233;e en HDMI 2.0</title>
      <link>https://www.frandroid.com/marques/valve/2867399_pourquoi-la-steam-machine-est-bloquee-en-hdmi-2-0</link>
      <pubDate>Thu, 13 Nov 2025 10:42:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/valve/2867399_pourquoi-la-steam-machine-est-bloquee-en-hdmi-2-0</guid>
      <description>
La fiche technique de la Steam Machine mentionne la pr&#233;sence d'un port HDMI 2.0. Pas de HDMI 2.1 en 2026 ?
</description>
    </item>
    <item>
      <title>Non, le budget v&#233;lo n&#8217;a pas 100 % &#233;t&#233; abandonn&#233; : 100 millions d&#8217;euros devraient m&#234;me &#234;tre attribu&#233;s selon cet amendement</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2866241_non-le-budget-velo-na-pas-100-ete-abandonne-100-millions-deuros-devraient-meme-etre-attribues-selon-cet-amendement</link>
      <pubDate>Thu, 13 Nov 2025 10:41:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2866241_non-le-budget-velo-na-pas-100-ete-abandonne-100-millions-deuros-devraient-meme-etre-attribues-selon-cet-amendement</guid>
      <description>
Selon nos recherches, le projet de loi de finance 2026 r&#233;vis&#233; devrait adopter une hausse du montant accord&#233; au plan v&#233;lo de 50 &#224; 100 millions d&#8217;euros, ce qui tout de m&#234;me loin des sommes initiales et d&#8217;un vrai plan v&#233;lo quinquennal.
</description>
    </item>
    <item>
      <title>The best early Black Friday sales live &#8211; I've hand-picked 75 deals from $8 you won't regret buying now</title>
      <link>https://www.techradar.com/live/news/best-early-black-friday-deals-you-wont-regret-buying-now</link>
      <pubDate>Thu, 13 Nov 2025 10:38:09 +0000</pubDate>
      <guid isPermaLink="false">Lvp2d5BuJ9yZgTgxbszf9J</guid>
      <description>Black Friday sales are live, and from AirPods to robot vacuums, I've compiled a list of today's 70 best early Black Friday deals that I recommend buying right now.</description>
    </item>
    <item>
      <title>Boulanger d&#233;voile une pluie de r&#233;ductions pour le Pr&#233;-Black Friday : 22 deals &#224; ne pas louper</title>
      <link>https://www.frandroid.com/bons-plans/2859523_boulanger-multiplie-deja-les-promotions-au-pre-black-friday-les-16-deals-a-retenir</link>
      <pubDate>Thu, 13 Nov 2025 10:37:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2859523_boulanger-multiplie-deja-les-promotions-au-pre-black-friday-les-16-deals-a-retenir</guid>
      <description>
Boulanger propose des offres de pr&#233;-Black Friday depuis fin octobre, avec des r&#233;ductions allant jusqu&#8217;&#224; 40&#8239;% sur un tas de produits Tech. Smartphones, TV, ordinateurs portables, produits audio... Tout y passe ! Voici celles qui m&#233;ritent votre attention.
</description>
    </item>
    <item>
      <title>The next iOS 26.2 beta has landed, bringing updates to the Games, Messages, and Measure apps</title>
      <link>https://www.techradar.com/phones/ios/the-next-ios-26-2-beta-has-landed-bringing-updates-to-the-games-messages-and-measure-apps</link>
      <pubDate>Thu, 13 Nov 2025 10:32:23 +0000</pubDate>
      <guid isPermaLink="false">KW9BpaubABEX2VDhYemP6X</guid>
      <description>The second iOS 26.2 beta has arrived with a handful of small changes, but far fewer than the first beta already added.</description>
    </item>
    <item>
      <title>What Happened to Uber&#8217;s Vision of an End to Car Ownership? A Report Has Answers</title>
      <link>https://gizmodo.com/ubers-vision-of-an-end-to-car-ownership-2000685300</link>
      <pubDate>Thu, 13 Nov 2025 10:30:08 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000685300</guid>
      <description>Uber said it would disrupt car ownership. The data say it hasn't.</description>
    </item>
    <item>
      <title>La version 512 Go du r&#233;cent Xiaomi 15T se n&#233;gocie d&#233;j&#224; avec pr&#232;s de 300 &#8364; de moins lors du Singles Day</title>
      <link>https://www.frandroid.com/bons-plans/2867029_la-version-512-go-du-recent-xiaomi-15t-se-negocie-deja-avec-pres-de-300-e-de-moins-lors-du-singles-day</link>
      <pubDate>Thu, 13 Nov 2025 10:30:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2867029_la-version-512-go-du-recent-xiaomi-15t-se-negocie-deja-avec-pres-de-300-e-de-moins-lors-du-singles-day</guid>
      <description>
Le Xiaomi 15T, tout juste lanc&#233; il y a deux mois, aligne un &#233;cran fluide, des capteurs Leica et une grosse batterie avec charge rapide. Et pour le Singles Day, il tombe &#224; 416,89 euros, dans sa version 512 Go, au lieu de 703 euros au lancement, via un code sur AliExpress.
</description>
    </item>
    <item>
      <title>Samsungs trifold phone has exactly the name you expected</title>
      <link>https://mashable.com/article/samsung-galaxy-z-trifold</link>
      <pubDate>Thu, 13 Nov 2025 10:27:20 +0000</pubDate>
      <guid isPermaLink="false">03T6HC6kkR5fAUQbvbNEZbN</guid>
      <description>Samsung's first-ever trifold phone is going to be called Samsung Galaxy Z Trifold, report claims.</description>
    </item>
    <item>
      <title>Telegram sues Australia over age verification law &#8722; here's what we know</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/telegram-sues-australia-over-age-verification-law-heres-what-we-know</link>
      <pubDate>Thu, 13 Nov 2025 10:27:15 +0000</pubDate>
      <guid isPermaLink="false">n52RS2uDq9GYWapVqaFdWX</guid>
      <description>Telegram is taking the Australian government to court over its controversial Online Safety Act, raising critical questions about digital jurisdiction and user privacy.</description>
    </item>
    <item>
      <title>Score $15 off this streaming-friendly VPN for Black Friday</title>
      <link>https://mashable.com/article/nov-13-norton-vpn-black-friday-deal</link>
      <pubDate>Thu, 13 Nov 2025 10:23:19 +0000</pubDate>
      <guid isPermaLink="false">01dNdQQCWsyuyKbpIFhWbc0</guid>
      <description>The best Black Friday VPN deal. Norton VPN is on sale for &#163;24.99 per year, saving you &#163;15 on list price.</description>
    </item>
    <item>
      <title>Pr&#233; Black Friday : le top des deals sur les TV 4K et vid&#233;oprojecteurs pour votre salon</title>
      <link>https://www.frandroid.com/bons-plans/2848951_le-black-friday-commence-en-avance-avec-cette-selection-des-meilleures-offres-de-tv-en-promotion</link>
      <pubDate>Thu, 13 Nov 2025 10:22:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848951_le-black-friday-commence-en-avance-avec-cette-selection-des-meilleures-offres-de-tv-en-promotion</guid>
      <description>
Le t&#233;l&#233;viseur du salon montre des signes de fatigue ? Couleurs ternes, son gr&#233;sillant, image vieillissante ? C&#8217;est sans doute le moment de le remplacer. &#192; l&#8217;approche du Black Friday, de nombreuses TV 4K et vid&#233;oprojecteurs sont propos&#233;s &#224; prix r&#233;duit. Voici notre s&#233;lection des meilleures offres du moment pour allier qualit&#233; d&#8217;image et bon rapport qualit&#233;-prix.
...</description>
    </item>
    <item>
      <title>Prime Video asks Fallout fans to 'please stand by' for major reveal about season 2 of the hit Amazon TV show</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/prime-video-asks-fallout-fans-to-please-stand-by-for-major-reveal-about-season-2-of-the-hit-amazon-tv-show</link>
      <pubDate>Thu, 13 Nov 2025 10:20:29 +0000</pubDate>
      <guid isPermaLink="false">r2ZfdxNXs5kqG43gyanwU6</guid>
      <description>A new trailer for Fallout season 2 appears to be imminent after a new mysterious video appeared on Prime Video's YouTube channel.</description>
    </item>
    <item>
      <title>Pok&#233;mon Pokopia looks adorable. Heres everything to know.</title>
      <link>https://mashable.com/article/pokemon-pokopia-explained</link>
      <pubDate>Thu, 13 Nov 2025 10:19:12 +0000</pubDate>
      <guid isPermaLink="false">01tBWA7eogPZRzW7tEwGhHW</guid>
      <description>What can you expect from Pok&#233;mon&#8217;s first life/farming sim?</description>
    </item>
    <item>
      <title>Les meilleurs robots aspirateurs 3i seront bient&#244;t &#224; prix cass&#233;s pour le Black Friday [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/robot-aspirateur/2718805_les-meilleurs-robots-aspirateurs-3i-a-prix-casses-notre-selection-pour-le-prime-day-amazon</link>
      <pubDate>Thu, 13 Nov 2025 10:18:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/robot-aspirateur/2718805_les-meilleurs-robots-aspirateurs-3i-a-prix-casses-notre-selection-pour-le-prime-day-amazon</guid>
      <description>
Connaissez-vous 3i ? La marque montante d&#8217;aspirateurs-robots  va profiter du Black Friday pour afficher ses trois mod&#232;les phares &#224; prix r&#233;duits. 
</description>
    </item>
    <item>
      <title>Cyberattaque inqui&#233;tante en France&#160;: des donn&#233;es m&#233;dicales auraient &#233;t&#233; pirat&#233;es, 23&#8239;000 professionnels de sant&#233; paralys&#233;s</title>
      <link>https://www.01net.com/actualites/cyberattaque-inquietante-france-donnees-medicales-auraient-piratees-23-000-professionnels-sante-paralyses.html</link>
      <pubDate>Thu, 13 Nov 2025 10:11:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1307636</guid>
      <description>Weda a subi une cyberattaque. Le logiciel m&#233;dical fran&#231;ais a &#233;t&#233; suspendu par mesure de pr&#233;caution, mais des donn&#233;es sensibles pourraient avoir &#233;t&#233; compromises durant l'intrusion. Plus de 20&#8239;000 professionnels de sant&#233; sont touch&#233;s et se retrouvent incapables de fonctionner correctement.</description>
    </item>
    <item>
      <title>The Daily Show weighs in on new Epstein emails sent about Trump</title>
      <link>https://mashable.com/video/the-daily-show-trump-epstein-emails</link>
      <pubDate>Thu, 13 Nov 2025 10:10:28 +0000</pubDate>
      <guid isPermaLink="false">04PQwhrotWPeaRW3fMN72XT</guid>
      <description>"Daily Show" host Josh Johnson has reacted to Democrats releasing emails from Jeffrey Epstein's estate which refer to Donald Trump.</description>
    </item>
    <item>
      <title>Arc Raiders&#8217; biggest update since launch arrives today, adding a community event that&#8217;ll unlock a brand new map</title>
      <link>https://www.techradar.com/gaming/arc-raiders-biggest-update-since-launch-arrives-today-adding-a-community-event-thatll-unlock-a-brand-new-map</link>
      <pubDate>Thu, 13 Nov 2025 10:09:37 +0000</pubDate>
      <guid isPermaLink="false">WVGaXaYafpZSNtvAwk66Zd</guid>
      <description>Embark Studios has updated Arc Raiders with the North Line, adding new ARC enemies, and a community event that'll unlock the new map.</description>
    </item>
    <item>
      <title>This VPN is giving you 28 months of coverage for less than 7 cents a day this Black Friday &#8211; here's how to claim</title>
      <link>https://www.techradar.com/vpn/vpn-services/this-vpn-is-giving-you-28-months-of-coverage-for-less-than-7-cents-a-day-this-black-friday-heres-how-to-claim</link>
      <pubDate>Thu, 13 Nov 2025 10:06:53 +0000</pubDate>
      <guid isPermaLink="false">gaS3soDw8gnXJX77ep6EiM</guid>
      <description>Years of protection without the hefty pricetag</description>
    </item>
    <item>
      <title>Des astronomes ont observ&#233; une &#233;toile proche lib&#233;rer une &#233;ruption capable d&#8217;arracher l&#8217;atmosph&#232;re d&#8217;une plan&#232;te enti&#232;re !</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-astronomes-ont-observe-etoile-proche-liberer-eruption-capable-arracher-atmosphere-planete-entiere-127434/#xtor%3DRSS-8</link>
      <pubDate>Thu, 13 Nov 2025 11:05:57 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-astronomes-ont-observe-etoile-proche-liberer-eruption-capable-arracher-atmosphere-planete-entiere-127434/#xtor%3DRSS-8</guid>
      <description>Les astrophysiciens pensaient depuis longtemps que bien des &#233;toiles pouvaient produire ce que dans le cas du Soleil nous appelons &#171; des &#233;jections de masse&#160;coronale&#160;&#187;. Ils viennent enfin d'en observer une ! Elle&#160;se d&#233;pla&#231;ait &#224; une vitesse fulgurante de 2&#8239;400&#160;km/s. Surtout, l'&#233;jection &#233;tait...</description>
    </item>
    <item>
      <title>This Fortnite PS5 console bundle could be Sony's Black Friday secret weapon</title>
      <link>https://www.techradar.com/gaming/this-fortnite-ps5-console-bundle-could-be-sonys-black-friday-secret-weapon</link>
      <pubDate>Thu, 13 Nov 2025 10:04:39 +0000</pubDate>
      <guid isPermaLink="false">ZAxEP2CAkhmbcdX4vpNN8U</guid>
      <description>PlayStation reveals a new Fortnite PS5 console bundle launching next week, and it could be Sony's secret Black Friday weapon.</description>
    </item>
    <item>
      <title>One-size-fits-all AI guardrails do not work in the enterprise</title>
      <link>https://www.techradar.com/pro/one-size-fits-all-ai-guardrails-do-not-work-in-the-enterprise</link>
      <pubDate>Thu, 13 Nov 2025 10:03:26 +0000</pubDate>
      <guid isPermaLink="false">8cHpyiyFHXSBLeL5uVLfjT</guid>
      <description>One-size-fits-all AI guardrails are out. The future of enterprise AI safety is Persona-Based Access Controls.</description>
    </item>
    <item>
      <title>The New York Times-OpenAI Legal Fight Is Getting Mean</title>
      <link>https://gizmodo.com/the-new-york-times-openai-legal-fight-is-getting-mean-2000684610</link>
      <pubDate>Thu, 13 Nov 2025 10:00:55 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000684610</guid>
      <description>"OpenAI is one of the most targeted organizations in the world," the AI giant's blog post says.</description>
    </item>
    <item>
      <title>NYT Mini crossword answers, hints for November 13, 2025</title>
      <link>https://mashable.com/article/nyt-mini-crossword-answers-hints-november-13-2025</link>
      <pubDate>Thu, 13 Nov 2025 10:00:30 +0000</pubDate>
      <guid isPermaLink="false">03bWzGdB9RezC7XT7Roieaf</guid>
      <description>Answers to each clue for the November 13, 2025 edition of NYT's The Mini crossword puzzle.</description>
    </item>
    <item>
      <title>You just learned the person who does the same job as you earns more than you do. Now what?</title>
      <link>https://www.fastcompany.com/91432594/you-just-learned-the-person-who-does-the-same-job-as-you-earns-more-than-you-do-now-what</link>
      <pubDate>2025-11-13T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91432594/you-just-learned-the-person-who-does-the-same-job-as-you-earns-more-than-you-do-now-what</guid>
      <description>Though it&#8217;s never fun, it is quite common. Here&#8217;s what to do when you discover others with the same job title are earning more. 
Discovering that a colleague with the same job title is earning more than you is never fun, though it is quite common.</description>
    </item>
    <item>
      <title>Rumor has it OpenAI will release GPT-5.1 this month. Expect fewer hallucinations, better, more creative writing, and more naughty bits</title>
      <link>https://www.fastcompany.com/91439564/openai-gpt5-1-release-expectations</link>
      <pubDate>2025-11-13T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91439564/openai-gpt5-1-release-expectations</guid>
      <description>Industry sources point to a potential release date as early as November 24. A veteran OpenAI watcher shares his predictions.
OpenAI watchers have spotted something curious over the last week.&#160;</description>
    </item>
    <item>
      <title>Apple lets you upload your passport to your iPhone. Here&#8217;s how to do it</title>
      <link>https://www.fastcompany.com/91440630/apple-iphone-passport-wallet-tsa-how-to-upload-airports-travel-identification-id</link>
      <pubDate>2025-11-13T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91440630/apple-iphone-passport-wallet-tsa-how-to-upload-airports-travel-identification-id</guid>
      <description>Yes, you can store your U.S. passport in your Wallet app now. But don&#8217;t leave that hard copy at home just yet.
Just in time for the busy holiday travel season, Apple has rolled out a new iOS 26 feature that lets users store their U.S. passport on their iPhone. The digitization of the passport is something tech-savvy travelers have longed for, especially as other once physical-only items that have crowded our pockets, like credit cards, driver&#8217;s licenses, and even car keys, have made their way onto the iPhone....</description>
    </item>
    <item>
      <title>Deepfake Kirkification memes are running rampant on social media</title>
      <link>https://mashable.com/article/kirkification-memes-on-social-media-explainer</link>
      <pubDate>Thu, 13 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">028Iz5mhFCbaEF1fNwMYA6n</guid>
      <description>So-called "Kirkified" memes are spreading rapidly across social media &#8212; another entry in the internet&#8217;s long, dark tradition.</description>
    </item>
    <item>
      <title>This black holes flare burned 10 trillion times brighter than the sun</title>
      <link>https://mashable.com/article/brightest-black-hole-flare-record</link>
      <pubDate>Thu, 13 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">030B1TYjWcHHfIFHA35sab8</guid>
      <description>At the center of a galaxy 10 billion light-years away, a supermassive black hole is the new record holder for brightest  flare.</description>
    </item>
    <item>
      <title>Get a lifetime tool for every PDF task you dread for just $30</title>
      <link>https://mashable.com/article/nov-13-swifdoo-pdf-pro-perpetual-lifetime-license</link>
      <pubDate>Thu, 13 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01GG4WNPMptBWqHKSSLtiL2</guid>
      <description>Get lifetime access to SwifDoo PDF Pro for Windows for just $29.97 (reg. $129) with code PRO through Nov. 20.</description>
    </item>
    <item>
      <title>Whats new to streaming this week? (Nov. 14, 2025)</title>
      <link>https://mashable.com/article/new-to-streaming-november-14-2025</link>
      <pubDate>Thu, 13 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">049RF2r2tO1kHPzI8I3u4sI</guid>
      <description>What's new to streaming for the week of Nov. 7 on Netflix, HBO Max, Disney+, and more?</description>
    </item>
    <item>
      <title>5 strategies to avoid ChatGPT dependency</title>
      <link>https://mashable.com/article/chatgpt-dependency</link>
      <pubDate>Thu, 13 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">05Be33MC8OGhUuvangtzL99</guid>
      <description>AI chatbots like ChatGPT can lead to emotional over-reliance. Here's how to avoid that.</description>
    </item>
    <item>
      <title>Google will let &#8216;experienced users&#8217; keep sideloading Android apps</title>
      <link>https://www.theverge.com/news/819835/google-android-sideloading-experienced-users-developer-verification</link>
      <pubDate>2025-11-13T04:50:46-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=819835</guid>
      <description>Google says that it&#8217;s softening its plan to require every Android developer &#8212; even outside of the Play Store &#8212; to verify their identity, a move which critics warned could kill sideloading for good. The company now says it&#8217;s developing a workflow to allow &#8220;experienced users&#8221; to install apps from unverified developers. Mandatory verification for [&#8230;]</description>
    </item>
    <item>
      <title>Home Depot Black Friday ad: The best deals you can buy online in 2025</title>
      <link>https://mashable.com/article/home-depot-black-friday-ad-2025-deals</link>
      <pubDate>Thu, 13 Nov 2025 09:50:27 +0000</pubDate>
      <guid isPermaLink="false">04Onqpd4eGoKETtgxco0euw</guid>
      <description>Home Depot Black Friday Ad. Browse the best deals from Home Depot's Black Friday sale in 2025.</description>
    </item>
    <item>
      <title>Valve donne des nouvelles du Steam Deck 2&#160;: un vrai bond g&#233;n&#233;rationnel</title>
      <link>https://www.01net.com/actualites/valve-donne-des-nouvelles-du-steam-deck-2-un-vrai-bond-generationnel.html</link>
      <pubDate>Thu, 13 Nov 2025 09:47:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1307638</guid>
      <description>Alors que Valve vient d&#8217;annoncer la Steam Machine et le Steam Frame, l&#8217;avenir du Steam Deck&#8239;2 reste incertain. L&#8217;entreprise indique attendre des avanc&#233;es mat&#233;rielles plus significatives avant de lancer une nouvelle g&#233;n&#233;ration.</description>
    </item>
    <item>
      <title>Workers are getting depressed by everyday tech challenges - could AI be the answer?</title>
      <link>https://www.techradar.com/pro/workers-are-getting-depressed-by-everyday-tech-challenges-could-ai-be-the-answer</link>
      <pubDate>Thu, 13 Nov 2025 09:45:18 +0000</pubDate>
      <guid isPermaLink="false">EKuZvZXuvePZjbjy46ZgA3</guid>
      <description>Frustrations, delays and inefficiencies from tech slow down workers, disrupt productivity and impact revenue - so what can be done?</description>
    </item>
    <item>
      <title>Don't wait for Black Friday &#8211; this affordable Hisense mini-LED TV's price has just plummeted to a record-low</title>
      <link>https://www.techradar.com/televisions/dont-wait-for-black-friday-this-affordable-hisense-mini-led-tvs-price-has-just-plummeted-to-a-record-low</link>
      <pubDate>Thu, 13 Nov 2025 09:43:40 +0000</pubDate>
      <guid isPermaLink="false">iCuscetEjMzwRcrdtoatnF</guid>
      <description>Hisense's U7Q TV is already excellent value but it's had a huge discount ahead of Black Friday that makes it unbeatable value.</description>
    </item>
    <item>
      <title>Android&#160;: Google laissera les &#171;&#160;utilisateurs exp&#233;riment&#233;s&#160;&#187; installer des applis en sideloading</title>
      <link>https://www.01net.com/actualites/android-google-laissera-les-utilisateurs-experimentes-installer-des-applis-en-sideloading.html</link>
      <pubDate>Thu, 13 Nov 2025 09:40:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1307660</guid>
      <description>Google travaille sur une solution pour autoriser &#171; les utilisateurs exp&#233;riment&#233;s &#187; &#224; installer des applications en dehors du Google Play Store.</description>
    </item>
    <item>
      <title>Samsung&amp;#8217;s trifold gets a name and &amp;#8216;confirmed&amp;#8217; specs</title>
      <link>https://www.theverge.com/news/819820/samsungs-trifold-gets-a-name-and-confirmed-specs</link>
      <pubDate>2025-11-13T04:31:34-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=819820</guid>
      <description>Reputable gadget leaker Evan Blass has taken to X with &#8220;some confirmed details&#8221; on Samsung&#8217;s upcoming trifold phone. It&#8217;ll be called the &#8220;Galaxy Z TriFold,&#8221; according to Blass, with a 6.5-inch cover display that maxes out at 2600 nits brightness. It unfurls to produce a 10-inch display on the inside capable of reaching a peak [&#8230;]</description>
    </item>
  </channel>
</rss>
