<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 01 Feb 2026 09:35:54 GMT</lastBuildDate>
    <item>
      <title>Obfuscation VPN : que sont les serveurs VPN obfusqu&#233;s et pourquoi sont-ils recommand&#233;s pour naviguer en s&#233;curit&#233; ?</title>
      <link>https://www.frandroid.com/services/vpn/2957127_obfuscation-vpn-que-sont-les-serveurs-vpn-obfusques-et-pourquoi-sont-ils-recommandes-pour-naviguer-en-securite</link>
      <pubDate>Sun, 01 Feb 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/vpn/2957127_obfuscation-vpn-que-sont-les-serveurs-vpn-obfusques-et-pourquoi-sont-ils-recommandes-pour-naviguer-en-securite</guid>
      <description>
C'est un mot &#233;trange que l'on n'entend pas tous les jours. L'obfuscation d&#233;signe au sens large toutes les strat&#233;gies pour brouiller les traces. Dans le cas des VPN, l'obfuscation d&#233;signe non pas les techniques employ&#233;es pour dissimuler ses activit&#233;s en ligne ; c'est d&#233;j&#224; leur principe de base. Voici tout ce qu'il y a &#224; savoir sur l'obfuscation.
</description>
    </item>
    <item>
      <title>Voitures &#233;lectriques : Renault braque d&#233;but 2026, Tesla boit une tasse monumentale</title>
      <link>https://www.frandroid.com/survoltes/2962157_voitures-electriques-renault-braque-debut-2026-tesla-boit-une-tasse-monumentale</link>
      <pubDate>Sun, 01 Feb 2026 09:02:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2962157_voitures-electriques-renault-braque-debut-2026-tesla-boit-une-tasse-monumentale</guid>
      <description>
Le leasing social est en train de saturer les routes fran&#231;aises de voitures &#233;lectriques. Les chiffres de janvier 2026 publi&#233;s par AAA Data montrent un pic historique, port&#233; par une Renault 5 intouchable.
</description>
    </item>
    <item>
      <title>Voici l&#8217;autonomie r&#233;elle de 25 voitures &#233;lectriques par -31&#176;C jusqu&#8217;&#224; la panne</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2962131_voici-lautonomie-reelle-de-25-voitures-electriques-par-31c-jusqua-la-panne</link>
      <pubDate>Sun, 01 Feb 2026 09:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2962131_voici-lautonomie-reelle-de-25-voitures-electriques-par-31c-jusqua-la-panne</guid>
      <description>
L'autonomie de 25 voitures &#233;lectriques a &#233;t&#233; test&#233; en Norv&#232;ge, en plein hiver, par -31&#176;C. Voici le classement complet, et les diff&#233;rences entre l'autonomie annonc&#233;e par le constructeur, et l'autonomie r&#233;elle.
</description>
    </item>
    <item>
      <title>Why we need more older female role models at work</title>
      <link>https://www.fastcompany.com/91480383/why-we-need-more-older-female-role-models-at-work</link>
      <pubDate>2026-02-01T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480383/why-we-need-more-older-female-role-models-at-work</guid>
      <description>Women over 50&#8212;and especially over 60&#8212;are still dramatically underrepresented at the highest levels of visible power.
There is a deeply unsettling paradox in how aging women are represented today. The louder the discourse on inclusion and diversity becomes, the fewer women we see who actually look like women over 45. Women who age &#8220;normally&#8221;&#8212;who live in their bodies, with their features, their lines, their visible age&#8212;have almost vanished from public view. When women in their 50s or 60s do gain visibility, it is often with a body and a face that belong to the strange category of Forever 35: per...</description>
    </item>
    <item>
      <title>Tout simplement le balai aspirateur Dyson le moins cher des soldes : le V7 Advanced est &#224; moins de 200 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2961113_tout-simplement-le-balai-aspirateur-dyson-le-moins-cher-des-soldes-le-v7-advanced-est-a-moins-de-200-e</link>
      <pubDate>Sun, 01 Feb 2026 08:18:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2961113_tout-simplement-le-balai-aspirateur-dyson-le-moins-cher-des-soldes-le-v7-advanced-est-a-moins-de-200-e</guid>
      <description>
Les aspirateurs-balais Dyson sont des appareils aussi design qu'efficaces, donc quand leur prix tombe comme c'est le cas sur le Dyson V7 Advanced qui passe de 299 euros &#224; 199 euros, il ne faut pas h&#233;siter longtemps.
</description>
    </item>
    <item>
      <title>Apple&#160;: qui sera assez fou pour succ&#233;der &#224; Tim Cook&#160;? Voici les 7 candidats les plus cr&#233;dibles</title>
      <link>https://www.01net.com/actualites/apple-qui-sera-assez-fou-pour-succeder-a-tim-cook-voici-les-7-candidats-les-plus-credibles.html</link>
      <pubDate>Sun, 01 Feb 2026 08:01:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322283</guid>
      <description>Comme dans toute grande entreprise cot&#233;e en Bourse, Apple a mis en place un plan de succession pour remplacer le CEO, peu importe la raison. Un plan qui se serait acc&#233;l&#233;r&#233; ces derniers mois : &#224; 65 ans, Tim Cook ne restera probablement pas &#224; la t&#234;te de l'entreprise pendant encore des ann&#233;es et des ann&#233;es. Il se murmure aussi que celui qui a pris la place de Steve Jobs en 2011 voudrait r&#233;duire sa charge de travail....</description>
    </item>
  </channel>
</rss>
