<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 02 Feb 2026 14:46:36 GMT</lastBuildDate>
    <item>
      <title>Google apporte une option essentielle &#224; NotebookLM sur mobile</title>
      <link>https://www.frandroid.com/marques/google/2963177_google-apporte-une-option-essentielle-a-notebooklm-sur-mobile</link>
      <pubDate>Mon, 02 Feb 2026 14:45:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2963177_google-apporte-une-option-essentielle-a-notebooklm-sur-mobile</guid>
      <description>
La firme de Mountain View a mis au point une fonctionnalit&#233; de r&#233;sum&#233; vid&#233;o au sein de son outil de prise de notes par IA.
</description>
    </item>
    <item>
      <title>13 000 milliards de dollars : Spotify et d&#8217;autres r&#233;clament une somme d&#233;lirante &#224; Anna&#8217;s Archive</title>
      <link>https://www.frandroid.com/services/streaming-musical/2963243_13-000-milliards-de-dollars-spotify-et-dautres-reclament-une-somme-delirante-a-annas-archive</link>
      <pubDate>Mon, 02 Feb 2026 14:41:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/streaming-musical/2963243_13-000-milliards-de-dollars-spotify-et-dautres-reclament-une-somme-delirante-a-annas-archive</guid>
      <description>
Spotify et plusieurs labels musicaux portent plainte contre le site Anna's Archive. Ils demandent une compensation particuli&#232;rement sal&#233;e.
</description>
    </item>
    <item>
      <title>10 ans de mises &#224; jour pour la Shield TV : Nvidia bat Google et Samsung &#224; plate couture</title>
      <link>https://www.frandroid.com/marques/nvidia/2963301_10-ans-de-mises-a-jour-pour-la-shield-tv-nvidia-bat-google-et-samsung-a-plate-couture</link>
      <pubDate>Mon, 02 Feb 2026 14:40:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2963301_10-ans-de-mises-a-jour-pour-la-shield-tv-nvidia-bat-google-et-samsung-a-plate-couture</guid>
      <description>
&#192; l'&#232;re de l'obsolescence programm&#233;e, o&#249; changer de smartphone tous les deux ans est devenu la norme, un OVNI r&#233;siste encore et toujours : la Nvidia Shield TV. Sortie en 2015, cette box Android TV continue de recevoir des mises &#224; jour, une d&#233;cennie plus tard. Comment est-ce possible ? Un dirigeant de Nvidia livre les secrets de cette long&#233;vit&#233; hors-norme.
...</description>
    </item>
    <item>
      <title>Sam Raimi Still Has Hope for a &#8216;Spider-Man 4&#8217;</title>
      <link>https://gizmodo.com/sam-raimi-spider-man-4-marvel-sony-2000716486</link>
      <pubDate>Mon, 02 Feb 2026 14:30:56 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000716486</guid>
      <description>Plus, a wild rumor about the direction of 'The Brave and the Bold'.</description>
    </item>
    <item>
      <title>UpScrolled&#8217;s founder says the social network has zoomed past 2.5M users</title>
      <link>https://techcrunch.com/2026/02/02/upscrolleds-founder-says-the-social-network-has-zoomed-past-2-5m-users/</link>
      <pubDate>Mon, 02 Feb 2026 14:29:22 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3088670</guid>
      <description>Upscrolled founder said that the social network was launched six years ago and had 150,000 users until January</description>
    </item>
    <item>
      <title>Meta exp&#233;rimente un clavier virtuel plus proche du r&#233;el pour le Quest 3</title>
      <link>https://www.01net.com/actualites/meta-experimente-un-clavier-virtuel-plus-proche-du-reel-pour-le-quest-3.html</link>
      <pubDate>Mon, 02 Feb 2026 14:29:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323745</guid>
      <description>Les utilisateurs de Quest 3 ont une raison suppl&#233;mentaire de garder leurs casques sur la t&#234;te : un clavier virtuel et un touchpad qui se positionnent sur une surface plane, comme une table ou un bureau. Ce n'est pas exactement un &#171;&#160;vrai&#160;&#187; clavier physique, mais ce sera probablement mieux que le clavier virtuel actuel.</description>
    </item>
    <item>
      <title>&#171;&#160;Nous devons am&#233;liorer Windows&#160;&#187; : pourquoi Microsoft pourrait s&#8217;inspirer d&#8217;Ubisoft et Square Enix pour sauver Windows 11</title>
      <link>https://www.frandroid.com/marques/microsoft/2962659_nous-devons-ameliorer-windows-pourquoi-microsoft-pourrait-sinspirer-dubisoft-et-square-enix-pour-sauver-windows-11</link>
      <pubDate>Mon, 02 Feb 2026 14:25:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2962659_nous-devons-ameliorer-windows-pourquoi-microsoft-pourrait-sinspirer-dubisoft-et-square-enix-pour-sauver-windows-11</guid>
      <description>
Dans la tourmente sur les soucis de stabilit&#233; de Windows 11, Microsoft annonce vouloir sauver les meubles pour regagner la confiance des utilisateurs. Une nouvelle strat&#233;gie qu'on a d&#233;j&#224; observ&#233;e &#224; plusieurs reprises dans le monde du jeu vid&#233;o.
</description>
    </item>
    <item>
      <title>Major health provider data breach may have affected thousands more people - over 700k now thought to have been hit</title>
      <link>https://www.techradar.com/pro/security/major-health-provider-data-breach-may-have-affected-thousands-more-people-over-700k-now-thought-to-have-been-hit</link>
      <pubDate>Mon, 02 Feb 2026 14:25:00 +0000</pubDate>
      <guid isPermaLink="false">tEKj92PydzRQpZV3m6SPdU</guid>
      <description>TriZetto Provider Solutions breach was spotted in October 2025 after hackers lurked for almost a year.</description>
    </item>
    <item>
      <title>What to know about the notable VIPs named in the Epstein files, from Elon Musk to former Prince Andrew</title>
      <link>https://www.fastcompany.com/91485089/what-know-about-notable-vips-named-epstein-files-from-elon-musk-former-prince-andrew</link>
      <pubDate>2026-02-02T14:22:29</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91485089/what-know-about-notable-vips-named-epstein-files-from-elon-musk-former-prince-andrew</guid>
      <description>Newly released documents from the DOJ mention the names of powerful people in tech and politics.
From tech titans to Wall Street power brokers and foreign dignitaries, a who&#8217;s who of powerful men make appearances in the huge trove of documents released by the Justice Department in connection with its investigations of Jeffrey Epstein.All have denied having anything to do with his sexual abuse of girls and young women. Yet some of them maintained friendships with Epstein, or developed them anew, even after news stories made him widely known as an alleged abuser of young girls.None have been cha...</description>
    </item>
    <item>
      <title>Linq raises $20M to enable AI assistants to live within messaging apps</title>
      <link>https://techcrunch.com/2026/02/02/linq-raises-20m-to-enable-ai-assistants-to-live-within-messaging-apps/</link>
      <pubDate>Mon, 02 Feb 2026 14:16:13 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3088487</guid>
      <description>Linq offers an API that lets  companies offer their AI assistants via iMessage, RCS and SMS.</description>
    </item>
    <item>
      <title>Elon Musk&#8217;s Grok is still undressing men</title>
      <link>https://www.theverge.com/report/872062/grok-still-undressing-men</link>
      <pubDate>2026-02-02T09:09:47-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=872062</guid>
      <description>After weeks of flooding the internet with nonconsensual sexual deepfakes, X has finally reined in Elon Musk's rogue chatbot Grok. Musk claims Grok obeys local laws and refuses to produce anything illegal - except it hasn't and it can. My testing shows Grok still readily undresses men and is still churning out intimate images on [&#8230;]</description>
    </item>
    <item>
      <title>The latest iPad mini is $100 off right now</title>
      <link>https://www.engadget.com/deals/the-latest-ipad-mini-is-100-off-right-now-140900983.html?src=rss</link>
      <pubDate>Mon, 02 Feb 2026 14:09:00 +0000</pubDate>
      <guid isPermaLink="false">19626799-ebb9-4821-a9ee-8598c32b4da3</guid>
      <description>We've finally made it to February, but, with the ongoing long nights, you might want a pick-me-up to get you through the rest of winter. Take the Apple iPad mini with the A17 Pro chip, which is on sale for $400, down from $500. Its small size is perfect for cozying up on the couch or to use on your daily commute.&#160;
Apple released this iPad mini in late 2024 and it was a solid update. We gave it an 83 in our review thanks to the power of its A17 Pro chip and that it comes with a minimum of 128GB of storage. The model currently on sale comes with 128GB, Wi-Fi and all four color options: Blue, Pur...</description>
    </item>
    <item>
      <title>Ces 10 arnaques en ligne explosent &#224; l&#8217;approche des Jeux olympiques d&#8217;hiver 2026</title>
      <link>https://www.01net.com/actualites/ces-10-arnaques-explosent-a-lapproche-des-jeux-olympiques-dhiver-2026.html</link>
      <pubDate>Mon, 02 Feb 2026 14:02:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323709</guid>
      <description>&#192; la veille de l&#8217;ouverture des Jeux d&#8217;hiver de Milano Cortina, les cybercriminels sont en embuscade. Les pirates sont bien partis pour surfer sur l&#8217;&#233;norme visibilit&#233; de l&#8217;&#233;v&#233;nement pour pi&#233;ger les internautes et les spectateurs sur place. En plus des faux sites de billets, de voyages ou d&#8217;emplois, les pirates misent sur des campagnes de phishing, des applications factices, des QR codes pi&#233;g&#233;s et m&#234;me des contenus dop&#233;s &#224; l&#8217;IA ou des deepfakes. Les chercheurs d&#8217;ESET appellent les fans de sports &#224; la plus grande vigilance....</description>
    </item>
    <item>
      <title>Surfshark's new browser tool warns you about dangerous sites before you click</title>
      <link>https://www.techradar.com/vpn/vpn-services/surfsharks-new-browser-tool-warns-you-about-dangerous-sites-before-you-click</link>
      <pubDate>Mon, 02 Feb 2026 14:02:13 +0000</pubDate>
      <guid isPermaLink="false">JYKQdbFMzQVvRgQvxLZGGD</guid>
      <description>Surfshark has updated its browser extension with a new feature that flags malicious links in Google Search results, helping users avoid malware and phishing attempts before they even click.</description>
    </item>
    <item>
      <title>The &#8216;Stranger Things: Tales from &#8217;85&#8217; Trailer Takes You Back to Hawkins</title>
      <link>https://gizmodo.com/stranger-things-tales-from-85-trailer-netflix-animated-series-2000716423</link>
      <pubDate>Mon, 02 Feb 2026 14:00:57 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000716423</guid>
      <description>Netflix brings the Hawkins gang and the Upside Down into animation with the new spinoff 'Stranger Things: Tales from '85'.</description>
    </item>
    <item>
      <title>The "most capable and best-looking mainline Apple Watch" is back to a record-low price on Amazon</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/the-most-capable-and-best-looking-mainline-apple-watch-is-back-to-a-record-low-price-on-amazon</link>
      <pubDate>Mon, 02 Feb 2026 14:00:36 +0000</pubDate>
      <guid isPermaLink="false">FQ95nKdLNnnRELb5nRSEtZ</guid>
      <description>The Apple Watch Series 11 is the best Apple Watch for most people, and it's just hit a record low once more on Amazon.</description>
    </item>
    <item>
      <title>Now anyone can tap Ring doorbells to search for lost dogs</title>
      <link>https://www.theverge.com/tech/871916/search-party-non-ring-owners-neighbors-app</link>
      <pubDate>2026-02-02T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=871916</guid>
      <description>Ring is opening its Search Party pet finder service to non-Ring owners through the free Ring Neighbors app. The service has helped reunite owners with "more than one lost dog a day" since launch, according to the company. Anyone in the US can share a photo of their missing pet after they download and register [&#8230;]</description>
    </item>
    <item>
      <title>What is the release date for Fallout season 2 episode 8 on Prime Video?</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/what-is-the-release-date-for-fallout-season-2-episode-8-on-prime-video</link>
      <pubDate>Mon, 02 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">8TTbdXpjZ2qhpCQuvdp4EQ</guid>
      <description>It's finale week for Fallout season 2 &#8211; here's when you can watch its eighth episode.</description>
    </item>
    <item>
      <title>Get up to 20 percent off Sonos home theater gear before Super Bowl 2026</title>
      <link>https://www.engadget.com/deals/get-up-to-20-percent-off-sonos-home-theater-gear-before-super-bowl-2026-174053382.html?src=rss</link>
      <pubDate>Mon, 02 Feb 2026 13:56:27 +0000</pubDate>
      <guid isPermaLink="false">d95ac4b9-448d-4c43-906a-61793dfa0aef</guid>
      <description>It's big-game season, which means it's a good time to look for home theater gear on sale ahead of Super Bowl 2026. There are plenty of Super Bowl TV deals to consider, but if you have arguably the most important piece of the puzzle down, you may want to upgrade your sound system instead. Sonos' latest sale may have just what you need; a bunch of the company's home theater gear is up to 20 percent off right now. You can save $130 on the Beam (Gen 2) soundbar, bringing its price down to $369, and you'll also find deals on the flagship Arc Ultra soundbar, subwoofers, and more.
The Sonos Beam is t...</description>
    </item>
    <item>
      <title>La pleine Lune s&#8217;est d&#233;doubl&#233;e ? Ce spectacle irr&#233;el observ&#233; en Russie a affol&#233; les r&#233;seaux sociaux !</title>
      <link>https://www.futura-sciences.com/sciences/actualites/lune-ce-cachent-vraiment-ces-images-multiples-lunes-vues-russie-130821/#xtor%3DRSS-8</link>
      <pubDate>Mon, 02 Feb 2026 14:55:10 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/lune-ce-cachent-vraiment-ces-images-multiples-lunes-vues-russie-130821/#xtor%3DRSS-8</guid>
      <description>&#192; en croire les internautes russes, il y avait plusieurs lunes en m&#234;me temps dans leur ciel ce week-end. Ils ont des images. Mais peut-on s&#8217;y fier&#8201;?</description>
    </item>
    <item>
      <title>Cette tour PC Alienware avec pr&#232;s de 30 % de remise (RTX 5070, Ultra 7, 32 Go RAM) revient moins cher qu&#8217;un PC mont&#233; maison</title>
      <link>https://www.frandroid.com/bons-plans/2963095_cette-tour-pc-alienware-avec-pres-de-30-de-remise-rtx-5070-ultra-7-32-go-ram-revient-moins-cher-quun-pc-monte-maison</link>
      <pubDate>Mon, 02 Feb 2026 13:48:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2963095_cette-tour-pc-alienware-avec-pres-de-30-de-remise-rtx-5070-ultra-7-32-go-ram-revient-moins-cher-quun-pc-monte-maison</guid>
      <description>
Avec la p&#233;nurie des composants et la hausse des prix de la RAM et du stockage, cette tour Alienware affich&#233;e &#224; pr&#232;s de 30 % de remise tombe &#224; point nomm&#233;&#8201;: avec sa RTX 5070, son Intel Ultra 7 et ses 32 Go de RAM, elle offre une configuration taill&#233;e pour le 1440p et la 4K &#224; un tarif bien plus int&#233;ressant que le montage d&#8217;un PC &#233;quivalent.
</description>
    </item>
    <item>
      <title>B&amp;YOU Pure Fibre : encore une augmentation de prix pour la box star de Bouygues Telecom</title>
      <link>https://www.frandroid.com/actualites-generales/2963227_byou-pure-fibre-encore-une-augmentation-de-prix-pour-la-box-star-de-bouygues-telecom</link>
      <pubDate>Mon, 02 Feb 2026 13:38:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2963227_byou-pure-fibre-encore-une-augmentation-de-prix-pour-la-box-star-de-bouygues-telecom</guid>
      <description>
Apr&#232;s avoir scind&#233; son forfait Pure Fibre en deux offres distinctes, B&amp;YOU vient d'augmenter le tarif de la formule la plus avantageuse pour les nouveaux abonn&#233;s. Une nouvelle augmentation apr&#232;s celle de... janvier dernier.
</description>
    </item>
    <item>
      <title>Windows 11 : Microsoft avoue son erreur et pourrait r&#233;duire la pr&#233;sence de Copilot</title>
      <link>https://www.frandroid.com/marques/microsoft/2962965_windows-11-microsoft-avoue-son-erreur-et-pourrait-reduire-la-presence-de-copilot</link>
      <pubDate>Mon, 02 Feb 2026 13:38:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2962965_windows-11-microsoft-avoue-son-erreur-et-pourrait-reduire-la-presence-de-copilot</guid>
      <description>
Microsoft pourrait enti&#232;rement revoir sa strat&#233;gie li&#233;e &#224; l'int&#233;gration de Copilot dans Windows 11, en r&#233;action aux nombreuses critiques des utilisateurs.
</description>
    </item>
    <item>
      <title>At the Grammys, host Trevor Noah roasts Nicki Minaj and takes aim at Trump with an Epstein joke</title>
      <link>https://www.fastcompany.com/91485068/at-grammys-host-trevor-noah-roasts-nicki-minaj-takes-aim-trump-with-epstein-joke</link>
      <pubDate>2026-02-02T13:26:08</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91485068/at-grammys-host-trevor-noah-roasts-nicki-minaj-takes-aim-trump-with-epstein-joke</guid>
      <description>The six-time host mostly played it safe during his monologue. 
Trevor Noah once again roamed through the audience during his monologue to open the Grammy Awards, taking pokes at the stars while standing right next to them, but he saved his most pointed jokes for absentees, and elicited an angry post from the president.&#8220;Nicki Minaj is not here,&#8221; Noah said, to big cheers from the audience at Crypto.com Arena. &#8220;She is still at the White House with Donald Trump discussing very important issues.&#8221;Minaj this week visited and praised the president, the culmination of a move toward MAGA that she&#8217;s made...</description>
    </item>
    <item>
      <title>Ring light : les meilleurs anneaux lumineux &#224; choisir en 2026</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-photo-et-video/1155461_guide-achat-comparatif-light-ring-anneau-lumiere</link>
      <pubDate>Mon, 02 Feb 2026 13:24:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-photo-et-video/1155461_guide-achat-comparatif-light-ring-anneau-lumiere</guid>
      <description>
Autrefois r&#233;serv&#233;s aux photographes, les ring lights sont d&#233;sormais utilis&#233;s par les cr&#233;ateurs de contenus. D&#233;couvrez notre s&#233;lection d&#8217;anneaux lumineux afin d&#8217;exploiter une lumi&#232;re de qualit&#233; pour vos clich&#233;s et vos vid&#233;os TikTok et Instagram.
</description>
    </item>
    <item>
      <title>Capgemini se d&#233;barrasse de sa filiale US apr&#232;s le contrat avec l&#8217;ICE, la police de l&#8217;immigration am&#233;ricaine</title>
      <link>https://www.01net.com/actualites/capgemini-se-debarrasse-de-sa-filiale-us-apres-le-contrat-avec-lice-la-police-de-limmigration-americaine.html</link>
      <pubDate>Mon, 02 Feb 2026 13:18:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323732</guid>
      <description>Apr&#232;s la pol&#233;mique de ces derniers jours, Capgemini a d&#233;cid&#233; de prendre le taureau par les cornes : le g&#233;ant fran&#231;ais va tout simplement vendre sa filiale aux &#201;tats-Unis qui travaille pour l'ICE, la police de l'immigration du pays.</description>
    </item>
    <item>
      <title>Anker's 45W Nano charger with smart display is $10 off</title>
      <link>https://www.engadget.com/deals/ankers-45w-nano-charger-with-smart-display-is-10-off-160707508.html?src=rss</link>
      <pubDate>Mon, 02 Feb 2026 13:16:26 +0000</pubDate>
      <guid isPermaLink="false">e5fce599-c299-44cd-983e-1c46fb9819b8</guid>
      <description>Anker rolled out a bunch of new chargers and other gear at CES 2026, including a cute one that's already on sale. The new Nano charger with smart display, which is an upgrade to the existing Nano charger in Anker's lineup, is on sale for $30 right now when you clip an on-page coupon on Amazon. That's $10 off the regular price.
The 45W charger includes a smart display that shows real-time data like power flow, temperature and charging status. It also features "fun animations to keep things cheerful." Anker says it can recognize what's being charged and automatically adjust certain metrics to en...</description>
    </item>
    <item>
      <title>Bitcoin bloodbath: Selloff sparks fears of new &#8216;crypto winter&#8217; after weekend crash hits BTC, XRP, ETH, and others</title>
      <link>https://www.fastcompany.com/91485048/bitcoin-bloodbath-btc-xrp-etc-price-crash-new-crypto-winter</link>
      <pubDate>2026-02-02T13:15:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91485048/bitcoin-bloodbath-btc-xrp-etc-price-crash-new-crypto-winter</guid>
      <description>Investors in major cryptocurrencies are holding their breaths today in hopes that a weekend collapse of coin prices was a temporary blip.
To say it&#8217;s been a bad few days for Bitcoin and other cryptocurrencies would be an understatement. </description>
    </item>
    <item>
      <title>The 512GB Samsung P9 microSD Express card is 33 percent off right now</title>
      <link>https://www.engadget.com/deals/the-512gb-samsung-p9-microsd-express-card-is-33-percent-off-right-now-143849000.html?src=rss</link>
      <pubDate>Mon, 02 Feb 2026 13:08:14 +0000</pubDate>
      <guid isPermaLink="false">b7c1c9b1-8762-4b3b-bd34-558e13eba66f</guid>
      <description>MicroSD Express cards are still a little hard to find, considering they're pretty new and only really started becoming popular last year once the Switch 2 came out. These upgraded versions of microSD cards are the only ones compatible with the Switch 2 for expanding its storage, os if you're already starting to feel the crunch on your console, it's worth picking one up. Samsung's P9 microSD Express card is on sale right now &#8212; you can grab the 512GB version of $80, which is 33 percent off and one of the best prices we've seen.
The P9 boasts transfer speeds of up to 800MB/s, making moving games ...</description>
    </item>
    <item>
      <title>Honda and Mercedes-Benz declare war on potholes &#8211; new LiDAR and suspension tricks aim to soften the blow of government failures</title>
      <link>https://www.techradar.com/vehicle-tech/hybrid-electric-vehicles/honda-and-mercedes-benz-declare-war-on-potholes-new-lidar-and-suspension-tricks-aim-to-soften-the-blow-of-government-failures</link>
      <pubDate>Mon, 02 Feb 2026 13:06:48 +0000</pubDate>
      <guid isPermaLink="false">2hbRNE2TnBRPJE5qBmVusb</guid>
      <description>Honda harnesses its sensor tech to spy on potholes for the government, which could help to fix busted roads.</description>
    </item>
    <item>
      <title>Oh dear - the recent TikTok outage was due to an Oracle data center going down</title>
      <link>https://www.techradar.com/pro/oh-dear-the-recent-tiktok-outage-was-due-to-an-oracle-data-center-going-down</link>
      <pubDate>Mon, 02 Feb 2026 13:05:00 +0000</pubDate>
      <guid isPermaLink="false">RH4sLS68WkXL3WzNZSdrXZ</guid>
      <description>Severe winter weather caused a power outage at an Oracle data center, knocking many TikTok features offline for days.</description>
    </item>
    <item>
      <title>I tested the Oukitel Industry RT10 - this rugged tablet is packed with features, but it's a shame you need a specialist app for the built-in barcode scanner</title>
      <link>https://www.techradar.com/pro/oukitel-industry-rt10-rugged-tablet-review</link>
      <pubDate>Mon, 02 Feb 2026 13:05:00 +0000</pubDate>
      <guid isPermaLink="false">fSiVL9wut7tiJtT28Ey8eV</guid>
      <description>The Oukitel Industry RT10 is a business-focused rugged tablet with an 11" FHD touchscreen, 5G connectivity, and storage expansion, and what's more, it's built tough to withstand the elements.</description>
    </item>
    <item>
      <title>Steven Spielberg Lands EGOT Status With New Grammy Win</title>
      <link>https://gizmodo.com/steven-spielberg-lands-egot-status-with-new-grammy-win-2000716477</link>
      <pubDate>Mon, 02 Feb 2026 13:00:32 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000716477</guid>
      <description>After decades of films and accolades, Steven Spielberg hit the grand slam after his now award-winning documentary focused on John Williams.</description>
    </item>
    <item>
      <title>The DJI Mini 5 Pro Fly More Combo is down to its record-low price at Amazon &#8212; save $500 right now</title>
      <link>https://mashable.com/article/feb-2-dji-mini-5-pro-combo-deal</link>
      <pubDate>Mon, 02 Feb 2026 13:00:18 +0000</pubDate>
      <guid isPermaLink="false">04hwhn7L0zzkjZzeCzxPpUz</guid>
      <description>The DJI Mini 5 Pro Fly More Combo is on sale at Amazon for $1,099, down from the normal price of $1,599. That's a 31% discount.</description>
    </item>
    <item>
      <title>Amazfit smartwatches just got two new features that make them even better value</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/amazfit-smartwatches-just-got-two-new-features-that-make-them-even-better-value</link>
      <pubDate>Mon, 02 Feb 2026 13:00:09 +0000</pubDate>
      <guid isPermaLink="false">bppT8bRHmnFJFAdfxYuU4m</guid>
      <description>Amazfit smartwatches now work with the Runna app and have a fresh interface design.</description>
    </item>
    <item>
      <title>3 Best Floodlight Security Cameras (2026), Tested and Reviewed</title>
      <link>https://www.wired.com/gallery/best-floodlight-security-cameras/</link>
      <pubDate>Mon, 02 Feb 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">6970e54e4b02002c82247b28</guid>
      <description>Light up and secure your driveway, backyard, or porch with a floodlight security camera.</description>
    </item>
    <item>
      <title>Bad Bunny slams ICE during Grammys speech</title>
      <link>https://mashable.com/video/bad-bunny-grammys-speech-ice</link>
      <pubDate>Mon, 02 Feb 2026 12:55:02 +0000</pubDate>
      <guid isPermaLink="false">01wpyRgzxgqf0x5XhdSafzB</guid>
      <description>Bad Bunny addressed ICE during his acceptance speech for Best M&#250;sica Urbana Album at the 2026 Grammy Awards.</description>
    </item>
    <item>
      <title>Vivo and Oppo&#8217;s telephoto extender comes to iPhone</title>
      <link>https://www.theverge.com/gadgets/872058/pgytech-telephoto-extender-iphone</link>
      <pubDate>2026-02-02T07:54:59-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=872058</guid>
      <description>PGYTech, the accessory manufacturer behind the official telephoto extender lenses for recent Vivo and Oppo flagships, has launched a Kickstarter for a new version developed for iPhones. The RetroVa Vintage Imaging Kit looks an awful lot like the camera kits for those phones, complete with a custom case, slide-on camera grip with built-in battery and [&#8230;]...</description>
    </item>
    <item>
      <title>Beats Powerbeats Pro 2 have dropped below $200 at Amazon &#8212; act fast to save over $50</title>
      <link>https://mashable.com/article/feb-2-beats-powerbeats-pro-2-deal</link>
      <pubDate>Mon, 02 Feb 2026 12:54:47 +0000</pubDate>
      <guid isPermaLink="false">02MvoeieAVaEYky45Fd2GvG</guid>
      <description>As of Feb. 2, the Beats Powerbeats Pro 2 are on sale at Amazon for $199.95, 20% off their list price of $249.99.</description>
    </item>
    <item>
      <title>Why Luther Vandross is trending after the Grammys</title>
      <link>https://mashable.com/article/grammys-cher-luther-vandross-kendrick-lamar</link>
      <pubDate>Mon, 02 Feb 2026 12:49:01 +0000</pubDate>
      <guid isPermaLink="false">007Lpvib3NTiPwXJe6hisgT</guid>
      <description>Kendrick Lamar, Cher, Luther Vandross &#8212; here's what happened at the 68th Annual Grammy Awards on Sunday night.</description>
    </item>
    <item>
      <title>Will Bad Bunny call out ICE at the Super Bowl?</title>
      <link>https://mashable.com/article/bad-bunny-super-bowl-ice-trump</link>
      <pubDate>Mon, 02 Feb 2026 12:46:59 +0000</pubDate>
      <guid isPermaLink="false">00Xr2cE1RHlfCYcTIAVtAF8</guid>
      <description>Bad Bunny has long criticized U.S. immigration policy and Trump-era politics. Will he speak out at Super Bowl LX?</description>
    </item>
  </channel>
</rss>
