<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 06 Nov 2025 13:43:42 GMT</lastBuildDate>
    <item>
      <title>Thousands of flights in danger of cancellation as FAA announces major cuts</title>
      <link>https://www.theverge.com/news/815359/faa-flight-cuts-airport-government-shutdown</link>
      <pubDate>2025-11-06T08:41:19-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815359</guid>
      <description>The government shutdown-spurred airport chaos is about to get a whole lot worse. The Federal Aviation Administration said Wednesday it will reduce flight volumes by 10 percent across 40 major airports in response, a move that could threaten 3,000 to 4,500 flights daily. The cuts will affect &#8220;high volume&#8221; markets, including in Atlanta, Dallas, New [&#8230;]...</description>
    </item>
    <item>
      <title>10 millions de Fran&#231;ais regardent Netflix avec de la pub</title>
      <link>https://www.01net.com/actualites/10-millions-de-francais-regardent-netflix-avec-de-la-pub.html</link>
      <pubDate>Thu, 06 Nov 2025 13:37:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305737</guid>
      <description>En France, pr&#232;s de la moiti&#233; de la population regarde Netflix. Et 10 millions le font via un abonnement avec pub, selon de nouveaux chiffres M&#233;diam&#233;trie. Un v&#233;ritable carton qui confirme l'implantation dans l'Hexagone de la plateforme de streaming, qui a trouv&#233; le point d'&#233;quilibre pour ne pas inonder les abonn&#233;s avec de la r&#233;clame.</description>
    </item>
    <item>
      <title>Ce laptop Dell polyvalent avec &#233;cran 120 Hz et Ryzen 7 chute sous les 500 &#8364; en plein pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2857801_ce-laptop-dell-polyvalent-avec-ecran-120-hz-et-ryzen-7-chute-sous-les-500-e-en-plein-pre-black-friday</link>
      <pubDate>Thu, 06 Nov 2025 13:36:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2857801_ce-laptop-dell-polyvalent-avec-ecran-120-hz-et-ryzen-7-chute-sous-les-500-e-en-plein-pre-black-friday</guid>
      <description>
Id&#233;al pour la bureautique, et m&#234;me pour du jeu l&#233;ger, le Dell 15 DC15255 est une machine polyvalente qui a aussi l'avantage d'&#234;tre pratique &#224; transporter. En ce pr&#233;-Black Friday, vous trouverez ce mod&#232;le sous Ryzen 7 affich&#233; &#224; 499 euros au lieu de 649 euros.
</description>
    </item>
    <item>
      <title>New teaser hints that two of the most anticipated X-Men might come to Marvel Rivals soon</title>
      <link>https://www.techradar.com/gaming/new-teaser-hints-that-two-of-the-most-anticipated-x-men-might-come-to-marvel-rivals-soon</link>
      <pubDate>Thu, 06 Nov 2025 13:35:35 +0000</pubDate>
      <guid isPermaLink="false">AP22mGvoqFcBQ5oTT2EXS8</guid>
      <description>It looks like Marvel Rivals will soon introduce two of the most anticipated X-Men to the roster.</description>
    </item>
    <item>
      <title>Valve just made Steam Deck downloads much easier &#8211; and I hope this feature comes to all SteamOS handhelds</title>
      <link>https://www.techradar.com/gaming/steam-deck/valve-just-made-steam-deck-downloads-much-easier-and-i-hope-this-feature-comes-to-all-steamos-handhelds</link>
      <pubDate>Thu, 06 Nov 2025 13:35:34 +0000</pubDate>
      <guid isPermaLink="false">h5PY9ZMLGySywtt8JBrE4Z</guid>
      <description>Valve has just released a new Steam Deck 'display-off low-power download' update, but it's currently only available via the beta and preview channels.</description>
    </item>
    <item>
      <title>Ce qui est en train de se passer &#224; la Nasa, sous l&#8217;effet du shutdown, devrait tous nous inqui&#233;ter</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-ce-train-passer-nasa-sous-effet-shutdown-devrait-tous-nous-inquieter-127245/#xtor%3DRSS-8</link>
      <pubDate>Thu, 06 Nov 2025 14:35:25 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-ce-train-passer-nasa-sous-effet-shutdown-devrait-tous-nous-inquieter-127245/#xtor%3DRSS-8</guid>
      <description>Alors que nous arrivons au 36e jour du&#160;shutdown, ce qui en fait le plus long de l'histoire am&#233;ricaine, la Nasa souffre de difficult&#233;s croissantes. Dans quel &#233;tat retrouvera-t-on l'agence spatiale au terme de cette &#233;preuve ?</description>
    </item>
    <item>
      <title>The Best Cheap Headphones We&#8217;ve Tried</title>
      <link>https://www.wired.com/gallery/best-headphones-under-100/</link>
      <pubDate>Thu, 06 Nov 2025 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">5c6730ca7029bd0a760fde8a</guid>
      <description>You could fill a stadium or two with all the cheap headphones out there. We tested a ton of the best headphones under $100 to help you pick the right pair.</description>
    </item>
    <item>
      <title>Watch those typos - email mistakes are causing significant security issues</title>
      <link>https://www.techradar.com/pro/security/email-mistakes-are-causing-significant-security-issues</link>
      <pubDate>Thu, 06 Nov 2025 13:26:00 +0000</pubDate>
      <guid isPermaLink="false">cgW3sWt4WfjEFnazosMRCR</guid>
      <description>Emails sent to the wrong address cause quite a lot of trouble and rake up billions in fines.</description>
    </item>
    <item>
      <title>Swytch est en grande difficult&#233;, un plan de sauvetage est en cours pour l&#8217;un des leaders des kits d&#8217;&#233;lectrification pour v&#233;lo</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2857311_swytch-est-en-grande-difficulte-un-plan-de-sauvetage-est-en-cours-pour-lun-des-leaders-des-kits-delectrification-pour-velo</link>
      <pubDate>Thu, 06 Nov 2025 13:16:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2857311_swytch-est-en-grande-difficulte-un-plan-de-sauvetage-est-en-cours-pour-lun-des-leaders-des-kits-delectrification-pour-velo</guid>
      <description>
Visiblement en difficult&#233; financi&#232;re, Swytch tente de se restructurer &#224; travers un plan de sauvetage soutenu par ses investisseurs historiques. Le sp&#233;cialiste britannique des kits d&#8217;&#233;lectrification pour v&#233;los esp&#232;re ainsi s&#233;curiser sa tr&#233;sorerie.
</description>
    </item>
    <item>
      <title>Foursquare&amp;#8217;s founder launches a new app that talks to you about your neighborhood</title>
      <link>https://www.theverge.com/news/815328/beebot-app-foursquare-founder-ai-audio-updates</link>
      <pubDate>2025-11-06T08:15:35-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815328</guid>
      <description>After teasing its development last year, Foursquare co-founder Dennis Crowley has now launched BeeBot: an AI-powered social app for iPhones that talks to you about what&#8217;s happening nearby. In his blog announcement, Crowley says BeeBot behaves like a &#8220;personalized radio DJ&#8221; that provides location-based audio updates through your headphones, telling you about what friends are [&#8230;]...</description>
    </item>
    <item>
      <title>Apple's $1 billion AI gamble might be too late to tempt users back to Apple Intelligence</title>
      <link>https://www.techradar.com/ai-platforms-assistants/apple-intelligence/apples-usd1-billion-ai-gamble-might-be-too-late-to-tempt-users-back-to-apple-intelligence</link>
      <pubDate>Thu, 06 Nov 2025 13:15:33 +0000</pubDate>
      <guid isPermaLink="false">3Z68vFrZR8gDMZGhwNFKYY</guid>
      <description>Apple and Google are about to sign a lucrative AI deal, but can Gemini fix Apple's AI woes? I think it's too little too late.</description>
    </item>
    <item>
      <title>Fairphone&#8217;s sustainable, repairable noise-cancelling headphones are finally coming to the US. Here&#8217;s why you should pay attention</title>
      <link>https://www.techradar.com/audio/wireless-headphones/fairphones-sustainable-repairable-noise-cancelling-headphones-are-finally-coming-to-the-us-heres-why-you-should-pay-attention</link>
      <pubDate>Thu, 06 Nov 2025 13:12:09 +0000</pubDate>
      <guid isPermaLink="false">gEmphhcbuugTDvVG7Wjz4T</guid>
      <description>These headphones are built to be better for the environment and for your conscience too</description>
    </item>
    <item>
      <title>Kodak's trending Charmera keyring camera is a great gift idea &#8211; I'd preorder the 'blind box' now and hope it lands in time for the holidays</title>
      <link>https://www.techradar.com/cameras/compact-cameras/kodaks-trending-charmera-keyring-camera-is-a-great-gift-idea-id-preorder-the-blind-box-now-and-hope-it-lands-in-time-for-the-holidays</link>
      <pubDate>Thu, 06 Nov 2025 13:03:27 +0000</pubDate>
      <guid isPermaLink="false">zsFhqyK2bE4wFSo5zsosPB</guid>
      <description>Kodak's Charmera digital keyring camera comes in a 'blind box' in any one of six colorways, and costs just $30 / &#163;30, which makes it a great gift idea.</description>
    </item>
    <item>
      <title>Snaps new AI search engine will be powered by Perplexity</title>
      <link>https://mashable.com/article/snap-perplexity-ai-chat</link>
      <pubDate>Thu, 06 Nov 2025 13:03:16 +0000</pubDate>
      <guid isPermaLink="false">06dS9pgkGKAiP8bvaaMltFb</guid>
      <description>Snap has partnered with Perplexity AI to make its chat smarter.</description>
    </item>
    <item>
      <title>Casio redesigns an iconic G-Shock model &#8211; with Garmin-style screen tech</title>
      <link>https://www.techradar.com/health-fitness/exercise-equipment/casio-redesigns-an-iconic-g-shock-model-with-garmin-style-screen-tech</link>
      <pubDate>Thu, 06 Nov 2025 13:01:12 +0000</pubDate>
      <guid isPermaLink="false">EaMocUgSzn94psQTjZS4YA</guid>
      <description>The Casio G-Shock GW-BX5600-1 boasts MIP display tech for a better experience in strong sunlight.</description>
    </item>
    <item>
      <title>Les meilleurs casques audio Bluetooth en novembre 2025 &#8211; La s&#233;lection Frandroid</title>
      <link>https://www.frandroid.com/guide-dachat/guide-audio/457173_guide-dachat-les-meilleurs-casques-bluetooth-sans-fil-de-2017</link>
      <pubDate>Thu, 06 Nov 2025 13:00:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-audio/457173_guide-dachat-les-meilleurs-casques-bluetooth-sans-fil-de-2017</guid>
      <description>
Vous ne savez pas quel casque Bluetooth choisir dans cet oc&#233;an de r&#233;f&#233;rences ? Nous avons r&#233;alis&#233; une s&#233;lection des meilleurs casques audio Bluetooth parmi tous ceux que nous avons pu tester.
</description>
    </item>
    <item>
      <title>Matt Smith Is Preparing to Enter &#8216;Star Wars&#8217; Later This Year</title>
      <link>https://gizmodo.com/matt-smith-star-wars-starfighter-filming-2000682336</link>
      <pubDate>Thu, 06 Nov 2025 13:00:07 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682336</guid>
      <description>Plus, Guy Fawkes opens a portal to hell in a new movie.</description>
    </item>
    <item>
      <title>When Thunderstorms Hit, Asthma Can Become an ER Nightmare</title>
      <link>https://gizmodo.com/thunderstorms-could-turn-your-asthma-into-a-nightmare-2000682082</link>
      <pubDate>Thu, 06 Nov 2025 13:00:04 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682082</guid>
      <description>New research is the latest to find that thunderstorms can worsen your odds of a serious seasonal asthma attack.</description>
    </item>
    <item>
      <title>Inception raises $50 million to build diffusion models for code and text</title>
      <link>https://techcrunch.com/2025/11/06/inception-raises-50-million-to-build-diffusion-models-for-code-and-text/</link>
      <pubDate>Thu, 06 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3065477</guid>
      <description>Diffusion models already power AI image generators, but Inception thinks they can be even more powerful applied in software development.</description>
    </item>
    <item>
      <title>Google debuts AI chips with 4X performance boost, secures Anthropic megadeal worth billions</title>
      <link>https://venturebeat.com/ai/google-debuts-ai-chips-with-4x-performance-boost-secures-anthropic-megadeal</link>
      <pubDate>Thu, 06 Nov 2025 13:00:00 GMT</pubDate>
      <guid isPermaLink="false">6UtGh06unalVUB7SjnoKsm</guid>
      <description>Google Cloud is introducing what it calls its most powerful artificial intelligence infrastructure to date, unveiling a seventh-generation Tensor Processing Unit and expanded Arm-based computing options designed to meet surging demand for AI model deployment &#8212; what the company characterizes as a fundamental industry shift from training models to serving them to billions of users.The announcement, made Thursday, centers on Ironwood, Google's latest custom AI accelerator chip, which will become generally available in the coming weeks. In a striking validation of the technology, Anthropic, the AI...</description>
    </item>
    <item>
      <title>This 15-inch MacBook Air M4 has dropped to a new record-low price &#8212; save over $200 at Amazon</title>
      <link>https://mashable.com/article/nov-6-macbook-air-deal</link>
      <pubDate>Thu, 06 Nov 2025 12:54:43 +0000</pubDate>
      <guid isPermaLink="false">07tllMeigOlNFdf2HN9MkGe</guid>
      <description>As of Nov. 6, the 15-inch 2025 MacBook Air (M4, 16GB RAM, 512GB SSD) is on sale at Amazon for $1,149.99. This is 18% off its list price of $1,399 and its lowest-ever price.</description>
    </item>
    <item>
      <title>FAA to reveal the 40 airports that will have fewer flights during the government shutdown</title>
      <link>https://www.fastcompany.com/91436447/faa-reveal-40-airports-that-will-have-fewer-flights-during-government-shutdown</link>
      <pubDate>2025-11-06T12:49:31</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91436447/faa-reveal-40-airports-that-will-have-fewer-flights-during-government-shutdown</guid>
      <description>Experts predict thousands of flights could be canceled.
Travelers through some of the busiest U.S. airports can expect to learn Thursday whether they&#8217;ll see fewer flights as the government shutdown drags into a second month.The Federal Aviation Administration will announce the 40 &#8220;high-volume markets&#8221; where it is reducing flights by 10% before the cuts go into effect Friday, said agency administrator Bryan Bedford. The move is intended to keep the air space safe during the shutdown, the agency said.Experts predict hundreds if not thousands of flights could be canceled. The cuts could represent...</description>
    </item>
    <item>
      <title>Avec l&#8217;arriv&#233;e de la version M5, l&#8217;iPad Pro M4 (11 et 13 pouces) est brad&#233; avec plus de 200 &#8364; de r&#233;duction lors du pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2857491_avec-le-pre-black-friday-et-larrivee-de-la-version-m5-apple-brade-son-bijou-lipad-pro-m4-avec-une-ristourne-de-200-e</link>
      <pubDate>Thu, 06 Nov 2025 12:41:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2857491_avec-le-pre-black-friday-et-larrivee-de-la-version-m5-apple-brade-son-bijou-lipad-pro-m4-avec-une-ristourne-de-200-e</guid>
      <description>
L&#8217;arriv&#233;e du petit fr&#232;re M5 pousse Apple &#224; faire un peu de place dans les rayons&#8230; et dans les prix. L&#8217;iPad Pro M4, ex-fleuron toujours dop&#233; &#224; la puce surpuissante et &#224; l&#8217;&#233;cran OLED &#224; tomber, s&#8217;offre un coup de rabot bien senti : de 1 219 euros, il tombe &#224; 1 009 euros chez Darty pour c&#233;l&#233;brer &#224; la fois le Black Friday et la nouvelle g&#233;n&#233;ration.
</description>
    </item>
    <item>
      <title>Our favorite budget headphones maker just revealed unbelievably cheap open earbuds that might actually sound good</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/our-favorite-budget-headphones-maker-just-revealed-unbelievably-cheap-open-earbuds-that-might-actually-sound-good</link>
      <pubDate>Thu, 06 Nov 2025 12:40:42 +0000</pubDate>
      <guid isPermaLink="false">6LMLMiWhEaxhNEnqfToSeg</guid>
      <description>1More has redesigned its clip-ons with a more secure fit. As ever, they're very aggressively priced.</description>
    </item>
    <item>
      <title>&#171; La Chine finira par l&#8217;emporter &#187;, le CEO de Nvidia Jensen admet la Chine va gagner la guerre de l&#8217;IA</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2857987_la-chine-finira-par-lemporter-le-ceo-de-nvidia-jensen-admet-la-chine-va-gagner-la-guerre-de-lia</link>
      <pubDate>Thu, 06 Nov 2025 12:38:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2857987_la-chine-finira-par-lemporter-le-ceo-de-nvidia-jensen-admet-la-chine-va-gagner-la-guerre-de-lia</guid>
      <description>
Le CEO de Nvidia vient de dire tout haut ce que personne n'osait formuler clairement : la Chine finira par remporter la course &#224; l'IA. Pas &#171; peut-&#234;tre &#187;, pas &#171; si les conditions changent &#187;, non, carr&#233;ment &#171; finira par &#187;. Et ses arguments sont b&#233;ton : pendant que les &#201;tats-Unis s'emp&#234;trent dans leurs restrictions &#224; l'export et leurs p&#233;nuries d'&#233;lectricit&#233;, P&#233;kin construit 29 centrales nucl&#233;aires et subventionne &#224; 50 % l'&#233;nergie de ses data centers IA.
...</description>
    </item>
    <item>
      <title>Huawei Mate 70 Air is a little thick for a thin phone</title>
      <link>https://www.theverge.com/news/815327/huawei-mate-70-air-is-a-little-thick-for-a-thin-phone</link>
      <pubDate>2025-11-06T07:35:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815327</guid>
      <description>Huawei is the latest phone manufacturer to release a thin phone: the Mate 70 Air. That&#8217;s our third Air for the year &#8212; after the iPhone and ZTE&#8217;s Nubia Air &#8212; to only two Edges, suggesting Apple&#8217;s influence still reigns supreme over Samsung&#8217;s. At 6.6mm thick, the Mate 70 Air isn&#8217;t quite as slim as [&#8230;]</description>
    </item>
    <item>
      <title>Confused over Windows 10 bug that wrongly told people they were out of support? It's just been fixed</title>
      <link>https://www.techradar.com/computing/windows/confused-over-windows-10-bug-that-wrongly-told-people-they-were-out-of-support-its-just-been-fixed</link>
      <pubDate>Thu, 06 Nov 2025 12:33:00 +0000</pubDate>
      <guid isPermaLink="false">uhYtHpbuLsUZiabPztTHdb</guid>
      <description>Microsoft admits to confusing bug which told those signed up for Windows 10's extended updates that they were out of support.</description>
    </item>
    <item>
      <title>LG Studio Smart 3-Door French Door Refrigerator Review: Cool Customer</title>
      <link>https://www.wired.com/review/lg-studio-smart-3-door-french-door-refrigerator/</link>
      <pubDate>Thu, 06 Nov 2025 12:30:00 +0000</pubDate>
      <guid isPermaLink="false">69027dde4e7c8c237645e4a5</guid>
      <description>LG&#8217;s design-focused Studio fridge checks a lot of boxes, but you&#8217;ll have to contend with the company&#8217;s spotty reliability record.</description>
    </item>
    <item>
      <title>Consoles, manettes et accessoires : le top 8 des meilleures offres gaming avant le Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2853043_lavant-premiere-du-black-friday-fait-la-part-belle-au-gaming-avec-la-nintendo-switch-2-en-promo-et-bien-dautres</link>
      <pubDate>Thu, 06 Nov 2025 12:29:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2853043_lavant-premiere-du-black-friday-fait-la-part-belle-au-gaming-avec-la-nintendo-switch-2-en-promo-et-bien-dautres</guid>
      <description>
L'ann&#233;e 2025 a &#233;t&#233; on ne peut plus riche pour le jeu vid&#233;o. Outre la sortie de nouveaux titres, la Nintendo Switch 2 a accapar&#233; toute l'attention cet &#233;t&#233; et continue de le faire aujourd'hui. D'autant plus qu'elle fait partie des meilleures offres dans cette s&#233;lection du pr&#233;-Black Friday.
</description>
    </item>
    <item>
      <title>Utilisation de l&#8217;IA par Donald Trump | Des visuels hyperr&#233;alistes et mensongers comme strat&#233;gie de communication</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-11-06/utilisation-de-l-ia-par-donald-trump/des-visuels-hyperrealistes-et-mensongers-comme-strategie-de-communication.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Thu, 06 Nov 2025 07:17:43 -0500</pubDate>
      <guid isPermaLink="false">222e2efbe79a3ac2b7da82940d753108</guid>
      <description>Dans une r&#233;alit&#233; parall&#232;le, Donald Trump est roi, pilote de chasse ou super h&#233;ros tandis que ses adversaires politiques sont d&#233;peints comme des criminels ou des bouffons. Le pr&#233;sident am&#233;ricain use et abuse de l&#8217;imagerie g&#233;n&#233;r&#233;e par intelligence artificielle pour communiquer.</description>
    </item>
    <item>
      <title>The SteelSeries Arctis Nova 7X wireless gaming headset is currently at its lowest ever price in the US, and it's also one of our highest rated options for Xbox players</title>
      <link>https://www.techradar.com/gaming/the-steelseries-arctis-nova-7x-wireless-gaming-headset-is-currently-at-its-lowest-ever-price-in-the-us-and-its-also-one-of-our-highest-rated-options-for-xbox-players</link>
      <pubDate>Thu, 06 Nov 2025 12:13:19 +0000</pubDate>
      <guid isPermaLink="false">sCCHrnZC6PuyUtMDgchKTe</guid>
      <description>Looking for a new Xbox gaming headset? Check out the brilliant SteelSeries Arctis Nova 7X at its lowest ever US price.</description>
    </item>
    <item>
      <title>D&#233;veloppement de l&#8217;IA | La Chine va &#171;&#160;gagner la course&#160;&#187;, avertit le patron de Nvidia</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-11-06/developpement-de-l-ia/la-chine-va-gagner-la-course-avertit-le-patron-de-nvidia.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Thu, 06 Nov 2025 07:11:58 -0500</pubDate>
      <guid isPermaLink="false">d0894907773639909583753551bb4594</guid>
      <description>Le PDG de Nvidia, Jensen Huang,&#160;a averti&#160;mercredi que la Chine allait &#171;&#160;gagner la course&#160;&#187; au d&#233;veloppement de l&#8217;intelligence artificielle de nouvelle g&#233;n&#233;ration, appelant Washington &#224; acc&#233;l&#233;rer ses efforts.</description>
    </item>
    <item>
      <title>Workers are &#8216;gatekeeping&#8217; skills to protect their jobs from being taken by AI</title>
      <link>https://www.techradar.com/pro/workers-are-gatekeeping-skills-to-protect-their-jobs-from-being-taken-by-ai</link>
      <pubDate>Thu, 06 Nov 2025 12:06:00 +0000</pubDate>
      <guid isPermaLink="false">DdPg3QLngAL3rsLD5uF9u8</guid>
      <description>Knowledge workers are gatekeeping skills from colleagues to help them stand out against AI.</description>
    </item>
    <item>
      <title>The Witcher author confirms he has no involvement with The Witcher 4, but says his contract with CD Projekt Red is 'excellent right now'</title>
      <link>https://www.techradar.com/gaming/the-witcher-author-confirms-he-has-no-involvement-with-the-witcher-4-but-says-his-contract-with-cd-projekt-red-is-excellent-right-now</link>
      <pubDate>Thu, 06 Nov 2025 12:04:08 +0000</pubDate>
      <guid isPermaLink="false">2vrrGRWdpdzzBYjHysLZRn</guid>
      <description>The Witcher author Andrzej Sapkowski has confirmed that he isn't assisting CD Projekt Red in the development of The Witcher 4, but says his deal with the studio is "excellent".</description>
    </item>
    <item>
      <title>A new iPhone roadmap just leaked, with spec details of the foldable iPhone and the iPhone Air 2</title>
      <link>https://www.techradar.com/phones/iphone/a-new-iphone-roadmap-just-leaked-with-spec-details-of-the-foldable-iphone-and-the-iphone-air-2</link>
      <pubDate>Thu, 06 Nov 2025 12:03:22 +0000</pubDate>
      <guid isPermaLink="false">xR2ZYhaAEf9d9zuiTR8Pda</guid>
      <description>Next year is shaping up to be a big one for Apple and its iPhone series, and new information has emerged.</description>
    </item>
    <item>
      <title>The IBM deal that sparked Microsoft&#8217;s rise to prominence</title>
      <link>https://www.techradar.com/pro/the-ibm-deal-that-sparked-microsofts-rise-to-prominence</link>
      <pubDate>Thu, 06 Nov 2025 12:02:00 +0000</pubDate>
      <guid isPermaLink="false">zDP5pnK2aSSvLGbMF6GNGD</guid>
      <description>Microsoft's landmark deal to deliver an operating system for IBM changed the face of tech.</description>
    </item>
    <item>
      <title>Rian Johnson Loved All Your &#8216;Last Jedi&#8217; Reactions, Actually</title>
      <link>https://gizmodo.com/rian-johnson-star-wars-the-last-jedi-reactions-2000682176</link>
      <pubDate>Thu, 06 Nov 2025 12:00:12 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682176</guid>
      <description>The 'Star Wars' director spoke about his feelings on the wildly polarizing reactions to 'The Last Jedi.'</description>
    </item>
    <item>
      <title>Ikea's Smart Home Reset Goes Back to Basics</title>
      <link>https://www.wired.com/story/ikeas-smart-home-reset-goes-back-to-basics/</link>
      <pubDate>Thu, 06 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">690c6b5add3f5303ab4b7988</guid>
      <description>Ikea&#8217;s new 21-product series of bulbs, sensors, and remotes is dirt cheap, idiot-proof, Matter-ready, and designed to work with everything. But it's still years from the promised house of the future.</description>
    </item>
    <item>
      <title>Diaspora Cookbooks Hit Their Heyday</title>
      <link>https://www.wired.com/gallery/the-best-diaspora-cookbooks/</link>
      <pubDate>Thu, 06 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">690953e2122a248415a3b7dc</guid>
      <description>Six new cookbooks bring stellar dishes&#8212;and cultures&#8212;from around the world into your kitchen.</description>
    </item>
    <item>
      <title>The Czinger 21C is a halo car for the future military-industrial complex</title>
      <link>https://www.theverge.com/transportation/813227/czinger-21c-hypercar-divergent-3d-manufacturing</link>
      <pubDate>2025-11-06T07:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=813227</guid>
      <description>Countless cars have received military-grade marketing over the years, their performances likened to some form of ordnance or another. Saab was notorious for leaning on its aeronautical origins, and it's hard to imagine what kind of state Jeep would be in today without literally parading its olive drab roots at every opportunity. But not since [&#8230;]</description>
    </item>
    <item>
      <title>Ikea&#8217;s new smart home collection is entirely Matter-compatible</title>
      <link>https://www.theverge.com/news/814241/ikea-smart-home-matter-thread-lights-sensors-remote-control</link>
      <pubDate>2025-11-06T07:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814241</guid>
      <description>Ikea announced 21 new Matter-over-Thread devices that can &#8220;connect with a wider range of devices and platforms, making it easier for customers to build a smart home across different brands.&#8221; The collection includes both entirely new products and updates to existing offerings introducing new functionality and features. The new collection was teased by Ikea&#8217;s David [&#8230;]...</description>
    </item>
    <item>
      <title>Will Tesla shareholders vote to make Elon Musk the first trillionaire?</title>
      <link>https://www.theverge.com/transportation/814907/tesla-shareholder-elon-musk-trillionaire-vote</link>
      <pubDate>2025-11-06T07:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814907</guid>
      <description>On Thursday, Tesla shareholders will vote on whether to grant Elon Musk an enormous pay package, the largest ever awarded to a chief executive by orders of magnitude, or risk him leaving the company in a huff. If this sounds weirdly familiar, it's because the same thing unfolded nearly a year ago. At the 2024 [&#8230;]</description>
    </item>
    <item>
      <title>Ikea&#8217;s new low-cost line is a huge win for Matter and your smart home</title>
      <link>https://www.theverge.com/tech/814928/ikea-matter-thread-dirigera-smart-home-interview</link>
      <pubDate>2025-11-06T07:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814928</guid>
      <description>Ikea just announced a bunch of super cheap, colorful Matter-over-Thread devices that will work with any platform, and it feels like Christmas came early for the smart home. The 21 new products include a line of smart bulbs starting at just &#163;4 and two new remote controls that start at just &#163;3 (US pricing is [&#8230;]</description>
    </item>
    <item>
      <title>How to watch Celebrity Race Across the World season 3 &#8212; free streams from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/celebrity-race-across-the-world-season-3-free</link>
      <pubDate>Thu, 06 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">LRSXhsS4XL9oSksC2QGLoM</guid>
      <description>Anita Rani, Dylan Llewellyn, Molly Rainford, Tyler West and Roman Kemp traverse Central America. Here's how to watch Celebrity Race Across the World season 3 online.</description>
    </item>
    <item>
      <title>Ikea&#8217;s revamped 21-piece smart home range is about to make your life a lot easier</title>
      <link>https://www.fastcompany.com/91435623/ikea-smart-home-range-is-here</link>
      <pubDate>2025-11-06T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91435623/ikea-smart-home-range-is-here</guid>
      <description>Bulbs with more color and light options, new sensors and controls, and a plug that makes any &#8216;dumb&#8217; appliance smarter.
Ikea is ready to begin overhauling its smart home products.</description>
    </item>
    <item>
      <title>&#171; Une mode passag&#232;re &#187; : pourquoi les voitures &#233;lectriques divisent autant les Fran&#231;ais</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2857407_une-mode-passagere-pourquoi-les-voitures-electriques-divisent-autant-les-francais</link>
      <pubDate>Thu, 06 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2857407_une-mode-passagere-pourquoi-les-voitures-electriques-divisent-autant-les-francais</guid>
      <description>
Une vaste enqu&#234;te autour de la voiture &#233;lectrique prouve encore une chose : m&#234;me si sa perception g&#233;n&#233;rale s'am&#233;liore, les fractures g&#233;n&#233;rationnelles et g&#233;ographiques restent bien pr&#233;sentes. Les inqui&#233;tudes persistent... mais sont de moins en moins justifi&#233;es.
</description>
    </item>
    <item>
      <title>I'm exhausted by incessant Windows 11 bugs - and the return of the BitLocker recovery glitch is an ugly sight</title>
      <link>https://www.techradar.com/computing/windows/im-exhausted-by-incessant-windows-11-bugs-and-the-return-of-the-bitlocker-recovery-glitch-is-an-ugly-sight</link>
      <pubDate>Thu, 06 Nov 2025 11:57:27 +0000</pubDate>
      <guid isPermaLink="false">b4hh5Zexm9CTzxB82MGtQP</guid>
      <description>Windows 11 and 10 have previously faced BitLocker issues - and another glitch has now reared its head.</description>
    </item>
    <item>
      <title>C&#8217;est la plus petite cl&#233; USB-C 1 To au monde avec ces capacit&#233;s</title>
      <link>https://www.frandroid.com/produits-android/hardware/stockage/2857951_cest-la-plus-petite-cle-usb-c-1-to-au-monde-avec-ces-capacites</link>
      <pubDate>Thu, 06 Nov 2025 11:56:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/stockage/2857951_cest-la-plus-petite-cle-usb-c-1-to-au-monde-avec-ces-capacites</guid>
      <description>
SanDisk vient de r&#233;soudre un probl&#232;me vieux de 20 ans : les cl&#233;s USB qui d&#233;passent et qui cassent. Leur nouvelle Extreme Fit USB-C (1 To, 400 Mo/s) mesure &#224; peine 18,5 mm de long et ne d&#233;passe pratiquement pas des ordinateurs portables gr&#226;ce &#224; son format vertical.
</description>
    </item>
    <item>
      <title>Google Maps upgrades navigation in India with Gemini, safety alerts</title>
      <link>https://techcrunch.com/2025/11/06/google-maps-upgrades-navigation-in-india-with-gemini-safety-alerts/</link>
      <pubDate>Thu, 06 Nov 2025 11:56:51 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3065585</guid>
      <description>India becomes the second market after the U.S. to get Gemini-powered navigation on Google Maps.</description>
    </item>
    <item>
      <title>Vibe coding is Collins Dictionarys word of 2025</title>
      <link>https://mashable.com/article/vibe-coding-word-of-the-year</link>
      <pubDate>Thu, 06 Nov 2025 11:56:29 +0000</pubDate>
      <guid isPermaLink="false">06yHcDqrccjRkzuLOUO9oH9</guid>
      <description>It's been one of the biggest internet terms of the year, and now it's official: "vibe coding" is Collins Dictionary's word of 2025.</description>
    </item>
  </channel>
</rss>
