<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 29 Jan 2026 17:40:38 GMT</lastBuildDate>
    <item>
      <title>Spotify has a group messaging feature now</title>
      <link>https://www.engadget.com/entertainment/streaming/spotify-has-a-group-messaging-feature-now-173734450.html?src=rss</link>
      <pubDate>Thu, 29 Jan 2026 17:37:34 +0000</pubDate>
      <guid isPermaLink="false">20844f9b-b9cf-4b21-a2cf-399cfdcb579f</guid>
      <description>Spotify is adding group chats to the messaging service it premiered last year. In an addendum to the original blog post introducing Messages, the company announced that users can initiate chats with up to 10 of their friends to share the podcasts, playlists and songs they are listening to.
The in-app messaging feature, which was released last August, works to keep users on the app instead of navigating to another platform to share content with friends. Since its introduction, Spotify has added functionality bit by bit. Earlier this month, the company added the ability to share what you're list...</description>
    </item>
    <item>
      <title>Spotify&amp;#8217;s new group chats share music with everyone in your circle</title>
      <link>https://www.theverge.com/news/870288/spotify-group-chats-direct-messaging-expansion</link>
      <pubDate>2026-01-29T12:36:13-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=870288</guid>
      <description>Spotify is expanding its in-app messaging feature with group chats. Now you can add up to 10 friends and family members to your discussion about your new favorite song, podcast, or audiobook, as reported earlier by TechCrunch. The music streaming platform launched direct messaging last August, allowing you to share what you're listening to without [&#8230;]...</description>
    </item>
    <item>
      <title>How I reclaimed 5+ hours a week &#8212; my 12 essential productivity tools of 2026</title>
      <link>https://www.techradar.com/shop/pro/how-i-reclaimed-5-hours-a-week-my-12-essential-productivity-tools</link>
      <pubDate>Thu, 29 Jan 2026 17:31:09 +0000</pubDate>
      <guid isPermaLink="false">ffwuy3FK5fmXoZg64VhRA9</guid>
      <description>Spare time feels like a luxury in 2026, I used these productivity tools to reclaim hours every week. Now I'm not sure what to do with that time.</description>
    </item>
    <item>
      <title>Graines, capteurs, plats fran&#231;ais : le contenu surprenant des bagages de Sophie Adenot pour la Station spatiale</title>
      <link>https://www.futura-sciences.com/sciences/actualites/sophie-adenot-graines-capteurs-plats-francais-contenu-surprenant-bagages-sophie-adenot-station-spatiale-130273/#xtor%3DRSS-8</link>
      <pubDate>Thu, 29 Jan 2026 18:29:43 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/sophie-adenot-graines-capteurs-plats-francais-contenu-surprenant-bagages-sophie-adenot-station-spatiale-130273/#xtor%3DRSS-8</guid>
      <description>Que met-on dans sa valise quand on part huit mois dans l&#8217;espace ? Pour sa toute premi&#232;re mission &#224; bord de l&#8217;ISS, Sophie Adenot, premi&#232;re femme astronaute fran&#231;aise depuis Claudie Haigner&#233;, n&#8217;emportera pas seulement des effets personnels. Graines &#224; faire germer, capteurs m&#233;dicaux, exp&#233;riences de...</description>
    </item>
    <item>
      <title>I built marshmallow castles in Google&#8217;s new AI world generator</title>
      <link>https://techcrunch.com/2026/01/29/i-built-marshmallow-castles-in-googles-new-ai-world-generator-project-genie/</link>
      <pubDate>Thu, 29 Jan 2026 17:29:11 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3087840</guid>
      <description>Starting Thursday, Google AI Ultra subscribers in the U.S. can play around with Project Genie, which is powered by a combination of Google&#8217;s latest world model Genie 3, its image generation model Nano Banana Pro, and Gemini.</description>
    </item>
    <item>
      <title>The Age of the Most Distant Galaxy Ever Seen Barely Makes Any Sense</title>
      <link>https://gizmodo.com/the-age-of-the-most-distant-galaxy-ever-seen-barely-makes-any-sense-2000715503</link>
      <pubDate>Thu, 29 Jan 2026 17:25:03 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715503</guid>
      <description>The light from MoM-z14 galaxy has been traveling through space for about 13.5 billion years.</description>
    </item>
    <item>
      <title>Samsung veut remplacer le papier avec cet &#233;cran en plancton</title>
      <link>https://www.frandroid.com/marques/samsung/2960595_samsung-veut-remplacer-le-papier-avec-cet-ecran-en-plancton</link>
      <pubDate>Thu, 29 Jan 2026 17:19:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2960595_samsung-veut-remplacer-le-papier-avec-cet-ecran-en-plancton</guid>
      <description>
Samsung vient de pr&#233;senter un produit pour le moins insolite : un &#233;cran Color E-Paper de 13 pouces. Sa particularit&#233; ? Il abandonne le plastique traditionnel pour une bio-r&#233;sine issue du phytoplancton.
</description>
    </item>
    <item>
      <title>Forfait Free 2&#8364; : l&#8217;option illimit&#233;e devient enfin la norme (et c&#8217;est gratuit)</title>
      <link>https://www.01net.com/actualites/forfait-free-2e-loption-illimitee-devient-enfin-la-norme-et-cest-gratuit.html</link>
      <pubDate>Thu, 29 Jan 2026 17:17:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323292</guid>
      <description>Free Mobile revoit sa copie pour son offre historique. Le forfait 2&#8364; int&#232;gre d&#233;sormais par d&#233;faut l'option booster 1 Go et les appels illimit&#233;s, sans surco&#251;t. Une modernisation n&#233;cessaire.</description>
    </item>
    <item>
      <title>RAM is the new gold &#8211; why Costco is pulling memory from display PCs to halt a shoplifting surge</title>
      <link>https://www.techradar.com/computing/memory/ram-is-the-new-gold-why-costco-is-pulling-memory-from-display-pcs-to-halt-a-shoplifting-surge</link>
      <pubDate>Thu, 29 Jan 2026 17:16:28 +0000</pubDate>
      <guid isPermaLink="false">hus7mhXdmgFXvmeH9iyEMo</guid>
      <description>It used to be GPUs that might be shoplifted from display PCs on retailer shelves &#8211; now it's high-end RAM.</description>
    </item>
    <item>
      <title>2026 Is About to Be a Blockbuster Year for Smart Glasses</title>
      <link>https://gizmodo.com/2026-is-about-to-be-a-blockbuster-year-for-smart-glasses-2000715511</link>
      <pubDate>Thu, 29 Jan 2026 17:15:23 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715511</guid>
      <description>Heated competition, legal drama, and the future of tech on the line? Start writing the movie now, I guess.</description>
    </item>
    <item>
      <title>Fake Moltbot AI assistant just spreads malware - so AI fans, watch out for scams</title>
      <link>https://www.techradar.com/pro/security/fake-moltbot-ai-assistant-just-spreads-malware-so-ai-fans-watch-out-for-scams</link>
      <pubDate>Thu, 29 Jan 2026 17:10:00 +0000</pubDate>
      <guid isPermaLink="false">6zemN2xqba5n8zwohqAxi5</guid>
      <description>Crooks are impersonating popular Moltbot AI assistant to deploy trojan malware, so be on your guard.</description>
    </item>
    <item>
      <title>Is it finally happening? Ubisoft appears to respond to new Assassin's Creed: Black Flag remake leak with everyone's favorite GTA meme</title>
      <link>https://www.techradar.com/gaming/is-it-finally-happening-ubisoft-appears-to-respond-to-new-assassins-creed-black-flag-remake-leak-with-everyones-favorite-gta-meme</link>
      <pubDate>Thu, 29 Jan 2026 17:06:24 +0000</pubDate>
      <guid isPermaLink="false">DLvZhHXXvfxaWbsFgde8rn</guid>
      <description>Ubisoft has finally acknowledged the ongoing Assassin's Creed: Black Flag remake rumors with a GTA meme after another leak appeared online.</description>
    </item>
    <item>
      <title>15 genius Amazon tech finds under $40 that will make everyday life easier &#8212; shop deals starting at just $7.99</title>
      <link>https://www.techradar.com/tech/15-genius-amazon-tech-finds-under-usd40-that-will-make-everyday-life-easier-shop-deals-starting-at-just-usd7-99</link>
      <pubDate>Thu, 29 Jan 2026 17:05:38 +0000</pubDate>
      <guid isPermaLink="false">fXxXkm9BzZATcqopwSHtRc</guid>
      <description>I'm rounding up my 15 favorite cheap tech gadgets from Amazon that will make your everyday life easier without breaking the bank.</description>
    </item>
    <item>
      <title>Stop paying full price for Photoshop: Adobe slashes Creative Cloud Pro subscriptions by 40% for your first year</title>
      <link>https://www.techradar.com/pro/stop-paying-full-price-for-photoshop-adobe-slashes-creative-cloud-pro-subscriptions-by-40-percent-for-your-first-year</link>
      <pubDate>Thu, 29 Jan 2026 17:02:22 +0000</pubDate>
      <guid isPermaLink="false">RdjfwjWY2VMBCGsuy5ooSj</guid>
      <description>If you're a creator, these Adobe deals are worth definitely checking out.</description>
    </item>
    <item>
      <title>&#8216;Inception&#8217; and &#8216;The Incredibles&#8217; Among 2025&#8217;s National Film Registry Inductees</title>
      <link>https://gizmodo.com/national-film-registry-library-of-congress-inception-the-thing-2000715469</link>
      <pubDate>Thu, 29 Jan 2026 17:00:38 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715469</guid>
      <description>The Library of Congress deemed 'Inception', the original 'Karate Kid', and 'The Thing' worth preserving for their 'cultural, historic, or aesthetic importance.'</description>
    </item>
    <item>
      <title>An AI Toy Exposed 50,000 Logs of Its Chats With Kids to Anyone With a Gmail Account</title>
      <link>https://www.wired.com/story/an-ai-toy-exposed-50000-logs-of-its-chats-with-kids-to-anyone-with-a-gmail-account/</link>
      <pubDate>Thu, 29 Jan 2026 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">6978fda85780318e8dc1728c</guid>
      <description>AI chat toy company Bondu left its web console almost entirely unprotected. Researchers who accessed it found nearly all the conversations children had with the company's stuffed animals.</description>
    </item>
    <item>
      <title>Half of developers think gen AI is bad for the gaming industry</title>
      <link>https://www.theverge.com/entertainment/869386/ai-game-development-gdc-survey</link>
      <pubDate>2026-01-29T12:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=869386</guid>
      <description>While generative AI is being adopted at various levels of game development, a new survey suggests that developers increasingly think the technology is bad for the industry. According to the most recent survey from the Game Developers Conference, 52 percent of respondents said that gen AI is having a "negative" impact on the games industry, [&#8230;]</description>
    </item>
    <item>
      <title>Google&#8217;s AI helped me make bad Nintendo knockoffs</title>
      <link>https://www.theverge.com/news/869726/google-ai-project-genie-3-world-model-hands-on</link>
      <pubDate>2026-01-29T12:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=869726</guid>
      <description>This week, a new generative AI tool from Google let me create bad knockoffs of 3D Nintendo worlds. Check out my version of something like Super Mario 64: I didn't like Metroid Prime 4: Beyond, but it's better than my version of a Metroid Prime experience: Or how about my take on The Legend of [&#8230;]</description>
    </item>
    <item>
      <title>Microsoft is working to rebuild trust in Windows</title>
      <link>https://www.theverge.com/tech/870045/microsoft-windows-11-issues-rebuilding-trust-notepad</link>
      <pubDate>2026-01-29T12:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=870045</guid>
      <description>Windows is in a weird spot. In its 40-year history, the operating system has weathered its fair share of missteps, but Windows 11 is testing the patience of its users in new ways. Persistent bugs, performance issues, intrusive prompts, ads, and bloatware have eroded the core Windows experience. Early system requirement decisions have also damaged [&#8230;]...</description>
    </item>
    <item>
      <title>Waymo is finally starting passenger trips at SFO &#8212;&#160;but not to the terminals</title>
      <link>https://www.theverge.com/news/870102/waymo-sfo-passenger-trip-approval-airport</link>
      <pubDate>2026-01-29T12:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=870102</guid>
      <description>Waymo has finally broken through its SFO logjam. The company announced today that it will start offering robotaxi rides to a select group of passengers traveling to and from the San Francisco International Airport, a major step in Waymo's effort to increase its footprint in the Bay Area. The company plans on gradually growing the [&#8230;]</description>
    </item>
    <item>
      <title>Une sym&#233;trie trop parfaite pour &#234;tre naturelle ? Ce cercle g&#233;ant d&#233;range la science</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-symetrie-trop-parfaite-etre-naturelle-ce-cercle-geant-derange-science-w2t8-130536/#xtor%3DRSS-8</link>
      <pubDate>Thu, 29 Jan 2026 18:00:00 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-symetrie-trop-parfaite-etre-naturelle-ce-cercle-geant-derange-science-w2t8-130536/#xtor%3DRSS-8</guid>
      <description>Cet objet vient d&#8217;&#234;tre d&#233;couvert dans les donn&#233;es de&#160;l&#8217;Australian Square Kilometre Array Pathfinder (Askap). Et sa forme presque parfaitement sph&#233;rique d&#233;route les astronomes.</description>
    </item>
    <item>
      <title>Quelle est la meilleure voiture Tesla &#224; choisir en 2026&#8201;?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-survoltes/guides-dachat-voitures/1333657_quelle-est-la-meilleure-tesla-a-choisir</link>
      <pubDate>Thu, 29 Jan 2026 16:59:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-survoltes/guides-dachat-voitures/1333657_quelle-est-la-meilleure-tesla-a-choisir</guid>
      <description>
Si la marque Tesla vous attire, mais que vous avez du mal &#224; vous y retrouver entre les diff&#233;rentes versions disponibles, ce guide est fait pour vous. D&#233;couvrez les diff&#233;rents v&#233;hicules de la gamme pour y voir plus clair et d&#233;terminer quelle Tesla choisir.
</description>
    </item>
    <item>
      <title>Derni&#232;re d&#233;marque des soldes d&#8217;hiver : les 50 meilleures offres &#224; ne surtout pas rater</title>
      <link>https://www.frandroid.com/bons-plans/2957561_les-meilleures-offres-tombent-pour-la-derniere-demarque-des-soldes-dhiver-voici-le-top-25</link>
      <pubDate>Thu, 29 Jan 2026 16:59:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2957561_les-meilleures-offres-tombent-pour-la-derniere-demarque-des-soldes-dhiver-voici-le-top-25</guid>
      <description>
Il ne faut pas se le cacher, la derni&#232;re d&#233;marque des soldes est souvent le moment o&#249; l'on trouve les meilleures offres, car les e-commer&#231;ants comme Amazon, Fnac, Darty ou encore Boulanger veulent &#233;couler les derniers stocks. Avec cet article, vous serez s&#251;rs de ne manquer aucun deal Tech int&#233;ressant. 
</description>
    </item>
    <item>
      <title>Shit&#8217;s Getting Real: NASA Aims for Artemis 2 Fueling Test on Saturday</title>
      <link>https://gizmodo.com/shits-getting-real-nasa-aims-for-artemis-2-fueling-test-on-saturday-2000715590</link>
      <pubDate>Thu, 29 Jan 2026 16:55:15 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715590</guid>
      <description>The agency has bumped up the wet dress rehearsal to increase its chances of launching within the February window, but could an Arctic blast interfere?</description>
    </item>
    <item>
      <title>Google Maps devient encore plus pratique &#224; v&#233;lo gr&#226;ce &#224; cette nouvelle int&#233;gration Gemini</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2960489_google-maps-devient-encore-plus-rapide-a-velo-grace-a-cette-nouvelle-integration-gemini</link>
      <pubDate>Thu, 29 Jan 2026 16:50:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2960489_google-maps-devient-encore-plus-rapide-a-velo-grace-a-cette-nouvelle-integration-gemini</guid>
      <description>
L&#8217;int&#233;gration pouss&#233;e de l'IA Gemini dans Google Maps ouvre la possibilit&#233; de demander des t&#226;ches ou d&#8217;ajouter une &#233;tape &#224; v&#233;lo sans l&#226;cher le guidon. Si cela semble &#234;tre disponible sur iOS, il faudra attendre pour les utilisateurs d&#8217;Android.
</description>
    </item>
    <item>
      <title>On a vu le Xgimi Titan Noir&#160;: le vid&#233;oprojecteur qui promet des contrastes ph&#233;nom&#233;naux</title>
      <link>https://www.01net.com/actualites/on-a-vu-le-xgimi-titan-noir-le-videoprojecteur-qui-promet-des-contrastes-phenomenaux.html</link>
      <pubDate>Thu, 29 Jan 2026 16:50:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323305</guid>
      <description>Apr&#232;s un Titan ambitieux qui visait d&#233;j&#224; le segment semi-pro, Xgimi d&#233;cline son vid&#233;oprojecteur phare dans une version &#171;&#8239;Noir&#8239;&#187; cens&#233;e pousser plus loin le contraste et la pr&#233;cision des couleurs. Nous avons pu le voir &#224; Paris avant sa sortie pr&#233;vue &#224; l&#8217;&#233;t&#233;&#8239;2026. le Titan&#8239;Noir promet une image encore plus spectaculaire gr&#226;ce &#224; un taux de contraste annonc&#233; &#224; 10&#8239;000:1. De quoi justifier ses concessions techniques &#233;videntes par rapport au Titan&#8239;? Premi&#232;res impressions....</description>
    </item>
    <item>
      <title>OpenAI&#8217;s Sora app is struggling after its stellar launch</title>
      <link>https://techcrunch.com/2026/01/29/openais-sora-app-is-struggling-after-its-stellar-launch/</link>
      <pubDate>Thu, 29 Jan 2026 16:48:44 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3087814</guid>
      <description>Sora's mobile app downloads fell 45% in January, and consumer spending dropped.</description>
    </item>
    <item>
      <title>Linux gaming developers join forces to form the Open Gaming Collective</title>
      <link>https://www.theverge.com/tech/870159/linux-gaming-open-gaming-collective-bazzite</link>
      <pubDate>2026-01-29T11:36:51-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=870159</guid>
      <description>Gaming on Linux has already come a long way over recent years, with improvements to Valve's Proton and more gamers switching to Linux, but the newly-formed Open Gaming Collective (OGC) is aiming to take it even further. Universal Blue, developer of the gaming-focused Linux distribution Bazzite, announced on Wednesday that its helping to form the [&#8230;]...</description>
    </item>
    <item>
      <title>&#8216;Hardware launches will ramp up&#8217;: Sonos is apparently ready to release new products throughout 2026, after a year of cancelations and no-shows</title>
      <link>https://www.techradar.com/audio/multi-room/hardware-launches-will-ramp-up-sonos-is-apparently-ready-to-release-new-products-throughout-2026-after-a-year-of-cancelations-and-no-shows</link>
      <pubDate>Thu, 29 Jan 2026 16:34:29 +0000</pubDate>
      <guid isPermaLink="false">chn7jFF8B7FsN2DPfriKDe</guid>
      <description>Sonos reportedly plans multiple hardware launches throughout 2026.</description>
    </item>
    <item>
      <title>143-Year-Old Shipwreck Emerges on a New Jersey Beach</title>
      <link>https://gizmodo.com/143-year-old-shipwreck-emerges-on-a-new-jersey-beach-2000715512</link>
      <pubDate>Thu, 29 Jan 2026 16:30:59 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715512</guid>
      <description>The unfortunate ship, along with its cargo of oranges, sank in 1890 while en route to New York City.</description>
    </item>
    <item>
      <title>Music publishers sue Anthropic for $3B over &#8216;flagrant piracy&#8217; of 20,000 works</title>
      <link>https://techcrunch.com/2026/01/29/music-publishers-sue-anthropic-for-3b-over-flagrant-piracy-of-20000-works/</link>
      <pubDate>Thu, 29 Jan 2026 16:30:29 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3087790</guid>
      <description>Originally, these music publishers had filed a lawsuit against Anthropic over its use of about 500 copyrighted works.</description>
    </item>
    <item>
      <title>What Netflix&amp;#8217;s Warner Bros. deal could mean for TVs and remotes</title>
      <link>https://www.theverge.com/column/869847/warner-bros-netflix-remote</link>
      <pubDate>2026-01-29T11:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=869847</guid>
      <description>This is Lowpass by Janko Roettgers, a newsletter on the ever-evolving intersection of tech and entertainment, syndicated just for The Verge subscribers once a week. If you're in the market for a new TV, you'll have plenty of different options these days, ranging from display technologies (OLED vs. QLED vs. micro RGB) to styles (shiny [&#8230;]</description>
    </item>
    <item>
      <title>L&#8217;industrie du jeu vid&#233;o commence &#224; prendre Linux au s&#233;rieux</title>
      <link>https://www.01net.com/actualites/lindustrie-du-jeu-video-commence-a-prendre-linux-au-serieux.html</link>
      <pubDate>Thu, 29 Jan 2026 16:21:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323353</guid>
      <description>On assiste &#224; une v&#233;ritable offensive en faveur du jeu sur Linux. La boutique GOG pr&#233;voit le support de la plateforme libre, Nvidia vient de lancer un client d&#233;di&#233; pour GeForce Now, et une nouvelle initiative regroupe plusieurs grands acteurs sous une m&#234;me banni&#232;re afin d'acc&#233;l&#233;rer et d'am&#233;liorer la prise en charge des jeux sur Linux.</description>
    </item>
    <item>
      <title>Pok&#233;mon Legends: Z-A is 20 percent off at Best Buy today only</title>
      <link>https://www.theverge.com/gadgets/870030/pokemon-legends-za-switch-2-apple-airtags-deal-sale</link>
      <pubDate>2026-01-29T11:18:16-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=870030</guid>
      <description>If you&#8217;ve been considering picking up the latest Pok&#233;mon game for the Switch 2, there&#8217;s good reason to do it today, as Best Buy is knocking $14 off the physical version. Pok&#233;mon Legends: Z-A normally costs $69.99, but you can snag it for $55.99 for the rest of the day &#8212; a price that other [&#8230;]</description>
    </item>
    <item>
      <title>Tomodachi Life: Living the Dream gets an official launch date for Nintendo Switch and Switch 2 alongside a hilariously chaotic trailer</title>
      <link>https://www.techradar.com/gaming/nintendo/tomodachi-life-living-the-dream-gets-an-official-launch-date-for-nintendo-switch-and-switch-2-alongside-a-hilariously-chaotic-trailer</link>
      <pubDate>Thu, 29 Jan 2026 16:18:08 +0000</pubDate>
      <guid isPermaLink="false">JWJVrQ8CqyLskND4xgAu2G</guid>
      <description>Nintendo has released a brand new gameplay overview for Tomodachi Life: Living the Dream, alongside an April 16 release date for the Switch and Switch 2.</description>
    </item>
    <item>
      <title>Garmin Connect is breaking smartwatches for iPhone users, but these fixes have worked for some</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/garmin-connect-is-breaking-smartwatches-on-ios-but-these-fixes-have-worked-for-some</link>
      <pubDate>Thu, 29 Jan 2026 16:17:46 +0000</pubDate>
      <guid isPermaLink="false">sjmZNnEiAjKCXniW8rUA3</guid>
      <description>A Garmin Connect update has caused some wearables to disconnect from iOS devices, but there might be a fix.</description>
    </item>
    <item>
      <title>Can Xbox Outlast the AI Bubble?</title>
      <link>https://gizmodo.com/can-xbox-outlast-the-ai-bubble-2000715526</link>
      <pubDate>Thu, 29 Jan 2026 16:15:23 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715526</guid>
      <description>Microsoft is pouring money into AI, but Xbox is dragging down the company's entire hardware business.</description>
    </item>
    <item>
      <title>Nvidia&#8217;s Campaign to Sell AI Chips to China Finally Pays Off</title>
      <link>https://www.wired.com/story/made-in-china-china-nvidia-h200-beijing-approval/</link>
      <pubDate>Thu, 29 Jan 2026 16:10:53 +0000</pubDate>
      <guid isPermaLink="false">697a6ff734d8eaf7d47f8800</guid>
      <description>Beijing reportedly approved the sale of hundreds of thousands of Nvidia H200 chips to Chinese AI companies&#8212;the culmination of a dramatic shift in US tech policy.</description>
    </item>
    <item>
      <title>DJI in disguise? These drone and action cam lookalikes are appearing on Amazon US &#8212; and I'm not surprised</title>
      <link>https://www.techradar.com/cameras/drones/dji-in-disguise-these-drone-and-action-cam-lookalikes-are-appearing-on-amazon-us-and-im-not-surprised</link>
      <pubDate>Thu, 29 Jan 2026 16:10:48 +0000</pubDate>
      <guid isPermaLink="false">yGQaKShNd9UJM6Q55sfruW</guid>
      <description>DJI may be using shell companies in an attempt to sell its camera and drone technology to consumers in the US</description>
    </item>
    <item>
      <title>Deezer opens its AI music detection tool to other platforms</title>
      <link>https://www.theverge.com/news/870186/deezer-ai-music-detection-commercially-available</link>
      <pubDate>2026-01-29T11:07:53-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=870186</guid>
      <description>The music streaming service Deezer is giving other companies access to its AI song-detecting tool. The tool, which identifies, tags, and excludes AI-generated music from algorithmic recommendations, is now available for businesses to purchase and use, according to an announcement on Wednesday. Deezer launched its AI music detection tool last year as part of efforts [&#8230;]...</description>
    </item>
    <item>
      <title>Don't miss these payday Dell laptop deals - Amazon just price-cut my favourite laptops for business professionals and students</title>
      <link>https://www.techradar.com/pro/dont-miss-these-payday-dell-laptop-deals-amazon-just-price-cut-my-favourite-laptops-for-business-professionals-and-students</link>
      <pubDate>Thu, 29 Jan 2026 16:06:18 +0000</pubDate>
      <guid isPermaLink="false">HpijAWDo64gQ7KPmm59dUj</guid>
      <description>January may be nearly over but it's not too late to kick start your 2026 productivity with a new laptop with these time-limited Dell Deal Days offers.</description>
    </item>
    <item>
      <title>Doctors Kept a Man Alive Without Lungs for 2 Days</title>
      <link>https://gizmodo.com/doctors-kept-a-man-alive-without-lungs-for-2-days-2000715481</link>
      <pubDate>Thu, 29 Jan 2026 16:00:28 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715481</guid>
      <description>The team's total artificial lung system, or TAL, bought the man precious time until a double lung transplant was viable.</description>
    </item>
    <item>
      <title>SS Rajamouli&#8217;s &#8216;RRR&#8217; Follow Up Is Coming Next Year</title>
      <link>https://gizmodo.com/ss-rajamoulis-rrr-follow-up-is-coming-next-year-2000715186</link>
      <pubDate>Thu, 29 Jan 2026 16:00:15 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715186</guid>
      <description>'Varanasi,' starring Mahesh Babu and Priyanka Chopra-Jonas, finally has a release date.</description>
    </item>
    <item>
      <title>The rise of the slopagandist</title>
      <link>https://www.theverge.com/news/869824/right-wing-influencers-nick-shirley-slopaganda</link>
      <pubDate>2026-01-29T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=869824</guid>
      <description>The violent federal occupation of Minneapolis - and the subsequent killings of two residents at the hands of immigration agents - began with a vlog. Nick Shirley, a roving 23-year-old with a smartphone and a taste for outrage, made a YouTube video with unfounded allegations of fraud at daycares operated by the local Somali American [&#8230;]</description>
    </item>
    <item>
      <title>How big is too big for a new Super Bowl TV? Use our tool to find the perfect size, and get the best buy for your budget</title>
      <link>https://www.techradar.com/televisions/how-big-is-too-big-for-a-new-super-bowl-tv-use-our-tool-to-find-the-perfect-size-and-get-the-best-buy-for-your-budget</link>
      <pubDate>Thu, 29 Jan 2026 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">mLmiuXVdV2MgafwNpNLcJj</guid>
      <description>Find the idea TV for your setup &#8211; even if you want to go REALLY big with it</description>
    </item>
    <item>
      <title>The Apprentice Season 20 Free Streams: How to watch online from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/the-apprentice-season-20-free</link>
      <pubDate>Thu, 29 Jan 2026 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">MprxeL8H4B8Qcgvv4N9Tfi</guid>
      <description>Here's how you can watch The Apprentice season 20 online from anywhere in the world as Lord Sugar puts a new batch of candidates through their paces.</description>
    </item>
    <item>
      <title>Workers fear this even more than burnout</title>
      <link>https://www.fastcompany.com/91482720/workers-fear-this-even-more-than-burnout</link>
      <pubDate>2026-01-29T16:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91482720/workers-fear-this-even-more-than-burnout</guid>
      <description>A new Indeed survey found that a third of workers are concerned that AI will negatively impact their job opportunities and career growth. 
In its latest round of mass layoffs, Amazon is eliminating 16,000 jobs&#8212;following a round of 14,000 cuts back in the fall. The tech giant did not cite artificial intelligence in a memo to employees, and Amazon CEO Andy Jassy has previously denied that the company is slashing headcount due to AI. But there&#8217;s no denying AI plays a role, whether or not these layoffs can actually be attributed to it.&#160;...</description>
    </item>
    <item>
      <title>Coffre g&#233;ant et prix cass&#233; : on en sait plus sur les voitures &#233;lectriques abordables de Volkswagen avec le Skoda Epiq</title>
      <link>https://www.frandroid.com/marques/skoda/2960417_coffre-geant-et-prix-casse-on-en-sait-plus-sur-les-voitures-electriques-abordables-de-volkswagen-avec-le-skoda-epiq</link>
      <pubDate>Thu, 29 Jan 2026 15:58:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/skoda/2960417_coffre-geant-et-prix-casse-on-en-sait-plus-sur-les-voitures-electriques-abordables-de-volkswagen-avec-le-skoda-epiq</guid>
      <description>
&#192; quelques semaines de sa pr&#233;sentation, Skoda d&#233;voile des informations suppl&#233;mentaires sur sa nouvelle voiture &#233;lectrique : l'Epiq. Ce petit SUV, concurrent direct des Renault 4 E-Tech et Peugeot E-2008, s'av&#232;re redoutable.
</description>
    </item>
    <item>
      <title>L&#8217;h&#233;ritier de Nokia surprend tout le monde : voici ses deux premi&#232;res montres connect&#233;es</title>
      <link>https://www.frandroid.com/marques/hmd/2960251_lheritier-de-nokia-surprend-tout-le-monde-voici-ses-deux-premieres-montres-connectees</link>
      <pubDate>Thu, 29 Jan 2026 15:57:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/hmd/2960251_lheritier-de-nokia-surprend-tout-le-monde-voici-ses-deux-premieres-montres-connectees</guid>
      <description>
La marque finlandaise HMD a annonc&#233; le lancement de ses deux premi&#232;res montres connect&#233;es, la HMD Watch X1 et la HMD Watch P1.
</description>
    </item>
    <item>
      <title>Amazon profite de la derni&#232;re d&#233;marque des soldes pour d&#233;stocker ses produits phares (Kindle, Echo Show, Fire TV&#8230;)</title>
      <link>https://www.frandroid.com/bons-plans/2956391_amazon-profite-de-la-derniere-demarque-des-soldes-pour-destocker-ses-produits-phares-kindle-echo-show-fire-tv</link>
      <pubDate>Thu, 29 Jan 2026 15:55:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2956391_amazon-profite-de-la-derniere-demarque-des-soldes-pour-destocker-ses-produits-phares-kindle-echo-show-fire-tv</guid>
      <description>
Alors que la derni&#232;re d&#233;marque sonne bient&#244;t la fin des soldes, Amazon profite de cette derni&#232;re occasion pour brader une bonne partie de ses produits : Echo Show, Echo Dot, Kindle, Fire TV Stick ou encore cam&#233;ras Blink&#8230; Retrouvez ici les meilleures offres en promo !
</description>
    </item>
    <item>
      <title>U.S. life expectancy hit this all-time high in 2024, CDC data shows</title>
      <link>https://www.fastcompany.com/91483273/u-s-life-expectancy-hit-all-time-high-2024-cdc-data-shows</link>
      <pubDate>2026-01-29T15:54:37</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91483273/u-s-life-expectancy-hit-all-time-high-2024-cdc-data-shows</guid>
      <description>In 2024, life expectancy went up to 79 years.
U.S. life expectancy rose to 79 years in 2024 &#8212; the highest mark in American history.It&#8217;s the result of not only the dissipation of the COVID-19 pandemic, but also waning death rates from all the nation&#8217;s top killers, including heart disease, cancer and drug overdoses.What&#8217;s more, preliminary statistics suggest a continued improvement in 2025.&#8220;It&#8217;s pretty much good news all the way around,&#8221; said Robert Anderson, of the National Center for Health Statistics at the Centers for Disease Control and Prevention, which released the 2024 data on Thursday.L...</description>
    </item>
    <item>
      <title>The iPhone 18 could be a bargain compared to the Galaxy S26 &#8211; new reports say Apple will &#8216;absorb&#8217; RAM crisis costs unlike Samsung</title>
      <link>https://www.techradar.com/phones/the-iphone-18-could-be-a-bargain-compared-to-the-galaxy-s26-new-reports-say-apple-will-absorb-ram-crisis-costs-unlike-samsung</link>
      <pubDate>Thu, 29 Jan 2026 15:43:34 +0000</pubDate>
      <guid isPermaLink="false">FmgyKfcFk5uBS2yXaqruJL</guid>
      <description>Samsung could raise its prices in response to rising RAM costs, while Apple might choose to keep prices the same in order to increase its market share.</description>
    </item>
    <item>
      <title>Meta teases &#8216;future headsets&#8217; despite VR troubles, and an AI upgrade straight from science fiction</title>
      <link>https://www.techradar.com/computing/virtual-reality-augmented-reality/meta-teases-future-headsets-despite-vr-troubles-and-an-ai-upgrade-straight-from-science-fiction</link>
      <pubDate>Thu, 29 Jan 2026 15:43:15 +0000</pubDate>
      <guid isPermaLink="false">og8gAHbtKQTxYBUYLTddh5</guid>
      <description>Maybe VR isn&#8217;t dead, as Meta teases &#8216;future headsets&#8217; and video you can &#8216;jump into&#8217;.</description>
    </item>
  </channel>
</rss>
