<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 19 Jan 2026 08:39:42 GMT</lastBuildDate>
    <item>
      <title>Test du routeur meshNetgear Orbi 370 : un kit Wi-Fi 7 complet, mais sans 6 GHz</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/routeur/2861561_test-netgear-orbi-370-un-kit-wi-fi-7-complet-mais-sans-6-ghz</link>
      <pubDate>Mon, 19 Jan 2026 08:39:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/routeur/2861561_test-netgear-orbi-370-un-kit-wi-fi-7-complet-mais-sans-6-ghz</guid>
      <description>
Netgear surprend son monde avec un kit Wi-Fi Mesh particuli&#232;rement accessible, et compatible avec la derni&#232;re norme en vogue. Avec le kit Orbi 370, la marque am&#233;ricaine s&#8217;attaque frontalement &#224; ses concurrents directs.
</description>
    </item>
    <item>
      <title>Trois c&#226;bles sous-marins ont &#233;t&#233; sabot&#233;s l&#8217;un apr&#232;s l&#8217;autre en Europe&#160;: l&#8217;enqu&#234;te continue</title>
      <link>https://www.01net.com/actualites/trois-cables-sous-marins-ete-sabotes-un-apres-autre-europe.html</link>
      <pubDate>Mon, 19 Jan 2026 08:27:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318514</guid>
      <description>En quelques jours, trois c&#226;bles sous-marins ont &#233;t&#233; sectionn&#233;s en mer Baltique. Deux navires ont &#233;t&#233; identifi&#233;s comme &#233;tant potentiellement &#224; l'origine des incidents, dont un cargo charg&#233; d'acier russe. Les autorit&#233;s redoutent une op&#233;ration de sabotage en provenance de la Russie.</description>
    </item>
    <item>
      <title>Ransomware&#160;: le cerveau d&#8217;un redoutable gang de pirates russes a &#233;t&#233; identifi&#233;</title>
      <link>https://www.01net.com/actualites/ransomware-cerveau-redoutable-gang-pirates-identifie.html</link>
      <pubDate>Mon, 19 Jan 2026 08:23:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320862</guid>
      <description>Le chef pr&#233;sum&#233; de Black Basta a &#233;t&#233; d&#233;masqu&#233; lors d'une vaste op&#233;ration de police en Ukraine. Le ressortissant russe est activement recherch&#233; par les forces de l'ordre.</description>
    </item>
    <item>
      <title>Ningtendo PXBOX 5 : voici une console fusionnant PS5, Xbox Series X et Switch 2</title>
      <link>https://www.frandroid.com/produits-android/console/console-de-jeux/2946861_ningtendo-pxbox-5-voici-une-console-fusionnant-ps5-xbox-series-x-et-switch-2</link>
      <pubDate>Mon, 19 Jan 2026 08:18:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/console-de-jeux/2946861_ningtendo-pxbox-5-voici-une-console-fusionnant-ps5-xbox-series-x-et-switch-2</guid>
      <description>
La moddeuse XNZ a litt&#233;ralement d&#233;pouill&#233; une PS5, une Xbox et une Switch 2 pour les faire cohabiter dans un ch&#226;ssis unique. 
</description>
    </item>
    <item>
      <title>Pourquoi votre PC Windows 11 refuse de s&#8217;&#233;teindre depuis la derni&#232;re mise &#224; jour : Microsoft publie un patch d&#8217;urgence</title>
      <link>https://www.frandroid.com/os/windows/2946817_pourquoi-votre-pc-windows-11-refuse-de-seteindre-depuis-la-derniere-mise-a-jour-voici-la-solution</link>
      <pubDate>Mon, 19 Jan 2026 08:07:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/windows/2946817_pourquoi-votre-pc-windows-11-refuse-de-seteindre-depuis-la-derniere-mise-a-jour-voici-la-solution</guid>
      <description>
Vous pensiez que 2026 serait l'ann&#233;e de la stabilit&#233; pour Windows 11 ? C'est rat&#233;. &#192; peine quatre jours apr&#232;s le premier Patch Tuesday, Microsoft a d&#251; sortir les rames et publier un correctif d'urgence pour r&#233;parer ce qu'il venait de casser.
</description>
    </item>
    <item>
      <title>L&#8217;Europe veut mieux lutter contre la tech chinoise&#8230; mais ne sait toujours pas comment</title>
      <link>https://www.01net.com/actualites/leurope-veut-mieux-lutter-contre-la-tech-chinoise-mais-peine-a-trouver-un-consensus-sur-la-methode.html</link>
      <pubDate>Mon, 19 Jan 2026 08:02:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320090</guid>
      <description>Exclure les fournisseurs &#224; risque des domaines &#233;conomiques strat&#233;giques, dont les soci&#233;t&#233;s chinoises : voil&#224; l'objectif de l'Union europ&#233;enne, qui s'appr&#234;te &#224; lancer la mise &#224; jour de sa r&#233;glementation sur la cybers&#233;curit&#233;. Quelle soci&#233;t&#233; sera exclue de quel march&#233; sensible ? Le sujet inflammable devrait entra&#238;ner de nombreux d&#233;bats.</description>
    </item>
    <item>
      <title>NYT Connections Sports Edition today: Hints and answers for January 19, 2026</title>
      <link>https://mashable.com/article/nyt-connections-sports-edition-hint-answer-today-january-19-2026</link>
      <pubDate>Mon, 19 Jan 2026 07:52:22 +0000</pubDate>
      <guid isPermaLink="false">01b1y50iAS9WpjNzvqKBaA0</guid>
      <description>Connections: Sports Edition is a New York Times word game about finding common sports threads between words. How to solve the day's puzzle.</description>
    </item>
    <item>
      <title>Google confirme qu&#8217;installer des apps hors du Play Store sera &#171;&#8201;plus compliqu&#233;&#8201;&#187; qu&#8217;avant</title>
      <link>https://www.frandroid.com/marques/google/2946801_google-confirme-quinstaller-des-apps-hors-du-play-store-sera-plus-complique-quavant</link>
      <pubDate>Mon, 19 Jan 2026 07:38:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2946801_google-confirme-quinstaller-des-apps-hors-du-play-store-sera-plus-complique-quavant</guid>
      <description>
Souhaitant r&#233;duire les possibilit&#233;s d&#8217;installer des applications venant du web, Google a confirm&#233; qu&#8217;un processus plus compliqu&#233;&#160;qu&#8217;actuellement sera mis en place pour les personnes les plus born&#233;es.
</description>
    </item>
    <item>
      <title>Apple iPad Pro 11 M5 : la reine des tablettes entre dans les soldes avec une premi&#232;re ristourne de 60 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2945933_apple-ipad-pro-11-m5-la-reine-des-tablettes-entre-dans-les-soldes-avec-une-premiere-ristourne-de-60-e</link>
      <pubDate>Mon, 19 Jan 2026 07:19:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2945933_apple-ipad-pro-11-m5-la-reine-des-tablettes-entre-dans-les-soldes-avec-une-premiere-ristourne-de-60-e</guid>
      <description>
Toute la d&#233;mesure de la puce M5 d'Apple concentr&#233;e dans une tablette &#224; l'&#233;cran OLED. Voil&#224; la promesse de l'iPad Pro 11, l'ardoise la plus puissante jamais con&#231;ue par la marque &#224; la pomme. Avec la seconde d&#233;marque des soldes 2026, cette reine technologique voit enfin son prix vaciller, passant de 1 119 euros &#224; 1 059,99 euros sur Amazon.
</description>
    </item>
    <item>
      <title>Nouveau hack au gouvernement&#160;: la Direction de l&#8217;immobilier de l&#8217;&#201;tat a subi &#171;&#160;un incident de cybers&#233;curit&#233;&#160;&#187;</title>
      <link>https://www.01net.com/actualites/nouveau-hack-gouvernement-direction-immobilier-etat-subi-incident-cybersecurite.html</link>
      <pubDate>Mon, 19 Jan 2026 07:15:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320850</guid>
      <description>La Direction de l&#8217;immobilier de l&#8217;&#201;tat a &#233;t&#233; vis&#233;e par une cyberattaque. L'attaque a oblig&#233; le gouvernement &#224; suspendre son portail immobilier jusqu'&#224; nouvel ordre. Les investigations sont en cours.</description>
    </item>
    <item>
      <title>Quel Redmi Note 15 choisir&#160;? Le guide ultime pour s&#8217;y retrouver</title>
      <link>https://www.01net.com/actualites/quel-redmi-note-15-choisir-le-guide-ultime-pour-sy-retrouver.html</link>
      <pubDate>Mon, 19 Jan 2026 07:02:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320592</guid>
      <description>&#192; chaque g&#233;n&#233;ration, les Redmi Note reviennent occuper le terrain du smartphone abordable, au point de devenir un passage quasi oblig&#233; pour les petits budgets. Avec les Redmi Note 15, Xiaomi reconduit la recette, mais la prolif&#233;ration de versions (4G, 5G, Pro et Pro+) brouille s&#233;rieusement les pistes pour le grand public. Ce dossier d&#233;cortique les cinq mod&#232;les, du ticket d&#8217;entr&#233;e &#224; 200 euros jusqu&#8217;au Pro+ &#224; 500 euros, afin de vous aider &#224; comprendre ce que vous gagnez, ou perdez, &#224; chaque palier de prix et &#224; choisir en connaissance de cause....</description>
    </item>
    <item>
      <title>Nothing Phone (3) vs realme GT 7 Pro&#160;: comment choisir le meilleur t&#233;l&#233;phone premium&#160;?</title>
      <link>https://www.frandroid.com/versus/2747785_nothing-phone-3-vs-realme-gt-7-pro-comment-choisir-le-meilleur-telephone-premium</link>
      <pubDate>Mon, 19 Jan 2026 07:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/versus/2747785_nothing-phone-3-vs-realme-gt-7-pro-comment-choisir-le-meilleur-telephone-premium</guid>
      <description>
Nothing s'est jet&#233; dans le grand bain en sortant son premier smartphone haut de gamme, le Phone (3). Mais comment s'en sort-il face &#224; des concurrents mieux implant&#233;s sur le march&#233; ? On le compare au realme GT 7 Pro pour vous aider &#224; bien choisir.
</description>
    </item>
    <item>
      <title>The Race to Build the DeepSeek of Europe Is On</title>
      <link>https://www.wired.com/story/europe-race-us-deepseek-sovereign-ai/</link>
      <pubDate>Mon, 19 Jan 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">696546712c1f479acb71ca37</guid>
      <description>As Europe&#8217;s longstanding alliance with the US falters, its push to become a self-sufficient AI superpower has become more urgent.</description>
    </item>
    <item>
      <title>Are these 3 challenges getting in the way of growing your business?</title>
      <link>https://www.fastcompany.com/91475585/are-these-three-challenges-getting-in-the-way-of-growing-your-business</link>
      <pubDate>2026-01-19T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91475585/are-these-three-challenges-getting-in-the-way-of-growing-your-business</guid>
      <description>Business development can feel brutal. A time management coach offers advice on how to deal with the most common challenges. 
Putting yourself out there is difficult. Rejection is tough. And feeling like you&#8217;ve gotten the rug pulled out from under you is the worst. When you&#8217;re in charge of business development, where you&#8217;re responsible for growing your revenue within your current client portfolio as well as seeking out new potential opportunities, you can easily vacillate from feeling like a hero to feeling like a zero, depending on what kind of results you&#8217;re getting from your efforts....</description>
    </item>
    <item>
      <title>Gemini a un nouveau bouton qui va vous faire gagner un temps fou</title>
      <link>https://www.01net.com/actualites/gemini-nouveau-bouton-vous-faire-gagner-temps-fou.html</link>
      <pubDate>Mon, 19 Jan 2026 06:59:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320849</guid>
      <description>Un bouton &#171; R&#233;pondre maintenant &#187; appara&#238;t d&#233;sormais dans l'interface de Gemini pour interrompre le raisonnement des mod&#232;les les plus avanc&#233;s, sans pour autant oublier de vous r&#233;pondre.</description>
    </item>
    <item>
      <title>Marre de votre fibre qui tourne au ralenti ? Passez &#224; l&#8217;offre Pure Fibre de Bouygues Telecom et son tarif (tr&#232;s) avantageux [Sponso]</title>
      <link>https://www.frandroid.com/telecom/forfait-internet/2944043_marre-de-votre-fibre-qui-tourne-au-ralenti-passez-a-loffre-pure-fibre-de-bouygues-telecom-et-son-tarif-tres-avantageux</link>
      <pubDate>Mon, 19 Jan 2026 06:53:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/forfait-internet/2944043_marre-de-votre-fibre-qui-tourne-au-ralenti-passez-a-loffre-pure-fibre-de-bouygues-telecom-et-son-tarif-tres-avantageux</guid>
      <description>
La nouvelle ann&#233;e est l&#224; et avec elle, la galette des rois et les bonnes r&#233;solutions. Et si vous commenciez 2026 par enfin opter pour un abonnement internet &#224; petit prix ?
</description>
    </item>
    <item>
      <title>&#171; C&#8217;est pour votre bien &#187; : OpenAI commence &#224; tester l&#8217;affichage de publicit&#233;s dans ChatGPT</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2946789_cest-pour-votre-bien-openai-commence-a-tester-laffichage-de-publicites-dans-chatgpt</link>
      <pubDate>Mon, 19 Jan 2026 06:51:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2946789_cest-pour-votre-bien-openai-commence-a-tester-laffichage-de-publicites-dans-chatgpt</guid>
      <description>
OpenAI commence &#224; injecter de la publicit&#233; dans ChatGPT pour les utilisateurs gratuits. Apr&#232;s avoir recrut&#233; &#224; tour de bras chez Meta, Sam Altman passe &#224; la caisse pour &#233;ponger les factures d'&#233;lectricit&#233; de ses serveurs.
</description>
    </item>
    <item>
      <title>Apple, Samsung, Google et Garmin vis&#233;s par une enqu&#234;te : leurs montres connect&#233;es bient&#244;t interdites de vente ?</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2946775_apple-samsung-google-et-garmin-vises-par-une-enquete-leurs-montres-connectees-bientot-interdites-de-vente</link>
      <pubDate>Mon, 19 Jan 2026 06:45:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2946775_apple-samsung-google-et-garmin-vises-par-une-enquete-leurs-montres-connectees-bientot-interdites-de-vente</guid>
      <description>
Une petite entreprise texane, UnaliWear, vient de lancer une offensive massive contre Apple, Samsung, Google et Garmin. Le motif ? Un pr&#233;tendu vol de brevet concernant la d&#233;tection de chute. L'USITC a officiellement ouvert l'enqu&#234;te et les cons&#233;quences pourraient &#234;tre radicales pour vos prochaines montres. En tout cas, aux Etats-Unis.
</description>
    </item>
    <item>
      <title>Comment installer WireGuard sur PC, MacBook ou votre box internet ?</title>
      <link>https://www.frandroid.com/comment-faire/2945673_comment-installer-wireguard-sur-pc-macbook-ou-votre-box-internet</link>
      <pubDate>Mon, 19 Jan 2026 06:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/comment-faire/2945673_comment-installer-wireguard-sur-pc-macbook-ou-votre-box-internet</guid>
      <description>
Le protocole WireGuard est d&#233;sormais un indispensable sur un VPN moderne. Il est pourtant n&#233;cessaire d'avoir quelques informations pour l'installer et l'utiliser sur PC ou votre box internet.
</description>
    </item>
    <item>
      <title>Le Game Pass gratuit c&#8217;est pour bient&#244;t, avec un nouvel abonnement financ&#233; par la pub</title>
      <link>https://www.frandroid.com/marques/microsoft/2946757_le-game-pass-gratuit-cest-pour-bientot-avec-un-nouvel-abonnement-finance-par-la-pub</link>
      <pubDate>Mon, 19 Jan 2026 06:39:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2946757_le-game-pass-gratuit-cest-pour-bientot-avec-un-nouvel-abonnement-finance-par-la-pub</guid>
      <description>
Soucieux de rentabiliser ses serveurs, Microsoft s&#8217;appr&#234;te &#224; d&#233;ployer &#171;&#8201;cette ann&#233;e&#8201;&#187; un nouvel abonnement pour son service de cloud gaming. Ce dernier sera gratuit, mais limit&#233; et dot&#233; de publicit&#233;s.
</description>
    </item>
  </channel>
</rss>
