<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 30 Nov 2025 22:39:11 GMT</lastBuildDate>
    <item>
      <title>My favorite Cyber Monday TV deals from Samsung, Sony, and others are up to 50% off</title>
      <link>https://www.theverge.com/tech/829579/best-4k-tv-streaming-soundbar-blu-ray-player-deal-sale-black-friday</link>
      <pubDate>2025-11-30T17:23:06-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=829579</guid>
      <description>Black Friday might have passed, but that doesn&#8217;t mean the holiday deals are gone. You can still find low prices on excellent TVs, streaming devices, and soundbars through Cyber Monday. I&#8217;ve found the best of these deals to level up your home theater setup, and make sure that your holiday season (and every day after) [&#8230;]</description>
    </item>
    <item>
      <title>Disney Plus, Hulu, and HBO Max are all over 60 percent off for Cyber Monday</title>
      <link>https://www.theverge.com/gadgets/829306/best-black-friday-streaming-deals-hulu-disney-plus-paramount-hbo-max-2025</link>
      <pubDate>2025-11-30T16:54:59-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=829306</guid>
      <description>The holidays are a great time to see family, exchange gifts, and enjoy a good meal. It&#8217;s also the perfect time to gather around a TV and catch up on must-see shows and movies. Vince Gilligan&#8217;s Pluribus is a fantastic new series on Apple TV, while Hulu is the only place you can catch the [&#8230;]</description>
    </item>
    <item>
      <title>New report examines how David Sacks might profit from Trump administration role</title>
      <link>https://techcrunch.com/2025/11/30/new-report-examines-how-david-sacks-might-profit-from-trump-administration-role/</link>
      <pubDate>Sun, 30 Nov 2025 21:39:04 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3071216</guid>
      <description>David Sacks&#8217; role as President Donald Trump&#8217;s artificial intelligence and crypto czar could work out very well for his investments, according to a new report. However, Sacks fired back, calling the story a "nothing burger."</description>
    </item>
    <item>
      <title>Tor adds another layer to the onion with a new relay encryption algorithm - boosting resilience and security across the board</title>
      <link>https://www.techradar.com/pro/security/tor-adds-another-layer-to-the-onion-with-a-new-relay-encryption-algorithm-boosting-resilience-and-security-across-the-board</link>
      <pubDate>Sun, 30 Nov 2025 21:35:00 +0000</pubDate>
      <guid isPermaLink="false">MLJz4LtwzBQLz8N8CdU2BZ</guid>
      <description>Tor replaces its older tor1 relay encryption with CGO to strengthen privacy, block tagging attacks, and modernize authentication across circuits.</description>
    </item>
    <item>
      <title>Scared you'll delete important work files? This backup-focused cloud storage could ease your fears this Cyber Monday</title>
      <link>https://www.techradar.com/pro/scared-youll-delete-important-work-files-this-backup-focused-cloud-storage-could-ease-your-fears-this-cyber-monday</link>
      <pubDate>Sun, 30 Nov 2025 21:34:07 +0000</pubDate>
      <guid isPermaLink="false">pUDzuAKheAYTLZGVFooEkD</guid>
      <description>Incorporate backups seamlessly into your cloud storage plans from BackBlaze</description>
    </item>
    <item>
      <title>The absolute best Cyber Monday deals you can already shop</title>
      <link>https://www.theverge.com/gadgets/833101/cyber-monday-best-early-deals-2025</link>
      <pubDate>2025-11-30T16:30:20-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=833101</guid>
      <description>Black Friday is over, but the deals haven&#8217;t simply evaporated. As we turn our attention to Cyber Monday, many of our favorite deals are still holding strong. That means you have another chance to save if you&#8217;ve been too preoccupied with holiday leftovers. Be forewarned, though: stock on certain items is dwindling, and in some [&#8230;]</description>
    </item>
    <item>
      <title>Carte Graphique : le meilleur prix pour la RX 9070 XT est chez Amazon pour le Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/bons-plans-gaming/2892697_carte-graphique-le-meilleur-prix-pour-la-rx-9070-xt-est-chez-amazon-pour-le-black-friday</link>
      <pubDate>Sun, 30 Nov 2025 21:21:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/bons-plans-gaming/2892697_carte-graphique-le-meilleur-prix-pour-la-rx-9070-xt-est-chez-amazon-pour-le-black-friday</guid>
      <description>
Vous cherchez de la puissance pure sans payer la "taxe verte" de Nvidia ? La Radeon RX 9070 XT vient de tomber &#224; 599,99 &#8364; sur Amazon. &#192; ce prix pour 16 Go de VRAM et une architecture moderne, c'est math&#233;matiquement le meilleur ratio euro-FPS du march&#233;.
</description>
    </item>
    <item>
      <title>20 Best Black Friday Deals at Best Buy (2025) on Hot Tech</title>
      <link>https://www.wired.com/story/early-black-friday-best-buy-deals-1/</link>
      <pubDate>Sun, 30 Nov 2025 21:20:10 +0000</pubDate>
      <guid isPermaLink="false">691b78c0cac069ace2d1a5d4</guid>
      <description>Best Buy is rolling out really great deals on some of our favorite tech that we've tested this year.</description>
    </item>
    <item>
      <title>This is exactly what I would do if I wanted a website this Cyber Monday: checkout and page building advice</title>
      <link>https://www.techradar.com/pro/website-hosting/this-is-exactly-what-i-would-do-if-i-wanted-a-website-this-cyber-monday-checkout-and-page-building-advice</link>
      <pubDate>Sun, 30 Nov 2025 21:18:13 +0000</pubDate>
      <guid isPermaLink="false">kzRjM9NDxwdcJQJUXebptE</guid>
      <description>If I wanted to get a website today, this is how I would do it</description>
    </item>
    <item>
      <title>The &#8216;Fallout&#8217; Show Won&#8217;t Give a Canon Ending for &#8216;New Vegas&#8217;</title>
      <link>https://gizmodo.com/the-fallout-show-wont-give-a-canon-ending-for-new-vegas-2000693494</link>
      <pubDate>Sun, 30 Nov 2025 21:15:51 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000693494</guid>
      <description>Despite going to the Mojave Wasteland for its second season, the 'Fallout' show has no intention of stepping on players' and Obsidian's toes.</description>
    </item>
    <item>
      <title>C&#8217;est le dernier jour du Black Friday : voici les ultimes offres de ce dimanche 30 novembre 2025</title>
      <link>https://www.frandroid.com/bons-plans/2889393_cest-le-dernier-jour-du-black-friday-voici-les-meilleures-offres-encore-disponibles-ce-dimanche</link>
      <pubDate>Sun, 30 Nov 2025 21:15:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2889393_cest-le-dernier-jour-du-black-friday-voici-les-meilleures-offres-encore-disponibles-ce-dimanche</guid>
      <description>
Entre les offres en avant-premi&#232;re, les promos du 11.11 ou encore la Black Week, le mois de novembre a &#233;t&#233; assez mouvement&#233; en offres. Mais, ce n'est pas encore fini : c'est aujourd'hui le dernier jour du Black Friday et il y a encore de nouvelles offres qui tombent. Nous avons fait le tri des meilleures promotions Tech, faites vous plaisir !
</description>
    </item>
    <item>
      <title>The best Cyber Monday fitness tracker deals: Low prices on Apple, Garmin, Fitbit, and more</title>
      <link>https://mashable.com/article/best-early-cyber-monday-fitness-tracker-deals-2025</link>
      <pubDate>Sun, 30 Nov 2025 21:15:12 +0000</pubDate>
      <guid isPermaLink="false">00C44bDMNTXr6fpXquWWRxv</guid>
      <description>The best Cyber Monday fitnss tracker deals you can buy now. Save on Apple, Garmin, Fitbit, and more.</description>
    </item>
    <item>
      <title>Sonos Ace : le casque &#171;&#160;maudit&#160;&#187; devient l&#8217;affaire du si&#232;cle avec ce code</title>
      <link>https://www.frandroid.com/bons-plans/bons-plans-audio/bons-plans-casques-audio/2892689_sonos-ace-le-casque-maudit-devient-laffaire-du-siecle-avec-ce-code</link>
      <pubDate>Sun, 30 Nov 2025 21:14:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/bons-plans-audio/bons-plans-casques-audio/2892689_sonos-ace-le-casque-maudit-devient-laffaire-du-siecle-avec-ce-code</guid>
      <description>
Lanc&#233; &#224; 499 &#8364; avec beaucoup d'arrogance, le Sonos Ace a eu du mal &#224; trouver son public. Mais le Black Friday remet les pendules &#224; l'heure. Avec le code BF25, il tombe &#224; 274,99 &#8364; chez Boulanger. &#192; ce prix-l&#224;, on oublie les pol&#233;miques de lancement et on profite de l'une des meilleures finitions du march&#233;.
</description>
    </item>
    <item>
      <title>Xiaomi C301 &#224; 19 &#8364; : la surveillance 2K co&#251;te d&#233;sormais moins cher qu&#8217;une pizza</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/2892661_xiaomi-c301-a-19-e-la-surveillance-2k-coute-desormais-moins-cher-quune-pizza</link>
      <pubDate>Sun, 30 Nov 2025 20:55:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/2892661_xiaomi-c301-a-19-e-la-surveillance-2k-coute-desormais-moins-cher-quune-pizza</guid>
      <description>
Une cam&#233;ra de surveillance motoris&#233;e qui filme en 2K pour moins de 20 &#8364;, &#231;a ressemble &#224; une erreur de prix. Mais non, c'est juste Xiaomi qui nettoie les stocks. La Smart Camera C301 tombe &#224; 19,99 &#8364;. &#192; ce tarif, vous pouvez en mettre une dans chaque pi&#232;ce sans culpabiliser.
</description>
    </item>
    <item>
      <title>30 Best Cyber Monday Tech Deals (2025)</title>
      <link>https://www.wired.com/story/black-friday-tech-deals-2025/</link>
      <pubDate>Sun, 30 Nov 2025 20:55:14 +0000</pubDate>
      <guid isPermaLink="false">691cb8e0f1455f4577555698</guid>
      <description>Behold the best Cyber Monday tech deals this weekend on WIRED-tested and approved gadgetry of all kinds.</description>
    </item>
    <item>
      <title>Hisense 65A85Q : le grand format 65 pouces en OLED au prix du LCD, c&#8217;est du d&#233;lire</title>
      <link>https://www.frandroid.com/marques/hisense/2892653_hisense-65a85q-le-grand-format-65-pouces-en-oled-au-prix-du-lcd-cest-du-delire</link>
      <pubDate>Sun, 30 Nov 2025 20:50:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/hisense/2892653_hisense-65a85q-le-grand-format-65-pouces-en-oled-au-prix-du-lcd-cest-du-delire</guid>
      <description>
C'est la barri&#232;re mentale qu'on pensait infranchissable. Un TV OLED de 65 pouces (164 cm) sous les 900 &#8364;, c'&#233;tait de la science-fiction l'ann&#233;e derni&#232;re. Voici le t&#233;l&#233;viseur Hisense 65A85Q. &#192; ce tarif, vous avez le cin&#233;ma &#224; la maison pour le prix d'un &#233;cran LCD milieu de gamme.
</description>
    </item>
    <item>
      <title>You Can Get Peacock or Paramount+ With Walmart+ Right Now (2025)</title>
      <link>https://www.wired.com/story/walmart-plus-cyber-monday-2025/</link>
      <pubDate>Sun, 30 Nov 2025 20:45:27 +0000</pubDate>
      <guid isPermaLink="false">692c8fba9c509cb9f305700c</guid>
      <description>Annual Walmart+ memberships are half off for Cyber Monday, plus you'll get Peacock Premium or Paramount+ Essential streaming for free.</description>
    </item>
    <item>
      <title>The best Cyber Monday tablet deals: Record-low deals on Apple, Amazon, Samsung, Lenovo, and more</title>
      <link>https://mashable.com/article/best-early-cyber-monday-tablet-deals-2025</link>
      <pubDate>Sun, 30 Nov 2025 20:43:17 +0000</pubDate>
      <guid isPermaLink="false">05VvgDxaG6xM2dOj5ut68I9</guid>
      <description>For Cyber Monday, we've rounded up all the best deals on tablets. Shop all the best deals on Apple, Amazon, Samsung, Lenovo, and more.</description>
    </item>
    <item>
      <title>Une TV Panasonic QLED de 2025 &#224; ce prix ? Boulanger brade le mod&#232;le &#233;quip&#233; de Fire TV</title>
      <link>https://www.frandroid.com/produits-android/tv-connectee-produits/2892641_une-tv-panasonic-qled-de-2025-a-ce-prix-boulanger-brade-le-modele-equipe-de-fire-tv</link>
      <pubDate>Sun, 30 Nov 2025 20:41:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/tv-connectee-produits/2892641_une-tv-panasonic-qled-de-2025-a-ce-prix-boulanger-brade-le-modele-equipe-de-fire-tv</guid>
      <description>
C'est le probl&#232;me num&#233;ro 1 des TV &#224; petit prix : l'image est belle, mais les menus rament. Panasonic a r&#233;gl&#233; le souci radicalement. Son mod&#232;le 55W80AEZ, une QLED de 55 pouces, tourne nativement sous Fire TV. 
</description>
    </item>
  </channel>
</rss>
