<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 12 Jan 2026 14:30:49 GMT</lastBuildDate>
    <item>
      <title>Les 13 meilleures offres pour changer de TV 4K (QLED ou OLED) avant la fin de la 1er d&#233;marque des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2933417_les-13-meilleures-offres-pour-changer-de-tv-4k-qled-ou-oled-avant-la-fin-de-la-1er-demarque-des-soldes</link>
      <pubDate>Mon, 12 Jan 2026 14:22:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933417_les-13-meilleures-offres-pour-changer-de-tv-4k-qled-ou-oled-avant-la-fin-de-la-1er-demarque-des-soldes</guid>
      <description>
Avec les soldes d'hiver, les e-commer&#231;ants comptent bien &#233;couler leurs TV 4K et vid&#233;oprojecteurs par palettes ! Les meilleures offres du moment se trouvent dans cette s&#233;lection, et on y trouve aussi bien des mod&#232;les premium que abordables.
</description>
    </item>
    <item>
      <title>Apple's Mac mini M4 is back on sale for $499</title>
      <link>https://www.engadget.com/deals/apples-mac-mini-m4-is-back-on-sale-for-499-141615231.html?src=rss</link>
      <pubDate>Mon, 12 Jan 2026 14:16:16 +0000</pubDate>
      <guid isPermaLink="false">98566005-6c41-40d6-af1c-de63d6ff0d35</guid>
      <description>The holiday season is fully in the rear view mirror and real life is here to stay. But that doesn't mean the time for gifts is over &#8212; especially ones for yourself. You can still take advantage of great January sales on some awesome tech products.
Take the Apple Mac mini M4, which is down to $500 from $599. The 17 percent discount gives you 16GB of RAM and 256GB of SSD for only about $20 more than the computer's Black Friday sale. Its beefier models are also on sale: opting for 512GB of SSD will cost you $690, down from $799, while also upping your RAM to 24GB is available for $890, dropping fr...</description>
    </item>
    <item>
      <title>Windows 11 : vous saurez enfin quel pilote vous installez via Windows Update</title>
      <link>https://www.frandroid.com/marques/microsoft/2939329_windows-11-vous-saurez-enfin-quel-pilote-vous-installez-via-windows-update</link>
      <pubDate>Mon, 12 Jan 2026 14:16:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2939329_windows-11-vous-saurez-enfin-quel-pilote-vous-installez-via-windows-update</guid>
      <description>
Windows 11 peut mettre &#224; jour les pilotes de votre PC, mais la proc&#233;dure cr&#233;e la confusion sur un point.
</description>
    </item>
    <item>
      <title>The Weirdest Gadgets We Saw at CES 2026</title>
      <link>https://gizmodo.com/the-weirdest-gadgets-we-saw-at-ces-2026-2000708217</link>
      <pubDate>Mon, 12 Jan 2026 14:15:19 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000708217</guid>
      <description>As usual, the biggest consumer electronics show in the world did not disappoint in the wacky gadget department.</description>
    </item>
    <item>
      <title>Discord stopped working in Egypt &#8211; and Proton VPN records massive usage spike</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/discord-stopped-working-in-egypt-and-proton-vpn-records-massive-usage-spike</link>
      <pubDate>Mon, 12 Jan 2026 14:04:40 +0000</pubDate>
      <guid isPermaLink="false">qyk29CrAjh2sJbGobJUTq8</guid>
      <description>Discord appears to be the latest app to face restrictions in Egypt, despite authorities not confirming the ban yet. Proton recorded a 103% increase in sign-ups for its free VPN on Saturday, with usage continuing to rise.</description>
    </item>
    <item>
      <title>L&#8217;Inde veut acc&#233;der au code source des smartphones, et c&#8217;est un s&#233;rieux probl&#232;me pour Apple</title>
      <link>https://www.01net.com/actualites/linde-veut-acceder-au-code-source-des-smartphones-et-cest-un-serieux-probleme-pour-apple.html</link>
      <pubDate>Mon, 12 Jan 2026 14:04:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319505</guid>
      <description>L'Inde est d&#233;cid&#233;ment un casse-t&#234;te pour les constructeurs de smartphones, Apple en t&#234;te. Les autorit&#233;s du pays auraient en t&#234;te de leur r&#233;clamer le code source de leurs syst&#232;mes d'exploitation, ce qui est &#233;videmment un gros souci pour, entre autres, Apple et Google.</description>
    </item>
    <item>
      <title>Another Stranger Things Star Could Be Joining the MCU</title>
      <link>https://gizmodo.com/joe-keery-mcu-casting-rumors-cyclops-nova-2000708859</link>
      <pubDate>Mon, 12 Jan 2026 14:00:58 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000708859</guid>
      <description>Plus, get a creepy look at Jack O'Connell's return for '28 Years Later: The Bone Temple'.</description>
    </item>
    <item>
      <title>Harmattan AI raises $200M Series B led by Dassault Aviation, becomes defense unicorn</title>
      <link>https://techcrunch.com/2026/01/12/harmattan-ai-raises-200m-series-b-led-by-dassault-aviation-becomes-defense-unicorn/</link>
      <pubDate>Mon, 12 Jan 2026 14:00:44 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3081820</guid>
      <description>French defense tech company Harmattan AI is now valued at $1.4 billion after raising a $200 million Series B round led by Dassault Aviation, which is best known for making the Rafale fighter jet.</description>
    </item>
    <item>
      <title>Netflix won seven awards at the Golden Globes with Adolescence and KPop Demon Hunters</title>
      <link>https://www.engadget.com/entertainment/streaming/netflix-won-seven-awards-at-the-golden-globes-with-adolescence-and-kpop-demon-hunters-140006510.html?src=rss</link>
      <pubDate>Mon, 12 Jan 2026 14:00:06 +0000</pubDate>
      <guid isPermaLink="false">b3ac3254-4955-43e4-ba86-007d55637e41</guid>
      <description>The 2026 Golden Globes took place on Sunday and it was another big night for streamers. Netflix took home seven awards, Apple and HBO Max each won three and Hulu got one.&#160;
Netflix's hit show Adolescence received four awards alone, including best limited or anthology series. It also won for best actor (Stephen Graham), supporting actor (Owen Cooper) and supporting actress (Erin Doherty) in a miniseries or television film.&#160;
KPop Demon Hunters &#8212; the sensation which became Netflix's most-watched title &#8212; won for best animated feature and best original song. "I just want to say this award goes to pe...</description>
    </item>
    <item>
      <title>What is the release date for Fallout season 2 episode 5 on Prime Video?</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/what-is-the-release-date-for-fallout-season-2-episode-5-on-prime-video</link>
      <pubDate>Mon, 12 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">DTTA78g5yi6ZxSzoiGShRc</guid>
      <description>Episode 5 of Fallout season 2 will emerge from its vault shortly &#8211; here's when you can watch it.</description>
    </item>
    <item>
      <title>DJI and other drone companies get a partial reprieve in the US &#8211; but the ban on new models still stands</title>
      <link>https://www.techradar.com/cameras/drones/dji-and-other-drone-companies-get-a-partial-reprieve-in-the-us-but-the-ban-on-new-models-still-stands</link>
      <pubDate>Mon, 12 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">QWGiMzrih8QpFMayWVjQMA</guid>
      <description>The Department of Commerce has decided not to make the US's worrying "DJI ban" even worse.</description>
    </item>
    <item>
      <title>IKEA&#8217;s upgraded donut lamp is already my favorite smart home device of the year &#8212; here are 5 reasons why</title>
      <link>https://www.techradar.com/home/smart-home/ikeas-upgraded-donut-lamp-is-already-my-favorite-smart-home-device-of-the-year-here-are-5-reasons-why</link>
      <pubDate>Mon, 12 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">DDfHTU8Q9w53pUPmyNEPvk</guid>
      <description>I can't stop thinking about IKEA's new Varmblixt smart lamp, and these are the 5 reasons I seriously want to upgrade.</description>
    </item>
    <item>
      <title>2026 s&#8217;annonce comme une ann&#233;e d&#233;cisive pour l&#8217;espace, et tout pourrait s&#8217;acc&#233;l&#233;rer</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronautique-2026-annonce-comme-annee-decisive-espace-tout-pourrait-accelerer-129919/#xtor%3DRSS-8</link>
      <pubDate>Mon, 12 Jan 2026 14:59:28 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronautique-2026-annonce-comme-annee-decisive-espace-tout-pourrait-accelerer-129919/#xtor%3DRSS-8</guid>
      <description>De l'Inde aux &#201;tats-Unis, en passant par la Chine et l'Europe, sans oublier la mission de Sophie Adenot &#224; bord de l'ISS, l'ann&#233;e 2026 promet d'&#234;tre riche en rebondissements dans le domaine de l'acc&#232;s &#224; l'espace et de la pr&#233;paration &#224; la conqu&#234;te de la Lune. D&#233;couvrez&#160;les &#233;v&#233;nements qui, selon...</description>
    </item>
    <item>
      <title>Les donn&#233;es vol&#233;es &#224; Colis Priv&#233; sont sur le dark web&#160;: plusieurs millions de Fran&#231;ais sont touch&#233;s</title>
      <link>https://www.01net.com/actualites/donnees-volees-colis-prive-sont-dark-web-plusieurs-millions-francais-sont-touches.html</link>
      <pubDate>Mon, 12 Jan 2026 13:50:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319452</guid>
      <description>Les donn&#233;es d&#233;rob&#233;es &#224; Colis Priv&#233; en novembre se trouvent d&#233;sormais en acc&#232;s libre sur le dark web. Quelques mois apr&#232;s la cyberattaque, plus de 22&#8239;millions d&#8217;enregistrements ont &#233;t&#233; mis en ligne. Les arnaques &#224; la livraison de colis risquent d'exploser.</description>
    </item>
    <item>
      <title>Les soldes, c&#8217;est le bon moment pour changer son smartphone : voici le TOP 12 des deals &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2931029_les-soldes-cest-le-bon-moment-pour-changer-son-smartphone-voici-le-top-12-des-deals-a-retenir</link>
      <pubDate>Mon, 12 Jan 2026 13:40:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931029_les-soldes-cest-le-bon-moment-pour-changer-son-smartphone-voici-le-top-12-des-deals-a-retenir</guid>
      <description>
Si vous attendiez les soldes pour changer de smartphones, vous avez bien fait ! Durant cette p&#233;riode, on trouve de belles offres du c&#244;t&#233; des Galaxy S de Samsung, des Pixel de Google et appareils Xiaomi, et m&#234;me des iPhone d'Apple. D&#233;couvrez les meilleures offres : il y en a pour tous les budgets.
</description>
    </item>
    <item>
      <title>Get Apple's 25W MagSafe charger for only $30 right now</title>
      <link>https://www.engadget.com/deals/get-apples-25w-magsafe-charger-for-only-30-right-now-141707104.html?src=rss</link>
      <pubDate>Mon, 12 Jan 2026 13:36:26 +0000</pubDate>
      <guid isPermaLink="false">2ce1496f-1e48-428a-bb64-aefda025bc79</guid>
      <description>One way you can reduce the number of cables you have to deal with on the regular is by investing in a few wireless chargers. Those with iPhones should consider Apple's own MagSafe charger not only because of its sleek and effective design, but also because it's on sale right now at Amazon. The Qi2.2-rated MagSafe charger is down to $30 for the one-meter version, or $40 for the two-meter version.


If you have an iPhone 16, iPhone 17 or iPhone Air, this cable can charge your device at 25W as long as it's connected to a 30W power adapter on the other end. While you'll need a more recent iPhone t...</description>
    </item>
    <item>
      <title>Insta360 X5 : cette excellente action cam de 2025 perd une grosse partie de son prix pour les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2650005_insta360-x5-cette-excellente-action-cam-de-2025-perd-une-grosse-partie-de-son-prix-pour-les-soldes</link>
      <pubDate>Mon, 12 Jan 2026 13:36:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2650005_insta360-x5-cette-excellente-action-cam-de-2025-perd-une-grosse-partie-de-son-prix-pour-les-soldes</guid>
      <description>
L'Insta360 X5 a int&#233;gr&#233; le catalogue de la marque sp&#233;cialis&#233;e dans la vid&#233;o en 2025. Cette r&#233;cente cam&#233;ra d'action b&#233;n&#233;ficie de pas mal d'am&#233;liorations par rapport au mod&#232;le pr&#233;c&#233;dent et est d'ores et d&#233;j&#224; bien moins ch&#232;re qu'&#224; son lancement.
</description>
    </item>
    <item>
      <title>On pensait avoir touch&#233; le fond avec le Rabbit R1 et l&#8217;Humane Pin, mais l&#8217;industrie tech est pleine de ressources</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2939301_on-pensait-avoir-touche-le-fond-avec-le-rabbit-r1-et-lhumane-pin-mais-lindustrie-tech-est-pleine-de-ressources</link>
      <pubDate>Mon, 12 Jan 2026 13:34:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2939301_on-pensait-avoir-touche-le-fond-avec-le-rabbit-r1-et-lhumane-pin-mais-lindustrie-tech-est-pleine-de-ressources</guid>
      <description>
Meizu vient de pr&#233;senter le 22 Next. C'est un carr&#233;, &#231;a a un &#233;cran de 4 pouces, &#231;a vous fait des sourires, et &#231;a promet de r&#233;volutionner votre vie.
</description>
    </item>
    <item>
      <title>A Lego version of the original iMac G3 could be in the works &#8211; and it looks like 90s nostalgia gold</title>
      <link>https://www.techradar.com/computing/a-lego-version-of-the-original-imac-g3-could-be-in-the-works-and-it-looks-like-90s-nostalgia-gold</link>
      <pubDate>Mon, 12 Jan 2026 13:31:14 +0000</pubDate>
      <guid isPermaLink="false">x2dVQzdV5eXe3SrYHgXXb5</guid>
      <description>iMac and Lego &#8211; the perfect combination? New concept set for Apple's original iMac G3 looks stunning.</description>
    </item>
    <item>
      <title>The biggest moments of the 2026 Golden Globes</title>
      <link>https://mashable.com/article/golden-globes-2026-biggest-moments</link>
      <pubDate>Mon, 12 Jan 2026 13:29:37 +0000</pubDate>
      <guid isPermaLink="false">05tkmtw7qmq4ThEwB973swW</guid>
      <description>A round-up of the biggest moments from the 2026 Golden Globe Awards.</description>
    </item>
    <item>
      <title>De &#171;&#160;l&#8217;IA souveraine&#160;&#187; au sein des syst&#232;mes de combat a&#233;rien&#160;: Dassault Aviation s&#8217;associe &#224; la p&#233;pite fran&#231;aise Harmattan AI</title>
      <link>https://www.01net.com/actualites/de-lia-souveraine-au-sein-des-systemes-de-combat-aerien-dassault-aviation-sassocie-a-la-pepite-francaise-harmattan-ai.html</link>
      <pubDate>Mon, 12 Jan 2026 13:21:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319394</guid>
      <description>Le g&#233;ant fran&#231;ais de l'industrie de la d&#233;fense, Dassault Aviation, a annonc&#233; avoir particip&#233; &#224; une lev&#233;e de fonds de la soci&#233;t&#233; Harmattan AI, une start-up fran&#231;aise qui con&#231;oit et industrialise des drones et des solutions d'IA militaires.</description>
    </item>
    <item>
      <title>&#171; Vous pouvez recharger en 12 minutes &#187; : c&#8217;est officiel, Xpeng s&#8217;attaque &#224; l&#8217;atout ma&#238;tre de Tesla en Europe</title>
      <link>https://www.frandroid.com/marques/xpeng/2939145_vous-pouvez-recharger-en-12-minutes-cest-officiel-xpeng-sattaque-a-latout-maitre-de-tesla-en-europe</link>
      <pubDate>Mon, 12 Jan 2026 13:16:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2939145_vous-pouvez-recharger-en-12-minutes-cest-officiel-xpeng-sattaque-a-latout-maitre-de-tesla-en-europe</guid>
      <description>
Xpeng continue son d&#233;veloppement en Europe. Pour accompagner ses voitures &#233;lectriques capables de se recharger en 12 minutes, la marque chinoise nous a confirm&#233; l'arriv&#233;e de ses bornes ultra-rapides en Europe en 2026. De quoi r&#233;pondre aux Superchargeurs de Tesla et aux imminentes stations Megawatt de BYD ?
</description>
    </item>
    <item>
      <title>Walmart is planning to expand a popular service. It means new delivery options from Los Angeles to Miami</title>
      <link>https://www.fastcompany.com/91472414/walmart-is-planning-to-expand-a-popular-service-it-means-new-delivery-options-from-los-angeles-to-miami</link>
      <pubDate>2026-01-12T13:15:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91472414/walmart-is-planning-to-expand-a-popular-service-it-means-new-delivery-options-from-los-angeles-to-miami</guid>
      <description>The retail giant&#8217;s multi-year partnership with drone delivery company Wing has proven successful. It will be in 270 locations around the U.S. in 2027.
It&#8217;s a bird. It&#8217;s a plane. It&#8217;s the next phase of expansion planned by Walmart and drone company Wing.</description>
    </item>
    <item>
      <title>This ElevationLabs 10-year extended battery case for AirTags is on sale for only $16</title>
      <link>https://www.engadget.com/deals/this-elevationlabs-10-year-extended-battery-case-for-airtags-is-on-sale-for-only-16-162308983.html?src=rss</link>
      <pubDate>Mon, 12 Jan 2026 13:14:15 +0000</pubDate>
      <guid isPermaLink="false">12d3fe53-c0b1-4919-880c-16749c440b85</guid>
      <description>ElevationLab makes a battery case for your AirTag that can power it for 10 years and the accessory is on sale now for 30 percent off. Normally retailing for $23, you can pick one up for $16.
The TimeCapsule case uses two AA batteries to offer up to 14 times the lifespan of the CR2032 battery that powers an AirTag. The company based those estimates on Energizer Ultimate Lithium batteries, so your mileage may vary. Once an AirTag is seated inside the case, which is a compact 4.45 x 1.57 inches, it is sealed shut with four screws at the corners. The case is fiber-reinforced, according to Elevatio...</description>
    </item>
    <item>
      <title>NYT Connections hints today: Clues, answers for January 12, 2026</title>
      <link>https://mashable.com/article/nyt-connections-hint-answer-today-january-12-2026</link>
      <pubDate>Mon, 12 Jan 2026 13:02:48 +0000</pubDate>
      <guid isPermaLink="false">06aVo8BdFGUpRR8VntcdXrv</guid>
      <description>Connections is a New York Times word game that's all about finding the "common threads between words." How to solve the puzzle.</description>
    </item>
    <item>
      <title>Perte de poids, nouvelle interface et conseils par IA : les secrets d&#8217;Apple pour r&#233;volutionner l&#8217;application Sant&#233;</title>
      <link>https://www.frandroid.com/marques/apple/2939175_perte-de-poids-nouvelle-interface-et-conseils-par-ia-les-secrets-dapple-pour-revolutionner-lapplication-sante</link>
      <pubDate>Mon, 12 Jan 2026 13:02:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2939175_perte-de-poids-nouvelle-interface-et-conseils-par-ia-les-secrets-dapple-pour-revolutionner-lapplication-sante</guid>
      <description>
Apple devrait lancer cette ann&#233;e une refonte de son application Apple Sant&#233;, avec en prime un nouvel abonnement Health+. Voici les principales nouveaut&#233;s attendues. 
</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : voici les meilleures offres en DIRECT avant la fin de la premi&#232;re d&#233;marque</title>
      <link>https://www.frandroid.com/bons-plans/2931731_soldes-dhiver-2026-voici-les-meilleures-offres-en-direct-avant-la-fin-de-la-premiere-demarque</link>
      <pubDate>Mon, 12 Jan 2026 13:02:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931731_soldes-dhiver-2026-voici-les-meilleures-offres-en-direct-avant-la-fin-de-la-premiere-demarque</guid>
      <description>
Les soldes d'hiver 2026 ont d&#233;but&#233; la semaine derni&#232;re et les offres continuent de tomber sur Amazon, Fnac, Darty ou encore Cdiscount et Boulanger. Smartphones, PC portables, t&#233;l&#233;viseurs, tablettes ou encore casques et &#233;couteurs sans fil&#8230; Voici les meilleures offres Tech s&#233;lectionn&#233;es par la r&#233;daction pour l'occasion.
</description>
    </item>
    <item>
      <title>KPop Demon Hunters director shouts out HUNTR/X in Golden Globe speech</title>
      <link>https://mashable.com/video/golden-globes-kpop-demon-hunters-maggie-kang</link>
      <pubDate>Mon, 12 Jan 2026 13:01:56 +0000</pubDate>
      <guid isPermaLink="false">069Q7ICrwLYpwMDTvcKYVqe</guid>
      <description>"KPop Demon Hunters" remains forever shining with the smash-hit Netflix film taking home two Golden Globes.</description>
    </item>
    <item>
      <title>NYT Strands hints, answers for January 12, 2026</title>
      <link>https://mashable.com/article/strands-nyt-hint-january-12-2026</link>
      <pubDate>Mon, 12 Jan 2026 13:01:50 +0000</pubDate>
      <guid isPermaLink="false">00474tW7WbIlMNidL6sQpGZ</guid>
      <description>The NYT Strands hints and answers you need to make the most of your puzzling experience.</description>
    </item>
    <item>
      <title>Wordle today: Answer, hints for January 12, 2026</title>
      <link>https://mashable.com/article/wordle-today-answer-january-12-2026</link>
      <pubDate>Mon, 12 Jan 2026 13:01:42 +0000</pubDate>
      <guid isPermaLink="false">07kqmmwNjSw3gAIepjeBpU4</guid>
      <description>Here's the answer for "Wordle" #1667 on January 12 as well as a few hints, tips, and clues to help you solve it yourself.</description>
    </item>
    <item>
      <title>Meta closes 550,000 accounts to comply with Australia's kids social media ban</title>
      <link>https://www.engadget.com/social-media/meta-closes-550000-accounts-to-comply-with-australias-kids-social-media-ban-130041356.html?src=rss</link>
      <pubDate>Mon, 12 Jan 2026 13:00:41 +0000</pubDate>
      <guid isPermaLink="false">546a5d9d-3b71-47aa-9419-ffa9f5462180</guid>
      <description>To comply with Australia's under-16 social media ban, Meta said on Medium that it has shut down nearly 550,00 accounts. That number includes 330,000 Instagram, 173,000 Facebook and 40,000 Threads accounts deemed to belong to children. "Ongoing compliance with the law will be a multi-layered process that we will continue to refine, though our concerns about determining age online without an industry standard remain," the company wrote.&#160;
Australia's minimum age social media ban, the first of its kind in the world for a democracy, went into effect on December 10. The ten platforms affected, inclu...</description>
    </item>
    <item>
      <title>Nvidia has finally done the one AI thing I've been dreading &#8212; and PC gaming might never be the same</title>
      <link>https://www.techradar.com/tech-events/nvidia-has-finally-done-the-one-ai-thing-ive-been-dreading-and-pc-gaming-might-never-be-the-same</link>
      <pubDate>Mon, 12 Jan 2026 13:00:36 +0000</pubDate>
      <guid isPermaLink="false">wxGbuRJ78Mx8NXpDqy6vNb</guid>
      <description>'Depth and complexity are hallmarks of PC gaming' says Nvidia, then immediately reveals a plan to obliterate any depth and complexity in PC gaming.</description>
    </item>
    <item>
      <title>NYT Mini crossword answers, hints for January 12, 2026</title>
      <link>https://mashable.com/article/nyt-mini-crossword-answers-hints-january-12-2026</link>
      <pubDate>Mon, 12 Jan 2026 13:00:07 +0000</pubDate>
      <guid isPermaLink="false">07IcF8zTBieKtn9bGDosJdS</guid>
      <description>Answers to each clue for the January 9, 2026 edition of NYT's The Mini crossword puzzle.</description>
    </item>
    <item>
      <title>The Golden Globes Belonged to &#8216;KPop Demon Hunters&#8217; and &#8216;Sinners&#8217;</title>
      <link>https://gizmodo.com/the-golden-globes-belonged-to-kpop-demon-hunters-and-sinners-2000708843</link>
      <pubDate>Mon, 12 Jan 2026 13:00:04 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000708843</guid>
      <description>Not a wide spread of genre wins at the 2026 Golden Globes, but Netflix and Warner Bros.' respective hits got two wins each, and 'Pluribus' landed one.</description>
    </item>
    <item>
      <title>Nearly lost, this famed sculpture gets a new life inside GM&#8217;s headquarters</title>
      <link>https://www.fastcompany.com/91470069/famed-bertoia-sculpture-gets-a-new-life-inside-gms-headquarters</link>
      <pubDate>2026-01-12T13:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91470069/famed-bertoia-sculpture-gets-a-new-life-inside-gms-headquarters</guid>
      <description>A monumental metal sculpture by artist Harry Bertoia was thought lost in a mall demolition, but has been restored and reinstalled.
Almost lost and nearly forgotten, a sculpture by one of the most noted mid-century modernist designers has been given a meticulous restoration and a starring place in the new headquarters of General Motors in downtown Detroit....</description>
    </item>
    <item>
      <title>Boost Mobile Offers $10/Month for 3 Months, Then Locks You In at $25 Forever for One of the Cheapest Unlimited Plans</title>
      <link>https://gizmodo.com/boost-mobile-offers-10-month-for-3-months-then-locks-you-in-at-25-forever-for-one-of-the-cheapest-unlimited-plans-2000708478</link>
      <pubDate>Mon, 12 Jan 2026 12:58:46 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000708478</guid>
      <description>If you need a new phone service, this offer will definitely be for you.</description>
    </item>
    <item>
      <title>NYT Connections Sports Edition today: Hints and answers for January 12, 2026</title>
      <link>https://mashable.com/article/nyt-connections-sports-edition-hint-answer-today-january-12-2026</link>
      <pubDate>Mon, 12 Jan 2026 12:56:52 +0000</pubDate>
      <guid isPermaLink="false">02oTUqouAjtKGp8ZVCzDgAB</guid>
      <description>Connections: Sports Edition is a New York Times word game about finding common sports threads between words. How to solve the day's puzzle.</description>
    </item>
    <item>
      <title>Baldur's Gate 3 might not come to Switch 2 as Larian CEO says a port 'wasn't our decision to make'</title>
      <link>https://www.techradar.com/gaming/nintendo/baldurs-gate-3-might-not-come-to-switch-2-as-larian-ceo-says-a-port-wasnt-our-decision-to-make</link>
      <pubDate>Mon, 12 Jan 2026 12:48:38 +0000</pubDate>
      <guid isPermaLink="false">uHZmnphXynp554FK2hTTxg</guid>
      <description>Nintendo Switch 2's first Christmas sales fall short of the original Switch by 35% in the US, showing markedly less of an appetite over the Holidays.</description>
    </item>
    <item>
      <title>I tried to improve my sleep using expert advice for 4 weeks and recorded it all on my Oura Ring &#8211; and it worked</title>
      <link>https://www.techradar.com/health-fitness/i-tried-to-improve-my-sleep-using-expert-advice-for-4-weeks-and-recorded-it-all-on-my-oura-ring-and-it-worked</link>
      <pubDate>Mon, 12 Jan 2026 12:47:13 +0000</pubDate>
      <guid isPermaLink="false">uPvdqkAxvhreitydwpZxyK</guid>
      <description>Is better sleep really about biohacks and perfect scores, or simply discipline and consistency? I tracked what genuinely changed and what didn&#8217;t</description>
    </item>
    <item>
      <title>Voici le Xiaomi 17 Air&#160;: des photos du smartphone abandonn&#233; sortent</title>
      <link>https://www.01net.com/actualites/voici-le-xiaomi-17-air-des-photos-du-smartphone-abandonne-sortent.html</link>
      <pubDate>Mon, 12 Jan 2026 12:46:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319424</guid>
      <description>Alors qu&#8217;Apple et Samsung ont r&#233;cemment tent&#233; l&#8217;aventure des smartphones ultrafins, Xiaomi semble avoir pr&#233;f&#233;r&#233; s&#8217;abstenir. Une d&#233;cision prudente, &#224; en croire les fuites autour d&#8217;un myst&#233;rieux Xiaomi 17 Air, prototype jamais commercialis&#233;. Trop risqu&#233;, pas assez rentable ou simplement d&#233;pass&#233;&#8239;? Le pari de la finesse extr&#234;me semble avoir perdu de son attrait dans le haut de gamme....</description>
    </item>
    <item>
      <title>Google brings buy buttons to Gemini and AI search</title>
      <link>https://www.theverge.com/news/860446/google-ai-shopping-standard-buy-button-gemini</link>
      <pubDate>2026-01-12T07:44:24-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=860446</guid>
      <description>Google turned up the heat in the AI shopping wars this weekend, announcing plans to turn Gemini into a merchant and launching an open-source standard built together with major retailers including Shopify, Walmart, and Target. The move comes as companies like OpenAI, Amazon, and Perplexity jostle for power and influence at the heart of a [&#8230;]</description>
    </item>
    <item>
      <title>KPop Demon Hunters wins best song at Golden Globes, Ejae gives moving speech</title>
      <link>https://mashable.com/video/golden-globes-kpop-demon-hunters</link>
      <pubDate>Mon, 12 Jan 2026 12:33:45 +0000</pubDate>
      <guid isPermaLink="false">00plpuwc0iSXV27wvPE5BgA</guid>
      <description>"KPop Demon Hunters" took home Golden Globes for Best Animated Feature Film and Best Original Song for eternal banger "Golden."</description>
    </item>
  </channel>
</rss>
