<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 19 Jan 2026 14:32:56 GMT</lastBuildDate>
    <item>
      <title>A Knight of the Seven Kingdoms gets a new 'in the weeks ahead' trailer &#8212; and HBO Max deserves a clout around the ear for how much it spoils</title>
      <link>https://www.techradar.com/streaming/hbo-max/a-knight-of-the-seven-kingdoms-gets-a-new-in-the-weeks-ahead-trailer-and-hbo-max-deserves-a-clout-around-the-ear-for-how-much-it-spoils</link>
      <pubDate>Mon, 19 Jan 2026 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">zH3fKLPCEkiHiyp2qcmmN8</guid>
      <description>A Knight of the Seven Kingdoms' new teaser bizarrely ruins many of its biggest surprises.</description>
    </item>
    <item>
      <title>Proton VPN kills off legacy OpenVPN configs in push for better security</title>
      <link>https://www.techradar.com/vpn/vpn-services/proton-vpn-kills-off-legacy-openvpn-configs-in-push-for-better-security</link>
      <pubDate>Mon, 19 Jan 2026 14:29:27 +0000</pubDate>
      <guid isPermaLink="false">RVdngjWBwFxpzedznWKAdV</guid>
      <description>If you manually configure your VPN on a router or legacy device, you have just weeks to update your credentials. Proton VPN is retiring older manual OpenVPN configs to enforce stronger encryption standards, though it promises to keep the protocol alive across its servers.</description>
    </item>
    <item>
      <title>La 5G 2,1 GHz arrive enfin chez Free, voici ce que &#231;a va changer pour vous</title>
      <link>https://www.frandroid.com/marques/free/2947653_la-5g-21-ghz-arrive-enfin-chez-free-voici-ce-que-ca-va-changer-pour-vous</link>
      <pubDate>Mon, 19 Jan 2026 14:13:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2947653_la-5g-21-ghz-arrive-enfin-chez-free-voici-ce-que-ca-va-changer-pour-vous</guid>
      <description>
Free pr&#233;pare l'arriv&#233;e de la 5G 2,1 GHz, une bande de fr&#233;quence entre la 700 MHz et la 3,5 GHz. Concr&#232;tement, &#231;a change quoi ?
</description>
    </item>
    <item>
      <title>Asus may have made its last phone</title>
      <link>https://www.theverge.com/news/864116/asus-may-have-made-its-last-phone</link>
      <pubDate>2026-01-19T09:10:38-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864116</guid>
      <description>Asus chairman Jonney Shih told Taiwan's Inside that the company is done making phones for now, marking the end of its Zenfone and ROG Phone lines. "Asus will no longer add new mobile phone models in the future," Shih reportedly said (translated with Google Translate). He didn't entirely rule out a return though, instead saying [&#8230;]</description>
    </item>
    <item>
      <title>Cleaning up "AI workslop" is costing businesses hundreds of hours a week</title>
      <link>https://www.techradar.com/pro/cleaning-up-ai-workslop-is-costing-businesses-hundreds-of-hours-a-week</link>
      <pubDate>Mon, 19 Jan 2026 14:05:00 +0000</pubDate>
      <guid isPermaLink="false">7hbLwrmhJS7xwazbEnN469</guid>
      <description>Most workers agree AI boosts productivity, but it could be even better if these things were fixed.</description>
    </item>
    <item>
      <title>Animal Crossing: New Horizons added just enough to suck me back in</title>
      <link>https://www.theverge.com/games/863747/animal-crossing-new-horizons-update-3-0-switch-2-quality-of-life</link>
      <pubDate>2026-01-19T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=863747</guid>
      <description>Animal Crossing has always been anti-instant gratification. By design, you have to take your time, wait for days to pass in real time, and complete a seemingly endless list of chores to build a meaningful life with your animal friends. The slowness is part of its appeal. But with New Horizons, some of that slowness [&#8230;]</description>
    </item>
    <item>
      <title>What is the release date for Fallout season 2 episode 6 on Prime Video?</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/what-is-the-release-date-for-fallout-season-2-episode-6-on-prime-video</link>
      <pubDate>Mon, 19 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">rNoXg5AE7EMzx9khwCsGAQ</guid>
      <description>There are only three more episodes of Fallout season 2 left &#8211; here's when the next one will drop where you live.</description>
    </item>
    <item>
      <title>Images folles : regardez le v&#233;hicule le plus lourd jamais construit sur Terre transporter la m&#233;ga-fus&#233;e de la Nasa</title>
      <link>https://www.futura-sciences.com/sciences/actualites/artemis-ii-images-folles-regardez-vehicule-plus-lourd-jamais-construit-terre-transporter-mega-fusee-nasa-130306/#xtor%3DRSS-8</link>
      <pubDate>Mon, 19 Jan 2026 14:55:40 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/artemis-ii-images-folles-regardez-vehicule-plus-lourd-jamais-construit-terre-transporter-mega-fusee-nasa-130306/#xtor%3DRSS-8</guid>
      <description>C&#8217;est un &#233;v&#233;nement&#160;: le lanceur de la mission Artemis II tr&#244;ne d&#233;sormais sur le pas de tir du Kennedy Space Center, marquant en quelque sorte le d&#233;but du compte &#224; rebours pour le lancement de cette mission &#224; destination de la Lune. Un transfert qui aura dur&#233; 12 heures, effectu&#233; par un engin tout...</description>
    </item>
    <item>
      <title>Mais que pr&#233;pare donc Bouygues Telecom ? L&#8217;op&#233;rateur s&#8217;appr&#234;te &#224; faire une grosse annonce le 20 janvier</title>
      <link>https://www.frandroid.com/marques/bouygues-telecom/2947549_mais-que-prepare-donc-bouygues-telecom-loperateur-sapprete-a-faire-une-grosse-annonce-le-20-janvier</link>
      <pubDate>Mon, 19 Jan 2026 13:53:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bouygues-telecom/2947549_mais-que-prepare-donc-bouygues-telecom-loperateur-sapprete-a-faire-une-grosse-annonce-le-20-janvier</guid>
      <description>
2026 est un cap particulier pour Bouygues Telecom puisque l'op&#233;rateur f&#234;te ses 30 ans cette ann&#233;e. Et histoire de marquer le coup, la presse sp&#233;cialis&#233;e, dont Frandroid, est convi&#233;e &#224; une conf&#233;rence de presse d&#233;di&#233;e &#224; la pr&#233;sentation d'une nouveaut&#233;.
</description>
    </item>
    <item>
      <title>Xiaomi met le paquet &#224; l&#8217;approche de la 3e d&#233;marque : les 12 offres &#224; prix imbattable pour les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2936033_xiaomi-met-le-paquet-a-lapproche-de-la-3e-demarque-les-12-offres-a-prix-imbattable-pour-les-soldes</link>
      <pubDate>Mon, 19 Jan 2026 13:51:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2936033_xiaomi-met-le-paquet-a-lapproche-de-la-3e-demarque-les-12-offres-a-prix-imbattable-pour-les-soldes</guid>
      <description>
Xiaomi est habitu&#233; &#224; casser les prix tout au long de l&#8217;ann&#233;e, mais c&#8217;est encore plus le cas pendant les soldes d'hiver. &#192; l'approche de la 3e d&#233;marque, les offres se multiplient, mais voici celles qui valent r&#233;ellement le coup. 
</description>
    </item>
    <item>
      <title>Microsoft expands Windows backup to include restore at first sign-in</title>
      <link>https://www.techradar.com/pro/microsoft-expands-windows-backup-to-include-restore-at-first-sign-in</link>
      <pubDate>Mon, 19 Jan 2026 13:48:55 +0000</pubDate>
      <guid isPermaLink="false">8D3rbCoMmgcgfREu9Ff4Cb</guid>
      <description>Windows 11 users will be able to restore settings to the very first sign-in.</description>
    </item>
    <item>
      <title>Galaxy Z Fold 6, Galaxy S25&#8230; les 16 meilleures offres Samsung lors des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2939747_galaxy-z-fold-6-galaxy-s25-les-16-meilleures-offres-samsung-lors-des-soldes</link>
      <pubDate>Mon, 19 Jan 2026 13:23:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2939747_galaxy-z-fold-6-galaxy-s25-les-16-meilleures-offres-samsung-lors-des-soldes</guid>
      <description>
La 3e d&#233;marque des soldes approche &#224; grands pas et les offres restent toujours attractives, notamment du c&#244;t&#233; des produits Samsung. Entre smartphones pliant &#224; -50 %, TV OLED en r&#233;duction et &#233;crans Ultra Wide OLED, il y en a pour tous les go&#251;ts.
</description>
    </item>
    <item>
      <title>Adobe refuse de le faire, un d&#233;veloppeur a r&#233;ussi &#224; installer Photoshop sur Linux</title>
      <link>https://www.frandroid.com/os/gnu-linux/2947337_adobe-refuse-de-le-faire-mais-ce-developpeur-a-reussi-voici-comment-installer-photoshop-sur-linux</link>
      <pubDate>Mon, 19 Jan 2026 13:17:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/gnu-linux/2947337_adobe-refuse-de-le-faire-mais-ce-developpeur-a-reussi-voici-comment-installer-photoshop-sur-linux</guid>
      <description>
Grande nouvelle pour les cr&#233;atifs sur Linux : l'installation de la suite Adobe Creative Suite est enfin possible gr&#226;ce &#224; l'outil Wine.
</description>
    </item>
    <item>
      <title>Forget IKEA's donut lamp &#8211; its new indoor-outdoor lamp looks like an affordable winner and it's back in stock</title>
      <link>https://www.techradar.com/home/forget-ikeas-donut-lamp-its-new-indoor-outdoor-lamp-looks-like-an-affordable-winner-and-its-back-in-stock</link>
      <pubDate>Mon, 19 Jan 2026 13:13:06 +0000</pubDate>
      <guid isPermaLink="false">Z4h3AneLpRq2wSKP98AYsF</guid>
      <description>Looking to add some style and a cozy vibe to your living spaces? The new Solvinden model could be perfect.</description>
    </item>
    <item>
      <title>The best entry-level Hi-Res Audio player is getting a new version for 2026 &#8212; make the most of lossless streaming, or up to 2TB of your own files</title>
      <link>https://www.techradar.com/audio/portable-media-players/the-best-entry-level-hi-res-audio-player-is-getting-a-new-version-for-2026-make-the-most-of-lossless-streaming-or-up-to-2tb-of-your-own-files</link>
      <pubDate>Mon, 19 Jan 2026 13:08:03 +0000</pubDate>
      <guid isPermaLink="false">x3yZ78qPuKFhDhvZVJfgsW</guid>
      <description>Fiio's portable player gets a battery boost and more storage. It's a brilliant budget buy</description>
    </item>
    <item>
      <title>Soldes 2026 : ce disque dur externe Seagate pour PS4 et PS5 baisse de prix alors que celui des SSD explosent, une alternative &#224; envisager</title>
      <link>https://www.frandroid.com/bons-plans/2947415_soldes-2026-ce-disque-dur-externe-seagate-pour-ps4-et-ps5-baisse-de-prix-alors-que-celui-des-ssd-explosent-une-alternative-a-envisager</link>
      <pubDate>Mon, 19 Jan 2026 13:05:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2947415_soldes-2026-ce-disque-dur-externe-seagate-pour-ps4-et-ps5-baisse-de-prix-alors-que-celui-des-ssd-explosent-une-alternative-a-envisager</guid>
      <description>
Sur Amazon, vous avez l'occasion de commander le Seagate Game Drive 5 To pour PS4 et PS5 &#224; 156,99 euros au lieu de 175,99 euros, une alternative solide pour stocker vos jeux &#224; l'heure de la flamb&#233;e des prix.
</description>
    </item>
    <item>
      <title>&#8217;28 Years Later: The Bone Temple&#8217; Runs to Decent Box Office Start</title>
      <link>https://gizmodo.com/28-years-later-the-bone-temple-runs-to-decent-box-office-start-2000711607</link>
      <pubDate>Mon, 19 Jan 2026 13:00:16 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711607</guid>
      <description>Some have taken a visit to the Bone Temple over the weekend, but coming out months after the first '28 Years Later' might not've helped.</description>
    </item>
    <item>
      <title>Are DJI Drones Still Banned? (2026)</title>
      <link>https://www.wired.com/story/whats-going-on-with-the-dji-drone-ban/</link>
      <pubDate>Mon, 19 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">696a5d66882fa5e83888b744</guid>
      <description>Can you still buy a DJI drone in the US? (Yes.) Will you be able to buy future drones? (Maybe.) Here are the current DJI dos and don&#8217;ts.</description>
    </item>
    <item>
      <title>Top architects reveal their dream projects for 2026</title>
      <link>https://www.fastcompany.com/91471342/top-architects-reveal-their-dream-projects-for-2026</link>
      <pubDate>2026-01-19T13:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91471342/top-architects-reveal-their-dream-projects-for-2026</guid>
      <description>Seven architects lay out their dream projects for 2026, from project types to specific buildings.
Being a field dependent on big developer clients and even bigger sums of money, rarely do architects get to pick the projects they work on. Would they if they could? Absolutely.</description>
    </item>
    <item>
      <title>The next Apple Watch ban? New lawsuit targets the &#8216;fall detection&#8217; tech in your favorite smartwatches</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/the-next-apple-watch-ban-new-lawsuit-targets-the-fall-detection-tech-in-your-favorite-smartwatches</link>
      <pubDate>Mon, 19 Jan 2026 12:59:49 +0000</pubDate>
      <guid isPermaLink="false">wsGnq9iXmy5sSCsrKsEoGj</guid>
      <description>Some of the best smartwatches could be banned from import over a fall detection patent dispute.</description>
    </item>
    <item>
      <title>The upsides to not fitting in with your company culture</title>
      <link>https://www.fastcompany.com/91472915/upsides-not-fitting-with-your-company-culture</link>
      <pubDate>2026-01-19T12:59:16</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91472915/upsides-not-fitting-with-your-company-culture</guid>
      <description>Being a moderate misfit can be good for you and the organization.
Most organizations still hire for culture fit&#8212;even those that loudly champion diversity and inclusion. The phrase sounds benign, even wise: who wouldn&#8217;t want colleagues who &#8220;fit in&#8221;? But behind this feel-good notion lies one of the biggest obstacles to innovation and progress in modern workplaces. Culture fit has become a euphemism for cultural cloning: selecting people who already look, think, and behave like the incumbents. It&#8217;s a polite way of saying, we want people like us, because there&#8217;s nothing more comforting than workin...</description>
    </item>
    <item>
      <title>So you got a new robot vacuum &#8211; here are 7 things to do first</title>
      <link>https://www.techradar.com/home/robot-vacuums/so-you-got-a-new-robot-vacuum-here-are-7-things-to-do-first</link>
      <pubDate>Mon, 19 Jan 2026 12:53:03 +0000</pubDate>
      <guid isPermaLink="false">G5ZhYEKDYG8eAN3V2PdgQ</guid>
      <description>Not sure where to start with your new robovac? Follow these 7 steps and you'll be well on your way.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs vid&#233;oprojecteurs en 2026&#8201;? Notre s&#233;lection</title>
      <link>https://www.frandroid.com/guide-dachat/843269_meilleurs-videoprojecteurs-selection</link>
      <pubDate>Mon, 19 Jan 2026 12:45:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/843269_meilleurs-videoprojecteurs-selection</guid>
      <description>
M&#234;me si les TV sont de plus en plus grandes, le meilleur moyen de reproduire une exp&#233;rience cin&#233;ma chez soi reste d'utiliser un projecteur. D&#233;couvrez notre s&#233;lection des meilleurs vid&#233;oprojecteurs test&#233;s par Frandroid.
</description>
    </item>
    <item>
      <title>D&#233;but de p&#233;nurie sur les MacBook Pro ? Ce que l&#8217;on peut d&#233;duire des d&#233;lais observ&#233;s sur certains mod&#232;les</title>
      <link>https://www.frandroid.com/marques/apple/2947287_debut-de-penurie-sur-les-macbook-pro-ce-que-lon-peut-deduire-des-delais-observes-sur-certains-modeles</link>
      <pubDate>Mon, 19 Jan 2026 12:43:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2947287_debut-de-penurie-sur-les-macbook-pro-ce-que-lon-peut-deduire-des-delais-observes-sur-certains-modeles</guid>
      <description>
Aux &#201;tats-Unis, certains mod&#232;les de MacBook Pro command&#233;s en ligne ne sont plus livr&#233;s qu'apr&#232;s deux mois d'attente. Un d&#233;lai important qui n'augure peut-&#234;tre pas d'une si mauvaise nouvelle.
</description>
    </item>
  </channel>
</rss>
