<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 02 Feb 2026 08:51:55 GMT</lastBuildDate>
    <item>
      <title>ChatGPT&#160;: le mod&#232;le d&#8217;IA pr&#233;f&#233;r&#233; des utilisateurs va dispara&#238;tre</title>
      <link>https://www.01net.com/actualites/chatgpt-abandonne-gpt%e2%80%914o-5-autres-modeles-ia-openai-mise-tout-gpt%e2%80%915-2.html</link>
      <pubDate>Mon, 02 Feb 2026 08:44:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323659</guid>
      <description>OpenAI s&#8217;appr&#234;te &#224; d&#233;brancher GPT&#8209;4o et cinq autres mod&#232;les de ChatGPT. La firme veut tout miser sur son tout nouveau GPT&#8209;5.2, qu'elle juge d&#233;sormais capable de couvrir tous les usages requis. La d&#233;cision d'OpenAI a provoqu&#233; la col&#232;re d'une partie de ses abonn&#233;s&#8230;</description>
    </item>
    <item>
      <title>Decathlon lance le Rockrider E-EXPL 100 LTD, un nouveau VTC &#233;lectrique aussi bien taill&#233; pour la ville que vos balades le week-end</title>
      <link>https://www.frandroid.com/marques/2962547_decathlon-lance-le-rockrider-e-expl-100-ltd-un-nouveau-vtc-electrique-aussi-bien-taille-pour-la-ville-que-vos-balades-le-week-end</link>
      <pubDate>Mon, 02 Feb 2026 08:42:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2962547_decathlon-lance-le-rockrider-e-expl-100-ltd-un-nouveau-vtc-electrique-aussi-bien-taille-pour-la-ville-que-vos-balades-le-week-end</guid>
      <description>
Decathlon enrichit son catalogue de v&#233;los &#233;lectriques avec le Rockrider E-EXPL 100 LTD, d&#233;voil&#233; une semaine apr&#232;s l'E-EXPL 140. Ce VTC &#233;lectrique se destine &#224; des usages mixtes, entre trajets urbains et balades sur chemins.
</description>
    </item>
    <item>
      <title>The best projector for a home theater in 2026</title>
      <link>https://www.engadget.com/home/home-theater/best-projectors-123004354.html?src=rss</link>
      <pubDate>Mon, 02 Feb 2026 08:00:35 +0000</pubDate>
      <guid isPermaLink="false">2b641319-47ec-4d6a-b43c-558615f1cffe</guid>
      <description>To see a film the way the creators intended, you really need a projector. A good one can show a bright, sharp image up to 250 inches in size for an immersive experience that no TV can match &#8212; and usually at a much lower price. Plus, they&#8217;re great for immersive gaming with consoles and PCs.Thanks to companies like Anker and Valerion, projectors are starting to be seen as a must-have item for cinephiles and outdoor party screenings alike. That means there are a wide variety of choices, ranging from classic ceiling-mounted models to battery-powered projectors you can take on a camping trick. You ...</description>
    </item>
    <item>
      <title>These AI notetaking devices can help you record and transcribe your meetings</title>
      <link>https://techcrunch.com/2026/02/02/ai-notetaker-hardware-devices-pins-pendants-record-transcribe/</link>
      <pubDate>Mon, 02 Feb 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3088174</guid>
      <description>These physical notetakers transcribe audio and give users summaries and action items of meetings using AI. Some even offer live translation.</description>
    </item>
    <item>
      <title>Dyson's new wet cleaner tackles spills and messes with ease &#8212; but for me, it isn't quite exceptional enough to justify that price tag</title>
      <link>https://www.techradar.com/home/vacuums/dyson-clean-wash-hygiene-review</link>
      <pubDate>Mon, 02 Feb 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">XFpf4ZmdPwFe5crTBUNpUR</guid>
      <description>The Clean+Wash Hygiene is an effective cleaner, but other brands offer more for a lower price.</description>
    </item>
    <item>
      <title>IPTV&#160;: 6 sites pirates ont &#233;t&#233; saisis, des millions d&#8217;abonn&#233;s priv&#233;s de streaming ill&#233;gal</title>
      <link>https://www.01net.com/actualites/iptv-6-sites-pirates-saisis-guerre-contre-streaming-illegal-continue.html</link>
      <pubDate>Mon, 02 Feb 2026 07:52:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323653</guid>
      <description>La guerre contre l'IPTV se poursuit. L'Italie vient de mettre un terme aux activit&#233;s de trois sites op&#233;rant &#224; l'&#233;chelle mondiale. Des centaines de milliers d&#8217;abonnements ont &#233;t&#233; coup&#233;s rien que sur le sol italien. En parall&#232;le, trois autres g&#233;ants de l'IPTV pirate ont &#233;t&#233; saisis en Bulgarie.</description>
    </item>
    <item>
      <title>Vous attendiez les MacBook Pro&#160;M5 Pro/Max&#8201;? Ils devraient arriver tr&#232;s bient&#244;t</title>
      <link>https://www.frandroid.com/marques/apple/2962493_vous-attendiez-les-macbook-pro-m5-pro-max-ils-devraient-arriver-tres-bientot</link>
      <pubDate>Mon, 02 Feb 2026 07:50:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2962493_vous-attendiez-les-macbook-pro-m5-pro-max-ils-devraient-arriver-tres-bientot</guid>
      <description>
En pleine p&#233;riode de crise profonde des composants, Apple s&#8217;appr&#234;te &#224; lancer une nouvelle gamme d&#8217;ordinateurs portables avec les MacBook Pro&#160;M5 Pro et M5 Max tr&#232;s bient&#244;t.
</description>
    </item>
    <item>
      <title>Les voitures &#233;lectriques Xiaomi aux USA ? &#171; Compl&#232;tement faux &#187; : la marque douche les espoirs des am&#233;ricains</title>
      <link>https://www.frandroid.com/marques/xiaomi/2962461_les-voitures-electriques-xiaomi-aux-usa-completement-faux-la-marque-douche-les-espoirs-des-americains</link>
      <pubDate>Mon, 02 Feb 2026 07:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2962461_les-voitures-electriques-xiaomi-aux-usa-completement-faux-la-marque-douche-les-espoirs-des-americains</guid>
      <description>
Xiaomi va-t-il envahir les routes am&#233;ricaines avec Ford ? La r&#233;ponse est tomb&#233;e, et elle est claire. Apr&#232;s des rumeurs persistantes de coentreprise, le g&#233;ant chinois a mis les points sur les i : pas de partenariat, pas de voitures, et surtout, aucune intention de s'installer aux &#201;tats-Unis.
</description>
    </item>
    <item>
      <title>Cet &#233;cran gamer TCL de 27&#8243;, QHD, 180 Hz et r&#233;tro&#233;clairage MiniLED est &#224; &#8211; 46%, merci les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2961209_cet-ecran-gamer-tcl-de-27-qhd-180-hz-et-retroeclairage-miniled-est-a-46-merci-les-soldes</link>
      <pubDate>Mon, 02 Feb 2026 07:19:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2961209_cet-ecran-gamer-tcl-de-27-qhd-180-hz-et-retroeclairage-miniled-est-a-46-merci-les-soldes</guid>
      <description>
Le TCL 27G64 est un &#233;cran PC d&#233;di&#233; au gaming : ses 27 pouces en QHD, sa technologie Mini-LED et ses 180 Hz font de lui une belle pi&#232;ce &#224; ajouter &#224; une config gaming. Surtout lorsque son prix passe de 369,99 euros &#224; 199 euros sur Joybuy pour la fin des soldes.
</description>
    </item>
    <item>
      <title>Higher education needs to change in order to survive the AI economy</title>
      <link>https://www.fastcompany.com/91482744/higher-education-needs-to-change-in-order-to-survive-the-ai-economy</link>
      <pubDate>2026-02-02T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91482744/higher-education-needs-to-change-in-order-to-survive-the-ai-economy</guid>
      <description>If colleges want to stay relevant in a volatile job market, they need to redesign learning. Here&#8217;s how.
A college degree is usually thought of as a ticket to a great job and a secure future. Yet, the job market over the past few years has not been kind to graduates. Rapid changes in technology and uncertainty about the influence of AI on the economy have made it harder for companies to know what their new employees need to know to be successful....</description>
    </item>
    <item>
      <title>Android Auto&#160;: ce bug absurde de Gemini Live est aussi dr&#244;le que frustrant [Video]</title>
      <link>https://www.01net.com/actualites/android-auto-bug-absurde-gemini-live-drole-frustrant.html</link>
      <pubDate>Mon, 02 Feb 2026 06:57:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323639</guid>
      <description>Gemini Live sur Android Auto est victime d&#8217;un bug qui pousse l&#8217;intelligence artificielle &#224; s&#8217;interrompre pour r&#233;pondre &#224; ses propres interventions.</description>
    </item>
    <item>
      <title>Arr&#234;tez de taper sur le WLTP : le probl&#232;me de l&#8217;autonomie de la voiture &#233;lectrique est ailleurs</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2962447_arretez-de-taper-sur-le-wltp-le-probleme-de-lautonomie-de-la-voiture-electrique-est-ailleurs</link>
      <pubDate>Mon, 02 Feb 2026 06:55:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2962447_arretez-de-taper-sur-le-wltp-le-probleme-de-lautonomie-de-la-voiture-electrique-est-ailleurs</guid>
      <description>
Vous avez sans doute d&#233;j&#224; vu ces reportages t&#233;l&#233;vis&#233;s o&#249; un conducteur d&#233;sempar&#233; peste contre sa voiture &#233;lectrique. Le grief est toujours le m&#234;me : l'autonomie r&#233;elle ne correspond pas &#224; la promesse. Pourtant, le cycle WLTP n'est pas une arnaque, c'est juste qu'il oublie une r&#233;alit&#233; bien fran&#231;aise : nos autoroutes.
</description>
    </item>
  </channel>
</rss>
