<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 30 Jan 2026 09:44:08 GMT</lastBuildDate>
    <item>
      <title>Fnac et Darty n&#8217;h&#233;sitent pas &#224; vendre au rabais de nombreux produits Tech avant la fin des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-nhesitent-pas-a-vendre-au-rabais-de-nombreux-produits-tech-avant-la-fin-des-soldes</link>
      <pubDate>Fri, 30 Jan 2026 09:35:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-nhesitent-pas-a-vendre-au-rabais-de-nombreux-produits-tech-avant-la-fin-des-soldes</guid>
      <description>
C&#8217;est la derni&#232;re d&#233;marque et il ne reste plus que quelques jours avant la fin des soldes d&#8217;hiver. Pour ce dernier week-end, la Fnac et Darty proposent encore de tr&#232;s belles offres Tech sur leurs sites : voici celles qui ont retenu notre attention.
</description>
    </item>
    <item>
      <title>YouTube bride son site mobile pour vous forcer &#224; prendre un abonnement Premium</title>
      <link>https://www.frandroid.com/android/applications/google-apps/2960881_youtube-bride-son-site-mobile-pour-vous-forcer-a-prendre-un-abonnement-premium</link>
      <pubDate>Fri, 30 Jan 2026 09:26:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/applications/google-apps/2960881_youtube-bride-son-site-mobile-pour-vous-forcer-a-prendre-un-abonnement-premium</guid>
      <description>
Google continue de serrer la vis sur les solutions permettant de contourner les limitations de YouTube. L&#8217;entreprise vient de bloquer la possibilit&#233; de lire des vid&#233;os en arri&#232;re-plan via les navigateurs web sur mobile.
</description>
    </item>
    <item>
      <title>Panne majeure chez Garmin : pourquoi des milliers d&#8217;utilisateurs d&#8217;iPhone n&#8217;ont plus acc&#232;s &#224; leurs donn&#233;es</title>
      <link>https://www.frandroid.com/marques/garmin/2960913_panne-majeure-chez-garmin-pourquoi-des-milliers-dutilisateurs-diphone-nont-plus-acces-a-leurs-donnees</link>
      <pubDate>Fri, 30 Jan 2026 09:24:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/garmin/2960913_panne-majeure-chez-garmin-pourquoi-des-milliers-dutilisateurs-diphone-nont-plus-acces-a-leurs-donnees</guid>
      <description>
Ce jeudi soir, une mise &#224; jour de l'application Garmin Connect sur iPhone a emp&#234;ch&#233; de nombreux utilisateurs de connecter leur montre &#224; leur t&#233;l&#233;phone. 
</description>
    </item>
    <item>
      <title>Le pi&#232;ge fran&#231;ais a fonctionn&#233; : les voitures &#233;lectriques chinoises calent en France comme le prouvent ces chiffres</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2960853_le-piege-francais-a-fonctionne-les-voitures-electriques-chinoises-calent-en-france-comme-le-prouvent-ces-chiffres</link>
      <pubDate>Fri, 30 Jan 2026 09:23:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2960853_le-piege-francais-a-fonctionne-les-voitures-electriques-chinoises-calent-en-france-comme-le-prouvent-ces-chiffres</guid>
      <description>
Si certains craignaient que le march&#233; automobile fran&#231;ais soit envahi de voitures &#233;lectriques chinoises, c&#8217;est encore loin d&#8217;&#234;tre le cas. Et ce m&#234;me si les ventes ont effectivement augment&#233; pour ces autos.
</description>
    </item>
    <item>
      <title>Un &#171;&#160;bombardement sans pr&#233;c&#233;dent&#160;&#187; : un botnet a lanc&#233; une nouvelle cyberattaque record</title>
      <link>https://www.01net.com/actualites/un-bombardement-sans-precedent-un-botnet-a-lance-une-nouvelle-cyberattaque-record.html</link>
      <pubDate>Fri, 30 Jan 2026 09:22:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323416</guid>
      <description>Les attaques DDoS ont franchi un nouveau palier en 2025. Peu avant No&#235;l, une nouvelle cyberattaque record a &#233;t&#233; enregistr&#233;e par les &#233;quipes de Cloudflare. C'est la plus puissante attaque jamais r&#233;v&#233;l&#233;e publiquement. Elle est l'&#339;uvre du botnet Kimwolf, qui a pirat&#233; des milions de t&#233;l&#233;viseurs Android.</description>
    </item>
    <item>
      <title>'This project is a glimpse at what thoughtful, creative, artist-led use of AI can look like' &#8212; George Washington meets Google DeepMind, as Darren Aronofsky&#8217;s AI history series hits YouTube</title>
      <link>https://www.techradar.com/ai-platforms-assistants/this-project-is-a-glimpse-at-what-thoughtful-creative-artist-led-use-of-ai-can-look-like-george-washington-meets-google-deepmind-as-darren-aronofskys-ai-history-series-hits-youtube</link>
      <pubDate>Fri, 30 Jan 2026 09:21:59 +0000</pubDate>
      <guid isPermaLink="false">mgmCDPq8cnjuS5xaGSMsBm</guid>
      <description>Time is releasing Darren Aronofsky's On This Day&#8230; 1776, a YouTube series that dramatizes key Revolutionary War moments using AI-generated visuals</description>
    </item>
    <item>
      <title>I tested the Asus V16 and it&#8217;s as portable as large gaming laptops get &#8212; but this isn&#8217;t the only aspect that impressed me</title>
      <link>https://www.techradar.com/computing/gaming-laptops/asus-v16-review</link>
      <pubDate>Fri, 30 Jan 2026 09:13:35 +0000</pubDate>
      <guid isPermaLink="false">p6neM2gnf75eQgnQLQZAfH</guid>
      <description>Large gaming laptops don&#8217;t get more portable than the Asus V16 &#8212; but does it cut it in other areas?</description>
    </item>
    <item>
      <title>La Chine met fin &#224; la guerre des prix dans le secteur des batteries solaires et des voitures &#233;lectriques</title>
      <link>https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2960465_la-chine-met-fin-a-la-guerre-des-prix-dans-le-secteur-des-batteries-solaires-et-des-voitures-electriques</link>
      <pubDate>Fri, 30 Jan 2026 09:12:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2960465_la-chine-met-fin-a-la-guerre-des-prix-dans-le-secteur-des-batteries-solaires-et-des-voitures-electriques</guid>
      <description>
C&#8217;est probablement la fin de la guerre des prix pour les fabricants chinois de batteries. La Chine vient d&#8217;engager une s&#233;rie de mesures destin&#233;es &#224; remettre de l&#8217;ordre dans son industrie devenue chaotique, ce qui signifie que les prix pourraient bient&#244;t repartir &#224; la hausse.
</description>
    </item>
    <item>
      <title>Derni&#232;re d&#233;marque des soldes d&#8217;hiver : les 50 meilleures offres &#224; ne surtout pas rater</title>
      <link>https://www.frandroid.com/bons-plans/2957561_les-meilleures-offres-tombent-pour-la-derniere-demarque-des-soldes-dhiver-voici-le-top-25</link>
      <pubDate>Fri, 30 Jan 2026 09:09:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2957561_les-meilleures-offres-tombent-pour-la-derniere-demarque-des-soldes-dhiver-voici-le-top-25</guid>
      <description>
Il ne faut pas se le cacher, la derni&#232;re d&#233;marque des soldes est souvent le moment o&#249; l'on trouve les meilleures offres, car les e-commer&#231;ants comme Amazon, Fnac, Darty ou encore Boulanger veulent &#233;couler les derniers stocks. Avec cet article, vous serez s&#251;rs de ne manquer aucun deal Tech int&#233;ressant. 
</description>
    </item>
    <item>
      <title>Pourquoi les d&#233;veloppeurs l&#226;chent la Xbox : les 3 raisons d&#8217;un divorce annonc&#233;</title>
      <link>https://www.frandroid.com/marques/microsoft/2960861_pourquoi-les-developpeurs-lachent-la-xbox-les-3-raisons-dun-divorce-annonce</link>
      <pubDate>Fri, 30 Jan 2026 09:06:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2960861_pourquoi-les-developpeurs-lachent-la-xbox-les-3-raisons-dun-divorce-annonce</guid>
      <description>
Ce n'est pas qu'une question de chiffres, c'est une question de survie technique. Si seuls 20 % des studios misent encore sur la Xbox en 2026, c'est que la console de Microsoft est devenue un v&#233;ritable casse-t&#234;te &#224; g&#233;rer face &#224; une concurrence.
</description>
    </item>
    <item>
      <title>I&#8217;ve Tested 1,000+ Sex Toys. These 8 Are What I Always Recommend</title>
      <link>https://www.wired.com/gallery/i-have-tested-1000-sex-toys-these-8-are-what-i-always-recommend/</link>
      <pubDate>Fri, 30 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">697b8ce0b07b2f9a1e79e3f3</guid>
      <description>With close to two decades of experience, these are the sex toys I have no trouble recommending to most people.</description>
    </item>
    <item>
      <title>La version Switch 2 de Final Fantasy VII Remake Intergrade est d&#233;j&#224; en promotion pour la fin des soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2922037_la-version-switch-2-de-final-fantasy-vii-remake-intergrade-est-deja-en-promotion-pour-la-fin-des-soldes-dhiver</link>
      <pubDate>Fri, 30 Jan 2026 08:57:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2922037_la-version-switch-2-de-final-fantasy-vii-remake-intergrade-est-deja-en-promotion-pour-la-fin-des-soldes-dhiver</guid>
      <description>
Final Fantasy VII Remake Intergrade est sorti le 22 janvier 2026 sur Switch 2 et Amazon vous le propose d&#233;j&#224; en solde &#224; 37,72 euros au lieu de 49,99 euros avec, en cadeau, un booster Magic: The Gathering - Final Fantasy.
</description>
    </item>
    <item>
      <title>Volkswagen Polo &#224; 25 000 &#8364; : la version Cupra d&#233;voile d&#233;j&#224; son tarif en France et c&#8217;est une bonne nouvelle</title>
      <link>https://www.frandroid.com/marques/cupra/2960811_volkswagen-id-2-a-25-000-e-la-version-cupra-devoile-deja-son-tarif-en-france-et-cest-une-bonne-nouvelle</link>
      <pubDate>Fri, 30 Jan 2026 08:47:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/cupra/2960811_volkswagen-id-2-a-25-000-e-la-version-cupra-devoile-deja-son-tarif-en-france-et-cest-une-bonne-nouvelle</guid>
      <description>
Bient&#244;t d&#233;voil&#233;e, la nouvelle Cupra Raval, cousine de l'ID. Polo de Volkswagen, nous donne de nouvelles informations &#224; son sujet. La petite voiture &#233;lectrique abordable d&#233;voile sa gamme, ainsi que son prix de d&#233;part.
</description>
    </item>
    <item>
      <title>Tesla n&#8217;est plus un constructeur auto&#160;: pourquoi la fin des Model S et X change tout</title>
      <link>https://www.01net.com/actualites/tesla-nest-plus-un-constructeur-auto-pourquoi-la-fin-des-model-s-et-x-change-tout.html</link>
      <pubDate>Fri, 30 Jan 2026 08:47:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323363</guid>
      <description>Tesla arr&#234;te les Model S et X pour tout miser sur le robot Optimus. Entre profits soutenus par les cr&#233;dits carbone et rumeurs de fusion avec SpaceX et xAI, Musk semble orchestrer la m&#233;tamorphose ultime de son empire.</description>
    </item>
    <item>
      <title>Galaxy S26 et Buds 4 : on conna&#238;t (enfin) la date de l&#8217;Unpacked</title>
      <link>https://www.frandroid.com/marques/samsung/2960885_galaxy-s26-et-buds-4-on-connait-enfin-la-date-de-lunpacked</link>
      <pubDate>Fri, 30 Jan 2026 08:36:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2960885_galaxy-s26-et-buds-4-on-connait-enfin-la-date-de-lunpacked</guid>
      <description>
L'incontournable Evan Blass vient de partager ce qui semble &#234;tre l'invitation officielle pour le prochain Galaxy Unpacked. Le 25 f&#233;vrier 2026, Samsung pr&#233;sentera ses Galaxy S26 et les Galaxy Buds 4.
</description>
    </item>
    <item>
      <title>Un bug touche 4 banques fran&#231;aises et Vinted&#160;: votre compte a peut-&#234;tre &#233;t&#233; d&#233;bit&#233; par erreur</title>
      <link>https://www.01net.com/actualites/bug-banques-francaises-vinted-compte-debite-erreur.html</link>
      <pubDate>Fri, 30 Jan 2026 08:15:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323402</guid>
      <description>De nombreux clients de Boursorama, Banque Populaire, Caisse d&#8217;&#201;pargne ou encore Cr&#233;dit Coop&#233;ratif ont &#233;t&#233; d&#233;bit&#233;s par erreur ces derniers jours. D'anciennes transactions, notamment en provenance de Vinted, ont &#233;t&#233; trait&#233;es une deuxi&#232;me fois. Il ne s'agit pas d'une fraude, mais d'un incident chez un prestataire de paiement.</description>
    </item>
    <item>
      <title>PS5, Xbox Series, Nintendo Switch 2&#8230; quelle console de jeux acheter en 2026&#8201;?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-gaming/466481_guide-dachat-quelle-console-de-jeu-choisir-en-2017</link>
      <pubDate>Fri, 30 Jan 2026 08:13:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-gaming/466481_guide-dachat-quelle-console-de-jeu-choisir-en-2017</guid>
      <description>
PlayStation&#160;5 ou 5 Pro, Xbox Series X|S, Nintendo Switch 2, Steam Deck, ROG Ally&#8230; voici notre comparatif des&#160;meilleures consoles de jeux en 2026, de salon ou portables. Amis gamers, amies gameuses, d&#233;couvrez laquelle est faite pour vous.
</description>
    </item>
    <item>
      <title>Xbox au bord du gouffre, les d&#233;veloppeurs d&#233;laissent en masse les consoles de Microsoft</title>
      <link>https://www.frandroid.com/marques/microsoft/2960837_xbox-au-bord-du-gouffre-les-developpeurs-delaissent-en-masse-les-consoles-de-microsoft</link>
      <pubDate>Fri, 30 Jan 2026 08:06:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2960837_xbox-au-bord-du-gouffre-les-developpeurs-delaissent-en-masse-les-consoles-de-microsoft</guid>
      <description>
Le dernier rapport de la GDC vient de tomber et les chiffres sont sans appel : la Xbox Series X|S perd son attrait aupr&#232;s des d&#233;veloppeurs. D&#233;sormais, m&#234;me le Steam Deck semble plus s&#233;duisant pour lancer un jeu.
</description>
    </item>
    <item>
      <title>Fallout Season 1 is now free to watch on YouTube</title>
      <link>https://mashable.com/article/fallout-watch-free-youtube-how-to</link>
      <pubDate>Fri, 30 Jan 2026 08:02:20 +0000</pubDate>
      <guid isPermaLink="false">03LRotK8Kf5SVF3QLKJesd3</guid>
      <description>Prime Video is temporarily uploading all eight episodes of 'Fallout; Season 1 to its official YouTube account for free.</description>
    </item>
    <item>
      <title>Windows 11 prend l&#8217;eau, Microsoft promet de colmater les br&#232;ches</title>
      <link>https://www.01net.com/actualites/windows-11-prend-leau-microsoft-promet-de-colmater-les-breches.html</link>
      <pubDate>Fri, 30 Jan 2026 08:01:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323389</guid>
      <description>Windows 11, c'est compliqu&#233; en ce moment. Entre les bugs, les probl&#232;mes de stabilit&#233; et l'injection massive d'IA parfois &#224; tort et &#224; travers, on ne peut pas dire que le syst&#232;me d'exploitation fasse la joie de ses utilisateurs. Microsoft promet de faire mieux cette ann&#233;e.</description>
    </item>
    <item>
      <title>The best budgeting apps for 2026</title>
      <link>https://www.engadget.com/apps/best-budgeting-apps-120036303.html?src=rss</link>
      <pubDate>Fri, 30 Jan 2026 08:00:36 +0000</pubDate>
      <guid isPermaLink="false">1bf1c17b-7ece-4b18-b17b-dc7b5e70f411</guid>
      <description>Managing your finances doesn&#8217;t have to be a headache &#8212; especially with the right budgeting app at your fingertips. Whether you&#8217;re trying to track everyday spending, save for a big purchase or just keep a closer eye on your subscriptions, there&#8217;s an app that can help. With Mint shutting down, plenty of users have been looking for the best budget apps to replace it, and luckily there are plenty of solid alternatives.From AI-powered spending trackers to apps that break down your expenses into easy-to-follow categories, the best budgeting tools help you take control of your money without the hassl...</description>
    </item>
    <item>
      <title>Belkin is pulling the plug on its Wemo smart home range tomorrow &#8211; here&#8217;s the full list and what to do</title>
      <link>https://www.techradar.com/home/smart-home/belkin-is-pulling-the-plug-on-its-wemo-smart-home-range-tomorrow-heres-the-full-list-and-what-to-do</link>
      <pubDate>Fri, 30 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">ngoFDspV5DX7PWffWqBuHS</guid>
      <description>As of January 31, Belkin is shutting down a large number of Wemo smart home devices, including wiping its app and cloud features.</description>
    </item>
    <item>
      <title>Google Maps&#160;: Gemini peut d&#233;sormais vous servir de guide touristique personnel</title>
      <link>https://www.01net.com/actualites/google-maps-gemini-peut-desormais-servir-guide-touristique-personnel.html</link>
      <pubDate>Fri, 30 Jan 2026 07:58:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323404</guid>
      <description>Google Maps et Gemini peuvent maintenant vous aider &#224; d&#233;couvrir votre environnement lors de vos trajets &#224; pied et &#224; v&#233;lo.</description>
    </item>
  </channel>
</rss>
