<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 24 Nov 2025 08:55:44 GMT</lastBuildDate>
    <item>
      <title>Google alerte sur une gigantesque fuite de donn&#233;es</title>
      <link>https://www.01net.com/actualites/google-leve-voile-gigantesque-fuite-donnees.html</link>
      <pubDate>Mon, 24 Nov 2025 08:33:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310555</guid>
      <description>Google tire la sonnette d&#8217;alarme au sujet d'une grande fuite de donn&#233;es. Plus de 200 entreprises ont en effet vu leurs informations siphonn&#233;es durant une attaque ciblant des applications tierces connect&#233;es &#224; Salesforce. L&#8217;op&#233;ration, orchestr&#233;e par le gang ShinyHunters, vise &#224; extorquer de l'argent aux victimes.</description>
    </item>
    <item>
      <title>Nouvelle faillite dans le v&#233;lo &#233;lectrique, cette fois d&#8217;un sp&#233;cialiste allemand apr&#232;s 36 ans d&#8217;existence</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2880805_nouvelle-faillite-dans-le-velo-electrique-cette-fois-dun-specialiste-allemand-apres-36-ans-dexistence</link>
      <pubDate>Mon, 24 Nov 2025 08:32:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2880805_nouvelle-faillite-dans-le-velo-electrique-cette-fois-dun-specialiste-allemand-apres-36-ans-dexistence</guid>
      <description>
Jugeant le march&#233; du v&#233;lo &#233;lectrique trop compliqu&#233;, la marque allemande sp&#233;cialiste du VTT M1-Sporttechnik mettra la cl&#233; sous la porte au printemps 2026, apr&#232;s 36 ans d&#8217;existence.
</description>
    </item>
    <item>
      <title>Guerre aux drones&#160;: la France veut changer la loi pour mieux se d&#233;fendre</title>
      <link>https://www.01net.com/actualites/guerre-drones-france-veut-changer-loi-pour-mieux-defendre.html</link>
      <pubDate>Mon, 24 Nov 2025 08:07:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310537</guid>
      <description>Des drones non identifi&#233;s survolent des bases militaires et des sites strat&#233;giques fran&#231;ais depuis plusieurs semaines. Le gouvernement veut modifier la l&#233;gislation pour permettre aux arm&#233;es de neutraliser plus rapidement les drones espions.</description>
    </item>
    <item>
      <title>Attention aux arnaques aux codes promo qui explosent pendant le Black Friday</title>
      <link>https://www.01net.com/actualites/arnaques-codes-promo-explosent-pendant-black-friday.html</link>
      <pubDate>Mon, 24 Nov 2025 07:43:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310064</guid>
      <description>&#192; l'approche du Black Friday 2025, les cybercriminels multiplient les arnaques aux faux codes promo. Ces escroqueries, en pleine expansion en France, visent &#224; d&#233;rober vos donn&#233;es personnelles et bancaires en promettant des r&#233;ductions trop all&#233;chantes&#8230;</description>
    </item>
    <item>
      <title>Ce r&#233;cent vid&#233;oprojecteur 4K &#224; ultra-courte focale Hisense baisse d&#233;j&#224; son prix de 20 % en pleine Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2880855_ce-recent-videoprojecteur-4k-a-ultra-courte-focale-hisense-baisse-deja-son-prix-de-20-en-pleine-black-friday-week</link>
      <pubDate>Mon, 24 Nov 2025 07:41:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2880855_ce-recent-videoprojecteur-4k-a-ultra-courte-focale-hisense-baisse-deja-son-prix-de-20-en-pleine-black-friday-week</guid>
      <description>
Lanc&#233; il y a quelques semaines, le Hisense PT1 est un vid&#233;oprojecteur &#224; ultra-courte focale, donc pens&#233; pour offrir une grande image &#224; seulement quelques centim&#232;tres du mur. Il a aussi l'avantage de cumuler les compatibilit&#233;s. Pendant le Black Friday, Son-Vid&#233;o le propose &#224; 1 999 euros au lieu de 2 499 euros.
</description>
    </item>
    <item>
      <title>Plus d&#8217;IA et moins de bugs&#160;: Apple red&#233;finit ses priorit&#233;s logicielles pour 2026</title>
      <link>https://www.frandroid.com/marques/apple/2882379_plus-dia-et-moins-de-bugs-apple-redefinit-ses-priorites-logicielles-pour-2026</link>
      <pubDate>Mon, 24 Nov 2025 07:40:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2882379_plus-dia-et-moins-de-bugs-apple-redefinit-ses-priorites-logicielles-pour-2026</guid>
      <description>
Apr&#232;s un changement esth&#233;tique d&#8217;ampleur avec l&#8217;adoption de l&#8217;interface &#171;&#8201;Liquid Glass&#8201;&#187;, Apple semble d&#233;sormais vouloir se concentrer sur l&#8217;optimisation de son syst&#232;me plut&#244;t que sur une nouvelle r&#233;volution d&#8217;usage.
</description>
    </item>
    <item>
      <title>Gmail&#160;: non, Google n&#8217;utilise pas vos e-mails pour entra&#238;ner son IA</title>
      <link>https://www.01net.com/actualites/gmail-non-google-nutilise-pas-vos-e-mails-pour-entrainer-son-ia.html</link>
      <pubDate>Mon, 24 Nov 2025 07:40:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310550</guid>
      <description>Le bruit court que Google utiliserait le contenu de vos e-mails pour entra&#238;ner son intelligence artificielle. Cette fausse information qui s&#8217;est r&#233;pandue comme une tra&#238;n&#233;e de poudre a &#233;t&#233; d&#233;mentie par l&#8217;entreprise.</description>
    </item>
    <item>
      <title>Galaxy S26 Ultra : Samsung sortirait enfin de sa l&#233;thargie sur la batterie et la vitesse de charge, il &#233;tait temps</title>
      <link>https://www.frandroid.com/marques/samsung/2882375_galaxy-s26-ultra-samsung-sortirait-enfin-de-sa-lethargie-sur-la-batterie-et-la-vitesse-de-charge-il-etait-temps</link>
      <pubDate>Mon, 24 Nov 2025 07:28:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2882375_galaxy-s26-ultra-samsung-sortirait-enfin-de-sa-lethargie-sur-la-batterie-et-la-vitesse-de-charge-il-etait-temps</guid>
      <description>
C'est peut-&#234;tre la fin d'une &#232;re frustrante. Depuis le Galaxy S20 Ultra, Samsung nous sert la m&#234;me recette : 5000 mAh et une charge qui plafonne. Mais selon les derni&#232;res informations, le S26 Ultra adopterait une capacit&#233; de 5200 mAh et du Qi2 magn&#233;tique, sans oublier une vitesse de charge bien plus rapide. Il &#233;tait temps.
</description>
    </item>
    <item>
      <title>Face &#224; Google Gemini 3, Sam Altman tire la sonnette d&#8217;alarme en interne</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2882363_face-a-google-gemini-3-sam-altman-tire-la-sonnette-dalarme-en-interne</link>
      <pubDate>Mon, 24 Nov 2025 07:17:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2882363_face-a-google-gemini-3-sam-altman-tire-la-sonnette-dalarme-en-interne</guid>
      <description>
Apr&#232;s des mois &#224; parader comme le ma&#238;tre incontest&#233; de l'IA, le masque tombe chez OpenAI. Une note interne de Sam Altman, r&#233;v&#233;l&#233;e par The Information, dresse un constat brutal : l'ambiance est morose, Google est revenu dans la course, et la croissance risque de caler.
</description>
    </item>
    <item>
      <title>Xiaomi&#160;: ce smartphone tr&#232;s populaire ne recevra plus de mise &#224; jour majeure</title>
      <link>https://www.01net.com/actualites/xiaomi-smartphone-tres-populaire-recevra-plus-mise-a-jour.html</link>
      <pubDate>Mon, 24 Nov 2025 07:01:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310524</guid>
      <description>Xiaomi met &#224; jour sa liste des appareils compatibles avec sa nouvelle interface HyperOS 3. Certains mod&#232;les pourtant tr&#232;s proches ne profitent malheureusement pas tous du m&#234;me traitement.</description>
    </item>
    <item>
      <title>Europe Is Bending the Knee to the US on Tech Policy</title>
      <link>https://www.wired.com/story/europe-bends-us-digital-policies-eu-ai-act/</link>
      <pubDate>Mon, 24 Nov 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">691ce993426eddd4340b7d49</guid>
      <description>The Trump administration's pressure on European regulators is having an impact, with fewer restrictions on Big Tech and canceled measures.</description>
    </item>
    <item>
      <title>Closing the wealth gap: The solution is hiding in plain sight</title>
      <link>https://www.fastcompany.com/91446200/closing-the-wealth-gap-the-solution-hiding-in-plain-sight</link>
      <pubDate>2025-11-24T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91446200/closing-the-wealth-gap-the-solution-hiding-in-plain-sight</guid>
      <description>And the timing to make lasting change could not be better.
When an X user recently pointed out the eye-popping increase in billionaires&#8217; wealth since 2015, entrepreneur Mark Cuban, a billionaire himself, responded with his opinion on why, but he urged followers to consider a different question:</description>
    </item>
    <item>
      <title>Test du Hasselblad X2D II 100C : la photo, rien que la photo, mais en grand</title>
      <link>https://www.frandroid.com/produits-android/photo/appareil-photo/2873711_test-du-hasselblad-x2d-ii-100c-la-photo-rien-que-la-photo-mais-en-grand</link>
      <pubDate>Mon, 24 Nov 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/photo/appareil-photo/2873711_test-du-hasselblad-x2d-ii-100c-la-photo-rien-que-la-photo-mais-en-grand</guid>
      <description>
Le Hasselblad X2D II 100C aligne un immense capteur moyen format de 100 m&#233;gapixels, une stabilisation nettement renforc&#233;e et un HDR tr&#232;s inspir&#233; du smartphone, tout en restant un bo&#238;tier radicalement photo, sans vid&#233;o ni compromis. Son tarif demeure &#233;litiste, malgr&#233; une baisse d&#8217;environ 1 000 &#8364; par rapport au X2D, mais il promet une qualit&#233; d&#8217;image qui interroge : jusqu&#8217;o&#249; peut-on vraiment pousser le moyen format en usage &#8220;terrain&#8221; ?
...</description>
    </item>
  </channel>
</rss>
