<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 25 Nov 2025 09:44:24 GMT</lastBuildDate>
    <item>
      <title>Amazon n&#8217;h&#233;site pas &#224; baisser davantage le prix de l&#8217;iPad Air 11 M3 pour la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2859359_amazon-nhesite-pas-a-baisser-davantage-le-prix-de-lipad-air-11-m3-pour-la-black-friday-week</link>
      <pubDate>Tue, 25 Nov 2025 09:36:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2859359_amazon-nhesite-pas-a-baisser-davantage-le-prix-de-lipad-air-11-m3-pour-la-black-friday-week</guid>
      <description>
La nouvelle tablette tactile iPad Air M3 version 11 pouces sorti en 2025 est un mod&#232;le qui impressionne avec sa puce M3 dont le prix ne cesse de baisser sur Amazon. D&#8217;abord en promotion &#224; 599 euros, le g&#233;ant am&#233;ricain la propose maintenant &#224; 539 euros.
</description>
    </item>
    <item>
      <title>Une enqu&#234;te ridiculise les justifications de Rockstar Games</title>
      <link>https://www.frandroid.com/produits-android/console/2884313_gta-6-une-enquete-ridiculise-les-justifications-de-rockstar-games</link>
      <pubDate>Tue, 25 Nov 2025 09:29:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2884313_gta-6-une-enquete-ridiculise-les-justifications-de-rockstar-games</guid>
      <description>
Renvoy&#233;s officiellement pour avoir r&#233;v&#233;l&#233; des informations internes, les 34 ex-salari&#233;s de Rockstar Games auraient en r&#233;alit&#233; &#233;t&#233; punis pour leurs contacts avec des syndicats.
</description>
    </item>
    <item>
      <title>TV pour PS5 et Xbox Series : voici les meilleurs TV gaming de 2025</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-tv/1012263_guide-meilleurs-tv-ps5-xbox-series-x-s-consoles-gaming</link>
      <pubDate>Tue, 25 Nov 2025 09:20:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-tv/1012263_guide-meilleurs-tv-ps5-xbox-series-x-s-consoles-gaming</guid>
      <description>
Vous avez finalement mis la main sur la console de jeu de vos r&#234;ves, et vous recherchez le meilleur t&#233;l&#233;viseur avec une connectique HDMI 2.1 pour en profiter&#8239;? Pas de souci, nous avons choisi pour vous les meilleurs TV gaming pour la PS5 et la Xbox Series X|S.
</description>
    </item>
    <item>
      <title>On vous explique The Bitcoin Society, le projet d&#8217;&#201;ric Larchev&#234;que qui veut transformer la bourse en coffre-fort Bitcoin</title>
      <link>https://www.frandroid.com/crypto-monnaie/2884361_on-vous-explique-the-bitcoin-society-le-projet-deric-larcheveque-qui-veut-transformer-la-bourse-en-coffre-fort-bitcoin</link>
      <pubDate>Tue, 25 Nov 2025 09:20:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/crypto-monnaie/2884361_on-vous-explique-the-bitcoin-society-le-projet-deric-larcheveque-qui-veut-transformer-la-bourse-en-coffre-fort-bitcoin</guid>
      <description>
ous avez vu passer le nom "The Bitcoin Society" partout depuis 24 heures. C'est normal. &#201;ric Larchev&#234;que vient de r&#233;aliser un tour de passe-passe financier : racheter une vieille entreprise immobili&#232;re cot&#233;e pour la transformer en coffre-fort &#224; Bitcoin. Mais derri&#232;re la m&#233;canique boursi&#232;re, il y a un projet de soci&#233;t&#233; beaucoup plus vaste (et un peu plus flou). 
...</description>
    </item>
    <item>
      <title>La Black Friday Week se plie en deux pour nous offrir ce top 10 sur les meilleures promotions autour des PC portables bureautiques</title>
      <link>https://www.frandroid.com/bons-plans/2848587_black-friday-pc-portables-bureautique-et-ultraportables-voici-les-meilleures-offres</link>
      <pubDate>Tue, 25 Nov 2025 09:18:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848587_black-friday-pc-portables-bureautique-et-ultraportables-voici-les-meilleures-offres</guid>
      <description>
&#192; l'instar du smartphone, le PC portable fait partie des essentiels high-tech &#224; avoir, plus particuli&#232;rement les configurations bureautiques. Que ce soit pour travailler ou simplement remplir sa d&#233;claration d'imp&#244;ts. Ce n'est en g&#233;n&#233;ral pas donn&#233;, mais voici une s&#233;lection de belles offres en ce Black Friday pour s'&#233;quiper sans se ruiner.
</description>
    </item>
    <item>
      <title>Le gouvernement de Donald Trump revient &#224; la charge sur les &#171;&#160;lois num&#233;riques de l&#8217;UE&#160;&#187;</title>
      <link>https://www.01net.com/actualites/le-gouvernement-de-donald-trump-revient-a-la-charge-sur-les-lois-numeriques-de-lue.html</link>
      <pubDate>Tue, 25 Nov 2025 09:03:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310931</guid>
      <description>Le ministre am&#233;ricain du Commerce a d&#233;clar&#233;, lors d'une visite &#224; Bruxelles lundi 24 novembre, que l'assouplissement des lois num&#233;riques europ&#233;ennes &#233;tait un pr&#233;alable &#224; toute n&#233;gociation sur l'acier et l'aluminium. Ce malgr&#233; la pr&#233;sentation du projet de simplification des lois num&#233;riques de la Commission europ&#233;enne la semaine derni&#232;re, analys&#233;e comme un geste destin&#233; &#224; apaiser le gouvernement am&#233;ricain... qui n'aura pas suffi....</description>
    </item>
    <item>
      <title>5 reasons why we need social connection in real life</title>
      <link>https://www.fastcompany.com/91438982/why-we-need-social-connection-in-real-life</link>
      <pubDate>2025-11-25T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91438982/why-we-need-social-connection-in-real-life</guid>
      <description>It turns out social media may not be very social at all.
Below, Ben Rein shares five key insights from his new book,&#160;Why Brains Need Friends: The Neuroscience of Social Connection.</description>
    </item>
    <item>
      <title>It&#8217;s not your job. Your social media feed is ruining your workday</title>
      <link>https://www.fastcompany.com/91447525/its-not-your-job-your-social-media-feed-is-ruining-your-workday</link>
      <pubDate>2025-11-25T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91447525/its-not-your-job-your-social-media-feed-is-ruining-your-workday</guid>
      <description>New research suggests your feed may be shaping your mood, productivity, and interactions at work far more than you realize.
When work was drying up for freelance writer Megan Carnegie, she found herself compulsively hopping between apps and social media. &#8220;LinkedIn, WhatsApp, emails&#8212;and it was just terrible for my focus,&#8221; she says. &#8220;I was anxious about getting work.&#8221;...</description>
    </item>
    <item>
      <title>La France rattrape enfin son retard sur la voiture &#233;lectrique en Europe comme le prouvent ces excellents chiffres</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2884225_la-france-rattrape-enfin-son-retard-sur-la-voiture-electrique-en-europe-comme-le-prouvent-ces-excellents-chiffres</link>
      <pubDate>Tue, 25 Nov 2025 08:51:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2884225_la-france-rattrape-enfin-son-retard-sur-la-voiture-electrique-en-europe-comme-le-prouvent-ces-excellents-chiffres</guid>
      <description>
Bonne nouvelle, les immatriculations de voitures &#233;lectriques sont en hausse en Europe au mois d&#8217;octobre 2025. Et c&#8217;est aussi le cas en France, qui conna&#238;t une tr&#232;s nette augmentation.
</description>
    </item>
    <item>
      <title>Black Friday 2025 en DIRECT : les offres continuent de pleuvoir chez Amazon, Boulanger, Fnac, Darty&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2876855_black-friday-2025-voici-les-meilleurs-deals-a-saisir-en-direct-chez-amazon-boulanger-fnac-darty</link>
      <pubDate>Tue, 25 Nov 2025 08:50:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2876855_black-friday-2025-voici-les-meilleurs-deals-a-saisir-en-direct-chez-amazon-boulanger-fnac-darty</guid>
      <description>
La Black Friday Week bat son plein chez Amazon, Fnac, Darty, Boulanger et Cdiscount. C&#8217;est le moment parfait pour b&#233;n&#233;ficier des meilleures r&#233;ductions sur les smartphones, tablettes, ordinateurs portables ou t&#233;l&#233;viseurs. D&#233;couvrez ici, en temps r&#233;el, les offres tech les plus attractives du moment.
</description>
    </item>
    <item>
      <title>Microsoft Copilot pourra se fermer plus facilement sur Windows 11</title>
      <link>https://www.frandroid.com/marques/microsoft/2884235_microsoft-copilot-pourra-se-fermer-plus-facilement-sur-windows-11</link>
      <pubDate>Tue, 25 Nov 2025 08:45:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2884235_microsoft-copilot-pourra-se-fermer-plus-facilement-sur-windows-11</guid>
      <description>
Microsoft veut faire &#233;voluer Copilot et lui donner une nouvelle commande vocale. De quoi transformer l'exp&#233;rience IA sur Windows 11 en exp&#233;rience mains libres. 
</description>
    </item>
    <item>
      <title>Quels sont les meilleurs smartphones compacts en 2025 ? La s&#233;lection</title>
      <link>https://www.frandroid.com/guide-dachat/smartphones/350089_iphone-se-petit-smartphone-choisir-a-place</link>
      <pubDate>Tue, 25 Nov 2025 08:35:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/smartphones/350089_iphone-se-petit-smartphone-choisir-a-place</guid>
      <description>
Les t&#233;l&#233;phones sont devenus tr&#232;s grands dans nos paumes, mais heureusement, quelques irr&#233;ductibles tournent encore autour des 6&#160;pouces. Voici nos recommandations des meilleurs smartphones compacts.
</description>
    </item>
    <item>
      <title>Intel Panther Lake : les premiers benchmarks du Core Ultra 9 386H sentent plut&#244;t bon</title>
      <link>https://www.frandroid.com/marques/intel/2884199_intel-panther-lake-les-premiers-benchmarks-du-core-ultra-9-386h-sentent-plutot-bon</link>
      <pubDate>Tue, 25 Nov 2025 08:34:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/intel/2884199_intel-panther-lake-les-premiers-benchmarks-du-core-ultra-9-386h-sentent-plutot-bon</guid>
      <description>
Attendues en janvier au CES, les nouvelles puces Intel Panther Lake se laissent sporadiquement approcher au travers de quelques benchmarks r&#233;alis&#233;s en douce. Le Core Ultra 9 386H nous offre de cette fa&#231;on un premier aper&#231;u de ses performances sous Geekbench 6.
</description>
    </item>
    <item>
      <title>Ce r&#233;cent vid&#233;oprojecteur nomade Philips Full HD sous Google TV est &#224; prix cass&#233; pour la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2882919_ce-recent-videoprojecteur-nomade-philips-full-hd-sous-google-tv-est-a-prix-casse-pour-la-black-friday-week</link>
      <pubDate>Tue, 25 Nov 2025 08:32:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2882919_ce-recent-videoprojecteur-nomade-philips-full-hd-sous-google-tv-est-a-prix-casse-pour-la-black-friday-week</guid>
      <description>
Le Philips NeoPix 450 Smart est un vid&#233;oprojecteur compact, capable d'afficher de la Full HD sur 100 pouces et accessible pour 329 euros au lieu de 399 euros.
</description>
    </item>
    <item>
      <title>ChatGPT devient votre assistant shopping, pile &#224; temps pour le Black Friday</title>
      <link>https://www.01net.com/actualites/chatgpt-devient-votre-assistant-shopping-pile-a-temps-pour-le-black-friday.html</link>
      <pubDate>Tue, 25 Nov 2025 08:30:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310933</guid>
      <description>OpenAI lance &#171; Recherche Shopping &#187; dans ChatGPT. Cette nouvelle fonction doit aider les utilisateurs &#224; choisir le bon produit en fonction de son budget et ses besoins. Pour aider son interlocuteur, ChatGPT r&#233;alise des guides d'achat &#224; la demande.</description>
    </item>
    <item>
      <title>Spotify pr&#233;parerait encore des augmentations de prix</title>
      <link>https://www.frandroid.com/services/streaming-musical/2884275_spotify-preparerait-encore-des-augmentations-de-prix</link>
      <pubDate>Tue, 25 Nov 2025 08:18:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/streaming-musical/2884275_spotify-preparerait-encore-des-augmentations-de-prix</guid>
      <description>
L'abonnement &#224; Spotify pourrait une nouvelle fois augmenter de prix. Dans un premier temps aux &#201;tats-Unis.
</description>
    </item>
    <item>
      <title>Seth Meyers pokes fun at Trump being utterly charmed by Mamdani</title>
      <link>https://mashable.com/video/seth-meyers-mamdani-trump-meeting</link>
      <pubDate>Tue, 25 Nov 2025 08:10:49 +0000</pubDate>
      <guid isPermaLink="false">06ISHzMswuOk7BEDJbquVCY</guid>
      <description>Seth Meyers has weighed in on President Donald Trump's meeting with New York mayor-elect Zohran Mamdani last week.</description>
    </item>
    <item>
      <title>Get Hulu and Starz for just $2.99 a month this Black Friday &#8211; a whole year of entertainment for less!</title>
      <link>https://www.techradar.com/streaming/hulu/get-hulu-and-starz-for-just-usd2-99-a-month-this-black-friday-a-whole-year-of-entertainment-for-less</link>
      <pubDate>Tue, 25 Nov 2025 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">RHYcpTdYmNx3ezuGnGkCQD</guid>
      <description>This Black Friday Hulu and Starz bundle deal gets you a ton of content for a rock bottom price.</description>
    </item>
    <item>
      <title>Want to add HBO Max to your Hulu subscription? Get it for just $2.99 per month this Black Friday</title>
      <link>https://www.techradar.com/streaming/hbo-max/want-to-add-hbo-max-to-your-hulu-subscription-get-it-for-just-usd2-99-per-month-this-black-friday</link>
      <pubDate>Tue, 25 Nov 2025 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">5vi2raLEmjntnhr2MN2q6e</guid>
      <description>This Black Friday deal lets Hulu subscribers add HBO Max for a bargain price.</description>
    </item>
    <item>
      <title>Ce TV 4K Philips grand de 65 pouces et Ambilight passe sous la barre des 550 &#8364; en pleine Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2883065_ce-tv-4k-philips-grand-de-65-pouces-et-ambilight-passe-sous-la-barre-des-550-e-en-pleine-black-friday-week</link>
      <pubDate>Tue, 25 Nov 2025 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2883065_ce-tv-4k-philips-grand-de-65-pouces-et-ambilight-passe-sous-la-barre-des-550-e-en-pleine-black-friday-week</guid>
      <description>
En ce Black Friday, le t&#233;l&#233;viseur Philips 65PUS8200 s'impose comme l'un des meilleurs moyens de profiter de la technologie Ambilight sans pour autant faire exploser son budget. Amazon propose en effet ce mod&#232;le &#224; 520,70 euros au lieu de 699 euros.
</description>
    </item>
  </channel>
</rss>
