<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 06 Dec 2025 08:30:08 GMT</lastBuildDate>
    <item>
      <title>Darty remplit la hotte du P&#232;re No&#235;l avec ce pack Google Pixel 10 Pro XL + Bang &amp; Olufsen Beosound Explorer &#224; prix cass&#233; (-30 %)</title>
      <link>https://www.frandroid.com/bons-plans/2898859_darty-remplit-la-hotte-du-pere-noel-avec-ce-pack-google-pixel-10-pro-xl-bang-olufsen-beosound-explorer-a-prix-casse-30</link>
      <pubDate>Sat, 06 Dec 2025 08:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2898859_darty-remplit-la-hotte-du-pere-noel-avec-ce-pack-google-pixel-10-pro-xl-bang-olufsen-beosound-explorer-a-prix-casse-30</guid>
      <description>
Tel un petit lutin du P&#232;re No&#235;l, Darty met en pack deux produits haut de gamme : le smartphone Google Pixel 10 Pro XL et l'enceinte Bang &amp; Olufsen Beosound Explore pour 1 099 euros au lieu de 1 548 euros.
</description>
    </item>
    <item>
      <title>OpenAI siphonne les cerveaux d&#8217;Apple pour son futur appareil IA</title>
      <link>https://www.01net.com/actualites/openai-siphonne-les-cerveaux-dapple-pour-son-futur-appareil-ia.html</link>
      <pubDate>Sat, 06 Dec 2025 08:02:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314078</guid>
      <description>Alors que Meta s&#8217;est d&#233;j&#224; offert plusieurs figures cl&#233;s d&#8217;Apple, OpenAI intensifie aussi le d&#233;bauchage au sein de la firme de Cupertino. Ing&#233;nieurs, designers, sp&#233;cialistes de l&#8217;audio ou de la robotique&#8230; les d&#233;parts se multiplient,</description>
    </item>
    <item>
      <title>Votre Pixel a un &#171; bouton cach&#233; &#187; au dos et la derni&#232;re mise &#224; jour le rend enfin utile</title>
      <link>https://www.frandroid.com/marques/google/2901169_votre-pixel-a-un-bouton-cache-au-dos-et-la-derniere-mise-a-jour-le-rend-enfin-utile</link>
      <pubDate>Sat, 06 Dec 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2901169_votre-pixel-a-un-bouton-cache-au-dos-et-la-derniere-mise-a-jour-le-rend-enfin-utile</guid>
      <description>
La derni&#232;re mise &#224; jour d'Android pour les Pixel am&#233;liore sensiblement la fiabilit&#233; du geste le plus pratique de ces smartphones : le Double appui au dos pour lancer une action.
</description>
    </item>
    <item>
      <title>Hackers, police, tueurs &#224; gage&#8230; : les tentatives d&#8217;extorsion explosent &#224; cause des fuites de donn&#233;es</title>
      <link>https://www.01net.com/actualites/hackers-police-tueurs-gage-tentatives-extorsion-explosent-cause-fuites-donnees.html</link>
      <pubDate>Sat, 06 Dec 2025 07:14:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312646</guid>
      <description>Port&#233;es par l&#8217;explosion des fuites de donn&#233;es, les campagnes d&#8217;extorsion par e&#8209;mail se multiplient. Les pirates se font passer pour la police ou encore un tueur &#224; gage engag&#233; pour vous tuer.</description>
    </item>
    <item>
      <title>Think before you click: most free file-sharing apps expose your downloads to security risks, warns Surfshark</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/think-before-you-click-most-free-file-sharing-apps-expose-your-downloads-to-security-risks-warns-surfshark</link>
      <pubDate>Sat, 06 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">iPKLWdCdieejU3at4Nycu8</guid>
      <description>Most free file-sharing apps do not perform antivirus scans on files uploaded by their customers, warns Surfshark. Here's all you need to know.</description>
    </item>
    <item>
      <title>AI widens vision. But without insight, it narrows it</title>
      <link>https://www.fastcompany.com/91433776/ai-widens-vision-but-without-insight-it-narrows-it</link>
      <pubDate>2025-12-06T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91433776/ai-widens-vision-but-without-insight-it-narrows-it</guid>
      <description>As AI transforms decision-making, leaders face a new challenge: staying self-aware enough to question the certainty their own algorithms create.
Artificial intelligence is everywhere. It fuels boardroom debates, guides priorities, defines access to information, and nudges consumer experiences. But while AI promises sharper insights and faster action, it also accelerates blind spots leaders already struggle with....</description>
    </item>
    <item>
      <title>How entrepreneurs can stay motivated when the competition is relentless</title>
      <link>https://www.fastcompany.com/91449018/how-to-stay-motivated-when-the-competition-is-relentless</link>
      <pubDate>2025-12-06T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91449018/how-to-stay-motivated-when-the-competition-is-relentless</guid>
      <description>When markets get crowded and motivation evaporates, the most resilient entrepreneurs rely on three fundamentals.
Entrepreneurs face more stress, fear, and anxiety in a single day than most people experience in a year. When building something in a crowded market, motivation doesn&#8217;t just dip&#8212;it can disappear entirely. What is the difference between those who burn out and those who break through? They&#8217;ve mastered the three fundamentals: finding their real &#8220;why,&#8221; setting their own scorecard, and playing the long game.&#160;...</description>
    </item>
    <item>
      <title>Internet en panne, PS5 Pro plus rentable, Google Messages m&#233;tamorphos&#233; : les actus tech qu&#8217;il ne fallait pas rater &#8211; Tech&#8217;spresso</title>
      <link>https://www.frandroid.com/actualites-generales/2900983_internet-en-panne-ps5-pro-plus-rentable-google-messages-metamorphose-les-actus-tech-quil-ne-fallait-pas-rater-techspresso</link>
      <pubDate>Sat, 06 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2900983_internet-en-panne-ps5-pro-plus-rentable-google-messages-metamorphose-les-actus-tech-quil-ne-fallait-pas-rater-techspresso</guid>
      <description>
Le vendredi 5 d&#233;cembre 2025 a &#233;t&#233; riche en rebondissements avec une panne Internet, des r&#233;v&#233;lations sur la PS5 Pro,  nouvelles tendances dans le monde du gaming et un nouveau look pour Google Messages. Si vous avez manqu&#233; les temps forts, voici un r&#233;capitulatif des articles les plus lus sur Frandroid hier.
</description>
    </item>
  </channel>
</rss>
