<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 08 Nov 2025 14:33:00 GMT</lastBuildDate>
    <item>
      <title>Avant-Black Friday smartphones &#224; moins de 500 euros : les meilleures offres sur les Samsung Galaxy, Xiaomi Redmi et Nothing Phone</title>
      <link>https://www.frandroid.com/bons-plans/2856691_le-black-month-est-la-avec-des-reductions-phares-le-top-des-meilleures-offres-de-smartphones-a-moins-de-500-e</link>
      <pubDate>Sat, 08 Nov 2025 14:22:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2856691_le-black-month-est-la-avec-des-reductions-phares-le-top-des-meilleures-offres-de-smartphones-a-moins-de-500-e</guid>
      <description>
Si le Black Friday se fera attendre jusqu'&#224; la fin du mois, les e-commer&#231;ants fran&#231;ais n'ont eux pas attendu pour lancer des offres. Les smartphones font partie des produits qui profitent de r&#233;ductions vraiment int&#233;ressantes, notamment sur l'entr&#233;e et le milieu de gamme. 
</description>
    </item>
    <item>
      <title>Nothing ear (a) : ces excellents &#233;couteurs not&#233;s 9/10 sont &#224; -50% lors du pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2734199_nothing-ear-a-ces-excellents-ecouteurs-notes-9-10-sont-a-50-lors-du-pre-black-friday</link>
      <pubDate>Sat, 08 Nov 2025 14:04:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2734199_nothing-ear-a-ces-excellents-ecouteurs-notes-9-10-sont-a-50-lors-du-pre-black-friday</guid>
      <description>
Les Nothing Ear (a) sont des &#233;couteurs abordables qui ne manquent pas d&#8217;int&#233;r&#234;t puisqu&#8217;il existe tr&#232;s peu de diff&#233;rences avec le mod&#232;le plus haut de gamme de la marque.&#160;Lors du pr&#233;-Black Friday, ils ne co&#251;tent pas plus de 50 euros, au lieu de 99 euros &#224; leur sortie.
</description>
    </item>
    <item>
      <title>I tested the Acer APS322 - and this portable power station might have done well two years ago, but it lacks the sophistication of an EcoFlow and Jackery unit</title>
      <link>https://www.techradar.com/pro/acer-aps322-portable-power-station-review</link>
      <pubDate>Sat, 08 Nov 2025 14:01:00 +0000</pubDate>
      <guid isPermaLink="false">bhA3WdQRR2SBcxKo9WV6bR</guid>
      <description>The Acer APS322 uses LiFePO4 chemistry to provide limited powering of mains AC appliances while away from the grid</description>
    </item>
    <item>
      <title>The Matic robot vacuum is smarter, quieter, and gets the job done</title>
      <link>https://www.theverge.com/tech/816645/matic-robot-vacuum-review</link>
      <pubDate>2025-11-08T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=816645</guid>
      <description>Robot vacuums are amazing machines, but they can also be a pain in the arse. In my home, testing a new robot vacuum often means digging it out from under my living room couch or unhooking it from the legs of my lounger. Then there's being woken at 3AM by a cheery "resuming cleaning," getting [&#8230;]</description>
    </item>
    <item>
      <title>How startups can lure good talent&#160;fairly without big tech bank accounts</title>
      <link>https://techcrunch.com/2025/11/08/how-startups-can-lure-good-talent-fairly-without-big-tech-bank-accounts/</link>
      <pubDate>Sat, 08 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3065645</guid>
      <description>Three industry insiders walk through how startups can set up an employee equity strategy that remains fair as a company grows.</description>
    </item>
    <item>
      <title>VisionQuest: everything we know so far about the Marvel TV show on Disney+</title>
      <link>https://www.techradar.com/streaming/disney-plus/visionquest-hub</link>
      <pubDate>Sat, 08 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">ew9yevo3iVAYDkuFh6TJQb</guid>
      <description>VisionQuest is the final entry of the Disney+ story that began with WandaVision &#8211; here's what we know about the Marvel TV show.</description>
    </item>
    <item>
      <title>Le Black Friday arrive en avance pour r&#233;duire les prix des v&#233;los &#233;lectriques : voici les meilleures offres que nous avons trouv&#233;</title>
      <link>https://www.frandroid.com/bons-plans/2860283_le-black-friday-arrive-en-avance-pour-reduire-les-prix-des-velos-electriques-voici-les-meilleures-offres-que-nous-avons-trouve</link>
      <pubDate>Sat, 08 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860283_le-black-friday-arrive-en-avance-pour-reduire-les-prix-des-velos-electriques-voici-les-meilleures-offres-que-nous-avons-trouve</guid>
      <description>
Les premi&#232;res offres du Black Friday sont tomb&#233;es bien en avance cette ann&#233;e et sur tous les domaines. Les v&#233;los &#233;lectriques b&#233;n&#233;ficient eux aussi de promotions et c'est ce que nous vous d&#233;voilons dans notre s&#233;lection des meilleures offres de VAE. 
</description>
    </item>
    <item>
      <title>Grab the four-star Samsung Galaxy Fit3 for under &#163;35 at Amazon</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/grab-the-four-star-samsung-galaxy-fit3-for-under-gbp35-at-amazon</link>
      <pubDate>Sat, 08 Nov 2025 13:57:38 +0000</pubDate>
      <guid isPermaLink="false">jfuJVug9ySVWUp9GTyLSME</guid>
      <description>Own the feature-rich Samsung Galaxy Fit3 for under &#163;35 at Amazon with this early Black Friday deal.</description>
    </item>
    <item>
      <title>Le Black Friday liquide les stocks de smartphones  : voici le meilleur des promos sur les iPhone d&#8217;Apple, Samsung Galaxy et Google Pixel</title>
      <link>https://www.frandroid.com/bons-plans/2848295_le-black-friday-liquide-les-stocks-de-smartphones-notre-top-10-des-promos-sur-les-iphone-dapple-samsung-galaxy-et-google-pixel</link>
      <pubDate>Sat, 08 Nov 2025 13:31:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848295_le-black-friday-liquide-les-stocks-de-smartphones-notre-top-10-des-promos-sur-les-iphone-dapple-samsung-galaxy-et-google-pixel</guid>
      <description>
Le Black Friday est bien en avance cette ann&#233;e, et de tous les produits tech, ce sont les smartphones qui en profitent le plus. Samsung Galaxy, iPhone d'Apple, Google Pixel, Xiaomi Redmi, de l'entr&#233;e au haut de gamme, voyons ce que r&#233;servent les e-commer&#231;ants en ce d&#233;but de Black November.
</description>
    </item>
    <item>
      <title>England vs Fiji live streams: How to watch Autumn International 2025, TV channels, team news, preview</title>
      <link>https://www.techradar.com/how-to-watch/rugby/england-vs-fiji-autumn-internationals-2025</link>
      <pubDate>Sat, 08 Nov 2025 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">tFh2VFREJVBqZUCsCLa6zf</guid>
      <description>All the ways to watch England vs Fiji live streams online from anywhere in the Autumn Nations Series 2025 at Twickenham as the Pacific Islanders visit.</description>
    </item>
    <item>
      <title>On a test&#233; le nouveau VanMoof : le retour en gr&#226;ce du v&#233;lo &#233;lectrique connect&#233; longtemps tomb&#233; en disgr&#226;ce</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2853909_on-a-teste-le-nouveau-vanmoof-le-retour-en-grace-du-velo-electrique-connecte-longtemps-tombe-en-disgrace</link>
      <pubDate>Sat, 08 Nov 2025 13:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2853909_on-a-teste-le-nouveau-vanmoof-le-retour-en-grace-du-velo-electrique-connecte-longtemps-tombe-en-disgrace</guid>
      <description>
Apr&#232;s un mod&#232;le S5 fiabilis&#233;, le VanMoof S6 peaufine le style et la technologie d&#8217;un v&#233;lo &#233;lectrique qui ne d&#233;&#231;oit sur aucun point, que ce soit la connectivit&#233; ou la conduite &#224; bo&#238;te automatique. Nous l'avons test&#233;, voici notre verdict.
</description>
    </item>
    <item>
      <title>The endearing movie that affirms creativity as a human act</title>
      <link>https://www.theverge.com/entertainment/816399/peter-hujars-day-ira-sachs-interview</link>
      <pubDate>2025-11-08T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=816399</guid>
      <description>Peter Hujar's Day began, as many great works of art do, with a DM. Director Ira Sachs (Passages, The Delta) had just finished reading a recently unearthed interview between the late portrait photographer Peter Hujar and writer Linda Rosenkrantz that took place in 1974. That dialogue - a conversation about creative anxieties, complete with the [&#8230;]</description>
    </item>
    <item>
      <title>Soaring electricity rates fueled Democratic victories &#8212; now comes the hard part</title>
      <link>https://www.theverge.com/report/816946/electricity-rates-election-democrats</link>
      <pubDate>2025-11-08T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=816946</guid>
      <description>While there's plenty for voters to be worried about right now, rising utility bills have become a hot-button issue. The success of Democrats in New Jersey, Virginia, and Georgia in this week's elections can be seen as something of a referendum on the state of energy policy and infrastructure in the US as power grids [&#8230;]</description>
    </item>
    <item>
      <title>How to watch Italy vs Australia: free streams, TV channels and team news for 2025 Autumn Internationals rugby game</title>
      <link>https://www.techradar.com/how-to-watch/rugby/watch-italy-vs-australia-autumn-internationals-2025</link>
      <pubDate>Sat, 08 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">p4W4wAWi2bGdcybH4WxHBo</guid>
      <description>All the ways to watch Italy vs Australia live streams online, with Louis Lynagh set for a starring role in the 2025 Autumn International at Stadio Friuli.</description>
    </item>
    <item>
      <title>This week in business: from AI turbulence to airline refunds</title>
      <link>https://www.fastcompany.com/91437222/this-week-in-business-from-ai-turbulence-to-airline-refunds</link>
      <pubDate>2025-11-08T13:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91437222/this-week-in-business-from-ai-turbulence-to-airline-refunds</guid>
      <description>Builders, banks, and burger chains are all changing course to survive an era when growth takes more imagination than momentum.
If you glanced at the headlines this week, you might think everything is fine. Markets are not in full panic mode, unemployment is not spiking, and earnings season is still producing plenty of upbeat charts for investor decks. Underneath that, though, there is a very different story taking shape about what it takes to keep growth going when people are tired of paying more for less....</description>
    </item>
  </channel>
</rss>
