<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 19 Dec 2025 17:21:38 GMT</lastBuildDate>
    <item>
      <title>The best Sonos speakers to buy in 2025</title>
      <link>https://www.theverge.com/tech/652171/best-sonos-speakers</link>
      <pubDate>2025-12-19T12:18:22-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=652171</guid>
      <description>After the self-induced tumult Sonos has gone through this year, I can understand why some people are reluctant to spend money on the company&#8217;s products. But newly appointed CEO Tom Conrad has shown that he&#8217;s determined to get back on track and revitalize Sonos as the leading whole-home audio brand. The contentious mobile app is [&#8230;]</description>
    </item>
    <item>
      <title>How to use AirPods as a video mic in iOS 26</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/how-to-use-airpods-as-a-video-mic-in-ios-26</link>
      <pubDate>Fri, 19 Dec 2025 17:16:51 +0000</pubDate>
      <guid isPermaLink="false">mpdCUvyzZwr8FAbHGdoz8U</guid>
      <description>In iOS 26, your AirPods can double as a video microphone. Here&#8217;s how to enable the feature.</description>
    </item>
    <item>
      <title>iRobot rachet&#233; : votre Roomba va-t-il arr&#234;ter de fonctionner ? Vos donn&#233;es seront-elles stock&#233;es en Chine ? La r&#233;ponse officielle</title>
      <link>https://www.frandroid.com/marques/irobot/2917257_irobot-rachete-votre-roomba-va-t-il-arreter-de-fonctionner-vos-donnees-seront-elles-stockees-en-chine-la-reponse-officielle</link>
      <pubDate>Fri, 19 Dec 2025 17:10:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/irobot/2917257_irobot-rachete-votre-roomba-va-t-il-arreter-de-fonctionner-vos-donnees-seront-elles-stockees-en-chine-la-reponse-officielle</guid>
      <description>
iRobot, le pionnier am&#233;ricain, passe sous le contr&#244;le du chinois Picea. Imm&#233;diatement, la question se pose : votre Roomba va-t-il cesser de fonctionner ? On a interrog&#233; Gary Cohen, le CEO d'iRobot.
</description>
    </item>
    <item>
      <title>The Best Movie Moments of 2025</title>
      <link>https://gizmodo.com/the-best-movie-moments-of-2025-2000700814</link>
      <pubDate>Fri, 19 Dec 2025 17:08:11 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000700814</guid>
      <description>From 'Sinners' and 'Superman' to 'Weapons' and 'Wicked: For Good,' here are our picks for the best movie moments of 2025.</description>
    </item>
    <item>
      <title>The RAM shortage is here to stay, raising prices on PCs and phones</title>
      <link>https://www.theverge.com/news/848199/ram-shortage-pc-phone-price-increases</link>
      <pubDate>2025-12-19T12:06:40-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=848199</guid>
      <description>Your next smartphone or PC might cost more amid a global memory shortage that the International Data Corporation expects to "persist well into 2027." A new report from the research firm lays out the potential impact of the RAM crunch, saying it "signals the end of an era of cheap, abundant memory and storage" - [&#8230;]</description>
    </item>
    <item>
      <title>Checkr review</title>
      <link>https://www.techradar.com/pro/checkr-review</link>
      <pubDate>Fri, 19 Dec 2025 17:01:16 +0000</pubDate>
      <guid isPermaLink="false">MSHZ7PW7Ta3mTUEAZu8p9U</guid>
      <description>In this Checkr review, you'll learn more about the fast, flexible, and tech-driven background screening solution.</description>
    </item>
    <item>
      <title>Steam lance ses promotions de No&#235;l : notre s&#233;lection des 28 meilleures offres PC</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-gaming/2915233_steam-lance-ses-promotions-de-noel-notre-selection-des-28-meilleures-offres-pc</link>
      <pubDate>Fri, 19 Dec 2025 17:00:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-gaming/2915233_steam-lance-ses-promotions-de-noel-notre-selection-des-28-meilleures-offres-pc</guid>
      <description>
Apr&#232;s le Black Friday, la plateforme Steam refait le plein de promotions sur de nombreux jeux vid&#233;o pour les f&#234;tes de fin d'ann&#233;e ! Ces offres sont &#233;videmment plus int&#233;ressantes que d'habitude, que ce soit sur le montant de la r&#233;duction ou les jeux concern&#233;s ! Voici la liste qui m&#233;rite le coup d'&#339;il.
</description>
    </item>
    <item>
      <title>Moon Race Heats Up as New NASA Chief Pits One Billionaire Against Another</title>
      <link>https://gizmodo.com/moon-race-heats-up-as-new-nasa-chief-pits-one-billionaire-against-another-2000701826</link>
      <pubDate>Fri, 19 Dec 2025 17:00:12 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000701826</guid>
      <description>Whichever company can produce a viable crew lander first will win the Artemis 3 contract, NASA&#8217;s new chief says.</description>
    </item>
    <item>
      <title>Bose&#8217;s first-gen QC Ultra headphones just hit their lowest price to date</title>
      <link>https://www.theverge.com/gadgets/846881/bose-quietcomfort-ultra-headphones-first-gen-deal-sale-2025</link>
      <pubDate>2025-12-19T12:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=846881</guid>
      <description>If you value peace and quiet, particularly when traveling, Bose&#8217;s first-gen QuietComfort Ultra Headphones are worth checking out. They&#8217;re our favorite noise-canceling headphones for travel, and right now, you can snag a pair for an all-time low of $279 ($150 off) in select colors from Amazon, Best Buy, and Bose. All three retailers estimate that [&#8230;]...</description>
    </item>
    <item>
      <title>Netflix acquires gaming avatar maker Ready Player Me</title>
      <link>https://techcrunch.com/2025/12/19/netflix-acquires-gaming-avatar-maker-ready-player-me/</link>
      <pubDate>Fri, 19 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3077727</guid>
      <description>The gaming startup will allow Netflix subscribers to create avatars that can extend across gaming titles.</description>
    </item>
    <item>
      <title>The Competitor is a no-nonsense symmetrical Xbox controller that barely puts a foot wrong</title>
      <link>https://www.techradar.com/gaming/hyperkin-the-competitor-review</link>
      <pubDate>Fri, 19 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">iKNCJNwL52LpS4QzEKxweP</guid>
      <description>The Competitor might not be stacked to the gills with features, but there&#8217;s much to love in its straightforward, no-nonsense approach.</description>
    </item>
    <item>
      <title>Voici quel est le meilleur aspirateur robot de l&#8217;ann&#233;e &#8211; Frandroid Awards 2025</title>
      <link>https://www.frandroid.com/marques/dji/2895983_voici-quel-est-le-meilleur-aspirateur-robot-de-lannee-frandroid-awards-2025</link>
      <pubDate>Fri, 19 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dji/2895983_voici-quel-est-le-meilleur-aspirateur-robot-de-lannee-frandroid-awards-2025</guid>
      <description>
Le meilleur aspirateur robot selon Frandroid est le DJI Romo P. D&#233;couvrez pour ce mod&#232;le a re&#231;u le Frandroid Awards de sa cat&#233;gorie. 
</description>
    </item>
    <item>
      <title>ExpressVPN holiday deal: the top VPN for Windows just got significantly more affordable</title>
      <link>https://www.techradar.com/vpn/vpn-services/expressvpn-holiday-deal-the-top-vpn-for-windows-just-got-significantly-more-affordable</link>
      <pubDate>Fri, 19 Dec 2025 16:56:59 +0000</pubDate>
      <guid isPermaLink="false">weQ4EstvDQHn3AaJDRRAVf</guid>
      <description>ExpressVPN has dropped its prices just in time for the holidays, with savings of up to $40 on offer.</description>
    </item>
    <item>
      <title>AI is likely to replace jobs, Bank of England governor warns</title>
      <link>https://www.techradar.com/pro/ai-is-likely-to-replace-jobs-bank-of-england-governor-warns</link>
      <pubDate>Fri, 19 Dec 2025 16:50:00 +0000</pubDate>
      <guid isPermaLink="false">fhcKT7bya8BfTCCXqF4gC3</guid>
      <description>Bank of England Governor warns that AI could replace some entry-level jobs, making it hard for younger workers to find jobs.</description>
    </item>
    <item>
      <title>Apr&#232;s la RAM, ce composant vital de votre PC est le prochain sur la liste des p&#233;nuries</title>
      <link>https://www.frandroid.com/marques/nvidia/2917017_apres-la-ram-ce-composant-vital-de-votre-pc-est-le-prochain-sur-la-liste-des-penuries</link>
      <pubDate>Fri, 19 Dec 2025 16:48:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2917017_apres-la-ram-ce-composant-vital-de-votre-pc-est-le-prochain-sur-la-liste-des-penuries</guid>
      <description>
Nvidia est &#224; l'avant-garde d'une nouvelle g&#233;n&#233;ration de SSD d&#233;di&#233;e &#224; l'IA. Un projet qui pourrait bien provoquer une p&#233;nurie de stockage similaire &#224; celle de la RAM, et ce d&#232;s 2027.
</description>
    </item>
    <item>
      <title>Colorado River states deadlocked on water deal as deadline gets pushed back</title>
      <link>https://www.fastcompany.com/91463601/colorado-river-states-water-deal</link>
      <pubDate>2025-12-19T16:45:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463601/colorado-river-states-water-deal</guid>
      <description>Existing water conservation agreements that determine who must use less of the river in times of shortage expire in 2026 and states haven&#8217;t reached a deal.
The seven states that rely on the&#160;Colorado River&#160;to supply farms and cities across the U.S. West appear no closer to reaching a consensus on a long-term plan for sharing the dwindling resource.</description>
    </item>
    <item>
      <title>Une &#171; grosse claque &#187; : le patron europ&#233;en du design Stellantis nous explique comment l&#8217;IA leur permet de gagner du temps et de l&#8217;argent</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2901117_une-grosse-claque-le-patron-europeen-du-design-stellantis-nous-explique-comment-lia-leur-permet-de-gagner-du-temps-et-de-largent</link>
      <pubDate>Fri, 19 Dec 2025 16:42:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2901117_une-grosse-claque-le-patron-europeen-du-design-stellantis-nous-explique-comment-lia-leur-permet-de-gagner-du-temps-et-de-largent</guid>
      <description>
Apr&#232;s une br&#232;ve excursion chez Renault, Gilles Vidal revient chez Stellantis pour chapeauter le design des marques europ&#233;ennes du groupe. Nous l'avons rencontr&#233; pour discuter du futur du design automobile &#224; l'&#232;re de la voiture &#233;lectrique, de l'intelligence artificielle et des innombrables marques chinoises.
</description>
    </item>
    <item>
      <title>Cette r&#233;cente montre connect&#233;e avec plus de 10 jours d&#8217;autonomie est d&#233;j&#224; &#224; prix cass&#233;</title>
      <link>https://www.frandroid.com/bons-plans/2836437_cette-recente-montre-connectee-avec-plus-de-10-jours-dautonomie-est-deja-a-prix-casse</link>
      <pubDate>Fri, 19 Dec 2025 16:39:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2836437_cette-recente-montre-connectee-avec-plus-de-10-jours-dautonomie-est-deja-a-prix-casse</guid>
      <description>
Loin derri&#232;re les prix des Garmin, Polar et autres montres sportives premium, l'Amazfit Balance 2 nous a bluff&#233;s lors de notre prise en main. chez Decathlon, elle entame m&#234;me ses premi&#232;res baisses de prix et passe &#224; 239 euros au lieu de 299 euros.
</description>
    </item>
    <item>
      <title>New research reveals AI is fueling an 'unprecedented surge in cloud security risks'</title>
      <link>https://www.techradar.com/pro/security/new-research-reveals-ai-is-fueling-an-unprecedented-surge-in-cloud-security-risks</link>
      <pubDate>Fri, 19 Dec 2025 16:35:00 +0000</pubDate>
      <guid isPermaLink="false">xihbdf8tiuuxvuvuzxgkRZ</guid>
      <description>Businesses are rushing to deploy AI, creating overly permissioned, misconfigured systems.</description>
    </item>
    <item>
      <title>Arnaque au flagrant d&#233;lit&#160;: comment de faux policiers pi&#232;gent les Fran&#231;ais</title>
      <link>https://www.01net.com/actualites/arnaque-flagrant-delit-comment-faux-policiers-piegent-francais.html</link>
      <pubDate>Fri, 19 Dec 2025 16:30:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316261</guid>
      <description>La Gendarmerie nationale alerte sur une nouvelle vague d&#8217;arnaques. Cette fois, l'escroc se fait passer pour un faux policier charg&#233; de prendre un pirate en flagrant d&#233;lit.</description>
    </item>
    <item>
      <title>The best Secret Santa gift ideas for 2025: Affordable gifts you can still get from Lego, Apple, Yeti and more</title>
      <link>https://www.engadget.com/the-best-secret-santa-gift-ideas-for-2025-affordable-gifts-you-can-still-get-from-lego-apple-yeti-and-more-130014284.html?src=rss</link>
      <pubDate>Fri, 19 Dec 2025 16:30:35 +0000</pubDate>
      <guid isPermaLink="false">d3419426-0b76-49ed-9322-bfc6839435ec</guid>
      <description>Secret Santa gift exchanges can be chaotic in the best way. One minute you&#8217;re drawing a name from a hat, the next you&#8217;re scrambling to figure out what they&#8217;d actually like. The trick is finding something that&#8217;s thoughtful, gets a laugh or feels useful without going over budget. Luckily there are plenty of gifts that do exactly that, whether you&#8217;re shopping for the office exchange, a family swap or a friend group tradition. From clever gadgets to playful desk toys and little luxuries, these ideas prove you can spend less than $50 and still land the perfect Secret Santa present.
Best Secret Sant...</description>
    </item>
    <item>
      <title>We have more details on the TikTok deal, including some ownership statistics</title>
      <link>https://www.engadget.com/social-media/we-have-more-details-on-the-tiktok-deal-including-some-ownership-statistics-163003507.html?src=rss</link>
      <pubDate>Fri, 19 Dec 2025 16:30:03 +0000</pubDate>
      <guid isPermaLink="false">b7b2b6ce-9a50-4651-b91e-f13993fe6401</guid>
      <description>TikTok has signed a deal to spin off its American business, according to reporting from Associated Press and others. This should keep the popular social media app available in the US for good, capping off years of drama.
We now have some new data as to the specifics of the deal. Nearly 50 percent of assets will be split between three companies. Oracle, Silver Lake and MGX will each control around 15 percent of the newly-formed entity. It's worth noting that MGX isn't an American company at all, but rather Abu Dhabi&#8217;s state-owned investment firm.
The rest will remain in the hands of affiliates ...</description>
    </item>
    <item>
      <title>Test du TCL A1s, un vid&#233;oprojecteur compact sous Google TV avec d&#8217;excellentes prestations</title>
      <link>https://www.frandroid.com/marques/2890301_test-du-tcl-a1s-que-vaut-ce-videoprojecteur-compact</link>
      <pubDate>Fri, 19 Dec 2025 16:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2890301_test-du-tcl-a1s-que-vaut-ce-videoprojecteur-compact</guid>
      <description>
Avec le TCL A1s, le constructeur chinois investit le segment des vid&#233;oprojecteurs compacts et connect&#233;s, promettant une exp&#233;rience cin&#233;ma &#224; domicile accessible et performante. Voyons de quoi il est capable exactement.
</description>
    </item>
    <item>
      <title>Cadeaux de derni&#232;re minute&#160;: comment l&#8217;e-commerce a normalis&#233; la procrastination de 43&#160;% des Fran&#231;ais</title>
      <link>https://www.01net.com/actualites/cadeaux-de-derniere-minute-comment-le-commerce-a-normalise-la-procrastination-de-43-des-francais.html</link>
      <pubDate>Fri, 19 Dec 2025 16:27:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316325</guid>
      <description>Nous sommes le 19 d&#233;cembre et vous n'avez rien achet&#233; ? Pas de panique, vous &#234;tes dans la norme. Une &#233;tude Amazon/OpinionWay r&#233;v&#232;le que la puissance logistique du e-commerce a d&#233;complex&#233; les retardataires, transformant la course de No&#235;l en un sprint technologique de 72 heures.</description>
    </item>
    <item>
      <title>New managed web hosting service brings flat-rate node.js pricing</title>
      <link>https://www.techradar.com/pro/new-managed-web-hosting-service-brings-flat-rate-node-js-pricing</link>
      <pubDate>Fri, 19 Dec 2025 16:26:28 +0000</pubDate>
      <guid isPermaLink="false">gZndek24CvNddmD49weDhj</guid>
      <description>Hostinger is lowering the barrier for entry with new node.js support in shared hosting plans.</description>
    </item>
    <item>
      <title>Votre enfant utilise ChatGPT ? Voici ce qui va changer dans les interactions avec l&#8217;IA</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2916281_votre-enfant-utilise-chatgpt-voici-ce-qui-va-changer-dans-les-interactions-avec-lia</link>
      <pubDate>Fri, 19 Dec 2025 16:23:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2916281_votre-enfant-utilise-chatgpt-voici-ce-qui-va-changer-dans-les-interactions-avec-lia</guid>
      <description>
OpenAI redouble de vigilance pour d&#233;terminer l'&#226;ge des utilisateurs mineurs afin de leur offrir une exp&#233;rience d'utilisation en ad&#233;quation. 
</description>
    </item>
    <item>
      <title>My employee overdoes everything, and it&#8217;s costing money</title>
      <link>https://www.fastcompany.com/91463607/employee-overdoes-everything-costing-money</link>
      <pubDate>2025-12-19T16:23:37</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463607/employee-overdoes-everything-costing-money</guid>
      <description>How do I tell him to care less and do less work?
A reader asks:</description>
    </item>
    <item>
      <title>Revolut veut tuer les op&#233;rateurs mobiles avec son offre 5G illimit&#233;e : bonne chance pour y arriver en France</title>
      <link>https://www.frandroid.com/telecom/forfait-mobile/2917091_revolut-veut-tuer-les-operateurs-mobiles-avec-son-offre-5g-illimitee-bonne-chance-pour-y-arriver-en-france</link>
      <pubDate>Fri, 19 Dec 2025 16:23:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/forfait-mobile/2917091_revolut-veut-tuer-les-operateurs-mobiles-avec-son-offre-5g-illimitee-bonne-chance-pour-y-arriver-en-france</guid>
      <description>
Vous trouviez que Revolut faisait d&#233;j&#224; trop de choses ? Attendez de voir la suite. Apr&#232;s la banque, la crypto et les assurances, l'entreprise lance Revolut Mobile. Un v&#233;ritable forfait t&#233;l&#233;phonique 5G directement dans l'application. L'offre est agressive pour le march&#233; britannique, mais vu de France, on a presque envie de sourire.
</description>
    </item>
    <item>
      <title>BMW a commenc&#233; &#224; produire des voitures &#233;lectriques invisibles dans son usine historique</title>
      <link>https://www.frandroid.com/marques/bmw/2916897_bmw-a-commence-a-produire-des-voitures-electriques-invisibles-dans-son-usine-historique</link>
      <pubDate>Fri, 19 Dec 2025 16:21:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bmw/2916897_bmw-a-commence-a-produire-des-voitures-electriques-invisibles-dans-son-usine-historique</guid>
      <description>
Le constructeur allemand pr&#233;pare l&#8217;arriv&#233;e de sa nouvelle berline i3 (s&#233;rie 3 &#233;lectrique), qui sera produite &#224; Munich. La voiture &#233;lectrique d&#233;marrera sa fabrication d&#232;s l&#8217;&#233;t&#233; 2026.
</description>
    </item>
    <item>
      <title>Who owns Trump Mobile?</title>
      <link>https://www.theverge.com/tech/848029/trump-mobile-ownership-structure-licensing</link>
      <pubDate>2025-12-19T11:20:27-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=848029</guid>
      <description>Where's the Trump Phone? We're going to keep talking about it every week, except next week, when we take a break until the new year. We've reached out, as usual, to ask about the Trump Phone's whereabouts. As usual, we're still waiting for a response. In the meantime, we're wondering who's actually behind the mobile [&#8230;]</description>
    </item>
    <item>
      <title>Driverless Waymo seemingly drives straight into oncoming traffic in viral video</title>
      <link>https://mashable.com/article/waymo-robotaxi-footage-wrong-side-of-road-viral-video</link>
      <pubDate>Fri, 19 Dec 2025 16:18:51 +0000</pubDate>
      <guid isPermaLink="false">06PgUXWMFviNlFGojPq1d2l</guid>
      <description>A new viral video shows a Waymo driving straight into oncoming traffic in Austin.</description>
    </item>
    <item>
      <title>L&#8217;enqu&#234;te qui flingue la plus grande promesse du Wi-Fi 7 : &#171;&#160;Le MLO n&#8217;existe pas encore&#160;&#187;</title>
      <link>https://www.frandroid.com/telecom/2916429_lenquete-qui-flingue-la-plus-grande-promesse-du-wi-fi-7-le-mlo-nexiste-pas-encore</link>
      <pubDate>Fri, 19 Dec 2025 16:17:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2916429_lenquete-qui-flingue-la-plus-grande-promesse-du-wi-fi-7-le-mlo-nexiste-pas-encore</guid>
      <description>
De toutes les am&#233;liorations et fonctionnalit&#233;s apport&#233;es par le Wi-Fi 7, le MLO en est certainement la cl&#233; de vo&#251;te. Il est m&#234;me au c&#339;ur des discours des fabricants d'&#233;quipements en Wi-Fi 7, pourtant, la r&#233;alit&#233; de cette technologie est toute autre selon une enqu&#234;te de nos confr&#232;res de RTINGS.com.
</description>
    </item>
    <item>
      <title>Best Buy has launched a last-minute savings sale &#8212; AirPods, TVs, cheap laptops and more that arrive before Christmas</title>
      <link>https://www.techradar.com/seasonal-sales/best-buy-has-launched-a-last-minute-savings-sale-airpods-tvs-cheap-laptops-and-more-that-arrive-before-christmas</link>
      <pubDate>Fri, 19 Dec 2025 16:15:39 +0000</pubDate>
      <guid isPermaLink="false">ibjijnkhnaPtWMrJBMAhSN</guid>
      <description>Best Buy just launched a last-minute savings sale, and I'm rounding up the 21 best deals, including AirPods, TVs, laptops, smartwatches, and more.</description>
    </item>
    <item>
      <title>Ring in the new year with a new phone: The Samsung Galaxy Z Flip 7 is at its lowest price yet</title>
      <link>https://mashable.com/article/dec-19-samsung-galaxy-z-flip-7-deal</link>
      <pubDate>Fri, 19 Dec 2025 16:15:19 +0000</pubDate>
      <guid isPermaLink="false">016va8WLllwj8k6aluM5YW8</guid>
      <description>As of Dec. 19, get the Samsung Galaxy Z Flip 7 for its lowest price yet.</description>
    </item>
    <item>
      <title>Save over $400 on the Philips 4400 Series Espresso Machine, and dont worry, itll arrive by Christmas</title>
      <link>https://mashable.com/article/dec-19-philips-4400-series-espresso-machine-deal</link>
      <pubDate>Fri, 19 Dec 2025 16:06:28 +0000</pubDate>
      <guid isPermaLink="false">05N9eWa7EWOEmBj7i6C6xzs</guid>
      <description>As of Dec. 19, shop the Philips 4400 Series Espresso Machine for under $750. Shop at Amazon and save over $450, and the assurance it'll arrive before Christmas.</description>
    </item>
    <item>
      <title>Meta is developing a new image and video model for a 2026 release, report says</title>
      <link>https://techcrunch.com/2025/12/19/meta-is-developing-a-new-image-and-video-model-for-a-2026-release-report-says/</link>
      <pubDate>Fri, 19 Dec 2025 16:05:29 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3077744</guid>
      <description>The company is working on an image and video model and new text-based model, which aids with coding.</description>
    </item>
    <item>
      <title>On a vu le TV Samsung Micro RGB de 115 pouces&#160;: une parfaite ma&#238;trise de la technologie de demain avec des mesures impressionnantes</title>
      <link>https://www.frandroid.com/marques/samsung/2915329_on-a-vu-le-tv-samsung-micro-rgb-de-115-pouces-une-parfaite-maitrise-de-la-technologie-de-demain-avec-des-mesures-impressionnantes</link>
      <pubDate>Fri, 19 Dec 2025 16:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2915329_on-a-vu-le-tv-samsung-micro-rgb-de-115-pouces-une-parfaite-maitrise-de-la-technologie-de-demain-avec-des-mesures-impressionnantes</guid>
      <description>
V&#233;ritable vitrine technologique pour Samsung, ce t&#233;l&#233;viseur d&#8217;une diagonale de 115 pouces embarque effectivement une dalle LCD avec un syst&#232;me de r&#233;tro&#233;clairage Micro RGB capable, en th&#233;orie d&#8217;offrir une palette extr&#234;mement large de couleurs associ&#233;e &#224; un tr&#232;s fort contraste. Nous avons pu faire des mesures.&#160;
</description>
    </item>
    <item>
      <title>Wall Street recovers from losses earlier in the week, as AI stocks climb</title>
      <link>https://www.fastcompany.com/91463596/wall-street-recovers-losses-earlier-week-ai-stocks-climb</link>
      <pubDate>2025-12-19T16:01:59</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463596/wall-street-recovers-losses-earlier-week-ai-stocks-climb</guid>
      <description>Tech stocks led the market with Nvidia jumping 3.4% and Broadcom rising 2.4%.
Stocks rose in morning trading on Wall Street Friday and further trimmed losses from earlier in the week for several major indexes.The S&amp;P 500 jumped 0.8%, adding to gains made on Thursday.The Dow Jones Industrial Average rose 283 points, or 0.6%, as of 10:05 a.m. Eastern. The Nasdaq jumped 1% and is now on track for a weekly gain.Technology stocks with an focus on artificial intelligence once again led the market. Nvidia jumped 3.4% and Broadcom rose 2.4%.Oracle rose 7% on news that it, along with two other investor...</description>
    </item>
    <item>
      <title>There's a big Philips Hue sale at Best Buy from $11.99 &#8212; these are the smart bulb deals I recommend buying</title>
      <link>https://www.techradar.com/home/smart-lights/theres-a-big-philips-hue-sale-at-best-buy-from-usd11-99-these-are-the-smart-bulb-deals-i-recommend-buying</link>
      <pubDate>Fri, 19 Dec 2025 16:01:31 +0000</pubDate>
      <guid isPermaLink="false">BBE8z2cLSfV7Z8chZXoE24</guid>
      <description>A big shout-out to the A19 3-pack, which are part of the big Philips Hue sale at Best Buy</description>
    </item>
    <item>
      <title>The Fujifilm Instax Mini 12 instant camera is a great gift at $74</title>
      <link>https://www.theverge.com/gadgets/847732/fujifilm-instax-mini-12-camera-8bitdo-pro-3-controller-deal-sale</link>
      <pubDate>2025-12-19T11:01:19-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=847732</guid>
      <description>Although our phones are all equipped with cameras, there is still something special about being able to immediately produce a printed photo to pass around or give as a gift. If that&#8217;s something that appeals to you, the Fujifilm Instax Mini 12 instant camera is a great gift idea, and it&#8217;s now on sale at [&#8230;]</description>
    </item>
    <item>
      <title>YouTube pulls the plug on popular AI-generated fake movie trailer channels</title>
      <link>https://mashable.com/article/youtube-shuts-down-ai-channels-screen-culture-kh-studio</link>
      <pubDate>Fri, 19 Dec 2025 16:00:52 +0000</pubDate>
      <guid isPermaLink="false">038CJTDv0A2ezOUBdhTcNY6</guid>
      <description>Popular YouTube channels Screen Culture and KH Studio were shut down for repeatedly posting AI-generated movie trailers that misled viewers.</description>
    </item>
    <item>
      <title>6 Scary Predictions for AI in 2026</title>
      <link>https://www.wired.com/story/backchannel-2026-predictions-tech-robots-ai/</link>
      <pubDate>Fri, 19 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">694032e2e5b65c603b704131</guid>
      <description>Could the AI industry be on the verge of its first major layoffs? Will China spread propaganda to slow the US data-center building boom? Where are AI agents headed?</description>
    </item>
    <item>
      <title>100 000 images de Mars : cette sonde de la Nasa r&#233;v&#232;le un monde plus complexe qu&#8217;on ne l&#8217;imaginait</title>
      <link>https://www.futura-sciences.com/sciences/actualites/mars-100-000-images-mars-cette-sonde-nasa-revele-monde-plus-complexe-quon-ne-imaginait-129386/#xtor%3DRSS-8</link>
      <pubDate>Fri, 19 Dec 2025 16:59:20 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/mars-100-000-images-mars-cette-sonde-nasa-revele-monde-plus-complexe-quon-ne-imaginait-129386/#xtor%3DRSS-8</guid>
      <description>Peu d&#8217;instruments ont contempl&#233; Mars avec autant de fid&#233;lit&#233;. &#192; travers l&#8217;&#339;il per&#231;ant de HiRISE, la sonde MRO d&#233;chiffre la Plan&#232;te rouge, r&#233;v&#233;lant son incroyable g&#233;ologie et les secrets enfouis dans ses paysages mill&#233;naires.</description>
    </item>
    <item>
      <title>The best Nintendo Switch controllers to buy right now</title>
      <link>https://www.theverge.com/23350899/nintendo-switch-controllers-best-wireless-joy-con-gamepad</link>
      <pubDate>2025-12-19T10:56:58-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/23350899/nintendo-switch-controllers-best-wireless-joy-con-gamepad</guid>
      <description>The Switch 2 is here, and Nintendo seems ready to move on from the original Switch. But we&#8217;re not going to up and forget about it. That&#8217;s why we&#8217;ve kept testing controllers that might be a good fit for you. Even as many accessory makers are making controllers with the Switch 2 in mind, most [&#8230;]</description>
    </item>
    <item>
      <title>YouTube s&#8217;en prend (enfin) aux chaines qui g&#233;n&#232;rent de fausses bandes-annonces de films avec de l&#8217;IA</title>
      <link>https://www.01net.com/actualites/youtube-sen-prend-enfin-aux-chaines-qui-generent-de-fausses-bandes-annonces-de-films-avec-de-lia.html</link>
      <pubDate>Fri, 19 Dec 2025 15:55:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316306</guid>
      <description>Les fausses bandes-annonces g&#233;n&#233;r&#233;es gr&#226;ce &#224; l&#8217;intelligence artificielle sont monnaie courante sur YouTube. L&#8217;entreprise vient de s&#8217;attaquer &#224; deux poids lourds du domaine en supprimant d&#233;finitivement leurs chaines. Cette d&#233;cision sanctionne l&#8217;utilisation abusive d&#8217;intelligence artificielle, une pratique destin&#233;e &#224; tromper les internautes.</description>
    </item>
    <item>
      <title>Grow your collection with 15% off the Magic: The Gathering Avatar: The Last Airbender Collector Booster Box</title>
      <link>https://mashable.com/article/dec-19-magic-avatar-last-airbender-collector-booster-box-deal</link>
      <pubDate>Fri, 19 Dec 2025 15:54:21 +0000</pubDate>
      <guid isPermaLink="false">046lnCvzKpCorqFQqw4WTJ1</guid>
      <description>As of Dec. 19, get 15% off the Magic: The Gathering Avatar: The Last Airbender Collector Booster Box.</description>
    </item>
    <item>
      <title>Intel Core Ultra 5 225F hits $157.98 - all-time low and comes with free $70 Battlefield 6 game</title>
      <link>https://www.techradar.com/pro/intel-core-ultra-5-225f-hits-usd157-98-all-time-low-and-comes-with-free-usd70-battlefield-6-game</link>
      <pubDate>Fri, 19 Dec 2025 15:48:58 +0000</pubDate>
      <guid isPermaLink="false">ZjpdBUAfYAjKPkG9Q5duja</guid>
      <description>Intel&#8217;s Core Ultra 5 225F hits a new low price at Newegg and it comes with a free copy of Battlefield 6 too.</description>
    </item>
    <item>
      <title>One of our favorite budgeting apps is 50 percent off right now</title>
      <link>https://www.engadget.com/deals/one-of-our-favorite-budgeting-apps-is-50-percent-off-right-now-154056703.html?src=rss</link>
      <pubDate>Fri, 19 Dec 2025 15:46:26 +0000</pubDate>
      <guid isPermaLink="false">f9cd69a7-2172-4476-a391-04d87e530174</guid>
      <description>If you have a resolution in the new year to get more acquainted with your finances, a good budgeting app can help with that. One of our favorites is a bit cheaper to sign up for right now: Monarch Money is offering 50 percent off annual subscriptions for new users. Use the code MONARCHVIP at checkout to get half off, so you'll pay just $50 for one year of access.


Monarch Money was the runner-up in our guide to the best budgeting apps in 2025, and it was definitely a grower. Initially we found the experience of using the app to be needlessly complicated compared to some of its rivals, but get...</description>
    </item>
    <item>
      <title>Leak Reveals Lenovo Gaming Laptop With a Screen That Rolls Sideways Into an Ultrawide</title>
      <link>https://gizmodo.com/leak-reveals-lenovo-gaming-laptop-with-a-screen-that-rolls-sideways-into-an-ultrawide-2000701801</link>
      <pubDate>Fri, 19 Dec 2025 15:45:59 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000701801</guid>
      <description>Lenovo reportedly has other plans for rolling laptops, as well as a surprise handheld.</description>
    </item>
    <item>
      <title>Are the Epstein files released yet? When and where to expect the searchable, downloadable database</title>
      <link>https://www.fastcompany.com/91463693/epstein-files-released-today-where-download-searchable-database</link>
      <pubDate>2025-12-19T15:45:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463693/epstein-files-released-today-where-download-searchable-database</guid>
      <description>A law passed by Congress last month mandates that the DOJ release files related to the convicted sex offender today. Here&#8217;s the latest.
Last month, the U.S. Congress passed the Epstein Files Transparency Act, which was subsequently signed into law by President Donald Trump. </description>
    </item>
    <item>
      <title>Meilleurs aspirateurs-robots laveurs en d&#233;cembre 2025 : la s&#233;lection</title>
      <link>https://www.frandroid.com/guide-dachat/2037272_quels-sont-les-meilleurs-aspirateurs-robots-laveur-notre-selection</link>
      <pubDate>Fri, 19 Dec 2025 15:42:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2037272_quels-sont-les-meilleurs-aspirateurs-robots-laveur-notre-selection</guid>
      <description>
De plus en plus d'aspirateurs robots proposent une fonction de nettoyage humide pour s'occuper &#224; fond des sols. Certes, il s'agit souvent de mod&#232;les plus chers, mais aussi plus performants et polyvalents. Apr&#232;s tests, voici notre s&#233;lection des meilleurs aspirateurs robots laveurs.
</description>
    </item>
    <item>
      <title>TikTok Finally Strikes a Deal to Be Taken Over by Trump Allies</title>
      <link>https://gizmodo.com/tiktok-finally-strikes-deal-to-be-taken-over-by-trump-allies-2000701805</link>
      <pubDate>Fri, 19 Dec 2025 15:40:22 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000701805</guid>
      <description>A new U.S.-based joint venture would keep TikTok online while handing oversight of its algorithm and data security to some of America&#8217;s wealthiest investors.</description>
    </item>
    <item>
      <title>Voitures chinoises en Europe : ce chiffre spectaculaire qui donne des sueurs froides aux constructeurs historiques</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2916857_voitures-chinoises-en-europe-ce-chiffre-spectaculaire-qui-donne-des-sueurs-froides-aux-constructeurs-historiques</link>
      <pubDate>Fri, 19 Dec 2025 15:40:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2916857_voitures-chinoises-en-europe-ce-chiffre-spectaculaire-qui-donne-des-sueurs-froides-aux-constructeurs-historiques</guid>
      <description>
Avec une progression de 108 % en novembre, les marques chinoises bousculent l'ordre &#233;tabli du march&#233; automobile europ&#233;en. BYD et MG m&#232;nent la charge, tandis que les constructeurs traditionnels peinent &#224; maintenir leurs positions.
</description>
    </item>
    <item>
      <title>Invitez la nostalgie pour No&#235;l avec la console Blaze Evercade VS-R et la collection Tomb Raider (I &#224; III) &#224; moins de 80&#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2916853_invitez-la-nostalgie-pour-noel-avec-la-console-blaze-evercade-vs-r-et-la-collection-tomb-raider-i-a-iii-a-moins-de-80e</link>
      <pubDate>Fri, 19 Dec 2025 15:39:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2916853_invitez-la-nostalgie-pour-noel-avec-la-console-blaze-evercade-vs-r-et-la-collection-tomb-raider-i-a-iii-a-moins-de-80e</guid>
      <description>
Envie de ramener quelqu&#8217;un droit en enfance pour No&#235;l ? L&#8217;Evercade VS-R fait office de machine &#224; remonter le temps : design old school, cartouches comme &#224; l&#8217;&#233;poque et les aventures de Lara Croft en gros pixels et polygones assum&#233;s. Et pour finir de convaincre les nostalgiques, la console r&#233;tro tombe &#224; 76,99 euros au lieu de 109,99 euros sur Amazon.
...</description>
    </item>
    <item>
      <title>Canada and U.S. will soon launch formal talks on USMCA trade agreement</title>
      <link>https://www.fastcompany.com/91463593/canada-u-s-soon-launch-formal-talks-usmca-trade-agreement</link>
      <pubDate>2025-12-19T15:35:49</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463593/canada-u-s-soon-launch-formal-talks-usmca-trade-agreement</guid>
      <description>The trade pact between the United States, Mexico, and Canada is up for review in 2026.
Canada and the U.S. will launch formal discussions to review their free trade agreement in mid-January, the office of Canadian Prime Minister Mark Carney said.The prime minister confirmed to provincial leaders that Dominic LeBlanc, the country&#8217;s point person for U.S-Canada trade relations, &#8220;will meet with U.S. counterparts in mid-January to launch formal discussions,&#8221; Carney&#8217;s office said in a statement late Thursday.The United States-Mexico-Canada trade pact, or USMCA, is up for review in 2026. U.S. Preside...</description>
    </item>
    <item>
      <title>I tried Saily's Ultra subscription in India: here's my honest review</title>
      <link>https://www.techradar.com/pro/i-tried-sailys-ultra-subscription-in-india-heres-my-honest-review</link>
      <pubDate>Fri, 19 Dec 2025 15:31:29 +0000</pubDate>
      <guid isPermaLink="false">gdg3pWLET9UzQ8gzeaKxo7</guid>
      <description>The Ultra subscription is a reliable way to stay connected for travelers on the go.</description>
    </item>
    <item>
      <title>&#8216;Pluribus&#8217; Gives Carol a Precarious New Coping Mechanism</title>
      <link>https://gizmodo.com/pluribus-episode-8-recap-carol-zosia-2000700450</link>
      <pubDate>Fri, 19 Dec 2025 15:30:22 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000700450</guid>
      <description>Apple TV&#8217;s sci-fi hit is nearing the end of its first season, but there&#8217;s still so much story to tell.</description>
    </item>
    <item>
      <title>Engadget's favorite games of 2025</title>
      <link>https://www.engadget.com/gaming/engadgets-favorite-games-of-2025-153000109.html?src=rss</link>
      <pubDate>Fri, 19 Dec 2025 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">4efc7512-0d26-42d8-b185-e0b5b12811b1</guid>
      <description>From indies like Silksong, to AAAs like Ghost of Yotei, and everything in between, 2025 truly had it all, and is likely to go down in the history books as one of the best years in gaming. But these are the games that felt truly special to the Engadget team.&#160;Arc Raiders I&#8217;m genuinely shocked by how much I love ARC Raiders. I&#8217;ve never been very interested in the whole PvE (Player vs. Environment) genre, aside from some brief stints with Destiny, but ARC Raiders's sci-fi post-apocalyptic vibe just works for me. I love the Blade Runner/anime-like aesthetic of its environments, enemies and outfits....</description>
    </item>
    <item>
      <title>The only espresso machine youll ever need is $200 off right now</title>
      <link>https://mashable.com/article/dec-19-breville-barista-express-deal</link>
      <pubDate>Fri, 19 Dec 2025 15:27:08 +0000</pubDate>
      <guid isPermaLink="false">00hjf01DQXaeG15TirVCMnT</guid>
      <description>Score the Breville Barista Express for just $499.95, down from $699.95, at Amazon. That's a 20% discount or a $200 price cut.</description>
    </item>
  </channel>
</rss>
