<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 07 Nov 2025 17:34:29 GMT</lastBuildDate>
    <item>
      <title>The &#8216;Mass Effect&#8217; TV Show Will Tackle What Happens After the Original Trilogy</title>
      <link>https://gizmodo.com/mass-effect-tv-show-details-amazon-no-shepard-post-trilogy-2000683136</link>
      <pubDate>Fri, 07 Nov 2025 17:31:20 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683136</guid>
      <description>Amazon's 'Mass Effect' series is going to be diving into some incredibly tempting waters... for better or worse.</description>
    </item>
    <item>
      <title>Does the Trump phone exist yet?</title>
      <link>https://www.theverge.com/news/816484/does-trump-phone-exist-yet</link>
      <pubDate>2025-11-07T12:22:19-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=816484</guid>
      <description>Last week I asked where the Trump phone was. The answer? Nowhere. There&#8217;s no update, no response, no sign of it. And since it&#8217;s still not here, I am &#8212; again &#8212;&#160;asking the same question. And I&#8217;m afraid I&#8217;m going to keep being here, week in, week out, until I have a T1 Phone in [&#8230;]</description>
    </item>
    <item>
      <title>Government Shutdown Grounds Daytime Launches for SpaceX and Other Private Space Companies</title>
      <link>https://gizmodo.com/government-shutdown-grounds-daytime-launches-for-spacex-and-other-private-space-companies-2000683084</link>
      <pubDate>Fri, 07 Nov 2025 17:15:56 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683084</guid>
      <description>The FAA issued a new order that assigns a time slot for commercial launches and reentries.</description>
    </item>
    <item>
      <title>I'm a TV reviewer and these are my top 6 early Black Friday TV deals from LG, Samsung and Hisense</title>
      <link>https://www.techradar.com/televisions/im-a-tv-reviewer-and-these-are-my-top-6-early-black-friday-tv-deals-from-lg-samsung-and-hisense</link>
      <pubDate>Fri, 07 Nov 2025 17:12:34 +0000</pubDate>
      <guid isPermaLink="false">F5D3GNzHmTJHeNWB9gasKH</guid>
      <description>Black Friday may not have officially arrived, but early deals are already appearing on some of 2025's best TVs.</description>
    </item>
    <item>
      <title>Les iPhone 18 mettraient le paquet sur la cam&#233;ra selfie</title>
      <link>https://www.01net.com/actualites/les-iphone-18-mettraient-le-paquet-sur-la-camera-selfie.html</link>
      <pubDate>Fri, 07 Nov 2025 17:03:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306305</guid>
      <description>De nombreuses fuites se concentrent sur les cam&#233;ras selfie des iPhone 18 et de l'iPhone pliant. Ce dernier int&#232;grerait une cam&#233;ra selfie sous l'&#233;cran de 24 Mpx, une premi&#232;re dans l'industrie.</description>
    </item>
    <item>
      <title>Experts warn ClickFix malware attacks are back, and more dangerous than ever before - here's how to stay safe</title>
      <link>https://www.techradar.com/pro/security/experts-warn-clickfix-malware-attacks-are-back-and-more-dangerous-than-ever-before</link>
      <pubDate>Fri, 07 Nov 2025 17:02:00 +0000</pubDate>
      <guid isPermaLink="false">W8ciHSMhp394iXFQiQqWmD</guid>
      <description>New ClickFix variants seen with extra features including video explainers.</description>
    </item>
    <item>
      <title>&#8216;Avengers: Secret Wars&#8217; Was Supposed to Be in Theaters Today</title>
      <link>https://gizmodo.com/avengers-secret-wars-original-release-date-marvel-2000683125</link>
      <pubDate>Fri, 07 Nov 2025 17:00:29 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683125</guid>
      <description>But, in reality, we're still over a year away from its predecessor, 'Avengers: Doomsday.'</description>
    </item>
    <item>
      <title>TikTok Shop Is Now the Size of eBay</title>
      <link>https://www.wired.com/story/tiktok-shop-sales-global-ecommerce/</link>
      <pubDate>Fri, 07 Nov 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">690bd43ee40a26c0f9a5632b</guid>
      <description>TikTok&#8217;s ecommerce arm has kept growing steadily, despite tariffs and never-ending debates over whether the platform should be banned.</description>
    </item>
    <item>
      <title>TechCrunch Disrupt 2025 Startup Battlefield 200: Celebrating outstanding achievements</title>
      <link>https://techcrunch.com/2025/11/07/techcrunch-disrupt-2025s-startup-battlefield-200-celebrating-outstanding-achievements/</link>
      <pubDate>Fri, 07 Nov 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=2911699</guid>
      <description>Among the Startup Battlefield 200 at TechCrunch Disrupt 2025 were many industry-defining companies exhibiting and pitching on the Showcase Stage.</description>
    </item>
    <item>
      <title>Kim Kardashian says ChatGPT is her &#8216;frenemy&#8217;</title>
      <link>https://techcrunch.com/2025/11/07/kim-kardashian-says-chatgpt-is-her-frenemy/</link>
      <pubDate>Fri, 07 Nov 2025 16:58:22 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3066059</guid>
      <description>Kim Kardashian admitted that she has failed legal exams after blindly relying on ChatGPT's advice.</description>
    </item>
    <item>
      <title>Black Friday 2025 : les offres s&#8217;intensifient sur Amazon &amp; Co, mais voici les meilleurs bons plans en avant-premi&#232;re</title>
      <link>https://www.frandroid.com/bons-plans/2849105_black-friday-2025-la-braderie-continue-chez-amazon-co-voici-les-meilleures-offres-en-avant-premiere</link>
      <pubDate>Fri, 07 Nov 2025 16:57:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849105_black-friday-2025-la-braderie-continue-chez-amazon-co-voici-les-meilleures-offres-en-avant-premiere</guid>
      <description>
&#192; peine novembre entam&#233; que le Black Friday a d&#233;j&#224; point&#233; le bout de son nez depuis quelques jours chez certains e-commer&#231;ants fran&#231;ais. On vous a donc pr&#233;par&#233; une s&#233;lection des meilleures offres du moment, mise &#224; jour en temps r&#233;el, pour vous aider &#224; d&#233;nicher les bons plans tech sans prise de t&#234;te.
</description>
    </item>
    <item>
      <title>Black Friday is 3 weeks away &#8211; here are 35 early deals from Amazon I'm shopping today</title>
      <link>https://www.techradar.com/seasonal-sales/black-friday-is-3-weeks-away-here-are-35-early-deals-from-amazon-im-shopping-today</link>
      <pubDate>Fri, 07 Nov 2025 16:55:00 +0000</pubDate>
      <guid isPermaLink="false">onfqyBZTrEBA3gFrGxA3aZ</guid>
      <description>Early Black Friday deals are live at Amazon, and I'm rounding up today's top 35 offers worth buying right now from Apple, Ninja, Keurig, LG, and more.</description>
    </item>
    <item>
      <title>X appears to be sending fake traffic across the web</title>
      <link>https://www.theverge.com/news/816451/x-fake-traffic-preloading-links-bluesky-substack</link>
      <pubDate>2025-11-07T11:53:49-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=816451</guid>
      <description>X's new link experiment on iOS may be artificially inflating traffic. Websites like Substack and Bluesky noticed a sharp increase in "fake" views following the update, something that Nick Eubanks, the VP of owned media at the digital marketing platform Semrush, attributes to a new behavior that preloads content before users click on it. "What's [&#8230;]</description>
    </item>
    <item>
      <title>Samsung&#8217;s Frame Pro TV has hit a new all-time low before Black Friday</title>
      <link>https://www.theverge.com/tech/816373/samsung-frame-pro-lego-star-wars-advent-calendar-deal-sale</link>
      <pubDate>2025-11-07T11:50:09-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=816373</guid>
      <description>Samsung&#8217;s 65-inch Frame Pro is $1,447.99 ($752 off) &#8212; a new all-time low &#8212; at Woot. The 75-inch model is $1,897.99 ($1,302 off), also an all-time low at Woot. The TV&#8217;s main attraction is its &#8220;Art Mode,&#8221; which cycles through a gallery of famous paintings when you&#8217;re not actively using it. The artwork on the [&#8230;]</description>
    </item>
    <item>
      <title>I&#8217;ve been waiting 6 months for my dream Sennheiser headphones to hit this price &#8211; but now I&#8217;m wondering if they&#8217;ll go even lower this Black Friday</title>
      <link>https://www.techradar.com/audio/headphones/ive-been-waiting-6-months-for-my-dream-sennheiser-headphones-to-hit-this-price-but-now-im-wondering-if-theyll-go-even-lower-this-black-friday</link>
      <pubDate>Fri, 07 Nov 2025 16:49:19 +0000</pubDate>
      <guid isPermaLink="false">zMtWbVBfLs2HuZpsioDizJ</guid>
      <description>This amazing early Black Friday deal on my dream wired headphones has got me second-guessing myself.</description>
    </item>
    <item>
      <title>Meilleurs Chromebooks en 2025 : le guide pour choisir le v&#244;tre</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-ordinateurs/305195_quels-chroomebooks-acheter-en-2017</link>
      <pubDate>Fri, 07 Nov 2025 16:41:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-ordinateurs/305195_quels-chroomebooks-acheter-en-2017</guid>
      <description>
Les Chromebooks peuvent &#234;tre des alternatives int&#233;ressantes aux PC portables sous Windows, si vous cherchez un ordinateur vraiment abordable. Nous avons s&#233;lectionn&#233; pour vous les meilleurs Chromebooks du march&#233;.
</description>
    </item>
    <item>
      <title>Xiaomi profite du pr&#233;-Black Friday pour brader ses produits les plus populaires : les 10 offres &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2858733_xiaomi-profite-du-pre-black-friday-pour-brader-ses-produits-les-plus-populaires-les-8-offres-a-saisir</link>
      <pubDate>Fri, 07 Nov 2025 16:37:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2858733_xiaomi-profite-du-pre-black-friday-pour-brader-ses-produits-les-plus-populaires-les-8-offres-a-saisir</guid>
      <description>
Le coup d&#8217;envoi du pr&#233;-Black Friday a &#233;t&#233; donn&#233; chez de nombreux e-commer&#231;ants, et Xiaomi ne compte pas manquer l&#8217;&#233;v&#233;nement. La marque chinoise multiplie les offres et casse les prix sur l&#8217;ensemble de ses produits phares. D&#233;couvrez ceux qui ont retenu notre attention. 
</description>
    </item>
    <item>
      <title>Congressional Budget Office&#160;confirms&#160;it was hacked</title>
      <link>https://techcrunch.com/2025/11/07/congressional-budget-office-confirms-it-was-hacked/</link>
      <pubDate>Fri, 07 Nov 2025 16:36:55 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3066056</guid>
      <description>The congressional research office confirmed a breach, but did not comment on the cause. A security researcher suggested the hack may have originated because CBO failed to patch a firewall for more than a year.</description>
    </item>
    <item>
      <title>Ce nouveau smartphone vient de sortir et il est d&#233;j&#224; en promo pour le pr&#233;-Black Friday : le Nubia Z80 Ultra avec &#233;cran OLED et autonomie XXL perd plusieurs dizaines d&#8217;euros</title>
      <link>https://www.frandroid.com/bons-plans/2860535_ce-nouveau-smartphone-vient-de-sortir-et-il-est-deja-en-promo-pour-le-pre-black-friday-le-nubia-z80-ultra-avec-ecran-oled-et-autonomie-xxl-perd-plusieurs-dizaines-deuros</link>
      <pubDate>Fri, 07 Nov 2025 16:36:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860535_ce-nouveau-smartphone-vient-de-sortir-et-il-est-deja-en-promo-pour-le-pre-black-friday-le-nubia-z80-ultra-avec-ecran-oled-et-autonomie-xxl-perd-plusieurs-dizaines-deuros</guid>
      <description>
Le Nubia Z80 Ultra est sur le march&#233; depuis quelques jours &#224; peine et pourtant il est d&#233;j&#224; &#224; 587,72 euros sur AliExpress, au lieu de 649 euros prix de lancement.
</description>
    </item>
    <item>
      <title>What is Tiny Vinyl? Miniature LPs that really work on record players.</title>
      <link>https://mashable.com/article/nov-7-tiny-vinyl</link>
      <pubDate>Fri, 07 Nov 2025 16:33:46 +0000</pubDate>
      <guid isPermaLink="false">021mSZ9qHQYLDN79VxO2KWs</guid>
      <description>What is Tiny Vinyl? Think HitClips, but they're real, playable 4-inch records.</description>
    </item>
    <item>
      <title>Les Apple Watch se connectent d&#233;sormais aux satellites Starlink</title>
      <link>https://www.01net.com/actualites/les-apple-watch-se-connectent-desormais-aux-satellites-starlink.html</link>
      <pubDate>Fri, 07 Nov 2025 16:31:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306335</guid>
      <description>La connexion satellite des Apple Watch n'est plus r&#233;serv&#233;e &#224; l'Ultra 3. Au Canada et au Japon, des op&#233;rateurs ont activ&#233; l'acc&#232;s aux satellites de Starlink &#224; plusieurs mod&#232;les de montres connect&#233;es d'Apple.</description>
    </item>
    <item>
      <title>Pluribus: all the latest on Vince Gilligan&amp;#8217;s Apple TV series</title>
      <link>https://www.theverge.com/entertainment/815898/pluribus-apple-tv-vince-gilligan</link>
      <pubDate>2025-11-07T11:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?post_type=vm_stream&amp;p=815898</guid>
      <description>Apple&#8217;s run of excellent sci-fi looks to continue with Pluribus. The series has some strong pedigree; it&#8217;s helmed by Breaking Bad and Better Call Saul creator Vince Gilligan, who also has a history in the genre working on The X-Files. It&#8217;s also a show that requires a lot of trust from viewers, with a strange [&#8230;]</description>
    </item>
    <item>
      <title>WhatsApp reportedly adds cross-app messaging but theres a catch</title>
      <link>https://mashable.com/article/whatsapp-cross-app-messaging-feature-update</link>
      <pubDate>Fri, 07 Nov 2025 16:29:49 +0000</pubDate>
      <guid isPermaLink="false">00KkUtiq5jeYIU8ZNkUgbTA</guid>
      <description>The feature, which allows messaging between WhatsApp and other apps, is currently being beta tested, but there is a catch.</description>
    </item>
    <item>
      <title>Test du HP OmniBook 3 : un bon plan terni par un &#233;cran m&#233;diocre</title>
      <link>https://www.frandroid.com/marques/hp/2851079_test-du-hp-omnibook-3-un-bon-plan-terni-par-un-ecran-mediocre</link>
      <pubDate>Fri, 07 Nov 2025 16:28:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/hp/2851079_test-du-hp-omnibook-3-un-bon-plan-terni-par-un-ecran-mediocre</guid>
      <description>
Vous cherchez un PC portable pas cher ? Le HP OmniBook 3 pourrait &#234;tre votre meilleur compagnon.
</description>
    </item>
    <item>
      <title>LG's next TVs have won awards before they're even announced &#8211; and the company might turn its mini-LED woes around with next-gen RGB backlighting</title>
      <link>https://www.techradar.com/televisions/lgs-next-tvs-have-won-awards-before-theyre-even-announced-and-the-company-might-turn-its-mini-led-woes-around-with-next-gen-rgb-backlighting</link>
      <pubDate>Fri, 07 Nov 2025 16:28:18 +0000</pubDate>
      <guid isPermaLink="false">uELUhSDcWdYD4QJWLqTcSR</guid>
      <description>LG has won multiple CES innovation awards including one for an unannounced RGB LED TV</description>
    </item>
    <item>
      <title>The 5 key takeaways creative teams need to know about Freepik Spaces</title>
      <link>https://www.techradar.com/pro/software-services/the-5-key-takeaways-creative-teams-need-to-know-about-freepik-spaces</link>
      <pubDate>Fri, 07 Nov 2025 16:28:14 +0000</pubDate>
      <guid isPermaLink="false">uj9avB28gNCiNwoEgCS6Rd</guid>
      <description>After demoing Freepik Spaces at the company's Upscale event, these are the essential things pros need to know.</description>
    </item>
    <item>
      <title>Ploopy&#8217;s smallest open-source trackball now includes a button</title>
      <link>https://www.theverge.com/news/816341/ploopy-nano-2-open-source-trackball-button-qmk</link>
      <pubDate>2025-11-07T11:24:24-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=816341</guid>
      <description>Canadian-based Ploopy announced the Nano 2 on Friday. It&#8217;s an update to the ultra-compact Nano trackball featuring a new button, improved performance, and a USB-C port that replaces the original&#8217;s chunky USB-B port. The company made a similar upgrade with its Classic 2 trackball mouse earlier this year. The Nano 2 is still designed to [&#8230;]</description>
    </item>
    <item>
      <title>Samsung n&#8217;&#233;pargne aucun de ses produits pour le pr&#233;-Black Friday : le TOP 16 des offres &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2852851_samsung-nepargne-aucun-de-ses-produits-pour-le-pre-black-friday-le-top-15-des-offres-a-retenir</link>
      <pubDate>Fri, 07 Nov 2025 16:21:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2852851_samsung-nepargne-aucun-de-ses-produits-pour-le-pre-black-friday-le-top-15-des-offres-a-retenir</guid>
      <description>
Samsung participe pleinement &#224; cette p&#233;riode de pr&#233;-Black Friday. Smartphones, t&#233;l&#233;viseurs, tablettes, barres de son, vid&#233;oprojecteurs et m&#234;me aspirateurs-balais&#8239;: la marque sud-cor&#233;enne casse les prix sur de nombreuses r&#233;f&#233;rences r&#233;centes et populaires. D&#233;couvrez les meilleures offres &#224; saisir dans cet article.  
</description>
    </item>
    <item>
      <title>How Trump is trying to convince skeptical voters that he can deliver on affordability</title>
      <link>https://www.fastcompany.com/91437380/how-trump-trying-convince-skeptical-voters-can-deliver-affordability</link>
      <pubDate>2025-11-07T16:17:45</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91437380/how-trump-trying-convince-skeptical-voters-can-deliver-affordability</guid>
      <description>Inflation emerged as a significant vulnerability for the GOP in Tuesday&#8217;s elections.
President Donald Trump is adjusting his messaging strategy to win over voters who are worried about the cost of living with plans to emphasize new tax breaks and show progress on fighting inflation.The messaging is centered around affordability, and the push comes after inflation emerged as a major vulnerability for Trump and Republicans in Tuesday&#8217;s elections, in which voters overwhelmingly said the economy was their biggest concern.Democrats took advantage of concerns about affordability to run up huge margi...</description>
    </item>
    <item>
      <title>Harman Kardon's new Bluetooth speaker has a classic HK design that takes me right back to 2005 &#8211; but with a very modern speaker setup</title>
      <link>https://www.techradar.com/audio/wireless-bluetooth-speakers/harman-kardons-new-bluetooth-speaker-has-a-classic-hk-design-that-takes-me-right-back-to-2005-but-with-a-very-modern-speaker-setup</link>
      <pubDate>Fri, 07 Nov 2025 16:15:57 +0000</pubDate>
      <guid isPermaLink="false">DpExEJnifzgFCsHKSHP6yU</guid>
      <description>Harman Kardon's latest Aura Studio speaker features its iconic dome design plus integrated colored lighting</description>
    </item>
    <item>
      <title>Gunshots Heard at Canadian Ostrich Farm, Signaling Start of Controversial Cull</title>
      <link>https://gizmodo.com/gunshots-heard-at-canadian-ostrich-farm-signaling-the-start-of-a-controversial-cull-2000683114</link>
      <pubDate>Fri, 07 Nov 2025 16:15:27 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683114</guid>
      <description>The cull, spurred by bird flu concerns, aims to eradicate 400 ostriches living on a farm in British Columbia.</description>
    </item>
    <item>
      <title>TSLA stock price: Elon Musk got his $1 trillion pay package. Here&#8217;s how Tesla investors are reacting</title>
      <link>https://www.fastcompany.com/91437525/tsla-stock-price-elon-musk-got-his-1-trillion-pay-package-heres-how-tesla-investors-are-reacting</link>
      <pubDate>2025-11-07T16:15:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91437525/tsla-stock-price-elon-musk-got-his-1-trillion-pay-package-heres-how-tesla-investors-are-reacting</guid>
      <description>Shareholders voted this week to approve the package, which would make Musk the world&#8217;s first trillionaire if the company reaches certain milestones.
Yesterday, Tesla, Inc. (Nasdaq: TSLA) shareholders overwhelmingly approved the controversial and historic pay package deal for the electric vehicle maker&#8217;s CEO, Elon Musk. That package is worth up to nearly $1 trillion in compensation for Musk&#8212;provided the company reaches certain milestones....</description>
    </item>
    <item>
      <title>Best gift ideas for the woman in your life that are more than just another bathrobe</title>
      <link>https://mashable.com/gifts/best-gifts-for-her</link>
      <pubDate>Fri, 07 Nov 2025 16:14:06 +0000</pubDate>
      <guid isPermaLink="false">03adb0GY9tjOpJ1RL75EhVZ</guid>
      <description>Shop home, tech, and beauty gifts for the lucky lady in your life.</description>
    </item>
    <item>
      <title>Capture all the action with the DJI Osmo 360 Camera Adventure Combo for its lowest price yet</title>
      <link>https://mashable.com/article/nov-7-dji-osmo-360-deal</link>
      <pubDate>Fri, 07 Nov 2025 16:06:43 +0000</pubDate>
      <guid isPermaLink="false">03CZzOmYXFCwEKilgDR7GQ6</guid>
      <description>As of Nov. 7, get the DJI Osmo 360 Camera Adventure Combo for its lowest price yet.</description>
    </item>
    <item>
      <title>Hyundai IT services breach could put 2.7 million Hyundai, Kia owners in the US at risk</title>
      <link>https://www.techradar.com/pro/security/hyundai-it-services-breach-could-put-2-7-million-hyundai-kia-owners-at-risk</link>
      <pubDate>Fri, 07 Nov 2025 16:05:00 +0000</pubDate>
      <guid isPermaLink="false">S3eapVD8dZ76nzAmGBWR6b</guid>
      <description>The company confirmed suffering a cyberattack, but the exact number of victims is still not known.</description>
    </item>
    <item>
      <title>These millionaires have a suggestion for the FAA: Cancel all private jet flights during the shutdown</title>
      <link>https://www.fastcompany.com/91437451/faa-should-cancel-all-private-jets-during-shutdown-say-millionaires</link>
      <pubDate>2025-11-07T16:05:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91437451/faa-should-cancel-all-private-jets-during-shutdown-say-millionaires</guid>
      <description>Private jets make up one in six flights handled by the FAA, and taxpayers already foot the bill for their &#8216;jet setting,&#8217; says Patriotic Millionaires.
As the longest government shutdown in U.S. history continues, the Federal Aviation Administration (FAA) has ordered flight reductions at 40 major airports, including Atlanta, New York, Boston, and Los Angeles.&#160;...</description>
    </item>
    <item>
      <title>Gore-Tex : clap de fin pour les v&#234;tements Gorewear v&#233;los et running apr&#232;s 40 ans d&#8217;existence</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2860459_gore-tex-clap-de-fin-pour-les-vetements-gorewear-velos-et-running-apres-40-ans-dexistence</link>
      <pubDate>Fri, 07 Nov 2025 16:03:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2860459_gore-tex-clap-de-fin-pour-les-vetements-gorewear-velos-et-running-apres-40-ans-dexistence</guid>
      <description>
Les &#233;quipements v&#233;los Gorewear (ainsi que ceux de running) vont dispara&#238;tre en 2026 apr&#232;s plus de 40 ans de carri&#232;re a annonc&#233; la maison-m&#232;re du c&#233;l&#232;bre Gore-Tex, &#224; cause de perspectives financi&#232;res sombres.
</description>
    </item>
    <item>
      <title>The Nintendo Switch 2 has had its price slashed at retailers in the UK, including an EA Sports FC 26 bundle at Currys</title>
      <link>https://www.techradar.com/gaming/nintendo/the-nintendo-switch-2-has-had-its-price-slashed-at-retailers-in-the-uk-including-an-ea-sports-fc-26-bundle-at-currys</link>
      <pubDate>Fri, 07 Nov 2025 16:01:58 +0000</pubDate>
      <guid isPermaLink="false">SphZjHKQh27eRpy9Vx75FR</guid>
      <description>The Nintendo Switch 2 is receiving big discounts ahead of Black Friday, with savings at a range of retailers.</description>
    </item>
    <item>
      <title>Let&#8217;s Talk About the Ending of &#8216;Predator: Badlands&#8217;</title>
      <link>https://gizmodo.com/predator-badlands-ending-aliens-weyland-yutani-2000682576</link>
      <pubDate>Fri, 07 Nov 2025 16:00:52 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682576</guid>
      <description>Elle Fanning stars in the new 'Predator' movie from director Dan Trachtenberg, now in theaters.</description>
    </item>
    <item>
      <title>How to watch Sao Paulo Grand Prix 2025 F1: free streams, schedule, Sprint weekend, weather forecast</title>
      <link>https://www.techradar.com/how-to-watch/formula-one/sao-paulo-grand-prix-2025-f1-free</link>
      <pubDate>Fri, 07 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">82vqk8r2BWpnXik7kSNLqC</guid>
      <description>All the ways to watch Sao Paolo Grand Prix live streams online and from anywhere, as Lando Norris, Oscar Piastri and Max Verstappen head to Interlagos, Brazil.</description>
    </item>
    <item>
      <title>Cdiscount : voici les 11 bonnes affaires &#224; d&#233;nicher pendant le pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2850059_cdiscount-voici-les-10-bonnes-affaires-a-denicher-pendant-le-pre-black-friday</link>
      <pubDate>Fri, 07 Nov 2025 15:59:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850059_cdiscount-voici-les-10-bonnes-affaires-a-denicher-pendant-le-pre-black-friday</guid>
      <description>
Cdiscount entre lui aussi dans la course aux bonnes affaires en ouvrant son op&#233;ration pr&#233;-Black Friday. Il y a une multitude de r&#233;ductions sur une large s&#233;lection de produits Tech. Les offres sont nombreuses, mais vous retrouverez uniquement celles qui m&#233;ritent votre argent.&#160;
</description>
    </item>
    <item>
      <title>&#8216;GTA VI&#8217;s Delay Is a Good Thing if it Means it&#8217;ll Come to Handhelds</title>
      <link>https://gizmodo.com/gta-vi-delay-good-thing-if-it-means-release-on-handhelds-2000683095</link>
      <pubDate>Fri, 07 Nov 2025 15:56:49 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683095</guid>
      <description>And it's not just the Switch 2 that could use a taste of Grand Theft Auto.</description>
    </item>
    <item>
      <title>Tesla delays Roadster unveil to April Fools Day next year</title>
      <link>https://mashable.com/article/tesla-roadster-2026</link>
      <pubDate>Fri, 07 Nov 2025 15:52:38 +0000</pubDate>
      <guid isPermaLink="false">04e6nglakoqzETAfkZVfWAp</guid>
      <description>Tesla is unveiling its next-generation Roadster on April 1, 2026.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs objectifs photos pour smartphone en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/1370769_quels-sont-les-meilleurs-objectifs-photos-pour-smartphone</link>
      <pubDate>Fri, 07 Nov 2025 15:50:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1370769_quels-sont-les-meilleurs-objectifs-photos-pour-smartphone</guid>
      <description>
La photographie sur t&#233;l&#233;phone a certes beaucoup &#233;volu&#233; mais reste toujours perfectible. Notre s&#233;lection d'objectifs pour smartphones vous permettra de ne jamais &#234;tre pris au d&#233;pourvu.
</description>
    </item>
    <item>
      <title>Farmers&#8217; Almanac to Publish Final Issue, Ending 208-Year Forecasting Legacy</title>
      <link>https://gizmodo.com/farmers-almanac-to-publish-final-issue-ending-208-year-forecasting-legacy-2000683082</link>
      <pubDate>Fri, 07 Nov 2025 15:45:34 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683082</guid>
      <description>The decision reflects the &#8220;growing financial challenge&#8221; of producing the magazine in today&#8217;s media environment, the publication said.</description>
    </item>
    <item>
      <title>Privacy-Focused Bitcoin Developer Gets 5-Year Prison Sentence</title>
      <link>https://gizmodo.com/privacy-focused-bitcoin-developer-gets-5-year-prison-sentence-2000683106</link>
      <pubDate>Fri, 07 Nov 2025 15:45:32 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683106</guid>
      <description>Some people in the crypto community see the case as egregious at a time when shitcoin peddlers get favorable treatment.</description>
    </item>
    <item>
      <title>This Lenovo tablet is just as good as any iPad and its now $160 off</title>
      <link>https://mashable.com/article/nov-7-lenovo-legion-tab-gen-3-deal</link>
      <pubDate>Fri, 07 Nov 2025 15:44:06 +0000</pubDate>
      <guid isPermaLink="false">04BZgdKt1qWvav0TNVrxJla</guid>
      <description>The Lenovo Legion Tab Gen 3 tablet is an Android tablet that is just as good as an iPad, and right now it's on sale. Get the Lenovo Legion Tab Gen 3 for just $389.99 and save $160 for 29% off.</description>
    </item>
    <item>
      <title>IPVanish joins NordVPN in the race to support Amazon's new Fire TV Stick</title>
      <link>https://www.techradar.com/vpn/vpn-services/ipvanish-joins-nordvpn-in-the-race-to-support-amazons-new-fire-tv-stick</link>
      <pubDate>Fri, 07 Nov 2025 15:42:54 +0000</pubDate>
      <guid isPermaLink="false">CstjjGcKaip7j5Au52YWhb</guid>
      <description>Hot on the heels of rival NordVPN, IPVanish has confirmed it's ready for Amazon's new Vega OS to ensure users of Amazon's next-gen streaming stick can stay protected from day one.</description>
    </item>
    <item>
      <title>Pour battre un record que personne ne demande, cet &#233;cran fait une &#233;norme concession</title>
      <link>https://www.frandroid.com/marques/asus/2860411_pour-battre-un-record-que-personne-ne-demande-cet-ecran-fait-une-enorme-concession</link>
      <pubDate>Fri, 07 Nov 2025 15:42:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/asus/2860411_pour-battre-un-record-que-personne-ne-demande-cet-ecran-fait-une-enorme-concession</guid>
      <description>
Quand la course &#224; la technologie va trop loin. Asus d&#233;voile un bluffant &#233;cran Oled capable de monter &#224; 720 Hz, au prix d'une d&#233;finition ridicule.
</description>
    </item>
    <item>
      <title>&#192; quoi servent les batteries solaires, et sont-elles r&#233;ellement rentables ?</title>
      <link>https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2780579_a-quoi-servent-les-batteries-solaires-et-sont-elles-reellement-rentables</link>
      <pubDate>Fri, 07 Nov 2025 15:40:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2780579_a-quoi-servent-les-batteries-solaires-et-sont-elles-reellement-rentables</guid>
      <description>
Simple effet de mode, ou v&#233;ritable utilit&#233; ? Si le march&#233; des batteries est en pleine expansion, voyons ensemble &#224; quoi ces batteries peuvent servir au quotidien, et si elles sont rentables.
</description>
    </item>
    <item>
      <title>Spiraling costs of downtime tell us it's time for a new engineering mindset</title>
      <link>https://www.techradar.com/pro/spiraling-costs-of-downtime-tell-us-its-time-for-a-new-engineering-mindset</link>
      <pubDate>Fri, 07 Nov 2025 15:39:16 +0000</pubDate>
      <guid isPermaLink="false">mtpaBhcFTc5GhzGWewa4Ga</guid>
      <description>Millions lost to downtime can be avoided with a new engineering mindset.</description>
    </item>
    <item>
      <title>The Best Gifts for Sleep, as Tested by Our Team</title>
      <link>https://www.wired.com/gallery/best-sleep-gifts/</link>
      <pubDate>Fri, 07 Nov 2025 15:39:00 +0000</pubDate>
      <guid isPermaLink="false">5df9366af3e9430008799857</guid>
      <description>Sleep is the one thing every giftee needs, and you can help them get it. These are our tried-and-tested picks for giftable sleep aids, from masks to melatonin.</description>
    </item>
  </channel>
</rss>
