<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 20 Feb 2026 09:48:17 GMT</lastBuildDate>
    <item>
      <title>Trahi par une publication officielle, Tesla confirme que ses voitures autonomes ne sont pas des voitures autonomes</title>
      <link>https://www.frandroid.com/marques/tesla/2984013_trahi-par-une-publication-officielle-tesla-confirme-que-ses-voitures-autonomes-ne-sont-pas-des-voitures-autonomes</link>
      <pubDate>Fri, 20 Feb 2026 09:46:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2984013_trahi-par-une-publication-officielle-tesla-confirme-que-ses-voitures-autonomes-ne-sont-pas-des-voitures-autonomes</guid>
      <description>
Plusieurs mois apr&#232;s son lancement, le service de taxis autonomes de Tesla n&#8217;est toujours pas &#224; 100&#160;% autonome et a toujours besoin d&#8217;une double supervision humaine. Logique, selon la marque, qui estime que sa technologie reste plus fiable que celle de son rival Waymo.
</description>
    </item>
    <item>
      <title>La crise de la RAM menace tous les appareils &#233;lectroniques</title>
      <link>https://www.frandroid.com/culture-tech/economie/2983903_la-crise-de-la-ram-menace-tous-les-appareils-electroniques</link>
      <pubDate>Fri, 20 Feb 2026 09:44:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/economie/2983903_la-crise-de-la-ram-menace-tous-les-appareils-electroniques</guid>
      <description>
Depuis quelques mois, le secteur de la Tech est touch&#233; par une crise de la m&#233;moire vive. En se concentrant sur le march&#233; de l&#8217;intelligence artificielle au d&#233;triment des produits grand public, les industriels font grimper les prix de tous les objets incluant ce composant.
</description>
    </item>
    <item>
      <title>Alerte IPTV&#160;: ce virus peut contracter un pr&#234;t en votre nom en pillant vos donn&#233;es</title>
      <link>https://www.01net.com/actualites/alerte-iptv-virus-contracter-pret-votre-nom-pillant-donnees.html</link>
      <pubDate>Fri, 20 Feb 2026 09:31:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327025</guid>
      <description>Si vous utilisez un service IPTV, vous &#234;tes dans le collimateur des cybercriminels. Des chercheurs en cybers&#233;curit&#233; ont en effet d&#233;couvert un virus bancaire qui se cache dans de fausses applications IPTV. Celles-ci sont distribu&#233;es sur Internet sous la forme de fichiers APK. Au terme de l'attaque, les utilisateurs risquent de crouler sous les dettes......</description>
    </item>
    <item>
      <title>C&#8217;est officiel : les fatbikes &#233;lectriques vont &#234;tre interdits dans certaines zones tr&#232;s fr&#233;quent&#233;es d&#8217;Amterdam</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2984123_cest-officiel-les-fatbikes-electriques-vont-etre-interdits-dans-certaines-zones-tres-frequentees-damterdam</link>
      <pubDate>Fri, 20 Feb 2026 09:29:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2984123_cest-officiel-les-fatbikes-electriques-vont-etre-interdits-dans-certaines-zones-tres-frequentees-damterdam</guid>
      <description>
Le conseil municipal d&#8217;Amsterdam a vot&#233; l&#8217;interdiction des fatbikes &#233;lectriques dans certaines zones tr&#232;s fr&#233;quent&#233;es de la capitale, une mesure qui sera int&#233;gr&#233;e au R&#232;glement municipal g&#233;n&#233;ral sans que son calendrier pr&#233;cis ni son p&#233;rim&#232;tre d&#233;finitif ne soient encore connus.
</description>
    </item>
    <item>
      <title>iFi&#8217;s new trio of high-end DACs includes a powerful amp combo &#8211; and I'm going to need to try it</title>
      <link>https://www.techradar.com/audio/ifis-new-trio-of-high-end-dacs-includes-a-powerful-amp-combo-and-im-going-to-need-to-try-it</link>
      <pubDate>Fri, 20 Feb 2026 09:21:28 +0000</pubDate>
      <guid isPermaLink="false">Wj7iuky7GqJTnCwfJy2x2W</guid>
      <description>iFi just unveiled three new DACs, including a new workhorse and a stream-friendly model</description>
    </item>
    <item>
      <title>Pour relancer les ventes, Tesla lance une version plus abordable de son Cybertruck&#160;: voil&#224; ce qui change</title>
      <link>https://www.frandroid.com/marques/tesla/2983915_pour-relancer-les-ventes-tesla-lance-une-version-plus-abordable-de-son-cybertruck-voila-ce-qui-change</link>
      <pubDate>Fri, 20 Feb 2026 09:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2983915_pour-relancer-les-ventes-tesla-lance-une-version-plus-abordable-de-son-cybertruck-voila-ce-qui-change</guid>
      <description>
Alors que les ventes du Cybertruck sont en berne, Tesla relance une version plus abordable, qui d&#233;marre sous les 60 000 dollars. Voici les diff&#233;rences avec la version Premium du pick-up &#233;lectrique, qui d&#233;marre &#224; environ 80 000 dollars.
</description>
    </item>
    <item>
      <title>Amazon casse le prix du Philips GamePix 900, un vid&#233;oprojecteur 4K pens&#233; pour les gamers</title>
      <link>https://www.frandroid.com/bons-plans/2749143_amazon-casse-le-prix-du-philips-gamepix-900-un-videoprojecteur-4k-pense-pour-les-gamers</link>
      <pubDate>Fri, 20 Feb 2026 09:13:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2749143_amazon-casse-le-prix-du-philips-gamepix-900-un-videoprojecteur-4k-pense-pour-les-gamers</guid>
      <description>
Le Philips GamePix 900, un vid&#233;oprojecteur 4K gaming &#224; 240 Hz et 1 000 lumens, lanc&#233; &#224; 1 199 euros d&#233;gringole &#224; 599 euros sur Amazon. Une aubaine pour une immersion fluide sur un &#233;cran jusqu&#8217;&#224; 120 pouces. 
</description>
    </item>
    <item>
      <title>Xiaomi 17T et 17T Pro : des noms qui se confirment, une date qui se profile plus t&#244;t que pr&#233;vu ?</title>
      <link>https://www.frandroid.com/marques/xiaomi/2983973_xiaomi-17t-et-17t-pro-des-noms-qui-se-confirment-une-date-qui-se-profile-plus-tot-que-prevu</link>
      <pubDate>Fri, 20 Feb 2026 09:08:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2983973_xiaomi-17t-et-17t-pro-des-noms-qui-se-confirment-une-date-qui-se-profile-plus-tot-que-prevu</guid>
      <description>
Il semble de plus en plus &#233;vident que les Xiaomi 17T et 17 Pro succ&#233;deront aux 15T sans passer par les 16T. Mais surtout, ils pourraient &#234;tre pr&#233;sent&#233;s officiellement bien plus t&#244;t que pr&#233;vu, d&#232;s le mois de mai.
</description>
    </item>
    <item>
      <title>Samsung ressuscite Bixby avec l&#8217;IA et &#231;a peut tout changer sur les Galaxy</title>
      <link>https://www.01net.com/actualites/samsung-ressuscite-bixby-avec-lia-et-ca-peut-tout-changer-sur-les-galaxy.html</link>
      <pubDate>Fri, 20 Feb 2026 09:08:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327031</guid>
      <description>Bixby n'est d&#233;finitivement pas mort. Avec One UI 8.5 et Android 16, Samsung m&#233;tamorphose son assistant vocal en un v&#233;ritable agent IA.</description>
    </item>
    <item>
      <title>Cette astuce de l&#8217;Europe aurait pouss&#233; Audi et Skoda &#224; relancer des citadines &#233;lectriques abordables</title>
      <link>https://www.frandroid.com/marques/audi/2983869_cette-astuce-de-leurope-aurait-pousse-audi-et-skoda-a-relancer-des-citadines-electriques-abordables</link>
      <pubDate>Fri, 20 Feb 2026 09:00:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/audi/2983869_cette-astuce-de-leurope-aurait-pousse-audi-et-skoda-a-relancer-des-citadines-electriques-abordables</guid>
      <description>
Si cela n&#8217;&#233;tait au d&#233;part pas pr&#233;vu, Audi et Skoda envisagent &#233;galement de lancer leur propre petite voiture &#233;lectrique. Il s&#8217;agira de deux cousines de la Volkswagen ID. Polo et voil&#224; ce que l&#8217;on sait.
</description>
    </item>
    <item>
      <title>What is the release date for Paradise season 2 episodes 1-3 on Hulu and Disney+?</title>
      <link>https://www.techradar.com/streaming/hulu/paradise-season-2-episode-1-2-3-release-date-time-disney-plus</link>
      <pubDate>Fri, 20 Feb 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">e5ZgXum3xW9bPi44rQvzaP</guid>
      <description>Xavier is on his way to find Teri, but will he make it? And when do Paradise season 2 episodes 1-3 drop on Hulu and Disney+?</description>
    </item>
    <item>
      <title>Test du Tapo RV50 Pro Omni : un bon compagnon au quotidien</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/robot-aspirateur/2962165_test-tapo-rv50-pro-omni</link>
      <pubDate>Fri, 20 Feb 2026 08:55:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/robot-aspirateur/2962165_test-tapo-rv50-pro-omni</guid>
      <description>
Au milieu de ses kits Wi-Fi et autres cam&#233;ras, TP-Link d&#233;veloppe depuis plusieurs ann&#233;es une gamme d&#8217;aspirateurs robots. Le Tapo RV50 Pro Omni, dernier-n&#233; tout-en-un de la gamme, est &#224; l&#8217;essai depuis quelques semaines. Verdict.
</description>
    </item>
    <item>
      <title>&#201;vitez d&#8217;&#234;tre paum&#233;e dans vos discussions de groupe WhatsApp avec cette nouvelle fonctionnalit&#233;</title>
      <link>https://www.frandroid.com/marques/meta/2983997_evitez-detre-paumee-dans-vos-discussions-de-groupe-whatsapp-avec-cette-nouvelle-fonctionnalite</link>
      <pubDate>Fri, 20 Feb 2026 08:53:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2983997_evitez-detre-paumee-dans-vos-discussions-de-groupe-whatsapp-avec-cette-nouvelle-fonctionnalite</guid>
      <description>
Limit&#233; depuis des ann&#233;es par des choix techniques compliqu&#233;s, WhatsApp va enfin ajouter la possibilit&#233; pour les nouveaux membres d&#8217;une conversation de groupe de voir l&#8217;historique des conversations.
</description>
    </item>
    <item>
      <title>Le meilleur op&#233;rateur mobile en 2026&#160;: qui propose le meilleur r&#233;seau 5G/4G entre Bouygues Telecom, Free, Orange et SFR&#8201;?</title>
      <link>https://www.frandroid.com/telecom/368608_bouygues-telecom-free-mobile-orange-et-sfr-quel-est-le-meilleur-reseau-mobile</link>
      <pubDate>Fri, 20 Feb 2026 08:44:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/368608_bouygues-telecom-free-mobile-orange-et-sfr-quel-est-le-meilleur-reseau-mobile</guid>
      <description>
Orange, SFR, Bouygues Telecom ou Free ? Voici les quatre op&#233;rateurs mobiles qui r&#233;gissent le march&#233;, chacun avec ses avantages et ses inconv&#233;nients. Voici lequel des quatre est le meilleur, selon les enqu&#234;tes de l'Arcep et d'autres comparateurs, sur la qualit&#233; du r&#233;seau et du service client.
</description>
    </item>
    <item>
      <title>IBAN vol&#233; : quels sont les risques si vos coordonn&#233;es bancaires fuitent en ligne ?</title>
      <link>https://www.frandroid.com/services/2383788_iban-vole-quels-sont-les-risques-si-vos-coordonnees-bancaires-ont-fuite-en-ligne</link>
      <pubDate>Fri, 20 Feb 2026 08:35:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/2383788_iban-vole-quels-sont-les-risques-si-vos-coordonnees-bancaires-ont-fuite-en-ligne</guid>
      <description>
Il y a quelques jours, la DGFIP a confirm&#233; avoir &#233;t&#233; touch&#233; par un piratage dont le responsable revendique la fuite de plus de 1,2 millions d'IBAN. Si en th&#233;orie, un identifiant bancaire ne suffit pas &#224; effectuer des pr&#233;l&#232;vements sur un compte, leur vol par un hacker n'est jamais sans cons&#233;quences.
</description>
    </item>
    <item>
      <title>Pourquoi votre compte Claude Pro risque d&#8217;&#234;tre banni si vous utilisez un de ces outils</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/anthropic-claude-ai/2984001_pourquoi-votre-compte-claude-pro-risque-detre-banni-si-vous-utilisez-un-de-ces-outils</link>
      <pubDate>Fri, 20 Feb 2026 08:27:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/anthropic-claude-ai/2984001_pourquoi-votre-compte-claude-pro-risque-detre-banni-si-vous-utilisez-un-de-ces-outils</guid>
      <description>
Si vous utilisez OpenClaw ou OpenCode pour coder avec Claude, il est temps de d&#233;brancher. Anthropic vient de mettre &#224; jour ses conditions d'utilisation avec une menace tr&#232;s claire : l'usage de vos jetons d'abonnement Pro dans des outils tiers est d&#233;sormais un motif de bannissement imm&#233;diat.
</description>
    </item>
    <item>
      <title>Le puissant Lenovo Yoga 7i sous Ultra 7 &#224; mi-chemin entre le PC portable et la tablette devient encore plus int&#233;ressant avec cette remise de 150 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2983447_le-puissant-lenovo-yoga-7i-sous-ultra-7-a-mi-chemin-entre-le-pc-portable-et-la-tablette-devient-encore-plus-interessant-avec-cette-remise-de-150-e</link>
      <pubDate>Fri, 20 Feb 2026 08:21:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2983447_le-puissant-lenovo-yoga-7i-sous-ultra-7-a-mi-chemin-entre-le-pc-portable-et-la-tablette-devient-encore-plus-interessant-avec-cette-remise-de-150-e</guid>
      <description>
Avec le Lenovo Yoga 7i 2-en-1, vous aurez entre vos mains un laptop hybride o&#249; vous pourrez donner libre cours &#224; votre cr&#233;ativit&#233; gr&#226;ce &#224; la puce Ultra 7 et aux possibilit&#233;s offertes par l'intelligence artificielle. En ce moment, il est en promotion &#224; 899 euros au lieu de 1 049 euros.
</description>
    </item>
    <item>
      <title>Freebox Ultra, Delta, Pop, Revolution : Free d&#233;ploie une mise &#224; jour avec plein de changements</title>
      <link>https://www.frandroid.com/marques/free/2983987_freebox-ultra-delta-pop-revolution-free-deploie-une-mise-a-jour-avec-plein-de-changements</link>
      <pubDate>Fri, 20 Feb 2026 08:18:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2983987_freebox-ultra-delta-pop-revolution-free-deploie-une-mise-a-jour-avec-plein-de-changements</guid>
      <description>
Si vous poss&#233;dez une Freebox, c'est le moment de la red&#233;marrer. Free vient de l&#226;cher une salve de mises &#224; jour pour presque tout son parc, de la v&#233;n&#233;rable Revolution &#224; la derni&#232;re Ultra.
</description>
    </item>
    <item>
      <title>The best cheap Android phones to buy in 2026</title>
      <link>https://www.engadget.com/mobile/smartphones/best-cheap-android-phone-160029703.html?src=rss</link>
      <pubDate>Fri, 20 Feb 2026 08:00:37 +0000</pubDate>
      <guid isPermaLink="false">31bfb9b5-b1b8-4e3a-a320-93ba0da94c6a</guid>
      <description>Getting a solid Android phone doesn&#8217;t necessitate spending a small fortune. The best budget models strike a great balance between price and performance, giving you smooth everyday use without cutting too many corners. Whether you&#8217;re scrolling social media, streaming your favorite shows or snapping photos of a night out, there&#8217;s an affordable Android phone that can handle it all.Cheaper phones have come a long way in recent years. Many now feature bright, fast displays, reliable cameras and battery life that lasts well into the next day. You might miss out on top-tier extras like the latest pro...</description>
    </item>
    <item>
      <title>Contr&#244;le total par la voix : la promesse folle du nouveau Bixby de Samsung</title>
      <link>https://www.frandroid.com/marques/samsung/2983945_samsung-relance-encore-bixby-sur-ses-smartphones-dans-one-ui-8-5</link>
      <pubDate>Fri, 20 Feb 2026 07:58:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2983945_samsung-relance-encore-bixby-sur-ses-smartphones-dans-one-ui-8-5</guid>
      <description>
Samsung entend bien remettre Bixby au centre de sa strat&#233;gie logicielle avec une refonte majeure int&#233;gr&#233;e &#224; One UI 8.5, misant sur le contr&#244;le des appareils par la voix et l&#8217;IA g&#233;n&#233;rative pour rattraper son retard sur les autres assistants vocaux.
</description>
    </item>
  </channel>
</rss>
