<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 10 Jan 2026 11:20:40 GMT</lastBuildDate>
    <item>
      <title>Lutte contre l&#8217;IPTV ill&#233;gale&#160;: Cloudflare accuse un &#171;&#160;cercle opaque d&#8217;&#233;lites m&#233;diatiques europ&#233;ennes&#160;&#187; de censurer internet</title>
      <link>https://www.01net.com/actualites/lutte-contre-liptv-illegale-cloudflare-accuse-un-cercle-opaque-delites-mediatiques-europeennes-de-censurer-internet.html</link>
      <pubDate>Sat, 10 Jan 2026 11:02:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319252</guid>
      <description>Le ton monte d'un cran en Italie, entre Cloudflare et le r&#233;gulateur des communications du pays. &#192; tel point que le g&#233;ant mondial des infrastructures internet menace de d&#233;brancher les serveurs install&#233;s en Italie.</description>
    </item>
    <item>
      <title>12 Best Coffee Subscriptions (2026), Tested by Caffeine Hounds</title>
      <link>https://www.wired.com/gallery/best-coffee-subscriptions/</link>
      <pubDate>Sat, 10 Jan 2026 11:01:00 +0000</pubDate>
      <guid isPermaLink="false">64e3818a57ff6ec62db8a982</guid>
      <description>These services deliver freshly roasted, delicious coffee picks right to your door&#8212;each with its own twist.</description>
    </item>
    <item>
      <title>Montres connect&#233;es : ces 4 avanc&#233;es majeures vont changer votre quotidien en 2026</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2927739_montres-connectees-ces-4-avancees-majeures-vont-changer-votre-quotidien-en-2026</link>
      <pubDate>Sat, 10 Jan 2026 11:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2927739_montres-connectees-ces-4-avancees-majeures-vont-changer-votre-quotidien-en-2026</guid>
      <description>
Apr&#232;s une ann&#233;e 2025 d&#233;j&#224; particuli&#232;rement int&#233;ressante dans le domaine des wearables, cette nouvelle ann&#233;e 2026 s'annonce particuli&#232;rement enthousiasmante avec des nouveaut&#233;s aussi bien sur les mesures que les fonctionnalit&#233;s. 
</description>
    </item>
    <item>
      <title>Goldring's G3 turntable is all about style and convenience, but there's one aspect I wish I could switch off...</title>
      <link>https://www.techradar.com/audio/turntables/goldring-gr3-turntable-review</link>
      <pubDate>Sat, 10 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">6xqBj8ZkZpwGbHWgcsd2gh</guid>
      <description>The Goldring GR3 turntable offers plug-and-play convenience, great value and excellent sound but there's one areas you'll want to turn off</description>
    </item>
    <item>
      <title>New Year, new (cheap) phone plan - this Mint Mobile deal gets you a full year of unlimited data for just $15/mo</title>
      <link>https://www.techradar.com/phones/network-providers/new-year-new-cheap-phone-plan-this-mint-mobile-deal-gets-you-a-full-year-of-unlimited-data-for-just-usd15-mo</link>
      <pubDate>Sat, 10 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">aXPriDvoUwujQnzrcqM4ab</guid>
      <description>Mint Mobile's still offering a full year of unlimited data for just $15/mo - don't miss this incredible deal before it vanishes for good.</description>
    </item>
    <item>
      <title>5 things I like about the Hydrow Wave smart rowing machine &#8212; and 2 I don't</title>
      <link>https://www.techradar.com/health-fitness/5-things-i-like-about-the-hydrow-wave-smart-rowing-machine-and-2-i-dont</link>
      <pubDate>Sat, 10 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">eLeYFqTho7QL4swKeDtCU7</guid>
      <description>A fantastic smart rowing machine that'll work for just about anyone, providing they can pay the premium.</description>
    </item>
    <item>
      <title>Xiaomi pr&#233;pare un smartphone avec ventilateur interne : la fin d&#233;finitive de la surchauffe ?</title>
      <link>https://www.frandroid.com/marques/xiaomi/2938267_xiaomi-prepare-un-smartphone-avec-ventilateur-interne-la-fin-definitive-de-la-surchauffe</link>
      <pubDate>Sat, 10 Jan 2026 10:56:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2938267_xiaomi-prepare-un-smartphone-avec-ventilateur-interne-la-fin-definitive-de-la-surchauffe</guid>
      <description>
Xiaomi travaillerait sur un smartphone totalement &#233;tanche et &#233;quip&#233; d'un ventilateur physique interne.
</description>
    </item>
    <item>
      <title>Instagram a &#233;t&#233; pirat&#233; : 17,5 millions de comptes dans la nature, comment se prot&#233;ger ?</title>
      <link>https://www.frandroid.com/marques/meta/2938259_instagram-a-ete-pirate-175-millions-de-comptes-dans-la-nature-comment-se-proteger</link>
      <pubDate>Sat, 10 Jan 2026 10:39:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2938259_instagram-a-ete-pirate-175-millions-de-comptes-dans-la-nature-comment-se-proteger</guid>
      <description>
Une base de donn&#233;es contenant les informations personnelles de 17,5 millions d'utilisateurs d'Instagram circule actuellement sur le Dark Web. Si Meta n'a pas encore confirm&#233; l'ampleur de l'incident, les experts en cybers&#233;curit&#233; tirent la sonnette d'alarme : vos donn&#233;es pourraient &#234;tre utilis&#233;es pour des attaques sophistiqu&#233;es par r&#233;initialisation de mot de passe.
...</description>
    </item>
    <item>
      <title>Where Are All the New Cars?</title>
      <link>https://www.wired.com/story/where-were-all-the-new-cars-at-ces-2026/</link>
      <pubDate>Sat, 10 Jan 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">695f909ce3600d112c322a33</guid>
      <description>New cars were scant at CES this year, largely because the center of gravity for the auto world has moved&#8212;technologically and geographically&#8212;to China.</description>
    </item>
    <item>
      <title>Le tout nouveau Xiaomi Poco M8 Pro 5G est &#224; peine en ligne que les soldes d&#8217;hiver lui retirent plus de 40 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2934893_le-tout-nouveau-xiaomi-poco-m8-pro-5g-est-a-peine-en-ligne-que-les-soldes-dhiver-lui-retirent-plus-de-40-e</link>
      <pubDate>Sat, 10 Jan 2026 10:22:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2934893_le-tout-nouveau-xiaomi-poco-m8-pro-5g-est-a-peine-en-ligne-que-les-soldes-dhiver-lui-retirent-plus-de-40-e</guid>
      <description>
Xiaomi d&#233;gaine un nouveau smartphone sous sa banni&#232;re Poco avec le M8 Pro, une machine bien arm&#233;e : &#233;cran AMOLED, SoC Snapdragon, grosse batterie et bloc photo polyvalent. Pour les soldes d&#8217;hiver, le ticket d&#8217;entr&#233;e fond : 309 euros au lieu de 353 euros sur le site officiel de la marque.
</description>
    </item>
    <item>
      <title>NASA is ending Crew-11 astronauts' mission a month early</title>
      <link>https://www.engadget.com/science/space/nasa-is-ending-crew-11-astronauts-mission-a-month-early-140000750.html?src=rss</link>
      <pubDate>Sat, 10 Jan 2026 10:15:06 +0000</pubDate>
      <guid isPermaLink="false">42ad2404-ea52-4c0b-8d5c-462cb7597a55</guid>
      <description>NASA has decided to bring the Crew-11 astronauts home a month earlier than originally planned due to a &#8220;medical concern&#8221; with one of them. This is the first time in its history that the space agency is cutting a mission short due to a medical issue, but it didn&#8217;t identify the crew member or divulge the exact situation and its severity. The agency is targeting a return date no earlier than January 14, with the exact schedule depending on the weather. If NASA&#8217;s original plan pushes through, the crew will splash down off the coast of California at approximately 3:40 AM on January 15.The agency pr...</description>
    </item>
    <item>
      <title>La France comptera toujours quatre op&#233;rateurs en 2026, vente de SFR ou pas</title>
      <link>https://www.01net.com/actualites/la-france-comptera-toujours-quatre-operateurs-en-2026-vente-de-sfr-ou-pas.html</link>
      <pubDate>Sat, 10 Jan 2026 10:02:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319248</guid>
      <description>2026 ne sera sans doute pas l'ann&#233;e o&#249; les consommateurs devront choisir leur forfait mobile entre trois grands op&#233;rateurs, au lieu de quatre. En cas de vente de SFR, le r&#233;gulateur devra en effet donner son feu vert, ce qui demandera du temps au vu de la complexit&#233; du dossier. Et c'est sans compter Altice France, qui pourrait finalement d&#233;cider de vendre son op&#233;rateur par petits bouts&#8230;...</description>
    </item>
    <item>
      <title>Fuite de donn&#233;es chez Instagram&#160;: les informations de 17 millions d&#8217;utilisateurs ont &#233;t&#233; vol&#233;es</title>
      <link>https://www.01net.com/actualites/fuite-donnees-instagram-informations-17-millions-utilisateurs-volees.html</link>
      <pubDate>Sat, 10 Jan 2026 10:02:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319288</guid>
      <description>Des pirates ont mis la main sur les donn&#233;es sensibles de 17,5 millions de comptes Instagram. Partag&#233;es sur le dark web, elles mettent en danger tous les utilisateurs concern&#233;s.</description>
    </item>
    <item>
      <title>Wolves vs Shrewsbury Live Streams: How to Watch FA Cup 3rd Round Tie 2025/26</title>
      <link>https://www.techradar.com/how-to-watch/football/wolves-vs-shrewsbury-fa-cup-3rd-round-2025-26</link>
      <pubDate>Sat, 10 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">Chrh6as7K6APQzRkeJY3M</guid>
      <description>All the ways to watch Wolves vs Shrewsbury as Michael Appleton's side look to spring an upset in the FA Cup 3rd Round.</description>
    </item>
    <item>
      <title>Lynley season 2 hasn't been confirmed &#8212; but its cast think there's 'scope' for even more than that</title>
      <link>https://www.techradar.com/streaming/entertainment/lynley-season-2-hasnt-been-confirmed-but-its-cast-think-theres-scope-for-even-more-than-that</link>
      <pubDate>Sat, 10 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">DSrCwVHgSTfhpQMn5VKxyK</guid>
      <description>Four episodes of Lynley didn't feel like enough, but is a second series of the new BBC crime show happening? According to its cast, 'there are so many places to go'.</description>
    </item>
    <item>
      <title>ICYMI: the week's 7 biggest tech stories from CES 2026 to ChatGPT's medical update</title>
      <link>https://www.techradar.com/tech/icymi-the-weeks-7-biggest-tech-stories-from-ces-2026-to-chatgpts-medical-update</link>
      <pubDate>Sat, 10 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">Pw7JhyBdERK7xkESoh9xD6</guid>
      <description>The biggest tech news from CES 2026, ChatGPT, Samsung, and more for January 10, 2026.</description>
    </item>
    <item>
      <title>These will be the 11 biggest tech trends of 2026, according to CES 2026</title>
      <link>https://www.techradar.com/tech/the-11-biggest-tech-trends-of-2026-according-to-ces-2026</link>
      <pubDate>Sat, 10 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">sdhYfUjd3qTgnwKKT9UHYD</guid>
      <description>CES 2026 is over, but what have we learned? A lot actually &#8211;here are the biggest  trends that will likely dominate the tech world for the next twelve months.</description>
    </item>
    <item>
      <title>7 ways to learn faster and improve your memory, backed by neuroscience</title>
      <link>https://www.fastcompany.com/91469243/7-ways-learn-faster-improve-memory-neuroscience</link>
      <pubDate>2026-01-10T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91469243/7-ways-learn-faster-improve-memory-neuroscience</guid>
      <description>Want to learn more quickly, and retain more of what you learn? Neuroscience says boosting your memory is relatively easy.
What you do? It starts with what you know.</description>
    </item>
    <item>
      <title>Apple&#8217;s big 2026 plans</title>
      <link>https://www.fastcompany.com/91470533/apple-2026-new-product-iphone-fold-tv-siri-ai-smart-home-homepad-macbook</link>
      <pubDate>2026-01-10T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91470533/apple-2026-new-product-iphone-fold-tv-siri-ai-smart-home-homepad-macbook</guid>
      <description>A foldable iPhone, a MacBook that&#8217;s actually affordable, an AI-enhanced Siri, and more.
2025 was a fairly humdrum year for Apple from a hardware perspective. While the company&#8217;s software&#8212;including the &#8220;26&#8221; versions of iOS, macOS, tvOS, and watchOS&#8212;got a major visual overhaul, Apple&#8217;s hardware lineup included just one brand new product: the iPhone Air....</description>
    </item>
    <item>
      <title>La&#160;Presse au CES de Las&#160;Vegas | Les objets du quotidien, de&#160;plus en plus intelligents</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-01-10/la-presse-au-ces-de-las-vegas/les-objets-du-quotidien-de-plus-en-plus-intelligents.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Sat, 10 Jan 2026 05:00:00 -0500</pubDate>
      <guid isPermaLink="false">7a98f877e8bc3c368b644fe72e8a4786</guid>
      <description>Le CES&#160;2026 confirme une tendance lourde&#160;: l&#8217;intelligence artificielle s&#8217;installe partout dans nos objets du quotidien. Du frigo aux jouets de construction, tout devient connect&#233; et r&#233;actif. Voici 10&#160;innovations qui ont retenu l&#8217;attention dans les all&#233;es bond&#233;es du salon v&#233;gasien.</description>
    </item>
  </channel>
</rss>
