<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 08 Nov 2025 09:31:48 GMT</lastBuildDate>
    <item>
      <title>Fan de la marque Marshall ? Sa derni&#232;re enceinte Emberton III est &#224; prix cass&#233; lors du pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2565863_fan-de-la-marque-marshall-sa-derniere-enceinte-emberton-iii-est-a-prix-casse-lors-du-pre-black-friday</link>
      <pubDate>Sat, 08 Nov 2025 09:21:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2565863_fan-de-la-marque-marshall-sa-derniere-enceinte-emberton-iii-est-a-prix-casse-lors-du-pre-black-friday</guid>
      <description>
La Marshall Emberton III est un tr&#232;s bel objet, robuste et agr&#233;able &#224; utiliser. Elle offre une autonomie de 32 heures, un son &#224; 360 degr&#233;s, une certification IP67... Le tout pour 116 euros seulement lors du pr&#233;-Black Friday au lieu de 179 euros de base. 
</description>
    </item>
    <item>
      <title>Way too complex: why modern tech stacks need observability</title>
      <link>https://www.techradar.com/pro/way-too-complex-why-modern-tech-stacks-need-observability</link>
      <pubDate>Sat, 08 Nov 2025 09:05:29 +0000</pubDate>
      <guid isPermaLink="false">SD8Yzhn39gZ5Hz7nXQ9KJH</guid>
      <description>In a digitally dependent world,  observability predicts and resolves software failures before chaos strikes.</description>
    </item>
    <item>
      <title>No wonder it got hit - report claims password for the Louvre&#8217;s video surveillance system was...&#8220;LOUVRE&#8221;</title>
      <link>https://www.techradar.com/pro/security/no-wonder-it-got-hit-report-claims-password-for-the-louvres-video-surveillance-system-was-louvre</link>
      <pubDate>Sat, 08 Nov 2025 09:03:00 +0000</pubDate>
      <guid isPermaLink="false">hFb8qiY9AdRs4pCspGWcyF</guid>
      <description>Using &#8220;LOUVRE&#8221; as a password, and running Windows 2000/Windows Server 2003 certainly didn&#8217;t help.</description>
    </item>
    <item>
      <title>Lioness season 3: everything we know so far about the hit Paramount+ show's return</title>
      <link>https://www.techradar.com/streaming/paramount-plus/lioness-season-3</link>
      <pubDate>Sat, 08 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">ufyMgs4HiuYZGdK5w2MQGc</guid>
      <description>Lioness season 3 is officially in production. Here's everything we know so far from release date, trailer, predicted cast, plot rumors and more.</description>
    </item>
    <item>
      <title>Le top 3 des meilleurs v&#233;los test&#233;s par Frandroid en novembre 2025</title>
      <link>https://www.frandroid.com/guide-dachat/2858657_le-top-3-des-meilleurs-vae-testes-par-frandroid-en-novembre-2025</link>
      <pubDate>Sat, 08 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2858657_le-top-3-des-meilleurs-vae-testes-par-frandroid-en-novembre-2025</guid>
      <description>
Du c&#244;t&#233; des VAE, le march&#233; est un peu au ralenti. Cela n'emp&#234;che pas Frandroid de tester des mod&#232;les et de vous livrer son top 3 des v&#233;los &#233;lectriques favoris.
</description>
    </item>
    <item>
      <title>Fnac et Darty se montrent bien g&#233;n&#233;reux lors du pr&#233;-Black Friday : les 18 deals qui valent le coup</title>
      <link>https://www.frandroid.com/bons-plans/2849237_fnac-et-darty-se-montrent-bien-genereux-lors-du-pre-black-friday-les-15-deals-qui-valent-le-coup</link>
      <pubDate>Sat, 08 Nov 2025 08:41:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849237_fnac-et-darty-se-montrent-bien-genereux-lors-du-pre-black-friday-les-15-deals-qui-valent-le-coup</guid>
      <description>
Pour ne pas laisser le champ libre &#224; Boulanger, la Fnac et Darty prennent aussi de l'avance sur le Black Friday et d&#233;ploient &#224; leur tour de solides offres sur de nombreux produits Tech. Nous avons fait le tri parmi toutes les offres, et voici uniquement celles qui valent le coup. 
</description>
    </item>
    <item>
      <title>Qui attendait un TV OLED 4K LG de 55 pouces &#224; moins de 900 &#8364; pour le pr&#233;-Black Friday ?</title>
      <link>https://www.frandroid.com/bons-plans/2566841_qui-attendait-un-tv-oled-4k-lg-de-55-pouces-a-moins-de-900-pour-le-pre-black-friday</link>
      <pubDate>Sat, 08 Nov 2025 08:33:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2566841_qui-attendait-un-tv-oled-4k-lg-de-55-pouces-a-moins-de-900-pour-le-pre-black-friday</guid>
      <description>
La s&#233;rie C des TV OLED de LG est souvent l&#8217;option la plus int&#233;ressante pour go&#251;ter au savoir faire de la marque. C&#8217;est l&#8217;&#233;quilibre entre performance et accessibilit&#233;. Aujourd'hui, il est possible d'en profiter pour moins de 900 euros durant le pr&#233;-Black Friday.
</description>
    </item>
    <item>
      <title>What are you waiting for? The Argos Black Friday sale already features record-low prices on TVs, appliances, toys, and more</title>
      <link>https://www.techradar.com/seasonal-sales/what-are-you-waiting-for-the-argos-black-friday-sale-already-features-record-low-prices-on-tvs-appliances-toys-and-more</link>
      <pubDate>Sat, 08 Nov 2025 08:30:00 +0000</pubDate>
      <guid isPermaLink="false">X35tcoERM9RrV9CreLhikE</guid>
      <description>Argos' massive Black Friday sale rolls on for another week - don't hesitate to pick up these excellent deals on everything from TVs to appliances.</description>
    </item>
    <item>
      <title>Samsung Galaxy : le logiciel espion &#171; Landfall &#187; a cibl&#233; vos t&#233;l&#233;phones pendant un an via une faille zero-day</title>
      <link>https://www.frandroid.com/android/2861003_samsung-galaxy-le-logiciel-espion-landfall-a-cible-vos-telephones-pendant-un-an-via-une-faille-zero-day</link>
      <pubDate>Sat, 08 Nov 2025 08:29:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/2861003_samsung-galaxy-le-logiciel-espion-landfall-a-cible-vos-telephones-pendant-un-an-via-une-faille-zero-day</guid>
      <description>
Une campagne d'espionnage d'envergure a exploit&#233; une vuln&#233;rabilit&#233; critique sur les Galaxy S22, S23 et S24 pendant pr&#232;s d'un an. Le pire ? L'infection pouvait se faire sans que vous cliquiez sur quoi que ce soit.
</description>
    </item>
    <item>
      <title>Pour les pr&#233;mices du Black Friday, ce nouveau TV Sony de 65&#8243; (OLED, 4K, 120 Hz, Dolby Vision) perd 200 &#8364; de son prix</title>
      <link>https://www.frandroid.com/bons-plans/2856703_pour-les-premices-du-black-friday-ce-nouveau-tv-sony-de-65-oled-4k-120-hz-dolby-vision-perd-200-e-de-son-prix</link>
      <pubDate>Sat, 08 Nov 2025 08:26:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2856703_pour-les-premices-du-black-friday-ce-nouveau-tv-sony-de-65-oled-4k-120-hz-dolby-vision-perd-200-e-de-son-prix</guid>
      <description>
Un ch&#226;ssis fin, une dalle OLED qui en impose pour ce mod&#232;le discr&#232;tement lanc&#233; par Sony. Une r&#233;f&#233;rence sobre, sans r&#233;tro&#233;clairage sur la t&#233;l&#233;commande, mais qui cache les m&#234;mes muscles que son grand fr&#232;re. Le Bravia 8A profite de l'avant Black Friday pour passer &#224; 1 699 euros au lieu de 1 899 euros chez Boulanger. 
</description>
    </item>
    <item>
      <title>Payment resilience: a business priority in a cashless world</title>
      <link>https://www.techradar.com/pro/payment-resilience-a-business-priority-in-a-cashless-world</link>
      <pubDate>Sat, 08 Nov 2025 08:20:00 +0000</pubDate>
      <guid isPermaLink="false">9roE5cmbicMtbi7R6qtSZb</guid>
      <description>As IT outages surge, UK retailers must adopt AI-powered resilience to protect revenue, trust, and customer loyalty.</description>
    </item>
    <item>
      <title>Black Friday 2025 : les offres coulent &#224; flots sur Amazon &amp; Co, mais voici les meilleurs deals &#224; retenir en avant-premi&#232;re</title>
      <link>https://www.frandroid.com/bons-plans/2849105_black-friday-2025-les-offres-coulent-a-flots-sur-amazon-co-mais-voici-les-meilleurs-deals-a-retenir-en-avant-premiere</link>
      <pubDate>Sat, 08 Nov 2025 08:14:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849105_black-friday-2025-les-offres-coulent-a-flots-sur-amazon-co-mais-voici-les-meilleurs-deals-a-retenir-en-avant-premiere</guid>
      <description>
De nombreux e-commer&#231;ants ont pris de l'avance sur le Black Friday. On trouve d&#233;j&#224; de belles remises sur de nombreux produits Tech. Nous suivons les offres les plus int&#233;ressantes en temps r&#233;el pour vous pr&#233;senter une s&#233;lection des meilleures promotions tech du moment, incluant smartphones, ordinateurs, t&#233;l&#233;viseurs, objets connect&#233;s et accessoires.
...</description>
    </item>
    <item>
      <title>ICYMI: the week's 7 biggest tech stories from IKEA's 21 new smart home gadgets to our Samsung Galaxy XR review</title>
      <link>https://www.techradar.com/tech/icymi-the-weeks-7-biggest-tech-stories-from-ikeas-21-new-smart-home-gadgets-to-our-samsung-galaxy-xr-review</link>
      <pubDate>Sat, 08 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">7x7Q7b9n7RnDTzXakzKyXT</guid>
      <description>The week's top stories from GTA 6, IKEA, Samsung, Google and more for November 8, 2026.</description>
    </item>
    <item>
      <title>Voici les prix incroyablement bas de la Leapmotor B05, une rivale de la M&#233;gane &#233;lectrique qui arrive bient&#244;t en Europe</title>
      <link>https://www.frandroid.com/marques/leapmotor/2860963_voici-les-prix-incroyablement-bas-de-la-leapmotor-b05-une-rivale-de-la-megane-electrique-qui-arrive-bientot-en-europe</link>
      <pubDate>Sat, 08 Nov 2025 07:58:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/leapmotor/2860963_voici-les-prix-incroyablement-bas-de-la-leapmotor-b05-une-rivale-de-la-megane-electrique-qui-arrive-bientot-en-europe</guid>
      <description>
Apr&#232;s une pr&#233;sentation au Salon de Munich, Leapmotor lance sa B05 en Chine. Cette voiture &#233;lectrique rivale des Renault M&#233;gane E-Tech et Volkswagen ID.3 y propose un tarif particuli&#232;rement agressif, et pourrait faire mal une fois en Europe.
</description>
    </item>
    <item>
      <title>I tested the KTC H27P3 and this 27in 5K monitor is exceptional value and offers a dual-mode display to optimise the screen for work or games.</title>
      <link>https://www.techradar.com/computing/ktc-h27p3-27-monitor-review</link>
      <pubDate>Sat, 08 Nov 2025 07:47:00 +0000</pubDate>
      <guid isPermaLink="false">xkFwyZ8m4SR8bUhytzkW4F</guid>
      <description>The headline feature here is the price: a 5K monitor for less than $600/&#163;600, and while there are a few other models matching this specification, and at this price point, few equal the elegance of design or a dual mode that enables you to switch from high resolution to high refresh rate, making this suitable for both intensive colour-accurate work and games....</description>
    </item>
    <item>
      <title>Fuite de donn&#233;es&#160;: la France devient la victime num&#233;ro un des pirates, une nouvelle menace &#233;merge</title>
      <link>https://www.01net.com/actualites/fuite-donnees-france-devient-victime-numero-un-pirates.html</link>
      <pubDate>Sat, 08 Nov 2025 07:34:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305762</guid>
      <description>Les fuites de donn&#233;es atteignent des sommets en France. Plus de 15,5 millions de comptes ont &#233;t&#233; pirat&#233;s au troisi&#232;me trimestre 2025, propulsant l&#8217;Hexagone au rang de pays le plus touch&#233; au monde. En parall&#232;le, une nouvelle menace se dessine et plane sur les Fran&#231;ais.</description>
    </item>
  </channel>
</rss>
