<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 11 Dec 2025 08:35:30 GMT</lastBuildDate>
    <item>
      <title>Google Maps : fini la gal&#232;re pour retrouver votre voiture, mais pas pour tout le monde</title>
      <link>https://www.frandroid.com/marques/google/2905991_google-maps-fini-la-galere-pour-retrouver-votre-voiture-mais-pas-pour-tout-le-monde</link>
      <pubDate>Thu, 11 Dec 2025 08:30:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2905991_google-maps-fini-la-galere-pour-retrouver-votre-voiture-mais-pas-pour-tout-le-monde</guid>
      <description>
Google d&#233;ploie une fonctionnalit&#233; permettant d'enregistrer automatiquement votre place de stationnement. Tr&#232;s attendue, cette option n'est cependant pas disponible pour tous. 
</description>
    </item>
    <item>
      <title>B&#234;ta One UI 8.5 : voici la liste officielle des smartphones Samsung compatibles</title>
      <link>https://www.frandroid.com/marques/2905943_beta-one-ui-8-5-voici-la-liste-officielle-des-smartphones-samsung-compatibles</link>
      <pubDate>Thu, 11 Dec 2025 08:25:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2905943_beta-one-ui-8-5-voici-la-liste-officielle-des-smartphones-samsung-compatibles</guid>
      <description>
Vous attendiez impatiemment de tester les nouveaut&#233;s de One UI 8.5 ? Calmez vos ardeurs. Samsung vient de d&#233;voiler la liste des appareils &#233;ligibles &#224; la b&#234;ta, et c'est une douche froide. Trois mod&#232;les, pas un de plus. 
</description>
    </item>
    <item>
      <title>Gemini arrive dans Chrome sur l&#8217;iPhone, mais pas pour tout le monde</title>
      <link>https://www.01net.com/actualites/gemini-arrive-dans-chrome-sur-liphone-mais-pas-pour-tout-le-monde.html</link>
      <pubDate>Thu, 11 Dec 2025 08:23:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314964</guid>
      <description>L&#8217;assistant vocal de Google commence &#224; faire son arriv&#233;e dans Chrome sur iOS, mais tout le monde ne pourra pas y acc&#233;der dans l&#8217;imm&#233;diat.</description>
    </item>
    <item>
      <title>iPhone&#160;: voici les apps les plus t&#233;l&#233;charg&#233;es en 2025 par les Fran&#231;ais</title>
      <link>https://www.01net.com/actualites/iphone-apps-plus-telechargees-2025-par-francais.html</link>
      <pubDate>Thu, 11 Dec 2025 08:13:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314965</guid>
      <description>Comme chaque ann&#233;e, Apple publie son classement des applications les plus t&#233;l&#233;charg&#233;es en France. Voici le top des apps iPhone les plus populaires en 2025.</description>
    </item>
    <item>
      <title>Fin du thermique en 2035&#160;: pourquoi l&#8217;Europe panique et reporte ses annonces</title>
      <link>https://www.01net.com/actualites/fin-du-thermique-en-2035-pourquoi-leurope-panique-et-reporte-ses-annonces.html</link>
      <pubDate>Thu, 11 Dec 2025 08:02:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314876</guid>
      <description>Bruxelles reporte au 16 d&#233;cembre ses arbitrages sur la fin du thermique. Entre l'Allemagne qui freine et la perc&#233;e chinoise, l'UE est au bord de la crise de nerfs.</description>
    </item>
    <item>
      <title>The best streaming deals: Save on MasterClass, Audible, Philo and others</title>
      <link>https://www.engadget.com/deals/best-streaming-service-deals-133028980.html?src=rss</link>
      <pubDate>Thu, 11 Dec 2025 08:01:27 +0000</pubDate>
      <guid isPermaLink="false">026fe1b5-ea22-49f6-8016-fd8686928f5c</guid>
      <description>Streaming services keep raising prices. At this point, if you subscribe to all the major services out there, you're basically paying the same price as cable &#8212; those antiquated local monopolies that streaming was supposed to save us from. But streaming still has one big advantage over the old ways: no contracts. That means you can grab a good streaming deal and then cancel without penalty.
Our advice is to sign up for a service when you see a good streaming deal (or the latest season of, say, Doctor Who, Severance, Andor and/or The Last of Us). Then, when the deal ends or you've binged whatever...</description>
    </item>
    <item>
      <title>Fuite chez Xiaomi : voici les 3 prochaines voitures &#233;lectrique (dont celle qui arrive en Europe)</title>
      <link>https://www.frandroid.com/marques/xiaomi/2905589_fuite-chez-xiaomi-voici-les-3-prochaines-voitures-electrique-dont-celle-qui-arrive-en-europe</link>
      <pubDate>Thu, 11 Dec 2025 08:00:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2905589_fuite-chez-xiaomi-voici-les-3-prochaines-voitures-electrique-dont-celle-qui-arrive-en-europe</guid>
      <description>
Un m&#233;dia chinois annonce conna&#238;tre les plans de Xiaomi pour ses futures voitures &#233;lectriques, et notamment le mod&#232;le qui arrivera en Europe en 2027.
</description>
    </item>
    <item>
      <title>What not to say to someone who just got laid off</title>
      <link>https://www.fastcompany.com/91455765/what-not-to-say-to-someone-who-just-got-laid-off</link>
      <pubDate>2025-12-11T08:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91455765/what-not-to-say-to-someone-who-just-got-laid-off</guid>
      <description>Advice from experts&#8212;and from workers who&#8217;ve been there.
In today&#8217;s workplace, layoffs are no longer rare&#8212;they&#8217;re a reality many employees have seen up close or have experienced themselves.&#160;</description>
    </item>
    <item>
      <title>L&#8217;interdiction des r&#233;seaux sociaux aux moins de 15&#160;ans sera d&#233;battue le mois prochain en France</title>
      <link>https://www.frandroid.com/culture-tech/politique/2906039_linterdiction-des-reseaux-sociaux-aux-moins-de-15-ans-sera-debattue-le-mois-prochain-en-france</link>
      <pubDate>Thu, 11 Dec 2025 07:51:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/politique/2906039_linterdiction-des-reseaux-sociaux-aux-moins-de-15-ans-sera-debattue-le-mois-prochain-en-france</guid>
      <description>
Martel&#233;e par Emmanuel Macron depuis quelques longs mois maintenant, l&#8217;id&#233;e d&#8217;interdire les r&#233;seaux sociaux aux moins de 15&#160;ans en France va &#234;tre d&#233;battue en janvier prochain &#224; l&#8217;Assembl&#233;e nationale.
</description>
    </item>
    <item>
      <title>Volkswagen brise ses propres r&#232;gles gr&#226;ce &#224; la Chine : voici la voiture &#233;lectrique con&#231;ue en un temps record</title>
      <link>https://www.frandroid.com/marques/volkswagen/2905673_volkswagen-brise-ses-propres-regles-grace-a-la-chine-voici-la-voiture-electrique-concue-en-un-temps-record</link>
      <pubDate>Thu, 11 Dec 2025 07:33:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2905673_volkswagen-brise-ses-propres-regles-grace-a-la-chine-voici-la-voiture-electrique-concue-en-un-temps-record</guid>
      <description>
Volkswagen, qui est associ&#233; au constructeur XPeng en Chine, s'appr&#234;tent &#224; lancer sa nouvelle voiture &#233;lectrique, l'ID.Unyx 07, qui remet en question les m&#233;thodes traditionnelles de l'industrie automobile europ&#233;enne.
</description>
    </item>
    <item>
      <title>Google court le risque d&#8217;une grosse amende, le Play Store ne respecterait toujours pas les r&#232;gles europ&#233;ennes</title>
      <link>https://www.01net.com/actualites/google-court-le-risque-dune-grosse-amende-le-play-store-ne-respecterait-toujours-pas-les-regles-europeennes.html</link>
      <pubDate>Thu, 11 Dec 2025 07:30:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314949</guid>
      <description>Google court le risque d&#8217;une grosse amende si le g&#233;ant du web ne se conforme pas davantage &#224; la loi d&#8217;airain du DMA europ&#233;en. Bruxelles estimerait en effet que l&#8217;entreprise n&#8217;en fait pas suffisamment pour garantir une concurrence &#233;quitable dans le Play Store.</description>
    </item>
    <item>
      <title>Ce grand TV 4K Mini LED 65 pouces 165 Hz perd 40% de son prix chez Boulanger, l&#8217;affaire &#224; ne pas louper</title>
      <link>https://www.frandroid.com/bons-plans/2904349_ce-grand-tv-4k-mini-led-65-pouces-165-hz-perd-40-de-son-prix-chez-boulanger-laffaire-a-ne-pas-louper</link>
      <pubDate>Thu, 11 Dec 2025 07:18:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2904349_ce-grand-tv-4k-mini-led-65-pouces-165-hz-perd-40-de-son-prix-chez-boulanger-laffaire-a-ne-pas-louper</guid>
      <description>
Pour les amateurs de cin&#233;ma, de sport ou encore de jeux vid&#233;o, le t&#233;l&#233;viseur Hisense&#160;65U7Q Pro qui propose une dalle Mini LED de 65 pouces &#224; 165 Hz, devrait vous plaire. Mieux encore, son prix passe de 1 499 euros &#224; 879 euros. 
</description>
    </item>
    <item>
      <title>Free Mobile : c&#8217;est quoi cette option VoNR activ&#233;e sur votre forfait 5G ?</title>
      <link>https://www.frandroid.com/telecom/forfait-mobile/2906011_free-mobile-cest-quoi-cette-option-vonr-activee-sur-votre-forfait-5g</link>
      <pubDate>Thu, 11 Dec 2025 07:14:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/forfait-mobile/2906011_free-mobile-cest-quoi-cette-option-vonr-activee-sur-votre-forfait-5g</guid>
      <description>
Vous avez peut-&#234;tre remarqu&#233; un truc &#233;trange r&#233;cemment. Vos appels se lancent instantan&#233;ment. La qualit&#233; audio est bluffante. Non, vous n'avez pas r&#234;v&#233; : Free Mobile a activ&#233; la VoNR pour une partie de ses abonn&#233;s. C'est la suite logique de la 5G SA, et on vous explique pourquoi c'est important.
</description>
    </item>
    <item>
      <title>Google lance Emergency Live Video : les appels d&#8217;urgence vid&#233;o arrivent sur Android</title>
      <link>https://www.frandroid.com/android/2905989_google-lance-emergency-live-video-les-appels-durgence-video-arrivent-sur-android</link>
      <pubDate>Thu, 11 Dec 2025 07:04:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/2905989_google-lance-emergency-live-video-les-appels-durgence-video-arrivent-sur-android</guid>
      <description>
Apple a ouvert la voie en 2024, Google riposte aujourd'hui. La firme de Mountain View lance officiellement le streaming vid&#233;o pour les appels d'urgence sur Android. Compatible avec Android 8 et plus, cette fonction transforme votre t&#233;l&#233;phone en outil de diagnostic &#224; distance pour les pompiers ou la police. Voici comment &#231;a marche.
</description>
    </item>
    <item>
      <title>Plus stables et confortables : comment les v&#233;los et trottinettes &#233;lectriques partag&#233;s ont r&#233;ussi &#224; s&#233;duire les plus de 45 ans</title>
      <link>https://www.frandroid.com/survoltes/trottinette-electrique/2904383_plus-stables-et-confortables-comment-les-velos-et-trottinettes-electriques-partages-ont-reussi-a-seduire-les-plus-de-45-ans</link>
      <pubDate>Thu, 11 Dec 2025 07:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/trottinette-electrique/2904383_plus-stables-et-confortables-comment-les-velos-et-trottinettes-electriques-partages-ont-reussi-a-seduire-les-plus-de-45-ans</guid>
      <description>
Si l&#8217;on en croit le dernier rapport de l&#8217;op&#233;rateur Voi, les utilisateurs de trottinettes et v&#233;los &#233;lectriques en libre-service roulent en priorit&#233; pour les trajets du quotidien et non plus ponctuellement, comme ce fut le cas &#224; une &#233;poque. La tranche des plus de 45 ans conna&#238;t quant &#224; elle une franche augmentation.
</description>
    </item>
    <item>
      <title>Les bots IA mettent la vie en danger&#160;: quarante &#201;tats am&#233;ricains exigent des mesures imm&#233;diates</title>
      <link>https://www.01net.com/actualites/les-bots-ia-mettent-la-vie-en-danger-quarante-etats-americains-exigent-des-mesures-immediates.html</link>
      <pubDate>Thu, 11 Dec 2025 07:01:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314947</guid>
      <description>Les grands acteurs de l&#8217;IA vont vite, tr&#232;s vite&#8230; trop vite, aux yeux d&#8217;une quarantaine d&#8217;&#201;tats am&#233;ricains qui exigent des mesures immdiates contre les risques les plus s&#233;rieux que font peser leurs services IA aupr&#232;s des utilisateurs, en particulier les plus jeunes. OpenAI, Apple, Meta, Microsoft et bien d&#8217;autres sont vis&#233;s.</description>
    </item>
    <item>
      <title>How the Next Big Thing in Carbon Removal Sunk Without a Trace</title>
      <link>https://www.wired.com/story/how-the-next-big-thing-in-carbon-removal-sunk-without-a-trace/</link>
      <pubDate>Thu, 11 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">68da532da40b2a40971ba736</guid>
      <description>With support from Microsoft, Stripe, and Shopify, Running Tide billed itself as on the cutting edge of carbon removal. In the end, it resorted to dumping thousands of tons of wood chips in the sea.</description>
    </item>
    <item>
      <title>How to deal with an annoying direct report</title>
      <link>https://www.fastcompany.com/91454992/how-to-deal-with-an-annoying-direct-report</link>
      <pubDate>2025-12-11T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91454992/how-to-deal-with-an-annoying-direct-report</guid>
      <description>Strategies for identifying with and dealing with four different types of difficult direct reports.
There are three kinds of annoying colleagues. I have already written about dealing with annoying bosses and colleagues. What happens if the source of your annoyance is one of your direct reports?</description>
    </item>
    <item>
      <title>The new AI paradox: smarter models, worse data</title>
      <link>https://www.fastcompany.com/91457268/the-new-ai-paradox-smarter-models-worse-data</link>
      <pubDate>2025-12-11T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91457268/the-new-ai-paradox-smarter-models-worse-data</guid>
      <description>AI models are only as reliable as the data beneath them.
AI promises a smarter, faster, more efficient future, but beneath that optimism lies a quiet problem that&#8217;s getting worse: the data itself. We talk a lot about algorithms, but not enough about the infrastructure that feeds them. The truth is, innovation can&#8217;t outpace the quality of its inputs, and right now those inputs are showing signs of strain. When the foundation starts to crack, even the most advanced systems will falter....</description>
    </item>
    <item>
      <title>Comment emp&#234;cher n&#8217;importe qui de lire vos conversations WhatsApp en 2 minutes</title>
      <link>https://www.frandroid.com/android/applications/2905963_comment-empecher-nimporte-qui-de-lire-vos-conversations-whatsapp-en-2-minutes</link>
      <pubDate>Thu, 11 Dec 2025 06:50:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/applications/2905963_comment-empecher-nimporte-qui-de-lire-vos-conversations-whatsapp-en-2-minutes</guid>
      <description>
Vous pensez &#234;tre prot&#233;g&#233; parce que WhatsApp utilise le chiffrement de bout en bout ? C'est une erreur classique. La faille, c'est souvent l'acc&#232;s physique &#224; votre smartphone ou un mauvais r&#233;glage de confidentialit&#233;. On a list&#233; les quelques manipulations pour &#233;viter les regards indiscrets.
</description>
    </item>
    <item>
      <title>Et les applications les plus t&#233;l&#233;charg&#233;es en 2025 sur iPhone sont&#8230;</title>
      <link>https://www.frandroid.com/os/ios/2905933_et-les-applications-les-plus-telechargees-en-2025-sur-iphone-sont</link>
      <pubDate>Thu, 11 Dec 2025 06:44:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/ios/2905933_et-les-applications-les-plus-telechargees-en-2025-sur-iphone-sont</guid>
      <description>
La fin de l&#8217;ann&#233;e rime in&#233;vitablement avec les classements des logiciels pr&#233;f&#233;r&#233;s des Fran&#231;aises et Fran&#231;ais. Cette ann&#233;e, c&#8217;est ChatGPT qui s&#8217;est hiss&#233; tout en haut du classement des apps les plus t&#233;l&#233;charg&#233;es sur iPhone.
</description>
    </item>
  </channel>
</rss>
