<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 12 Dec 2025 11:24:10 GMT</lastBuildDate>
    <item>
      <title>ChatGPT 5.2 branded a &#8216;step backwards&#8217; by disappointed early users &#8211; here&#8217;s why</title>
      <link>https://www.techradar.com/ai-platforms-assistants/openai/chatgpt-5-2-branded-a-step-backwards-by-disappointed-early-users-heres-why</link>
      <pubDate>Fri, 12 Dec 2025 11:22:08 +0000</pubDate>
      <guid isPermaLink="false">ygVQ6qApmk9CgmSsFNVAeJ</guid>
      <description>ChatGPT 5.2 is now available, but Reddit users claim it's 'boring' and 'worse than 5.1.'</description>
    </item>
    <item>
      <title>The Game Awards 2025 winners list &#8211; Clair Obscur: Expedition 33 makes history as it takes home 9 awards, including Game of the Year</title>
      <link>https://www.techradar.com/gaming/gaming-industry/the-game-awards-2025-winners-list-clair-obscur-expedition-33-makes-history-as-it-takes-home-9-awards-including-game-of-the-year</link>
      <pubDate>Fri, 12 Dec 2025 11:14:12 +0000</pubDate>
      <guid isPermaLink="false">VzFxHxZcZnTUTiTw6fY8KJ</guid>
      <description>In case you missed it, here's the complete list of winners from The Game Awards 2025.</description>
    </item>
    <item>
      <title>New Windows 10 update is reportedly causing havoc for some, including breaking a popular customization tool</title>
      <link>https://www.techradar.com/computing/windows/new-windows-10-update-is-reportedly-causing-havoc-for-some-including-breaking-a-popular-customization-tool</link>
      <pubDate>Fri, 12 Dec 2025 11:12:11 +0000</pubDate>
      <guid isPermaLink="false">P6BjPtoxDb4bMdAYou45uG</guid>
      <description>Microsoft's latest patch breaks stuff &#8211; but the surprise is this is Windows 10, not Windows 11.</description>
    </item>
    <item>
      <title>Voici comment fonctionne Google Disco : le futur de Chrome est fascinant, mais dangereux pour les &#233;diteurs</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2907987_voici-comment-fonctionne-google-disco-le-futur-de-chrome-est-fascinant-mais-dangereux-pour-les-editeurs</link>
      <pubDate>Fri, 12 Dec 2025 11:09:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2907987_voici-comment-fonctionne-google-disco-le-futur-de-chrome-est-fascinant-mais-dangereux-pour-les-editeurs</guid>
      <description>
La barre d'adresse, c'est fini. Les 50 onglets ouverts qui consomment toute votre RAM aussi. Google vient de l&#226;cher une petite bombe via sa division Labs : Disco. Ce n'est pas juste un nouveau Chrome, c'est une tentative radicale de transformer le web en applications g&#233;n&#233;r&#233;es &#224; la vol&#233;e par Gemini 3.
</description>
    </item>
    <item>
      <title>Nothing OS 4.0 bloqu&#233; &#224; cause de bugs ? La marque r&#233;pond enfin aux rumeurs</title>
      <link>https://www.frandroid.com/marques/nothing/2907829_nothing-os-4-0-bloque-a-cause-de-bugs-la-marque-repond-enfin-aux-rumeurs</link>
      <pubDate>Fri, 12 Dec 2025 11:04:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nothing/2907829_nothing-os-4-0-bloque-a-cause-de-bugs-la-marque-repond-enfin-aux-rumeurs</guid>
      <description>
Des rumeurs laissaient craindre un arr&#234;t brutal du d&#233;ploiement de Nothing OS 4.0 pour cause de bugs critiques. Aujourd'hui, le constructeur sort du silence. 
</description>
    </item>
    <item>
      <title>Souverainet&#233; europ&#233;enne&#160;: les entreprises pourront bient&#244;t utiliser ce nouvel indice de d&#233;pendance aux outils US</title>
      <link>https://www.01net.com/actualites/souverainete-europeenne-les-entreprises-pourront-bientot-utiliser-ce-nouvel-indice-de-dependance-aux-outils-us.html</link>
      <pubDate>Fri, 12 Dec 2025 11:03:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315120</guid>
      <description>&#192; compter de 2026, les entreprises pourront utiliser un nouvel instrument pour mesurer leur d&#233;pendance aux outils num&#233;riques non europ&#233;ens (am&#233;ricains) : l'&#171;&#8201;indice de r&#233;silience num&#233;rique&#8201;&#187; (IRN).</description>
    </item>
    <item>
      <title>Hollywood&#8217;s Labor Unions Respond to Disney&#8217;s Dystopian New AI Deal</title>
      <link>https://gizmodo.com/hollywoods-labor-unions-respond-to-disneys-dystopian-new-ai-deal-2000698767</link>
      <pubDate>Fri, 12 Dec 2025 11:00:49 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000698767</guid>
      <description>The WGA and SAG-AFTRA have released statements following Disney's alliance with OpenAI.</description>
    </item>
    <item>
      <title>Ne laissez pas passer les ventes flash de Bouygues Telecom avec l&#8217;iPhone 17 Pro &#224; petit prix [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2904837_ne-laissez-pas-passer-les-ventes-flash-de-bouygues-telecom-avec-liphone-17-pro-a-petit-prix</link>
      <pubDate>Fri, 12 Dec 2025 10:52:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2904837_ne-laissez-pas-passer-les-ventes-flash-de-bouygues-telecom-avec-liphone-17-pro-a-petit-prix</guid>
      <description>
Vous cherchez d&#233;sesp&#233;r&#233;ment une offre sur l&#8217;iPhone 17 Pro mais peinez &#224; le trouver &#224; bon prix ? Bouygues Telecom a quelque chose pour vous avec ses ventes flash de No&#235;l.
</description>
    </item>
    <item>
      <title>L&#8217;Oppo Reno 14 F, un smartphone ultra-r&#233;sistant (IP69) et in&#233;puisable (6 000 mAh), est dans un pack &#224; prix cass&#233;</title>
      <link>https://www.frandroid.com/bons-plans/2787591_loppo-reno-14-f-un-smartphone-ultra-resistant-ip69-et-inepuisable-6-000-mah-est-dans-un-pack-a-prix-casse</link>
      <pubDate>Fri, 12 Dec 2025 10:42:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2787591_loppo-reno-14-f-un-smartphone-ultra-resistant-ip69-et-inepuisable-6-000-mah-est-dans-un-pack-a-prix-casse</guid>
      <description>
Le Reno 14 F est l&#8217;un des r&#233;cents smartphones milieu de gamme d&#8217;Oppo. Une r&#233;f&#233;rence qui poss&#232;de une fiche technique solide tout en conservant un prix bas : aujourd&#8217;hui, il est dans un pack &#224; 299 euros contre 349 euros de base. 
</description>
    </item>
    <item>
      <title>Sa carri&#232;re aura &#233;t&#233; de quelques mois : fin de parcours abrupt pour la rivale de la Citro&#235;n Ami sign&#233;e Renault, la Mobilize Duo</title>
      <link>https://www.frandroid.com/marques/renault/2907835_sa-carriere-aura-ete-de-quelques-mois-fin-de-parcours-abrupt-pour-la-rivale-de-la-citroen-ami-signee-renault-la-mobilize-duo</link>
      <pubDate>Fri, 12 Dec 2025 10:41:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2907835_sa-carriere-aura-ete-de-quelques-mois-fin-de-parcours-abrupt-pour-la-rivale-de-la-citroen-ami-signee-renault-la-mobilize-duo</guid>
      <description>
Lanc&#233; il y a &#224; peine quelques mois, Renault arr&#234;te la commercialisation du Mobilize Duo. H&#233;riti&#232;re du Twizy, cette voiture &#233;lectrique sans permis r&#234;vait de voler la vedette &#224; la Citro&#235;n Ami.
</description>
    </item>
    <item>
      <title>Cette GeForce RTX 5060 Ti propose une fonctionnalit&#233; jamais vue auparavant</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-fixes/mini-pc/2907753_cette-geforce-rtx-5060-ti-propose-une-fonctionnalite-jamais-vue-auparavant</link>
      <pubDate>Fri, 12 Dec 2025 10:40:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-fixes/mini-pc/2907753_cette-geforce-rtx-5060-ti-propose-une-fonctionnalite-jamais-vue-auparavant</guid>
      <description>
Le Zotac Magnus est un mini-PC &#233;quip&#233; d'une GeForce RTX 5060 Ti en version desktop. Mais celle-ci n'a pas besoin de c&#226;ble d'alimentation pour fonctionner &#224; plein r&#233;gime.
</description>
    </item>
    <item>
      <title>Le plan de l&#8217;UE pour tuer les SUV &#233;lectriques : ils vont favoriser les petites voitures &#233;lectriques europ&#233;ennes</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2907901_le-plan-de-lue-pour-tuer-les-suv-electriques-ils-vont-subventionner-les-petites-voitures-electriques-europeennes</link>
      <pubDate>Fri, 12 Dec 2025 10:39:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2907901_le-plan-de-lue-pour-tuer-les-suv-electriques-ils-vont-subventionner-les-petites-voitures-electriques-europeennes</guid>
      <description>
C'est peut-&#234;tre le tournant qu'attendaient Renault et Stellantis. Pour contrer l'offensive chinoise, l'UE, sous l'impulsion de St&#233;phane S&#233;journ&#233;, envisage de cr&#233;er une cat&#233;gorie de voitures &#171; privil&#233;gi&#233;es &#187;. L'objectif est clair : couper l'herbe sous le pied des constructeurs chinois.
</description>
    </item>
    <item>
      <title>Le jeu fran&#231;ais Clair Obscur: Expedition 33 rafle tout aux Oscars du jeu vid&#233;o</title>
      <link>https://www.01net.com/actualites/le-jeu-francais-clair-obscur-expedition-33-rafle-tout-aux-oscars-du-jeu-video.html</link>
      <pubDate>Fri, 12 Dec 2025 10:36:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315150</guid>
      <description>Jeu de l&#8217;ann&#233;e, meilleure direction artistique, meilleure musique, meilleur jeu de r&#244;le, meilleur jeu ind&#233;pendant&#8230; N&#8217;en jetez plus, Clair Obscur: Expedition 33 a absolument tout rafl&#233; durant les Game Awards, les Oscars du jeu vid&#233;o qui pour l&#8217;occasion ont rev&#234;tu leurs plus belles couleurs bleu, blanc, rouge.</description>
    </item>
    <item>
      <title>Une cyberattaque frappe le minist&#232;re de l&#8217;Int&#233;rieur&#160;: les &#171;&#160;serveurs de messagerie&#160;&#187; dans le viseur</title>
      <link>https://www.01net.com/actualites/cyberattaque-frappe-ministere-interieur-serveurs-messagerie-viseur.html</link>
      <pubDate>Fri, 12 Dec 2025 10:33:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315124</guid>
      <description>Le minist&#232;re de l&#8217;Int&#233;rieur a &#233;t&#233; la cible d'une cyberattaque. Les serveurs de messagerie &#233;taient dans le viseur des attaquants. Le ministre &#233;voque de possibles ing&#233;rences &#233;trang&#232;res.</description>
    </item>
    <item>
      <title>Huawei FreeClip 2, la prochaine r&#233;f&#233;rence des &#233;couteurs ouverts&#160;?</title>
      <link>https://www.frandroid.com/marques/huawei/2907857_huawei-freeclip-2-la-prochaine-reference-des-ecouteurs-ouverts</link>
      <pubDate>Fri, 12 Dec 2025 10:30:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/huawei/2907857_huawei-freeclip-2-la-prochaine-reference-des-ecouteurs-ouverts</guid>
      <description>
Nouvelle g&#233;n&#233;ration d&#8217;&#233;couteurs ouverts &#224; clip d&#8217;oreille, les nouveaux Huawei FreeClip 2 d&#233;barquent avec un bo&#238;tier compact et une autonomie renforc&#233;e. Pour l&#8217;instant, le constructeur a d&#233;taill&#233; les caract&#233;ristiques techniques et les fonctions logicielles, mais le prix et la date de disponibilit&#233; en France restent &#224; confirmer.
</description>
    </item>
    <item>
      <title>This incredible map shows the world&#8217;s 2.75 billion buildings</title>
      <link>https://www.fastcompany.com/91457295/this-incredible-map-shows-the-worlds-2-75-billion-buildings</link>
      <pubDate>2025-12-12T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91457295/this-incredible-map-shows-the-worlds-2-75-billion-buildings</guid>
      <description>Researchers mapped exactly where buildings are in the world and how much space they take up. The result is a mind boggling look at how the world develops.
From the latest skyscraper in a Chinese megalopolis to a six&#8209;foot&#8209;tall yurt in Inner Mongolia, researchers at the Technical University of Munich claim they have created a map of all buildings worldwide: 2.75 billion building models set in high&#8209;resolution 3D with a level of precision never before recorded....</description>
    </item>
    <item>
      <title>You can use Instacart on ChatGPT to make a viral TikTok recipe, but I wouldn&#8217;t recommend it</title>
      <link>https://www.fastcompany.com/91457334/instacart-chatgpt-make-ina-garten-viral-tiktok-recipe</link>
      <pubDate>2025-12-12T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91457334/instacart-chatgpt-make-ina-garten-viral-tiktok-recipe</guid>
      <description>Instacart&#8217;s new ChatGPT integration wants to make it easier for people to find recipes and order groceries. I put it to the test by making Ina Garten&#8217;s viral brownie pudding.
Instacart just became the first company to offer an end-to-end integrated shopping experience with OpenAI&#8217;s ChatGPT. It&#8217;s yet another signal that AI is about to upend the way we shop&#8212;and, maybe, the way we cook....</description>
    </item>
    <item>
      <title>How to be an ally at work without feeling like an imposter</title>
      <link>https://www.fastcompany.com/91457653/ally-work-imposter-syndrome-phenomenon</link>
      <pubDate>2025-12-12T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91457653/ally-work-imposter-syndrome-phenomenon</guid>
      <description>Allies who are men, leaders, younger employees, and people of color were found to more likely to experience the impostor phenomenon.
Most people care about fairness at work and want to support colleagues who face marginalization&#8212;for example, people of color, women, and people with disabilities. Our research has found that 76% of employees want to be allies to co-workers who face additional challenges, and 84% value equity. That&#8217;s in line with a 2025 national survey that found 88% of employees supported employers offering training on how to be more inclusive....</description>
    </item>
    <item>
      <title>&#8216;Eat the frog&#8217;: How getting unpleasant things out of the way makes for a fulfilling day</title>
      <link>https://www.fastcompany.com/91458944/eat-the-frog-how-getting-unpleasant-things-out-of-the-way-makes-for-a-fulfilling-day</link>
      <pubDate>2025-12-12T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91458944/eat-the-frog-how-getting-unpleasant-things-out-of-the-way-makes-for-a-fulfilling-day</guid>
      <description>Recent research takes on a centuries-old productivity hack.
Revolutionary France may seem like a strange place to find a life hack, but in the 1790s, the French satirist&#160;Nicolas Chamfort offered some&#160;stark advice&#160;to cope with our daily travails.&#160;</description>
    </item>
    <item>
      <title>C&#8217;est confirm&#233;, la montre de Huawei en or 18 carats arrive en France &#224; un prix vertigineux</title>
      <link>https://www.frandroid.com/marques/huawei/2891801_huawei-lance-une-montre-connectee-luxueuse-en-or-18-carats-pour-plusieurs-milliers-deuros</link>
      <pubDate>Fri, 12 Dec 2025 10:29:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/huawei/2891801_huawei-lance-une-montre-connectee-luxueuse-en-or-18-carats-pour-plusieurs-milliers-deuros</guid>
      <description>
Huawei a d&#233;voil&#233; une nouvelle &#233;dition de sa r&#233;cente Watch Ultimate 2. Propos&#233;e &#224; plus de 3000 euros, elle est con&#231;ue avec un bo&#238;tier en or 18 carats. 
</description>
    </item>
    <item>
      <title>60+ Christmas gifts for Dad he wont have to pretend to like</title>
      <link>https://mashable.com/gifts/best-gifts-for-dad</link>
      <pubDate>Fri, 12 Dec 2025 10:23:55 +0000</pubDate>
      <guid isPermaLink="false">07Mzb9wwIHkQ2QBSpLJ01yu</guid>
      <description>Find the best Christmas gifts for dads, from classic gifts he'll actually use to unique gift ideas you won't think of on your own.</description>
    </item>
    <item>
      <title>The Roku Streaming Stick Plus is back on sale at Amazon &#8212; save over $10 right now</title>
      <link>https://mashable.com/article/dec-12-roku-streaming-stick-deal</link>
      <pubDate>Fri, 12 Dec 2025 10:22:49 +0000</pubDate>
      <guid isPermaLink="false">04mtqSdOsNOetknbLz9YLmn</guid>
      <description>Find the best streaming deal at Amazon. Save 27% on the Roku Streaming Stick Plus at Amazon.</description>
    </item>
    <item>
      <title>The AirTag 4-pack is over $20 off at Amazon &#8212; save on this functional stocking filler</title>
      <link>https://mashable.com/article/dec-12-apple-airtags-deal</link>
      <pubDate>Fri, 12 Dec 2025 10:20:58 +0000</pubDate>
      <guid isPermaLink="false">05rDRgCNT8GTp2LFIMXgPLf</guid>
      <description>Find the best Apple AirTag deal at Amazon. Save 24% on the Apple AirTag four-pack at Amazon.</description>
    </item>
    <item>
      <title>Clair Obscur : Exp&#233;dition 33, quelles sont les configurations requises sur PC pour jouer au GOTY 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/2591443_clair-obscur-expedition-33-quelles-sont-les-configurations-requises-sur-pc-pour-jouer-au-goty-2025</link>
      <pubDate>Fri, 12 Dec 2025 10:20:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2591443_clair-obscur-expedition-33-quelles-sont-les-configurations-requises-sur-pc-pour-jouer-au-goty-2025</guid>
      <description>
Nouveau RPG fran&#231;ais qui cr&#233;&#233; l'&#233;v&#233;nement, Clair Obscur : Exp&#233;dition 33 a obtenu le GOTY 2025. &#202;tes-vous pr&#234;t &#224; en d&#233;coudre avec ce jeu au gameplay tr&#232;s exigeant ?
</description>
    </item>
    <item>
      <title>AI chatbots are now integrated 'into the full texture of human life,' Microsoft study claims</title>
      <link>https://www.techradar.com/pro/ai-chatbots-are-now-integrated-into-the-full-texture-of-human-life-microsoft-study-claims</link>
      <pubDate>Fri, 12 Dec 2025 10:20:54 +0000</pubDate>
      <guid isPermaLink="false">ohtaHHkCNrpMXrr9cm2TJ7</guid>
      <description>Work questions in the day, personal questions at night, desktop for productivity, mobile for personal: Copilot reveals all.</description>
    </item>
    <item>
      <title>60+ of the best Harvard University courses you can take online for free</title>
      <link>https://mashable.com/article/free-harvard-courses-december-2025</link>
      <pubDate>Fri, 12 Dec 2025 10:18:40 +0000</pubDate>
      <guid isPermaLink="false">06xdXsqWUocAGdUEFGKYoHu</guid>
      <description>Find the best free online courses at edX. The best free online courses from Harvard University.</description>
    </item>
    <item>
      <title>This unique case will put a screen on the back of your iPhone 17 Pro or Pro Max</title>
      <link>https://www.techradar.com/phones/iphone/this-unique-case-will-put-a-screen-on-the-back-of-your-iphone-17-pro-or-pro-max</link>
      <pubDate>Fri, 12 Dec 2025 10:16:49 +0000</pubDate>
      <guid isPermaLink="false">oWpmQ2NCEJaMJ3npKKUrv9</guid>
      <description>The Selfix Case adds a second screen to your iPhone, so you can use the main cameras to take selfies.</description>
    </item>
    <item>
      <title>Windows 11 : Microsoft d&#233;ploie une nouveaut&#233; bien pratique pour m&#233;tamorphoser votre PC</title>
      <link>https://www.frandroid.com/marques/microsoft/2907587_le-microsoft-store-ajoute-les-themes-pour-personnaliser-son-pc</link>
      <pubDate>Fri, 12 Dec 2025 10:15:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2907587_le-microsoft-store-ajoute-les-themes-pour-personnaliser-son-pc</guid>
      <description>
Microsoft d&#233;voile une nouvelle section de personnalisation sur le Store. Intitul&#233;e &#171; Th&#232;mes &#187;, elle comporte 400 mod&#232;les pr&#234;ts &#224; l'emploi. 
</description>
    </item>
    <item>
      <title>Apple HomePad specs revealed in new leak</title>
      <link>https://mashable.com/article/apple-smart-home-homepad-leak</link>
      <pubDate>Fri, 12 Dec 2025 10:15:20 +0000</pubDate>
      <guid isPermaLink="false">04GLupmATBEcVwUHu36sPZl</guid>
      <description>A code leak has revealed some details on Apple's upcoming smart home accessory.</description>
    </item>
    <item>
      <title>Deadpool finally joins Marvel Rivals next season &#8212; everything announced for Season 6's monster hunting mayhem</title>
      <link>https://www.techradar.com/gaming/deadpool-finally-joins-marvel-rivals-next-season-everything-announced-for-season-6s-monster-hunting-mayhem</link>
      <pubDate>Fri, 12 Dec 2025 10:14:37 +0000</pubDate>
      <guid isPermaLink="false">2XSDwQF8aypsFF3eh7mXpM</guid>
      <description>Marvel Rivals Season 6 has been revealed at The Game Awards, and Deadpool is the next Hero. Here's what we know so far.</description>
    </item>
    <item>
      <title>Abonn&#233;s Netflix, il ne sera bient&#244;t plus possible d&#8217;acc&#233;der &#224; la plateforme SVoD sur cette Livebox d&#8217;Orange</title>
      <link>https://www.frandroid.com/marques/orange/2907625_abonnes-netflix-il-ne-sera-bientot-plus-possible-dacceder-a-la-plateforme-svod-sur-cette-livebox-dorange</link>
      <pubDate>Fri, 12 Dec 2025 10:06:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/orange/2907625_abonnes-netflix-il-ne-sera-bientot-plus-possible-dacceder-a-la-plateforme-svod-sur-cette-livebox-dorange</guid>
      <description>
Orange a d&#233;j&#224; pr&#233;venu ses abonn&#233;s que l'obsolescence du d&#233;codeur Livebox Play TV &#233;tait pour bient&#244;t, et elle prend maintenant forme. Fin janvier 2026, le d&#233;codeur TV qui &#233;tait alors le plus puissant de sa g&#233;n&#233;ration ne sera plus capable de prendre en charge Netflix.
</description>
    </item>
    <item>
      <title>L&#8217;option Message satellite d&#8217;Orange est officiellement disponible, &#224; deux trois conditions pr&#232;s</title>
      <link>https://www.frandroid.com/marques/orange/2907553_loption-message-satellite-dorange-est-officiellement-disponible-a-deux-trois-conditions-pres</link>
      <pubDate>Fri, 12 Dec 2025 10:06:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/orange/2907553_loption-message-satellite-dorange-est-officiellement-disponible-a-deux-trois-conditions-pres</guid>
      <description>
Apr&#232;s une officialisation en novembre dernier, l&#8217;option &#171;&#8201;Message satellite&#8201;&#187; d&#8217;Orange est bel et bien disponible sur le site de l&#8217;op&#233;rateur. Mais sa compatibilit&#233; est toujours limit&#233;e aux Pixel de 9e et 10e&#160;g&#233;n&#233;ration.
</description>
    </item>
    <item>
      <title>Moins de 17 000 &#8364; : cette petite voiture &#233;lectrique chinoise r&#233;pond &#224; la Dacia Spring et baisse ses prix</title>
      <link>https://www.frandroid.com/marques/leapmotor/2907539_moins-de-17-000-e-cette-petite-voiture-electrique-chinoise-repond-a-la-dacia-spring-et-baisse-ses-prix</link>
      <pubDate>Fri, 12 Dec 2025 10:04:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/leapmotor/2907539_moins-de-17-000-e-cette-petite-voiture-electrique-chinoise-repond-a-la-dacia-spring-et-baisse-ses-prix</guid>
      <description>
Priv&#233;e de leasing social &#224; cause de sa production en Chine, la Leapmotor T03 n&#8217;a pas dit son dernier mot. La voiture &#233;lectrique profite de deux offres promotionnelles, avec un prix sous les 17 000 euros.
</description>
    </item>
    <item>
      <title>Galaxy Ring 2 : pourquoi vous ne verrez pas la prochaine bague de Samsung d&#233;barquer de sit&#244;t</title>
      <link>https://www.frandroid.com/marques/samsung/2907709_galaxy-ring-2-pourquoi-vous-ne-verrez-pas-la-prochaine-bague-de-samsung-debarquer-de-sitot</link>
      <pubDate>Fri, 12 Dec 2025 10:03:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2907709_galaxy-ring-2-pourquoi-vous-ne-verrez-pas-la-prochaine-bague-de-samsung-debarquer-de-sitot</guid>
      <description>
Alors que la premi&#232;re bague connect&#233;e de Samsung a &#233;t&#233; d&#233;voil&#233;e l'an dernier, il faudra encore patienter un moment avant le prochain mod&#232;le, comme le rapporte la presse cor&#233;enne. 
</description>
    </item>
    <item>
      <title>How to unblock XNXX for free</title>
      <link>https://mashable.com/article/dec-12-unblock-xnxx-porn-for-free</link>
      <pubDate>Fri, 12 Dec 2025 10:01:08 +0000</pubDate>
      <guid isPermaLink="false">02oFeoTFnmFzJIlvOoRZX6f</guid>
      <description>How to unblock porn for free. Unblock and watch XNXX from anywhere in the world.</description>
    </item>
    <item>
      <title>The best E Ink tablets for 2025</title>
      <link>https://www.engadget.com/mobile/tablets/best-e-ink-tablet-130037939.html?src=rss</link>
      <pubDate>Fri, 12 Dec 2025 10:00:36 +0000</pubDate>
      <guid isPermaLink="false">57f41413-eec2-4d90-9c25-26d144b737b8</guid>
      <description>E Ink tablets have always been intriguing to me because I&#8217;m a longtime lover of pen and paper. I&#8217;ve had probably hundreds of notebooks over the years, serving as repositories for my story ideas, to-do lists, meeting notes and everything in between. However, I turned away from physical notebooks at a certain point because it was just easier to store everything digitally so I always had my most important information at my fingertips.E Ink tablets seem to provide the best of both worlds: the tactile satisfaction of regular notebooks with many of the conveniences found in digital tools, plus easy-...</description>
    </item>
    <item>
      <title>The Best Meteor Shower of the Year Is Coming&#8212;Here&#8217;s How to Watch</title>
      <link>https://www.wired.com/story/how-to-watch-the-geminids-meteor-shower/</link>
      <pubDate>Fri, 12 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">67470043657701f6600cac15</guid>
      <description>The highlight of the year, the Geminids are the most active and colorful meteor shower, offering the chance to see hundreds of shooting stars every hour when they peak in mid-December.</description>
    </item>
    <item>
      <title>A Delta flight was landing late and passengers were anxious. What the flight attendant did next was brilliant</title>
      <link>https://www.fastcompany.com/91450432/empathy-delta-flight-attendant-anxious-passengers</link>
      <pubDate>2025-12-12T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91450432/empathy-delta-flight-attendant-anxious-passengers</guid>
      <description>Using principles of empathy, the flight attendant transformed a group of strangers into a team on a mission.
Imagine the scene: Your plane just landed late. You&#8217;ve barely got enough time to catch your connection, but first you&#8217;ve got to convince the other passengers to let you off before them.</description>
    </item>
    <item>
      <title>In-N-Out is fed up with 6-7</title>
      <link>https://www.fastcompany.com/91458902/in-n-out-6-7-tiktok-viral</link>
      <pubDate>2025-12-12T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91458902/in-n-out-6-7-tiktok-viral</guid>
      <description>&#8216;After order number 66, the next order jumps straight to number 68. The chain has also removed the number 69, for good measure.&#8217;
If you&#8217;re order number 67 at In-N-Out, don&#8217;t expect to hear your number called.&#160;</description>
    </item>
    <item>
      <title>Ice giant planets Uranus and Neptune might not be full of ice after all</title>
      <link>https://mashable.com/article/uranus-neptune-ice-giants-rocky-planets</link>
      <pubDate>Fri, 12 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">07yjJruus6qSAcF8l7x4v4j</guid>
      <description>Uranus and Neptune might be more rocky than icy, new research shows, requiring scientists to rebrand the "ice giant" planets.</description>
    </item>
    <item>
      <title>Scan anything, anywhere with this app &#8212; now $42 for life</title>
      <link>https://mashable.com/article/dec-12-swiftscan-lifetime-subscription</link>
      <pubDate>Fri, 12 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">0605s3yOzm9JpWn6ZcxhGvB</guid>
      <description>Make scanning a breeze with this lifetime subscription to SwiftScan VIP for just $41.99 (reg. $199.99) with code SCAN through Dec. 21.</description>
    </item>
    <item>
      <title>Make 2026 the year you finally learn piano with this AI-powered app</title>
      <link>https://mashable.com/article/dec-12-skoove-premium-lifetime-subscription</link>
      <pubDate>Fri, 12 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02WplmKsVgCTXB53LfE5lPZ</guid>
      <description>Learn something new with this lifetime subscription to Skoove Premium Piano Lessons, now just $109.97 (reg. $299.99).</description>
    </item>
    <item>
      <title>Paul Mescal movies ranked by Sad Boyness</title>
      <link>https://mashable.com/article/paul-mescal-sad-boy-ranked</link>
      <pubDate>Fri, 12 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">06aGal2s25aloqXnI16VdIL</guid>
      <description>The internet boyfriend Paul Mescal breaks our hearts, and we're not mad.</description>
    </item>
    <item>
      <title>Why The Hollow Man novel is crucial to Wake Up Dead Man: A Knives Out Mystery</title>
      <link>https://mashable.com/article/knives-out-wake-up-dead-man-locked-room-mystery-hollow-man</link>
      <pubDate>Fri, 12 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">07daqcaAHPPmYFbkRESiU0c</guid>
      <description>After you've watched "Wake Up Dead Man: A Knives Out Mystery" on Netflix, make John Dickson Carr's book your next book club read.</description>
    </item>
    <item>
      <title>Scarlet review: Mamoru Hosodas latest is the craziest Hamlet adaptation youll ever see</title>
      <link>https://mashable.com/article/scarlet-review-mamoru-hosoda</link>
      <pubDate>Fri, 12 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01XFpBB13IW404PWh17lzkP</guid>
      <description>Anime director Mamoru Hosoda turns "Hamlet" into a gender-bent fantasy epic with new film, "Scarlet."</description>
    </item>
    <item>
      <title>The Mastermind review: Josh OConnor is truly magnetic in Kelly Reichardts latest film</title>
      <link>https://mashable.com/article/the-mastermind-review</link>
      <pubDate>Fri, 12 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00br1cChDPjYchtBl6periw</guid>
      <description>Josh O'Connor is truly magnetic and a terrible thief in Kelly Reichardt's latest film, "The Mastermind." Movie review.</description>
    </item>
    <item>
      <title>Dust Bunny review: Mads Mikkelsen and Sigourney Weaver team up for gnarly fairy tale</title>
      <link>https://mashable.com/article/dust-bunny-review</link>
      <pubDate>Fri, 12 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">06ysgdC41xTF60krY5MvnL9</guid>
      <description>Bryan Fuller's "Dust Bunny" offers a monster-under-the-bed story that's more "Hannibal" then kid-friendly. Review.</description>
    </item>
    <item>
      <title>Wake Up Dead Man: A Knives Out Mystery spoiler-free review</title>
      <link>https://mashable.com/article/wake-up-dead-man-knives-out-3-review</link>
      <pubDate>Fri, 12 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">03s0DT3H0jamAMDSo9vG0aW</guid>
      <description>Daniel Craig, Josh O'Connor, Glenn Close, Josh Brolin, Jeremy Renner, Kerry Washington, Andrew Scott, and more co-star in "Wake Up Dead Man: A Knives Out Mystery." Review.</description>
    </item>
    <item>
      <title>Hamnet review: Paul Mescal and Jessie Buckley burn in William Shakespeare tragedy</title>
      <link>https://mashable.com/article/hamnet-review-jessie-buckley-paul-mescal-chloe-zhao</link>
      <pubDate>Fri, 12 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02vS94issoXvphRqsCKX3H9</guid>
      <description>Academy Award winner Chlo&#233; Zhao delivers a haunting tale of love and loss with "Hamnet," starring Jessie Buckley and Paul Mescal. Review.</description>
    </item>
    <item>
      <title>WhatsApp veut remplacer le r&#233;pondeur avec sa nouvelle fonction d&#8217;appels manqu&#233;s</title>
      <link>https://www.01net.com/actualites/whatsapp-veut-remplacer-le-repondeur-avec-sa-nouvelle-fonction-dappels-manques.html</link>
      <pubDate>Fri, 12 Dec 2025 09:58:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315125</guid>
      <description>Meta d&#233;ploie une mise &#224; jour d'envergure pour les f&#234;tes. La messagerie transforme la gestion des appels sans r&#233;ponse et muscle son jeu sur l'intelligence artificielle.</description>
    </item>
    <item>
      <title>HomePad&#160;: le futur &#233;cran connect&#233; d&#8217;Apple pour la maison se pr&#233;cise</title>
      <link>https://www.01net.com/actualites/homepad-le-futur-ecran-connecte-dapple-pour-la-maison-se-precise.html</link>
      <pubDate>Fri, 12 Dec 2025 09:34:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315136</guid>
      <description>&#192; force de l&#8217;annoncer, le &#171;&#160;HomePad&#160;&#187; d&#8217;Apple finira bien par arriver ! Une nouvelle salve de rumeurs permet de se faire une meilleure id&#233;e de ce futur (et toujours hypoth&#233;tique) appareil d&#233;di&#233; &#224; la gestion de la maison connect&#233;e.</description>
    </item>
    <item>
      <title>24 langues, un ton pour chaque &#233;motion&#160;: Google soigne son outil de synth&#232;se vocale</title>
      <link>https://www.01net.com/actualites/24-langues-un-ton-pour-chaque-emotion-google-soigne-son-outil-de-synthese-vocale.html</link>
      <pubDate>Fri, 12 Dec 2025 09:31:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315030</guid>
      <description>Google vient d&#8217;annoncer deux nouvelles mises &#224; jour dans son outil Text to Speech, Gemini 2.5 Flash et Gemini 2.5 Pro. Celles-ci promettent des dialogues fluides avec une pr&#233;cision et une expressivit&#233; am&#233;lior&#233;es. Ces deux nouveaux modes sont d&#232;s &#224; pr&#233;sent disponibles via une mise &#224; jour.</description>
    </item>
    <item>
      <title>The Anker Solix C300 power station is over $80 off at Amazon</title>
      <link>https://mashable.com/article/dec-12-anker-solix-c300-power-station-deal</link>
      <pubDate>Fri, 12 Dec 2025 09:27:20 +0000</pubDate>
      <guid isPermaLink="false">028sv1Ko0oETWPMhofghvP9</guid>
      <description>Find the best portable power station deal on Amazon. Save 28% on the Anker Solix C300 at Amazon.</description>
    </item>
  </channel>
</rss>
