<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 16 Jan 2026 17:28:10 GMT</lastBuildDate>
    <item>
      <title>Quand Google cesse d&#8217;envoyer des lecteurs aux sites web</title>
      <link>https://www.01net.com/actualites/quand-google-cesse-denvoyer-des-lecteurs-aux-sites-web.html</link>
      <pubDate>Fri, 16 Jan 2026 17:22:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320788</guid>
      <description>Google a beau s&#8217;en d&#233;fendre, le constat est sans appel : le moteur de recherche renvoie de moins en moins de trafic vers les sites web. En cause, notamment, ses r&#233;sum&#233;s g&#233;n&#233;r&#233;s par intelligence artificielle, qui fournissent des r&#233;ponses sans n&#233;cessiter le moindre clic. En coulisses, les &#233;diteurs prennent acte de cette &#233;rosion et tentent, tant bien que mal, de pr&#233;parer un avenir o&#249; Google ne sera plus un passage oblig&#233;....</description>
    </item>
    <item>
      <title>The latest Legend of Zelda Lego set pays tribute to Ocarina of Time's final battle</title>
      <link>https://www.engadget.com/gaming/nintendo/the-latest-legend-of-zelda-lego-set-pays-tribute-to-ocarina-of-times-final-battle-172212137.html?src=rss</link>
      <pubDate>Fri, 16 Jan 2026 17:22:13 +0000</pubDate>
      <guid isPermaLink="false">481fc99a-94b1-4315-887f-9d174d1c4593</guid>
      <description>We already knew something Ocarina of Time-related was coming from Nintendo and Lego in 2026, and now we know exactly what that set will look like. Weighing in at a surprisingly modest 1,003 pieces, the typically word salad-y Lego The Legend of Zelda: Ocarina of Time - The Final Battle is the second Lego Zelda set, following the 2,500-piece Great Deku Tree set in 2024.
While the latter lets you choose between building either a Breath of the Wild or OoT-themed replica of the wise old guardian of the forest, the upcoming set is aimed squarely at fans of the series&#8217; debut 3D outing. As you can pro...</description>
    </item>
    <item>
      <title>X has been down for most of the morning</title>
      <link>https://www.engadget.com/social-media/x-has-been-down-for-most-of-the-morning-171843527.html?src=rss</link>
      <pubDate>Fri, 16 Jan 2026 17:18:43 +0000</pubDate>
      <guid isPermaLink="false">814237b9-63ca-4ae5-9c95-a454783a5e0b</guid>
      <description>X is still struggling with an outage that has intermittently taken the service offline and made it slow to load for much of the morning. According to X&#8217;s developer platform page,  there is an ongoing incident related to streaming endpoints that&#8217;s caused increased errors. The incident started at 7:39AM PT, according to the page.That roughly coincides with a spike in reports at Down Detector. The issues seems to be somewhat intermittent. At some points, X&#8217;s website has loaded partially and only shown older posts. At other times, the app and website have failed to load at all. Developing&#8230;This art...</description>
    </item>
    <item>
      <title>How a hacking campaign targeted high-profile Gmail and WhatsApp users across the Middle East</title>
      <link>https://techcrunch.com/2026/01/16/how-a-hacking-campaign-targeted-high-profile-gmail-and-whatsapp-users-across-the-middle-east/</link>
      <pubDate>Fri, 16 Jan 2026 17:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083348</guid>
      <description>The phishing campaign targeted users on WhatsApp, including an Iranian-British activist, and stole the credentials of a Lebanese cabinet minister and at least one journalist.</description>
    </item>
    <item>
      <title>X is still having issues following an hour-long outage on Friday</title>
      <link>https://www.theverge.com/news/863425/x-twitter-outage-january-16th-2026</link>
      <pubDate>2026-01-16T12:09:05-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=863425</guid>
      <description>On Friday morning, X and Grok went offline for users around the world on both the websites and apps. Outage reports began spiking on DownDetector around 10:00AM ET, while Cisco's ThousandEyes outage map noted over 600 X servers around the world that were having problems. Attempts to load the site with either the Twitter.com or [&#8230;]</description>
    </item>
    <item>
      <title>TikTok sued by former workers over alleged union-busting</title>
      <link>https://www.engadget.com/big-tech/tiktok-sued-by-former-workers-over-alleged-union-busting-170446921.html?src=rss</link>
      <pubDate>Fri, 16 Jan 2026 17:04:46 +0000</pubDate>
      <guid isPermaLink="false">16c8dbff-af18-4b78-abc2-8c21cd1bf9c0</guid>
      <description>You know things are messed up when a Big Tech company fights accusations of union-busting by insisting it was only AI layoffs. That's where things stand after a group of fired TikTok moderators in the UK filed a legal claim with an employment tribunal. The Guardian reported on Friday that around 400 TikTok content moderators who were unionizing were laid off before Christmas.The workers were sacked a week before a vote was scheduled to establish a collective bargaining unit. The moderators said they wanted better protection against the personal toll of processing traumatic content at a high sp...</description>
    </item>
    <item>
      <title>Samsung : quand les promotions des soldes cassent les prix des Galaxy S, Galaxy Book, Galaxy Watch</title>
      <link>https://www.frandroid.com/bons-plans/2939747_samsung-quand-les-promotions-des-soldes-cassent-les-prix-des-galaxy-s-galaxy-book-galaxy-watch</link>
      <pubDate>Fri, 16 Jan 2026 17:02:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2939747_samsung-quand-les-promotions-des-soldes-cassent-les-prix-des-galaxy-s-galaxy-book-galaxy-watch</guid>
      <description>
La deuxi&#232;me d&#233;marque des soldes apporte son lot de nouvelles offres Samsung&#8239;! Et &#224; l&#8217;approche du week-end, c&#8217;est le moment id&#233;al pour saisir les meilleurs deals du g&#233;ant sud-cor&#233;en. Entre TV QLED &#233;l&#233;gants, smartphones &#224; clapet et &#233;crans Ultra Wide OLED, il y en a pour tous les go&#251;ts &#8212; avec, en vedette, un vid&#233;oprojecteur affichant plus de 60&#8239;% de remise&#8239;!
...</description>
    </item>
    <item>
      <title>Let&#8217;s Talk About the Ending of &#8217;28 Years Later: The Bone Temple&#8217;</title>
      <link>https://gizmodo.com/28-years-later-bone-temple-ending-explained-2000709797</link>
      <pubDate>Fri, 16 Jan 2026 17:00:47 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000709797</guid>
      <description>Ralph Fiennes and Jack O'Connell star in the second of three '28 Years Later' sequels, now in theaters.</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : voici les meilleure offres pour ce week-end de 2e d&#233;marque</title>
      <link>https://www.frandroid.com/bons-plans/2941853_soldes-dhiver-2026-offres-week-end-2e-demarque</link>
      <pubDate>Fri, 16 Jan 2026 16:58:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2941853_soldes-dhiver-2026-offres-week-end-2e-demarque</guid>
      <description>
Les soldes d'hiver suivent leur chemin et nous arrivons au d&#233;j&#224; au deuxi&#232;me week-end ! Au programme : toujours plus d'offres Tech &#224; prix cass&#233;s, que ce soient les smartphones, les tablettes, les t&#233;l&#233;viseurs 4K, et surtout les ordinateurs portables, gaming ou de bureautique. M&#234;me le gaming s'invite avec la PS5 en promo. 
</description>
    </item>
    <item>
      <title>Quels sont les meilleurs ordinateurs portables grand format de 16, 17 et 18 pouces en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-ordinateurs/1044735_meilleurs-pc-portables-17-pouces-comparatif</link>
      <pubDate>Fri, 16 Jan 2026 16:57:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-ordinateurs/1044735_meilleurs-pc-portables-17-pouces-comparatif</guid>
      <description>
Les ordinateurs portables de 16 et 18 pouces offrent une exp&#233;rience visuelle immersive et un espace de travail optimis&#233;.  Vous cherchez un mod&#232;le de grand laptop adapt&#233; ? D&#233;couvrez notre s&#233;lection des meilleurs PC portables grand format pour faire le bon choix. 
</description>
    </item>
    <item>
      <title>La Pixel Watch pourrait sauver votre journ&#233;e gr&#226;ce &#224; cette nouvelle alerte</title>
      <link>https://www.frandroid.com/marques/google/2945499_pixel-watch-cette-nouvelle-fonctionnalite-dalerte-pourrait-bien-sauver-votre-journee</link>
      <pubDate>Fri, 16 Jan 2026 16:57:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2945499_pixel-watch-cette-nouvelle-fonctionnalite-dalerte-pourrait-bien-sauver-votre-journee</guid>
      <description>
Google travaillerait &#224; une nouvelle fonction d'alerte sur ses montres Pixel Watch. Elle permettrait de pr&#233;venir l'utilisateur lorsqu'il s'&#233;loigne trop de son smartphone et risque de l'oublier. 
</description>
    </item>
    <item>
      <title>Man&#8217;s Switch to Keto Diet Triggers Bizarre, Rare Rash</title>
      <link>https://gizmodo.com/mans-switch-to-keto-diet-triggers-bizarre-rare-rash-2000711067</link>
      <pubDate>Fri, 16 Jan 2026 16:55:56 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711067</guid>
      <description>Only around 300 cases of so-called "keto rash" have been documented worldwide.</description>
    </item>
    <item>
      <title>Boulanger multiplie les r&#233;ductions durant les soldes : les 16 deals &#224; saisir ce weeke-end</title>
      <link>https://www.frandroid.com/bons-plans/2931541_boulanger-multiplie-les-reductions-durant-les-soldes-les-14-deals-a-saisir-ce-weeke-end</link>
      <pubDate>Fri, 16 Jan 2026 16:55:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931541_boulanger-multiplie-les-reductions-durant-les-soldes-les-14-deals-a-saisir-ce-weeke-end</guid>
      <description>
&#192; l&#8217;occasion du week-end de la deuxi&#232;me d&#233;marque des soldes, Boulanger propose de belles offres pour se faire plaisir. L&#8217;enseigne affiche d&#8217;importantes r&#233;ductions sur les smartphones haut de gamme, comme l&#8217;ancien flagship de Google ou le r&#233;cent milieu de gamme de Xiaomi.
</description>
    </item>
    <item>
      <title>Test du REKT Shogun 68 : ce clavier est vendu comme un Wooting pas cher</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/peripheriques-pc/clavier/2945715_test-du-rekt-shogun-68-ce-clavier-est-vendu-comme-un-wooting-pas-cher</link>
      <pubDate>Fri, 16 Jan 2026 16:48:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/peripheriques-pc/clavier/2945715_test-du-rekt-shogun-68-ce-clavier-est-vendu-comme-un-wooting-pas-cher</guid>
      <description>
Pourquoi payer 190 &#8364; quand on peut avoir le Rapid Trigger pour 99 &#8364; ? 8000 Hz, activation &#224; 0,01 mm, switchs magn&#233;tiques Amber Pro... on a test&#233; le REKT Hiro 60.
</description>
    </item>
    <item>
      <title>Audible deal: Three months of access is only $3 right now</title>
      <link>https://www.engadget.com/deals/audible-deal-three-months-of-access-is-only-3-right-now-193859977.html?src=rss</link>
      <pubDate>Fri, 16 Jan 2026 16:46:26 +0000</pubDate>
      <guid isPermaLink="false">a8d99938-0b9f-4c17-b1d6-b88b320bc1cc</guid>
      <description>One way to read more in the new year is to incorporate audiobooks as part of your reading habit. Audible is having a sale right now that makes that easier and cheaper to do: you can get three months of access for only $1 per month, or a total of $3. The promotion runs through January 21.
An Audible subscription grants one audiobook per month to keep. This can be selected from a massive catalog of new releases and bestsellers. The collection here has just about everything. 


However, it's easy to plow through a single book in a month. Users also get streaming access to thousands of curated tit...</description>
    </item>
    <item>
      <title>Canada is going to start importing Chinese EVs &#8212; will the US follow?</title>
      <link>https://www.theverge.com/transportation/863393/canada-china-ev-import-trade-deal-us-trump-tariffs</link>
      <pubDate>2026-01-16T11:43:11-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=863393</guid>
      <description>Is the North American blockade on Chinese EVs softening? Today, Canadian Prime Minister Mark Carney announced a deal with China to slash tariffs on electric vehicles in exchange for lowering duties on canola products. Canada will initially allow up to 49,000 Chinese EVs at a 6.1 percent tariff, Carney said, though the exact timeline was [&#8230;]</description>
    </item>
    <item>
      <title>600,000 Trump Mobile phones sold? There&amp;#8217;s no proof.</title>
      <link>https://www.theverge.com/tech/863381/trump-mobile-viral-preorder-figures-600000</link>
      <pubDate>2026-01-16T11:41:57-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=863381</guid>
      <description>Where's the Trump phone? We're going to keep talking about it every week. We've reached out, as usual, to ask about the Trump phone's whereabouts. As usual, we're still waiting for a response. In the meantime, some impressive alleged sales figures have gone viral - but they might be too good to be true. This [&#8230;]</description>
    </item>
    <item>
      <title>Are you &#8216;grounded&#8217; or in a rut in your career? &#8216;Stable&#8217; or stuck?</title>
      <link>https://www.fastcompany.com/91470828/are-you-grounded-or-in-a-rut-in-your-career-stable-or-stuck</link>
      <pubDate>2026-01-16T16:40:55</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91470828/are-you-grounded-or-in-a-rut-in-your-career-stable-or-stuck</guid>
      <description>Here&#8217;s how to tell the difference&#8212;and what to do about it.
For a long time, I told myself I was choosing stability.</description>
    </item>
    <item>
      <title>Fnac Darty lance une grande braderie pour le week-end de la 2e d&#233;marque des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-darty-lance-une-grande-braderie-pour-le-week-end-de-la-2e-demarque-des-soldes</link>
      <pubDate>Fri, 16 Jan 2026 16:40:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-darty-lance-une-grande-braderie-pour-le-week-end-de-la-2e-demarque-des-soldes</guid>
      <description>
Le week-end approche, et Fnac et Darty passent &#224; la vitesse sup&#233;rieure pour la deuxi&#232;me d&#233;marque des soldes&#8239;! Les deux enseignes cassent encore les prix sur des produits d&#233;j&#224; en promo&#8239;: laptop &#224; double &#233;cran &#224; prix mini, Apple Watch en baisse, trottinette Xiaomi encore plus abordable&#8230; C&#8217;est le bon moment pour craquer avant la fin des stocks&#8239;!
</description>
    </item>
    <item>
      <title>How to watch Getting Filthy Rich season 4 online &#8211; free stream, release date</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/watch-getting-filthy-rich-season-4-online</link>
      <pubDate>Fri, 16 Jan 2026 16:40:25 +0000</pubDate>
      <guid isPermaLink="false">9o9kJ27LPPKiiZZE239Jv4</guid>
      <description>Olivia Attwood: Getting Filthy Rich returns to our screens for its third series. Read here for how to watch Olivia Attwood: Getting Filthy Rich season 4 online and free from anywhere.</description>
    </item>
    <item>
      <title>I saw the future of retail, and it&#8217;s all AI</title>
      <link>https://www.theverge.com/tech/863365/national-retail-federation-show-shopping-commerce-ai</link>
      <pubDate>2026-01-16T11:37:02-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=863365</guid>
      <description>Several people are gathered around a bleach blond man in a bright pink suit suspended in a clear plastic tube. With a microphone in front of him and a giant sign reading TALK TO ME placed above, "Mike" waits, hands clasped patiently in front of his body, to take questions from his public. "Mike" is [&#8230;]</description>
    </item>
    <item>
      <title>The Richest 1% Blew Their 2026 Carbon Budget in 10 Days. Some Did It in 3</title>
      <link>https://gizmodo.com/the-richest-1-blew-their-2026-carbon-budget-in-10-days-some-did-it-in-3-2000711085</link>
      <pubDate>Fri, 16 Jan 2026 16:35:04 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711085</guid>
      <description>A new report underscores the vastly disproportionate role the super-rich play in driving the climate crisis.</description>
    </item>
    <item>
      <title>Home Depot's weekend sale is like a Presidents' Day preview &#8212; 40% off appliances, tools, furniture and more</title>
      <link>https://www.techradar.com/seasonal-sales/home-depots-weekend-sale-is-like-a-presidents-day-preview-40-percent-off-appliances-tools-furniture-and-more</link>
      <pubDate>Fri, 16 Jan 2026 16:34:18 +0000</pubDate>
      <guid isPermaLink="false">tKMmX5mt2nzrzxALSecsqR</guid>
      <description>Home Depot's long weekend sale is like a Presidents' Day preview, and I'm rounding up the best deals, including 40% off appliances, tools, furniture, and more.</description>
    </item>
    <item>
      <title>Google Gemini&#160;: quotas s&#233;par&#233;s pour Pro et Raisonnement, voici les limites d&#233;taill&#233;es</title>
      <link>https://www.01net.com/actualites/google-gemini-quotas-separes-pour-pro-et-raisonnement-voici-les-limites-detaillees.html</link>
      <pubDate>Fri, 16 Jan 2026 16:32:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320714</guid>
      <description>Google revoit totalement sa gestion des quotas pour Gemini. Fini le pot commun, place &#224; des limites s&#233;par&#233;es pour le raisonnement et le code, avec un avantage massif pour les abonn&#233;s Ultra.</description>
    </item>
    <item>
      <title>How Trump is breaking with precedent by naming a growing list of federal properties after himself</title>
      <link>https://www.fastcompany.com/91476307/how-trump-breaking-precedent-naming-growing-list-federal-properties-after-himself</link>
      <pubDate>2026-01-16T16:30:02</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91476307/how-trump-breaking-precedent-naming-growing-list-federal-properties-after-himself</guid>
      <description>It&#8217;s extremely rare for government assets to be named after a sitting president.
Most American presidents aspire to the kind of greatness that prompts future generations to name important things in their honor.Donald Trump isn&#8217;t leaving it to future generations.As the first year of his second term wraps up, his Republican administration and allies have put his name on the U.S. Institute of Peace, the Kennedy Center performing arts venue and a new class of battleships.That&#8217;s on top of the &#8220;Trump Accounts&#8221; for tax-deferred investments, the TrumpRx government website soon to offer direct sales of...</description>
    </item>
    <item>
      <title>Kodak&#8217;s collectible Charmera is a terrible camera I somehow don&#8217;t hate</title>
      <link>https://www.theverge.com/tech/862122/kodak-reto-charmera-digital-camera-blind-bag-keychain-collectible</link>
      <pubDate>2026-01-16T11:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=862122</guid>
      <description>Like trading cards, Lego figures, and even the coveted Labubu, you don't know exactly what your Kodak Charmera camera is going to look like until you open the box. The anticipation and a $30 price tag helped the collectible camera sell out quickly and become nearly impossible to find over the holidays after its debut [&#8230;]</description>
    </item>
    <item>
      <title>X is down for the second time this week</title>
      <link>https://techcrunch.com/2026/01/16/x-is-down-for-the-second-time-this-week/</link>
      <pubDate>Fri, 16 Jan 2026 16:29:38 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083360</guid>
      <description>Elon Musk's X, formerly Twitter, is down for the second time this week. Nearly 80,000 reports have spiked on Down Detector since around 10 a.m. ET Friday morning.</description>
    </item>
    <item>
      <title>7 high-converting print-on-demand products to add to your website</title>
      <link>https://www.techradar.com/pro/software-services/7-high-converting-print-on-demand-products-to-add-to-your-website</link>
      <pubDate>Fri, 16 Jan 2026 16:27:41 +0000</pubDate>
      <guid isPermaLink="false">AfuaqszZesM54k73w4qrDR</guid>
      <description>From t-shirts to wall art, these print-on-demand products deliver the highest conversion rates and profit margins for influencers and brands.</description>
    </item>
    <item>
      <title>Amazon&#160;lance&#160;une myriade d&#8217;offres&#160;durant les soldes : les 18 meilleures offres</title>
      <link>https://www.frandroid.com/bons-plans/2933045_amazon-lance-une-myriade-doffres-durant-les-soldes-les-18-meilleures-offres</link>
      <pubDate>Fri, 16 Jan 2026 16:27:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933045_amazon-lance-une-myriade-doffres-durant-les-soldes-les-18-meilleures-offres</guid>
      <description>
Pendant les soldes d&#8217;hiver, Amazon ne r&#233;serve pas ses bonnes affaires aux seuls membres Prime&#8239;: chacun peut profiter d&#8217;une large s&#233;lection de remises. Pour le week-end de la deuxi&#232;me d&#233;marque, le g&#233;ant am&#233;ricain multiplie les offres et met en avant de nombreuses promotions &#224; saisir sans attendre.
</description>
    </item>
    <item>
      <title>Frustrated with Verizon? These are the best deals for switching to AT&amp;T and T-Mobile</title>
      <link>https://www.techradar.com/phones/frustrated-with-verizon-these-are-the-best-deals-for-switching-to-at-and-t-and-t-mobile</link>
      <pubDate>Fri, 16 Jan 2026 16:22:18 +0000</pubDate>
      <guid isPermaLink="false">9kbn4VT7ArTqZQTxBxaDe7</guid>
      <description>Both T-Mobile and AT&amp;T have tempting switching offers for new customers this week.</description>
    </item>
    <item>
      <title>Capcom&#8217;s 12-minute showcase proves Resident Evil Requiem is worth the wait: here are my five key takeaways</title>
      <link>https://www.techradar.com/gaming/capcoms-12-minute-showcase-proves-resident-evil-requiem-is-worth-the-wait-here-are-my-five-key-takeaways</link>
      <pubDate>Fri, 16 Jan 2026 16:19:51 +0000</pubDate>
      <guid isPermaLink="false">8g9DuLFEFHHrK6G4tccmEB</guid>
      <description>After watching the Resident Evil Requiem showcase, launch day can't come soon enough, as the reveals have left me antsy.</description>
    </item>
    <item>
      <title>'We're competitive &#8211; we want to win': Netflix co-CEO Ted Sarandos rejects rumors that Warner Bros. movies won't stay in theaters for 45 days if $82bn buyout is approved</title>
      <link>https://www.techradar.com/streaming/netflix/were-competitive-we-want-to-win-netflix-co-ceo-ted-sarandos-rejects-rumors-that-warner-bros-movies-wont-stay-in-theaters-for-45-days-if-usd82bn-buyout-is-approved</link>
      <pubDate>Fri, 16 Jan 2026 16:19:32 +0000</pubDate>
      <guid isPermaLink="false">wcTn9pqygNDU8qFcLSiQeJ</guid>
      <description>Netflix's co-chief has clarified its stance on the theatre going experience amid its potential buyout of Warner Bros.</description>
    </item>
    <item>
      <title>Cisco has finally patched a maximum-level security issue which was allegedly being targeted by Chinese hackers</title>
      <link>https://www.techradar.com/pro/security/cisco-has-finally-patched-a-maximum-level-security-issue-which-was-allegedly-being-targeted-by-chinese-hackers</link>
      <pubDate>Fri, 16 Jan 2026 16:15:00 +0000</pubDate>
      <guid isPermaLink="false">bK2YGUqPBkRHSjBuYbXuXK</guid>
      <description>A maximum-severity Cisco bug was being exploited by multiple Chinese actors, reports said, forcing the firm to act.</description>
    </item>
    <item>
      <title>Taco Bell&#8217;s &#8216;Luxe Value&#8217; deals offer 10 new items for $3 or less, starting today. Here&#8217;s what&#8217;s on the menu</title>
      <link>https://www.fastcompany.com/91476374/taco-bell-new-luxe-value-menu-starts-today-for-rewards-members</link>
      <pubDate>2026-01-16T16:15:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91476374/taco-bell-new-luxe-value-menu-starts-today-for-rewards-members</guid>
      <description>Taco Bell Rewards members can now access the new menu, but all other customers will have to wait until next Thursday.
Taco Bell is saying &#8220;new year, new offerings&#8221; with the launch of its &#8220;Luxe Value Menu.&#8221;&#160;</description>
    </item>
    <item>
      <title>Why is everyone posting 2016? What to know about the nostalgic social media trend that&#8217;s dominating TikTok</title>
      <link>https://www.fastcompany.com/91476290/2026-is-the-new-2016-trend-meaning-why-tiktok</link>
      <pubDate>2026-01-16T16:05:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91476290/2026-is-the-new-2016-trend-meaning-why-tiktok</guid>
      <description>How young and innocent we all were.
By the time they get into their 20s, every generation seems to have nostalgia for one year from their teenage years. </description>
    </item>
    <item>
      <title>This retro portable music player idea that 'recreates the image of a tape spinning on a circular shelf' has completely hooked me &#8212; I'd love someone to make it for real</title>
      <link>https://www.techradar.com/audio/wireless-bluetooth-speakers/this-retro-portable-music-player-idea-that-recreates-the-image-of-a-tape-spinning-on-a-circular-shelf-has-completely-hooked-me-id-love-someone-to-make-it-for-real</link>
      <pubDate>Fri, 16 Jan 2026 16:04:52 +0000</pubDate>
      <guid isPermaLink="false">tgwxmhhzWSrsLDhC3fnDVD</guid>
      <description>This brilliant Bluetooth concept looks like something from &#8217;70s sci-fi</description>
    </item>
    <item>
      <title>Chinese EVs inch closer to the US as Canada slashes tariffs</title>
      <link>https://techcrunch.com/2026/01/16/chinese-evs-inch-closer-to-the-us-as-canada-slashes-tariffs/</link>
      <pubDate>Fri, 16 Jan 2026 16:04:02 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083341</guid>
      <description>The country is dropping its import tax from 100% to just 6.1%, with an initial annual cap of 49,000 cars.</description>
    </item>
    <item>
      <title>Elon Musk&#8217;s X Suffers Widespread Outage</title>
      <link>https://gizmodo.com/elon-musks-x-suffers-widespread-outage-2000711084</link>
      <pubDate>Fri, 16 Jan 2026 16:03:25 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711084</guid>
      <description>Here comes another influx of refugees to competing sites like Threads and Bluesky.</description>
    </item>
    <item>
      <title>We asked Minnesota&#8217;s biggest companies about ICE. None of them responded</title>
      <link>https://www.fastcompany.com/91476021/minnesota-biggest-companies-ice-statements-silence</link>
      <pubDate>2026-01-16T16:01:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91476021/minnesota-biggest-companies-ice-statements-silence</guid>
      <description>In a sign of how far we&#8217;ve come from the summer of 2020, well-known brands have stayed silent as escalating chaos unfolds in their backyard.
The sonic backdrop of the Twin Cities in 2026 is a cacophony. </description>
    </item>
    <item>
      <title>Lego&#8217;s Next &#8216;Legend of Zelda&#8217; Set Takes Us Back to &#8216;Ocarina of Time&#8217;</title>
      <link>https://gizmodo.com/lego-legend-of-zelda-ocarina-of-time-final-battle-set-price-release-date-2000711082</link>
      <pubDate>Fri, 16 Jan 2026 16:00:09 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711082</guid>
      <description>Link and Zelda face off against Ganon in Lego's recreation of the iconic N64 game's climactic boss battle.</description>
    </item>
    <item>
      <title>Former USDS Leaders Launch Tech Reform Project to Fix What DOGE Broke</title>
      <link>https://www.wired.com/story/former-usds-leaders-launch-tech-reform-project-doge/</link>
      <pubDate>Fri, 16 Jan 2026 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">69655f6a524cefeddfd6cbc4</guid>
      <description>The plan, which is still in its early stages, is spearheaded by former USDS administrator Mikey Dickerson.</description>
    </item>
    <item>
      <title>What&#8217;s on the cards for Arc Raiders in 2026? According to the game&#8217;s design lead there&#8217;s going to be a roadmap shared soon as well as multiple new maps throughout the year</title>
      <link>https://www.techradar.com/gaming/whats-on-the-cards-for-arc-raiders-in-2026-according-to-the-games-design-lead-theres-going-to-be-a-roadmap-shared-soon-as-well-as-multiple-new-maps-throughout-the-year</link>
      <pubDate>Fri, 16 Jan 2026 15:59:04 +0000</pubDate>
      <guid isPermaLink="false">Zt3suizTmSfj2r7pxQrHVh</guid>
      <description>Arc Raiders design lead Virgil Watkins has teased some of what's in store for 2026. The game will be getting multiple maps this year.</description>
    </item>
    <item>
      <title>Apple n&#8217;est plus prioritaire sur les puces de ses iPhone, la faute &#224; Nvidia</title>
      <link>https://www.01net.com/actualites/apple-nest-plus-prioritaire-sur-les-puces-de-ses-iphone-la-faute-a-nvidia.html</link>
      <pubDate>Fri, 16 Jan 2026 15:58:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320758</guid>
      <description>TSMC a retir&#233; le tapis rouge sous les pieds d'Apple. La firme &#224; la pomme doit faire de la place &#224; d'autres clients du fondeur, en particulier Nvidia. Un changement consid&#233;rable dans la relation entre Apple et TSMC.</description>
    </item>
    <item>
      <title>Forget the RAM crisis &#8211; are we headed for a full-blown GPU crisis? Rumored production cut for Nvidia GPUs makes it seem more likely</title>
      <link>https://www.techradar.com/computing/gpu/forget-the-ram-crisis-are-we-headed-for-a-full-blown-gpu-crisis-rumored-production-cut-for-nvidia-gpus-makes-it-seem-more-likely</link>
      <pubDate>Fri, 16 Jan 2026 15:57:56 +0000</pubDate>
      <guid isPermaLink="false">5HXV5TgvyNXbJdRLVXj97C</guid>
      <description>Nvidia won't have any new GPUs for 2026, rumor claims &#8211; and with an up to 20% drop in production, this year could be a troubled one.</description>
    </item>
    <item>
      <title>YouTube relaxes monetization guidelines for some controversial topics</title>
      <link>https://techcrunch.com/2026/01/16/youtube-relaxes-monetization-guidelines-for-some-controversial-topics/</link>
      <pubDate>Fri, 16 Jan 2026 15:56:58 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083326</guid>
      <description>These controversial topics include self-harm, abortion, suicide, and domestic and sexual abuse.</description>
    </item>
    <item>
      <title>X is down for some &#8211; here's everything we know about the outage</title>
      <link>https://www.techradar.com/news/live/x-is-down-january-16-2026</link>
      <pubDate>Fri, 16 Jan 2026 15:53:23 +0000</pubDate>
      <guid isPermaLink="false">Ay9L3aoEvCsDDtzkinsDd</guid>
      <description>X is down for many users right now &#8211;here's everything we know about the latest outage.</description>
    </item>
    <item>
      <title>Samsung will pay you $50 to leave your non-Samsung watch party</title>
      <link>https://mashable.com/article/jan-16-samsung-tv-transfer-portal</link>
      <pubDate>Fri, 16 Jan 2026 15:42:32 +0000</pubDate>
      <guid isPermaLink="false">02M8aFtL5iZmQexW5lyah6j</guid>
      <description>Samsung is giving $50 Venmo rideshare credits to 900 fans who "transfer" to a watch party with a Samsung TV. Plus, save up to 50% on new TVs.</description>
    </item>
    <item>
      <title>Bluesky rolls out cashtags and LIVE badges amid a boost in app installs</title>
      <link>https://techcrunch.com/2026/01/16/bluesky-rolls-out-cashtags-and-live-badges-amid-a-boost-in-app-installs/</link>
      <pubDate>Fri, 16 Jan 2026 15:42:13 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083323</guid>
      <description>Bluesky adds new features to its app amid a boost in installs due to the deepfake drama on X.</description>
    </item>
    <item>
      <title>X outage: Elon Musks site is down, heres what we know</title>
      <link>https://mashable.com/article/x-outage-crash-elon-musk-twitter</link>
      <pubDate>Fri, 16 Jan 2026 15:42:02 +0000</pubDate>
      <guid isPermaLink="false">05GfH8uKLde8bxwHLk9YMb2</guid>
      <description>Elon Musk's X went down Friday, Jan. 16. Here's what we know.</description>
    </item>
    <item>
      <title>Yes, you can still buy the DJI Neo 2 Drone &#8212; and right now, get it on sale</title>
      <link>https://mashable.com/article/jan-16-dji-neo-2-drone-deal</link>
      <pubDate>Fri, 16 Jan 2026 15:38:02 +0000</pubDate>
      <guid isPermaLink="false">02Ts96sBK2bT8ASfPdt0QOr</guid>
      <description>As of Jan. 16, get the DJI Neo 2 drone at Amazon for $599. That's the drone's lowest price ever so you can capture 4K content from the sky.</description>
    </item>
    <item>
      <title>How Jerome Powell could stay at the Federal Reserve until 2028</title>
      <link>https://www.fastcompany.com/91476311/justice-departments-investigation-into-fed-raises-key-question-will-jerome-powell-exit-may</link>
      <pubDate>2026-01-16T15:37:56</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91476311/justice-departments-investigation-into-fed-raises-key-question-will-jerome-powell-exit-may</guid>
      <description>His term as chair of the central bank ends on May 15, 2026.
The Justice Department&#8217;s investigation into Federal Reserve Chair Jerome Powell has brought heightened attention to a key drama that will play out at the central bank in the coming months: Will Powell leave the Fed when his term as chair ends, or will he take the unusual step of remaining a governor?Powell&#8217;s term as Fed chair finishes on May 15, but because of the central bank&#8217;s complex structure, he has a separate term as one of seven members of its governing board that lasts until January 31, 2028. Historically, nearly all Fed chair...</description>
    </item>
    <item>
      <title>How to claim Verizon's $20 credit for Wednesday's service outage</title>
      <link>https://www.engadget.com/mobile/how-to-claim-verizons-20-credit-for-wednesdays-service-outage-171909695.html?src=rss</link>
      <pubDate>Fri, 16 Jan 2026 15:32:47 +0000</pubDate>
      <guid isPermaLink="false">531aea65-d6fb-4bdd-83f9-a0f1edab49a2</guid>
      <description>Verizon is offering a very small mea culpa after Wednesday's massive outage, which drew more than 1.5 million reports on Downdetector and lasted hours. Initially, the carrier posted on X that it will offer a $20 credit, but customers must redeem it in the myVerizon app. The company then said the credit could be claimed though customer service (via phone or chat), but our editors&#8217; attempts to do so via chat were met with a message to wait for a text with further instructions. Engadget editors began receiving the texts this morning (Jan 16) with a link to redeem. From there, you need to log into...</description>
    </item>
    <item>
      <title>X (Twitter) a encore &#233;t&#233; en panne : c&#8217;est la deuxi&#232;me fois en une semaine</title>
      <link>https://www.frandroid.com/culture-tech/web/2945893_x-twitter-est-encore-en-panne-pour-la-2e-fois-en-une-semaine</link>
      <pubDate>Fri, 16 Jan 2026 15:29:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/web/2945893_x-twitter-est-encore-en-panne-pour-la-2e-fois-en-une-semaine</guid>
      <description>
X (Twitter) a travers&#233; une nouvelle panne. C'est d&#233;j&#224; la deuxi&#232;me fois cette semaine.
</description>
    </item>
    <item>
      <title>Big screen, bigger deal: Save over $900 on the LG 86-inch 85A QNED Mini-LED TV</title>
      <link>https://mashable.com/article/jan-16-lg-86-inch-qned-tv-deal</link>
      <pubDate>Fri, 16 Jan 2026 15:28:18 +0000</pubDate>
      <guid isPermaLink="false">03nx8mpzTQtbNkWQuc54oJl</guid>
      <description>The LG 86-inch 85A QNED Mini-LED 4K TV is on sale for only $1,396.99 at Amazon, which is over $900 off and its best price ever.</description>
    </item>
  </channel>
</rss>
