<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 18 Dec 2025 10:28:47 GMT</lastBuildDate>
    <item>
      <title>J&#8217;ai cherch&#233; l&#8217;&#233;quivalent PC du MacBook Pro : deux mois avec l&#8217;Asus ProArt P16 et sa RTX 5090</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2914563_jai-cherche-lequivalent-pc-du-macbook-pro-deux-mois-avec-lasus-proart-p16-et-sa-rtx-5090</link>
      <pubDate>Thu, 18 Dec 2025 10:23:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2914563_jai-cherche-lequivalent-pc-du-macbook-pro-deux-mois-avec-lasus-proart-p16-et-sa-rtx-5090</guid>
      <description>
Le duel est un peu injuste, mais instructif. D'un c&#244;t&#233;, mon fid&#232;le MacBook Pro 14 M4 Pro, champion de l'efficacit&#233;. De l'autre, le monstre d'Asus : le ProArt P16 avec sa RTX 5090 et un &#233;cran OLED Tandem mat in&#233;dit. J'ai pass&#233; deux mois avec le challenger. Voici pourquoi il m'a fait douter, sans totalement me convertir.
</description>
    </item>
    <item>
      <title>&#171; Nous sommes l&#224; pour rester &#187; : Changan veut envahir l&#8217;Europe avec ses voitures &#233;lectriques</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2914473_nous-sommes-la-pour-rester-changan-veut-envahir-leurope-avec-ses-voitures-electriques</link>
      <pubDate>Thu, 18 Dec 2025 10:15:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2914473_nous-sommes-la-pour-rester-changan-veut-envahir-leurope-avec-ses-voitures-electriques</guid>
      <description>
Encore m&#233;connue chez nous, la marque chinoise Changan veut se faire une place de choix en Europe. Le constructeur va &#233;tendre sa pr&#233;sence &#224; plusieurs pays, dont l&#8217;Italie, l&#8217;Espagne et le Danemark, pour y vendre ses voitures &#233;lectriques : les Deepal S05 et S07.
</description>
    </item>
    <item>
      <title>OpenAI lance son &#171;&#160;App Store&#160;&#187; : ChatGPT se transforme en syst&#232;me d&#8217;exploitation</title>
      <link>https://www.01net.com/actualites/openai-lance-son-app-store-chatgpt-se-transforme-en-systeme-dexploitation.html</link>
      <pubDate>Thu, 18 Dec 2025 10:14:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316001</guid>
      <description>OpenAI ne veut plus seulement r&#233;pondre &#224; vos questions, l'entreprise veut tout faire &#224; votre place. Mercredi soir, le cr&#233;ateur de ChatGPT a franchi une &#233;tape d&#233;cisive en ouvrant officiellement son &#171; App Directory &#187;, un magasin d'applications int&#233;gr&#233; directement dans son interface.</description>
    </item>
    <item>
      <title>Bient&#244;t la mort d&#8217;OpenVPN ? Des fournisseurs abandonnent le protocole au profit de WireGuard</title>
      <link>https://www.frandroid.com/services/vpn/2914489_bientot-la-mort-dopenvpn-des-fournisseurs-abandonnent-le-protocole-au-profit-de-wireguard</link>
      <pubDate>Thu, 18 Dec 2025 10:12:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/vpn/2914489_bientot-la-mort-dopenvpn-des-fournisseurs-abandonnent-le-protocole-au-profit-de-wireguard</guid>
      <description>
&#192; ce jour, un fournisseur de VPN a d&#233;j&#224; abandonn&#233; le protocole OpenVPN et un deuxi&#232;me appliquera la m&#234;me d&#233;cision en janvier 2026. Le protocole OpenVPN devient-t-il donc obsol&#232;te ? C'est du moins ce que font penser AzireVPN et Mullvad VPN qui conseillent fortement de se tourner d&#233;sormais vers WireGuard.
</description>
    </item>
    <item>
      <title>Le Samsung Galaxy S25 devient une belle affaire dans ce pack avec un Chromebook Go offert</title>
      <link>https://www.frandroid.com/bons-plans/2902337_le-samsung-galaxy-s25-devient-une-belle-affaire-dans-ce-pack-avec-un-chromebook-go-offert</link>
      <pubDate>Thu, 18 Dec 2025 10:12:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2902337_le-samsung-galaxy-s25-devient-une-belle-affaire-dans-ce-pack-avec-un-chromebook-go-offert</guid>
      <description>
Le Samsung Galaxy S25 devrait bient&#244;t &#234;tre remplac&#233;, mais il reste un t&#233;l&#233;phone haut de gamme &#224; consid&#233;rer. Il devient plus recommandable gr&#226;ce &#224; cette offre o&#249; il est propos&#233; avec un laptop Samsung Galaxy Chromebook Go &#224; 799 euros au lieu de 1 468 euros.&#160;
</description>
    </item>
    <item>
      <title>PC, smartphones, consoles : pourquoi tout devient plus cher et comment l&#8217;expliquer &#224; vos proches</title>
      <link>https://www.frandroid.com/produits-android/hardware/memoire/2913977_penurie-de-ram-preparez-vous-a-payer-plus-pour-avoir-la-meme-chose-ou-pire-a-payer-plus-pour-avoir-moins</link>
      <pubDate>Thu, 18 Dec 2025 10:12:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/memoire/2913977_penurie-de-ram-preparez-vous-a-payer-plus-pour-avoir-la-meme-chose-ou-pire-a-payer-plus-pour-avoir-moins</guid>
      <description>
Entre les centres de donn&#233;es IA qui raflent tout et une p&#233;nurie de DRAM qui pourrait durer jusqu'en 2028, le march&#233; du hardware plonge dans une zone de turbulences in&#233;dite. C'est votre portefeuille qui va douiller.
</description>
    </item>
    <item>
      <title>Mauvaise nouvelle pour les utilisateurs d&#8217;iPhone : l&#8217;App Store va &#234;tre envahi par la publicit&#233;</title>
      <link>https://www.frandroid.com/marques/apple/2914457_mauvaise-nouvelle-pour-les-utilisateurs-diphone-lapp-store-va-etre-envahi-par-la-publicite</link>
      <pubDate>Thu, 18 Dec 2025 10:05:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2914457_mauvaise-nouvelle-pour-les-utilisateurs-diphone-lapp-store-va-etre-envahi-par-la-publicite</guid>
      <description>
Fini l'emplacement unique en t&#234;te de page, Apple veut &#233;largir ses revenus publicitaires. La firme de Cupertino s'appr&#234;te &#224; afficher davantage de publicit&#233;s au sein de l'App Store. 
</description>
    </item>
    <item>
      <title>Notre s&#233;lection des meilleures TV pas ch&#232;res (&#224; moins de 600 euros) en 2025</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-tv/1669623_quelle-tv-pas-chere-choisir-notre-selection-de-petit-prix</link>
      <pubDate>Thu, 18 Dec 2025 10:05:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-tv/1669623_quelle-tv-pas-chere-choisir-notre-selection-de-petit-prix</guid>
      <description>
Vous &#234;tes &#224; la recherche d&#8217;un TV pas cher pour vous &#233;quiper correctement sans exploser votre budget&#8201;? Voici une s&#233;lection des meilleurs mod&#232;les disponibles &#224; petit prix. Pour ce faire, nous avons plac&#233; une limite de budget en dessous de 600&#160;euros et propos&#233; quelques technologies d&#8217;&#233;cran.
</description>
    </item>
    <item>
      <title>Insightly introduces AI into its CRM platform</title>
      <link>https://www.techradar.com/pro/software-services/insightly-introduces-ai-into-its-crm-platform</link>
      <pubDate>Thu, 18 Dec 2025 10:02:39 +0000</pubDate>
      <guid isPermaLink="false">rQrp837885wNrtS8tn9qWb</guid>
      <description>The company named its chatbot "Copilot" and promises better productivity for sales, marketing, and customer success departments.</description>
    </item>
    <item>
      <title>The best AirPods for 2026</title>
      <link>https://www.engadget.com/audio/headphones/best-airpods-100041810.html?src=rss</link>
      <pubDate>Thu, 18 Dec 2025 10:01:26 +0000</pubDate>
      <guid isPermaLink="false">82094351-1aa1-4844-a50e-e2cb2de07947</guid>
      <description>Apple&#8217;s AirPods have become the default choice for many people, whether you want simple wireless earbuds that work without fuss or premium options with features like noise cancellation and spatial audio. The lineup has grown over the years, so there is now a model for almost every type of listener. Some pairs are built for all-day comfort, others focus on isolation and richer sound, and Apple&#8217;s over-ear option offers a more immersive experience for movies and music.If you spend most of your time on an iPhone or iPad, all AirPods share one big advantage: they connect instantly and switch betwee...</description>
    </item>
    <item>
      <title>L&#8217;ann&#233;e de Xiaomi n&#8217;est pas encore termin&#233;e : le Xiaomi 17 Ultra arrive tr&#232;s bient&#244;t pour impressionner en photo</title>
      <link>https://www.frandroid.com/actualites-generales/2914501_lannee-de-xiaomi-nest-pas-encore-terminee-le-xiaomi-17-ultra-arrive-tres-bientot-pour-impressionner-en-photo</link>
      <pubDate>Thu, 18 Dec 2025 09:57:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2914501_lannee-de-xiaomi-nest-pas-encore-terminee-le-xiaomi-17-ultra-arrive-tres-bientot-pour-impressionner-en-photo</guid>
      <description>
Le Xiaomi 17 Ultra devrait sortir dans quelques jours seulement en Chine et la marque met d&#233;j&#224; l'accent sur la photo.
</description>
    </item>
    <item>
      <title>Le t&#233;lescope James-Webb d&#233;couvre une exoplan&#232;te impossible : son atmosph&#232;re d&#233;fie toutes les th&#233;ories connues</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-telescope-james-webb-decouvre-exoplanete-impossible-son-atmosphere-defie-toutes-theories-connues-128711/#xtor%3DRSS-8</link>
      <pubDate>Thu, 18 Dec 2025 10:57:20 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-telescope-james-webb-decouvre-exoplanete-impossible-son-atmosphere-defie-toutes-theories-connues-128711/#xtor%3DRSS-8</guid>
      <description>Tout est &#233;trange avec&#160;PSR J2322-2650b. D&#233;j&#224;, cette exoplan&#232;te est en orbite autour d'une &#233;toile &#224; neutrons, mais c'est surtout sa composition qui intrigue : elle est exotique. Les plan&#233;tologues en sont d&#233;concert&#233;s car ils ne l'expliquent pas !</description>
    </item>
    <item>
      <title>Votre smartphone Android peut maintenant verrouiller votre PC Windows 11 &#224; distance</title>
      <link>https://www.01net.com/actualites/votre-smartphone-android-peut-maintenant-verrouiller-votre-pc-windows-11-a-distance.html</link>
      <pubDate>Thu, 18 Dec 2025 09:56:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316017</guid>
      <description>L&#8217;application Lien avec Windows, qui permet de connecter votre smartphone Android &#224; votre PC Windows 11 vient d&#8217;&#234;tre mise &#224; jour. Elle introduit une multitude de nouvelles fonctionnalit&#233;s, comme le partage du presse-papier, le verrouillage du PC &#224; distance, ou encore la possibilit&#233; de partager des fichiers d&#8217;un appareil &#224; l&#8217;autre.</description>
    </item>
    <item>
      <title>&#171; Tout le monde utilise &#187; l&#8217;IA : apr&#232;s la pol&#233;mique Baldur&#8217;s Gate 3, plusieurs studios brisent le silence</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2914497_tout-le-monde-utilise-lia-apres-la-polemique-baldurs-gate-3-plusieurs-studios-brisent-le-silence</link>
      <pubDate>Thu, 18 Dec 2025 09:56:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2914497_tout-le-monde-utilise-lia-apres-la-polemique-baldurs-gate-3-plusieurs-studios-brisent-le-silence</guid>
      <description>
Le bad buzz d&#233;clench&#233; par Larian Studios (Baldur's Gate) sur l'usage de l'IA par les studios de jeu vid&#233;o a cr&#233;&#233; le d&#233;bat. Le studio derri&#232;re Kingdom Come: Deliverance 2 apporte son soutien.
</description>
    </item>
    <item>
      <title>&#171;&#160;&#199;a ruine toutes les projections&#160;&#187; : comment la crise de la RAM va forcer les d&#233;veloppeurs &#224; optimiser leurs jeux bien en avance</title>
      <link>https://www.frandroid.com/produits-android/console/2914469_ca-ruine-toutes-les-projections-comment-la-crise-de-la-ram-va-forcer-les-developpeurs-a-optimiser-leurs-jeux-bien-en-avance</link>
      <pubDate>Thu, 18 Dec 2025 09:44:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2914469_ca-ruine-toutes-les-projections-comment-la-crise-de-la-ram-va-forcer-les-developpeurs-a-optimiser-leurs-jeux-bien-en-avance</guid>
      <description>
La p&#233;nurie de RAM va aussi toucher les d&#233;veloppeurs de jeux vid&#233;o, qui seront pour certains d'entre eux oblig&#233;s de revoir la mani&#232;re d'optimiser leurs titres dans cette p&#233;riode d'incertitude.
</description>
    </item>
    <item>
      <title>Pourquoi la France et Tesla sont les grands perdants du retour au thermique d&#233;cid&#233; par l&#8217;Europe</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2914413_pourquoi-la-france-et-tesla-sont-les-grands-perdants-du-retour-au-thermique-decide-par-leurope</link>
      <pubDate>Thu, 18 Dec 2025 09:44:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2914413_pourquoi-la-france-et-tesla-sont-les-grands-perdants-du-retour-au-thermique-decide-par-leurope</guid>
      <description>
Le revirement de l&#8217;Europe sur l&#8217;interdiction des voitures thermiques en 2035 ne fait pas que des heureux. C&#8217;est notamment le cas de la France, mais aussi d&#8217;un constructeur de voitures &#233;lectriques en particulier.
</description>
    </item>
    <item>
      <title>Voici les pannes de v&#233;lo les plus fr&#233;quentes en 2025 : le top 5 selon 13 971 r&#233;parations</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2914531_voici-les-pannes-de-velo-les-plus-frequentes-en-2025-le-top-5-selon-13-971-reparations</link>
      <pubDate>Thu, 18 Dec 2025 09:34:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2914531_voici-les-pannes-de-velo-les-plus-frequentes-en-2025-le-top-5-selon-13-971-reparations</guid>
      <description>
&#192; partir de l&#8217;analyse de 13 971 r&#233;parations r&#233;alis&#233;es entre d&#233;cembre 2024 et d&#233;cembre 2025, le r&#233;seau Roulez Jeunesse dresse un panorama int&#233;ressant des interventions les plus fr&#233;quentes sur les v&#233;los.
</description>
    </item>
    <item>
      <title>Deepfakes are no longer just a disinformation problem. They are your next supply chain risk</title>
      <link>https://www.fastcompany.com/91460661/deepfakes-business-supply-chain-risk-executives</link>
      <pubDate>2025-12-18T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91460661/deepfakes-business-supply-chain-risk-executives</guid>
      <description>Most companies are woefully unprepared, and the traditional cybersecurity playbook isn&#8217;t enough.
For years, deepfakes were treated as a political or social media oddity, a strange corner of the internet where celebrity faces (of women 99% of the time) were pasted onto fake videos (porn in 99% of the cases) and nobody quite knew what to do about it. But that framing is now dangerously outdated, because deepfakes have quietly evolved into something much more systemic: an operational risk for corporations, capable of corrupting supply chains, financial workflows, brand trust, and even executive d...</description>
    </item>
    <item>
      <title>Android 16 QPR3&#160;: voici les 5 premi&#232;res nouveaut&#233;s</title>
      <link>https://www.01net.com/actualites/android-16-qpr3-voici-premieres-nouveautes.html</link>
      <pubDate>Thu, 18 Dec 2025 09:27:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315991</guid>
      <description>Android 16 QPR3, la prochaine version de l'OS de Google, d&#233;voile d&#233;j&#224; quelques nouveaut&#233;s &#224; travers sa premi&#232;re b&#234;ta. On fait le point.</description>
    </item>
    <item>
      <title>La future BYD Dolphin G hybride marque un tournant historique : c&#8217;est la premi&#232;re voiture chinoise con&#231;ue pour l&#8217;Europe</title>
      <link>https://www.frandroid.com/marques/byd/2914355_la-future-byd-dolphin-g-hybride-marque-un-tournant-historique-cest-la-premiere-voiture-chinoise-concue-pour-leurope</link>
      <pubDate>Thu, 18 Dec 2025 09:27:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2914355_la-future-byd-dolphin-g-hybride-marque-un-tournant-historique-cest-la-premiere-voiture-chinoise-concue-pour-leurope</guid>
      <description>
D&#233;j&#224; leader mondial de la voiture &#233;lectrique, BYD veut d&#233;sormais frapper un grand coup en Europe en lan&#231;ant une compacte hybride rechargeable : la Dolphin G. C'est la premi&#232;re voiture de BYD con&#231;ue pour l'Europe et qui ne sera pas vendue en Chine selon la patronne du constructeur.
</description>
    </item>
    <item>
      <title>Save now on the next-gen AI workstation from Corsair that is designed for creators and developers</title>
      <link>https://www.techradar.com/computing/save-now-on-the-next-gen-ai-workstation-from-corsair-that-is-designed-for-creators-and-developers</link>
      <pubDate>Thu, 18 Dec 2025 09:26:02 +0000</pubDate>
      <guid isPermaLink="false">YQMGZqMJRb5peaetsmSjQd</guid>
      <description>Save now on the compact, next-gen AI workstation designed for creators and developers</description>
    </item>
    <item>
      <title>Ces AirPods 4 &#224; prix cass&#233; feront un excellent cadeau &#224; mettre sous le sapin de No&#235;l</title>
      <link>https://www.frandroid.com/bons-plans/2882467_ces-airpods-4-a-prix-casse-feront-un-excellent-cadeau-a-mettre-sous-le-sapin-de-noel</link>
      <pubDate>Thu, 18 Dec 2025 09:18:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2882467_ces-airpods-4-a-prix-casse-feront-un-excellent-cadeau-a-mettre-sous-le-sapin-de-noel</guid>
      <description>
Si vous souhaitez acheter des &#233;couteurs sans fil Apple pas chers pour accompagner votre iPhone, les AirPods 4 sont tout choisis. Ils sont une bonne affaire et la version sans ANC passe de 149 euros &#224; 109 euros seulement. 
</description>
    </item>
    <item>
      <title>Tesla va finalement produire ses batteries en Europe : pourquoi cela pourrait baisser le prix du Model Y en France</title>
      <link>https://www.frandroid.com/marques/tesla/2914327_tesla-va-finalement-produire-ses-batteries-en-europe-pourquoi-cela-pourrait-baisser-le-prix-du-model-y-en-france</link>
      <pubDate>Thu, 18 Dec 2025 09:13:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2914327_tesla-va-finalement-produire-ses-batteries-en-europe-pourquoi-cela-pourrait-baisser-le-prix-du-model-y-en-france</guid>
      <description>
C&#8217;est confirm&#233;, Tesla va fabriquer ses propres batteries dans son usine de Berlin pour ses voitures &#233;lectriques. La capacit&#233; annuelle sera cependant faible et ne devrait qu'atteindre les 8 GWh.
</description>
    </item>
    <item>
      <title>The best streaming deals: Get 50 percent off MasterClass subscriptions, plus save on Starz, Audible, Crunchyroll and others</title>
      <link>https://www.engadget.com/deals/the-best-streaming-deals-get-50-percent-off-masterclass-subscriptions-plus-save-on-starz-audible-crunchyroll-and-others-133028536.html?src=rss</link>
      <pubDate>Thu, 18 Dec 2025 09:01:25 +0000</pubDate>
      <guid isPermaLink="false">026fe1b5-ea22-49f6-8016-fd8686928f5c</guid>
      <description>Whether you&#8217;re a true cord-cutter or you just want to watch the next season of Stranger Things when it drops, everyone&#8217;s on the lookout for streaming deals nowadays. Plenty have chosen VOD and live TV streaming services over traditional cable in recent years, but the savings that choice got you just a few years ago have somewhat evaporated now. Companies like Netflix, Disney, Max and others have been consistently raising prices to the point where you may question if streaming is even worth it anymore.
We at Engadget still think so, for many reasons, but you can (and should) be smart with your ...</description>
    </item>
    <item>
      <title>Lovense Spinel Review: A Great Mini Sex Machine</title>
      <link>https://www.wired.com/review/lovense-spinel/</link>
      <pubDate>Thu, 18 Dec 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">6941c42b9f24e324b91b3787</guid>
      <description>The multi-stimulating sex machine can heat up, can be mounted via a suction cup, and is totally worth the splurge.</description>
    </item>
    <item>
      <title>Here&#8217;s how to get poached at work</title>
      <link>https://www.fastcompany.com/91453877/heres-how-to-get-poached-at-work</link>
      <pubDate>2025-12-18T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91453877/heres-how-to-get-poached-at-work</guid>
      <description>Big firms are fighting for talent and offering major perks to match. Here&#8217;s how you can position yourself to be in the middle of a bidding war.&#160; &#160;
Big firms are fighting for talent and offering major perks to match. Here&#8217;s how you can position yourself to be in the middle of a bidding war.&#160; &#160;</description>
    </item>
    <item>
      <title>How to find community as a solopreneur</title>
      <link>https://www.fastcompany.com/91458231/solopreneur-how-to-find-community</link>
      <pubDate>2025-12-18T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91458231/solopreneur-how-to-find-community</guid>
      <description>Here&#8217;s how to build a network that will have your back.
Running a solo business can feel like operating without a map at times. Sometimes you can stumble along the path, figuring things out as you go. Other days, you look around and realize that you&#8217;ve wandered pretty far off course.&#160;</description>
    </item>
  </channel>
</rss>
