<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 23 Dec 2025 07:27:53 GMT</lastBuildDate>
    <item>
      <title>Comment nettoyer et d&#233;sinfecter son smartphone, son clavier, sa manette, ses &#233;couteurs ou sa souris ?</title>
      <link>https://www.frandroid.com/comment-faire/tutoriaux/679024_nos-smartphones-claviers-manettes-ecouteurs-et-souris-sont-des-nids-a-bacteries-et-a-virus</link>
      <pubDate>Tue, 23 Dec 2025 07:16:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/comment-faire/tutoriaux/679024_nos-smartphones-claviers-manettes-ecouteurs-et-souris-sont-des-nids-a-bacteries-et-a-virus</guid>
      <description>
Voici quelques conseils pour nettoyer et d&#233;sinfecter votre &#233;cran de smartphone, vos &#233;couteurs, votre manette de jeu, votre tablette tactile, votre clavier ou votre souris.
</description>
    </item>
    <item>
      <title>Les t&#233;l&#233;s connect&#233;es de Samsung, LG et Sony accus&#233;es d&#8217;espionner les t&#233;l&#233;spectateurs</title>
      <link>https://www.01net.com/actualites/les-teles-connectees-de-samsung-lg-et-sony-accusees-despionner-les-telespectateurs.html</link>
      <pubDate>Tue, 23 Dec 2025 07:03:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316705</guid>
      <description>Les principaux constructeurs de t&#233;l&#233;s connect&#233;es vont devoir r&#233;pondre &#224; une accusation tr&#232;s s&#233;rieuse : leurs lucarnes espionneraient les t&#233;l&#233;spectateurs en r&#233;alisant en douce des captures d'&#233;cran de ce qu'ils regardent. De quoi alimenter les profils de suivi publicitaire des utilisateurs, et pire encore.</description>
    </item>
    <item>
      <title>Groupon Promo Codes: 50% Off in January 2026</title>
      <link>https://www.wired.com/story/groupon-promo-code/</link>
      <pubDate>Tue, 23 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">674f7c8fa6af00e18ee649c1</guid>
      <description>Unlock up to 50% off, 40% off packages, and 25% off with top Groupon coupon codes. Explore coupons to save extra on travel getaways, holiday gifts, spa days, and event tickets.</description>
    </item>
    <item>
      <title>Simon Sinek: Gen Z won&#8217;t work without a clear payout. Here&#8217;s why</title>
      <link>https://www.fastcompany.com/91465039/simon-sinek-gen-z-wont-work-without-a-clear-payout-heres-why</link>
      <pubDate>2025-12-23T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91465039/simon-sinek-gen-z-wont-work-without-a-clear-payout-heres-why</guid>
      <description>Business leaders say the reason makes perfect sense.
Gen Zers, who were practically born with smartphones and iPads in their hands, have grown up completely immersed in the information highway. Therefore, it should come as no big surprise that those born as digital natives&#8212;deeply connected to culture, trends, politics, and business&#8212;have different ideas about what their contributions to the world should look like. They deeply value work-life balance and they need to feel like the work they do has meaning.&#160;...</description>
    </item>
    <item>
      <title>Voici le meilleur PC portable de l&#8217;ann&#233;e &#8211; Frandroid Awards 2025</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2911721_voici-le-meilleur-pc-portable-de-lannee-frandroid-awards-2025</link>
      <pubDate>Tue, 23 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2911721_voici-le-meilleur-pc-portable-de-lannee-frandroid-awards-2025</guid>
      <description>
Le meilleur PC portable test&#233; cette ann&#233;e par la r&#233;daction de Frandroid est le Lenovo Yoga Slim 7i Aura. D&#233;couvrez pourquoi ce dernier a re&#231;u le Frandroid Awards avec Delos de sa cat&#233;gorie.
</description>
    </item>
    <item>
      <title>iOS 26.3&#160;: les &#233;couteurs Bluetooth tiers se connecteront aussi facilement que des AirPods sur votre iPhone</title>
      <link>https://www.01net.com/actualites/ios-26-3-les-ecouteurs-bluetooth-tiers-se-connecteront-aussi-facilement-que-des-airpods-sur-votre-iphone.html</link>
      <pubDate>Tue, 23 Dec 2025 06:47:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316748</guid>
      <description>Pour se mettre en conformit&#233; avec le DMA, Apple introduit dans iOS 26.3 quelques changements d&#8217;interop&#233;rabilit&#233; avec les accessoires tiers. Les montres connect&#233;es et autres casques sans fil se connecteront bient&#244;t &#224; votre iPhone aussi facilement que des AirPods.</description>
    </item>
    <item>
      <title>01net morning&#160;: une cyberattaque paralyse La Poste, James Bond chez Netflix, la fin du Steam Deck LCD</title>
      <link>https://www.01net.com/actualites/01net-morning-une-cyberattaque-paralyse-la-poste-james-bond-chez-netflix-la-fin-du-steam-deck-lcd.html</link>
      <pubDate>Tue, 23 Dec 2025 06:30:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316713</guid>
      <description>Bonjour &#224; tous, voici la matinale de 01net ! Qu&#8217;avez-vous manqu&#233; hier ? Retrouvez toute l&#8217;actu &#224; connaitre pour d&#233;marrer la journ&#233;e du bon pied !</description>
    </item>
    <item>
      <title>Arr&#234;tez de jeter votre argent : ce forfait &#224; moins de 5 &#8364; est largement suffisant pour le quotidien</title>
      <link>https://www.frandroid.com/bons-plans/2917941_arretez-de-jeter-votre-argent-ce-forfait-a-moins-de-5-e-est-largement-suffisant-pour-le-quotidien</link>
      <pubDate>Tue, 23 Dec 2025 06:22:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2917941_arretez-de-jeter-votre-argent-ce-forfait-a-moins-de-5-e-est-largement-suffisant-pour-le-quotidien</guid>
      <description>
YouPrice propose 40 Go sur le r&#233;seau de SFR pour seulement 4,99 euros par mois. Une offre qui pousse &#224; se demander si un forfait &#224; moins de 5 euros est suffisant pour les usages en 2025. 
</description>
    </item>
    <item>
      <title>30% Off Tempur-Pedic Promo Codes | December 2025</title>
      <link>https://www.wired.com/story/tempur-pedic-promo-code/</link>
      <pubDate>Tue, 23 Dec 2025 06:10:00 +0000</pubDate>
      <guid isPermaLink="false">6859959712304f4d67bd7fd3</guid>
      <description>Whether you&#8217;re looking to upgrade your mattress or swap out your bedding, browse our Tempur-Pedic coupons for up to $300 off and the best sleep of your life.</description>
    </item>
    <item>
      <title>Naturepedic Promo Codes and Deals: 20% Off</title>
      <link>https://www.wired.com/story/naturepedic-promo-code/</link>
      <pubDate>Tue, 23 Dec 2025 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">68b06d6eaaf2b3cf2410574c</guid>
      <description>Save on Naturepedic&#8217;s line of organic, thoughtfully crafted mattresses and bedding with our coupon codes for this month.</description>
    </item>
    <item>
      <title>'There were many years of issues that led to the situation we're in' &#8212; iRobot CEO on why the failed Amazon deal can't be blamed for the company's issues</title>
      <link>https://www.techradar.com/home/robot-vacuums/there-were-many-years-of-issues-that-led-to-the-situation-were-in-irobot-ceo-on-why-the-failed-amazon-deal-cant-be-blamed-for-the-companys-issues</link>
      <pubDate>Tue, 23 Dec 2025 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">Z3w9kNRtHpRgzz6mN6urS9</guid>
      <description>Expensive processes and a failure to listen to the customer set iRobot on its downward trajectory, says its CEO.</description>
    </item>
    <item>
      <title>How to wind down for the year</title>
      <link>https://www.fastcompany.com/91459882/how-to-wind-down-for-the-year</link>
      <pubDate>2025-12-23T06:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91459882/how-to-wind-down-for-the-year</guid>
      <description>With a little planning before you unplug, you can fully enjoy your holiday downtime and help ensure your return to work is smooth going.
December is here, and another year has blown by. Chances are, you&#8217;re going to get some time off for the holidays. If so, you may have a week(-ish) to recharge before you have to ramp back up in January.</description>
    </item>
    <item>
      <title>AU$50 off the AirPods Pro 3 is the Christmas (deal) miracle I've been waiting for</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/au-usd50-off-the-airpods-pro-3-is-the-christmas-deal-miracle-ive-been-waiting-for</link>
      <pubDate>Tue, 23 Dec 2025 05:48:10 +0000</pubDate>
      <guid isPermaLink="false">BPBuFeUN9NPGRwnDo88QL7</guid>
      <description>The AirPods Pro 3 have been relatively immune to discounts since they launched in September, which makes this AU$50 saving at Amazon one to get excited about.</description>
    </item>
    <item>
      <title>US bans new foreign-made drones and components</title>
      <link>https://www.engadget.com/big-tech/us-bans-new-foreign-made-drones-and-components-053201854.html?src=rss</link>
      <pubDate>Tue, 23 Dec 2025 05:32:01 +0000</pubDate>
      <guid isPermaLink="false">88e40196-19ce-44b1-8e8d-ff49103b1d32</guid>
      <description>The Federal Communications Commission has added foreign-made drones and their critical components to the agency&#8217;s &#8220;Covered List,&#8221; making them prohibited to import into the US. In a public notice published by the FCC, it said several national security agencies have determined that umanned aircraft systems (UAS) and their critical components produced in foreign countries pose an unacceptable risk to the national security of the United States.&#160;&#8220;UAS and UAS critical components must be produced in the United States,&#8221; the agency said. &#8220;UAS are inherently dual-use: they are both commercial platforms ...</description>
    </item>
  </channel>
</rss>
