<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 08 Dec 2025 10:29:12 GMT</lastBuildDate>
    <item>
      <title>+20% d&#232;s mi-d&#233;cembre ? Dell et Lenovo pr&#233;parent une hausse de prix brutale sur les PC</title>
      <link>https://www.frandroid.com/culture-tech/economie/2901509_20-des-mi-decembre-dell-et-lenovo-preparent-une-hausse-de-prix-brutale-sur-les-pc</link>
      <pubDate>Mon, 08 Dec 2025 10:24:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/economie/2901509_20-des-mi-decembre-dell-et-lenovo-preparent-une-hausse-de-prix-brutale-sur-les-pc</guid>
      <description>
La crise s'intensifie sur le march&#233; du PC. Apr&#232;s une hausse des prix de la RAM et du stockage, c'est maintenant au tour des PC d'&#234;tre touch&#233;s. Dell et Lenovo pourraient faire partie des premiers constructeurs &#224; augmenter leurs tarifs. 
</description>
    </item>
    <item>
      <title>Google Pixel&#160;: le retour de cette fonctionnalit&#233; va vous faire gagner un temps fou</title>
      <link>https://www.01net.com/actualites/google-pixel-retour-fonctionnalite-gagner-temps-fou.html</link>
      <pubDate>Mon, 08 Dec 2025 10:16:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314185</guid>
      <description>Une fonctionnalit&#233; tr&#232;s pratique fait son retour sur les Google Pixel r&#233;cents, apr&#232;s plusieurs disparitions &#233;tranges pendant sur les derni&#232;res versions b&#234;tas d&#8217;Android 16.</description>
    </item>
    <item>
      <title>Look out, the first teaser for Supergirl has arrived &#8211; and the DCU movie's actual trailer isn't far behind</title>
      <link>https://www.techradar.com/streaming/entertainment/look-out-the-first-teaser-for-supergirl-has-arrived-and-the-dcu-movies-actual-trailer-isnt-far-behind</link>
      <pubDate>Mon, 08 Dec 2025 10:10:43 +0000</pubDate>
      <guid isPermaLink="false">Rg4NJ7rgxXx52LcbwJfnc9</guid>
      <description>Supergirl's first teaser reveals when its full trailer will drop &#8211; and it could arrive on the same day as Avengers: Doomsday's trailer.</description>
    </item>
    <item>
      <title>Console sales surged over Black Friday, with PS5 taking the lion's share thanks to big discounts</title>
      <link>https://www.techradar.com/gaming/console-sales-surged-over-black-friday-with-ps5-taking-the-lions-share-thanks-to-big-discounts</link>
      <pubDate>Mon, 08 Dec 2025 10:10:10 +0000</pubDate>
      <guid isPermaLink="false">vFVASjzV66FUtaLje9uVaS</guid>
      <description>PS5 and Switch 2 prove immensely popular over Black Friday, with Xbox console sales trailing.</description>
    </item>
    <item>
      <title>Kick off the Holiday season with Battlefield 6&#8217;s next major update, adding a snow-covered Ice Lock variant of the Empire State map</title>
      <link>https://www.techradar.com/gaming/kick-off-the-holiday-season-with-battlefield-6s-next-major-update-adding-a-snow-covered-ice-lock-variant-of-the-empire-state-map</link>
      <pubDate>Mon, 08 Dec 2025 10:09:41 +0000</pubDate>
      <guid isPermaLink="false">M8GZ7XJzXKsNbSWP4hAD5C</guid>
      <description>Battlefield 6 Winter Offensive arrives December 9, adding new map conditions, and limited time modes. Here's what's being added.</description>
    </item>
    <item>
      <title>The 5 best Mint alternatives to replace the budgeting app that shut down</title>
      <link>https://www.engadget.com/apps/the-best-budgeting-apps-to-replace-mint-143047346.html?src=rss</link>
      <pubDate>Mon, 08 Dec 2025 10:01:27 +0000</pubDate>
      <guid isPermaLink="false">dd1282c3-99ed-4ddc-b8ab-c10c60d4e70c</guid>
      <description>It's been over one year since Intuit shut down the popular budgeting app Mint. I was a Mint user for many years; millions of other users like me enjoyed how easily Mint allowed us to track all accounts in one place and monitor credit scores. I also used it regularly to help me track spending, set goals like pay my mortgage down faster and with general money management.Ahead of Mint&#8217;s demise, I gave Credit Karma, Intuit&#8217;s other financial app, a try but found it to be a poor Mint alternative. So I set out to find a true replacement in another budgeting app. The following guide lays out my experi...</description>
    </item>
    <item>
      <title>Netflix Reportedly Greased the Skids for Its Warner Acquisition by Yukking It Up with Trump</title>
      <link>https://gizmodo.com/netflix-trump-2000696562</link>
      <pubDate>Mon, 08 Dec 2025 10:00:48 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000696562</guid>
      <description>How do you keep an antitrust-curious president from sinking your M&amp;E deal? This is reportedly how.</description>
    </item>
    <item>
      <title>The Longest Solar Eclipse for 100 Years Is Coming. Don&#8217;t Miss It</title>
      <link>https://www.wired.com/story/the-longest-solar-eclipse-for-100-years-is-coming-dont-miss-it/</link>
      <pubDate>Mon, 08 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">693038040b9a9057a4bf312a</guid>
      <description>NASA has announced when the longest total solar eclipse of the century will occur&#8212;and you won&#8217;t have to wait long. Here&#8217;s what you should know.</description>
    </item>
    <item>
      <title>On a vu les motos hydrog&#232;nes et hybrides de Honda, Yamaha, Suzuki et Kawasaki : le futur donne envie, mais questionne aussi</title>
      <link>https://www.frandroid.com/survoltes/moto/2901383_on-a-vu-les-motos-hydrogenes-et-hybrides-de-honda-yamaha-suzuki-et-kawasaki-le-futur-donne-envie-mais-questionne-aussi</link>
      <pubDate>Mon, 08 Dec 2025 09:53:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/moto/2901383_on-a-vu-les-motos-hydrogenes-et-hybrides-de-honda-yamaha-suzuki-et-kawasaki-le-futur-donne-envie-mais-questionne-aussi</guid>
      <description>
Et pourquoi pas des motos &#233;lectriques, hybrides ou m&#234;me&#8230; &#224; hydrog&#232;ne ? Les concepts des marques japonaises sont tous azimuts tourn&#233;s vers les &#233;nergies alternatives, levant le frein psychologique souvent constat&#233;. Revue des forces en pr&#233;sence au salon de Tokyo.
</description>
    </item>
    <item>
      <title>&#171;&#160;Une question de vie ou de mort&#160;&#187; : pourquoi Macron menace d&#233;sormais la Chine</title>
      <link>https://www.01net.com/actualites/une-question-de-vie-ou-de-mort-pourquoi-macron-menace-desormais-la-chine.html</link>
      <pubDate>Mon, 08 Dec 2025 09:52:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314163</guid>
      <description>De retour de P&#233;kin, Emmanuel Macron tape du poing sur la table. Il menace la Chine de droits de douane imminents pour sauver une industrie europ&#233;enne prise en &#233;tau.</description>
    </item>
    <item>
      <title>Plus d&#8217;appels, mais des SMS : cette panne Free Mobile touche des milliers d&#8217;abonn&#233;s</title>
      <link>https://www.frandroid.com/marques/free/2901671_plus-dappels-mais-des-sms-cette-panne-free-mobile-touche-des-milliers-dabonnes</link>
      <pubDate>Mon, 08 Dec 2025 09:51:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2901671_plus-dappels-mais-des-sms-cette-panne-free-mobile-touche-des-milliers-dabonnes</guid>
      <description>
Depuis plusieurs jours, de nombreux abonn&#233;s Free Mobile ne parviennent plus &#224; &#233;mettre ou recevoir des appels. Paradoxalement, les SMS continuent de fonctionner normalement. Face &#224; l&#8217;afflux de t&#233;moignages, l&#8217;op&#233;rateur a reconnu l'incident.
</description>
    </item>
    <item>
      <title>Nvidia fait moiti&#233; prix sur ses abonnements GeForce Now Performance et Ultime pour les f&#234;tes de fin d&#8217;ann&#233;e</title>
      <link>https://www.frandroid.com/marques/2624843_nvidia-fait-moitie-prix-sur-ses-abonnements-geforce-now-performance-et-ultime-pour-les-fetes-de-fin-dannee</link>
      <pubDate>Mon, 08 Dec 2025 09:49:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2624843_nvidia-fait-moitie-prix-sur-ses-abonnements-geforce-now-performance-et-ultime-pour-les-fetes-de-fin-dannee</guid>
      <description>
L'offre de Cloud gaming GeForce Now b&#233;n&#233;ficie des f&#234;tes de fin d'ann&#233;e pour afficher un prix mensuel in&#233;dit jusqu'&#224; maintenant. Que ce soit l'abonnement Performance pour jouer en 1440p ou l'Ultime pour de la 4K, ils sont &#224; -50 %. 
</description>
    </item>
    <item>
      <title>La fusion Netflix-Warner &#171;&#8201;pourrait poser des probl&#232;mes&#8201;&#187;, selon Donald Trump</title>
      <link>https://www.frandroid.com/services/svod/2901525_la-fusion-netflix-warner-pourrait-poser-des-problemes-selon-donald-trump</link>
      <pubDate>Mon, 08 Dec 2025 09:47:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2901525_la-fusion-netflix-warner-pourrait-poser-des-problemes-selon-donald-trump</guid>
      <description>
Une fusion &#224; 82&#160;milliards de dollars ne se fait jamais sans difficult&#233;. C&#8217;est la douloureuse r&#233;alit&#233; que s&#8217;est charg&#233; de rappeler le pr&#233;sident &#233;tasunien &#224; Netflix alors que le g&#233;ant du streaming tente de croquer Warner Bros.
</description>
    </item>
    <item>
      <title>Votre Google Pixel cachait une fonctionnalit&#233; secr&#232;te pour la Nintendo Switch 2</title>
      <link>https://www.frandroid.com/marques/google/2901425_votre-google-pixel-cachait-une-fonctionnalite-secrete-pour-la-nintendo-switch-2</link>
      <pubDate>Mon, 08 Dec 2025 09:45:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2901425_votre-google-pixel-cachait-une-fonctionnalite-secrete-pour-la-nintendo-switch-2</guid>
      <description>
Les smartphones Google Pixel sont maintenant compatibles avec la Nintendo Switch 2 qui peut les utiliser comme webcam via GameChat. 
</description>
    </item>
    <item>
      <title>Paramount aimerait piquer Warner Bros &#224; Netflix avec un rachat hostile</title>
      <link>https://www.frandroid.com/services/svod/2901597_paramount-aimerait-piquer-warner-bros-a-netflix-avec-un-rachat-hostile</link>
      <pubDate>Mon, 08 Dec 2025 09:44:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2901597_paramount-aimerait-piquer-warner-bros-a-netflix-avec-un-rachat-hostile</guid>
      <description>
Paramount n'a pas dig&#233;r&#233; l'accord de rachat entre Warner et Netflix. Le g&#233;ant de l'audiovisuel se verrait bien racheter Warner sans son consentement avec un rachat hostile.
</description>
    </item>
    <item>
      <title>Grande premi&#232;re pour Smart : 1 800 km d&#8217;autonomie avec la premi&#232;re berline de son histoire</title>
      <link>https://www.frandroid.com/marques/smart/2901535_grande-premiere-pour-smart-1-800-km-dautonomie-avec-la-premiere-berline-de-son-histoire</link>
      <pubDate>Mon, 08 Dec 2025 09:42:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/smart/2901535_grande-premiere-pour-smart-1-800-km-dautonomie-avec-la-premiere-berline-de-son-histoire</guid>
      <description>
Smart d&#233;voile les premi&#232;res images de sa nouvelle berline #6, qui a le droit &#224; une motorisation hybride rechargeable. Celle-ci offre une autonomie d&#233;passant les 1 800 kilom&#232;tres, dont 285 kilom&#232;tres en mode &#233;lectrique.
</description>
    </item>
    <item>
      <title>Pourquoi ce moteur r&#233;volutionnaire pourrait supprimer les freins des prochaines voitures &#233;lectriques de Mercedes</title>
      <link>https://www.frandroid.com/marques/mercedes-benz/2901493_pourquoi-ce-moteur-revolutionnaire-pourrait-supprimer-les-freins-des-prochaines-voitures-electriques-de-mercedes</link>
      <pubDate>Mon, 08 Dec 2025 09:37:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/mercedes-benz/2901493_pourquoi-ce-moteur-revolutionnaire-pourrait-supprimer-les-freins-des-prochaines-voitures-electriques-de-mercedes</guid>
      <description>
Mercedes vient de pr&#233;senter un moteur-roue, qui pourrait se retrouver dans ses prochaines voitures &#233;lectriques surpuissantes. Outre un immense gain de puissance, ses capacit&#233;s de r&#233;g&#233;n&#233;ration pourraient permettre de se passer compl&#232;tement de freins.
</description>
    </item>
    <item>
      <title>A new UK AI says it can beat ChatGPT &#8211; we tried it and here&#8217;s what we found</title>
      <link>https://www.techradar.com/ai-platforms-assistants/a-new-uk-ai-says-it-can-beat-chatgpt-we-tried-it-and-heres-what-we-found</link>
      <pubDate>Mon, 08 Dec 2025 09:34:31 +0000</pubDate>
      <guid isPermaLink="false">rLJQp5gqb6dvVAGokE8jEK</guid>
      <description>Locai Labs has launched the UK&#8217;s first homegrown AI assistant, claiming it outperforms GPT-5 and other global rivals in conversation, reasoning, and user preference.</description>
    </item>
    <item>
      <title>Down-ranking polarizing social media content can calm emotions, research shows</title>
      <link>https://www.fastcompany.com/91454767/down-ranking-polarizing-social-media-content-emotions-research</link>
      <pubDate>2025-12-08T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91454767/down-ranking-polarizing-social-media-content-emotions-research</guid>
      <description>The effects seen were similar across political affiliations, suggesting that the intervention benefits users regardless of their political party. 
Reducing the visibility of polarizing content in social media feeds can measurably lower partisan animosity. To come up with this finding, my colleagues and I developed a method that let us alter the ranking of people&#8217;s feeds, previously something only the social media companies could do....</description>
    </item>
    <item>
      <title>Meta reporte ses lunettes de r&#233;alit&#233; mixte pour &#171;&#160;peaufiner les d&#233;tails&#160;&#187;</title>
      <link>https://www.01net.com/actualites/meta-reporte-lunettes-realite-mixte-peaufiner-details.html</link>
      <pubDate>Mon, 08 Dec 2025 09:25:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314168</guid>
      <description>Meta revoit son calendrier de sortie. Pour limiter les d&#233;penses pr&#233;vues l'ann&#233;e prochaine, Meta a d&#233;cid&#233; de reporter la sortie de ses lunettes de r&#233;alit&#233; mixte taill&#233;es pour rivaliser avec le Vision Pro d'Apple. L'annonce donne plus de temps aux &#233;quipes du Reality Labs pour &#171; peaufiner les d&#233;tails&#160;&#187; du projet.</description>
    </item>
    <item>
      <title>The best Secret Santa gift ideas for 2025: Affordable gifts to give from Apple, Lego, Yeti and others</title>
      <link>https://www.engadget.com/the-best-secret-santa-gift-ideas-for-2025-affordable-gifts-to-give-from-apple-lego-yeti-and-others-130014197.html?src=rss</link>
      <pubDate>Mon, 08 Dec 2025 09:25:01 +0000</pubDate>
      <guid isPermaLink="false">d3419426-0b76-49ed-9322-bfc6839435ec</guid>
      <description>Secret Santa gift exchanges are supposed to be fun, but it&#8217;s easy to overthink it. You want a gift that feels thoughtful without being awkward, useful without being boring, and most importantly, affordable. The sweet spot is under $50, which is plenty to find something that fits your recipient&#8217;s personality. Whether you&#8217;re buying for a co-worker you only chat with at the coffee machine, a friend who already has everything or a cousin who never gives you ideas, there are clever options that will make them smile. These picks prove you don&#8217;t need to spend big to win at Secret Santa.
Best Secret S...</description>
    </item>
    <item>
      <title>Le rachat des v&#233;los &#233;lectriques Cowboy prend du retard, 8000 actionnaires l&#233;s&#233;s : la reprise mouvement&#233;e de la marque belge</title>
      <link>https://www.frandroid.com/marques/cowboy/2901595_le-rachat-des-velos-electriques-cowboy-prend-du-retard-8000-actionnaires-leses-la-reprise-mouvementee-de-la-marque-belge</link>
      <pubDate>Mon, 08 Dec 2025 09:23:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/cowboy/2901595_le-rachat-des-velos-electriques-cowboy-prend-du-retard-8000-actionnaires-leses-la-reprise-mouvementee-de-la-marque-belge</guid>
      <description>
Le rachat de Cowboy par le fran&#231;ais Rebirth, pr&#233;sent&#233; comme une &#233;tape cl&#233; pour assurer la survie du fabricant belge de v&#233;los &#233;lectriques, accuse un retard. Des documents consult&#233;s par le journal De Tijd r&#233;v&#232;lent m&#234;me que les investisseurs particuliers devraient perdre leur investissement dans le cadre de cette restructuration.
</description>
    </item>
    <item>
      <title>Volkswagen a trouv&#233; une solution pour baisser le prix de cette voiture &#233;lectrique</title>
      <link>https://www.frandroid.com/marques/volkswagen/2901421_volkswagen-a-trouve-une-solution-pour-baisser-le-prix-de-cette-voiture-electrique</link>
      <pubDate>Mon, 08 Dec 2025 09:02:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2901421_volkswagen-a-trouve-une-solution-pour-baisser-le-prix-de-cette-voiture-electrique</guid>
      <description>
L&#8217;Europe serait en train de r&#233;fl&#233;chir &#224; supprimer les surtaxes douani&#232;res sur les voitures &#233;lectriques de Volkswagen produites en Chine. Cela pourrait permettre &#224; ces derni&#232;res (pour le moment seul le Cupra Tavascan est concern&#233;) de co&#251;ter un peu moins cher chez nous.
</description>
    </item>
    <item>
      <title>Comparatif : quelles sont les meilleures enceintes Bluetooth en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guide-audio/722626_guide-meilleures-enceintes-portables</link>
      <pubDate>Mon, 08 Dec 2025 09:00:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-audio/722626_guide-meilleures-enceintes-portables</guid>
      <description>
Pratique, compacte, l'enceinte Bluetooth sans fil nous accompagne autant &#224; la maison qu'en d&#233;placement ou en vacances. On vous propose ici une s&#233;lection pointue des meilleures enceintes Bluetooth que nous avons pu tester.
</description>
    </item>
    <item>
      <title>Windows 11&#160;: les actions d&#8217;IA pourront &#234;tre d&#233;sactiv&#233;es</title>
      <link>https://www.01net.com/actualites/windows-11-les-actions-dia-pourront-etre-desactivees.html</link>
      <pubDate>Mon, 08 Dec 2025 08:55:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314174</guid>
      <description>Microsoft a confirm&#233; que les actions d&#8217;IA int&#233;gr&#233;es au menu contextuel du clic droit seront facultatives. Elles pourront &#234;tre d&#233;sactiv&#233;es dans les Param&#232;tres de Windows 11.</description>
    </item>
  </channel>
</rss>
