<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 20 Jan 2026 14:36:16 GMT</lastBuildDate>
    <item>
      <title>This Audible deal ends soon: Get three months of access for only $3</title>
      <link>https://www.engadget.com/deals/this-audible-deal-ends-soon-get-three-months-of-access-for-only-3-193859839.html?src=rss</link>
      <pubDate>Tue, 20 Jan 2026 14:31:26 +0000</pubDate>
      <guid isPermaLink="false">a8d99938-0b9f-4c17-b1d6-b88b320bc1cc</guid>
      <description>One way to read more in the new year is to incorporate audiobooks as part of your reading habit. Audible is having a sale right now that makes that easier and cheaper to do: you can get three months of access for only $1 per month, or a total of $3. The promotion runs through January 21.
An Audible subscription grants one audiobook per month to keep. This can be selected from a massive catalog of new releases and bestsellers. The collection here has just about everything. 


However, it's easy to plow through a single book in a month. Users also get streaming access to thousands of curated tit...</description>
    </item>
    <item>
      <title>Test de l&#8217;&#233;cran TCL 27G64 : le Mini-LED sur PC enfin abordable !</title>
      <link>https://www.frandroid.com/marques/tcl/2934029_test-de-lecran-tcl-27g64-le-mini-led-sur-pc-enfin-abordable</link>
      <pubDate>Tue, 20 Jan 2026 14:28:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tcl/2934029_test-de-lecran-tcl-27g64-le-mini-led-sur-pc-enfin-abordable</guid>
      <description>
D'ann&#233;e en ann&#233;e, on voit &#233;voluer les technologies de nos &#233;crans sur PC. On est pass&#233; par du LCD avec l'IPS et le VA, maintenant de l'OLED, du QD-OLED, mais quid du Mini-LED ? M&#234;me si la technologie n'est pas nouvelle, surtout sur t&#233;l&#233;viseur, elle n'est pas des plus communes pour autant sur PC. On teste donc ce TCL 27G64 pour exp&#233;rimenter une nouvelle fois ce type de dalle.
...</description>
    </item>
    <item>
      <title>Sony et TCL s&#8217;associent pour cr&#233;er une coentreprise dans le divertissement &#224; domicile</title>
      <link>https://www.frandroid.com/marques/sony/2949047_sony-et-tcl-sassocient-pour-creer-une-coentreprise-dans-le-divertissement-a-domicile</link>
      <pubDate>Tue, 20 Jan 2026 14:26:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2949047_sony-et-tcl-sassocient-pour-creer-une-coentreprise-dans-le-divertissement-a-domicile</guid>
      <description>
Sony Corporation et TCL Electronics Holdings Limited ont annonc&#233; la signature d'un protocole d'accord pour la cr&#233;ation d'une coentreprise reprenant l'activit&#233; Home Entertainment de Sony. TCL d&#233;tiendra 51% du capital tandis que Sony conservera 49%, avec un d&#233;marrage des activit&#233;s pr&#233;vu en avril 2027 sous r&#233;serve des approbations r&#233;glementaires.
</description>
    </item>
    <item>
      <title>Tremblement de terre&#160;: TCL met la main sur les t&#233;l&#233;viseurs Sony</title>
      <link>https://www.01net.com/actualites/tremblement-de-terre-tcl-met-la-main-sur-les-televiseurs-sony.html</link>
      <pubDate>Tue, 20 Jan 2026 14:25:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321258</guid>
      <description>Sony est une place forte sur le march&#233; du t&#233;l&#233;viseur, et le groupe japonais le restera dans les ann&#233;es &#224; venir&#8230; mais probablement un peu moins. Le constructeur est en effet formellement entr&#233; en discussion avec TCL pour cr&#233;er une coentreprise charg&#233;e de reprendre son activit&#233; de divertissement domestique &#8212; y compris les t&#233;l&#233;viseurs Bravia.</description>
    </item>
    <item>
      <title>Game Pass en janvier 2026 : on commence l&#8217;ann&#233;e avec du lourd dans cette premi&#232;re s&#233;lection de 2026 !</title>
      <link>https://www.frandroid.com/marques/microsoft/2931685_game-pass-en-janvier-2026-on-commence-lannee-avec-du-lourd-dans-cette-premiere-selection-de-2026</link>
      <pubDate>Tue, 20 Jan 2026 14:18:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2931685_game-pass-en-janvier-2026-on-commence-lannee-avec-du-lourd-dans-cette-premiere-selection-de-2026</guid>
      <description>
Microsoft vient de d&#233;voiler la premi&#232;re s&#233;lection de 2026 pour son Game Pass. Plus d'une dizaine de jeux sont &#224; l'honneur entre les titres AAA et quelques jeux ind&#233;s. Voici ce qui vous occupera les prochaines semaines.
</description>
    </item>
    <item>
      <title>Mode furtif et ch&#226;ssis blind&#233; : Garmin d&#233;voile la montre ultime pour les militaires, mais pas seulement</title>
      <link>https://www.frandroid.com/actualites-generales/2949031_mode-furtif-et-chassis-blinde-garmin-devoile-la-montre-ultime-pour-les-militaires-mais-pas-seulement</link>
      <pubDate>Tue, 20 Jan 2026 14:11:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2949031_mode-furtif-et-chassis-blinde-garmin-devoile-la-montre-ultime-pour-les-militaires-mais-pas-seulement</guid>
      <description>
Garmin a annonc&#233; le lancement de sa nouvelle Tactix 8 Cerakote. Comme le mod&#232;le classique, il s'agit d'une montre haut de gamme pens&#233;e avant tout pour un usage militaire. 
</description>
    </item>
    <item>
      <title>Cartes graphiques : pr&#233;parez-vous &#224; une longue travers&#233;e du d&#233;sert chez Nvidia et AMD</title>
      <link>https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2948849_cartes-graphiques-preparez-vous-a-une-longue-traversee-du-desert-chez-nvidia-et-amd</link>
      <pubDate>Tue, 20 Jan 2026 14:06:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2948849_cartes-graphiques-preparez-vous-a-une-longue-traversee-du-desert-chez-nvidia-et-amd</guid>
      <description>
Il faudra &#234;tre patient, tr&#232;s patient, avant de voir arriver de nouvelles cartes graphiques sur le march&#233;.
</description>
    </item>
    <item>
      <title>Soldes montres connect&#233;es : 13 promotions pour &#234;tre &#224; l&#8217;heure &#224; ses s&#233;ances de sport ! Voici notre top des meilleurs bons plans</title>
      <link>https://www.frandroid.com/bons-plans/2937331_soldes-montres-connectees-13-promotions-pour-etre-a-lheure-a-ses-seances-de-sport-voici-notre-top-des-meilleurs-bons-plans</link>
      <pubDate>Tue, 20 Jan 2026 14:02:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2937331_soldes-montres-connectees-13-promotions-pour-etre-a-lheure-a-ses-seances-de-sport-voici-notre-top-des-meilleurs-bons-plans</guid>
      <description>
Les soldes d'hiver permettent de faire de bonnes affaires sur de nombreux produits Tech, dont les montres connect&#233;es ! Ces accessoires lifestyle &amp; sport profitent eux aussi d&#8217;une vague de promotions : voici les offres &#224; retenir. 
</description>
    </item>
    <item>
      <title>Le g&#233;ant de l&#8217;informatique Capgemini va tailler dans ses effectifs fran&#231;ais</title>
      <link>https://www.01net.com/actualites/le-geant-de-linformatique-capgemini-va-tailler-dans-ses-effectifs-francais.html</link>
      <pubDate>Tue, 20 Jan 2026 14:01:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321233</guid>
      <description>Le leader du conseil informatique explique &#234;tre contraint de se transformer, du fait de l'IA et du contexte &#233;conomique morose.</description>
    </item>
    <item>
      <title>Netflix revises offer to pay all cash for Warner Bros to stave off Paramount</title>
      <link>https://techcrunch.com/2026/01/20/netflix-revises-offer-to-pay-all-cash-for-warner-bros-to-stave-off-paramount/</link>
      <pubDate>Tue, 20 Jan 2026 14:00:40 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083741</guid>
      <description>However, the streaming giant is still offering the same $27.75 the companies had agreed on for WBD's movie studio and streaming assets, and the deal continues to value the company at $82.7 billion.</description>
    </item>
    <item>
      <title>British Sci-Fi Legend &#8216;Blake&#8217;s 7&#8217; Might Get the Reboot Treatment</title>
      <link>https://gizmodo.com/blakes-7-reboot-peter-hoar-last-of-us-2000711587</link>
      <pubDate>Tue, 20 Jan 2026 14:00:09 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711587</guid>
      <description>Plus, Sam Esmail's mystery new movie gets a big cast update.</description>
    </item>
    <item>
      <title>New Prime Video thriller Steal is a heart-stopping high-stakes cash heist &#8212; but stick with the sloppy middle to get a gratifying payoff</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/steal-review</link>
      <pubDate>Tue, 20 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">wAarCMVVbJMGRv4BUrDCjE</guid>
      <description>I&#8217;ve never wanted to work in finance less after watching new Prime Video thriller Steal &#8212; but after this traumatic binge, I can probably add trade processing to my CV.</description>
    </item>
    <item>
      <title>Adobe unveils new AI-powered video editing tools for Premiere</title>
      <link>https://www.engadget.com/ai/adobe-unveils-new-ai-powered-video-editing-tools-for-premiere-140000970.html?src=rss</link>
      <pubDate>Tue, 20 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">cf95748e-44a1-4996-b2bd-fb254f9e5267</guid>
      <description>Adobe has announced updates for Premiere and After Effects, including new AI-powered tools that are meant to speed up your video editing tasks. In Premiere, the company&#8217;s video-editing software, it has unveiled a new AI-powered Object Mask feature that lets you easily pick and track persons or objects moving through your video clips. You simply have to hover over that object and click to generate a mask overlay in seconds. While the mask is supposed to be accurate from the start, you can adjust and resize it as needed. Adobe says the feature uses its own AI model for the feature and that the p...</description>
    </item>
    <item>
      <title>Vie au travail | Mon patron est fou de l&#8217;IA, mais je ne veux rien en savoir</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-01-20/vie-au-travail/mon-patron-est-fou-de-l-ia-mais-je-ne-veux-rien-en-savoir.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Tue, 20 Jan 2026 09:00:00 -0500</pubDate>
      <guid isPermaLink="false">97c58f44d4393346ba861f19a4a24b4c</guid>
      <description>Q. Je suis cadre interm&#233;diaire dans une grande entreprise, j&#8217;ai atteint mon plafond professionnel et j&#8217;en ai encore pour 10&#160;ans avant la retraite. Mon approche de la technologie est de laisser les autres endurer tous les bogues de la p&#233;riode de rodage, puis de jeter un coup d&#8217;&#339;il plus tard pour voir s&#8217;il y a un produit stable et vraiment utile. Par exemple, j&#8217;ai achet&#233; mon premier iPhone 10&#160;ans apr&#232;s son lancement. &#192; part un compte LinkedIn que j&#8217;utilise &#224; l&#8217;occasion pour retrouver d&#8217;anciens employ&#233;s, je me tiens loin des r&#233;seaux sociaux. J&#8217;ai une vie agr&#233;able et normale&#160;: amis, famille, voisi...</description>
    </item>
    <item>
      <title>Les PC portables bureautiques et gaming sont vendus au rabais lors des soldes : le TOP 10 des offres</title>
      <link>https://www.frandroid.com/bons-plans/2935325_les-pc-portables-bureautiques-et-gaming-sont-vendus-au-rabais-lors-des-soldes-le-top-10-des-offres</link>
      <pubDate>Tue, 20 Jan 2026 13:59:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2935325_les-pc-portables-bureautiques-et-gaming-sont-vendus-au-rabais-lors-des-soldes-le-top-10-des-offres</guid>
      <description>
Les soldes d&#8217;hiver 2026 battent encore leur plein, et la troisi&#232;me d&#233;marque d&#233;bute d&#232;s demain. Si vous pensiez que les meilleures affaires &#233;taient d&#233;j&#224; pass&#233;es, d&#233;trompez-vous : de tr&#232;s belles offres restent disponibles, notamment sur les laptops, qu&#8217;il s&#8217;agisse de mod&#232;les taill&#233;s pour le gaming ou d&#8217;ultraportables puissants pour le travail.
</description>
    </item>
    <item>
      <title>Indian vibe-coding startup Emergent raises $70M at $300M valuation from SoftBank, Khosla Ventures</title>
      <link>https://techcrunch.com/2026/01/20/indian-vibe-coding-startup-emergent-raises-70m-at-300m-valuation-from-softbank-khosla-ventures/</link>
      <pubDate>Tue, 20 Jan 2026 13:50:09 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083742</guid>
      <description>The funding comes as the startup claims it has scaled ARR to $50 million, and is targeting $100 million by April 2026.</description>
    </item>
    <item>
      <title>Le moins cher des balais aspirateurs Dyson perd 150 &#8364; de son prix pour les soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2716213_le-moins-cher-des-balais-aspirateurs-dyson-perd-150-de-son-prix-pour-les-soldes-dhiver</link>
      <pubDate>Tue, 20 Jan 2026 13:45:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2716213_le-moins-cher-des-balais-aspirateurs-dyson-perd-150-de-son-prix-pour-les-soldes-dhiver</guid>
      <description>
Dyson a revu sa copie du V8 avec cette version estampill&#233;e Advanced qui fait des progr&#232;s sur de nombreux niveaux. Un mod&#232;le vendu 399 euros actuellement remis&#233; &#224; 249 euros chez Boulanger pour les soldes d'hiver 2026.
</description>
    </item>
    <item>
      <title>How BYD beat Tesla</title>
      <link>https://www.theverge.com/podcast/864314/byd-tesla-china-evs-vergecast</link>
      <pubDate>2026-01-20T08:40:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864314</guid>
      <description>The Model S. The Mach-E. The Ioniq. The&#8230; Dolphin Surf? That's right, friends: There's a new biggest name in EVs, and it means you might soon be cruising down the highway in the Dolphin Surf. And you might love it. After years of Tesla dominance, a Chinese company called BYD has become the world's biggest [&#8230;]</description>
    </item>
    <item>
      <title>On a port&#233; cette veste v&#233;lo qui est une v&#233;ritable &#171; armure &#187; : elle renferme 5 protections invisibles mais rassurantes</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2948599_on-a-porte-cette-veste-velo-qui-est-une-veritable-armure-elle-renferme-5-protections-invisibles-mais-rassurantes</link>
      <pubDate>Tue, 20 Jan 2026 13:37:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2948599_on-a-porte-cette-veste-velo-qui-est-une-veritable-armure-elle-renferme-5-protections-invisibles-mais-rassurantes</guid>
      <description>
Aper&#231;ue et port&#233;e au salon Velofollies 2026, la veste v&#233;lo technique Hplus Pollux inclut des protections, en plus d&#8217;&#234;tre compl&#232;te pour une pratique tr&#232;s polyvalente.
</description>
    </item>
    <item>
      <title>Cette petite nouveaut&#233; de Steam va faire mal &#224; nos portefeuilles, mais plaisir &#224; nos amis</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/2949001_cette-petite-nouveaute-de-steam-va-faire-mal-a-nos-portefeuilles-mais-plaisir-a-nos-amis</link>
      <pubDate>Tue, 20 Jan 2026 13:36:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/2949001_cette-petite-nouveaute-de-steam-va-faire-mal-a-nos-portefeuilles-mais-plaisir-a-nos-amis</guid>
      <description>
Steam renforce la fonction d'envoi de cadeaux sur sa boutique. Vous pouvez d&#233;sormais offrir des packs compl&#233;tant une collection.
</description>
    </item>
    <item>
      <title>Far Cry 3: Classic Edition, Blood Dragon, and Primal are all getting a free 60FPS update on PS5 and Xbox Series X very soon</title>
      <link>https://www.techradar.com/gaming/far-cry-3-classic-edition-blood-dragon-and-primal-are-all-getting-a-free-60fps-update-on-ps5-and-xbox-series-x-very-soon</link>
      <pubDate>Tue, 20 Jan 2026 13:33:04 +0000</pubDate>
      <guid isPermaLink="false">eDtqxuB3zjCbp4Zvu5tbfD</guid>
      <description>Far Cry 3: Classic Edition, Far Cry 3: Blood Dragon, and Far Cry Primal are all getting a free 60FPS performance upgrade on January 21 for current-gen consoles.</description>
    </item>
    <item>
      <title>Dyson's PencilVac only just went on sale, but there's already a dupe on its way &#8212; here's what we know about Narwal's ultra-slim vacuum</title>
      <link>https://www.techradar.com/home/vacuums/dysons-pencilvac-only-just-went-on-sale-but-theres-already-a-dupe-on-its-way-heres-what-we-know-about-narwals-ultra-slim-vacuum</link>
      <pubDate>Tue, 20 Jan 2026 13:32:47 +0000</pubDate>
      <guid isPermaLink="false">2qyxsTNcN46PsUq9retpDe</guid>
      <description>Narwal promises longer runtimes and more suction power &#8211; but I'm skeptical it can deliver.</description>
    </item>
    <item>
      <title>Big Tech stocks fall as Trump&#8217;s Greenland ambitions rise: Is a &#8216;Sell America&#8217; trade to blame?</title>
      <link>https://www.fastcompany.com/91477567/tech-stocks-fall-today-trump-greenland-fears-sell-america-trade</link>
      <pubDate>2026-01-20T13:31:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91477567/tech-stocks-fall-today-trump-greenland-fears-sell-america-trade</guid>
      <description>Shares in Nvidia, Apple, Amazon, Microsoft, Meta Platforms, and Alphabet are all down today. Here&#8217;s what&#8217;s happening with the stock market.
Tuesday is the first trading day on U.S. stock markets since President Donald Trump escalated his threats over Greenland this weekend.</description>
    </item>
    <item>
      <title>Rad Power Bikes warehouse catches fire following flammable battery warnings</title>
      <link>https://www.engadget.com/transportation/rad-power-bikes-warehouse-catches-fire-following-flammable-battery-warnings-133056542.html?src=rss</link>
      <pubDate>Tue, 20 Jan 2026 13:30:56 +0000</pubDate>
      <guid isPermaLink="false">8cda54fb-9e83-4718-adf2-6735fb66cb30</guid>
      <description>In a strange twist of fate, a fire broke out this week at the Rad Power Bikes retail store warehouse in Huntington Beach, California, Electrek reports. The structural blaze came less than two months after the Consumer Product Safety Commission (CPSC) warned customers to "immediately stop" using and dispose of some of the company's e-bike batteries due to fire hazard. In December, Rad filed for Chapter 11 bankruptcy protection, stating it couldn't afford to recall the batteries.&#160;
The recent two-alarm fire hit a commercial complex with multiple businesses. Footage from the fire shows e-bikes out...</description>
    </item>
    <item>
      <title>One year of access to Monarch Money's budgeting app is down to $50 right now</title>
      <link>https://www.engadget.com/apps/one-year-of-access-to-monarch-moneys-budgeting-app-is-down-to-50-right-now-204507836.html?src=rss</link>
      <pubDate>Tue, 20 Jan 2026 13:30:35 +0000</pubDate>
      <guid isPermaLink="false">1764214b-3509-4628-8631-8692fa12e904</guid>
      <description>The start of the new year is a great time to get your finances in order, and a good budgeting app can help with that. Instead of laboring over a spreadsheet, you can try one of our favorite budgeting apps for less than usual. Monarch Money is running a sale that gives new users 50 percent off one year of the service, bringing the final cost down to just $50. Just use the code NEWYEAR2026 at checkout to get the discount.
Monarch Money makes for a capable and detailed budgeting companion. You can use the service via apps for iOS, Android, iPadOS or the web, and Monarch also offers a Chrome exten...</description>
    </item>
    <item>
      <title>Garmin surprend avec une nouvelle montre pour aider les golfeurs en herbe</title>
      <link>https://www.frandroid.com/marques/garmin/2948965_garmin-surprend-avec-une-nouvelle-montre-pour-aider-les-golfeurs-en-herbe</link>
      <pubDate>Tue, 20 Jan 2026 13:22:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/garmin/2948965_garmin-surprend-avec-une-nouvelle-montre-pour-aider-les-golfeurs-en-herbe</guid>
      <description>
Garmin a d&#233;voil&#233;, ce mardi, sa nouvelle montre de golf, la Garmin Approach J1. Celle-ci se destine aux jeunes golfeurs avec des fonctions orient&#233;es vers les d&#233;butants. 
</description>
    </item>
    <item>
      <title>Are these the super-cheap headphones to beat in 2026? One of the best budget audio makers has ANC cans for a silly price</title>
      <link>https://www.techradar.com/audio/wireless-headphones/are-these-the-super-cheap-headphones-to-beat-in-2026-one-of-the-best-budget-audio-makers-has-anc-cans-for-a-silly-price</link>
      <pubDate>Tue, 20 Jan 2026 13:14:43 +0000</pubDate>
      <guid isPermaLink="false">cPQry9F4SN65DgMpBHTos5</guid>
      <description>OneOdio's noise-cancelling over-ears deliver a big specification for a very small price</description>
    </item>
    <item>
      <title>Bouygues Telecom&#160;: une nouvelle Bbox 5G Wi-Fi 7 et un Wi-Fi de secours pour tous</title>
      <link>https://www.01net.com/actualites/bouygues-telecom-une-nouvelle-bbox-5g-wi-fi-7-et-un-wi-fi-de-secours-pour-tous.html</link>
      <pubDate>Tue, 20 Jan 2026 13:14:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321234</guid>
      <description>Bouygues Telecom commence la nouvelle ann&#233;e en fanfare avec non pas une nouveaut&#233;, mais deux ! L'op&#233;rateur a pr&#233;sent&#233; aujourd'hui une box diffusant la 5G dans toute la maison via le Wi-Fi 7, et une seconde box Wi-Fi de secours en 5G.</description>
    </item>
    <item>
      <title>Sony&#8217;s future TVs could be made by a new &#8216;joint venture&#8217; that&#8217;s 49% Sony, 51% TCL &#8212; it&#8217;s the biggest TV news of all 2026, and we&#8217;ve barely started the year</title>
      <link>https://www.techradar.com/televisions/sonys-future-tvs-could-be-largely-made-by-tcl-heres-what-that-could-mean-for-tv-purists</link>
      <pubDate>Tue, 20 Jan 2026 13:10:46 +0000</pubDate>
      <guid isPermaLink="false">ad52J8QxaZBb5mbxaKaikE</guid>
      <description>Everything from product development to customer service is included in this huge deal that shakes up the high-end TV world.</description>
    </item>
    <item>
      <title>I tested the Nutribullet Flex portable blender: a lightweight, convenient companion for smoothies on the go</title>
      <link>https://www.techradar.com/home/juicers-blenders/nutribullet-flex-review</link>
      <pubDate>Tue, 20 Jan 2026 13:06:39 +0000</pubDate>
      <guid isPermaLink="false">PYWdAdFN2J2mP3AbdwewG5</guid>
      <description>A compact blender that delivers silky, tasty smoothies and blended drinks at an affordable price</description>
    </item>
    <item>
      <title>Dreame just launched its best-ever robot vacuum &#8212; here are 3 ways the X60 improves on its predecessor</title>
      <link>https://www.techradar.com/home/robot-vacuums/dreame-just-launched-its-best-ever-robot-vacuum-here-are-3-ways-the-x60-improves-on-its-predecessor</link>
      <pubDate>Tue, 20 Jan 2026 13:06:20 +0000</pubDate>
      <guid isPermaLink="false">RnMB78ZjdPZZiF7A8HmCHg</guid>
      <description>From its streamlined look to its improved threshold-climbing abilities, this is a formidable new flagship from Dreame.</description>
    </item>
    <item>
      <title>The Disney+ and Hulu bundle is on sale for $10 for one month</title>
      <link>https://www.engadget.com/deals/the-disney-and-hulu-bundle-is-on-sale-for-10-for-one-month-192814872.html?src=rss</link>
      <pubDate>Tue, 20 Jan 2026 13:03:35 +0000</pubDate>
      <guid isPermaLink="false">c4b6e8a2-981f-4fc9-b476-d49dcaeed4ba</guid>
      <description>You have the best chance to save on streaming services during the holiday shopping season, but throughout the year, the occasional deal pops up that's worth considering. Case in point: this new Disney+ deal. New and eligible returning subscribers can sign up for the Disney+ Hulu bundle (with ads) for $10 for one month of access. That's $3 off the usual price of the bundle for one month, and more than 58 percent off if you consider the cost of each service individually (Disney+ at $12 per month and, separately, Hulu also at $12 per month).
We'd be remiss if we didn't mention that this isn't qui...</description>
    </item>
    <item>
      <title>The UK is mulling an Australia-like social media ban for users under 16</title>
      <link>https://www.engadget.com/social-media/the-uk-is-mulling-an-australia-like-social-media-ban-for-users-under-16-130000446.html?src=rss</link>
      <pubDate>Tue, 20 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">011203c1-8569-40a7-b3ed-747cfbfd0125</guid>
      <description>The UK government has announced a consultation, asking people for their feedback on whether to introduce a social media ban for children under 16 years old. It would also explore how to enforce that limit, how to limit tech companies from being able to access children&#8217;s data and how to limit &#8220;infinite scrolling,&#8221; as well as access to addictive online tools. In addition to seeking feedback from parents and young people themselves, the country&#8217;s ministers are going to visit Australia to see the effects of the country&#8217;s social media ban for kids, according to Financial Times. Australia's minimum ...</description>
    </item>
    <item>
      <title>Welcome to the &#8216;AI slop&#8217; security crisis &#8211; these 198 iOS apps were found leaking private chats and user locations</title>
      <link>https://www.techradar.com/computing/cyber-security/welcome-to-the-ai-slop-security-crisis-these-198-ios-apps-were-found-leaking-private-chats-and-user-locations</link>
      <pubDate>Tue, 20 Jan 2026 12:56:40 +0000</pubDate>
      <guid isPermaLink="false">jufdkJb29sW2TppiYZmrMS</guid>
      <description>Apps with over 20 million users have exposed 380 million private chat messages into the wild, research shows.</description>
    </item>
  </channel>
</rss>
