<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 02 Dec 2025 11:33:04 GMT</lastBuildDate>
    <item>
      <title>Melinda French Gates on Secrets: &#8216;Live a Truthful Life, Then You Don&#8217;t Have Any&#8217;</title>
      <link>https://www.wired.com/story/the-big-interview-podcast-melinda-french-gates/</link>
      <pubDate>Tue, 02 Dec 2025 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">6913a7362ed11672dce24dd0</guid>
      <description>On this week&#8217;s episode of The Big Interview podcast, the philanthropist offers her insights on billionaire donors, kids on phones, and the importance of women&#8217;s health care.</description>
    </item>
    <item>
      <title>Samsung Galaxy Z TriFold&#160;: la premi&#232;re prise en main en vid&#233;o souffle le chaud et le froid</title>
      <link>https://www.01net.com/actualites/samsung-galaxy-z-trifold-la-premiere-prise-en-main-en-video-souffle-le-chaud-et-le-froid.html</link>
      <pubDate>Tue, 02 Dec 2025 11:29:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312976</guid>
      <description>La premi&#232;re vid&#233;o de prise en main du Galaxy Z TriFold est tomb&#233;e. Si le c&#233;l&#232;bre youtubeur Mrwhosetheboss confirme l'effet &#171; waouh &#187; de l'&#233;cran 10 pouces, il pointe aussi du doigt des d&#233;fauts impossibles &#224; ignorer.</description>
    </item>
    <item>
      <title>DeepSeek just gave away an AI model that rivals GPT-5 &#8211; and it could change everything</title>
      <link>https://www.techradar.com/ai-platforms-assistants/gemini/deepseek-just-gave-away-an-ai-model-that-rivals-gpt-5-and-it-could-change-everything</link>
      <pubDate>Tue, 02 Dec 2025 11:22:56 +0000</pubDate>
      <guid isPermaLink="false">nbPcUJH2EyCha7Sj2YmrVc</guid>
      <description>DeepSeek&#8217;s new open source AI models combine elite performance with low costs, shaking up the global AI landscape.</description>
    </item>
    <item>
      <title>Your iPhone Already Has iPhone Fold Software, but Apple Won&#8217;t Let You Use It</title>
      <link>https://www.wired.com/story/your-iphone-already-has-iphone-fold-software-but-apple-wont-let-you-use-it/</link>
      <pubDate>Tue, 02 Dec 2025 11:15:00 +0000</pubDate>
      <guid isPermaLink="false">692982cad67037abad22c460</guid>
      <description>Recent exploits show iPadOS windows running on an iPhone, hinting at the future of Apple hardware and software alike&#8212;while also possibly revealing its incoming foldable phone experience.</description>
    </item>
    <item>
      <title>Pourquoi les moteurs thermiques modernes cassent comme du verre : cette enqu&#234;te d&#233;voile le scandale qui touche tous les constructeurs</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2895375_pourquoi-les-moteurs-thermiques-modernes-cassent-comme-du-verre-cette-enquete-devoile-le-scandale-qui-touche-tous-les-constructeurs</link>
      <pubDate>Tue, 02 Dec 2025 11:13:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2895375_pourquoi-les-moteurs-thermiques-modernes-cassent-comme-du-verre-cette-enquete-devoile-le-scandale-qui-touche-tous-les-constructeurs</guid>
      <description>
Une enqu&#234;te &#233;difiante venue des &#201;tats-Unis r&#233;v&#232;le pourquoi nos moteurs modernes cassent comme du verre. Spoiler : &#224; force de vouloir l&#8217;impossible, on a cr&#233;&#233; des machines autodestructrices.
</description>
    </item>
    <item>
      <title>La Chine est d&#233;sormais un poids lourd du march&#233; automobile mondial, comme le prouvent ces chiffres implacables</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2895185_la-chine-est-desormais-un-poids-lourd-du-marche-automobile-mondial-comme-le-prouvent-ces-chiffres-implacables</link>
      <pubDate>Tue, 02 Dec 2025 11:11:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2895185_la-chine-est-desormais-un-poids-lourd-du-marche-automobile-mondial-comme-le-prouvent-ces-chiffres-implacables</guid>
      <description>
Avec plus de 8 millions de voitures &#233;lectriques, hybrides et thermiques vendues, la Chine est tout doucement en train d&#8217;envahir le march&#233; automobile mondial. Et sa croissance devrait encore progresser au fil des mois.
</description>
    </item>
    <item>
      <title>Derni&#232;re chance pour les retardataires du Black Friday : voici les meilleures offres encore disponibles</title>
      <link>https://www.frandroid.com/bons-plans/2894961_le-black-friday-est-termine-mais-voici-les-offres-encore-en-ligne-qui-meritent-votre-attention</link>
      <pubDate>Tue, 02 Dec 2025 11:11:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2894961_le-black-friday-est-termine-mais-voici-les-offres-encore-en-ligne-qui-meritent-votre-attention</guid>
      <description>
C&#8217;est officiel&#8230; Le Black Friday ainsi que le Cyber Monday sont termin&#233;s&#8201;! Toutefois, plusieurs offres sur des produits Tech populaires sont encore valables chez les diff&#233;rents e-commer&#231;ants, pratique pour celles et ceux qui ont loup&#233; le coche.
</description>
    </item>
    <item>
      <title>A new Genshin Impact DualSense controller has been revealed and it's gorgeous &#8211; here's when you can preorder it</title>
      <link>https://www.techradar.com/gaming/playstation/a-new-genshin-impact-dualsense-controller-has-been-revealed-and-its-gorgeous-heres-when-you-can-preorder-it</link>
      <pubDate>Tue, 02 Dec 2025 11:09:55 +0000</pubDate>
      <guid isPermaLink="false">smrSzH2t2LVv7DVQuVHsCS</guid>
      <description>Sony has announced a new DualSense Wireless controller that will go on sale next week, and it's inspired by one of the most popular free-to-play games.</description>
    </item>
    <item>
      <title>La Nasa confirme un ingr&#233;dient inattendu sur un ast&#233;ro&#239;de : la vie n&#8217;a peut-&#234;tre pas commenc&#233; ici  !</title>
      <link>https://www.futura-sciences.com/sciences/actualites/origine-vie-nasa-confirme-ingredient-inattendu-asteroide-vie-na-peut-etre-pas-commence-ici-128124/#xtor%3DRSS-8</link>
      <pubDate>Tue, 02 Dec 2025 12:05:27 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/origine-vie-nasa-confirme-ingredient-inattendu-asteroide-vie-na-peut-etre-pas-commence-ici-128124/#xtor%3DRSS-8</guid>
      <description>Plusieurs acides amin&#233;s indispensables &#224; la vie ont d&#233;j&#224; &#233;t&#233; identifi&#233;s dans les &#233;chantillons ramen&#233;s sur Terre de l&#8217;ast&#233;ro&#239;de Bennu. Et aujourd&#8217;hui, un de plus. Alors, quelle importance&#8201;? Une grande. Car celui-ci n&#8217;est pas n&#8217;importe lequel.</description>
    </item>
    <item>
      <title>Cdiscount a attendu la fin du Black Friday pour brader la Nintendo Switch 2 avec Mario Kart World &#224; un prix jamais vu</title>
      <link>https://www.frandroid.com/bons-plans/2850515_cdiscount-a-attendu-la-fin-du-black-friday-pour-brader-la-nintendo-switch-2-avec-mario-kart-world-a-un-prix-jamais-vu</link>
      <pubDate>Tue, 02 Dec 2025 11:05:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850515_cdiscount-a-attendu-la-fin-du-black-friday-pour-brader-la-nintendo-switch-2-avec-mario-kart-world-a-un-prix-jamais-vu</guid>
      <description>
La Nintendo Switch 2 a connu de nombreuses promotions depuis sa sortie, notamment gr&#226;ce au Black Friday, mais c'est Cdiscount qui propose la meilleure offre disponible depuis sa sortie : 434 euros pour le pack avec Mario Kart World au lieu de 509 euros &#224; sa sortie. 
</description>
    </item>
    <item>
      <title>A Bed Just Saved This Man&#8217;s Life. Here&#8217;s How</title>
      <link>https://gizmodo.com/a-bed-just-saved-this-mans-life-heres-how-2000694099</link>
      <pubDate>Tue, 02 Dec 2025 11:05:13 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000694099</guid>
      <description>The bed's smart monitoring alerted the man to a life-threatening heart condition, according to his doctor.</description>
    </item>
    <item>
      <title>DOGE Isn&#8217;t Dead. Here&#8217;s What Its Operatives Are Doing Now</title>
      <link>https://www.wired.com/story/what-is-doge-doing-now/</link>
      <pubDate>Tue, 02 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">6926008577d34c1e4e3d74d7</guid>
      <description>Contrary to popular reports, DOGE has &#8220;burrowed into the agencies like ticks,&#8221; government sources tell WIRED.</description>
    </item>
    <item>
      <title>Has NTT sparked the long-awaited quantum-computing revolution?</title>
      <link>https://www.fastcompany.com/91448996/ntt-quantum-computing-qubit-ai</link>
      <pubDate>2025-12-02T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448996/ntt-quantum-computing-qubit-ai</guid>
      <description>Working with OptQC, the Japanese company wants to make a game-changing optical quantum computer that operates at room temperature.
For the past decade, quantum computing has struggled to balance promise and practicality. While the world&#8217;s most advanced systems remain engineering marvels, they&#8217;re bedeviled by the same flaw: the fragility of qubits&#8212;the fundamental units of quantum data&#8212;and the delicate hardware required to control them. A single fluctuation, for example, can collapse a quantum state, invalidating a computation....</description>
    </item>
    <item>
      <title>Your guide to Travel Tuesday&#8217;s best deals&#8212;and the sneaky pricing tricks to watch out for</title>
      <link>https://www.fastcompany.com/91451516/travel-tuesday-2025-deals-flights-tricks</link>
      <pubDate>2025-12-02T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91451516/travel-tuesday-2025-deals-flights-tricks</guid>
      <description>Yes, airlines and hotels are advertising major price cuts&#8212;but not all of them beat typical off-season fares. Here&#8217;s the truth behind today&#8217;s biggest offers.
In case you haven&#8217;t been deluged with enough day-themed holiday shopping sales yet, the travel industry will try to tempt you with some seemingly tantalizing travel offers on December 2, aka Travel Tuesday, traditionally the first Tuesday after Thanksgiving.&#160;...</description>
    </item>
    <item>
      <title>Sony a discr&#232;tement supprim&#233; la contrainte la plus d&#233;test&#233;e de la PS5 Slim. Mais pour combien de temps ?</title>
      <link>https://www.frandroid.com/marques/sony/2895273_sony-a-discretement-supprime-la-contrainte-la-plus-detestee-de-la-ps5-slim-mais-pour-combien-de-temps</link>
      <pubDate>Tue, 02 Dec 2025 10:52:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2895273_sony-a-discretement-supprime-la-contrainte-la-plus-detestee-de-la-ps5-slim-mais-pour-combien-de-temps</guid>
      <description>
C&#8217;est un d&#233;tail technique qui change tout. Le nouveau mod&#232;le de PS5 destin&#233; &#224; l'Europe semble s'affranchir d'une obligation : celle de valider son lecteur de disque en ligne. Fin du DRM ou simple ajustement logistique ? On fait le point.
</description>
    </item>
    <item>
      <title>Samsung officialise le Galaxy Z TriFold : un &#233;cran de 10 pouces qui tient dans la poche</title>
      <link>https://www.frandroid.com/marques/samsung/2894769_samsung-officialise-le-galaxy-z-trifold-un-ecran-de-10-pouces-qui-tient-dans-la-poche</link>
      <pubDate>Tue, 02 Dec 2025 10:50:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2894769_samsung-officialise-le-galaxy-z-trifold-un-ecran-de-10-pouces-qui-tient-dans-la-poche</guid>
      <description>
La course au "Tri-Fold" est lanc&#233;e. Quelques mois apr&#232;s le choc Huawei Mate XT, Samsung r&#233;plique enfin. Le Galaxy Z TriFold n'est pas un prototype : c'est un monstre de puissance avec Snapdragon 8 Elite et une charni&#232;re en titane. Mais attention, la facture risque d'&#234;tre sal&#233;e.
</description>
    </item>
    <item>
      <title>Jimmy Kimmel responds to Trumps offensive Thanksgiving rant</title>
      <link>https://mashable.com/video/jimmy-kimmel-trump-thanksgiving-tim-walz</link>
      <pubDate>Tue, 02 Dec 2025 10:44:34 +0000</pubDate>
      <guid isPermaLink="false">07shY1veZXt10NVKjoG5FY6</guid>
      <description>Jimmy Kimmel has responded to Donald Trump calling Governor Tim Walz the R slur in a Thanksgiving day rant on Truth Social.</description>
    </item>
    <item>
      <title>&#171; L&#8217;&#233;cran interne est si mou que j&#8217;ai r&#233;ussi &#224; faire de profondes entailles &#187;, voici la premi&#232;re prise en main du Samsung Galaxy Z TriFold</title>
      <link>https://www.frandroid.com/marques/2894853_le-pliant-definitif-premiere-prise-en-main-du-samsung-galaxy-z-trifold</link>
      <pubDate>Tue, 02 Dec 2025 10:43:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2894853_le-pliant-definitif-premiere-prise-en-main-du-samsung-galaxy-z-trifold</guid>
      <description>
Oubliez tout ce que vous savez sur le Z Fold 7. Le Galaxy Z TriFold arrive et il change les r&#232;gles du jeu. &#201;cran immense de 10 pouces, mode DeX natif et&#8230; un chargeur dans la bo&#238;te (incroyable, non ?). Mais attention, &#224; pr&#232;s de 3000 dollars, la moindre rayure sur cet &#233;cran ultra-tendre va vous co&#251;ter tr&#232;s cher. Un des premiers YouTubers a mis la main dessus.
...</description>
    </item>
    <item>
      <title>Cyber Monday 2025: Live updates on deals still live from Amazon, Apple, Best Buy, Walmart, and more</title>
      <link>https://mashable.com/live/cyber-monday-deals-still-live-2025</link>
      <pubDate>Tue, 02 Dec 2025 10:42:06 +0000</pubDate>
      <guid isPermaLink="false">012WfR92rPiTxNInRTGKo9c</guid>
      <description>Get live updates on Cyber Monday sales after the closing bell. We found last-chance savings of $1,000 on Samsung TVs and record prices on AirPods.</description>
    </item>
    <item>
      <title>NYT Mini crossword answers, hints for December 2, 2025</title>
      <link>https://mashable.com/article/nyt-mini-crossword-answers-hints-december-2-2025</link>
      <pubDate>Tue, 02 Dec 2025 10:35:35 +0000</pubDate>
      <guid isPermaLink="false">04T2VXXCjZH55GpHruAKzL6</guid>
      <description>Answers to each clue for the December 2, 2025 edition of NYT's The Mini crossword puzzle.</description>
    </item>
    <item>
      <title>Bascule chez BYD : l&#8217;invasion internationale commence vraiment et les voitures &#233;lectriques se vendent mieux que les hybrides</title>
      <link>https://www.frandroid.com/marques/byd/2895049_bascule-chez-byd-linvasion-internationale-commence-vraiment-et-les-voitures-electriques-se-vendent-mieux-que-les-hybrides</link>
      <pubDate>Tue, 02 Dec 2025 10:34:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2895049_bascule-chez-byd-linvasion-internationale-commence-vraiment-et-les-voitures-electriques-se-vendent-mieux-que-les-hybrides</guid>
      <description>
Si les r&#233;sultats de BYD &#233;taient en demi-teinte au 3&#7497; trimestre 2025, les choses semblent s&#8217;&#234;tre arrang&#233;es. Le g&#233;ant chinois a vu ses ventes de voitures &#233;lectriques s&#8217;envoler en novembre, et il cartonne surtout &#224; l&#8217;&#233;tranger.
</description>
    </item>
    <item>
      <title>The Google TV Streamer 4K is still at its best-ever price after Cyber Monday &#8212; save $25 at Amazon</title>
      <link>https://mashable.com/article/cyber-monday-deal-2025-google-tv-streamer-4k-still-available</link>
      <pubDate>Tue, 02 Dec 2025 10:31:01 +0000</pubDate>
      <guid isPermaLink="false">02AWotzVBVXJlt6iUYyy0cp</guid>
      <description>Get the best streaming deal still live after Cyber Monday. The Google TV Streamer 4K is on sale for $74.99 at Amazon.</description>
    </item>
    <item>
      <title>Hurdle hints and answers for December 2, 2025</title>
      <link>https://mashable.com/article/hurdle-hints-answers-december-2-2025</link>
      <pubDate>Tue, 02 Dec 2025 10:30:37 +0000</pubDate>
      <guid isPermaLink="false">07u6qjLpsYu3z66eD5mXCuJ</guid>
      <description>Hints and answers to today's Hurdle all in one place.</description>
    </item>
    <item>
      <title>Sonder, the WeWork of apartments, may be bankrupt, but the short-term rental business is healthy</title>
      <link>https://www.fastcompany.com/91447188/sonder-wework-hotel-marriott-rental</link>
      <pubDate>2025-12-02T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91447188/sonder-wework-hotel-marriott-rental</guid>
      <description>After Sonder&#8217;s sudden bankruptcy in November that left some guests in the lurch, the ghosts of the real estate tech bubble of the late 2010s reappeared. How the industry that remains aims to avoid the fate of those high-profile flops.
On November 14, hotel and short-term apartment rental chain Sonder Holdings filed for bankruptcy, just days after suddenly announcing it would be &#8220;winding down operations immediately,&#8221; abruptly kicking guests to the curb and sending employees scrambling for answers. The company had faced major, unforeseen costs from a deal signed in August 2024 to integrate reser...</description>
    </item>
    <item>
      <title>The Samsung 57-inch Odyssey Neo G9 gaming monitor is over $800 off after Cyber Monday</title>
      <link>https://mashable.com/article/cyber-monday-deal-2025-samsung-gaming-monitor-still-available</link>
      <pubDate>Tue, 02 Dec 2025 10:20:07 +0000</pubDate>
      <guid isPermaLink="false">01PXnuYZDSNEw1wLotdAmdb</guid>
      <description>The Samsung 57-inch Odyssey Neo G9 (G95NC) curved gaming monitor is still on sale at Amazon for $1,449.99 after Cyber Monday. This is 37% off its list price of $2,299.99.</description>
    </item>
    <item>
      <title>Swiss government urges people to ditch Microsoft 365 and others due to lack of proper encryption</title>
      <link>https://www.techradar.com/pro/security/swiss-government-urges-people-to-ditch-microsoft-365-and-others-due-to-lack-of-proper-encryption</link>
      <pubDate>Tue, 02 Dec 2025 10:20:00 +0000</pubDate>
      <guid isPermaLink="false">KS4yQgQENDccZRhbHD7iWS</guid>
      <description>A lack of E2EE and sufficient transparency has Switzerland worried about American hyperscalers.</description>
    </item>
    <item>
      <title>Jeep arrive fort en Europe avec ces deux nouvelles voitures &#233;lectriques pratiques qui sentent bon l&#8217;aventure</title>
      <link>https://www.frandroid.com/marques/jeep/2894977_jeep-arrive-fort-en-europe-avec-ces-deux-nouvelles-voitures-electriques-pratiques-qui-sentent-bon-laventure</link>
      <pubDate>Tue, 02 Dec 2025 10:14:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/jeep/2894977_jeep-arrive-fort-en-europe-avec-ces-deux-nouvelles-voitures-electriques-pratiques-qui-sentent-bon-laventure</guid>
      <description>
Si Jeep commercialise d&#233;j&#224; son Avenger, il veut &#233;toffer encore sa gamme de voitures &#233;lectriques en Europe. Au programme, deux SUV aux philosophies bien diff&#233;rentes qui verront le jour en 2026.
</description>
    </item>
    <item>
      <title>The Fitbit Versa 4 is still at its Cyber Monday price &#8212; save $80 for a limited time</title>
      <link>https://mashable.com/article/cyber-monday-deal-2025-fitbit-versa-4-still-available</link>
      <pubDate>Tue, 02 Dec 2025 10:14:45 +0000</pubDate>
      <guid isPermaLink="false">07wwRH82SFJmapil46DHy0h</guid>
      <description>Get the best Cyber Monday deal on Fitbit still live. Save 40% on the Fitbit Versa 4 at Amazon.</description>
    </item>
    <item>
      <title>Moon phase today: What the moon will look like on December 2</title>
      <link>https://mashable.com/article/moon-phase-today-dec-2</link>
      <pubDate>Tue, 02 Dec 2025 10:14:09 +0000</pubDate>
      <guid isPermaLink="false">02VqL1igIWX4Cjb6Yv5TJ9g</guid>
      <description>See the moon phase expected for December 2, 2025 as well as when the next full moon is expected.</description>
    </item>
    <item>
      <title>Taill&#233; pour la productivit&#233;, ce Dell 16 sur&#233;quip&#233; (Ryzen AI 7, 32 Go RAM, SSD 1 To) et dop&#233; &#224; l&#8217;IA s&#8217;all&#232;ge de 200 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2895025_taille-pour-la-productivite-ce-dell-16-surequipe-ryzen-ai-7-32-go-ram-ssd-1-to-et-dope-a-lia-sallege-de-200-e</link>
      <pubDate>Tue, 02 Dec 2025 10:12:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2895025_taille-pour-la-productivite-ce-dell-16-surequipe-ryzen-ai-7-32-go-ram-ssd-1-to-et-dope-a-lia-sallege-de-200-e</guid>
      <description>
Avec sa configuration pointue, le Dell 16 DC16256 est clairement un laptop id&#233;al pour le travail et la cr&#233;ation de contenus. Actuellement, la marque le propose en plus &#224; un excellent prix : 749 euros au lieu de 949 euros.
</description>
    </item>
    <item>
      <title>Applications de suivi de r&#232;gles&#160;: la r&#233;pression des fraudes sonne l&#8217;alerte</title>
      <link>https://www.01net.com/actualites/applications-de-suivi-de-regles-la-repression-des-fraudes-sonne-lalerte.html</link>
      <pubDate>Tue, 02 Dec 2025 10:12:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312966</guid>
      <description>Les applis de suivi du cycle menstruel ne doivent pas &#234;tre utilis&#233;es comme des moyens de contraception, rappelle le gendarme fran&#231;ais des consommateurs dans un communiqu&#233; publi&#233; ce mardi 2 d&#233;cembre.</description>
    </item>
    <item>
      <title>Cette nouvelle montre OnePlus profitera d&#8217;une fonction encore in&#233;dite sur les autres montres connect&#233;es</title>
      <link>https://www.frandroid.com/marques/oneplus/2895149_cette-nouvelle-montre-oneplus-profitera-dune-fonction-encore-inedite-sur-les-autres-montres-connectees</link>
      <pubDate>Tue, 02 Dec 2025 10:12:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/oneplus/2895149_cette-nouvelle-montre-oneplus-profitera-dune-fonction-encore-inedite-sur-les-autres-montres-connectees</guid>
      <description>
OnePlus a donn&#233; plus de d&#233;tails sur sa prochaine montre connect&#233;e, la OnePlus Watch Lite, attendue mi-d&#233;cembre. Elle sera notamment capable de se connecter simultan&#233;ment &#224; deux smartphones, dont un iPhone. 
</description>
    </item>
    <item>
      <title>The best Cyber Monday deal on the 15-inch MacBook Air M4 is going &#8212; act fast to save $250</title>
      <link>https://mashable.com/article/cyber-monday-deal-2025-macbook-air-15-inch-still-available</link>
      <pubDate>Tue, 02 Dec 2025 10:11:36 +0000</pubDate>
      <guid isPermaLink="false">05Kh4z7dN7VgxkVIQtLh30n</guid>
      <description>Get the best Cyber Monday deal on the 15-inch MacBook Air M4 is still live. Save 21% on the 15-inch 2025 MacBook Air at Amazon.</description>
    </item>
    <item>
      <title>400 apps dans le viseur&#160;: ce nouveau malware cherche &#224; vider votre compte et voler vos cryptos</title>
      <link>https://www.01net.com/actualites/400-apps-viseur-nouveau-malware-cherche-vider-votre-compte-voler-cryptos.html</link>
      <pubDate>Tue, 02 Dec 2025 10:02:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312928</guid>
      <description>Un nouveau malware Android, baptis&#233; Albiriox, permet &#224; des pirates de prendre le contr&#244;le total d&#8217;un smartphone. Le virus laisse surtout les hackers vider les comptes bancaires et les portefeuilles crypto sans &#233;veiller les soup&#231;ons. Il cible plus de 400 applications financi&#232;res.</description>
    </item>
    <item>
      <title>The Enshittification of Plex Is Kicking Off, Starting with Free Roku Users</title>
      <link>https://gizmodo.com/the-enshittification-of-plex-is-kicking-off-starting-with-free-roku-users-2000694283</link>
      <pubDate>Tue, 02 Dec 2025 10:00:40 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000694283</guid>
      <description>And it's just going to get worse from here.</description>
    </item>
    <item>
      <title>This Cyber Monday Roku Streaming Stick deal is still live &#8212; act fast to save over $10</title>
      <link>https://mashable.com/article/cyber-monday-deal-2025-roku-streaming-stick-still-available</link>
      <pubDate>Tue, 02 Dec 2025 10:00:38 +0000</pubDate>
      <guid isPermaLink="false">052Tp1BDVKD8Bl6O9KBnCjy</guid>
      <description>Get the best Cyber Monday streaming deal still live. Save 50% on the Roku Streaming Stick at Amazon this Black Friday.</description>
    </item>
    <item>
      <title>Nespresso pods recycled into compost will help restore California soil after devastating wildfires</title>
      <link>https://www.fastcompany.com/91450196/nespresso-coffee-pods-recycled-compost-la-soil-wildfires</link>
      <pubDate>2025-12-02T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91450196/nespresso-coffee-pods-recycled-compost-la-soil-wildfires</guid>
      <description>The Swiss brand will donate 100,000 pounds of compost, made from recycled coffee capsules, to a Los Angeles nonprofit that is planting trees across the city. 
If you&#8217;ve recycled a Nespresso capsule recently, your spent coffee grounds could help Los Angeles recover from the devastating January 2025 wildfires.</description>
    </item>
    <item>
      <title>Panera Bread announces huge changes to win back customers</title>
      <link>https://www.fastcompany.com/91450347/panera-huge-changes-win-back-customers</link>
      <pubDate>2025-12-02T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91450347/panera-huge-changes-win-back-customers</guid>
      <description>&#8216;The guest doesn&#8217;t dislike us, they just have forgotten about us,&#8217; the CEO said.
Panera Bread is&#160;spending millions&#160;to overhaul its menu in an attempt to lure back the customers it&#8217;s lost in recent years. In a downward fast-food spiral, Panera hasn&#8217;t significantly increased its revenue since 2023. Now, the company says it&#8217;s putting money back into better ingredients, staff, and its caf&#233;s.&#160;...</description>
    </item>
    <item>
      <title>TikTokers are experiencing  the &#8216;Japan effect&#8217;</title>
      <link>https://www.fastcompany.com/91450650/tiktokers-japan-effect-gen-z-matcha</link>
      <pubDate>2025-12-02T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91450650/tiktokers-japan-effect-gen-z-matcha</guid>
      <description>It&#8217;s indicative of a resurgent cultural fascination with the country.
Apparently any place looks better if you just say it&#8217;s Japan.&#160;</description>
    </item>
    <item>
      <title>MIT drug hunters are using AI to design completely new antibiotics</title>
      <link>https://www.fastcompany.com/91451161/mit-drug-hunters-are-using-ai-to-design-completely-new-antibiotics</link>
      <pubDate>2025-12-02T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91451161/mit-drug-hunters-are-using-ai-to-design-completely-new-antibiotics</guid>
      <description>In a university lab, an AI system generated millions of novel molecules to fight drug-resistant infections. And they&#8217;re working.
Inside a lab at the Massachusetts Institute of Technology late last year, scientists gave an AI system a new task: designing entirely new molecules for potential antibiotics from scratch. Within a day or two&#8212;following a few months of training&#8212;the algorithms had generated more than 29 million new molecules, unlike any that existed before....</description>
    </item>
    <item>
      <title>Apple was a role model, until it wasnt</title>
      <link>https://mashable.com/article/apple-role-model-opinion</link>
      <pubDate>Tue, 02 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">054GpBykizTzlGcFCb1wHZP</guid>
      <description>Online activist Lennon Torres on her disappointment with Apple after it yanked two gay dating sites from its app store.</description>
    </item>
    <item>
      <title>Marre de Google Assistant&#8201; sur vos enceintes Home ? Il existe une astuce pour (plus ou moins) forcer le passage sur Gemini</title>
      <link>https://www.frandroid.com/marques/google/2894991_marre-de-google-assistant-sur-vos-enceintes-home-il-existe-une-astuce-pour-plus-ou-moins-forcer-le-passage-sur-gemini</link>
      <pubDate>Tue, 02 Dec 2025 09:49:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2894991_marre-de-google-assistant-sur-vos-enceintes-home-il-existe-une-astuce-pour-plus-ou-moins-forcer-le-passage-sur-gemini</guid>
      <description>
Alors que Google Assistant continue pour le moment de squatter les enceintes intelligentes du g&#233;ant de la recherche, basculer vers la nouvelle IA Gemini n&#8217;a rien de tr&#232;s sorcier... Si vous avez de la chance.
</description>
    </item>
    <item>
      <title>Les voitures &#233;lectriques &#171; officielles &#187; chinoises arrivent en Europe avec une d&#233;cision forte de sens</title>
      <link>https://www.frandroid.com/marques/hongqi/2894907_les-voitures-electriques-officielles-chinoises-arrivent-en-europe-avec-une-decision-forte-de-sens</link>
      <pubDate>Tue, 02 Dec 2025 09:45:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/hongqi/2894907_les-voitures-electriques-officielles-chinoises-arrivent-en-europe-avec-une-decision-forte-de-sens</guid>
      <description>
Les constructeurs chinois arrivent massivement en Europe. Derni&#232;re preuve en date : le constructeur historique du gouvernement chinois, Hongqi, pr&#233;voit de construire une usine sur le Vieux continent.
</description>
    </item>
    <item>
      <title>Windows a du souci &#224; se faire ? Steam franchit un cap historique d&#8217;utilisateurs sur Linux</title>
      <link>https://www.frandroid.com/os/gnu-linux/2894905_windows-a-du-souci-a-se-faire-steam-franchit-un-cap-historique-dutilisateurs-sur-linux</link>
      <pubDate>Tue, 02 Dec 2025 09:43:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/gnu-linux/2894905_windows-a-du-souci-a-se-faire-steam-franchit-un-cap-historique-dutilisateurs-sur-linux</guid>
      <description>
Le syst&#232;me d'exploitation libre s&#233;duit de nouveaux joueurs et s'impose devant macOS en novembre 2025. 
</description>
    </item>
    <item>
      <title>Home Depot is still giving away free cordless tools after Black Friday &#8212; see BOGO offers on DeWalt, Ryobi, Milwaukee</title>
      <link>https://mashable.com/article/best-free-cordless-power-tools-deals-2025</link>
      <pubDate>Tue, 02 Dec 2025 09:38:13 +0000</pubDate>
      <guid isPermaLink="false">078JIXgOb3lMJSHOMzXQgrc</guid>
      <description>The Home Depot has some fantastic offers and buy-one-get-one deals for Black Friday shoppers. Here's how to get free cordless tools with your order.</description>
    </item>
    <item>
      <title>Windows 11 : la grosse mise &#224; jour de novembre est l&#224;, voici toutes les nouveaut&#233;s</title>
      <link>https://www.frandroid.com/marques/microsoft/2894959_windows-11-la-grosse-mise-a-jour-de-novembre-est-la-voici-toutes-les-nouveautes</link>
      <pubDate>Tue, 02 Dec 2025 09:35:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2894959_windows-11-la-grosse-mise-a-jour-de-novembre-est-la-voici-toutes-les-nouveautes</guid>
      <description>
Windows 11 continue de s'am&#233;liorer avec une nouvelle mise &#224; jour riche en fonctionnalit&#233;s, allant de l'am&#233;lioration de l'interface, de nouvelles options de r&#233;cup&#233;ration ou encore des nouveaut&#233;s bienvenues pour les joueurs.
</description>
    </item>
    <item>
      <title>Amazon repousse encore les limites de la livraison avec cette nouveaut&#233;</title>
      <link>https://www.01net.com/actualites/amazon-repousse-limites-livraison-avec-cette-nouveaute.html</link>
      <pubDate>Tue, 02 Dec 2025 09:35:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312930</guid>
      <description>Amazon teste un service de livraison ultra-rapide capable de livrer certains produits en seulement 30 minutes.</description>
    </item>
  </channel>
</rss>
