<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 08 Nov 2025 07:28:59 GMT</lastBuildDate>
    <item>
      <title>AT&amp;T Promo Codes and Bundle Deals: Save $50 in November</title>
      <link>https://www.wired.com/story/att-promo-code/</link>
      <pubDate>Sat, 08 Nov 2025 07:10:00 +0000</pubDate>
      <guid isPermaLink="false">67bccc2de807ab74e8f0139a</guid>
      <description>Whether you&#8217;re looking to upgrade your internet or get the latest phone, we&#8217;ve got you covered with our selection of AT&amp;T coupons and deals.</description>
    </item>
    <item>
      <title>Xiaomi HyperOS 3, Galaxy S26 Ultra, Proton &#8211; Tech&#8217;spresso</title>
      <link>https://www.frandroid.com/actualites-generales/2860697_xiaomi-hyperos-3-galaxy-s26-ultra-proton-techspresso</link>
      <pubDate>Sat, 08 Nov 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2860697_xiaomi-hyperos-3-galaxy-s26-ultra-proton-techspresso</guid>
      <description>
Ce vendredi 7 novembre 2025, l&#8217;actualit&#233; tech a &#233;t&#233; riche. Entre le d&#233;ploiement d&#8217;HyperOS 3 en France, les nouveaut&#233;s photo du Samsung Galaxy S26 Ultra et la belle alternative Proton face &#224; Google. Voici les articles qui ont fait le plus r&#233;agir aujourd&#8217;hui sur Frandroid.
</description>
    </item>
    <item>
      <title>L&#8217;arnaque au faux num&#233;ro fait des ravages en Europe, 850 millions d&#8217;euros envol&#233;s chaque ann&#233;e</title>
      <link>https://www.01net.com/actualites/arnaque-faux-numero-ravages-europe-850-millions-euros-envoles-chaque-annee.html</link>
      <pubDate>Sat, 08 Nov 2025 06:53:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304710</guid>
      <description>Europol tire la sonnette d&#8217;alarme face &#224; l&#8217;explosion des arnaques au faux num&#233;ro. L&#8217;agence europ&#233;enne de police met en garde contre la mont&#233;e fulgurante du &#171; spoofing &#187; d&#8217;identifiant d&#8217;appelant, une technique qui permet aux escrocs de faire appara&#238;tre un num&#233;ro de confiance  sur le t&#233;l&#233;phone de leurs victimes. Cette fraude co&#251;te d&#233;j&#224; plus de 850 millions d&#8217;euros par an en Europe....</description>
    </item>
    <item>
      <title>Ce PC portable Lenovo &#233;quip&#233; d&#8217;une RTX 5070 est LA bonne affaire avant le Black Friday [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2854363_plus-de-100-fps-sur-cyberpunk-2077-a-moins-de-1300-e-ce-pc-portable-lenovo-est-la-bonne-affaire-avant-le-black-friday</link>
      <pubDate>Sat, 08 Nov 2025 06:52:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2854363_plus-de-100-fps-sur-cyberpunk-2077-a-moins-de-1300-e-ce-pc-portable-lenovo-est-la-bonne-affaire-avant-le-black-friday</guid>
      <description>
Vous attendiez le Black Friday pour faire l&#8217;acquisition d&#8217;un nouvel ordinateur portable&#8239;? &#199;a tombe bien, Lenovo baisse le prix de la plupart de ses PC portables. Bureautique, autonomie, gaming ? Vous trouverez forc&#233;ment votre bonheur.
</description>
    </item>
    <item>
      <title>Boulanger multiplie d&#233;j&#224; les promotions au pr&#233;-Black Friday : les 16 deals &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2859523_boulanger-multiplie-deja-les-promotions-au-pre-black-friday-les-16-deals-a-retenir</link>
      <pubDate>Sat, 08 Nov 2025 06:52:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2859523_boulanger-multiplie-deja-les-promotions-au-pre-black-friday-les-16-deals-a-retenir</guid>
      <description>
Boulanger d&#233;gaine ses premiers bons plans avant l&#8217;heure : le pr&#233;-Black Friday est d&#233;j&#224; lanc&#233;. Smartphones, TV, PC portables&#8230; les r&#233;ductions pleuvent sur une large s&#233;lection de produits Tech, comme le flamboyant Pixel 10 Pro. Retrouvez ici les meilleures offres de l'e-commer&#231;ant. 
</description>
    </item>
    <item>
      <title>Ghost click farms: the invisible threat draining enterprise ad budgets</title>
      <link>https://www.techradar.com/pro/ghost-click-farms-the-invisible-threat-draining-enterprise-ad-budgets</link>
      <pubDate>Sat, 08 Nov 2025 06:49:43 +0000</pubDate>
      <guid isPermaLink="false">vzpwj3cC5giPCUj9VFqDx6</guid>
      <description>How ghost click farms hijack user devices to generate billions of fake ad impressions.</description>
    </item>
    <item>
      <title>Paramount Plus Coupon Codes and Deals: Up to 50% Off</title>
      <link>https://www.wired.com/story/paramount-plus-coupon-code/</link>
      <pubDate>Sat, 08 Nov 2025 06:30:00 +0000</pubDate>
      <guid isPermaLink="false">68a74f4bac61cbbb255166f7</guid>
      <description>Save on streaming with the latest Paramount+ promo codes and deals, including 50% off subscriptions, free trials, and more.</description>
    </item>
    <item>
      <title>NordVPN Coupons and Deals: 77% Off in November 2025</title>
      <link>https://www.wired.com/story/nordvpn-coupon/</link>
      <pubDate>Sat, 08 Nov 2025 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">67100c9a82459143cee93f27</guid>
      <description>Save up to 77% on 2-year plans and get 3 free months with our NordVPN discount codes.</description>
    </item>
    <item>
      <title>LegalZoom Promo Code: Exclusive 10% Off LLC Formations</title>
      <link>https://www.wired.com/story/legalzoom-promo-code/</link>
      <pubDate>Sat, 08 Nov 2025 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">67bccd2587d7d823b73305d9</guid>
      <description>Save on top services at LegalZoom, like LLC registration, incorporation, estate plans, and more with coupons and deals from WIRED.</description>
    </item>
    <item>
      <title>This cordless upright vacuum blends power and portability &#8211; it's perfect for small homes</title>
      <link>https://www.techradar.com/home/vacuums/shark-freestyle-max-cordless-upright-review</link>
      <pubDate>Sat, 08 Nov 2025 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">uPD9aA7yhN5Wozp8STXJj</guid>
      <description>The Shark Freestyle Max is nimble, very affordable, and packs a punch when it comes to cleaning power &#8211; just watch out for the short battery life.</description>
    </item>
    <item>
      <title>NYT Connections Sports Edition today: Hints and answers for November 8, 2025</title>
      <link>https://mashable.com/article/nyt-connections-sports-edition-hint-answer-today-november-8-2025</link>
      <pubDate>Sat, 08 Nov 2025 05:38:07 +0000</pubDate>
      <guid isPermaLink="false">00IoEZjJVpjOYAILkBstKTT</guid>
      <description>Connections: Sports Edition is a New York Times word game about finding common sports threads between words. How to solve the day's puzzle.</description>
    </item>
  </channel>
</rss>
