<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 18 Feb 2026 11:42:02 GMT</lastBuildDate>
    <item>
      <title>Gratuitement, Samsung double le stockage de ses Galaxy S26</title>
      <link>https://www.frandroid.com/marques/samsung/2981361_gratuitement-samsung-double-le-stockage-de-ses-galaxy-s26</link>
      <pubDate>Wed, 18 Feb 2026 11:32:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2981361_gratuitement-samsung-double-le-stockage-de-ses-galaxy-s26</guid>
      <description>
C'est un fait, les Galaxy S26 seront plus chers cette ann&#233;e. Pour autant, Samsung nous laisse une chance de limiter la casse avec une offre de lancement int&#233;ressante.
</description>
    </item>
    <item>
      <title>Are Mushroom Supplements Worth Taking? (2026)</title>
      <link>https://www.wired.com/story/the-wired-guide-to-mushroom-supplements/</link>
      <pubDate>Wed, 18 Feb 2026 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">6828a216a7d689978cd84703</guid>
      <description>We spoke with registered dietitians and tested popular formulas to break down the research behind functional fungi.</description>
    </item>
    <item>
      <title>Dell XPS 14 Review (2026): This Laptop Marks an Incredible Comeback</title>
      <link>https://www.wired.com/review/dell-xps-14-2026/</link>
      <pubDate>Wed, 18 Feb 2026 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">698bc7d70c7dc183182e2f16</guid>
      <description>Sporting a refined design and incredible integrated GPU performance, the Dell XPS 14 is the return to form I hoped it would be.</description>
    </item>
    <item>
      <title>Bouygues brade cette box fibre avec TV &#224; moins de 20 &#8364; avant de faire d&#233;finitivement dispara&#238;tre cette offre</title>
      <link>https://www.frandroid.com/bons-plans/2981101_bouygues-brade-cette-box-fibre-avec-tv-a-moins-de-20-e-avant-de-faire-definitivement-disparaitre-cette-offre</link>
      <pubDate>Wed, 18 Feb 2026 11:27:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2981101_bouygues-brade-cette-box-fibre-avec-tv-a-moins-de-20-e-avant-de-faire-definitivement-disparaitre-cette-offre</guid>
      <description>
Bouygues Telecom sacrifie son ancienne Bbox avec une r&#233;duction in&#233;dite. L'offre &#171; Fin de s&#233;rie &#187; tombe &#224; 19,99 euros par mois pendant un an, contre 24,99 euros habituellement.
</description>
    </item>
    <item>
      <title>Tesla stops using 'Autopilot' to promote its EVs in California</title>
      <link>https://www.engadget.com/transportation/evs/tesla-stops-using-autopilot-to-promote-its-evs-in-california-112533060.html?src=rss</link>
      <pubDate>Wed, 18 Feb 2026 11:25:33 +0000</pubDate>
      <guid isPermaLink="false">76a36148-4f8c-4ca3-9781-7e0263efe32e</guid>
      <description>Tesla has stopped using the term &#8220;Autopilot&#8221; to sell its cars in California, thereby avoiding a 30-day sales and manufacturing ban in the state. If you&#8217;ll recall, a California administrative law judge ruled in December that the automaker misled consumers by using the terms &#8220;Autopilot&#8221; and &#8220;Full Self-Driving.&#8221; The judge recommended the suspension, but the California DMV gave Tesla 60 days to remove any untrue and misleading language in its marketing materials. In its announcement, the DMV said Tesla has taken corrective action and has stopped using Autopilot for marketing. Prior to that, the au...</description>
    </item>
    <item>
      <title>VMware customers are still trying to ditch its software, two years after Broadcom acquisition</title>
      <link>https://www.techradar.com/pro/vmware-customers-are-still-trying-to-ditch-its-software-two-years-after-broadcom-acquisition</link>
      <pubDate>Wed, 18 Feb 2026 11:25:00 +0000</pubDate>
      <guid isPermaLink="false">tVM66GutyjnJVufYvgTXC7</guid>
      <description>VMware customers are still worried about price rises more than two years after its Broadcom acquisition.</description>
    </item>
    <item>
      <title>Majority's budget audio sub-brand just unveiled blindingly cheap speakers, MP3 players and soundbars &#8212; and I'm gonna need to hear them</title>
      <link>https://www.techradar.com/audio/majoritys-budget-audio-sub-brand-just-unveiled-blindingly-cheap-speakers-mp3-players-and-soundbars-and-im-gonna-need-to-hear-them</link>
      <pubDate>Wed, 18 Feb 2026 11:20:50 +0000</pubDate>
      <guid isPermaLink="false">SWneTbCWQsikdiCPeykVMa</guid>
      <description>Active bookshelf speakers for just &#163;70 (which is around $95 or AU$134)? They've got to be worth a test drive&#8230;</description>
    </item>
    <item>
      <title>France Identit&#233; : prendre l&#8217;avion avec son smartphone, c&#8217;est enfin pour cet &#233;t&#233;</title>
      <link>https://www.01net.com/actualites/france-identite-prendre-lavion-avec-son-smartphone-cest-enfin-pour-cet-ete.html</link>
      <pubDate>Wed, 18 Feb 2026 11:17:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326607</guid>
      <description>L&#8217;application France Identit&#233; franchit une nouvelle &#233;tape pratique. D&#232;s l&#8217;&#233;t&#233; 2026, elle permettra officiellement de justifier son identit&#233; lors de l&#8217;embarquement dans les a&#233;roports fran&#231;ais. Une simplification bienvenue pour les vols domestiques et certaines liaisons europ&#233;ennes.</description>
    </item>
    <item>
      <title>Perplexity joins anti-ad camp as AI companies battle over trust and revenue</title>
      <link>https://www.theverge.com/ai-artificial-intelligence/880562/perplexity-ditches-ai-ads</link>
      <pubDate>2026-02-18T06:02:22-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=880562</guid>
      <description>AI search startup Perplexity is distancing itself from ads amid fears users won't trust chatbots with an agenda to upsell. The move highlights an emerging crossroads for the AI industry as the sector's biggest players hunt for stable sources of income to bankroll massive spending, with giants like OpenAI leaning into ads and others like [&#8230;]</description>
    </item>
    <item>
      <title>Project Toscana : la r&#233;ponse de Google au Face ID d&#8217;Apple&#160;?</title>
      <link>https://www.frandroid.com/marques/google/2981463_project-toscana-la-reponse-de-google-au-face-id-dapple</link>
      <pubDate>Wed, 18 Feb 2026 11:00:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2981463_project-toscana-la-reponse-de-google-au-face-id-dapple</guid>
      <description>
Google teste en interne Project Toscana, un nouveau syst&#232;me de reconnaissance faciale destin&#233; aux prochains Pixel et &#224; certains Chromebooks, avec l&#8217;ambition affich&#233;e d&#8217;approcher les performances de Face ID, y compris en faible luminosit&#233;.
</description>
    </item>
    <item>
      <title>Meta will run AI in WhatsApp through NVIDIA's 'confidential computing'</title>
      <link>https://www.engadget.com/ai/meta-will-run-ai-in-whatsapp-through-nvidias-confidential-computing-110002283.html?src=rss</link>
      <pubDate>Wed, 18 Feb 2026 11:00:02 +0000</pubDate>
      <guid isPermaLink="false">e5907d93-e2c2-44df-917e-4aa6bce50ef5</guid>
      <description>Meta just announced a deal to buy "millions" of NVIDIA Blackwell and Rubin GPUs in a new long-term partnership. As part of that, the social media giant will deploy NVIDIA's Confidential Computing for WhatsApp, "enabling AI-powered capabilities across the messaging platform while ensuring user data confidentiality and integrity."
As part of the deal, Meta committed to using NVIDIA's Confidential Computing for WhatsApp messaging to allow AI inside the app while guaranteeing user data confidentiality. That technology will let Meta secure data during computation, not just when it's being shuttled ...</description>
    </item>
    <item>
      <title>How Two Zoomers Created RentAHuman, the First Marketplace for Bots to Hire Humans</title>
      <link>https://www.wired.com/story/ai-agent-rentahuman-bots-hire-humans/</link>
      <pubDate>Wed, 18 Feb 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">69865e85c3efe03ee31a6737</guid>
      <description>&#8220;We would [all] love to have an AI boss who wouldn't yell at you or gaslight you. Claude as a boss is the nicest guy ever.&#8221;</description>
    </item>
    <item>
      <title>'We will not stand by and watch': Netflix, Disney, and Warner Bros. threaten legal action over Seedance 2.0 videos starring Marvel, DC, and Stranger Things characters</title>
      <link>https://www.techradar.com/streaming/we-will-not-stand-by-and-watch-netflix-disney-and-warner-bros-threaten-legal-action-over-seedance-2-0-videos-starring-marvel-dc-and-stranger-things-characters</link>
      <pubDate>Wed, 18 Feb 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">YsTjKs3eMrPBsLt7KPdgvD</guid>
      <description>Furious Hollywood studios have criticized the use of their movies, shows, and characters in ByteDance's AI video generator.</description>
    </item>
    <item>
      <title>WordPress has a new AI assistant to help you build your dream website</title>
      <link>https://www.techradar.com/pro/wordpress-has-a-new-ai-assistant-to-help-you-build-your-dream-website</link>
      <pubDate>Wed, 18 Feb 2026 10:40:27 +0000</pubDate>
      <guid isPermaLink="false">B7QR8CdgzQny8ACNtR2AAU</guid>
      <description>WordPress AI Assistant will generate and edit text and images, but it will also make site changes far easier.</description>
    </item>
    <item>
      <title>Not&#233; 8/10 et avec un prix en chute libre de -61 %, l&#8217;aspirateur robot Dreame L40 Ultra lave aussi les sols, mais sans essorer le portefeuille</title>
      <link>https://www.frandroid.com/bons-plans/2981229_note-8-10-et-avec-un-prix-en-chute-libre-de-61-laspirateur-robot-dreame-l40-ultra-lave-aussi-les-sols-mais-sans-essorer-le-portefeuille</link>
      <pubDate>Wed, 18 Feb 2026 10:38:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2981229_note-8-10-et-avec-un-prix-en-chute-libre-de-61-laspirateur-robot-dreame-l40-ultra-lave-aussi-les-sols-mais-sans-essorer-le-portefeuille</guid>
      <description>
Le Dreame L40 Ultra est un aspirateur robot laveur premium qui reprend les caract&#233;ristiques du X40 Ultra pour proposer une aspiration et un lavage efficaces. Lanc&#233; &#224; 1200 euros, il se retrouve aujourd'hui &#224; seulement 465,12 euros sur le site de PC Componentes.
</description>
    </item>
    <item>
      <title>La Chine sonne la fin du tout-tactile dans les voitures : pourquoi l&#8217;Europe est aussi concern&#233;</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2981333_la-chine-sonne-la-fin-du-tout-tactile-dans-les-voitures-pourquoi-leurope-est-aussi-concerne</link>
      <pubDate>Wed, 18 Feb 2026 10:33:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2981333_la-chine-sonne-la-fin-du-tout-tactile-dans-les-voitures-pourquoi-leurope-est-aussi-concerne</guid>
      <description>
C&#8217;est un tournant majeur dans l&#8217;industrie automobile. Alors que la tendance &#233;tait au minimalisme extr&#234;me et aux habitacles &#233;pur&#233;s fa&#231;on Tesla, la Chine siffle la fin de la r&#233;cr&#233;ation. Le r&#233;gulateur chinois va imposer le retour des commandes physiques pour les fonctions critiques. Une d&#233;cision qui, par effet domino, va impacter nos voitures en Europe.
...</description>
    </item>
    <item>
      <title>An Inside Look at Lego&#8217;s New Tech-Packed Smart Brick</title>
      <link>https://www.wired.com/story/exclusive-inside-look-at-new-lego-smart-brick/</link>
      <pubDate>Wed, 18 Feb 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">698e53542a70579830563c83</guid>
      <description>Lego&#8217;s next release is a digital brick loaded with sensors that add new layers of interactivity to its play sets. WIRED got exclusive access to the Lego labs where the Smart Brick was born.</description>
    </item>
    <item>
      <title>Des d&#233;bits rarement vus dans l&#8217;Histoire des t&#233;l&#233;coms : Orange passe un cap symbolique en Espagne</title>
      <link>https://www.frandroid.com/marques/orange/2981073_des-debits-rarement-vus-dans-lhistoire-des-telecoms-orange-passe-un-cap-symbolique-en-espagne</link>
      <pubDate>Wed, 18 Feb 2026 10:26:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/orange/2981073_des-debits-rarement-vus-dans-lhistoire-des-telecoms-orange-passe-un-cap-symbolique-en-espagne</guid>
      <description>
D&#233;sormais disponible dans une quarantaine de villes espagnoles, la 5G Advanced d'Orange exploite le meilleur des bandes 3,5 GHz et 26 GHz pour accoucher, sur place, de d&#233;bits rarement vus dans l'histoire des t&#233;l&#233;coms, avec en l'occurrence plus de 5 Gb/s au compteur.
</description>
    </item>
    <item>
      <title>La compatibilit&#233; AirDrop d&#8217;Android s&#8217;&#233;tend &#224; de nouveaux smartphones</title>
      <link>https://www.01net.com/actualites/la-compatibilite-airdrop-dandroid-setend-a-de-nouveaux-smartphones.html</link>
      <pubDate>Wed, 18 Feb 2026 10:23:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326572</guid>
      <description>Google &#233;tend la compatibilit&#233; avec AirDrop de ses smartphones aux Pixel 9. Malheureusement, le Pixel 9a n'est pas concern&#233;.</description>
    </item>
    <item>
      <title>Tesla won&#8217;t use the term &#8216;Autopilot&#8217; in California anymore</title>
      <link>https://www.theverge.com/transportation/880548/tesla-autopilot-california-dmv-marketing-update</link>
      <pubDate>2026-02-18T05:21:28-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=880548</guid>
      <description>Tesla is no longer using the term "Autopilot" to describe the self-driving capabilities of its vehicles in California, avoiding a 30-day sales suspension in the state. The California Department of Motor Vehicles (DMV) announced that Tesla has taken corrective action after finding in December that the EV manufacturer's marketing was violating state law and misleading [&#8230;]...</description>
    </item>
    <item>
      <title>Ford passe enfin au futur dans ses voitures &#233;lectriques avec ces 2 technologies du Tesla Cybertruck</title>
      <link>https://www.frandroid.com/marques/ford/2981131_ford-passe-enfin-au-futur-dans-ses-voitures-electriques-avec-ces-2-technologies-du-tesla-cybertruck</link>
      <pubDate>Wed, 18 Feb 2026 10:19:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/ford/2981131_ford-passe-enfin-au-futur-dans-ses-voitures-electriques-avec-ces-2-technologies-du-tesla-cybertruck</guid>
      <description>
Le projet de voitures &#233;lectriques abordables de Ford continue. La marque vient de communiquer sur ses trouvailles visant &#224; diminuer la consommation de cette plateforme : l'a&#233;rodynamisme, le poids... et deux bonnes id&#233;es du Tesla Cybertruck.
</description>
    </item>
    <item>
      <title>&#171;&#160;Je ne sais pas combien de temps, nous pourrons tenir &#187;&#160;: le moteur de jeu Godot submerg&#233; par du mauvais code g&#233;n&#233;r&#233; par IA</title>
      <link>https://www.frandroid.com/produits-android/console/2981091_je-ne-sais-pas-combien-de-temps-nous-pourrons-tenir-le-moteur-de-jeu-godot-submerge-par-du-mauvais-code-genere-par-ia</link>
      <pubDate>Wed, 18 Feb 2026 10:15:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2981091_je-ne-sais-pas-combien-de-temps-nous-pourrons-tenir-le-moteur-de-jeu-godot-submerge-par-du-mauvais-code-genere-par-ia</guid>
      <description>
Appr&#233;ci&#233; des d&#233;veloppeurs ind&#233;pendants, le moteur de jeu Godot fait face &#224; une difficult&#233; li&#233;e &#224; l&#8217;intelligence artificielle. R&#233;cemment, une vague de contributeurs s&#8217;empare des LLM pour proposer du code g&#233;n&#233;r&#233; et non v&#233;rifi&#233;. Une pratique qui vient alourdir le travail des &#233;quipes de maintenance.
</description>
    </item>
    <item>
      <title>L&#8217;&#233;norme dette du n&#176;1 du v&#233;lo en Europe, Accell Group, presque r&#233;duite &#224; n&#233;ant gr&#226;ce &#224; une nouvelle d&#233;cision forte</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2981269_lenorme-dette-du-n1-du-velo-en-europe-accell-group-presque-reduite-a-neant-grace-a-une-nouvelle-decision-forte</link>
      <pubDate>Wed, 18 Feb 2026 10:13:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2981269_lenorme-dette-du-n1-du-velo-en-europe-accell-group-presque-reduite-a-neant-grace-a-une-nouvelle-decision-forte</guid>
      <description>
Accell Group, n&#176;1 du v&#233;lo en Europe, annonce un nouvel accord financier pr&#233;voyant un apport de fonds suppl&#233;mentaires et une r&#233;duction marqu&#233;e de sa dette. 
</description>
    </item>
    <item>
      <title>Fibre optique, spams, service client&#160;: ce que pensent vraiment les Fran&#231;ais de leur op&#233;rateur</title>
      <link>https://www.01net.com/actualites/fibre-optique-spams-service-client-ce-que-pensent-vraiment-les-francais-de-leur-operateur.html</link>
      <pubDate>Wed, 18 Feb 2026 10:12:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326469</guid>
      <description>Les Fran&#231;ais pl&#233;biscitent la fibre optique mais restent exasp&#233;r&#233;s par les spams t&#233;l&#233;phoniques. Qui d'Orange, Free, SFR ou Bouygues offre la meilleure exp&#233;rience ? Le verdict de l'Arcep est tomb&#233;.</description>
    </item>
    <item>
      <title>Samsung ne tient plus les prix de ses smartphones, &#231;a va s&#8217;envoler en 2026</title>
      <link>https://www.frandroid.com/marques/samsung/2981201_samsung-ne-tient-plus-les-prix-de-ses-smartphones-ca-va-senvoler-en-2026</link>
      <pubDate>Wed, 18 Feb 2026 10:12:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2981201_samsung-ne-tient-plus-les-prix-de-ses-smartphones-ca-va-senvoler-en-2026</guid>
      <description>
Samsung ne parviendrait plus &#224; faire face &#224; l'augmentation des prix composants. C'est la raison pour laquelle les Galaxy S26 ne seraient plus au m&#234;mes prix cette ann&#233;e.
</description>
    </item>
    <item>
      <title>How to watch USA vs. Sweden in mens ice hockey online for free</title>
      <link>https://mashable.com/article/usa-sweden-winter-ice-hockey-2026-live-stream-for-free</link>
      <pubDate>Wed, 18 Feb 2026 10:10:32 +0000</pubDate>
      <guid isPermaLink="false">06hbKp2PbpmIQVCyWQHuLls</guid>
      <description>How to watch ice hockey for free. Live stream USA vs. Sweden in men's ice hockey for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Cette alternative europ&#233;enne &#224; Google Chrome a vu sa croissance exploser depuis le retour de Donald Trump</title>
      <link>https://www.frandroid.com/android/applications/2981223_cette-alternative-europeenne-a-google-chrome-a-vu-sa-croissance-exploser-depuis-le-retour-de-donald-trump</link>
      <pubDate>Wed, 18 Feb 2026 10:08:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/applications/2981223_cette-alternative-europeenne-a-google-chrome-a-vu-sa-croissance-exploser-depuis-le-retour-de-donald-trump</guid>
      <description>
Le navigateur Vivaldi a observ&#233; une croissance record dans plusieurs pays europ&#233;ens depuis un an.
</description>
    </item>
    <item>
      <title>Windows 11&#160;: la prochaine mise &#224; jour va faire le plein de nouveaut&#233;s</title>
      <link>https://www.01net.com/actualites/windows-11-la-prochaine-mise-a-jour-va-faire-le-plein-de-nouveautes.html</link>
      <pubDate>Wed, 18 Feb 2026 10:08:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326587</guid>
      <description>Microsoft pr&#233;pare l&#8217;arriv&#233;e de la prochaine mise &#224; jour cumulative de Windows 11. Les nouveaut&#233;s introduites par cette release preview sont nombreuses, et commenceront &#224; arriver dans les prochaines semaines chez tous les utilisateurs.</description>
    </item>
    <item>
      <title>How to Choose the Bamboo Sheets for You (2026)</title>
      <link>https://www.wired.com/story/best-bamboo-sheets/</link>
      <pubDate>Wed, 18 Feb 2026 10:06:00 +0000</pubDate>
      <guid isPermaLink="false">698f623526ba8b913143f935</guid>
      <description>Bamboo makes some of the softest bedding you can find. Here&#8217;s how it&#8217;s made and how it&#8217;s different from cotton and linen bedding.</description>
    </item>
    <item>
      <title>Apple et Garmin ont du souci &#224; faire : Reebok d&#233;barque avec des montres Amoled &#224; moins de 100 euros</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2981095_apple-et-garmin-ont-du-souci-a-faire-reebok-debarque-avec-des-montres-amoled-a-moins-de-100-euros</link>
      <pubDate>Wed, 18 Feb 2026 10:05:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2981095_apple-et-garmin-ont-du-souci-a-faire-reebok-debarque-avec-des-montres-amoled-a-moins-de-100-euros</guid>
      <description>
Apr&#232;s une premi&#232;re bague connect&#233;e, Reebok a d&#233;voil&#233; quatre mod&#232;les de montres connect&#233;es, la Reebok Pulse, la Reebok Icon, la Reebok Stride et la Reebok Rush.
</description>
    </item>
    <item>
      <title>Botanicals, Ideas, and Star Wars make up some of the best new Lego sets of February</title>
      <link>https://mashable.com/article/best-new-lego-sets-february-2026</link>
      <pubDate>Wed, 18 Feb 2026 10:05:05 +0000</pubDate>
      <guid isPermaLink="false">00ycOZvmfMkmZhhicvI8z8Z</guid>
      <description>Lego's February releases include a set for car enthusiasts, new Smart Play options for Star Wars fans, and options for Disney lovers, too.</description>
    </item>
    <item>
      <title>Nvidia : ce test g&#233;ant prouve que beaucoup de joueurs se trompent sur le DLSS</title>
      <link>https://www.frandroid.com/actualites-generales/2981241_nvidia-ce-test-geant-prouve-que-beaucoup-de-joueurs-se-trompent-sur-le-dlss</link>
      <pubDate>Wed, 18 Feb 2026 10:04:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2981241_nvidia-ce-test-geant-prouve-que-beaucoup-de-joueurs-se-trompent-sur-le-dlss</guid>
      <description>
Plus de 1 000 utilisateurs ont r&#233;pondu &#224; un test &#224; l'aveugle comparant la qualit&#233; de rendu du DLSS 4.5, du FSR 4 et de la d&#233;finition native. La technologie de Nvidia a remport&#233; haut la main les suffrages.
</description>
    </item>
    <item>
      <title>The best wireless workout headphones for 2026</title>
      <link>https://www.engadget.com/audio/headphones/best-wireless-workout-headphones-191517835.html?src=rss</link>
      <pubDate>Wed, 18 Feb 2026 10:01:27 +0000</pubDate>
      <guid isPermaLink="false">556be2e0-db96-326d-b587-ca9cea0094cb</guid>
      <description>Whether you&#8217;re lifting, running or squeezing in a quick session between errands, the last thing you want is a cable getting in the way or earbuds that won&#8217;t stay put. The best wireless headphones make it easier to focus on your workout, but not every pair is built to handle sweat, motion and long sessions.Fitness-focused headphones put different demands on design and performance. Secure fit, water resistance and dependable battery life matter just as much as sound quality, especially if you plan to use them outside the gym as well. Some are tuned for awareness during outdoor runs, while others...</description>
    </item>
    <item>
      <title>Detroit Wants to Make Cars Normal Again</title>
      <link>https://gizmodo.com/detroit-wants-to-make-cars-normal-again-2000723248</link>
      <pubDate>Wed, 18 Feb 2026 10:00:19 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000723248</guid>
      <description>U.S. automotive executives are flirting with a crazy idea: sedans.</description>
    </item>
    <item>
      <title>How to thrive in the era of the &#8216;supermanager&#8217;</title>
      <link>https://www.fastcompany.com/91492747/how-to-thrive-in-the-era-of-the-supermanager</link>
      <pubDate>2026-02-18T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91492747/how-to-thrive-in-the-era-of-the-supermanager</guid>
      <description>As organizations eliminate layers of middle management, supermanagers are becoming the norm. Here&#8217;s what the shift means for burnout, productivity, and leadership.
If you&#8217;re a manager today, your job may well be changing. That is, if it hasn&#8217;t already.</description>
    </item>
    <item>
      <title>Are women board members risk averse or agents of innovation?</title>
      <link>https://www.fastcompany.com/91492753/women-board-members-risk-averse-or-agents-of-innovation</link>
      <pubDate>2026-02-18T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91492753/women-board-members-risk-averse-or-agents-of-innovation</guid>
      <description>The answer is both, according to a recent study. It all depends on how the company performs relative to its goals.
Do women board members make a company more innovative or risk-averse? The answer is both, according to our recent study. It all depends on how the company performs relative to its goals.</description>
    </item>
    <item>
      <title>This new REI short film might inspire you to run, but it will definitely make you cry</title>
      <link>https://www.fastcompany.com/91492912/this-new-rei-short-film-might-inspire-you-to-run-but-it-will-definitely-make-you-cry</link>
      <pubDate>2026-02-18T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91492912/this-new-rei-short-film-might-inspire-you-to-run-but-it-will-definitely-make-you-cry</guid>
      <description>&#8216;The Life We Have&#8217; tells the incredible story of a man living with Stage 4 cancer for more than two decades.
Rob Shaver is a 49-year-old retail worker who recently had a streak of running at least 1 mile every day for three years. He&#8217;s also been living with Stage 4 bone and lung cancer for more than 20 years.</description>
    </item>
    <item>
      <title>NASA will retest Artemis 2 moon rocket after discovering fueling issues</title>
      <link>https://mashable.com/article/artemis-2-wet-dress-rehearsal-livestream</link>
      <pubDate>Wed, 18 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00wHSCb3XhQznnuCALhyyF7</guid>
      <description>NASA needs a near-flawless fueling and launch countdown test to give Artemis 2, an astronaut flight around the moon, the green light.</description>
    </item>
    <item>
      <title>Why would Emerald Fennell cut Wuthering Heights grave scene?</title>
      <link>https://mashable.com/article/wuthering-heights-emerald-fennell-grave-scene</link>
      <pubDate>Wed, 18 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">03zgDGwRWKTdTLIJ1z2nI4d</guid>
      <description>A scene in Emily Bront&#235;'s "Wuthering Heights" inspired an infamous "Saltburn" moment, but it's not in Emerald Fennell's adaptation.</description>
    </item>
    <item>
      <title>How to unblock Pornhub for free in Kentucky</title>
      <link>https://mashable.com/article/unblock-pornhub-for-free-kentucky</link>
      <pubDate>Wed, 18 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">014ihSsHn3b7xEpSIVz0kc1</guid>
      <description>How to unblock porn for free in Kentucky. Unblock and watch Pornhub for free from anywhere in the world.</description>
    </item>
    <item>
      <title>How to watch Canada vs. USA in the womens ice hockey final online for free</title>
      <link>https://mashable.com/article/usa-canada-womens-ice-hockey-final-2026-live-stream-for-free</link>
      <pubDate>Wed, 18 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00Bb1EEERDZLBYrF6uREdsB</guid>
      <description>How to watch ice hockey for free. Live stream Canada vs. USA in the women's ice hockey final for free from anywhere in the world.</description>
    </item>
    <item>
      <title>This $65 handheld console puts more than 10,000 retro games in the palm of your hand</title>
      <link>https://mashable.com/article/feb-18-retropian-color-retro-handheld-gaming-console-white</link>
      <pubDate>Wed, 18 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">022aQEg2zYA7AMgJt5olZR0</guid>
      <description>Go back to the golden days of gaming with this Retropian Color Retro Handheld Gaming Console, just $64.97 through Feb. 22.</description>
    </item>
    <item>
      <title>How to delete your AdultFriendFinder account</title>
      <link>https://mashable.com/article/how-to-delete-adult-friend-finder-account</link>
      <pubDate>Wed, 18 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">07DwvOFERjIhxHfmZsAn83g</guid>
      <description>How to permanently delete your AdultFriendFinder profile or cancel your subscription.</description>
    </item>
    <item>
      <title>How to unblock ePorner for free</title>
      <link>https://mashable.com/article/how-to-unblock-eporner-free</link>
      <pubDate>Wed, 18 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">03tDUJnTR7qV5fpwRvNWcTO</guid>
      <description>How to unblock ePorner for free. Unblock ePorner for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Ive tested 25+ robot vacuum and mop combos, including CES 2026 models. Here are the top 6 to buy.</title>
      <link>https://mashable.com/roundup/best-robot-vacuum-mop</link>
      <pubDate>Wed, 18 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">06t9EaKN6ejSOzCAZrE8HpO</guid>
      <description>I've tested 25+ mopping robot vacuums on my own apartment floors. My top recommendations for 2026 include Dreame, Roborock, and Narwal.</description>
    </item>
    <item>
      <title>How to watch Finland vs. Switzerland in mens ice hockey online for free</title>
      <link>https://mashable.com/article/finland-switzerland-winter-ice-hockey-2026-live-stream-for-free</link>
      <pubDate>Wed, 18 Feb 2026 09:59:39 +0000</pubDate>
      <guid isPermaLink="false">00fVXW0hHrLCzORl6kFEY2d</guid>
      <description>How to watch ice hockey for free. Live stream Finland vs. Switzerland in men's ice hockey for free from anywhere in the world.</description>
    </item>
    <item>
      <title>How to watch Canada vs. Czechia in mens ice hockey online for free</title>
      <link>https://mashable.com/article/canada-czechia-winter-ice-hockey-2026-live-stream-for-free</link>
      <pubDate>Wed, 18 Feb 2026 09:55:05 +0000</pubDate>
      <guid isPermaLink="false">00VequtQIjIxop6FUoVHXz5</guid>
      <description>How to watch ice hockey for free. Live stream Canada vs. Czechia in men's ice hockey for free from anywhere in the world.</description>
    </item>
    <item>
      <title>You&#8217;ll be able to double your storage with Samsung Galaxy S26 pre-orders &#8212; but only in some regions</title>
      <link>https://www.techradar.com/phones/samsung-galaxy-phones/youll-be-able-to-double-your-storage-with-samsung-galaxy-s26-pre-orders-but-only-in-some-regions</link>
      <pubDate>Wed, 18 Feb 2026 09:53:20 +0000</pubDate>
      <guid isPermaLink="false">avUPihiveKEQ3S9MGvyVZm</guid>
      <description>Samsung has revealed some pre-order perks for the Samsung Galaxy S26 series, but a major one is missing in the US and Australia.</description>
    </item>
    <item>
      <title>How to watch Slovakia vs. Germany in mens ice hockey online for free</title>
      <link>https://mashable.com/article/slovakia-germany-winter-ice-hockey-2026-live-stream-for-free</link>
      <pubDate>Wed, 18 Feb 2026 09:49:37 +0000</pubDate>
      <guid isPermaLink="false">00uy3SygA4PXyNsMlASBn0e</guid>
      <description>How to watch ice hockey for free. Live stream Slovakia vs. Germany in men's ice hockey for free from anywhere in the world.</description>
    </item>
    <item>
      <title>NYT Connections Sports Edition today: Hints and answers for February 18, 2026</title>
      <link>https://mashable.com/article/nyt-connections-sports-edition-hint-answer-today-february-18-2026</link>
      <pubDate>Wed, 18 Feb 2026 09:49:32 +0000</pubDate>
      <guid isPermaLink="false">05niU9fXdpFeVCETqnzIEvQ</guid>
      <description>Connections: Sports Edition is a New York Times word game about finding common sports threads between words. How to solve the day's puzzle.</description>
    </item>
    <item>
      <title>&#192; moins de 400 &#8364;, plus d&#8217;excuses pour passer &#224; c&#244;t&#233; du Xiaomi Poco F8 Pro, le meilleur flagship killer de sa g&#233;n&#233;ration &#224; ce prix</title>
      <link>https://www.frandroid.com/bons-plans/2981085_a-moins-de-400-e-plus-dexcuses-pour-passer-a-cote-du-xiaomi-poco-f8-pro-le-meilleur-flagship-killer-de-sa-generation-a-ce-prix</link>
      <pubDate>Wed, 18 Feb 2026 09:49:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2981085_a-moins-de-400-e-plus-dexcuses-pour-passer-a-cote-du-xiaomi-poco-f8-pro-le-meilleur-flagship-killer-de-sa-generation-a-ce-prix</guid>
      <description>
Le Xiaomi Poco F8 Pro est un smartphone positionn&#233; comme un quasi-flagship avec un excellent &#233;cran, une autonomie parmi les meilleures et dot&#233; d'une puissance rare, &#224; retrouver pour 399,06 euros gr&#226;ce &#224; un code promo sur AliExpress, au lieu de 653 euros.
</description>
    </item>
    <item>
      <title>How to watch the 2026 winter sports ice hockey online for free</title>
      <link>https://mashable.com/article/ice-hockey-winter-sports-2026-live-stream-for-free</link>
      <pubDate>Wed, 18 Feb 2026 09:43:54 +0000</pubDate>
      <guid isPermaLink="false">04ZvvdyyYFyxIAfGHusCzEP</guid>
      <description>How to watch ice hockey for free. Live stream the 2026 winter sports ice hockey for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Cyberattaques chinoises&#160;: des espions ont exploit&#233; une faille Dell sans se faire remarquer pendant 18 mois</title>
      <link>https://www.01net.com/actualites/cyberattaques-chinoises-hackers-exploitent-faille-critique-dell-inapercus-mois.html</link>
      <pubDate>Wed, 18 Feb 2026 09:43:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326566</guid>
      <description>Depuis des mois, des cybercriminels chinois, sous les ordres de P&#233;kin, exploitent une faille critique d'un logiciel Dell pour mener des op&#233;rations d'espionnage &#224; grande &#233;chelle. D&#233;busqu&#233;e par Mandiant et Google Threat Intelligence Group, la cyberattaque est pass&#233;e inaper&#231;ue pendant 18&#160;mois&#8230;</description>
    </item>
    <item>
      <title>I tested the new GHD hair dryer and was blown away by a hurricane of power</title>
      <link>https://www.techradar.com/home/hair-care/ghd-speed-hair-dryer-review</link>
      <pubDate>Wed, 18 Feb 2026 09:42:30 +0000</pubDate>
      <guid isPermaLink="false">7RvSwmfEryGvxjZjfn6zCW</guid>
      <description>The GHD Speed packs a punch when it comes to power, and delivers plenty of precise control, too.</description>
    </item>
  </channel>
</rss>
