<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 26 Dec 2025 12:51:33 GMT</lastBuildDate>
    <item>
      <title>Noise Luna Ring (Gen 2) review: a subscription-free Oura rival that&#8217;s solid but not standout</title>
      <link>https://www.techradar.com/health-fitness/fitness-trackers/noise-luna-ring-gen-2-review-a-subscription-free-oura-rival-thats-solid-but-not-standout</link>
      <pubDate>Fri, 26 Dec 2025 12:30:00 +0000</pubDate>
      <guid isPermaLink="false">DbzgdycMth3kCjSZ9LFY6f</guid>
      <description>An updated version of the Luna Ring with a slimmer design, better battery and useful tools &#8211; but nothing game-changing in a crowded smart ring market.</description>
    </item>
    <item>
      <title>22 best deals from the Currys Boxing Day sale &#8212; save up to 40% on TVs, laptops, appliances, and more tech</title>
      <link>https://www.techradar.com/seasonal-sales/22-best-deals-from-the-currys-boxing-day-sale-save-up-to-40-percent-on-tvs-laptops-appliances-and-more-tech</link>
      <pubDate>Fri, 26 Dec 2025 12:29:55 +0000</pubDate>
      <guid isPermaLink="false">mizdcBRceRsjejfWbzsdMD</guid>
      <description>Currys has launched another round of Epic Deals as part of its Boxing Day sale, so I've searched through and picked out the 22 best tech offers.</description>
    </item>
    <item>
      <title>Fin et avec un &#233;cran lumineux, le Realme 14T est un smartphone encore plus accessible &#224; moiti&#233; prix</title>
      <link>https://www.frandroid.com/bons-plans/2921087_fin-et-avec-un-ecran-lumineux-le-realme-14t-est-un-smartphone-encore-plus-accessible-a-moitie-prix</link>
      <pubDate>Fri, 26 Dec 2025 12:27:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2921087_fin-et-avec-un-ecran-lumineux-le-realme-14t-est-un-smartphone-encore-plus-accessible-a-moitie-prix</guid>
      <description>
Le Realme 14T s'accompagne d'un &#233;cran Amoled et de l'intelligence artificielle pour magnifier vos photos. Chez AliExpress, il passe de 299 euros &#224; 136 euros. 
</description>
    </item>
    <item>
      <title>The John Lewis Boxing Day sale is live: see 19 expert-picked deals on TVs, laptops, headphones, and more</title>
      <link>https://www.techradar.com/seasonal-sales/the-john-lewis-boxing-day-sale-is-live-see-19-expert-picked-deals-on-tvs-laptops-headphones-and-more</link>
      <pubDate>Fri, 26 Dec 2025 12:06:13 +0000</pubDate>
      <guid isPermaLink="false">FxrsMRhg4XDZRtZQhSFasE</guid>
      <description>The John Lewis Boxing Day sale is live and features excellent record-low prices on appliances, TVs, laptops, and other categories today.</description>
    </item>
    <item>
      <title>Pr&#232;s d&#8217;un million de cadeaux de No&#235;l en vente&#160;: les Fran&#231;ais battent de nouveaux records</title>
      <link>https://www.01net.com/actualites/pres-dun-million-de-cadeaux-de-noel-en-vente-les-francais-battent-de-nouveaux-records.html</link>
      <pubDate>Fri, 26 Dec 2025 12:01:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317304</guid>
      <description>Les Fran&#231;ais ne veulent plus conserver les cadeaux de No&#235;l qui ne leur plaisent pas. D&#232;s le 25 d&#233;cembre au matin, des centaines de milliers de pr&#233;sents ont &#233;t&#233; mis en vente sur les plateformes d&#8217;occasion, comme eBay et Rakuten. La revente fait d&#233;sormais partie des traditions, et les Fran&#231;ais ne s'en cachent plus.</description>
    </item>
    <item>
      <title>Ricoh GR IV Review: Everyone's Favorite Pocket Camera Gets Better</title>
      <link>https://www.wired.com/review/ricoh-gr-iv-camera/</link>
      <pubDate>Fri, 26 Dec 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">693999453daeb4c7ebfe5f4e</guid>
      <description>Ricoh&#8217;s cult-inspiring pocketable camera gets a small update, with important improvements in autofocus and image quality.</description>
    </item>
    <item>
      <title>Could You Use a Rowboat to Walk on the Seafloor Like Jack Sparrow?</title>
      <link>https://www.wired.com/story/using-a-rowboat-to-walk-on-the-seafloor-like-jack-sparrow/</link>
      <pubDate>Fri, 26 Dec 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">693ae9345d5805445fb10a16</guid>
      <description>In Pirates of the Caribbean, Jack and Will use an overturned dinghy to hold air underwater. Madness or brilliance?</description>
    </item>
    <item>
      <title>Microsoft, drop your AI obsession and give us what we really want: a lightweight Windows 11 that nails the basics</title>
      <link>https://www.techradar.com/computing/windows/microsoft-drop-your-ai-obsession-and-give-us-what-we-really-want-a-lightweight-windows-11-that-nails-the-basics</link>
      <pubDate>Fri, 26 Dec 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">t9WQQ2ZhR3YDQBw3DwVaRS</guid>
      <description>Windows 11 needs some serious work - but there&#8217;s a fantastic alternative I bet Microsoft won&#8217;t even consider.</description>
    </item>
    <item>
      <title>This year I'm buying Blu-rays again like it's 2016 &#8211; here's why you should too</title>
      <link>https://www.techradar.com/televisions/blu-ray/this-year-im-buying-blu-rays-again-like-its-2016-heres-why-you-should-too</link>
      <pubDate>Fri, 26 Dec 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">2aExNXth2CyGvTQGR46BuP</guid>
      <description>I'll be spending less on streaming in 2026 and buying Blu-ray instead. It isn't just about nostalgia either &#8211;here's why it makes sense.</description>
    </item>
    <item>
      <title>How to find lost AirPods</title>
      <link>https://www.engadget.com/audio/headphones/how-to-find-lost-airpods-120000144.html?src=rss</link>
      <pubDate>Fri, 26 Dec 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">139557a7-79ce-4463-ab34-b90432bca595</guid>
      <description>Losing AirPods happens to the best of us. They&#8217;re small, they slide into couch cushions and they love disappearing into bags or pockets when you least expect it. Luckily, Apple&#8217;s Find My system makes it easy to track down misplaced AirPods, whether you dropped the case somewhere or can&#8217;t find one of the individual earbuds. With the right settings enabled, your iPhone can show the last place they were connected, play a sound to help you hunt them down or even guide you with on-screen directions. Here&#8217;s how to use Find My to locate lost AirPods and how to track down the left or right earbud if o...</description>
    </item>
    <item>
      <title>Ran&#231;on de la gloire, ce g&#233;ant des puces souffre d&#8217;une demande trop agressive&#8230; et des cons&#233;quences qui vont avec</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/processeurs/2921103_rancon-de-la-gloire-ce-geant-des-puces-souffre-dune-demande-trop-agressive-et-des-consequences-qui-vont-avec</link>
      <pubDate>Fri, 26 Dec 2025 11:32:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/processeurs/2921103_rancon-de-la-gloire-ce-geant-des-puces-souffre-dune-demande-trop-agressive-et-des-consequences-qui-vont-avec</guid>
      <description>
TSMC commencerait-il &#224; montrer des signes de faiblesse ? Sans fl&#233;chir pour l'instant, loin de l&#224;, l'entreprise souffre en tout cas de son statut de leader et des cons&#233;quences qui vont de paire avec une demande en semi-conducteurs qualifi&#233;e de &#171; trop agressive &#187;.
</description>
    </item>
    <item>
      <title>Sleep Number P6 Smart Bed Review: Advanced and Adaptive</title>
      <link>https://www.wired.com/review/sleep-number-p6-smart-bed/</link>
      <pubDate>Fri, 26 Dec 2025 11:32:00 +0000</pubDate>
      <guid isPermaLink="false">68f12c0b9553f99ddef6a950</guid>
      <description>This legacy brand brings its beds into the modern era with 100 firmness levels and in-depth sleep tracking.</description>
    </item>
    <item>
      <title>Amazon fait un super prix ce SSD externe ultra&#8209;rapide de 4 To avant la flamb&#233;e des prix du stockage</title>
      <link>https://www.frandroid.com/bons-plans/2910611_amazon-fait-un-super-prix-ce-ssd-externe-ultrarapide-de-4-to-avant-la-flambee-des-prix-du-stockage</link>
      <pubDate>Fri, 26 Dec 2025 11:31:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2910611_amazon-fait-un-super-prix-ce-ssd-externe-ultrarapide-de-4-to-avant-la-flambee-des-prix-du-stockage</guid>
      <description>
&#192; l&#8217;heure o&#249; les prix de la m&#233;moire vive s&#8217;envolent et que la p&#233;nurie menace les composants, le Crucial X10 Pro se pr&#233;sente comme une solution de stockage rapide, robuste et abordable. Actuellement en promotion dans sa version 4 To, ce SSD externe devient un alli&#233; pr&#233;cieux.
</description>
    </item>
    <item>
      <title>US Trade Dominance Will Soon Begin to Crack</title>
      <link>https://www.wired.com/story/us-trade-dominance-will-begin-to-crack/</link>
      <pubDate>Fri, 26 Dec 2025 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">6940346f0bcd15dc053736b7</guid>
      <description>Savvy countries will discover there&#8217;s a way to mitigate the harm incurred by Trump&#8217;s tariffs&#8212;and it&#8217;ll boost their own economies while making goods cheaper too.</description>
    </item>
    <item>
      <title>La dure prise de conscience de Microsoft : Copilot serait loin d&#8217;avoir le succ&#232;s escompt&#233; (mais la firme d&#233;ment)</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/microsoft-copilot/2921171_la-dure-prise-de-conscience-de-microsoft-copilot-serait-loin-davoir-le-succes-escompte-mais-la-firme-dement</link>
      <pubDate>Fri, 26 Dec 2025 11:16:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/microsoft-copilot/2921171_la-dure-prise-de-conscience-de-microsoft-copilot-serait-loin-davoir-le-succes-escompte-mais-la-firme-dement</guid>
      <description>
Des sources chez Microsoft expliquent que la firme fait face &#224; des chiffres d&#233;cevants pour Copilot, mais la firme d&#233;ment officiellement ces informations.
</description>
    </item>
    <item>
      <title>L&#8217;iPhone Air 2 en avance&#160;? Apple serait press&#233; de corriger ses erreurs d&#232;s 2026</title>
      <link>https://www.01net.com/actualites/liphone-air-2-en-avance-apple-serait-presse-de-corriger-ses-erreurs-des-2026.html</link>
      <pubDate>Fri, 26 Dec 2025 11:04:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317296</guid>
      <description>Rebondissement dans le calendrier d'Apple. Alors que les derni&#232;res rumeurs annon&#231;aient un report de l'iPhone Air 2 au printemps 2027 suite &#224; l'&#233;chec commercial du premier mod&#232;le, de nouvelles informations sugg&#232;rent qu'Apple pourrait finalement d&#233;gainer plus t&#244;t que pr&#233;vu. Le successeur du smartphone ultra-fin serait d&#233;sormais attendu d&#232;s septembre 2026....</description>
    </item>
    <item>
      <title>&#8216;We Ain&#8217;t Seen Nothing Yet&#8217;&#8212;Trump&#8217;s Mass Deportations Will Only Grow From Here</title>
      <link>https://www.wired.com/story/expired-tired-wired-constitutional-sheriffs/</link>
      <pubDate>Fri, 26 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">691cb37da03cadd1b9e06b08</guid>
      <description>Militias and far-right extremists believed they would be central to Trump&#8217;s mass deportation plans. Instead he militarized law enforcement agencies.</description>
    </item>
    <item>
      <title>I&#8217;ve been playing Plants vs Zombies for years, and this remake is the definitive edition &#8212; with a catch</title>
      <link>https://www.techradar.com/gaming/plants-vs-zombies-replanted-review</link>
      <pubDate>Fri, 26 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">5wwEyyiMuAw5Tj3kJzifGH</guid>
      <description>Plants vs. Zombies: Replanted: Replanted pulls all the flora vs walking dead gaming together in definitive package, but arguably lacks the purity of the 2009 original game.</description>
    </item>
    <item>
      <title>How Vince Gilligan designed &#8216;Pluribus&#8217; to destroy every sci-fi trope</title>
      <link>https://www.fastcompany.com/91464601/how-vince-gilligan-designed-pluribus-to-destroy-every-sci-fi-trope</link>
      <pubDate>2025-12-26T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464601/how-vince-gilligan-designed-pluribus-to-destroy-every-sci-fi-trope</guid>
      <description>Gilligan and his crew gave us an inside look at how they built &#8216;Pluribus&#8217; into a happy-ish apocalypse. 
Vince Gilligan spent a decade ruminating about his next TV series before he had a clear vision of what it was going to be. But through all that time, the writer/director, who is best known for creating Breaking Bad and Better Call Saul, knew one thing for sure: it had to be entirely different from what he&#8217;d made before. In fact, it had to be completely unlike any other show, period.&#160;...</description>
    </item>
    <item>
      <title>Data shows the &#8216;Made in USA&#8217; brand still suffered under tariffs</title>
      <link>https://www.fastcompany.com/91464780/made-in-usa-brand-damage</link>
      <pubDate>2025-12-26T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464780/made-in-usa-brand-damage</guid>
      <description>Fewer shoppers are return customers of &#8216;Made in USA&#8217; products. That&#8217;s because it still sends the wrong brand signal: expensive.
In Denmark, a grocery store chain used a black star. In Canada, it was a maple leaf. </description>
    </item>
  </channel>
</rss>
