<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 01 Mar 2026 09:34:58 GMT</lastBuildDate>
    <item>
      <title>Partez en vacances sans stress, le Pass Ulys T&#233;l&#233;p&#233;age est offert pendant 6 mois</title>
      <link>https://www.01net.com/actualites/partez-en-vacances-sans-stress-le-pass-ulys-telepeage-est-offert-pendant-6-mois.html</link>
      <pubDate>Sun, 01 Mar 2026 09:30:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327734</guid>
      <description>Gr&#226;ce au Pass Ulys T&#233;l&#233;p&#233;age, passez de tr&#232;s bonnes vacances.</description>
    </item>
    <item>
      <title>Avis Lebara en 2026 : voici les meilleurs forfaits mobiles de l&#8217;op&#233;rateur virtuel v&#233;ritablement sans engagement</title>
      <link>https://www.frandroid.com/services/operateurs-mobiles/2988345_avis-lebara-voici-les-meilleurs-forfaits-mobiles-de-loperateur-virtuel-veritablement-sans-engagement</link>
      <pubDate>Sun, 01 Mar 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/operateurs-mobiles/2988345_avis-lebara-voici-les-meilleurs-forfaits-mobiles-de-loperateur-virtuel-veritablement-sans-engagement</guid>
      <description>
On le conna&#238;t historiquement pour &#234;tre l'op&#233;rateur mobile des bureaux de tabac, des &#233;piceries de quartier et des petites boutiques de t&#233;l&#233;phonie encore debout. Lebara est aujourd'hui un des nombreux op&#233;rateurs virtuels du paysage des t&#233;l&#233;coms fran&#231;ais, voici ce quels forfaits composent son catalogue.
</description>
    </item>
    <item>
      <title>&#171; &#199;a me saoule &#187; : la fin brutale d&#8217;une application Nissan relance le d&#233;bat br&#251;lant sur les mises &#224; jour des voitures &#233;lectriques</title>
      <link>https://www.frandroid.com/marques/nissan/2994843_ca-me-saoule-la-fin-brutale-dune-application-nissan-relance-le-debat-brulant-sur-les-mises-a-jour-des-voitures-electriques</link>
      <pubDate>Sun, 01 Mar 2026 09:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nissan/2994843_ca-me-saoule-la-fin-brutale-dune-application-nissan-relance-le-debat-brulant-sur-les-mises-a-jour-des-voitures-electriques</guid>
      <description>
Nissan vient d'annoncer la fin de son application d&#233;di&#233;e aux fonctions connect&#233;es de la Leaf 2. Les propri&#233;taires de la voiture &#233;lectrique grognent, tandis que la question de la maintenance des services connect&#233;s est relanc&#233;e.
</description>
    </item>
    <item>
      <title>How to watch Rangers vs Celtic: Live Streams, TV Channels and Preview for Old Firm derby</title>
      <link>https://www.techradar.com/how-to-watch/football/rangers-vs-celtic-scottish-premiership-2025-26</link>
      <pubDate>Sun, 01 Mar 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">Taupq22bVd9jyTwaCD3Sj6</guid>
      <description>All the ways to watch Rangers vs Celtic live streams online and from anywhere, with both sides desperate for a win to keep their title hopes alive.</description>
    </item>
    <item>
      <title>'You can feel where the story is going': School Spirits star confirms hit Paramount+ show has more mileage as season 4 awaits renewal</title>
      <link>https://www.techradar.com/streaming/paramount-plus/school-spirits-season-4-update</link>
      <pubDate>Sun, 01 Mar 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">4JkyE44vZaoUVd3HPkgJcN</guid>
      <description>We're still a few days away from the season 3 finale, but there's good reason to be hopeful for School Spirits season 4 to hit Paramount+ in the future.</description>
    </item>
    <item>
      <title>SpaceX&#160;: pourquoi parle-t-on d&#8217;entr&#233;e en Bourse du si&#232;cle&#160;?</title>
      <link>https://www.01net.com/actualites/spacex-pourquoi-parle-t-on-dentree-en-bourse-du-siecle.html</link>
      <pubDate>Sun, 01 Mar 2026 08:26:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1328074</guid>
      <description>Pourquoi SpaceX, le fabricant de fus&#233;es r&#233;utilisables, affole-t-elle les compteurs de Wall Street ? Pourquoi dit-on que la soci&#233;t&#233; d'Elon Musk va r&#233;aliser une entr&#233;e en Bourse de tous les records, aux &#201;tats-Unis ? D&#233;cryptage.</description>
    </item>
    <item>
      <title>Svelte, mais performant, ce VAE not&#233; 8/10 et taill&#233; pour la ville est brad&#233; &#224; -45 %</title>
      <link>https://www.frandroid.com/bons-plans/2993301_svelte-mais-performant-ce-vae-note-8-10-et-taille-pour-la-ville-est-brade-a-45</link>
      <pubDate>Sun, 01 Mar 2026 08:22:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2993301_svelte-mais-performant-ce-vae-note-8-10-et-taille-pour-la-ville-est-brade-a-45</guid>
      <description>
Avec son style &#233;lanc&#233;, son &#233;quipement complet et son moteur Bosch SX qui le rend particuli&#232;rement dynamique, le v&#233;lo &#233;lectrique Winora iRide Pure X10 est un compagnon id&#233;al pour se d&#233;placer en ville. Son prix est un peu moins r&#233;dhibitoire : ce VAE est en promo &#224; 1 649,99 euros au lieu de 2 999,99 euros.
</description>
    </item>
    <item>
      <title>Crypto et dark web&#160;: le Monero est de plus en plus populaire chez les cybercriminels</title>
      <link>https://www.01net.com/actualites/crypto-dark-web-monero-plus-populaire-cybercriminels.html</link>
      <pubDate>Sun, 01 Mar 2026 08:08:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326060</guid>
      <description>Monero, la cryptomonnaie r&#233;put&#233;e anonyme, a la vent en poupe sur le dark web. Alors que les forces de l'ordre sont devenues tr&#232;s dou&#233;es pour suivre les flux en Bitcoin, de plus en plus de march&#233;s clandestins se tournent exclusivement vers le Monero&#8230;</description>
    </item>
    <item>
      <title>Your employees are using AI, whether you like it or not - but are they using AI securely?</title>
      <link>https://www.techradar.com/pro/your-employees-are-using-ai-whether-you-like-it-or-not-but-are-they-using-ai-securely</link>
      <pubDate>Sun, 01 Mar 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">bHXTBnCe2FhHFGtgqemKnL</guid>
      <description>As AI becomes increasingly integrated into professional lives, the question is: Are your employees using AI securely?</description>
    </item>
    <item>
      <title>How to go from a small business to a fast-growing company</title>
      <link>https://www.fastcompany.com/91488609/how-to-go-from-a-small-business-to-a-fast-growing-company</link>
      <pubDate>2026-03-01T08:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91488609/how-to-go-from-a-small-business-to-a-fast-growing-company</guid>
      <description>One entrepreneur shares what works for her&#8212;and what could work for you.
Small-business owners are up against a lot. It can be difficult to come up with the funding required to take an idea and turn it into something profitable, especially in an economy that can often feel less stable than many of us might prefer.</description>
    </item>
  </channel>
</rss>
