<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 17 Nov 2025 11:31:24 GMT</lastBuildDate>
    <item>
      <title>Black Friday sur les TV 4K et les vid&#233;oprojecteurs : notre s&#233;lection de 12 promotions sur les meilleures dalles et focales du march&#233;</title>
      <link>https://www.frandroid.com/bons-plans/2848951_black-friday-en-avant-premiere-tv-4k-et-videoprojecteurs-crevent-lecran-dans-cette-selection-des-12-meilleures-offres</link>
      <pubDate>Mon, 17 Nov 2025 11:30:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848951_black-friday-en-avant-premiere-tv-4k-et-videoprojecteurs-crevent-lecran-dans-cette-selection-des-12-meilleures-offres</guid>
      <description>
Le Black Friday est l'&#233;v&#233;nement commercial qui cr&#232;ve le mieux l'&#233;cran. Certes, les e-commer&#231;ants n'ont pas le droit de vendre &#224; perte contrairement aux soldes, mais cela n'arrive que tr&#232;s rarement dans la tech et m&#234;me jamais sur les TV 4K et les vid&#233;oprojecteurs. Ces derniers profitent tout de m&#234;me d'excellentes r&#233;ductions comme voici :
</description>
    </item>
    <item>
      <title>Cdiscount pratique des prix bien bas pour le pr&#233;-Black Friday : voici les 15 meilleurs deals</title>
      <link>https://www.frandroid.com/bons-plans/2850059_cdiscount-pratique-des-prix-bien-bas-pour-le-pre-black-friday-voici-les-15-meilleurs-deals</link>
      <pubDate>Mon, 17 Nov 2025 11:28:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850059_cdiscount-pratique-des-prix-bien-bas-pour-le-pre-black-friday-voici-les-15-meilleurs-deals</guid>
      <description>
Depuis plus d&#8217;une semaine, Cdiscount propose des promotions dans le cadre du pr&#233;-Black Friday et continue d&#8217;ajouter r&#233;guli&#232;rement de nouvelles offres attractives sur les produits Tech. &#192; l&#8217;approche du v&#233;ritable Black Friday, l&#8217;enseigne multiplie les offres. 
</description>
    </item>
    <item>
      <title>LinkedIn is making it easier to search for people with AI</title>
      <link>https://www.techradar.com/pro/linkedin-is-making-it-easier-to-search-for-people-with-ai</link>
      <pubDate>Mon, 17 Nov 2025 11:27:00 +0000</pubDate>
      <guid isPermaLink="false">aHhvVNbazoUf9KsTerWxsS</guid>
      <description>AI people searching is coming to LinkedIn, but only to Premium US customers to start with.</description>
    </item>
    <item>
      <title>The Samsung Galaxy Buds 4 Pro just leaked &#8211; and it looks like big changes are in store</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/the-samsung-galaxy-buds-4-pro-just-leaked-and-it-looks-like-big-changes-are-in-store</link>
      <pubDate>Mon, 17 Nov 2025 11:26:35 +0000</pubDate>
      <guid isPermaLink="false">5b9bVBfVtUJWUX8gPHRb56</guid>
      <description>It looks as though the Galaxy Buds 4 Pro are going to bring a new design and some new features too.</description>
    </item>
    <item>
      <title>Ce forfait cloud de 5 To &#224; vie voit son prix chuter de plus de 900 &#8364; pour le Black Friday (-60 %) [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/hardware/stockage/2865907_ce-forfait-cloud-de-5-to-a-vie-voit-son-prix-chuter-de-plus-de-900-e-pour-le-black-friday-60</link>
      <pubDate>Mon, 17 Nov 2025 11:25:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/stockage/2865907_ce-forfait-cloud-de-5-to-a-vie-voit-son-prix-chuter-de-plus-de-900-e-pour-le-black-friday-60</guid>
      <description>
pCloud fait depuis plus de dix ans le bonheur des particuliers et des professionnels qui cherchent une solution de sauvegarde simple, compl&#232;te et enti&#232;rement s&#233;curis&#233;e. Fichiers sensibles, photos, mots de passe : toutes vos donn&#233;es sont &#224; l&#8217;abri pendant les 99 prochaines ann&#233;es.
</description>
    </item>
    <item>
      <title>PS Plus members can save 5% on 'select' purchases ahead of Black Friday &#8211; these are the bundles you should be getting</title>
      <link>https://www.techradar.com/gaming/playstation/ps-plus-members-can-save-5-percent-on-select-purchases-ahead-of-black-friday-these-are-the-bundles-you-should-be-getting</link>
      <pubDate>Mon, 17 Nov 2025 11:08:08 +0000</pubDate>
      <guid isPermaLink="false">KQmwmNh4uEjk5XeSTYZg2G</guid>
      <description>You can get an extra 5% off with PS Plus at PS Direct in the UK.</description>
    </item>
    <item>
      <title>Bezos&#8217;s Big Rocket Has Proved Itself. Here&#8217;s What&#8217;s Next for New Glenn</title>
      <link>https://gizmodo.com/bezoss-big-rocket-has-proved-itself-heres-whats-next-for-new-glenn-2000686257</link>
      <pubDate>Mon, 17 Nov 2025 11:05:33 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000686257</guid>
      <description>New Glenn's second test flight was certainly impressive, but the true test will come next year.</description>
    </item>
    <item>
      <title>&#8216;Owl House&#8217; Creator Dana Terrace Gives Her Blessing to Pirate It</title>
      <link>https://gizmodo.com/owl-house-creator-dana-terrace-gives-her-blessing-to-pirate-it-2000686738</link>
      <pubDate>Mon, 17 Nov 2025 11:00:12 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000686738</guid>
      <description>With Disney ready to accept genAI-made user content for Disney+, Dana Terrace wants 'Owl House' fans to know where she stands.</description>
    </item>
    <item>
      <title>OpenAI's Fidji Simo Plans to Make ChatGPT Way More Useful&#8212;and Have You Pay For It</title>
      <link>https://www.wired.com/story/fidji-simo-is-openais-other-ceo-and-she-swears-shell-make-chatgpt-profitable/</link>
      <pubDate>Mon, 17 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">69029ea47067d92d2bea2b6b</guid>
      <description>As OpenAI expands in every direction, the new CEO of Applications is on a mission to make ChatGPT indispensable and lucrative.</description>
    </item>
    <item>
      <title>A week ahead of Black Friday, I can't believe the superb Victrix Pro BFG PS5 controller is almost half price</title>
      <link>https://www.techradar.com/gaming/a-week-ahead-of-black-friday-i-cant-believe-the-superb-victrix-pro-bfg-ps5-controller-is-almost-half-price</link>
      <pubDate>Mon, 17 Nov 2025 10:54:25 +0000</pubDate>
      <guid isPermaLink="false">7XtF7XFPsAXmfNPd2597vW</guid>
      <description>One of the best PS5 controllers just plummeted to a record-low price a whole week ahead of Black Friday.</description>
    </item>
    <item>
      <title>572 millions d&#8217;euros&#160;: nouvelle amende sal&#233;e pour Google en Europe</title>
      <link>https://www.01net.com/actualites/572-millions-deuros-nouvelle-amende-salee-pour-google-en-europe.html</link>
      <pubDate>Mon, 17 Nov 2025 10:53:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308649</guid>
      <description>Le tribunal judiciaire de Berlin a prononc&#233; une amende de 572 millions d&#8217;euros &#224; l&#8217;encontre de Google pour pratiques anticoncurrentielles. La juridiction accuse le g&#233;ant am&#233;ricain d&#8217;avoir abus&#233; de sa position dominante sur le march&#233; des comparateurs de prix via son outil Google Shopping.</description>
    </item>
    <item>
      <title>La Fnac casse le prix de la Galaxy Tab S10 Lite lors du pr&#233;-Black Friday, la toute nouvelle tablette abordable de Samsung</title>
      <link>https://www.frandroid.com/bons-plans/2783585_la-samsung-galaxy-tab-s10-lite-debarque-sur-le-marche-avec-130-e-de-reduction-et-un-bookcover-offert-pour-feter-sa-sortie</link>
      <pubDate>Mon, 17 Nov 2025 10:49:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2783585_la-samsung-galaxy-tab-s10-lite-debarque-sur-le-marche-avec-130-e-de-reduction-et-un-bookcover-offert-pour-feter-sa-sortie</guid>
      <description>
La Samsung Galaxy Tab S10 Lite est une r&#233;cente tablette Android id&#233;ale pour toute la famille. Si vous en cherchez une, elle semble toute choisie pendant le pr&#233;-Black Friday : on la trouve en promotion &#224; 279 euros au lieu de 350 euros.&#160;
</description>
    </item>
    <item>
      <title>Notre s&#233;lection des meilleures TV pas ch&#232;res (&#224; moins de 600 euros) en 2025</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-tv/1669623_quelle-tv-pas-chere-choisir-notre-selection-de-petit-prix</link>
      <pubDate>Mon, 17 Nov 2025 10:45:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-tv/1669623_quelle-tv-pas-chere-choisir-notre-selection-de-petit-prix</guid>
      <description>
Vous &#234;tes &#224; la recherche d&#8217;un TV pas cher pour vous &#233;quiper correctement sans exploser votre budget&#8201;? Voici une s&#233;lection des meilleurs mod&#232;les disponibles &#224; petit prix. Pour ce faire, nous avons plac&#233; une limite de budget en dessous de 600&#160;euros et propos&#233; quelques technologies d&#8217;&#233;cran.
</description>
    </item>
    <item>
      <title>Black Friday smartphone pas cher : m&#234;me les Google Pixel et Xiaomi Poco tombent sous la barre des 500 euros dans ce top des offres</title>
      <link>https://www.frandroid.com/bons-plans/2856691_meilleurs-deals-smartphones-pas-chers-500-euros</link>
      <pubDate>Mon, 17 Nov 2025 10:35:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2856691_meilleurs-deals-smartphones-pas-chers-500-euros</guid>
      <description>
Alors que le Black Friday approche irr&#233;m&#233;diablement, la rubrique bons plans de Frandroid ne d&#233;semplit pas face aux vagues de promotions sur les smartphones. Il n'a jamais &#233;t&#233; aussi ais&#233; de trouv&#233; un smartphone, m&#234;me premium, &#224; moins de 500 euros. Pour vous en convaincre, voici le top 10 des offres.
</description>
    </item>
    <item>
      <title>L&#8217;arm&#233;e de robots chinois qui d&#233;barque : voici le robot derri&#232;re cette vid&#233;o qui fait froid dans le dos</title>
      <link>https://www.frandroid.com/produits-android/robots/2871123_larmee-de-robots-chinois-qui-debarque-voici-le-robot-derriere-cette-video-qui-fait-froid-dans-le-dos</link>
      <pubDate>Mon, 17 Nov 2025 10:33:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/robots/2871123_larmee-de-robots-chinois-qui-debarque-voici-le-robot-derriere-cette-video-qui-fait-froid-dans-le-dos</guid>
      <description>
Vous avez vu cette vid&#233;o impressionnante de centaines de robots chinois marchant en formation ? C'est spectaculaire et &#231;a fait peur.
</description>
    </item>
    <item>
      <title>Boulanger fait le plein de bonnes affaires au pr&#233;-Black Friday : les 22 meilleurs deals&#160; &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2859523_boulanger-multiplie-deja-les-promotions-au-pre-black-friday-les-16-deals-a-retenir</link>
      <pubDate>Mon, 17 Nov 2025 10:31:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2859523_boulanger-multiplie-deja-les-promotions-au-pre-black-friday-les-16-deals-a-retenir</guid>
      <description>
&#192; l&#8217;approche du grand rendez-vous du Black Friday, Boulanger met en ligne de toutes nouvelles promotions, proposant jusqu&#8217;&#224; 40&#8239;% de remise sur de nombreux produits Tech comme les smartphones, t&#233;l&#233;viseurs, ordinateurs portables ou &#233;quipements audio. Une belle occasion de faire de bonnes affaires avant le jour J.
</description>
    </item>
    <item>
      <title>Silicon Valley&#8217;s Plausible Path to the Designer Baby Business&#8212;Even Though It&#8217;s Illegal</title>
      <link>https://gizmodo.com/designer-baby-business-illegal-2000686630</link>
      <pubDate>Mon, 17 Nov 2025 10:30:21 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000686630</guid>
      <description>"The way to sell it to the world is through disease prevention...and showing you can do that."</description>
    </item>
    <item>
      <title>12 Best Tech Gifts That They'd Actually Want (2025)</title>
      <link>https://www.wired.com/story/best-tech-gifts/</link>
      <pubDate>Mon, 17 Nov 2025 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">690b980d661ccbffa6d27ecb</guid>
      <description>Don't buy something for a loved one you wouldn't want for yourself. These are the hot tech products of 2025 that everyone will yearn for this holiday season.</description>
    </item>
    <item>
      <title>The leadership skills you learn from raising kids</title>
      <link>https://www.fastcompany.com/91438553/leadership-skills-you-learn-raising-kids</link>
      <pubDate>2025-11-17T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91438553/leadership-skills-you-learn-raising-kids</guid>
      <description>Six lessons that cut across both domains.
A few days ago, I wrapped a coaching call with a senior executive navigating a complex restructuring&#8212;work that demands steadiness in ambiguity, patience when emotions rise, and the discipline to stay grounded while others are spinning. Minutes later, I walked into my kitchen and found my child in a mismatched Halloween costume, eating shredded cheese out of the bag, and crying because her Lego creation was &#8220;too wobbly to be art.&#8221;...</description>
    </item>
    <item>
      <title>Pas d&#8217;iPhone 18 en 2026&#160;: la surprise d&#8217;Apple qu&#8217;on n&#8217;avait pas vu venir</title>
      <link>https://www.01net.com/actualites/pas-diphone-18-en-2026-la-surprise-dapple-quon-navait-pas-vu-venir.html</link>
      <pubDate>Mon, 17 Nov 2025 10:27:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308623</guid>
      <description>Apple pourrait bouleverser son calendrier de lancements iPhone en passant &#224; deux conf&#233;rences annuelles, une &#224; l&#8217;automne pour les mod&#232;les haut de gamme et une au printemps pour les entr&#233;es de gamme. Ce changement, s&#8217;il se confirme, marquerait la fin d&#8217;une tradition et pourrait redistribuer les cartes sur le march&#233; des smartphones.</description>
    </item>
    <item>
      <title>ChatGPT se d&#233;barrasse enfin de cette sale habitude de langage</title>
      <link>https://www.01net.com/actualites/chatgpt-debarrasse-enfin-sale-habitude-langage.html</link>
      <pubDate>Mon, 17 Nov 2025 10:22:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308631</guid>
      <description>Le tiret cadratin (&#8220;&#8212;&#8221;) est devenu l&#8217;une des signatures les plus visibles des textes g&#233;n&#233;r&#233;s par ChatGPT. Bonne nouvelle, il est d&#233;sormais possible de demander &#224; l&#8217;IA de s&#8217;en passer, ou du moins, de r&#233;duire son utilisation dans ses r&#233;ponses. On vous explique comment faire.</description>
    </item>
    <item>
      <title>Intel : une premi&#232;re vague de consoles portables sous Panther Lake est bien en pr&#233;paration</title>
      <link>https://www.frandroid.com/produits-android/console/console-de-jeux/2870937_intel-une-premiere-vague-de-consoles-portables-sous-panther-lake-est-bien-en-preparation</link>
      <pubDate>Mon, 17 Nov 2025 10:22:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/console-de-jeux/2870937_intel-une-premiere-vague-de-consoles-portables-sous-panther-lake-est-bien-en-preparation</guid>
      <description>
Un bouquet de nouvelles informations tend &#224; nous confirmer que Panther Lake int&#233;grera bien, tr&#232;s vite, une premi&#232;re fourn&#233;e de consoles de jeu portables sous Windows. Parmi les premi&#232;res machines &#233;quip&#233;es, la MSI Claw... qui avait &#233;t&#233; l'une des premi&#232;res &#224; croire en Intel.
</description>
    </item>
    <item>
      <title>Cette option pratique de YouTube Music vous fera gagner du temps en retrouvant rapidement votre morceau pr&#233;f&#233;r&#233;</title>
      <link>https://www.frandroid.com/services/streaming-musical/2870855_cette-option-pratique-de-youtube-music-vous-fera-gagner-du-temps-en-retrouvant-rapidement-votre-morceau-prefere</link>
      <pubDate>Mon, 17 Nov 2025 10:21:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/streaming-musical/2870855_cette-option-pratique-de-youtube-music-vous-fera-gagner-du-temps-en-retrouvant-rapidement-votre-morceau-prefere</guid>
      <description>
Le service de musique de Google veut permettre &#224; ses utilisateurs de retrouver rapidement leurs morceaux pr&#233;f&#233;r&#233;s dans des playlists. 
</description>
    </item>
    <item>
      <title>iPhone tipped for major launch shake-up in 2026 &#8211; here's when to expect the iPhone 18, iPhone Air 2, and more</title>
      <link>https://www.techradar.com/phones/iphone/iphone-tipped-for-major-launch-shake-up-in-2026-heres-when-to-expect-the-iphone-18-iphone-air-2-and-more</link>
      <pubDate>Mon, 17 Nov 2025 10:18:39 +0000</pubDate>
      <guid isPermaLink="false">ZKHTDbYjN66FvsPXU8oMWg</guid>
      <description>Apple might start consistently releasing iPhones at two different points in the year, and the iPhone Air 2 might lack the camera upgrades we hoped for.</description>
    </item>
    <item>
      <title>Microsoft loses bid to ban license reselling as UK court gives it the thumbs up</title>
      <link>https://www.techradar.com/pro/microsoft-loses-bid-to-ban-license-reselling-as-uk-court-gives-it-the-thumbs-up</link>
      <pubDate>Mon, 17 Nov 2025 10:17:12 +0000</pubDate>
      <guid isPermaLink="false">H8nwQWQaksQsNF3acruZE3</guid>
      <description>Tribunal rules ValueLicensing was legally allowed to resell Microsoft licenses.</description>
    </item>
    <item>
      <title>&#171; Le projet n&#8217;est pas viable &#187; : coup dur pour les usines europ&#233;ennes de batteries pour voitures &#233;lectriques</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2870951_le-projet-nest-pas-viable-coup-dur-pour-les-usines-europeennes-de-batteries-pour-voitures-electriques</link>
      <pubDate>Mon, 17 Nov 2025 10:14:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2870951_le-projet-nest-pas-viable-coup-dur-pour-les-usines-europeennes-de-batteries-pour-voitures-electriques</guid>
      <description>
L'entreprise europ&#233;enne de batteries pour voitures &#233;lectriques ACC, cofond&#233;e avec Stellantis, TotalEnergies et Mercedes-Benz, serait sur le point d'abandonner son projet d'usine en Italie. Preuve d'une vision strat&#233;gique erron&#233;e&#160;?
</description>
    </item>
    <item>
      <title>Jeff Bezos will be co-CEO of AI startup Project Prometheus</title>
      <link>https://www.theverge.com/news/821943/jeff-bezos-project-prometheus-co-ceo-funding-ai-startup</link>
      <pubDate>2025-11-17T05:14:03-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=821943</guid>
      <description>Jeff Bezos is getting a new job. He&#8217;ll reportedly become co-CEO of Project Prometheus, a new startup that he&#8217;s partly funding. The company&#8217;s exact plans are still unknown, but its focus is on AI that could improve manufacturing in fields including computing, automobiles, and aerospace. The New York Times reports that Project Prometheus is already [&#8230;]...</description>
    </item>
    <item>
      <title>Apple Reportedly Has a Bold New Plan For Innovation Over the Next Few Years: More iPhones</title>
      <link>https://gizmodo.com/apple-iphone-schedule-2000686652</link>
      <pubDate>Mon, 17 Nov 2025 10:00:13 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000686652</guid>
      <description>More! More! More! of Apple's signature bescreened cuboids, albeit with new and exciting dimensions.</description>
    </item>
    <item>
      <title>Inside a Wild Bitcoin Heist: Five-Star Hotels, Cash-Stuffed Envelopes, and Vanishing Funds</title>
      <link>https://www.wired.com/story/bitcoin-scam-mining-as-service/</link>
      <pubDate>Mon, 17 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">6912234363394d74b45e2f88</guid>
      <description>Sophisticated crypto scams are on the rise. But few of them go to the lengths one bitcoin mining executive experienced earlier this year.</description>
    </item>
    <item>
      <title>A solopreneur&#8217;s starter kit: What you need on Day 1</title>
      <link>https://www.fastcompany.com/91439714/solopreneurs-starter-kit-day-1</link>
      <pubDate>2025-11-17T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91439714/solopreneurs-starter-kit-day-1</guid>
      <description>How to get started when you&#8217;re working for yourself.
You&#8217;ve decided to start a solo business. Congratulations! I&#8217;ve been a solopreneur for years and love being my own boss.&#160;</description>
    </item>
    <item>
      <title>TikTokers hatch plan to make memes great again</title>
      <link>https://www.fastcompany.com/91442520/tiktok-meme-depression-reset</link>
      <pubDate>2025-11-17T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91442520/tiktok-meme-depression-reset</guid>
      <description>Were the memes of yore really so much better? Let&#8217;s find out.
Earlier this year, TikTokers declared the start of the Great Meme Depression of 2025. In the months since, things haven&#8217;t picked up much.&#160;</description>
    </item>
    <item>
      <title>Intersport d&#233;gaine un nouveau VTT &#233;lectrique abordable et tout en puissance</title>
      <link>https://www.frandroid.com/marques/nakamura/2871039_intersport-degaine-un-nouveau-vtt-electrique-abordable-et-tout-en-puissance</link>
      <pubDate>Mon, 17 Nov 2025 09:58:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nakamura/2871039_intersport-degaine-un-nouveau-vtt-electrique-abordable-et-tout-en-puissance</guid>
      <description>
Nakamura enrichit sa gamme avec l&#8217;E-Summit 960, un nouveau VTT &#233;lectrique affich&#233; &#224; 2 099 euros, soit une porte d&#8217;entr&#233;e int&#233;ressante pour une pratique du VTT peu engag&#233;e. Ce mod&#232;le semi-rigide mise sur un moteur central de 100 Nm et une batterie de 520 Wh.
</description>
    </item>
    <item>
      <title>Microsoft commence &#224; installer Windows 11 25H2 de force, mais c&#8217;est pour votre bien</title>
      <link>https://www.01net.com/actualites/microsoft-commence-a-installer-windows-11-25h2-de-force-mais-cest-pour-votre-bien.html</link>
      <pubDate>Mon, 17 Nov 2025 09:58:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308622</guid>
      <description>La mise &#224; jour 25H2 de Windows 11, disponible pour tous depuis plusieurs semaines, et automatiquement install&#233;e par Microsoft sur les PC utilisant encore une version obsol&#232;te.</description>
    </item>
    <item>
      <title>Galaxy S26 : Samsung pr&#234;t &#224; tout pour battre l&#8217;iPhone 17, quitte &#224; faire des sacrifices ?</title>
      <link>https://www.frandroid.com/marques/samsung/2870861_galaxy-s26-samsung-pret-a-tout-pour-battre-liphone-17-quitte-a-faire-des-sacrifices</link>
      <pubDate>Mon, 17 Nov 2025 09:56:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2870861_galaxy-s26-samsung-pret-a-tout-pour-battre-liphone-17-quitte-a-faire-des-sacrifices</guid>
      <description>
Le leaker Ice Universe d&#233;taille les dimensions exactes de la future gamme Samsung Galaxy S26. Ils seraient plus fins que les S25 et iPhone 17. Une course &#224; la finesse qui pourrait cependant se faire au d&#233;triment d&#8217;autres am&#233;liorations tr&#232;s attendues.
</description>
    </item>
    <item>
      <title>Amazon lance une vague de promotions pour le pr&#233;-Black Friday : les 18 offres &#224; ne pas louper</title>
      <link>https://www.frandroid.com/bons-plans/2860071_amazon-lance-une-vague-de-promotions-pour-le-pre-black-friday-les-18-offres-a-ne-pas-louper</link>
      <pubDate>Mon, 17 Nov 2025 09:56:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860071_amazon-lance-une-vague-de-promotions-pour-le-pre-black-friday-les-18-offres-a-ne-pas-louper</guid>
      <description>
Amazon lance d&#233;j&#224; ses premi&#232;res promotions avant le Black Friday avec une premi&#232;re vague de promotions particuli&#232;rement attractives. De nombreux produits Tech voient leurs prix chuter, qu&#8217;il s&#8217;agisse de smartphones, d&#8217;ordinateurs portables, de casques audio ou encore de consoles de jeux. D&#233;couvrez une s&#233;lection des meilleures offres &#224; saisir avant le jour J.
...</description>
    </item>
    <item>
      <title>Starlink met le paquet en France avec cette nouvelle offre qui facilite l&#8217;installation chez vous</title>
      <link>https://www.frandroid.com/marques/spacex/starlink/2870721_starlink-met-le-paquet-en-france-avec-cette-nouvelle-offre-qui-facilite-linstallation-chez-vous</link>
      <pubDate>Mon, 17 Nov 2025 09:53:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/spacex/starlink/2870721_starlink-met-le-paquet-en-france-avec-cette-nouvelle-offre-qui-facilite-linstallation-chez-vous</guid>
      <description>
Starlink, la soci&#233;t&#233; d'acc&#232;s &#224; internet par satellite, propose une nouvelle offre commerciale pour s&#233;duire son public fran&#231;ais. 
</description>
    </item>
    <item>
      <title>An "AI Exposure Gap" could be the most worrying security issue your business isn't aware of</title>
      <link>https://www.techradar.com/pro/security/an-ai-exposure-gap-could-be-the-most-worrying-security-issue-your-business-isnt-aware-of</link>
      <pubDate>Mon, 17 Nov 2025 09:50:25 +0000</pubDate>
      <guid isPermaLink="false">nv2YDz46DzK3wBzMExjdzV</guid>
      <description>Security postures are lacking as enterprises go all-in on AI, and it&#8217;s creating an &#8220;exposure gap&#8221;</description>
    </item>
    <item>
      <title>Why our own clicks are often cybercrime's greatest allies</title>
      <link>https://www.techradar.com/pro/why-our-own-clicks-are-often-cybercrimes-greatest-allies</link>
      <pubDate>Mon, 17 Nov 2025 09:49:43 +0000</pubDate>
      <guid isPermaLink="false">Q4HMrAXeTSavBBbget4Zca</guid>
      <description>Cybercrime&#8217;s greatest tool isn&#8217;t malware &#8212; it&#8217;s our trust in everyday digital interactions and habits.</description>
    </item>
    <item>
      <title>I tried every new Google AI shopping feature, and I feel a lot better about holiday shopping this year</title>
      <link>https://www.techradar.com/ai-platforms-assistants/gemini/i-tried-every-new-google-ai-shopping-feature-and-i-feel-a-lot-better-about-holiday-shopping-this-year</link>
      <pubDate>Mon, 17 Nov 2025 09:38:47 +0000</pubDate>
      <guid isPermaLink="false">qEF8Te56eqr6T6uZ8wKm6i</guid>
      <description>How Gemini's visual feedback can make for a helpful art teacher.</description>
    </item>
    <item>
      <title>Vinted est envahi de pubs cach&#233;es pour des comptes OnlyFans et Mym</title>
      <link>https://www.01net.com/actualites/vinted-envahi-pubs-cachees-comptes-onlyfans-mym.html</link>
      <pubDate>Mon, 17 Nov 2025 09:33:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308614</guid>
      <description>De fausses annonces sur Vinted servent de vitrine pour rediriger les utilisateurs vers des comptes OnlyFans et Mym. Pour contraindre la plateforme &#224; agir, la haute-commissaire &#224; l'Enfance saisit l'Arcom. De son c&#244;t&#233;, Vinted se d&#233;fend en assurant faire son possible pour lutter contre les annonces &#224; caract&#232;re sexuel.</description>
    </item>
  </channel>
</rss>
