<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 12 Jan 2026 07:31:40 GMT</lastBuildDate>
    <item>
      <title>Instagram rassure tout le monde, la r&#233;cente fuite de donn&#233;es n&#8217;en &#233;tait pas une finalement</title>
      <link>https://www.frandroid.com/marques/meta/2938631_instagram-rassure-tout-le-monde-la-recente-fuite-de-donnees-nen-etait-pas-une-finalement</link>
      <pubDate>Mon, 12 Jan 2026 07:14:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2938631_instagram-rassure-tout-le-monde-la-recente-fuite-de-donnees-nen-etait-pas-une-finalement</guid>
      <description>
Alors qu&#8217;un fichier promettant de contenir des informations personnelles sur 17,5&#160;millions de comptes Instagram a &#233;merg&#233; sur des recoins sombres du net, Meta tente de rassurer en expliquant qu&#8217;il n&#8217;y a pas eu d&#8217;acc&#232;s frauduleux &#224; ses donn&#233;es.
</description>
    </item>
    <item>
      <title>Do I need a dehumidifier? Here's exactly what they can help with</title>
      <link>https://www.techradar.com/home/small-appliances/how-does-a-dehumidifier-work-and-what-does-it-do</link>
      <pubDate>Mon, 12 Jan 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">y4jhfBYcsxH6SqUN8ggjhG</guid>
      <description>Dehumidifiers can help tackle all kinds of damp, condensation and humidity &#8211; here's how.</description>
    </item>
    <item>
      <title>Google Maps change enfin la pire partie de son interface</title>
      <link>https://www.01net.com/actualites/google-maps-change-enfin-pire-partie-son-interface.html</link>
      <pubDate>Mon, 12 Jan 2026 06:59:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319339</guid>
      <description>Google Maps d&#233;ploie en ce moment une refonte majeure de son menu des param&#232;tres pour mettre fin &#224; une interface devenue illisible au fil des ann&#233;es.</description>
    </item>
    <item>
      <title>Cyberattaque contre Instagram&#160;: le r&#233;seau social corrige une faille de s&#233;curit&#233;</title>
      <link>https://www.01net.com/actualites/fuite-donnees-instagram-informations-17-millions-utilisateurs-volees.html</link>
      <pubDate>Mon, 12 Jan 2026 06:55:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319288</guid>
      <description>Des pirates ont mis la main sur les donn&#233;es sensibles de 17,5 millions de comptes Instagram. Partag&#233;es sur le dark web, elles mettent en danger tous les utilisateurs concern&#233;s. Instagram confirme avoir &#233;t&#233; la cible d'une cyberattaque exploitant une faille de s&#233;curit&#233;, mais assure qu'aucune donn&#233;e n'a &#233;t&#233; vol&#233;e. Le r&#233;seau a corrig&#233; la vuln&#233;rabilit&#233;.</description>
    </item>
    <item>
      <title>Crypto-crime&#160;: pourquoi 2025 a pulv&#233;ris&#233; tous les records</title>
      <link>https://www.01net.com/actualites/crypto-crime-pourquoi-2025-pulverise-tous-records.html</link>
      <pubDate>Mon, 12 Jan 2026 06:50:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319112</guid>
      <description>En 2025, l&#8217;argent sale en cryptomonnaies a battu tous les records. Plus de 150 milliards de dollars li&#233;s au crime ont &#233;t&#233; identifi&#233;s sur les blockchains. Cette augmentation d&#233;coule des activit&#233;s de la Russie, l&#8217;Iran, et la Cor&#233;e du Nord, qui se sont appropri&#233; les cryptomonnaies pour &#233;chapper aux sanctions &#233;conomiques de l'Occident.</description>
    </item>
    <item>
      <title>Samsung Galaxy Z Flip 7 vs Motorola Razr 60 Ultra&#160;: comment choisir le meilleur smartphone pliable &#224; clapet&#160;?</title>
      <link>https://www.frandroid.com/versus/2777611_samsung-galaxy-z-flip-7-vs-motorola-razr-60-ultra-comment-choisir-le-meilleur-smartphone-pliable-a-clapet</link>
      <pubDate>Mon, 12 Jan 2026 06:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/versus/2777611_samsung-galaxy-z-flip-7-vs-motorola-razr-60-ultra-comment-choisir-le-meilleur-smartphone-pliable-a-clapet</guid>
      <description>
Samsung rencontre une concurrence de plus en plus f&#233;roce sur le march&#233; des pliants. Motorola a-t-il seulement des chances de distancer le Galaxy Z Flip 7&#160;avec son Razr 60 Ultra&#160;? On se pose la question dans notre nouveau comparatif&#160;!
</description>
    </item>
    <item>
      <title>01net morning&#160;: 01net &#233;tait au CES 2026, voici le bilan&#160;!</title>
      <link>https://www.01net.com/actualites/01net-morning-01net-etait-au-ces-2026-voici-le-bilan.html</link>
      <pubDate>Mon, 12 Jan 2026 06:30:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319332</guid>
      <description>Bonjour &#224; tous, voici la matinale de 01net ! Qu&#8217;avez-vous manqu&#233; ce week-end ? Retrouvez toute l&#8217;actu &#224; connaitre pour d&#233;marrer la semaine du bon pied !</description>
    </item>
    <item>
      <title>Les produits Xiaomi ne sont pas &#233;pargn&#233;s lors des soldes d&#8217;hiver : voici les 8 meilleurs deals</title>
      <link>https://www.frandroid.com/bons-plans/2936033_les-produits-xiaomi-ne-sont-pas-epargnes-lors-des-soldes-dhiver-voici-les-8-meilleurs-deals</link>
      <pubDate>Mon, 12 Jan 2026 06:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2936033_les-produits-xiaomi-ne-sont-pas-epargnes-lors-des-soldes-dhiver-voici-les-8-meilleurs-deals</guid>
      <description>
Xiaomi reste un acteur incontournable du march&#233; de la Tech. Comme chaque ann&#233;e, le constructeur chinois participe aux soldes d'hiver et se d&#233;marque en proposant des offres attractives sur ses smartphones, objets connect&#233;s et t&#233;l&#233;viseurs &#8212; sans oublier son tout nouveau mod&#232;le Poco, d&#233;j&#224; disponible en promotion. 
</description>
    </item>
    <item>
      <title>Microsoft Lens va prendre sa retraite tr&#232;s bient&#244;t et c&#8217;est la faute de l&#8217;IA</title>
      <link>https://www.frandroid.com/marques/microsoft/2938625_microsoft-lens-va-prendre-sa-retraite-tres-bientot-et-cest-la-faute-de-lia</link>
      <pubDate>Mon, 12 Jan 2026 06:25:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2938625_microsoft-lens-va-prendre-sa-retraite-tres-bientot-et-cest-la-faute-de-lia</guid>
      <description>
Longtemps pris&#233;e pour ses capacit&#233;s de reconnaissance de texte et de scan de documents, Microsoft Lens va &#234;tre abandonn&#233;e par Microsoft dans les prochaines semaines en faveur de sa solution cloud OneDrive.
</description>
    </item>
    <item>
      <title>L&#8217;h&#233;bergeur fran&#231;ais o2switch d&#233;voile une offre tout compris &#224; un prix imbattable pour 2026 [Sponso]</title>
      <link>https://www.frandroid.com/services/2934865_lhebergeur-francais-o2switch-devoile-une-offre-tout-compris-a-un-prix-imbattable-pour-2026</link>
      <pubDate>Mon, 12 Jan 2026 06:22:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/2934865_lhebergeur-francais-o2switch-devoile-une-offre-tout-compris-a-un-prix-imbattable-pour-2026</guid>
      <description>
Vous souhaitez lancer votre site internet ou vous &#234;tes insatisfait de votre solution d&#8217;h&#233;bergement actuelle ? L&#8217;entreprise fran&#231;aise o2switch multiplie les arguments entre co&#251;ts r&#233;duits, espace disque illimit&#233;, migration gratuite ou encore nom de domaine offert.
</description>
    </item>
    <item>
      <title>I tested the Insta360 Wave - and this speakerphone proved to be a valuable asset in the office thanks to AI transcriptions and clear voice recording</title>
      <link>https://www.techradar.com/computing/insta360-wave-speakerphone-review</link>
      <pubDate>Mon, 12 Jan 2026 06:10:00 +0000</pubDate>
      <guid isPermaLink="false">XxdHKDZKDNzJAHY3GKwPw8</guid>
      <description>The Insta360 Wave is an AI-enhanced speakerphone that will instantly boost the audio pickup, compared with your laptop or desktop mics for meetings or calls. But then the Wave is far more than a simple mic as it&#8217;ll will also record and transcribe with the AI features enabling you to search and ask questions about what was said after the meeting.</description>
    </item>
  </channel>
</rss>
