<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 04 Dec 2025 09:29:46 GMT</lastBuildDate>
    <item>
      <title>M&#233;decinDirect pirat&#233; : les donn&#233;es m&#233;dicales des utilisateurs ont &#233;t&#233; vol&#233;es</title>
      <link>https://www.01net.com/actualites/medecindirect-pirate-donnees-medicales-utilisateurs-volees.html</link>
      <pubDate>Thu, 04 Dec 2025 09:27:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313668</guid>
      <description>M&#233;decinDirect, g&#233;ant fran&#231;ais de la t&#233;l&#233;consultation, a subi une cyberattaque. Des pirates ont consult&#233; des donn&#233;es personnelles et des informations m&#233;dicales sensibles. Les informations que vous avez donn&#233;es pendant l&#8217;examen m&#233;dicale ont &#233;t&#233; compromises...</description>
    </item>
    <item>
      <title>Thule d&#233;gaine un nouveau porte-v&#233;los encore plus robuste et plus polyvalent</title>
      <link>https://www.frandroid.com/marques/thule/2898065_thule-degaine-un-nouveau-porte-velos-encore-plus-robuste-et-plus-polyvalent</link>
      <pubDate>Thu, 04 Dec 2025 09:11:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/thule/2898065_thule-degaine-un-nouveau-porte-velos-encore-plus-robuste-et-plus-polyvalent</guid>
      <description>
Thule a d&#233;voil&#233; le VeloSpace 3, une nouvelle g&#233;n&#233;ration de porte-v&#233;los sur attelage pens&#233;e pour accueillir jusqu&#8217;&#224; quatre v&#233;los gr&#226;ce &#224; un adaptateur d&#233;di&#233;. Ce nouveau mod&#232;le se veut encore plus robuste que la version OutSpace pr&#233;sent&#233;e cet &#233;t&#233;, notamment gr&#226;ce &#224; une capacit&#233; de chargement encore plus &#233;lev&#233;e.
</description>
    </item>
    <item>
      <title>Google Photos s&#8217;appr&#234;te enfin &#224; ajouter une option attendue depuis des ann&#233;es</title>
      <link>https://www.01net.com/actualites/google-photos-sapprete-ajouter-option-attendue-depuis-des-annees.html</link>
      <pubDate>Thu, 04 Dec 2025 09:06:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313664</guid>
      <description>Google Photos teste enfin un nouvel outil de retouche qui aurait d&#251; &#234;tre dans l'application depuis bien longtemps.</description>
    </item>
    <item>
      <title>Des cartes 3D ultra-pr&#233;cises&#160;: cette application fran&#231;aise fait mieux que Strava et Google Maps</title>
      <link>https://www.01net.com/actualites/des-cartes-3d-ultra-precises-cette-application-francaise-fait-mieux-que-strava-et-google-maps.html</link>
      <pubDate>Thu, 04 Dec 2025 09:00:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313485</guid>
      <description>Une cartographie 3D digne d&#8217;une photo, m&#234;me en hiver, c&#8217;est ce que propose la soci&#233;t&#233; fran&#231;aise Whympr qui vient de d&#233;voiler sa nouvelle carte satellite hivernale HD.</description>
    </item>
    <item>
      <title>Microsoft a voulu simplifier les pr&#233;requis de Windows 11, mais embrouille finalement tout le monde</title>
      <link>https://www.frandroid.com/marques/microsoft/2897981_microsoft-a-voulu-simplifier-les-prerequis-de-windows-11-mais-embrouille-finalement-tout-le-monde</link>
      <pubDate>Thu, 04 Dec 2025 08:55:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2897981_microsoft-a-voulu-simplifier-les-prerequis-de-windows-11-mais-embrouille-finalement-tout-le-monde</guid>
      <description>
Microsoft vient de mettre &#224; jour la liste des processeurs support&#233;s par Windows 11. Mais dans l'op&#233;ration, la confusion r&#232;gne pour les puces Intel.
</description>
    </item>
    <item>
      <title>Avis aux gamers, ce PC portable gaming boost&#233; avec la surpuissante RTX 5070 Ti co&#251;te 300 &#8364; de moins</title>
      <link>https://www.frandroid.com/bons-plans/2897267_avis-aux-gamers-ce-pc-portable-gaming-booste-avec-la-surpuissante-rtx-5070-ti-coute-300-e-de-moins</link>
      <pubDate>Thu, 04 Dec 2025 08:33:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2897267_avis-aux-gamers-ce-pc-portable-gaming-booste-avec-la-surpuissante-rtx-5070-ti-coute-300-e-de-moins</guid>
      <description>
Profitez d'une remise de 300 euros sur Cdiscount pour r&#233;cup&#233;rer ce tr&#232;s solide HP Omen 16-am1000nf avec RTX 5070 Ti pour 1799,99 euros au lieu de 2099,99 euros.
</description>
    </item>
    <item>
      <title>Ce botnet est responsable de la pire attaque DDoS de l&#8217;histoire d&#8217;Internet</title>
      <link>https://www.01net.com/actualites/botnet-responsable-attaque-ddos-puissante-temps.html</link>
      <pubDate>Thu, 04 Dec 2025 08:31:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313635</guid>
      <description>Un gigantesque botnet appel&#233; Aisuru enchaine les cyberattaques. Au 3&#7497; trimestre 2025, il a orchestr&#233; plus de 1&#8239;300 attaques DDoS. Il a aussi et surtout d&#233;ploy&#233; une attaque record. D&#233;jou&#233;e par Cloudflare, l'offensive provenait de millions d'appareils pirat&#233;s&#8230;</description>
    </item>
    <item>
      <title>19 mod&#232;les de v&#233;lo en location et des prix pour tout le monde : V&#233;ligo entre dans une nouvelle dimension</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2897705_19-modeles-de-velo-en-location-et-des-prix-pour-tout-le-monde-veligo-entre-dans-une-nouvelle-dimension</link>
      <pubDate>Thu, 04 Dec 2025 08:27:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2897705_19-modeles-de-velo-en-location-et-des-prix-pour-tout-le-monde-veligo-entre-dans-une-nouvelle-dimension</guid>
      <description>
Apr&#232;s 6 ans de succ&#232;s, le service de location de v&#233;los &#233;lectriques V&#233;ligo passe &#224; 19 mod&#232;les diff&#233;rents, dont des cargos professionnels et adapt&#233;s, avec une offre jusqu&#8217;&#224; 12 mois d&#232;s janvier 2026.
</description>
    </item>
    <item>
      <title>Un des plus grands t&#233;lescopes du monde est en danger, et ces scientifiques veulent le sauver</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-plus-grands-telescopes-monde-danger-ces-scientifiques-veulent-sauver-128192/#xtor%3DRSS-8</link>
      <pubDate>Thu, 04 Dec 2025 09:07:49 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-plus-grands-telescopes-monde-danger-ces-scientifiques-veulent-sauver-128192/#xtor%3DRSS-8</guid>
      <description>Menac&#233; par une construction industrielle proche du&#160;lieu, l'observatoire Paranal, dans le d&#233;sert d'Atacama au Chili, re&#231;oit le soutien de nombreux scientifiques internationaux, dont plusieurs prix Nobel. Tous esp&#232;rent faire reculer le gouvernement chilien qui a autoris&#233; le chantier.</description>
    </item>
    <item>
      <title>Apples head of UI design leaves for Meta</title>
      <link>https://mashable.com/article/apple-head-ui-design-meta</link>
      <pubDate>Thu, 04 Dec 2025 08:06:02 +0000</pubDate>
      <guid isPermaLink="false">06yJFJCCr3CGC9XrUYxEnB5</guid>
      <description>Apple's head of UI design and long-time executive Alan Dye has left Apple to join Meta.</description>
    </item>
    <item>
      <title>La fin de Meta AI dans WhatsApp&#8201;? L&#8217;Union europ&#233;enne y songe</title>
      <link>https://www.frandroid.com/marques/meta/2897971_la-fin-de-meta-ai-dans-whatsapp-lunion-europeenne-y-songe</link>
      <pubDate>Thu, 04 Dec 2025 08:02:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2897971_la-fin-de-meta-ai-dans-whatsapp-lunion-europeenne-y-songe</guid>
      <description>
Si l&#8217;on en croit les informations r&#233;v&#233;l&#233;es par le Financial Times, l&#8217;Union europ&#233;enne ne devrait pas tarder &#224; ouvrir une enqu&#234;te sur Meta pour abus de position dominante &#224; cause du forcing de son robot conversationnel au sein de WhatsApp.
</description>
    </item>
    <item>
      <title>Gemini was Google&#8217;s top trending search term in 2025</title>
      <link>https://techcrunch.com/2025/12/04/gemini-was-googles-top-trending-search-term-in-2025/</link>
      <pubDate>Thu, 04 Dec 2025 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3072303</guid>
      <description>Gemini wasn&#8217;t the only AI chatbot to make the list, as DeepSeek ranked seventh among the year&#8217;s trending searches.</description>
    </item>
    <item>
      <title>The Abandons review: New Netflix western is no Yellowstone, but Gillian Anderson shines</title>
      <link>https://www.techradar.com/streaming/netflix/the-abandons-review</link>
      <pubDate>Thu, 04 Dec 2025 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">xGppb9qZ3aS3w5BBzHmi3a</guid>
      <description>Going up against the Taylor Sheridanverse is a bold move, even for Netflix. But while the new western The Abandons is solid, it pales in comparison.</description>
    </item>
    <item>
      <title>Working mothers are still being left out of career growth. How we can fix that</title>
      <link>https://www.fastcompany.com/91447522/mothers-dont-just-face-a-pay-gap-they-face-a-training-gap-too</link>
      <pubDate>2025-12-04T08:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91447522/mothers-dont-just-face-a-pay-gap-they-face-a-training-gap-too</guid>
      <description>Why mothers fall into this gap, how it hurts companies, and the businesses pursuing ideas and policies that offer a solution. 
It&#8217;s a tale as old as the modern workplace: In the 1960s, women entered the workforce en masse, ready to compete with their male counterparts for promotions, pay, and opportunity&#8212;only to find the system wasn&#8217;t built for them.&#160;...</description>
    </item>
    <item>
      <title>On a essay&#233; l&#8217;Alpine A390 : tout simplement la plus puissante des voitures &#233;lectriques fran&#231;aises avec 3 moteurs</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2883697_on-a-essaye-lalpine-a390-tout-simplement-la-plus-puissante-des-voitures-electriques-francaises-avec-3-moteurs</link>
      <pubDate>Thu, 04 Dec 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2883697_on-a-essaye-lalpine-a390-tout-simplement-la-plus-puissante-des-voitures-electriques-francaises-avec-3-moteurs</guid>
      <description>
Nous avons test&#233; l'Alpine A390, la deuxi&#232;me voiture &#233;lectrique de la marque sportive fran&#231;aise. Elle veut cumuler une exp&#233;rience de conduite au meilleur niveau avec une r&#233;elle polyvalence, mais y parvient-elle ? Voici notre avis.
</description>
    </item>
    <item>
      <title>01net Awards&#160;: le meilleur casque audio de l&#8217;ann&#233;e est&#8230;</title>
      <link>https://www.01net.com/actualites/01net-awards-le-meilleur-casque-audio-de-lannee-est.html</link>
      <pubDate>Thu, 04 Dec 2025 07:59:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313562</guid>
      <description>La r&#233;daction de 01net.com d&#233;signe les meilleurs produits de l&#8217;ann&#233;e. D&#233;couvrez tous les jours les vainqueurs de chaque cat&#233;gorie jusqu&#8217;&#224; la remise des prix le 11 d&#233;cembre, en live s&#8217;il vous plait !</description>
    </item>
    <item>
      <title>I installed the TerraMaster D4&#8209;320U into my studio, and it proved to be a fast way to boost on-site data storage</title>
      <link>https://www.techradar.com/computing/terramaster-d4-320u-nas-review</link>
      <pubDate>Thu, 04 Dec 2025 07:47:00 +0000</pubDate>
      <guid isPermaLink="false">uB7c2xUhkiuTUCZEstPwKN</guid>
      <description>Designed for rack mounting, this 4-bay direct-attached storage (DAS) offers an easy way to quickly boost desktop or NAS storage. The D4-320U is built for pure simplicity, bolts directly into a standard rack, and offers four bays that will take 3.5-inch or 2.5-inch SATA drives, then connects directly to your NAS or computer through a simple USB cable....</description>
    </item>
    <item>
      <title>Google Photos va enfin accueillir la fonctionnalit&#233; qui lui manquait</title>
      <link>https://www.frandroid.com/marques/google/2897931_google-photos-va-enfin-accueillir-la-fonctionnalite-qui-lui-manquait</link>
      <pubDate>Thu, 04 Dec 2025 07:45:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2897931_google-photos-va-enfin-accueillir-la-fonctionnalite-qui-lui-manquait</guid>
      <description>
Retouchez vos cernes, vos yeux, dents et l&#232;vres dans Google Photos gr&#226;ce &#224; cette future fonctionnalit&#233;.
</description>
    </item>
    <item>
      <title>Google inaugure une nouvelle fonction IA et &#231;a tourne au fiasco</title>
      <link>https://www.01net.com/actualites/google-teste-nouvelle-fonction-ia-tourne-fiasco.html</link>
      <pubDate>Thu, 04 Dec 2025 07:30:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313473</guid>
      <description>Google a demand&#233; &#224; son IA de r&#233;&#233;crire les titres dans Discover. Le g&#233;ant du web cherchait &#224; faciliter la vie des internautes, mais l&#8217;exp&#233;rience a tourn&#233; au fiasco.</description>
    </item>
  </channel>
</rss>
