<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 04 Feb 2026 06:59:12 GMT</lastBuildDate>
    <item>
      <title>AMD &#233;voque le possible lancement d&#8217;une nouvelle Xbox en 2027</title>
      <link>https://www.frandroid.com/marques/microsoft/2965463_amd-evoque-le-possible-lancement-dune-nouvelle-xbox-en-2027</link>
      <pubDate>Wed, 04 Feb 2026 06:37:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2965463_amd-evoque-le-possible-lancement-dune-nouvelle-xbox-en-2027</guid>
      <description>
Apr&#232;s avoir nou&#233; un partenariat pluriannuel avec Microsoft en 2025, voil&#224; que AMD g&#226;che la surprise en &#233;voquant le potentiel lancement d&#8217;une nouvelle console Xbox en 2027.
</description>
    </item>
    <item>
      <title>01net morning&#160;: 1G en Porsche Cayenne &#233;lectrique, les apps m&#233;t&#233;o ont du mal avec la neige, perquisition chez X en France</title>
      <link>https://www.01net.com/actualites/01net-morning-1g-en-porsche-cayenne-electrique-les-apps-meteo-ont-du-mal-avec-la-neige-perquisition-chez-x-en-france.html</link>
      <pubDate>Wed, 04 Feb 2026 06:30:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323993</guid>
      <description>Bonjour &#224; tous, voici la matinale de 01net ! Qu&#8217;avez-vous manqu&#233; hier ? Retrouvez toute l&#8217;actu &#224; connaitre pour d&#233;marrer la journ&#233;e du bon pied !</description>
    </item>
    <item>
      <title>Ce forfait 5G est l&#8217;un des rares &#224; ne pas r&#233;duire votre data une fois la fronti&#232;re pass&#233;e</title>
      <link>https://www.frandroid.com/bons-plans/2964241_ce-forfait-5g-est-lun-des-rares-a-ne-pas-reduire-votre-data-une-fois-la-frontiere-passee</link>
      <pubDate>Wed, 04 Feb 2026 06:25:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2964241_ce-forfait-5g-est-lun-des-rares-a-ne-pas-reduire-votre-data-une-fois-la-frontiere-passee</guid>
      <description>
SFR revoit &#224; la hausse son forfait interm&#233;diaire en ajoutant 50 % de data suppl&#233;mentaire sans toucher au prix. L'offre devient incontournable pour les frontaliers et les abonn&#233;s box qui b&#233;n&#233;ficient d'un tarif pr&#233;f&#233;rentiel imbattable.
</description>
    </item>
    <item>
      <title>On a vu la Tesla Model Y L : la preuve que Tesla ma&#238;trise encore son sujet</title>
      <link>https://www.frandroid.com/marques/tesla/2965389_on-a-vu-la-tesla-model-y-l-la-preuve-que-tesla-maitrise-encore-son-sujet</link>
      <pubDate>Wed, 04 Feb 2026 06:20:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2965389_on-a-vu-la-tesla-model-y-l-la-preuve-que-tesla-maitrise-encore-son-sujet</guid>
      <description>
Vous trouvez le Model Y trop juste pour vos trois enfants ? Regardez ce qui arrive. La Model Y L d&#233;barque avec 20 cm de plus et une configuration int&#233;rieure royale. On a pu la voir en Chine.
</description>
    </item>
    <item>
      <title>Companies replaced entry-level workers with AI.&#160;Now they are paying the price</title>
      <link>https://www.fastcompany.com/91483431/companies-replaced-entry-level-workers-with-ai</link>
      <pubDate>2026-02-04T06:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91483431/companies-replaced-entry-level-workers-with-ai</guid>
      <description>Recent graduates are clearly not okay&#8212;but neither are the companies that decided they could do without them.
Isaac, 33, has been a mid-level software development engineer at a Big Tech firm for four years, and noticed entry-level job postings dropping at his workplace at the start of 2025. The work, however, didn&#8217;t vanish with them. Tasks once handled by junior engineers&#8212;like writing and testing code, fixing bugs, and contributing to development projects&#8212;were absorbed by senior staff, often with the assumption that AI would make up the difference.And while AI has sped up the velocity of shippi...</description>
    </item>
    <item>
      <title>AMD suggests the next-gen Xbox will arrive in 2027</title>
      <link>https://www.engadget.com/gaming/xbox/amd-suggests-the-next-gen-xbox-will-arrive-in-2027-052707822.html?src=rss</link>
      <pubDate>Wed, 04 Feb 2026 05:27:07 +0000</pubDate>
      <guid isPermaLink="false">45dba99a-4789-46c1-92c6-6eaa3b9df9e0</guid>
      <description>Microsoft could launch the next-generation Xbox console sometime in 2027, AMD CEO Lisa Su has revealed during the semiconductor company&#8217;s latest earnings call. Valve is on track to start shipping its AMD-powered Steam Machine early this year, she said, while Microsoft&#8217;s development of an Xbox with a semi-custom SOC from AMD is &#8220;progressing well to support a launch in 2027.&#8221; While it doesn&#8217;t necessarily mean Microsoft is releasing a new Xbox console next year, that seems to be the company&#8217;s current goal. Xbox president Sarah Bond announced Microsoft&#8217;s multi-year partnership with AMD for its con...</description>
    </item>
    <item>
      <title>Hurdle hints and answers for February 4, 2026</title>
      <link>https://mashable.com/article/hurdle-hints-answers-february-4-2026</link>
      <pubDate>Wed, 04 Feb 2026 05:00:00 +0000</pubDate>
      <guid isPermaLink="false">062gFaDTfUEZG3hcNSRYP8p</guid>
      <description>Hints and answers to today's Hurdle all in one place.</description>
    </item>
    <item>
      <title>How to cancel your Tinder subscription</title>
      <link>https://mashable.com/article/how-to-cancel-tinder-subscription</link>
      <pubDate>Wed, 04 Feb 2026 05:00:00 +0000</pubDate>
      <guid isPermaLink="false">017K2BLeWVM6Lu63no9TkwB</guid>
      <description>How to cancel Tinder Plus, Gold, and Platinum, the dating app's paid subscription tiers.</description>
    </item>
  </channel>
</rss>
