<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 08 Jan 2026 11:25:06 GMT</lastBuildDate>
    <item>
      <title>Skullcandy's new earbuds put AI in your ears &#8211;but there's a catch</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/skullcandys-new-earbuds-put-ai-in-your-ears-but-theres-a-catch</link>
      <pubDate>Thu, 08 Jan 2026 11:20:14 +0000</pubDate>
      <guid isPermaLink="false">VZzvYNsZspK2qJXNatoUYf</guid>
      <description>Skull AI comes out of beta to bring AI, exclusively to your 540 ANC earbuds</description>
    </item>
    <item>
      <title>Free Mobile&#160;: si vous avez le forfait &#224; 2&#160;&#8364;, attention au nouveau r&#233;pondeur</title>
      <link>https://www.01net.com/actualites/free-mobile-forfait-2-euros-attention-nouveau-repondeur.html</link>
      <pubDate>Thu, 08 Jan 2026 11:19:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318806</guid>
      <description>Free Mobile veut simplifier la vie de ses abonn&#233;s en activant d'office la Messagerie Vocale Visuelle (MVV). Plus besoin de composer le 666 pour &#233;couter vos messages, ils s'affichent d&#233;sormais directement sur votre smartphone.</description>
    </item>
    <item>
      <title>Boulanger brade un tas de produit Tech durant les soldes d&#8217;hiver : voici le TOP 15 des deals &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2931541_boulanger-degaine-de-belles-offres-pour-les-soldes-dhiver-les-10-offres-qui-meritent-votre-argent</link>
      <pubDate>Thu, 08 Jan 2026 11:18:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931541_boulanger-degaine-de-belles-offres-pour-les-soldes-dhiver-les-10-offres-qui-meritent-votre-argent</guid>
      <description>
Les soldes d&#8217;hiver 2026 viennent tout juste de commencer, donnant une excellente opportunit&#233; d'optimiser ses achats Tech. Pour bien entamer l&#8217;ann&#233;e, le site Boulanger d&#233;ploie une s&#233;rie de remises attractives sur une large gamme de produits. D&#233;couvrez en temps r&#233;el notre s&#233;lection des meilleures offres &#224; ne pas manquer.
</description>
    </item>
    <item>
      <title>ChatGPT Health is a new space for medical questions that works with your health data &#8212; but OpenAI insists it's not designed to replace your doctor</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/chatgpt-health-is-a-new-space-for-medical-questions-that-works-with-your-health-data-but-openai-insists-its-not-designed-to-replace-your-doctor</link>
      <pubDate>Thu, 08 Jan 2026 11:15:58 +0000</pubDate>
      <guid isPermaLink="false">KZUqTuAXVw5PbHowbEoDEH</guid>
      <description>ChatGPT Health is a new space for medical questions &#8212; and it works with your health records and apps, but OpenAI isn&#8217;t claiming it can replace your doctor.</description>
    </item>
    <item>
      <title>Amazon frappe fort pour le d&#233;but des soldes d&#8217;hiver : les 8 deals Tech &#224; retenir</title>
      <link>https://www.frandroid.com/actualites-generales/2933045_amazon-frappe-fort-pour-le-debut-des-soldes-dhiver-les-10-deals-tech-a-retenir</link>
      <pubDate>Thu, 08 Jan 2026 11:11:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2933045_amazon-frappe-fort-pour-le-debut-des-soldes-dhiver-les-10-deals-tech-a-retenir</guid>
      <description>
Les soldes d&#8217;hiver viennent de d&#233;buter, et si Amazon n'indique pas clairement sa participation &#224; l'&#233;v&#233;nement, de nombreux produits Tech se trouvent &#224; prix cass&#233;s chez le g&#233;ant du e-commerce. L&#8217;occasion parfaite de s&#8217;&#233;quiper malin pour bien d&#233;marrer l'ann&#233;e 2026.
</description>
    </item>
    <item>
      <title>Everything announced at CES 2026</title>
      <link>https://www.engadget.com/general/everything-announced-at-ces-2026-130124802.html?src=rss</link>
      <pubDate>Thu, 08 Jan 2026 11:05:01 +0000</pubDate>
      <guid isPermaLink="false">fd3b4bbf-1b78-4e34-9914-70a2e6f85389</guid>
      <description>It's the first week of a new year and there's no time for the tech world to slowly ease back into things following the holidays. That's because CES 2026 is in full swing, with all manner of companies descending on Las Vegas to reveal their latest innovations and what they're planning to bring your way in the near future.&#160;Many of the Engadget crew are on the ground to check out as much of the new tech as possible. Of course, we're keeping tabs on all of the major CES press conferences too. Samsung held its First Look presentation, which focuses on home products, while LG has shown off a wide ar...</description>
    </item>
    <item>
      <title>Gr&#226;ce aux Soldes, ce laptop Lenovo avec &#233;cran OLED 3K tactile et Snapdragon X Elite est brad&#233; &#224; -40%</title>
      <link>https://www.frandroid.com/bons-plans/2934535_grace-aux-soldes-ce-laptop-lenovo-avec-ecran-oled-3k-tactile-et-snapdragon-x-elite-est-brade-a-40</link>
      <pubDate>Thu, 08 Jan 2026 11:03:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2934535_grace-aux-soldes-ce-laptop-lenovo-avec-ecran-oled-3k-tactile-et-snapdragon-x-elite-est-brade-a-40</guid>
      <description>
Le Lenovo Yoga Slim 7x est un ultrabook premium puissant avec une architecture ARM Snapdragon X Elite. Pendant les Soldes d'hiver 2026, il passe de 1 529,99 euros &#224; 917,99 euros.
</description>
    </item>
    <item>
      <title>Warner Bros dit non &#224; Paramount, l&#8217;accord avec Netflix tient bon</title>
      <link>https://www.01net.com/actualites/warner-bros-dit-non-a-paramount-laccord-avec-netflix-tient-bon.html</link>
      <pubDate>Thu, 08 Jan 2026 11:02:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318807</guid>
      <description>Netflix reste le favori pour le rachat de Warner Bros Discovery. Malgr&#233; la contre-offre plus &#233;lev&#233;e de Paramount, le conseil d'administration a vot&#233; en faveur du leader de la VOD. Paramount semble &#234;tre d&#233;finitivement hors course.</description>
    </item>
    <item>
      <title>Disney+ change radicalement avec nouveau flux inspir&#233; de TikTok qui va bouleverser l&#8217;application</title>
      <link>https://www.frandroid.com/culture-tech/2934629_disney-change-radicalement-avec-nouveau-flux-inspire-de-tiktok-qui-va-bouleverser-lapplication</link>
      <pubDate>Thu, 08 Jan 2026 11:01:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/2934629_disney-change-radicalement-avec-nouveau-flux-inspire-de-tiktok-qui-va-bouleverser-lapplication</guid>
      <description>
Un flux de vid&#233;os verticales personnalis&#233; fera bient&#244;t son apparition sur la plateforme de streaming.
</description>
    </item>
    <item>
      <title>A critical n8n flaw has been discovered - here's how to stay safe</title>
      <link>https://www.techradar.com/pro/security/a-critical-n8n-flaw-has-been-discovered-heres-how-to-stay-safe</link>
      <pubDate>Thu, 08 Jan 2026 11:01:29 +0000</pubDate>
      <guid isPermaLink="false">kbXUvGcBT9mmaNnobNQbUY</guid>
      <description>A patch and workarounds are available.</description>
    </item>
    <item>
      <title>How Mormons Helped Make America&#8217;s Prepping Industry Into Big Business</title>
      <link>https://www.wired.com/story/true-patriots-are-cashing-in-on-the-apocalypse/</link>
      <pubDate>Thu, 08 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">693c6253199888f1c10473e3</guid>
      <description>How two big names in mainstream disaster preparedness helped sell Americans on fear, anxiety and a new generator.</description>
    </item>
    <item>
      <title>Adieu le bruit : cette technologie s&#8217;appr&#234;te &#224; supprimer d&#233;finitivement les ventilateurs de nos PC portables</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/2935011_adieu-le-bruit-cette-technologie-sapprete-a-supprimer-definitivement-les-ventilateurs-de-nos-pc-portables</link>
      <pubDate>Thu, 08 Jan 2026 10:58:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/2935011_adieu-le-bruit-cette-technologie-sapprete-a-supprimer-definitivement-les-ventilateurs-de-nos-pc-portables</guid>
      <description>
Et si nos PC du futur n'&#233;taient plus &#233;quip&#233;s de ventilateurs m&#233;caniques ? C'est l'id&#233;e derri&#232;re la technologie de YPlasma, qui se base sur des actionneurs &#224; plasma pour refroidir les composants. On vous explique tout &#231;a.
</description>
    </item>
    <item>
      <title>Galaxy Ring coinc&#233;e au doigt : apr&#232;s des mois d&#8217;enqu&#234;te, Samsung l&#232;ve le voile sur ce qui s&#8217;est vraiment pass&#233;</title>
      <link>https://www.frandroid.com/marques/samsung/2935041_galaxy-ring-coincee-au-doigt-apres-des-mois-denquete-samsung-leve-le-voile-sur-ce-qui-sest-vraiment-passe</link>
      <pubDate>Thu, 08 Jan 2026 10:56:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2935041_galaxy-ring-coincee-au-doigt-apres-des-mois-denquete-samsung-leve-le-voile-sur-ce-qui-sest-vraiment-passe</guid>
      <description>
Il y a quelques mois, un vid&#233;aste racontait avoir vu sa Galaxy Ring enfler au point de ne plus pouvoir la retirer. Apr&#232;s plusieurs mois d'enqu&#234;te, Samsung se veut rassurant. 
</description>
    </item>
    <item>
      <title>This pocket-sized Bluetooth speaker takes aim at the JBL Go 4 &#8212; but sadly, 3 key flaws hold it back</title>
      <link>https://www.techradar.com/audio/wireless-bluetooth-speakers/tribit-pocketgo-review</link>
      <pubDate>Thu, 08 Jan 2026 10:56:02 +0000</pubDate>
      <guid isPermaLink="false">cX6tEhTWBvKjNBUQ8DnXoG</guid>
      <description>I reviewed a cheap alternative to JBL&#8217;s smallest Bluetooth speaker &#8212; is it worth buying?</description>
    </item>
    <item>
      <title>&#8216;An inexcusable mistake&#8217;: Logitech just broke its own macOS apps, but a fix is available</title>
      <link>https://www.techradar.com/computing/an-inexcusable-mistake-logitech-just-broke-its-own-macos-apps-but-a-fix-is-available</link>
      <pubDate>Thu, 08 Jan 2026 10:51:56 +0000</pubDate>
      <guid isPermaLink="false">DXwa2f2XmbPhrDxxCrfVAQ</guid>
      <description>An expired certificate broke Logitech&#8217;s macOS apps, but the company has released a fix.</description>
    </item>
    <item>
      <title>You won&#8217;t be able to buy Samsung&#8217;s household Ballie robot after all</title>
      <link>https://www.engadget.com/home/smart-home/you-wont-be-able-to-buy-samsungs-household-ballie-robot-after-all-104529942.html?src=rss</link>
      <pubDate>Thu, 08 Jan 2026 10:45:29 +0000</pubDate>
      <guid isPermaLink="false">e67d0c2d-2e13-4c2a-8c50-20235f342fe8</guid>
      <description>For years, we&#8217;ve been wondering when Samsung would actually bring Ballie, its cute household companion robot, to market and now we finally have our answer: it won&#8217;t. After the planned summer 2025 release window came and went, the company has opted not to release the gizmo as a consumer product, at least not for the foreseeable future.&#160;According to Bloomberg, Samsung has "indefinitely shelved" the robot. A spokesperson told the publication that the company will keep Ballie around as an "active innovation platform" internally. "After multiple years of real-world testing, it continues to inform h...</description>
    </item>
    <item>
      <title>On a vu le Govee Ceiling Light Ultra, un plafonnier compos&#233; de 616 LED</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/2932151_on-a-vu-le-govee-ceiling-light-ultra-un-plafonnier-compose-de-616-led</link>
      <pubDate>Thu, 08 Jan 2026 10:41:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/2932151_on-a-vu-le-govee-ceiling-light-ultra-un-plafonnier-compose-de-616-led</guid>
      <description>
Govee continue d'&#233;toffer sa gamme au CES 2026 avec une annonce qui risque de faire de l'ombre aux luminaires classiques. Son nouveau plafonnier ne se contente plus d'&#233;clairer une pi&#232;ce, mais l'habille en transformant le plafond en un v&#233;ritable tableau lumineux.
</description>
    </item>
    <item>
      <title>La Dacia Spring &#233;lectrique est d&#233;sormais disponible &#224; moins de 12 000 &#8364;, mais il y a un gros mais</title>
      <link>https://www.frandroid.com/marques/dacia/2934687_la-dacia-spring-electrique-est-desormais-disponible-a-moins-de-12-000-e-mais-il-y-a-un-gros-mais</link>
      <pubDate>Thu, 08 Jan 2026 10:41:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dacia/2934687_la-dacia-spring-electrique-est-desormais-disponible-a-moins-de-12-000-e-mais-il-y-a-un-gros-mais</guid>
      <description>
La Dacia Spring vous fait de l&#8217;&#339;il&#160;? Sachez que la petite voiture &#233;lectrique est disponible &#224; partir de 11 990 euros seulement dans plusieurs pays d'Europe... mais pas en France.
</description>
    </item>
    <item>
      <title>C&#8217;est durant les soldes que la Google Pixel Watch 4 s&#8217;affiche &#224; son prix le plus bas</title>
      <link>https://www.frandroid.com/bons-plans/2893591_cest-durant-les-soldes-que-la-google-pixel-watch-4-saffiche-a-son-prix-le-plus-bas</link>
      <pubDate>Thu, 08 Jan 2026 10:35:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2893591_cest-durant-les-soldes-que-la-google-pixel-watch-4-saffiche-a-son-prix-le-plus-bas</guid>
      <description>
La Google Pixel Watch 4 profite d&#8217;une belle remise &#224; l&#8217;occasion des soldes d&#8217;hiver&#8239;: affich&#233;e &#224; seulement 299 &#8364; au lieu de 399&#8239;&#8364;, la montre connect&#233;e de Google atteint son prix le plus bas &#224; ce jour. Une opportunit&#233; id&#233;ale pour ceux qui veulent s&#8217;&#233;quiper d&#8217;un mod&#232;le haut de gamme tout en r&#233;alisant de vraies &#233;conomies.
</description>
    </item>
    <item>
      <title>Les hackers chinois multiplient les cyberattaques contre Ta&#239;wan</title>
      <link>https://www.01net.com/actualites/hackers-chinois-multiplient-cyberattaques-contre-taiwan.html</link>
      <pubDate>Thu, 08 Jan 2026 10:30:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318776</guid>
      <description>Ta&#239;wan est la cible d&#8217;une vague de cyberattaques chinoises. Au cours de l'ann&#233;e &#233;coul&#233;e, la Chine a multipli&#233; les offensives contre les infrastructures critiques du pays. P&#233;kin concentre d&#233;sormais ses attaques sur l&#8217;&#233;nergie et sur les services de secours.</description>
    </item>
    <item>
      <title>This Is the Blood Glucose Monitor We&#8217;ve Been Waiting For</title>
      <link>https://www.wired.com/story/blood-glucose-monitor-preevnt-isaac/</link>
      <pubDate>Thu, 08 Jan 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">695dae8c3c4519c214a25d4f</guid>
      <description>Makers of smartwatches and other wearables have spent years trying to measure blood sugar without pricking your skin. The PreEvnt Issac does just that, and you wear it like a necklace.</description>
    </item>
    <item>
      <title>CES: Five tools to revamp your home office in 2026</title>
      <link>https://www.fastcompany.com/91470504/ces-xbec-libernova-motorola</link>
      <pubDate>2026-01-08T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91470504/ces-xbec-libernova-motorola</guid>
      <description>A suite of options to make work-life easier for home-based employees.
Working from home might be frowned upon at some companies these days, but the rising number of layoffs last year and the growing collection of workers who are launching their own businesses means the number of people working out of a home office is on the rise.</description>
    </item>
    <item>
      <title>Score an Apple Watch Series 11 for its lowest-ever price at Amazon &#8212; save $100</title>
      <link>https://mashable.com/article/jan-8-apple-watch-series-11-deal</link>
      <pubDate>Thu, 08 Jan 2026 10:26:10 +0000</pubDate>
      <guid isPermaLink="false">02VMd7fjTojIsaHBXZFfBOR</guid>
      <description>As of Jan. 8, select models of the Apple Watch Series 11 (GPS, 42mm) are back to their lowest-ever price at Amazon of $299, 25% off their list price of $399.</description>
    </item>
    <item>
      <title>J&#8217;ai demand&#233; d&#8217;afficher un chien &#224; ces lumi&#232;res connect&#233;es : voici ce que peut faire Govee</title>
      <link>https://www.frandroid.com/produits-android/2932177_jai-demande-dafficher-un-chien-a-mes-lumieres-connectee-voici-ce-que-peut-faire-govee</link>
      <pubDate>Thu, 08 Jan 2026 10:17:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2932177_jai-demande-dafficher-un-chien-a-mes-lumieres-connectee-voici-ce-que-peut-faire-govee</guid>
      <description>
J'ai pu prendre en main le nouvel AI Lighting Bot 2.0, une technologie capable de transformer une simple id&#233;e en une animation lumineuse complexe sur un simple luminaire.
</description>
    </item>
    <item>
      <title>Latest Fortnite trailer reveals South Park crossover event with time-limited playlist featuring Cartman and co</title>
      <link>https://www.techradar.com/gaming/latest-fortnite-trailer-reveals-south-park-crossover-event-with-time-limited-playlist-featuring-cartman-and-co</link>
      <pubDate>Thu, 08 Jan 2026 10:16:14 +0000</pubDate>
      <guid isPermaLink="false">4q2UnL5N7iR5vAayXDyJik</guid>
      <description>The next Fortnite crossover has been confirmed to be with South Park and will add Cartman, Kenny, Stan, Kyle, and Butters to the Item Shop, along with a limited-time 5-person playlist called Quints.</description>
    </item>
    <item>
      <title>The Pitt season 2 won't be the popular HBO Max show's final entry as HBO officially announces its third season</title>
      <link>https://www.techradar.com/streaming/hbo-max/the-pitt-season-2-wont-be-the-popular-hbo-max-shows-final-entry-as-hbo-officially-announces-third-season</link>
      <pubDate>Thu, 08 Jan 2026 10:16:04 +0000</pubDate>
      <guid isPermaLink="false">bPu8b6qifvGsmTQwhn8mPR</guid>
      <description>The Pitt has scored a season 3 renewal amid rave reviews for the hit medical drama's second season.</description>
    </item>
    <item>
      <title>Fnac et Darty sortent le grand jeu pour le d&#233;but des soldes : les meilleurs deals &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-cassent-les-prix-pour-les-soldes-dhiver-2026-les-meilleures-offres-tech-a-ne-pas-rater</link>
      <pubDate>Thu, 08 Jan 2026 10:15:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-cassent-les-prix-pour-les-soldes-dhiver-2026-les-meilleures-offres-tech-a-ne-pas-rater</guid>
      <description>
Les soldes d&#8217;hiver 2026 viennent de commencer&#8239;! C&#8217;est l&#8217;occasion parfaite pour profiter de belles offres sans faire exploser votre budget. Fnac et Darty affichent d&#233;j&#224; de fortes r&#233;ductions sur une large s&#233;lection de produits Tech : d&#233;couvrez les meilleurs bons plans pour bien d&#233;marrer l&#8217;ann&#233;e&#8239;!
</description>
    </item>
    <item>
      <title>The Anker 3-in-1 charging station is back on sale at Amazon &#8212; save over $60 right now</title>
      <link>https://mashable.com/article/jan-8-anker-3-in-1-charger-deal</link>
      <pubDate>Thu, 08 Jan 2026 10:15:19 +0000</pubDate>
      <guid isPermaLink="false">07tOLCVDsKIppHPksrUKk7S</guid>
      <description>Find the best charger deal at Amazon. Save 30% on the Anker 3-in-1 charger at Amazon.</description>
    </item>
    <item>
      <title>A new Wolfenstein game is in development according to multiple sources</title>
      <link>https://www.techradar.com/gaming/a-new-wolfenstein-game-is-in-development-according-to-multiple-sources</link>
      <pubDate>Thu, 08 Jan 2026 10:12:18 +0000</pubDate>
      <guid isPermaLink="false">nUwSDkQAMVAB5yEKWkSBwR</guid>
      <description>Wolfenstein 3 is reportedly in the works at MachineGames, developer of Indiana Jones and the Great Circle and the modern Wolfenstein series.</description>
    </item>
    <item>
      <title>Ni magie, ni fus&#233;es : voici comment la Tesla Roadster pr&#233;voit de faire un 0 &#224; 100 km/h en 1 seconde</title>
      <link>https://www.frandroid.com/survoltes/2934589_ni-magie-ni-fusees-voici-comment-la-tesla-roadster-prevoit-de-faire-un-0-a-100-km-h-en-1-seconde</link>
      <pubDate>Thu, 08 Jan 2026 10:12:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2934589_ni-magie-ni-fusees-voici-comment-la-tesla-roadster-prevoit-de-faire-un-0-a-100-km-h-en-1-seconde</guid>
      <description>
Tesla va-t-il vraiment casser les lois de la physique avec son Roadster ? Pas tout &#224; fait&#8230; mais un brevet montre comment la voiture pourrait litt&#233;ralement &#234;tre &#171; aspir&#233;e &#187; au sol. En gros, Tesla veut transformer le dessous de la voiture en &#233;norme souffleuse pour cr&#233;er du grip d&#232;s 0 km/h, sans magie ni fus&#233;es.
</description>
    </item>
    <item>
      <title>Ce smartphone sous Android n&#8217;en est pas un : voici la DuRoBo Krono</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2934807_ce-smartphone-sous-android-nen-est-pas-un-voici-la-durobo-krono</link>
      <pubDate>Thu, 08 Jan 2026 10:08:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2934807_ce-smartphone-sous-android-nen-est-pas-un-voici-la-durobo-krono</guid>
      <description>
La start-up DuRoBo a profit&#233; du CES 2026 pour pr&#233;senter la Krono, un appareil hybride &#224; mi-chemin entre le smartphone et la liseuse. Con&#231;u autour d'un &#233;cran e-paper et fonctionnant sous Android, ce terminal mise sur la productivit&#233; et la r&#233;duction de la fatigue oculaire pour s&#233;duire un public satur&#233; par les &#233;crans classiques.
</description>
    </item>
    <item>
      <title>This like-new Amazon Fire HD 8 tablet is on sale for under $80</title>
      <link>https://mashable.com/article/jan-8-fire-tablet-8-deal</link>
      <pubDate>Thu, 08 Jan 2026 10:07:16 +0000</pubDate>
      <guid isPermaLink="false">018WyELdu23MdjjBo3TKHn9</guid>
      <description>Find the best tablet deal at Amazon. Save 11% on the Like-New Amazon Fire HD 8 tablet.</description>
    </item>
    <item>
      <title>D&#233;&#231;u par l&#8217;autonomie de sa Peugeot &#233;lectrique, il obtient son remboursement int&#233;gral en justice</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2934515_decu-par-lautonomie-de-sa-peugeot-electrique-il-obtient-son-remboursement-integral-en-justice</link>
      <pubDate>Thu, 08 Jan 2026 10:06:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2934515_decu-par-lautonomie-de-sa-peugeot-electrique-il-obtient-son-remboursement-integral-en-justice</guid>
      <description>
Un concessionnaire Peugeot a &#233;t&#233; condamn&#233; par la justice &#224; rembourser int&#233;gralement une voiture &#233;lectrique &#224; l&#8217;un de ses clients. En cause&#160;? Une autonomie r&#233;elle nettement plus faible que celle indiqu&#233;e par le constructeur. Une affaire qui interroge notamment sur la norme WLTP.
</description>
    </item>
    <item>
      <title>Ryzen AI 9, OCuLink et z&#233;ro compromis : Minisforum nous propose le mini PC ultime pour 2026</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-fixes/mini-pc/2934901_ryzen-ai-9-oculink-et-zero-compromis-minisforum-nous-propose-le-mini-pc-ultime-pour-2026</link>
      <pubDate>Thu, 08 Jan 2026 10:04:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-fixes/mini-pc/2934901_ryzen-ai-9-oculink-et-zero-compromis-minisforum-nous-propose-le-mini-pc-ultime-pour-2026</guid>
      <description>
Tout le monde colle "IA" sur ses produits au CES 2026. Mais pour une fois, le Minisforum AI X1 Pro ne vole pas son nom. Avec une allocation m&#233;moire d&#233;lirante pour un si petit bo&#238;tier, ce n'est pas juste un gadget marketing, c'est une vraie station de travail de poche.
</description>
    </item>
    <item>
      <title>Save $150 with this new Breville Barista Express Impress deal at Amazon</title>
      <link>https://mashable.com/article/jan-8-breville-coffee-machine-deal</link>
      <pubDate>Thu, 08 Jan 2026 10:03:19 +0000</pubDate>
      <guid isPermaLink="false">066i3cL450sQ4QB1NnEHM8w</guid>
      <description>Find the best coffee machine deal at Amazon. Save 19% on the Breville Barista Express Impress at Amazon.</description>
    </item>
    <item>
      <title>The best E Ink tablets for 2026</title>
      <link>https://www.engadget.com/mobile/tablets/best-e-ink-tablet-130037939.html?src=rss</link>
      <pubDate>Thu, 08 Jan 2026 10:01:26 +0000</pubDate>
      <guid isPermaLink="false">57f41413-eec2-4d90-9c25-26d144b737b8</guid>
      <description>I&#8217;m a longtime lover of pen and paper, so E Ink tablets have been intriguing to me ever since they started becoming more widely available. After having hundreds of half-filled notebooks over the years, I, at some point, turned to digital tools instead because it was just easier to store everything on my phone or laptop so I always had my most important information at my fingertips.E-Ink tablets seem to provide the best of both worlds: the tactile satisfaction of regular notebooks with many of the conveniences found in digital tools, plus easy-on-the-eyes E-Ink screens. These devices have come ...</description>
    </item>
    <item>
      <title>Some Robots at CES Are Actually Impressive&#8230; In a Very Slow Kind of Way</title>
      <link>https://gizmodo.com/some-robots-at-ces-are-actually-impressive-in-a-very-slow-kind-of-way-2000707021</link>
      <pubDate>Thu, 08 Jan 2026 10:00:08 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000707021</guid>
      <description>They might not move quickly, but autonomous movement matters.</description>
    </item>
    <item>
      <title>Is Craigslist the Last Real Place on the Internet?</title>
      <link>https://www.wired.com/story/is-craigslist-the-last-real-place-on-the-internet/</link>
      <pubDate>Thu, 08 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">6940a61255ba708676bf1457</guid>
      <description>Millennials are still using Craigslist to find jobs, find love, and even to cast creative projects&#8212;eschewing other AI- and algorithm-dominated online spaces. &#8220;There&#8217;s a purity to it.&#8221;</description>
    </item>
    <item>
      <title>Chuck E. Cheese&#8217;s next act: &#8216;I won&#8217;t stop until we have a movie,&#8217; CEO says</title>
      <link>https://www.fastcompany.com/91448506/chuck-e-cheese-chucks-arcade-pizza-games-restaurant-entertainment-ip-nolan-bushnell-atari-six-flags</link>
      <pubDate>2026-01-08T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448506/chuck-e-cheese-chucks-arcade-pizza-games-restaurant-entertainment-ip-nolan-bushnell-atari-six-flags</guid>
      <description>Millions of kids across four generations have had a Chuck E. Cheese birthday party. How a plucky band of former Six Flags execs is positioning the 50-year-old pizza arcade spokesrodent to ride nostalgia to new heights.
You hear the blurps and bloops after you pass the food court in the Mall of Georgia on a fall Sunday afternoon, the unmistakable sound of points being scored and players eliminated....</description>
    </item>
    <item>
      <title>The innovative new battery on this electric motorcycle charges in just 5 minutes</title>
      <link>https://www.fastcompany.com/91470149/the-innovative-new-battery-on-this-electric-motorcycle-charges-in-just-5-minutes</link>
      <pubDate>2026-01-08T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91470149/the-innovative-new-battery-on-this-electric-motorcycle-charges-in-just-5-minutes</guid>
      <description>Donut Lab says its new solid-state battery is as cheap as current lithium-ion batteries, but it can charge faster, last longer, and won&#8217;t start fires.
A small Finnish startup says it has done what the world&#8217;s biggest automakers are still struggling to do: put a solid-state battery into a production vehicle, starting with a motorcycle that can charge to more than 100 miles of range in as little as five minutes....</description>
    </item>
    <item>
      <title>I asked ChatGPT to help me come up with killer New Year&#8217;s resolutions. Here&#8217;s what happened</title>
      <link>https://www.fastcompany.com/91470687/chatgpt-new-years-resolutions</link>
      <pubDate>2026-01-08T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91470687/chatgpt-new-years-resolutions</guid>
      <description>It creeps me out a bit to see how much ChatGPT knows about me.
If you&#8217;re like most Americans, you&#8217;ve already set all manner of goals and resolutions for the New Year. And likewise, if you&#8217;re like most Americans, you&#8217;ll have entirely abandoned them by February 1.&#160;</description>
    </item>
    <item>
      <title>Watch a real supernova blast evolve over 25 years in new telescope video</title>
      <link>https://mashable.com/article/nasa-chandra-kepler-supernova-remnant-video</link>
      <pubDate>Thu, 08 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">05c6eD8SLMQ10Ygo5hjttQ6</guid>
      <description>NASA's Chandra X-Ray Observatory has created an unprecedented time-lapse video of Kepler's Supernova Remnant evolving over 25 years.</description>
    </item>
    <item>
      <title>CES 2026: Meet RocX, the handheld camera with AI tracking at 50x zoom</title>
      <link>https://mashable.com/article/ces-2026-rocx-long-distance-view-ai-tracking-camera</link>
      <pubDate>Thu, 08 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">079XK3oR2HUDuoR7IQEhQ8O</guid>
      <description>The RocX at CES Unveiled from Farseer is an interesting long-distance camera solution.</description>
    </item>
    <item>
      <title>How to watch Miami vs. Ole Miss online for free</title>
      <link>https://mashable.com/article/miami-ole-miss-college-football-2026-live-stream-for-free</link>
      <pubDate>Thu, 08 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">07zolZ9MYxEsGT4X9IHHW85</guid>
      <description>How to watch college football for free. Live stream Miami vs. Ole Miss in 2026 without cable.</description>
    </item>
    <item>
      <title>Whats new to streaming this week? (Jan. 9, 2026)</title>
      <link>https://mashable.com/article/new-to-streaming-january-9-2026</link>
      <pubDate>Thu, 08 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">067l19kBHJNn6gyjHvMmSYQ</guid>
      <description>What&#8217;s new to streaming for the week of Jan. 9, 2026, on Prime Video, Disney+, and Hulu? We've got you covered.</description>
    </item>
    <item>
      <title>Growth can fit neatly between meetings with Headway Premium &#8212; just $40 for life</title>
      <link>https://mashable.com/article/jan-8-headway-premium-lifetime-subscription</link>
      <pubDate>Thu, 08 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01NuMtoX0ZVY8EppVG3tomG</guid>
      <description>Get lifetime access to Headway Premium for $39.99 and master big ideas in 15-minute summaries designed to fuel your personal growth.</description>
    </item>
    <item>
      <title>Erase your digital storage stress with 100TB while it&#8217;s on sale</title>
      <link>https://mashable.com/article/jan-8-internxt-cloud-storage-lifetime-subscription-100tb</link>
      <pubDate>Thu, 08 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01Sr6Q4wMv1SXrE0uadkxaH</guid>
      <description>Declutter your digital life with Internxt&#8217;s 100TB lifetime cloud storage plan for $974.97 &#8212; private, encrypted, and accessible across all devices.</description>
    </item>
    <item>
      <title>Bose is giving away free Ultra Open earbuds &#8212; last chance to get your pair</title>
      <link>https://mashable.com/article/jan-5-bose-ultra-open-earbuds-free-deal</link>
      <pubDate>Thu, 08 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02cot66VEjbDluZwWSpsvHO</guid>
      <description>Bose is giving away free refurbished Ultra Open earbuds when you buy the QuietComfort Ultra 2 earbuds. Here's how to get the deal.</description>
    </item>
    <item>
      <title>The 50-inch Roku Smart TV is over $50 off at Amazon</title>
      <link>https://mashable.com/article/jan-8-roku-tv-deal</link>
      <pubDate>Thu, 08 Jan 2026 09:59:00 +0000</pubDate>
      <guid isPermaLink="false">00Wt0PhqbFUQvIUINOIHusu</guid>
      <description>Find the best TV deal at Amazon. Save 17% on the Roku Smart TV 50-inch at Amazon.</description>
    </item>
    <item>
      <title>Why you need a devil&#8217;s advocate</title>
      <link>https://www.fastcompany.com/91456923/why-you-need-a-devils-advocate-devils-advocate-innovative-thinking-business-strategy-better-ideas</link>
      <pubDate>2026-01-08T09:51:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91456923/why-you-need-a-devils-advocate-devils-advocate-innovative-thinking-business-strategy-better-ideas</guid>
      <description>The secret weapon for bulletproofing your Ideas.
We all think that we have great ideas. And we all tend to fall in love with our own ideas because, well, they&#8217;re ours. But most of my ideas&#8212;and yours&#8212;are probably mediocre. And no, that&#8217;s not an insult; it&#8217;s just a fact about the way most ideas are generated. I mean, if we were all genuinely spewing game-changers the world would be in a much different place than it is today.&#160;...</description>
    </item>
    <item>
      <title>Xiaomi revamps its SU7 electric sedan with improved safety and a 570-mile range</title>
      <link>https://mashable.com/article/xiaomi-su7-revamp</link>
      <pubDate>Thu, 08 Jan 2026 09:48:12 +0000</pubDate>
      <guid isPermaLink="false">07yWt6SV8yljpAkfUyqwPo1</guid>
      <description>Xiaomi's refreshed SU7 electric sedan is now available for pre-order in China.</description>
    </item>
    <item>
      <title>Netflix d&#233;voile son programme pour 2026, et il y a de belles surprises</title>
      <link>https://www.01net.com/actualites/netflix-devoile-programme-2026-belles-surprises.html</link>
      <pubDate>Thu, 08 Jan 2026 09:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318770</guid>
      <description>Netflix vient de lever le voile sur son calendrier de sorties pour 2026, confirmant le retour de s&#233;ries tr&#232;s attendues, mais aussi de nouvelles adaptations.</description>
    </item>
    <item>
      <title>Culture is a company&#8217;s greatest cheat code. So why do so many leaders struggle to crack it?</title>
      <link>https://www.fastcompany.com/91469323/culture-company-greatest-cheat-code-leaders</link>
      <pubDate>2026-01-08T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91469323/culture-company-greatest-cheat-code-leaders</guid>
      <description>To change your culture, first you need to understand what the term actually means.
Hi there! My name is Marcus Collins, DBA, and I study culture and its influence and impact on human behavior at the Ross School of Business at the University of Michigan. Each week, this column will explore the inner workings of organizational culture and the mechanisms that make it tick. Every entry will be accompanied by an episode from my podcast, From the Culture, that digs deeper into the culture of work from my conversations with the organizational leaders that make it all happen. If culture eats strategy ...</description>
    </item>
  </channel>
</rss>
