<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 19 Jan 2026 13:52:28 GMT</lastBuildDate>
    <item>
      <title>Microsoft expands Windows backup to include restore at first sign-in</title>
      <link>https://www.techradar.com/pro/microsoft-expands-windows-backup-to-include-restore-at-first-sign-in</link>
      <pubDate>Mon, 19 Jan 2026 13:48:55 +0000</pubDate>
      <guid isPermaLink="false">8D3rbCoMmgcgfREu9Ff4Cb</guid>
      <description>Windows 11 users will be able to restore settings to the very first sign-in.</description>
    </item>
    <item>
      <title>Galaxy Z Fold 6, Galaxy S25&#8230; les 16 meilleures offres Samsung lors des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2939747_galaxy-z-fold-6-galaxy-s25-les-16-meilleures-offres-samsung-lors-des-soldes</link>
      <pubDate>Mon, 19 Jan 2026 13:23:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2939747_galaxy-z-fold-6-galaxy-s25-les-16-meilleures-offres-samsung-lors-des-soldes</guid>
      <description>
La 3e d&#233;marque des soldes approche &#224; grands pas et les offres restent toujours attractives, notamment du c&#244;t&#233; des produits Samsung. Entre smartphones pliant &#224; -50 %, TV OLED en r&#233;duction et &#233;crans Ultra Wide OLED, il y en a pour tous les go&#251;ts.
</description>
    </item>
    <item>
      <title>Adobe refuse de le faire, un d&#233;veloppeur a r&#233;ussi &#224; installer Photoshop sur Linux</title>
      <link>https://www.frandroid.com/os/gnu-linux/2947337_adobe-refuse-de-le-faire-mais-ce-developpeur-a-reussi-voici-comment-installer-photoshop-sur-linux</link>
      <pubDate>Mon, 19 Jan 2026 13:17:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/gnu-linux/2947337_adobe-refuse-de-le-faire-mais-ce-developpeur-a-reussi-voici-comment-installer-photoshop-sur-linux</guid>
      <description>
Grande nouvelle pour les cr&#233;atifs sur Linux : l'installation de la suite Adobe Creative Suite est enfin possible gr&#226;ce &#224; l'outil Wine.
</description>
    </item>
    <item>
      <title>Forget IKEA's donut lamp &#8211; its new indoor-outdoor lamp looks like an affordable winner and it's back in stock</title>
      <link>https://www.techradar.com/home/forget-ikeas-donut-lamp-its-new-indoor-outdoor-lamp-looks-like-an-affordable-winner-and-its-back-in-stock</link>
      <pubDate>Mon, 19 Jan 2026 13:13:06 +0000</pubDate>
      <guid isPermaLink="false">Z4h3AneLpRq2wSKP98AYsF</guid>
      <description>Looking to add some style and a cozy vibe to your living spaces? The new Solvinden model could be perfect.</description>
    </item>
    <item>
      <title>The best entry-level Hi-Res Audio player is getting a new version for 2026 &#8212; make the most of lossless streaming, or up to 2TB of your own files</title>
      <link>https://www.techradar.com/audio/portable-media-players/the-best-entry-level-hi-res-audio-player-is-getting-a-new-version-for-2026-make-the-most-of-lossless-streaming-or-up-to-2tb-of-your-own-files</link>
      <pubDate>Mon, 19 Jan 2026 13:08:03 +0000</pubDate>
      <guid isPermaLink="false">x3yZ78qPuKFhDhvZVJfgsW</guid>
      <description>Fiio's portable player gets a battery boost and more storage. It's a brilliant budget buy</description>
    </item>
    <item>
      <title>Soldes 2026 : ce disque dur externe Seagate pour PS4 et PS5 baisse de prix alors que celui des SSD explosent, une alternative &#224; envisager</title>
      <link>https://www.frandroid.com/bons-plans/2947415_soldes-2026-ce-disque-dur-externe-seagate-pour-ps4-et-ps5-baisse-de-prix-alors-que-celui-des-ssd-explosent-une-alternative-a-envisager</link>
      <pubDate>Mon, 19 Jan 2026 13:05:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2947415_soldes-2026-ce-disque-dur-externe-seagate-pour-ps4-et-ps5-baisse-de-prix-alors-que-celui-des-ssd-explosent-une-alternative-a-envisager</guid>
      <description>
Sur Amazon, vous avez l'occasion de commander le Seagate Game Drive 5 To pour PS4 et PS5 &#224; 156,99 euros au lieu de 175,99 euros, une alternative solide pour stocker vos jeux &#224; l'heure de la flamb&#233;e des prix.
</description>
    </item>
    <item>
      <title>&#8217;28 Years Later: The Bone Temple&#8217; Runs to Decent Box Office Start</title>
      <link>https://gizmodo.com/28-years-later-the-bone-temple-runs-to-decent-box-office-start-2000711607</link>
      <pubDate>Mon, 19 Jan 2026 13:00:16 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711607</guid>
      <description>Some have taken a visit to the Bone Temple over the weekend, but coming out months after the first '28 Years Later' might not've helped.</description>
    </item>
    <item>
      <title>Are DJI Drones Still Banned? (2026)</title>
      <link>https://www.wired.com/story/whats-going-on-with-the-dji-drone-ban/</link>
      <pubDate>Mon, 19 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">696a5d66882fa5e83888b744</guid>
      <description>Can you still buy a DJI drone in the US? (Yes.) Will you be able to buy future drones? (Maybe.) Here are the current DJI dos and don&#8217;ts.</description>
    </item>
    <item>
      <title>Top architects reveal their dream projects for 2026</title>
      <link>https://www.fastcompany.com/91471342/top-architects-reveal-their-dream-projects-for-2026</link>
      <pubDate>2026-01-19T13:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91471342/top-architects-reveal-their-dream-projects-for-2026</guid>
      <description>Seven architects lay out their dream projects for 2026, from project types to specific buildings.
Being a field dependent on big developer clients and even bigger sums of money, rarely do architects get to pick the projects they work on. Would they if they could? Absolutely.</description>
    </item>
    <item>
      <title>The next Apple Watch ban? New lawsuit targets the &#8216;fall detection&#8217; tech in your favorite smartwatches</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/the-next-apple-watch-ban-new-lawsuit-targets-the-fall-detection-tech-in-your-favorite-smartwatches</link>
      <pubDate>Mon, 19 Jan 2026 12:59:49 +0000</pubDate>
      <guid isPermaLink="false">wsGnq9iXmy5sSCsrKsEoGj</guid>
      <description>Some of the best smartwatches could be banned from import over a fall detection patent dispute.</description>
    </item>
    <item>
      <title>The upsides to not fitting in with your company culture</title>
      <link>https://www.fastcompany.com/91472915/upsides-not-fitting-with-your-company-culture</link>
      <pubDate>2026-01-19T12:59:16</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91472915/upsides-not-fitting-with-your-company-culture</guid>
      <description>Being a moderate misfit can be good for you and the organization.
Most organizations still hire for culture fit&#8212;even those that loudly champion diversity and inclusion. The phrase sounds benign, even wise: who wouldn&#8217;t want colleagues who &#8220;fit in&#8221;? But behind this feel-good notion lies one of the biggest obstacles to innovation and progress in modern workplaces. Culture fit has become a euphemism for cultural cloning: selecting people who already look, think, and behave like the incumbents. It&#8217;s a polite way of saying, we want people like us, because there&#8217;s nothing more comforting than workin...</description>
    </item>
    <item>
      <title>So you got a new robot vacuum &#8211; here are 7 things to do first</title>
      <link>https://www.techradar.com/home/robot-vacuums/so-you-got-a-new-robot-vacuum-here-are-7-things-to-do-first</link>
      <pubDate>Mon, 19 Jan 2026 12:53:03 +0000</pubDate>
      <guid isPermaLink="false">G5ZhYEKDYG8eAN3V2PdgQ</guid>
      <description>Not sure where to start with your new robovac? Follow these 7 steps and you'll be well on your way.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs vid&#233;oprojecteurs en 2026&#8201;? Notre s&#233;lection</title>
      <link>https://www.frandroid.com/guide-dachat/843269_meilleurs-videoprojecteurs-selection</link>
      <pubDate>Mon, 19 Jan 2026 12:45:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/843269_meilleurs-videoprojecteurs-selection</guid>
      <description>
M&#234;me si les TV sont de plus en plus grandes, le meilleur moyen de reproduire une exp&#233;rience cin&#233;ma chez soi reste d'utiliser un projecteur. D&#233;couvrez notre s&#233;lection des meilleurs vid&#233;oprojecteurs test&#233;s par Frandroid.
</description>
    </item>
    <item>
      <title>D&#233;but de p&#233;nurie sur les MacBook Pro ? Ce que l&#8217;on peut d&#233;duire des d&#233;lais observ&#233;s sur certains mod&#232;les</title>
      <link>https://www.frandroid.com/marques/apple/2947287_debut-de-penurie-sur-les-macbook-pro-ce-que-lon-peut-deduire-des-delais-observes-sur-certains-modeles</link>
      <pubDate>Mon, 19 Jan 2026 12:43:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2947287_debut-de-penurie-sur-les-macbook-pro-ce-que-lon-peut-deduire-des-delais-observes-sur-certains-modeles</guid>
      <description>
Aux &#201;tats-Unis, certains mod&#232;les de MacBook Pro command&#233;s en ligne ne sont plus livr&#233;s qu'apr&#232;s deux mois d'attente. Un d&#233;lai important qui n'augure peut-&#234;tre pas d'une si mauvaise nouvelle.
</description>
    </item>
    <item>
      <title>Why AI skills are the new gold standard for job seekers</title>
      <link>https://www.fastcompany.com/91462113/why-ai-skills-are-the-new-gold-standard-for-job-seekers-ai-skills-hiring-job-hunting</link>
      <pubDate>2026-01-19T12:29:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91462113/why-ai-skills-are-the-new-gold-standard-for-job-seekers-ai-skills-hiring-job-hunting</guid>
      <description>How developing AI capabilities can unlock career opportunities.
Artificial intelligence capabilities have rapidly shifted from nice-to-have extras to essential requirements across industries and job levels. Employers now prioritize candidates who can harness AI tools to multiply productivity, accelerate innovation, and solve complex problems with lean resources. In this article, experts reveal how mastering AI skills can unlock career opportunities, faster promotions, and competitive advantages in today&#8217;s job market....</description>
    </item>
    <item>
      <title>Got a new Garmin watch? One hidden gesture control can return you to home and even lock your touchscreen</title>
      <link>https://www.techradar.com/health-fitness/got-a-new-garmin-watch-one-hidden-gesture-control-can-return-you-to-home-and-even-lock-your-touchscreen</link>
      <pubDate>Mon, 19 Jan 2026 12:28:50 +0000</pubDate>
      <guid isPermaLink="false">9fDmH5QA2ywi5npKcTpP6V</guid>
      <description>Deep in your Garmin watch&#8217;s maze of menus? One quick gesture should get you back to home on most watches.</description>
    </item>
    <item>
      <title>'A great TV for sports' &#8212; Amazon currently has $500 off a TV that we'd highly recommend for the Super Bowl</title>
      <link>https://www.techradar.com/televisions/a-great-tv-for-sports-amazon-currently-has-usd500-off-a-tv-that-wed-highly-recommend-for-the-super-bowl</link>
      <pubDate>Mon, 19 Jan 2026 12:24:23 +0000</pubDate>
      <guid isPermaLink="false">r5whcuAcRvr8tiuGLochNn</guid>
      <description>On the lookout for a decent TV for the big game? The TCL QM8K is an amazing choice, especially with today's massive discount at Amazon.</description>
    </item>
    <item>
      <title>The MacBook Air M4 is portable and powerful &#8212; and our favourite laptop is now at its lowest-ever price</title>
      <link>https://www.techradar.com/computing/macbooks/the-macbook-air-m4-is-portable-and-powerful-and-our-favourite-laptop-is-now-at-its-lowest-ever-price</link>
      <pubDate>Mon, 19 Jan 2026 12:24:17 +0000</pubDate>
      <guid isPermaLink="false">2yXqyqbxzfoP855vVEd3yZ</guid>
      <description>Amazon has surprised us with a record-low price for the super-impressive 13-inch MacBook Air (M4).</description>
    </item>
    <item>
      <title>A fresh Spider-Man: Brand New Day trailer release rumor is gathering pace online &#8212; and Marvel fans think it could be unveiled very soon</title>
      <link>https://www.techradar.com/streaming/entertainment/a-fresh-spider-man-brand-new-day-trailer-release-rumor-is-gathering-pace-online-and-marvel-fans-think-it-could-be-unveiled-very-soon</link>
      <pubDate>Mon, 19 Jan 2026 12:17:53 +0000</pubDate>
      <guid isPermaLink="false">9wKduwb68Ghq3bVNY39csR</guid>
      <description>A new rumor about the release of Spider-Man 4's first trailer has whipped MCU fans into a frenzy.</description>
    </item>
    <item>
      <title>Tempted to join YouTube TV? This limited deal gives you an extended free-trial period, but that's not even the best part</title>
      <link>https://www.techradar.com/streaming/tempted-to-join-youtube-tv-this-limited-deal-gives-you-an-extended-free-trial-period-but-thats-not-even-the-best-part</link>
      <pubDate>Mon, 19 Jan 2026 12:15:04 +0000</pubDate>
      <guid isPermaLink="false">956NZjyNXmWZo8n76LLLwE</guid>
      <description>As well as a 10-day free YouTube TV trial, you'll also save $46 on your first two months as a new subscriber with this deal.</description>
    </item>
    <item>
      <title>PS5, Xbox et Switch 2 fusionnent enfin gr&#226;ce &#224; une cr&#233;atrice de g&#233;nie</title>
      <link>https://www.01net.com/actualites/ps5-xbox-et-switch-2-fusionnent-enfin-grace-a-une-creatrice-de-genie.html</link>
      <pubDate>Mon, 19 Jan 2026 12:14:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320921</guid>
      <description>Une moddeuse de Hong Kong, connue sous le nom de XNZ, a r&#233;ussi l&#8217;exploit de fusionner une PS5, une Xbox Series X et une Nintendo Switch&#8239;2 dans un seul bo&#238;tier triangulaire. Sa cr&#233;ation, baptis&#233;e &#171;&#8239;Ningtendo PXBOX&#8239;5&#8239;&#187;, repousse les limites du modding et de l&#8217;ing&#233;nierie artisanale.</description>
    </item>
    <item>
      <title>C&#8217;est fini&#160;: ASUS confirme l&#8217;arr&#234;t des smartphones pour tout miser sur l&#8217;IA</title>
      <link>https://www.01net.com/actualites/cest-fini-asus-confirme-larret-des-smartphones-pour-tout-miser-sur-lia.html</link>
      <pubDate>Mon, 19 Jan 2026 12:09:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320961</guid>
      <description>Le pr&#233;sident d'ASUS, Jonney Shih, a confirm&#233; que la marque ne produirait plus de nouveaux mod&#232;les de smartphones. Plut&#244;t que des Zenfone et ROG Phone, le futur du g&#233;ant ta&#239;wanais s'&#233;crit d&#233;sormais avec des robots et des lunettes connect&#233;es.</description>
    </item>
    <item>
      <title>National Popcorn Day 2026 deals: How to get free popcorn on Jan. 19</title>
      <link>https://mashable.com/article/national-popcorn-day-2026-free-deals</link>
      <pubDate>Mon, 19 Jan 2026 12:06:54 +0000</pubDate>
      <guid isPermaLink="false">051QY2JzjJFWMBHaHLNGzza</guid>
      <description>The best National Popcorn Day 2026 include free popcorn from Cinemark, Regal, Marcus Theaters, and more.</description>
    </item>
    <item>
      <title>&#8216;Fallout&#8217; Season 2&#8217;s Weekly Drops May Not Be Working</title>
      <link>https://gizmodo.com/fallout-season-2s-weekly-drops-may-not-be-working-2000711306</link>
      <pubDate>Mon, 19 Jan 2026 12:00:48 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711306</guid>
      <description>Reception to the new 'Fallout' season is good, but the audience just ain't there on a week-by-week basis.</description>
    </item>
    <item>
      <title>Hand Off Your Floor Cleaning Chores to Roborock&#8217;s Qrevo Curv 2 Flow Robot Vacuum, Now at Its Lowest Price Since Launch</title>
      <link>https://gizmodo.com/hand-off-your-floor-cleaning-chores-to-roborocks-qrevo-curv-2-flow-robot-and-save-150-2000706938</link>
      <pubDate>Mon, 19 Jan 2026 12:00:30 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000706938</guid>
      <description>This next-level robot vacuum and mop works hard so you don't have to, and leaves your carpeted and hard-surfaced floors cleaner than ever.</description>
    </item>
    <item>
      <title>Which Wild Animals Could Humans Domesticate Into the Next Great Pet?</title>
      <link>https://gizmodo.com/which-wild-animals-could-humans-domesticate-into-the-next-great-pet-2000711195</link>
      <pubDate>Mon, 19 Jan 2026 12:00:11 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711195</guid>
      <description>Could raccoons eventually become the latest trendy pet to have?</description>
    </item>
    <item>
      <title>Surfshark adds post-quantum encryption on Mac, Linux, and Android &#8211; more support coming soon</title>
      <link>https://www.techradar.com/vpn/vpn-services/surfshark-adds-post-quantum-encryption-on-mac-linux-and-android-more-support-coming-soon</link>
      <pubDate>Mon, 19 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">4DmHFt82K59PzjsDs2TyAC</guid>
      <description>Surfshark has introduced a new PQC layer on WireGuard, providing extra security against quantum threats. Here's why it matters.</description>
    </item>
    <item>
      <title>Lyft CEO: &#8216;Let&#8217;s stop doing that, please&#8217;</title>
      <link>https://www.fastcompany.com/91474071/lyft-ceo-lets-stop-doing-that-please</link>
      <pubDate>2026-01-19T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91474071/lyft-ceo-lets-stop-doing-that-please</guid>
      <description>With a sharp focus on customer service, Lyft CEO David Risher is writing the ridesharing company&#8217;s comeback story.
Hello and welcome to Modern CEO! I&#8217;m Stephanie Mehta, CEO and chief content officer of Mansueto Ventures. Each week this newsletter explores inclusive approaches to leadership drawn from conversations with executives and entrepreneurs, and from the pages of Inc. and Fast Company. If you received this newsletter from a friend, you can sign up to get it yourself every Monday morning....</description>
    </item>
    <item>
      <title>A prominent Resident Evil leaker claims that a Code: Veronica remake will be announced this year</title>
      <link>https://www.techradar.com/gaming/a-prominent-resident-evil-leaker-claims-that-a-code-veronica-remake-will-be-announced-this-year</link>
      <pubDate>Mon, 19 Jan 2026 11:55:52 +0000</pubDate>
      <guid isPermaLink="false">to3SMdX2rf8gTUsiUoKcvZ</guid>
      <description>A leaker claims that the next Resident Evil remake will be a fresh version of an underrated spin-off.</description>
    </item>
    <item>
      <title>Cette option pratique de Google Gemini va vous faire gagner du temps</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2947291_cette-option-pratique-de-google-gemini-va-vous-faire-gagner-du-temps</link>
      <pubDate>Mon, 19 Jan 2026 11:54:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2947291_cette-option-pratique-de-google-gemini-va-vous-faire-gagner-du-temps</guid>
      <description>
Les &#233;quipes de Google ont d&#233;ploy&#233; un bouton &#171;&#160;R&#233;pondre maintenant &#187; dans l'application Gemini pour obtenir une r&#233;ponse plus rapide en interrompant son processus de raisonnement.
</description>
    </item>
    <item>
      <title>Threads overtakes X on mobile, but still lags far behind</title>
      <link>https://www.theverge.com/news/864099/threads-overtakes-x-daily-mobile-ios-android-users</link>
      <pubDate>2026-01-19T06:53:33-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864099</guid>
      <description>After launching almost three years ago, Meta's Threads is now reportedly attracting more daily mobile users than rival platform X. According to Similarweb data shared by TechCrunch, Threads has 141.5 million daily active iOS and Android global app users as of January 7th, compared to 125 million users for Elon Musk's mobile platform. Similarweb reports [&#8230;]...</description>
    </item>
    <item>
      <title>The Ozone 3K could be the iPhone Air battery pack you&#8217;ve been waiting for</title>
      <link>https://www.techradar.com/phones/iphone/the-ozone-3k-could-be-the-iphone-air-battery-pack-youve-been-waiting-for</link>
      <pubDate>Mon, 19 Jan 2026 11:53:22 +0000</pubDate>
      <guid isPermaLink="false">NLHK75qq2VbzVwsXFeLQoh</guid>
      <description>The Ozone 3K and Ozone 5K are super slim, very light, and compatible with both iPhones and Android devices.</description>
    </item>
  </channel>
</rss>
