<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 01 Feb 2026 10:31:14 GMT</lastBuildDate>
    <item>
      <title>Un QLED de 43&#8243; avec Dolby Vision/Atmos et Google TV &#224; moins de 250 &#8364; ? C&#8217;est possible pour la fin des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2961821_un-qled-de-43-avec-dolby-vision-atmos-et-google-tv-a-moins-de-250-e-cest-possible-pour-la-fin-des-soldes</link>
      <pubDate>Sun, 01 Feb 2026 10:29:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2961821_un-qled-de-43-avec-dolby-vision-atmos-et-google-tv-a-moins-de-250-e-cest-possible-pour-la-fin-des-soldes</guid>
      <description>
Le TCL 43P7K est un t&#233;l&#233;viseur avec une dalle QLED de 43 pouces. Compatible avec les technologies HDR10+ et Dolby Vision, ce t&#233;l&#233;viseur n'est pas en reste c&#244;t&#233; audio avec le Dolby Atmos. Les soldes affichent ce TV &#224; moins de 250 euros sur Amazon.
</description>
    </item>
    <item>
      <title>Ultime d&#233;lai pour le transfert des comptes Fitbit vers Google</title>
      <link>https://www.01net.com/actualites/ultime-delai-pour-le-transfert-des-comptes-fitbit-vers-google.html</link>
      <pubDate>Sun, 01 Feb 2026 10:01:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323547</guid>
      <description>Les t&#234;tes-en-l'air et les retardataires ont gagn&#233; un nouveau sursis : Google a en effet repouss&#233; la date fatidique pour migrer un compte Fitbit. La derni&#232;re &#233;ch&#233;ance &#233;tait programm&#233;e au 2 f&#233;vrier, elle a bascul&#233; au 19 mai. Ouf !</description>
    </item>
    <item>
      <title>What If the Sensors on Your Car Were Inspecting Potholes for the Government? Honda Found Out</title>
      <link>https://gizmodo.com/what-if-the-sensors-on-your-car-were-inspecting-potholes-for-the-government-honda-found-out-2000715973</link>
      <pubDate>Sun, 01 Feb 2026 10:00:33 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715973</guid>
      <description>Radars and cameras might be for seeing cars and people now but they can be used to make existing roads better in the first place.</description>
    </item>
    <item>
      <title>Smartphones durables&#160;: quels t&#233;l&#233;phones ont les meilleures dur&#233;es de vie en 2026&#8201;?</title>
      <link>https://www.frandroid.com/guide-dachat/smartphones/1288951_smartphones-durables-quel-telephone-a-la-meilleure-duree-de-vie</link>
      <pubDate>Sun, 01 Feb 2026 10:00:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/smartphones/1288951_smartphones-durables-quel-telephone-a-la-meilleure-duree-de-vie</guid>
      <description>
Acheter un smartphone durable est-il possible&#8201;? Entre les diff&#233;rents engagements &#233;cologiques, les mises &#224; jour logicielles et la r&#233;parabilit&#233;, les crit&#232;res de choix sont multiples. Nous vous proposons de d&#233;couvrir quelles sont les marques proposant les t&#233;l&#233;phones avec la meilleure dur&#233;e de vie.
</description>
    </item>
    <item>
      <title>Who really controls your data? The test of sovereign cloud</title>
      <link>https://www.techradar.com/pro/who-really-controls-your-data-the-test-of-sovereign-cloud</link>
      <pubDate>Sun, 01 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">5FxeJuQd6DaZv9HwwjQMch</guid>
      <description>As demand for sovereignty and resilience grows, the question is how Europe can build a more balanced and independent cloud ecosystem.</description>
    </item>
    <item>
      <title>Obfuscation VPN : que sont les serveurs VPN obfusqu&#233;s et pourquoi sont-ils recommand&#233;s pour naviguer en s&#233;curit&#233; ?</title>
      <link>https://www.frandroid.com/services/vpn/2957127_obfuscation-vpn-que-sont-les-serveurs-vpn-obfusques-et-pourquoi-sont-ils-recommandes-pour-naviguer-en-securite</link>
      <pubDate>Sun, 01 Feb 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/vpn/2957127_obfuscation-vpn-que-sont-les-serveurs-vpn-obfusques-et-pourquoi-sont-ils-recommandes-pour-naviguer-en-securite</guid>
      <description>
C'est un mot &#233;trange que l'on n'entend pas tous les jours. L'obfuscation d&#233;signe au sens large toutes les strat&#233;gies pour brouiller les traces. Dans le cas des VPN, l'obfuscation d&#233;signe non pas les techniques employ&#233;es pour dissimuler ses activit&#233;s en ligne ; c'est d&#233;j&#224; leur principe de base. Voici tout ce qu'il y a &#224; savoir sur l'obfuscation.
</description>
    </item>
    <item>
      <title>Voitures &#233;lectriques : Renault braque d&#233;but 2026, Tesla boit une tasse monumentale</title>
      <link>https://www.frandroid.com/survoltes/2962157_voitures-electriques-renault-braque-debut-2026-tesla-boit-une-tasse-monumentale</link>
      <pubDate>Sun, 01 Feb 2026 09:02:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2962157_voitures-electriques-renault-braque-debut-2026-tesla-boit-une-tasse-monumentale</guid>
      <description>
Le leasing social est en train de saturer les routes fran&#231;aises de voitures &#233;lectriques. Les chiffres de janvier 2026 publi&#233;s par AAA Data montrent un pic historique, port&#233; par une Renault 5 intouchable.
</description>
    </item>
    <item>
      <title>Voici l&#8217;autonomie r&#233;elle de 25 voitures &#233;lectriques par -31&#176;C jusqu&#8217;&#224; la panne</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2962131_voici-lautonomie-reelle-de-25-voitures-electriques-par-31c-jusqua-la-panne</link>
      <pubDate>Sun, 01 Feb 2026 09:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2962131_voici-lautonomie-reelle-de-25-voitures-electriques-par-31c-jusqua-la-panne</guid>
      <description>
L'autonomie de 25 voitures &#233;lectriques a &#233;t&#233; test&#233; en Norv&#232;ge, en plein hiver, par -31&#176;C. Voici le classement complet, et les diff&#233;rences entre l'autonomie annonc&#233;e par le constructeur, et l'autonomie r&#233;elle.
</description>
    </item>
    <item>
      <title>Why we need more older female role models at work</title>
      <link>https://www.fastcompany.com/91480383/why-we-need-more-older-female-role-models-at-work</link>
      <pubDate>2026-02-01T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480383/why-we-need-more-older-female-role-models-at-work</guid>
      <description>Women over 50&#8212;and especially over 60&#8212;are still dramatically underrepresented at the highest levels of visible power.
There is a deeply unsettling paradox in how aging women are represented today. The louder the discourse on inclusion and diversity becomes, the fewer women we see who actually look like women over 45. Women who age &#8220;normally&#8221;&#8212;who live in their bodies, with their features, their lines, their visible age&#8212;have almost vanished from public view. When women in their 50s or 60s do gain visibility, it is often with a body and a face that belong to the strange category of Forever 35: per...</description>
    </item>
  </channel>
</rss>
