<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 15 Feb 2026 20:32:42 GMT</lastBuildDate>
    <item>
      <title>Programme Desir : vers une autonomie strat&#233;gique dans l'imagerie radar spatiale</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronautique-programme-desir-vers-autonomie-strategique-imagerie-radar-spatiale-130412/#xtor%3DRSS-8</link>
      <pubDate>Sun, 15 Feb 2026 20:59:04 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronautique-programme-desir-vers-autonomie-strategique-imagerie-radar-spatiale-130412/#xtor%3DRSS-8</guid>
      <description>Dans un monde en constante &#233;volution g&#233;opolitique, la France lance le programme Desir, une initiative strat&#233;gique visant &#224; renforcer sa souverainet&#233; technologique dans le domaine de l'imagerie radar. Ce programme repr&#233;sente une avanc&#233;e significative dans la technologie militaire SAR pour...</description>
    </item>
    <item>
      <title>Emerald Fennell Dishes On Her &#8216;Really Dark&#8217; Zatanna Script</title>
      <link>https://gizmodo.com/emerald-fennell-dishes-on-her-really-dark-zatanna-script-2000722293</link>
      <pubDate>Sun, 15 Feb 2026 19:50:34 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000722293</guid>
      <description>The 'Wuthering Heights' director doesn't think her take on Zatanna would've fit in with superhero movies back then, but could it now?</description>
    </item>
    <item>
      <title>Apple may be adding a splash of color to its upcoming budget-friendly MacBook</title>
      <link>https://www.engadget.com/computing/laptops/apple-may-be-adding-a-splash-of-color-to-its-upcoming-budget-friendly-macbook-192740002.html?src=rss</link>
      <pubDate>Sun, 15 Feb 2026 19:27:40 +0000</pubDate>
      <guid isPermaLink="false">34a46250-6282-4bb5-b34b-719765d8da2d</guid>
      <description>The hardest choice to make for building your next MacBook might be selecting a color. According to Bloomberg's Mark Gurman, Apple has tested colors including light yellow, light green, blue and pink for its next entry-level MacBook that's aimed at students and enterprise users.
Beyond the more vibrant colors, Gurman said that Apple has also trialed its classic silver and dark gray colorways for its cheaper laptop. Gurman added that not all of these six colors will make it to the final product, but Apple has recently shown it's not afraid to dip into flashier options. Apple refreshed the iMac i...</description>
    </item>
    <item>
      <title>Gettyimages.com Is the Best Website on the Internet Right Now</title>
      <link>https://gizmodo.com/gettyimages-com-is-the-best-website-on-the-internet-right-now-2000722378</link>
      <pubDate>Sun, 15 Feb 2026 19:12:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000722378</guid>
      <description>How to have the most fun you can possibly have while the Olympic figure skating events are going on.</description>
    </item>
    <item>
      <title>BenQ says its new monitors will transform work for Mac users - but will it be enough to tempt them away from Apple's own devices?</title>
      <link>https://www.techradar.com/pro/benq-says-its-new-monitors-will-transform-work-for-mac-users-but-will-it-be-enough-to-tempt-them-away-from-apples-own-devices</link>
      <pubDate>Sun, 15 Feb 2026 19:05:00 +0000</pubDate>
      <guid isPermaLink="false">Xvujr4L3UpF5wTkkviPuxg</guid>
      <description>BenQ&#8217;s MA Series monitors provide Mac users with high-resolution displays, Mac-tuned color, workflow tools, and a range of panel options for creative work.</description>
    </item>
    <item>
      <title>The calmest way to lose your mind &#8211; My week with Shapez</title>
      <link>https://www.techradar.com/computing/websites-apps/shapez</link>
      <pubDate>Sun, 15 Feb 2026 19:00:00 +0000</pubDate>
      <guid isPermaLink="false">wJhk48JiAR7Q8eKa6FYg8M</guid>
      <description>Homescreen Heroes: Shapez is a minimalist game where you build a factory to process geometric shapes</description>
    </item>
    <item>
      <title>Fatal Frame 2: Crimson Butterfly Remake&#8217;s directors say the game&#8217;s take on Japanese horror is &#8216;both beautiful and terrifying&#8217;</title>
      <link>https://www.techradar.com/gaming/fatal-frame-2-crimson-butterfly-remake-directors-interview</link>
      <pubDate>Sun, 15 Feb 2026 19:00:00 +0000</pubDate>
      <guid isPermaLink="false">GB6GTskwxGyFrxEKTXfVUV</guid>
      <description>&#8216;By minimizing jump scares and graphic depictions,&#8217; Fatal Frame 2: Crimson Butterfly Remake&#8217;s directors emphasize the game&#8217;s unique &#8216;expression of Japanese horror&#8217;.</description>
    </item>
    <item>
      <title>Comment choisir une imprimante 3D ? Nos conseils</title>
      <link>https://www.frandroid.com/dossiers/2976591_comment-choisir-une-imprimante-3d-nos-conseils</link>
      <pubDate>Sun, 15 Feb 2026 19:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/dossiers/2976591_comment-choisir-une-imprimante-3d-nos-conseils</guid>
      <description>
Vous avez envie d'acqu&#233;rir une imprimante 3D mais vous ne savez pas comment vous y prendre ? Voici une liste de conseils et de crit&#232;res pour savoir comment choisir une imprimante 3D.
</description>
    </item>
    <item>
      <title>La cam&#233;ra connect&#233;e Tapo C211 filme en 2K &#224; 360&#176;, suit chaque mouvement d&#233;tect&#233; et est aussi petite que son prix</title>
      <link>https://www.frandroid.com/marques/2975497_la-camera-connectee-tapo-c211-filme-en-2k-a-360-suit-chaque-mouvement-detecte-et-est-aussi-petite-que-son-prix</link>
      <pubDate>Sun, 15 Feb 2026 18:58:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2975497_la-camera-connectee-tapo-c211-filme-en-2k-a-360-suit-chaque-mouvement-detecte-et-est-aussi-petite-que-son-prix</guid>
      <description>
Discr&#232;te, orientable et dot&#233;e d'une ribambelle de fonctionnalit&#233;s intelligentes, la Tapo C211 de TP-Link est une cam&#233;ra de surveillance connect&#233;e qui nous inspire confiance. Elle a en plus l'avantage d'&#234;tre tr&#232;s accessible : Amazon la propose &#224; 19,99 euros au lieu de 32,90 euros.
</description>
    </item>
  </channel>
</rss>
