<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 28 Nov 2025 11:31:16 GMT</lastBuildDate>
    <item>
      <title>Here are my favorite Black Friday TV deals from Samsung, Sony, and others</title>
      <link>https://www.theverge.com/tech/829579/best-4k-tv-streaming-soundbar-blu-ray-player-deal-sale-black-friday</link>
      <pubDate>2025-11-28T06:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=829579</guid>
      <description>As with most products, Black Friday is the best time of year to find TVs and their accessories at the year&#8217;s lowest prices. It&#8217;s the perfect opportunity to upgrade your dedicated home theater, living room, or bedroom with incredible video and audio sure to keep you entertained for years to come. Shopping during this time [&#8230;]</description>
    </item>
    <item>
      <title>Black Friday &#224; moins de 100 euros : Voici notre s&#233;lection des meilleurs petits plaisirs pour moins de trois chiffres</title>
      <link>https://www.frandroid.com/bons-plans/2866283_black-friday-a-moins-de-100-euros-voici-notre-selection-des-meilleurs-petits-plaisirs-pour-moins-de-trois-chiffres</link>
      <pubDate>Fri, 28 Nov 2025 11:26:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2866283_black-friday-a-moins-de-100-euros-voici-notre-selection-des-meilleurs-petits-plaisirs-pour-moins-de-trois-chiffres</guid>
      <description>
Vous avez d&#233;j&#224; opt&#233; pour un TV 4K flambant neuf ou une console de salon derni&#232;re g&#233;n&#233;ration pendant le Black Friday mais il vous reste encore un peu de budget ? Voici les derniers petits plaisirs pour la route pour moins de 100 euros.
</description>
    </item>
    <item>
      <title>Le prix de l&#8217;essence va augmenter en France&#8230; &#224; cause des voitures &#233;lectriques&#160;?</title>
      <link>https://www.01net.com/actualites/le-prix-de-lessence-va-augmenter-en-france-a-cause-des-voitures-electriques.html</link>
      <pubDate>Fri, 28 Nov 2025 11:24:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311999</guid>
      <description>Mauvaise nouvelle pour les automobilistes : le litre de carburant devrait prendre 6 centimes d&#232;s janvier 2026. La faute aux CEE, un dispositif complexe qui s'apparente &#224; une taxe cach&#233;e et qui finance d&#233;sormais, ironie du sort, les bonus &#233;cologiques des voitures &#233;lectriques.</description>
    </item>
    <item>
      <title>Cette nouvelle offre du Black Friday sur le Meta Quest 3S est la meilleure occasion pour se mettre &#224; la VR</title>
      <link>https://www.frandroid.com/bons-plans/2869265_cette-nouvelle-offre-du-black-friday-sur-le-meta-quest-3s-est-la-meilleure-occasion-pour-se-mettre-a-la-vr</link>
      <pubDate>Fri, 28 Nov 2025 11:18:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2869265_cette-nouvelle-offre-du-black-friday-sur-le-meta-quest-3s-est-la-meilleure-occasion-pour-se-mettre-a-la-vr</guid>
      <description>
Le Meta Quest 3S est un casque VR plus abordable que le Meta Quest 3, surtout pendant le Black Friday o&#249; il est &#224; 234,99 euros au lieu de 329,99 euros.
</description>
    </item>
    <item>
      <title>Black Friday : c&#8217;est le moment id&#233;al pour la maison connect&#233;e (ampoules, enceintes, lunettes connect&#233;es, airfryers&#8230;)</title>
      <link>https://www.frandroid.com/bons-plans/2858095_black-friday-2025-airfryers-cameras-ampoules-enceintes-le-top-des-offres-maison-connectee</link>
      <pubDate>Fri, 28 Nov 2025 11:17:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2858095_black-friday-2025-airfryers-cameras-ampoules-enceintes-le-top-des-offres-maison-connectee</guid>
      <description>
Air fryer, ampoules et enceintes connect&#233;es, ou encore cam&#233;ras de surveillance&#8230; Les essentiels de la maison connect&#233;e s&#8217;affichent &#224; prix r&#233;duit pour le Black Friday. C&#8217;est l&#8217;occasion parfaite pour se lancer dans la domotique ou enrichir votre &#233;quipement gr&#226;ce &#224; notre s&#233;lection des meilleures offres du moment.
</description>
    </item>
    <item>
      <title>Volkswagen est sur le point de lancer 4 voitures &#233;lectriques abordables : voici de nouvelles informations sur la premi&#232;re d&#8217;entre elles</title>
      <link>https://www.frandroid.com/marques/cupra/2890069_volkswagen-est-sur-le-point-de-lancer-4-voitures-electriques-abordables-voici-de-nouvelles-informations-sur-la-premiere-dentre-elles</link>
      <pubDate>Fri, 28 Nov 2025 11:14:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/cupra/2890069_volkswagen-est-sur-le-point-de-lancer-4-voitures-electriques-abordables-voici-de-nouvelles-informations-sur-la-premiere-dentre-elles</guid>
      <description>
Les petites voitures &#233;lectriques du groupe Volkswagen arriveront en 2026, et la premi&#232;re &#224; arriver sera la Cupra Raval. En amont de sa pr&#233;sentation, la marque espagnole donne plus d'informations sur la future rivale des Renault 5 E-Tech et Alpine A290.
</description>
    </item>
    <item>
      <title>Black Friday : voici les 10 offres tech qui ont surv&#233;cu &#224; la matin&#233;e et m&#233;ritent vraiment votre argent</title>
      <link>https://www.frandroid.com/bons-plans/2890361_black-friday-voici-les-10-offres-tech-qui-ont-survecu-a-la-matinee-et-meritent-vraiment-votre-argent</link>
      <pubDate>Fri, 28 Nov 2025 11:11:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2890361_black-friday-voici-les-10-offres-tech-qui-ont-survecu-a-la-matinee-et-meritent-vraiment-votre-argent</guid>
      <description>
Il est midi pass&#233;. Le premier rush du Black Friday est termin&#233;. Le bilan ? Beaucoup de ruptures, beaucoup de fausses promos, mais quelques r&#233;sistants h&#233;ro&#239;ques. On a refait le tour des marchands pour vous sortir le Top 10 ultime de la mi-journ&#233;e.
</description>
    </item>
    <item>
      <title>Our Favorite Unbound Merino Wool T-Shirts Are on Sale for Black Friday</title>
      <link>https://www.wired.com/story/unbound-merino-black-friday-sale-2025/</link>
      <pubDate>Fri, 28 Nov 2025 11:10:21 +0000</pubDate>
      <guid isPermaLink="false">69244d81a92886eb39735d84</guid>
      <description>WIRED&#8217;s pick for the best travel T-shirt is on sale for Black Friday. Expand your merino wardrobe with these deals. Hurry though, the sale ends tonight.</description>
    </item>
    <item>
      <title>L&#8217;Europe va subir &#171;&#160;des arr&#234;ts de production imminents&#160;&#187; dans ses usines&#160;: cette entreprise de semi-conducteurs sonne l&#8217;alerte</title>
      <link>https://www.01net.com/actualites/leurope-va-subir-des-arrets-de-production-imminents-dans-ses-usines-cette-entreprise-de-semi-conducteurs-sonne-lalerte.html</link>
      <pubDate>Fri, 28 Nov 2025 11:03:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312001</guid>
      <description>Les exportations de puces &#233;lectroniques de Nexperia Chine vers l'Europe n'ont toujours pas repris, et les industries automobiles europ&#233;ennes signalent &#171;&#160;des arr&#234;ts de production imminents &#187;, d&#233;plore Nexperia Pays Bas, ce fabricant de semi-conducteurs au propri&#233;taire chinois.</description>
    </item>
    <item>
      <title>The Best Deals From Huckberry&#8217;s 2025 Black Friday Sale</title>
      <link>https://www.wired.com/story/huckberry-black-friday-sale-2025/</link>
      <pubDate>Fri, 28 Nov 2025 11:01:43 +0000</pubDate>
      <guid isPermaLink="false">6914d955971bcf42d743e089</guid>
      <description>Huckberry&#8217;s Black Friday sale features deals on an eclectic curation of travel clothing, coffee gear, and lock-pick training kits (seriously).</description>
    </item>
    <item>
      <title>Black Friday iPad : o&#249; trouver les meilleures offres de ce vendredi ?</title>
      <link>https://www.frandroid.com/bons-plans/2859359_black-friday-ipad-ou-trouver-les-meilleures-offres-de-ce-vendredi</link>
      <pubDate>Fri, 28 Nov 2025 11:00:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2859359_black-friday-ipad-ou-trouver-les-meilleures-offres-de-ce-vendredi</guid>
      <description>
Lors du Black Friday, certaines cat&#233;gories de produits sont particuli&#232;rement scrut&#233;es. Les iPad font partie des vedettes du jour. Voici les meilleures offres de la journ&#233;e.
</description>
    </item>
    <item>
      <title>Don't Get Suckered by Black Friday Laptop Deals. Just Get the MacBook Air (2025)</title>
      <link>https://www.wired.com/story/best-macbook-black-friday-deal-2025/</link>
      <pubDate>Fri, 28 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">691d69cf949d47b5b08ec552</guid>
      <description>The Black Friday MacBook deal isn't the one you might assume it is. After testing every model, here's my advice on which to buy right now.</description>
    </item>
    <item>
      <title>The Best Apple Black Friday Deals (2025)</title>
      <link>https://www.wired.com/story/apple-black-friday-deals-2025/</link>
      <pubDate>Fri, 28 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">691e3954c0869a8a0eee20a7</guid>
      <description>If your AirPods, Apple Watch, or MacBook is on its last legs, now is the time to upgrade.</description>
    </item>
    <item>
      <title>6 Best Mesh Wi-Fi Systems (2025), Tested in a Tech Reviewer's Home</title>
      <link>https://www.wired.com/story/best-mesh-wifi-routers/</link>
      <pubDate>Fri, 28 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">615b126d272def4b666617ae</guid>
      <description>Forget about patchy internet connections and dead spots in the house. These WIRED-tested multiroom mesh systems will get you online in no time.</description>
    </item>
    <item>
      <title>Zootopia 2 might have a secret 'prequel' from over 50 years ago &#8211; and you can stream it now on Disney+</title>
      <link>https://www.techradar.com/streaming/disney-plus/zootopia-2-might-have-a-secret-prequel-from-over-50-years-ago-and-you-can-stream-it-now-on-disney</link>
      <pubDate>Fri, 28 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">DRczssrj3fs9ddmVvhLRuC</guid>
      <description>While we wait for Zootopia 2 to stream, Disney's head of animation thinks this classic movie could be a secret sequel to Nick and Judy's world.</description>
    </item>
    <item>
      <title>Black Friday design deals you don&#8217;t want to miss</title>
      <link>https://www.fastcompany.com/91446067/black-friday-design-deals-you-dont-want-to-miss</link>
      <pubDate>2025-11-28T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91446067/black-friday-design-deals-you-dont-want-to-miss</guid>
      <description>It&#8217;s the best time of year to buy great design. Here&#8217;s where to start.
After Thanksgiving, brands will bombard you with Black Friday and Cyber Monday promotions. It can be overwhelming to know what to buy. After all, some deals aren&#8217;t actually all that good. And besides, you don&#8217;t want to make impulse buys that you&#8217;ll regret later and that will end up in a landfill in the near future....</description>
    </item>
    <item>
      <title>The anti-junk gift guide</title>
      <link>https://www.fastcompany.com/91449250/the-official-2025-anti-gift-guide-gift-guide</link>
      <pubDate>2025-11-28T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91449250/the-official-2025-anti-gift-guide-gift-guide</guid>
      <description>If it gives you a stomachache to imagine all of this year&#8217;s hotly anticipated presents ending up in a landfill before next Christmas, then this is the gift guide for you.
It&#8217;s that time of year again. My mailbox is stuffed with catalogs. Targeted seasonal ads from Amazon, Walmart, and Target are following me around the internet. And every other email in my overflowing inbox offers me the go-to 2025 gift guide for everyone on my list!...</description>
    </item>
    <item>
      <title>The most popular social media platform isn&#8217;t TikTok or X</title>
      <link>https://www.fastcompany.com/91449511/most-popular-social-media-platform-tiktok-x-youtube</link>
      <pubDate>2025-11-28T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91449511/most-popular-social-media-platform-tiktok-x-youtube</guid>
      <description>It&#8217;s YouTube&#8212;by a wide margin.
Social media has become inexorably intertwined with our daily lives, but not all platforms are equally popular. For every cultural phenomenon like TikTok, there&#8217;s a Mastodon.</description>
    </item>
    <item>
      <title>Not&#233; 9/10, le solide moniteur gaming Dell Alienware AW2725Q (4K, OLED, 240 Hz) n&#8217;&#233;chappe pas au Black Friday et chute sous les 800 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2887761_note-9-10-le-solide-moniteur-gaming-dell-alienware-aw2725q-4k-oled-240-hz-nechappe-pas-au-black-friday-et-chute-sous-les-800-e</link>
      <pubDate>Fri, 28 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2887761_note-9-10-le-solide-moniteur-gaming-dell-alienware-aw2725q-4k-oled-240-hz-nechappe-pas-au-black-friday-et-chute-sous-les-800-e</guid>
      <description>
Avec sa configuration ultra-muscl&#233;e, l'&#233;cran PC Dell Alienware AW2725Q est clairement taill&#233; pour les joueurs qui ne laissent rien au hasard et qui ne tol&#232;rent aucune saccade &#224; l'&#233;cran. &#192; l'approche du Black Friday officiel, Amazon le propose &#224; 709,62 euros au lieu de 918,99 euros.
</description>
    </item>
    <item>
      <title>L&#8217;iPhone Fold pourrait co&#251;ter un prix astronomique</title>
      <link>https://www.01net.com/actualites/liphone-fold-pourrait-couter-un-prix-astronomique.html</link>
      <pubDate>Fri, 28 Nov 2025 10:56:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312000</guid>
      <description>Le premier iPhone pliant pourrait s&#8217;afficher &#224; un prix record d&#8217;environ 2399 dollars, soit autour de 2550 euros en Europe. Cette estimation, issue d&#8217;analyses sectorielles, souligne un positionnement tr&#232;s haut de gamme li&#233; &#224; la flamb&#233;e des co&#251;ts des composants, notamment la m&#233;moire RAM.</description>
    </item>
    <item>
      <title>The OnePlus 15 clears its final hurdle for a US launch &#8211; here's why we gave the flagship a rare five stars</title>
      <link>https://www.techradar.com/phones/oneplus-phones/the-oneplus-15-clears-its-final-hurdle-for-a-us-launch-heres-why-we-gave-the-flagship-a-rare-five-stars</link>
      <pubDate>Fri, 28 Nov 2025 10:55:55 +0000</pubDate>
      <guid isPermaLink="false">u989pnf6HSCVRDfRt9NoHM</guid>
      <description>The OnePlus 15 is one of our favorite phones of the year, and it's now got regulatory approval in the US.</description>
    </item>
    <item>
      <title>Victime de son succ&#232;s, Google doit restreindre l&#8217;offre gratuite de Gemini 3 Pro</title>
      <link>https://www.frandroid.com/marques/google/2889967_victime-de-son-succes-google-doit-restreindre-loffre-gratuite-de-gemini-3-pro</link>
      <pubDate>Fri, 28 Nov 2025 10:54:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2889967_victime-de-son-succes-google-doit-restreindre-loffre-gratuite-de-gemini-3-pro</guid>
      <description>
Le lancement de la nouvelle IA de Google fait des &#233;mules. Face &#224; la demande croissante, l'entreprise se voit contrainte de restreindre le nombre de requ&#234;tes des utilisateurs gratuits. 
</description>
    </item>
    <item>
      <title>DJI Neo 2 : le drone &#171;&#160;selfie&#160;&#187; sous st&#233;ro&#239;des casse son prix pour le Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/bons-plans-photos-videos/2890323_dji-neo-2-le-drone-selfie-sous-steroides-casse-son-prix-pour-le-black-friday</link>
      <pubDate>Fri, 28 Nov 2025 10:53:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/bons-plans-photos-videos/2890323_dji-neo-2-le-drone-selfie-sous-steroides-casse-son-prix-pour-le-black-friday</guid>
      <description>
Le DJI Neo 2, successeur ultra-l&#233;ger et performant, tombe &#224; 209 &#8364; via une offre Boulanger sur Rakuten. Entre la qualit&#233; d'image en hausse et la simplicit&#233; d'usage biblique, c'est le "must-have" de cette fin d'ann&#233;e pour filmer sans se prendre la t&#234;te.
</description>
    </item>
    <item>
      <title>Le Samsung Galaxy S25 Ultra perd une grosse partie de son prix lors du Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2862851_le-samsung-galaxy-s25-ultra-perd-une-grosse-partie-de-son-prix-lors-du-black-friday</link>
      <pubDate>Fri, 28 Nov 2025 10:52:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2862851_le-samsung-galaxy-s25-ultra-perd-une-grosse-partie-de-son-prix-lors-du-black-friday</guid>
      <description>
Le Samsung Galaxy S25 Ultra 256 Go co&#251;te 1 469 euros, sauf pendant le Black Friday o&#249; il est disponible pour 999 euros.
</description>
    </item>
    <item>
      <title>Black Friday Live 2025: We're Tracking Discounts, Trends, and More</title>
      <link>https://www.wired.com/live/black-friday-live-25/</link>
      <pubDate>Fri, 28 Nov 2025 10:52:47 +0000</pubDate>
      <guid isPermaLink="false">69273274ccc631c79e35f85b</guid>
      <description>Today is finally Black Friday, the biggest and best shopping day of the year. The WIRED Reviews team is tracking trends and discounts live.</description>
    </item>
    <item>
      <title>Arrow Lake-S : ces chiffres prouvent qu&#8217;Intel a beaucoup am&#233;lior&#233; ses derniers processeurs</title>
      <link>https://www.frandroid.com/marques/intel/2889899_arrow-lake-s-ces-chiffres-prouvent-quintel-a-beaucoup-ameliore-ses-derniers-processeurs</link>
      <pubDate>Fri, 28 Nov 2025 10:50:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/intel/2889899_arrow-lake-s-ces-chiffres-prouvent-quintel-a-beaucoup-ameliore-ses-derniers-processeurs</guid>
      <description>
Lanc&#233;s il y a un peu plus d'un an, les processeurs de bureau Intel Arrow Lake-S avaient beaucoup fait parler d'eux pour leurs soucis de jeunesse. Apr&#232;s 13 mois d'optimisations diverses, des mesures r&#233;alis&#233;es par un site sp&#233;cialis&#233; nous permettent de savoir o&#249; en sont les progr&#232;s d'Intel sur cette g&#233;n&#233;ration mal-n&#233;e.
</description>
    </item>
    <item>
      <title>This cheap, compact projector can turn your wall into a giant whiteboard &#8211; and it has gesture controls too</title>
      <link>https://www.techradar.com/televisions/projectors/this-cheap-compact-projector-can-turn-your-wall-into-a-giant-whiteboard-and-it-has-gesture-controls-too</link>
      <pubDate>Fri, 28 Nov 2025 10:47:46 +0000</pubDate>
      <guid isPermaLink="false">8aKH5Z4Ygsve3XvoHNccvf</guid>
      <description>The Choice Bee AI Projector Air supports a stylus and comes in at an extremely low price, so we really hope it gets a global launch.</description>
    </item>
    <item>
      <title>The best Black Friday deals on AirPods, AirTags, and other Apple gear</title>
      <link>https://www.theverge.com/gadgets/827826/best-black-friday-apple-deals-sale-2025</link>
      <pubDate>2025-11-28T05:45:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=827826</guid>
      <description>If you&#8217;re planning to gift an Apple device this holiday season &#8212; or treat yourself &#8212; now&#8217;s the time to start shopping.&#160;Black Friday has officially arrived, bringing with it the best Apple deals we&#8217;ve seen all year. Despite having recently launched, for instance, the new AirPods Pro, Apple Watch Series 11, and new M5-powered MacBook [&#8230;]</description>
    </item>
    <item>
      <title>Black Friday : ce pack Samsung Galaxy Tab S10 Plus en promo &#224; -33 % transforme la tablette en laptop d&#8217;appoint</title>
      <link>https://www.frandroid.com/bons-plans/2887877_black-friday-ce-pack-samsung-galaxy-tab-s10-plus-en-promo-a-33-transforme-la-tablette-en-laptop-dappoint</link>
      <pubDate>Fri, 28 Nov 2025 10:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2887877_black-friday-ce-pack-samsung-galaxy-tab-s10-plus-en-promo-a-33-transforme-la-tablette-en-laptop-dappoint</guid>
      <description>
Si vous cherchez une bonne tablette pour jouer, travailler ou vousn d&#233;tendre, la Samsung Galaxy Tab S10 Plus avec clavier et chargeur rapide 45 W est en promo &#224; 799 euros au lieu de 1 299 euros pour le Black Friday chez Fnac et Darty.
</description>
    </item>
    <item>
      <title>Avengers: Doomsday's first trailer might be released earlier than predicted &#8211; here's why Marvel fans are getting so excited</title>
      <link>https://www.techradar.com/streaming/entertainment/avengers-doomsdays-first-trailer-might-be-released-earlier-than-predicted-heres-why-marvel-fans-are-getting-so-excited</link>
      <pubDate>Fri, 28 Nov 2025 10:44:47 +0000</pubDate>
      <guid isPermaLink="false">E4LwtJMHczrwF4EohCmMDX</guid>
      <description>The hype for Avengers: Doomsday's first teaser has reached critical mass as MCU sleuths pore over fresh evidence about its possible release date.</description>
    </item>
    <item>
      <title>The best Black Friday Pok&#233;mon Funko Pop! deals: Low prices at Amazon, GameStop. and Target</title>
      <link>https://mashable.com/article/best-black-friday-pokemon-funko-pop-deals-2025</link>
      <pubDate>Fri, 28 Nov 2025 10:43:41 +0000</pubDate>
      <guid isPermaLink="false">03dDE9bhAzAiNNYDF0zKH8v</guid>
      <description>Find Black Friday Pok&#233;mon deals. Here's every Pok&#233;mon Funko Pop! deal I managed to catch on Amazon, GameStop, and Target.</description>
    </item>
    <item>
      <title>AirPods en promotion : voici o&#249; trouver les meilleures offres du Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2870019_black-friday-airpods-les-meilleures-offres-sur-les-ecouteurs-aujourdhui</link>
      <pubDate>Fri, 28 Nov 2025 10:40:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2870019_black-friday-airpods-les-meilleures-offres-sur-les-ecouteurs-aujourdhui</guid>
      <description>
Pour ce Black Friday, il est possible de d&#233;nicher plusieurs mod&#232;les d'AirPods en promotion. Nous avons r&#233;uni ici les meilleures offres de la journ&#233;e.
</description>
    </item>
    <item>
      <title>UK government tells telecoms to do more to protect customers</title>
      <link>https://www.techradar.com/pro/uk-government-tells-telecoms-to-do-more-to-protect-customers</link>
      <pubDate>Fri, 28 Nov 2025 10:40:36 +0000</pubDate>
      <guid isPermaLink="false">ejqNbV4GnNFdxA3nM4SqvR</guid>
      <description>Telecoms customers must have access to all the pricing details, presented in a clearer way.</description>
    </item>
    <item>
      <title>Perplexity AI&#8217;s new clothes try-on tool takes on Google &#8211; I tested it and I'm starting to get addicted to virtual dressing up</title>
      <link>https://www.techradar.com/ai-platforms-assistants/perplexity-ais-new-clothes-try-on-tool-takes-on-google-i-tested-the-virtual-tool-and-im-starting-to-get-addicted-to-it</link>
      <pubDate>Fri, 28 Nov 2025 10:39:25 +0000</pubDate>
      <guid isPermaLink="false">K9xqKZiTuv9PCfciybC7RW</guid>
      <description>Perplexity&#8217;s new virtual try-on tool creates a convincing digital avatar for shopping.</description>
    </item>
    <item>
      <title>On a trouv&#233; le pire &#171; Bon Plan &#187; du Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2890237_on-a-trouve-le-pire-bon-plan-du-black-friday</link>
      <pubDate>Fri, 28 Nov 2025 10:38:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2890237_on-a-trouve-le-pire-bon-plan-du-black-friday</guid>
      <description>
On pourrait vous dire que c'est l'affaire du si&#232;cle, mais on ne va pas se mentir. Ce robot humano&#239;de est en promo, mais il co&#251;te toujours le prix d'une voiture. Si vous cherchez des offres qui ont du sens (smartphones, PC, audio), c'est par ici que &#231;a se passe. Sinon, regardez ce d&#233;lire.
</description>
    </item>
    <item>
      <title>The award-winning LG C5 OLED TV finally got a real price drop on Black Friday &#8212;&#160;record-low price at Amazon</title>
      <link>https://mashable.com/article/best-black-friday-deal-2025-lg-c5-oled-tv-65-inches</link>
      <pubDate>Fri, 28 Nov 2025 10:37:40 +0000</pubDate>
      <guid isPermaLink="false">02fSjAAMzjfXUCuzi7GV3nw</guid>
      <description>As of Nov. 28, the award-winning LG C5 OLED TV finally got a serious price drop at Amazon. Take advantage of the lowest price ever on the 65-inch model.</description>
    </item>
    <item>
      <title>Smartphones Xiaomi&#160;: vous ne devriez pas ignorer cette mise &#224; jour du Bluetooth</title>
      <link>https://www.01net.com/actualites/smartphones-xiaomi-ne-pas-ignorer-mise-a-jour-bluetooth.html</link>
      <pubDate>Fri, 28 Nov 2025 10:34:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312027</guid>
      <description>Xiaomi lance sur tous ses smartphones une mise &#224; jour Bluetooth tr&#232;s ambitieuse qui vient am&#233;liorer l&#8217;autonomie, la stabilit&#233; et la compatibilit&#233; avec de nombreux accessoires.</description>
    </item>
    <item>
      <title>The Nothing (1) Headset Is Discounted for Black Friday</title>
      <link>https://www.wired.com/story/nothing-1-headset-deal-1125-1/</link>
      <pubDate>Fri, 28 Nov 2025 10:32:09 +0000</pubDate>
      <guid isPermaLink="false">6925cb55f8687c5fd152fea2</guid>
      <description>These over-ear headphones compete with the Airpods Max at a fraction of the price.</description>
    </item>
    <item>
      <title>Le Black Friday est LE bon moment pour changer de forfait mobile : les meilleures offres pas ch&#232;res avec le max de data, jusqu&#8217;&#224; 400 Go !</title>
      <link>https://www.frandroid.com/bons-plans/2879671_le-black-friday-est-le-bon-moment-pour-changer-de-forfait-mobile-les-meilleures-offres-pas-cheres-avec-le-max-de-data-jusqua-400-go</link>
      <pubDate>Fri, 28 Nov 2025 10:30:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2879671_le-black-friday-est-le-bon-moment-pour-changer-de-forfait-mobile-les-meilleures-offres-pas-cheres-avec-le-max-de-data-jusqua-400-go</guid>
      <description>
Il n'y a pas que les e-commer&#231;ants et grands distributeurs high-tech qui participent au Black Friday. Les op&#233;rateurs mobiles aussi ! Pendant quelques jours encore, le prix du Go baisse consid&#233;rablement dans ces forfaits &#224; prix mini et enveloppe maxi !
</description>
    </item>
    <item>
      <title>The Best Red Light Therapy Mask You Can Buy Is Currently on Sale</title>
      <link>https://www.wired.com/story/best-current-body-black-friday-deals-2025-1/</link>
      <pubDate>Fri, 28 Nov 2025 10:30:48 +0000</pubDate>
      <guid isPermaLink="false">691df8b4e9d84048cae33346</guid>
      <description>Shopping for CurrentBody's Black Friday deals? We've found the best bundle deals on its beauty tech gear. Grab before it's gone.</description>
    </item>
    <item>
      <title>The Best Therabody and Theragun Black Friday Deals (2025)</title>
      <link>https://www.wired.com/story/black-friday-therabody-deals-2025/</link>
      <pubDate>Fri, 28 Nov 2025 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">691d34dec35ff0e735daa2db</guid>
      <description>Therabody's Black Friday sale is live&#8212;and it's good.</description>
    </item>
    <item>
      <title>The Best Black Friday Coffee Deals (2025)</title>
      <link>https://www.wired.com/story/best-coffee-espresso-deals-black-friday-2025/</link>
      <pubDate>Fri, 28 Nov 2025 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">692076bc1d5cbe3df783222e</guid>
      <description>Fall is the best time for coffee deals. And the best time for coffee. Happy Black Friday.</description>
    </item>
    <item>
      <title>Secure Your Home for Less With This Arlo Pro 5S Camera Deal (2025)</title>
      <link>https://www.wired.com/story/arlo-pro-5s-black-friday-deal-2025/</link>
      <pubDate>Fri, 28 Nov 2025 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">691cbeeb01228c06f4b7f109</guid>
      <description>The Arlo Pro 5S is the best security camera to safeguard your home, and this is the lowest price it has ever been.</description>
    </item>
    <item>
      <title>Sex Workers Built an &#8216;Anti-OnlyFans&#8217; to Take Control of Their Profits</title>
      <link>https://www.wired.com/story/sex-workers-built-an-anti-onlyfans-to-take-control-of-their-profits/</link>
      <pubDate>Fri, 28 Nov 2025 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">6925e162ebaab942741d05b2</guid>
      <description>Hidden, a TikTok-like platform operated by sex workers, is launching as OnlyFans is implementing background checks for performers and expanding beyond adult content.</description>
    </item>
    <item>
      <title>Black Friday Brings a Truly Great iPad Deal</title>
      <link>https://www.wired.com/story/apple-ipad-black-friday-deal-2025-1/</link>
      <pubDate>Fri, 28 Nov 2025 10:29:11 +0000</pubDate>
      <guid isPermaLink="false">6923f965609482db70f93513</guid>
      <description>Bolstered by Apple&#8217;s iPadOS 26 update, this discounted tablet is more versatile than ever before.</description>
    </item>
    <item>
      <title>Best Black Friday Mattress Deals 2025</title>
      <link>https://www.wired.com/story/best-black-friday-mattress-deals-2025-2/</link>
      <pubDate>Fri, 28 Nov 2025 10:29:03 +0000</pubDate>
      <guid isPermaLink="false">691b76ae86e69565af2a4958</guid>
      <description>Some of the best sales of the year are happening right now.</description>
    </item>
    <item>
      <title>Save $900 on Sony&#8217;s Best Mirrorless Camera With This Black Friday Deal (2025)</title>
      <link>https://www.wired.com/story/sony-a7rv-black-friday-deal-2025/</link>
      <pubDate>Fri, 28 Nov 2025 10:26:19 +0000</pubDate>
      <guid isPermaLink="false">68f78e5f60de8bd11546c38e</guid>
      <description>Sony&#8217;s top-of-the-line A7R V mirrorless camera is at the lowest price it&#8217;s ever been, and so is the more video-friendly A7 IV.</description>
    </item>
    <item>
      <title>100+ Black Friday deals: We found best-ever deals on AirPods, MacBooks, Samsung TVs, Kindles, and Ninja</title>
      <link>https://mashable.com/article/best-black-friday-deals-2025</link>
      <pubDate>Fri, 28 Nov 2025 10:24:45 +0000</pubDate>
      <guid isPermaLink="false">01ATEB6D6kZoJ9sAwyqdxU7</guid>
      <description>Get the best Black Friday deals on Apple products, vacuums, headphones, power stations, and Legos. Save $250 on a new Apple laptop and 27% on a new Kindle.</description>
    </item>
    <item>
      <title>The Roku Streaming Stick HD has dropped to just $15 for Black Friday</title>
      <link>https://mashable.com/article/black-friday-deal-2025-roku-stick-hd</link>
      <pubDate>Fri, 28 Nov 2025 10:24:18 +0000</pubDate>
      <guid isPermaLink="false">034GNxkPaiK4vSQZIDUhA5m</guid>
      <description>Save 50% on the Roku Streaming Stick at Amazon this Black Friday.</description>
    </item>
    <item>
      <title>Kohler Black Friday Promo Code (2025): 10 Percent Off Bathroom and Kitchen</title>
      <link>https://www.wired.com/story/kohler-black-friday-2025-promo-code-1/</link>
      <pubDate>Fri, 28 Nov 2025 10:23:39 +0000</pubDate>
      <guid isPermaLink="false">69260e0363eaab204bc381ab</guid>
      <description>Fixtures giant Kohler has a holiday promo code for 10 percent off big orders for Black Friday 2025.</description>
    </item>
    <item>
      <title>The Pok&#233;mon TCG Mega Evolutions ETB is now below market value at Amazon for Black Friday</title>
      <link>https://mashable.com/article/black-friday-deal-2025-pokemon-tcg-mega-evolution-elite-trainer-box</link>
      <pubDate>Fri, 28 Nov 2025 10:23:22 +0000</pubDate>
      <guid isPermaLink="false">00C3lW5U71Lo158oK3jPuOu</guid>
      <description>Find the best Black Friday deals on Pok&#233;mon. The Pok&#233;mon TCG Mega Evolution Elite Trainer Box is now below market value at Amazon</description>
    </item>
    <item>
      <title>&#171;&#160;Forte demande&#160;&#187; pour Gemini 3&#160;: Google serre la vis pour m&#233;nager ses serveurs</title>
      <link>https://www.01net.com/actualites/forte-demande-gemini-3-google-serre-vis-menager-serveurs.html</link>
      <pubDate>Fri, 28 Nov 2025 10:22:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312007</guid>
      <description>Google serre la vis aux utilisateurs qui n'ont pas d'abonnement Gemini. Face &#224; un afflux massif d&#8217;utilisateurs, l&#8217;entreprise a d&#233;cid&#233; de restreindre l'utilisation de l'IA pour pr&#233;server ses serveurs. Le nombre de requ&#234;tes ou d&#8217;images gratuites varie d&#233;sormais d&#8217;un jour &#224; l&#8217;autre, en fonction de la pression exerc&#233;e sur les serveurs de Google.</description>
    </item>
    <item>
      <title>Herman Miller Has Tempting Black Friday Discounts on Its Office Chairs</title>
      <link>https://www.wired.com/story/black-friday-herman-miller-sale-november-2025-1/</link>
      <pubDate>Fri, 28 Nov 2025 10:21:54 +0000</pubDate>
      <guid isPermaLink="false">6923f8a1c814ca9a5c303b5c</guid>
      <description>Black Friday discounts help bring down the price of the iconic Herman Miller Aeron.</description>
    </item>
    <item>
      <title>The Ninja Slushi Black Friday Deal Is the Lowest We've Seen</title>
      <link>https://www.wired.com/story/ninja-slushi-black-friday-deal-2025-1/</link>
      <pubDate>Fri, 28 Nov 2025 10:21:35 +0000</pubDate>
      <guid isPermaLink="false">6920baa1ed8e2a8960c331a2</guid>
      <description>The Black Friday sale on this popular slushie machine is the lowest price it's been since its release.</description>
    </item>
    <item>
      <title>Black Friday 2025: Live updates on the latest deals from Amazon, Target, Walmart, and more</title>
      <link>https://mashable.com/live/best-black-friday-live-deals-2025</link>
      <pubDate>Fri, 28 Nov 2025 10:17:37 +0000</pubDate>
      <guid isPermaLink="false">029zwKUE9ZUzmzs1dI9qaD7</guid>
      <description>Get live updates on Black Friday sales. We found savings of $150 on Dyson Supersonic hair dryers, $300 off Samsung TVs, and record prices on AirPods.</description>
    </item>
    <item>
      <title>30+ of the best Black Friday Apple deals: Record-low prices on AirPods, Apple Watches, and MacBooks</title>
      <link>https://mashable.com/article/best-black-friday-apple-deals-2025</link>
      <pubDate>Fri, 28 Nov 2025 10:16:24 +0000</pubDate>
      <guid isPermaLink="false">01bVyYZtDMpfqI3CLP4iVpZ</guid>
      <description>Mashable's shopping reporters dug up the best Black Friday Apple deals, including year-round lows on AirPods and MacBooks.</description>
    </item>
    <item>
      <title>Dont wait! The Lego Ideas Insect Collection set has dropped to $40 at Amazon during Black Friday sales.</title>
      <link>https://mashable.com/article/black-friday-deal-2025-lego-ideas-the-insect-collection-set</link>
      <pubDate>Fri, 28 Nov 2025 10:14:42 +0000</pubDate>
      <guid isPermaLink="false">00QSCubNnQazd9uDS1gA2wq</guid>
      <description>As of Nov. 28, the Lego Ideas The Insect Collection set is on sale at Amazon for $40. This is 50% off its list price and marks its lowest-ever price.</description>
    </item>
    <item>
      <title>The Dell 14 Plus Just Hit a New Rock Bottom Price (2025)</title>
      <link>https://www.wired.com/story/dell-14-plus-black-friday-2025-1/</link>
      <pubDate>Fri, 28 Nov 2025 10:13:04 +0000</pubDate>
      <guid isPermaLink="false">6920d8f075beddc93cd6818a</guid>
      <description>With a new low price, Dell just launched the best laptop deal from Black Friday I've seen so far.</description>
    </item>
    <item>
      <title>Preorder the Pok&#233;mon TCG Mega Venusaur ex Premium Collection Box at market value in the Amazon Black Friday sale</title>
      <link>https://mashable.com/article/black-friday-deal-2025-mega-venusaur-ex-preorder</link>
      <pubDate>Fri, 28 Nov 2025 10:12:52 +0000</pubDate>
      <guid isPermaLink="false">06BLZMgliqBzwq8rToR2cE7</guid>
      <description>Find Black Friday Pok&#233;mon deals. The Pok&#233;mon TCG's Mega Venusaur ex Premium Collection Box is up for preorder at market value for Amazon Black Friday</description>
    </item>
    <item>
      <title>The Oura Ring 4 Is $100 off for Black Friday</title>
      <link>https://www.wired.com/story/oura-ring-4-deal-1125-1/</link>
      <pubDate>Fri, 28 Nov 2025 10:10:08 +0000</pubDate>
      <guid isPermaLink="false">6924729626fafb8a78b9bd03</guid>
      <description>This sophisticated smart ring is marked down to just $249, and it tracks a ton of health data.</description>
    </item>
    <item>
      <title>Multiple London councils affected by apparent cyberattack</title>
      <link>https://www.techradar.com/pro/security/multiple-london-councils-affected-by-apparent-cyberattack</link>
      <pubDate>Fri, 28 Nov 2025 10:07:29 +0000</pubDate>
      <guid isPermaLink="false">G9DCKd4odFy8LXF2vE7ePQ</guid>
      <description>Kensington &amp; Chelsea, Westminster and Hammersmith &amp; Fulham affected by a cyber &#8216;incident&#8217;.</description>
    </item>
    <item>
      <title>This Black Friday deal means you can finally justify buying the Meta Quest 3S</title>
      <link>https://www.techradar.com/seasonal-sales/this-black-friday-deal-means-you-can-finally-justify-buying-the-meta-quest-3s</link>
      <pubDate>Fri, 28 Nov 2025 10:06:25 +0000</pubDate>
      <guid isPermaLink="false">uJ4fupJ3L5vZoqSUrXWPXF</guid>
      <description>Black Friday savings have arrived at Meta with the Meta Quest 3S dropping to $249.99</description>
    </item>
    <item>
      <title>Get comfortable! Get up to 57% off Staples chairs for your home office or gaming setup</title>
      <link>https://www.techradar.com/seasonal-sales/get-comfortable-get-up-to-57-percent-off-staples-chairs-for-your-home-office-or-gaming-setup</link>
      <pubDate>Fri, 28 Nov 2025 10:05:30 +0000</pubDate>
      <guid isPermaLink="false">u2WjhPem2zNPjoHy596FFk</guid>
      <description>Time for a chair upgrade? Staples slashes prices by up to 57% this Black Friday</description>
    </item>
    <item>
      <title>The Latest Thing AI Is Accelerating Is How Much U.S. Elections Suck</title>
      <link>https://gizmodo.com/the-latest-thing-ai-is-accelerating-is-how-much-u-s-elections-suck-2000691848</link>
      <pubDate>Fri, 28 Nov 2025 10:00:44 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000691848</guid>
      <description>AI super PACs are threatening to drown out the rest of politics.</description>
    </item>
    <item>
      <title>Power Up With This Black Friday Deal on Anker&#8217;s Best Power Bank (2025)</title>
      <link>https://www.wired.com/story/anker-laptop-power-bank-black-friday-deal-2025/</link>
      <pubDate>Fri, 28 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">691cbf6b702012b0597563be</guid>
      <description>Anker&#8217;s best power bank is on sale for Black Friday, and this portable charger is fast and reliable.</description>
    </item>
    <item>
      <title>Poems Can Trick AI Into Helping You Make a Nuclear Weapon</title>
      <link>https://www.wired.com/story/poems-can-trick-ai-into-helping-you-make-a-nuclear-weapon/</link>
      <pubDate>Fri, 28 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">691f76ecf68778e9c3313aaf</guid>
      <description>It turns out all the guardrails in the world won&#8217;t protect a chatbot from meter and rhyme.</description>
    </item>
    <item>
      <title>The Best Black Friday Beauty Deals, WIRED Approved (2025)</title>
      <link>https://www.wired.com/story/black-friday-beauty-deals-2025/</link>
      <pubDate>Fri, 28 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">691cf33d6dccde5821e6657d</guid>
      <description>Name a better time to stock up on beauty bargains&#8212;I'll wait.</description>
    </item>
    <item>
      <title>The 148 best Black Friday deals we&#8217;ve found so far &#8212; a ton of tech is over half off</title>
      <link>https://www.theverge.com/gadgets/824521/black-friday-2025-best-deals-tech-gadgets-gift-ideas</link>
      <pubDate>2025-11-28T05:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=824521</guid>
      <description>Now that the Thanksgiving dishes are put away and the last slice of pie is hidden in the back of the fridge, it&#8217;s time to turn your attention to the next major holiday: Black Friday. The biggest shopping day of the year has started, and as expected, there are tens of thousands of deals staring [&#8230;]</description>
    </item>
    <item>
      <title>Feeling homesick? Proton&#8217;s Black Friday VPN deal is perfect for UK-based expats</title>
      <link>https://www.techradar.com/vpn/vpn-services/feeling-homesick-protons-black-friday-vpn-deal-is-perfect-for-uk-based-expats</link>
      <pubDate>Fri, 28 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">oBuopMCPEP6yKg564RjD75</guid>
      <description>Accessing content from home helps 88% of expats in the UK feel connected. With Proton VPN Black Friday deal, you can, too, at a fraction of the price.</description>
    </item>
    <item>
      <title>Stanley McChrystal says leaders must have good character and strong convictions</title>
      <link>https://www.fastcompany.com/91447502/stanley-mcchrystal-says-leaders-must-have-good-character-and-strong-convictions</link>
      <pubDate>2025-11-28T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91447502/stanley-mcchrystal-says-leaders-must-have-good-character-and-strong-convictions</guid>
      <description>Baratunde Thurston chats with the retired four-star general on the responsibility of leaders today.
What does it mean to be a courageous leader in 2025? Stanley McChrystal, retired four-star general in the U.S. Army, joins futurist and culture critic Baratunde Thurston to discuss McChrystal&#8217;s new book, On Character, the responsibility of leaders today, and the weight of being an active citizen in democracy. Considering President Trump&#8217;s deployment of the National Guard, McChrystal explores the role of the military in civil society.&#160;...</description>
    </item>
    <item>
      <title>Rococos 2025 revival, explained</title>
      <link>https://mashable.com/video/rococo-revival-labubu-pinterest-trend</link>
      <pubDate>Fri, 28 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">03twLPusI6jjLiKrvtOLh29</guid>
      <description>Rococo is back and this time Labubus are part of it. And our political climate has a lot to do with it.</description>
    </item>
    <item>
      <title>If you need a solid everyday Mac, this is just $500 on Black Friday</title>
      <link>https://mashable.com/article/nov-28-apple-macbook-pro</link>
      <pubDate>Fri, 28 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02NgfeYd4GQUWAxZyBfThd4</guid>
      <description>Get a Grade A refurbished 2017 Apple MacBook Pro for $499.99 during this Black Friday sale &#8212; professionally inspected and ready for everyday use.</description>
    </item>
    <item>
      <title>Make your PC feel new again with Windows 11 Pro for $10</title>
      <link>https://mashable.com/article/nov-28-microsoft-windows-11-pro</link>
      <pubDate>Fri, 28 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">07wL5zz5hU0L4lPwQ9cEJCX</guid>
      <description>Upgrade to Microsoft Windows 11 Pro for just $9.97 and enjoy better performance, security, and multitasking this Black Friday week.</description>
    </item>
    <item>
      <title>The Thing with Feathers review: Grief is a hulking, wheezing crow</title>
      <link>https://mashable.com/article/the-thing-with-feathers-review</link>
      <pubDate>Fri, 28 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00PVQeCGvUDzLflqVREfQYK</guid>
      <description>Benedict Cumberbatch is haunted by loss in this ink-soaked Max Porter adaptation, "The Thing with Feathers." Review.</description>
    </item>
    <item>
      <title>It was tough, but we found the best movies on HBO Max</title>
      <link>https://mashable.com/article/best-movies-hbo-max</link>
      <pubDate>Fri, 28 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">05QyxAPLS08DrYUkg5kgDiP</guid>
      <description>From "Sinners" to "Love Lies Bleeding," "I Saw the TV Glow," and "Barbie," here's a diverse sampling of the best movies on HBO Max. Stream them now on HBO Max.</description>
    </item>
    <item>
      <title>25 excellent Oscar&#8211;winning movies you can watch on Netflix</title>
      <link>https://mashable.com/article/oscar-winning-movies-on-netflix</link>
      <pubDate>Fri, 28 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02rAsGTHxqSNMGLYeuyxRux</guid>
      <description>"Parasite," "Ghost," "Phantom Thread," "Moulin Rouge!" and so much more.</description>
    </item>
    <item>
      <title>Microsoft va corriger le plus gros probl&#232;me de Teams</title>
      <link>https://www.01net.com/actualites/microsoft-va-corriger-le-plus-gros-probleme-de-teams.html</link>
      <pubDate>Fri, 28 Nov 2025 09:52:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312034</guid>
      <description>Microsoft Teams est un v&#233;ritable gouffre en ressources. Au courant du probl&#232;me, Microsoft a annonc&#233; travailler sur un correctif.</description>
    </item>
    <item>
      <title>Streaming just got cheaper: Score Black Friday deals on Hulu, HBO Max, Apple TV, Disney+, and more</title>
      <link>https://mashable.com/article/best-black-friday-streaming-deals-2025</link>
      <pubDate>Fri, 28 Nov 2025 09:51:07 +0000</pubDate>
      <guid isPermaLink="false">00iEfsBnunxYrNp5VgtMU9L</guid>
      <description>The best Black Friday streaming deals include free offers on Spotify, Apple TV, and Peacock, plus 75% discounts on HBO Max.</description>
    </item>
    <item>
      <title>The Fire Stick 4K Max is down to its lowest price this year &#8211; save $25 for Black Friday</title>
      <link>https://mashable.com/article/black-friday-streaming-deal-2025-fire-stick-4k-max</link>
      <pubDate>Fri, 28 Nov 2025 09:47:09 +0000</pubDate>
      <guid isPermaLink="false">05sIvcYz9CfqGUyLsKLLsmA</guid>
      <description>Save 42% on the Amazon Fire Stick 4K Max this Black Friday.</description>
    </item>
    <item>
      <title>160+ Amazon Black Friday deals: Find record-low prices on AirPods, Kindles, Lego, and LG TVs</title>
      <link>https://mashable.com/article/best-black-friday-amazon-deals-2025</link>
      <pubDate>Fri, 28 Nov 2025 09:46:06 +0000</pubDate>
      <guid isPermaLink="false">042Wd6WFQz6kO0BtF8VPiYi</guid>
      <description>Amazon Black Friday 2025 is already underway, and you can buy Fire TVs starting at $99. Shop record prices on Kindle, Bose, Lego, and Apple products.</description>
    </item>
    <item>
      <title>Best Black Friday Google Pixel Deals (2025)</title>
      <link>https://www.wired.com/story/best-black-friday-google-pixel-deals-2025-1/</link>
      <pubDate>Fri, 28 Nov 2025 09:40:57 +0000</pubDate>
      <guid isPermaLink="false">691e33793f721f22615483d6</guid>
      <description>Score hundreds off the new Pixel 10 range, or snag a discounted Pixel Watch 4 or Pixel Buds.</description>
    </item>
    <item>
      <title>Feeling the chill already this winter? This Dreo heater perked up my home office, and is now cheaper than ever this Black Friday</title>
      <link>https://www.techradar.com/pro/feeling-the-chill-already-this-winter-this-dreo-heater-perked-up-my-home-office-and-is-now-cheaper-than-ever-this-black-friday</link>
      <pubDate>Fri, 28 Nov 2025 09:37:03 +0000</pubDate>
      <guid isPermaLink="false">XNxsa37SkzJ7fyj3AcnYDh</guid>
      <description>Get a great Black Friday deal to warm your heart, and your office.</description>
    </item>
  </channel>
</rss>
