<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 12 Nov 2025 13:50:28 GMT</lastBuildDate>
    <item>
      <title>Forerunner 165 : la montre running abordable de Garmin est &#224; un prix encore plus bas pour le Singles Day</title>
      <link>https://www.frandroid.com/bons-plans/2494744_forerunner-165-la-montre-running-abordable-de-garmin-est-a-un-prix-encore-plus-bas-pour-le-singles-day</link>
      <pubDate>Wed, 12 Nov 2025 13:46:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2494744_forerunner-165-la-montre-running-abordable-de-garmin-est-a-un-prix-encore-plus-bas-pour-le-singles-day</guid>
      <description>
La Forerunner 165 de Garmin est une montre entr&#233;e de gamme, qui s'&#233;quipe d'un &#233;cran Amoled avec un tas de fonctionnalit&#233;s de sport&#8230; Parfaite pour les d&#233;butants, la voil&#224; en forte promotion &#224; l'occasion du Singles Day d'AlIExpress : 146,94 euros au lieu de 279 euros de base. 
</description>
    </item>
    <item>
      <title>The first Toy Story 5 teaser threatens the toys with a tablet</title>
      <link>https://www.theverge.com/news/818762/toy-story-5-pixar-disney-first-teaser-trailer</link>
      <pubDate>2025-11-12T08:44:54-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=818762</guid>
      <description>Disney and Pixar have released the first teaser trailer for Toy Story 5, showing tablet screens as an &#8220;all-new threat to playtime.&#8221; The trailer introduces &#8212; much to the horror of Woody and co &#8212; a new character called &#8220;Lilypad,&#8221; a frog-shaped tablet played by Greta Lee (Russian Doll, Tron: Ares), alongside the tagline &#8220;the [&#8230;]</description>
    </item>
    <item>
      <title>Fei-Fei Li&#8217;s World Labs speeds up the world model race with Marble, its first commercial product</title>
      <link>https://techcrunch.com/2025/11/12/fei-fei-lis-world-labs-speeds-up-the-world-model-race-with-marble-its-first-commercial-product/</link>
      <pubDate>Wed, 12 Nov 2025 13:44:01 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3066962</guid>
      <description>Startups like Decart and Odyssey have released free demos, and Google's Genie is still in limited research preview. Marble differs from these &#8212; and even World Labs's own real-time model, RTFM &#8212; because it creates persistent, downloadable 3D environments rather than generating worlds on-the-fly as you explore. This, the company says, results in less morphing or inconsistency, and lets users export worlds as Gaussian splats, meshes or videos....</description>
    </item>
    <item>
      <title>The Physics of the Northern Lights</title>
      <link>https://www.wired.com/story/the-physics-of-the-northern-lights-aurora-borealis/</link>
      <pubDate>Wed, 12 Nov 2025 13:38:40 +0000</pubDate>
      <guid isPermaLink="false">66462d10d290b28fec6f3598</guid>
      <description>The aurora borealis is usually seen near the Arctic, but solar winds and magnetic turbulence are sparking some of the best light shows in centuries throughout the US.</description>
    </item>
    <item>
      <title>Les smartphones peuvent maintenant &#233;muler la Nintendo Switch</title>
      <link>https://www.frandroid.com/produits-android/console/2865101_les-smartphones-peuvent-maintenant-emuler-la-nintendo-switch</link>
      <pubDate>Wed, 12 Nov 2025 13:28:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2865101_les-smartphones-peuvent-maintenant-emuler-la-nintendo-switch</guid>
      <description>
L'&#233;mulateur Nintendo Switch Citron profite d'une mise &#224; jour lui permettant de tirer le meilleur parti des smartphones Snapdragon 8 Elite.
</description>
    </item>
    <item>
      <title>Sony lance un moniteur gaming pour la PS5&#8230; et le PC</title>
      <link>https://www.01net.com/actualites/sony-lance-un-moniteur-gaming-pour-la-ps5-et-le-pc.html</link>
      <pubDate>Wed, 12 Nov 2025 13:27:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1307347</guid>
      <description>La prochaine &#233;tape pour PlayStation sera-t-elle&#8230; un PC gaming&#160;? Apr&#232;s les enceintes sans fil &#171; de bureau &#187;, Sony a en effet pr&#233;sent&#233; un moniteur 27 pouces parfaitement adapt&#233; &#224; la PS5 (surtout avec son syst&#232;me de recharge pour une manette), mais aussi au PC et au Mac. H&#233;las, le constructeur n'a pas donn&#233; de prix et limite la commercialisation aux &#201;tats-Unis et au Japon....</description>
    </item>
    <item>
      <title>The Coros Pace 3 is better value than almost any Garmin watch you can find &#8211; I'd set an alert for the Black Friday deals</title>
      <link>https://www.techradar.com/health-fitness/fitness-trackers/the-coros-pace-3-is-better-value-than-almost-any-garmin-watch-you-can-find-id-set-an-alert-for-the-black-friday-deals</link>
      <pubDate>Wed, 12 Nov 2025 13:25:29 +0000</pubDate>
      <guid isPermaLink="false">fyRGopJpMp8oZw4oP4ToyV</guid>
      <description>Now that the Coros Pace 4 is out, expect the Pace 3 to drop in price.</description>
    </item>
    <item>
      <title>Cdiscount d&#233;gaine de belles offres pour le pr&#233;-Black Friday : voici les 12 deals &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2850059_cdiscount-degaine-de-belles-offres-pour-le-pre-black-friday-voici-les-12-deals-a-retenir</link>
      <pubDate>Wed, 12 Nov 2025 13:25:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850059_cdiscount-degaine-de-belles-offres-pour-le-pre-black-friday-voici-les-12-deals-a-retenir</guid>
      <description>
Cdiscount a lanc&#233; son pr&#233;-Black Friday, il y a d&#233;j&#224; une semaine, et de nouvelles offres continuent de voir le jour avec des prix particuli&#232;rement attractifs. Il y a des r&#233;ductions sur une large s&#233;lection de produits tech, allant des smartphones aux TV en passant par les consoles de jeux. D&#233;couvrez les offres les plus int&#233;ressantes du moment.
</description>
    </item>
    <item>
      <title>Galaxy Watch : Samsung passe aussi aux abonnements payants avec de nouveaux entra&#238;nements pour ses montres connect&#233;es</title>
      <link>https://www.frandroid.com/marques/samsung/2864789_galaxy-watch-samsung-passe-aussi-aux-abonnements-payants-avec-de-nouveaux-entrainements-pour-ses-montres-connectees</link>
      <pubDate>Wed, 12 Nov 2025 13:19:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2864789_galaxy-watch-samsung-passe-aussi-aux-abonnements-payants-avec-de-nouveaux-entrainements-pour-ses-montres-connectees</guid>
      <description>
Alors que de plus en plus de constructeurs de montres connect&#233;es proposent d&#233;sormais des abonnements payants, Samsung a int&#233;gr&#233; de nouveaux programmes d'entra&#238;nement dans son application Samsung Health, soumis &#224; une souscription. 
</description>
    </item>
    <item>
      <title>Sony's State of Play Japan was filled with indies, remakes, and DLC announcements, but these are the games I'm most excited for</title>
      <link>https://www.techradar.com/gaming/sonys-state-of-play-japan-was-filled-with-indies-remakes-and-dlc-announcements-but-these-are-the-games-im-most-excited-for</link>
      <pubDate>Wed, 12 Nov 2025 13:14:07 +0000</pubDate>
      <guid isPermaLink="false">yerzZiBb3W8yS8PtVtaC2b</guid>
      <description>Sony's State of Play Japan has wrapped. In case you missed it, here are the top five announcements that stood out among a showcase primarily focused on remakes and DLC.</description>
    </item>
    <item>
      <title>Who Is Threads For? Meta Would Like One Answer to Be &#8216;Podcasters&#8217;</title>
      <link>https://gizmodo.com/who-is-threads-for-meta-would-like-one-answer-to-be-podcasters-2000684603</link>
      <pubDate>Wed, 12 Nov 2025 13:05:57 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000684603</guid>
      <description>Threads is making a concerted effort to woo podcasters.</description>
    </item>
    <item>
      <title>Best Home Depot Black Friday Deals for 2025</title>
      <link>https://www.wired.com/story/black-friday-home-depot-deals-2025-update/</link>
      <pubDate>Wed, 12 Nov 2025 13:04:00 +0000</pubDate>
      <guid isPermaLink="false">690bbc923af117d48a73f29d</guid>
      <description>Black Friday lasts a month this year at the Home Depot, including half off select tools and tool sets, and deals on Google Nest smart home devices.</description>
    </item>
    <item>
      <title>Microsoft-Backed Startup Hits a Milestone in the Race to Power AI</title>
      <link>https://gizmodo.com/microsoft-backed-startup-hits-a-milestone-in-the-race-to-power-ai-2000684401</link>
      <pubDate>Wed, 12 Nov 2025 13:00:24 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000684401</guid>
      <description>A demo of the startup&#8217;s superconducting cable system promises a more efficient future for energy-hungry data centers.</description>
    </item>
    <item>
      <title>Sabrina Carpenter Wants to Bring an &#8216;Alice in Wonderland&#8217; Movie Musical to Life</title>
      <link>https://gizmodo.com/sabrina-carpenter-alice-in-wonderland-musical-universal-2000684645</link>
      <pubDate>Wed, 12 Nov 2025 13:00:11 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000684645</guid>
      <description>Plus, 'VisionQuest' brings Philomena Cunk herself to the MCU.</description>
    </item>
    <item>
      <title>Insta360&#8217;s new accessories turn its Ace Pro 2 into an instant camera</title>
      <link>https://www.theverge.com/news/817622/insta360-ace-pro-2-action-camera-pocket-printer-xplorer-grip-pro-kit</link>
      <pubDate>2025-11-12T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=817622</guid>
      <description>Insta360 has announced new accessories for its 8K Ace Pro 2 action camera. The accessories expand the Ace Pro 2&#8217;s capabilities as both a video camera with three new lenses and as a still camera with a redesigned grip and a compact wireless printer that can turn shots into instant photos. They&#8217;re launching today as [&#8230;]</description>
    </item>
    <item>
      <title>Microsoft-backed VEIR is bringing superconductors to data centers</title>
      <link>https://techcrunch.com/2025/11/12/microsoft-backed-veir-targets-data-centers-for-its-megawatt-class-superconductors/</link>
      <pubDate>Wed, 12 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3066571</guid>
      <description>The Massachusetts-based startup is taking tech developed for long distance transmissions lines to solve an emerging problem for data center designers.</description>
    </item>
    <item>
      <title>Insta360 just unveiled a bizarre cross between a GoPro and an Instax camera &#8211; and it could be the strangest camera setup of 2025</title>
      <link>https://www.techradar.com/cameras/action-cameras/insta360-just-unveiled-a-bizarre-cross-between-a-gopro-and-an-instax-camera-and-it-could-be-the-strangest-camera-setup-of-2025</link>
      <pubDate>Wed, 12 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">i8SaGC2mVHvXRry5kKBASd</guid>
      <description>Insta360 has unveiled new accessories for its flagship action camera, the Ace Pro 2, including a photographer's grip, lenses, and an add-on instant printer</description>
    </item>
    <item>
      <title>Bo&#238;te de r&#233;ception | Mettre fin au pourriel, r&#233;cup&#233;rer sa musique et &#233;radiquer un logiciel intempestif</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-11-12/boite-de-reception/mettre-fin-au-pourriel-recuperer-sa-musique-et-eradiquer-un-logiciel-intempestif.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 12 Nov 2025 08:00:00 -0500</pubDate>
      <guid isPermaLink="false">5686cb587cdd34b596ee0e2b9adc7a42</guid>
      <description>Chaque mercredi, notre journaliste r&#233;pond &#224; vos questions en lien avec le num&#233;rique et les nouvelles technologies. Cette semaine, on essaie de mettre fin au pourriel, on d&#233;joue les limites de la musique en streaming et on d&#233;sinstalle un logiciel intempestif.</description>
    </item>
    <item>
      <title>Black Friday audio : les &#233;couteurs sans fil, casques, barres de son et enceintes montent le volume et baissent leur prix dans ce top des offres</title>
      <link>https://www.frandroid.com/bons-plans/2849763_le-pre-black-friday-est-la-meilleure-excuse-pour-changer-decouteurs-ou-de-barre-de-son-voici-notre-top-10-des-meilleures-offres-sur-laudio</link>
      <pubDate>Wed, 12 Nov 2025 12:54:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849763_le-pre-black-friday-est-la-meilleure-excuse-pour-changer-decouteurs-ou-de-barre-de-son-voici-notre-top-10-des-meilleures-offres-sur-laudio</guid>
      <description>
Apple AirPods, JBL Charge, Marshall, Nothing, Bowers &amp; Wilkins... Les grandes marques de l'audio bradent leurs &#233;couteurs, casques, enceintes, barres de son et autres pendant l'avant-premi&#232;re du Black Friday. Voici notre s&#233;lection des meilleures offres !
</description>
    </item>
    <item>
      <title>Australian spy chief warns Chinese hackers are &#8216;probing&#8217; critical networks for espionage and sabotage</title>
      <link>https://techcrunch.com/2025/11/12/australian-spy-chief-warns-chinese-hackers-are-probing-critical-networks-for-espionage-and-sabotage/</link>
      <pubDate>Wed, 12 Nov 2025 12:47:27 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3066944</guid>
      <description>Australia's intelligence chief warned that Chinese hackers are trying to break into its networks, sometimes successfully, to "pre-position" for sabotage ahead of an anticipated invasion of Taiwan.</description>
    </item>
    <item>
      <title>Samsung&amp;#8217;s new 27-inch portable display has a three-hour battery life</title>
      <link>https://www.theverge.com/news/818738/samsung-movingstyle-portable-display-tv-availability</link>
      <pubDate>2025-11-12T07:44:52-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=818738</guid>
      <description>Samsung has launched a new portable display that can be pushed around on a rollable stand or carried like a giant tablet. The $1,199.99 Movingstyle is a 27-inch touchscreen display that features a battery life of up to three hours, allowing you to stream content or show workplace presentations without being tied to a power [&#8230;]</description>
    </item>
    <item>
      <title>What&#8217;s Cooler Than Building a Literal God? Building the New Uber</title>
      <link>https://gizmodo.com/whats-cooler-than-building-a-literal-god-building-the-new-uber-2000684458</link>
      <pubDate>Wed, 12 Nov 2025 12:40:15 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000684458</guid>
      <description>OpenAI shifts from artificial general intelligence to personalized chatbots for everybody.</description>
    </item>
    <item>
      <title>Groww raises nearly $750M in IPO as India&#8217;s retail investing boom continues</title>
      <link>https://techcrunch.com/2025/11/12/groww-raises-nearly-750m-in-ipo-as-indias-retail-investing-boom-continues/</link>
      <pubDate>Wed, 12 Nov 2025 12:40:06 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3066932</guid>
      <description>The company's shares opened 12% above their issue price, at &#8377;112, and closed at &#8377;128.85, lending it a market cap of &#8377;795 billion (approximately $9 billion).</description>
    </item>
    <item>
      <title>A bargain-priced PS5 Digital Edition has been revealed by Sony &#8211; but it's going to be exclusive to Japan</title>
      <link>https://www.techradar.com/gaming/playstation/a-bargain-priced-ps5-digital-edition-has-been-revealed-by-sony-but-its-going-to-be-exclusive-to-japan</link>
      <pubDate>Wed, 12 Nov 2025 12:40:06 +0000</pubDate>
      <guid isPermaLink="false">4Qguqa8fttypo4cG2zSGE8</guid>
      <description>As the PlayStation 5 celebrates five years since launch, Sony has announced a new Japan-exclusive PS5 Digital Edition with a cheaper price tag.</description>
    </item>
    <item>
      <title>Is a Robot Vacuum Worth It?</title>
      <link>https://www.wired.com/story/is-a-robot-vacuum-worth-it/</link>
      <pubDate>Wed, 12 Nov 2025 12:31:00 +0000</pubDate>
      <guid isPermaLink="false">690ce4422e32add3a4a02c93</guid>
      <description>It&#8217;s not for everyone, but sometimes my robot vacuum is my only friend.</description>
    </item>
    <item>
      <title>PayPal finally returns to the UK - and relaunches with all-new payment tools and services</title>
      <link>https://www.techradar.com/pro/paypal-re-launches-in-the-uk-with-all-new-payment-tools-and-services</link>
      <pubDate>Wed, 12 Nov 2025 12:24:00 +0000</pubDate>
      <guid isPermaLink="false">tPruHX2YABnRJEm5sSfkQg</guid>
      <description>UK customers will be the first to get PayPal+ loyalty points across a range of payment methods.</description>
    </item>
    <item>
      <title>&#171;&#160;Personne n&#8217;en veut&#160;&#187; : Microsoft s&#8217;attire les foudres des utilisateurs sur l&#8217;int&#233;gration de l&#8217;IA dans Windows 11</title>
      <link>https://www.01net.com/actualites/personne-nen-veut-microsoft-sattire-les-foudres-des-utilisateurs-sur-lintegration-de-lia-dans-windows-11.html</link>
      <pubDate>Wed, 12 Nov 2025 12:22:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1307322</guid>
      <description>Apr&#232;s avoir &#233;voqu&#233; l&#8217;&#233;volution de Windows 11 vers un syst&#232;me d&#8217;exploitation agentique anim&#233; par l&#8217;IA, le responsable de la division Windows chez Microsoft a re&#231;u un torrent de r&#233;actions n&#233;gatives de la part des utilisateurs.</description>
    </item>
    <item>
      <title>La Switch Lite est &#224; -40 % pour le Singles Day : une console Nintendo plus petite et plus portable, mais beaucoup moins ch&#232;re</title>
      <link>https://www.frandroid.com/bons-plans/2865437_la-switch-lite-est-a-40-pour-le-singles-day-une-console-nintendo-plus-petite-et-plus-portable-mais-beaucoup-moins-chere</link>
      <pubDate>Wed, 12 Nov 2025 12:14:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2865437_la-switch-lite-est-a-40-pour-le-singles-day-une-console-nintendo-plus-petite-et-plus-portable-mais-beaucoup-moins-chere</guid>
      <description>
La Nintendo Switch Lite est une version uniquement portable de la Switch premi&#232;re du nom, &#224; retrouver &#224; 124,14 euros au lieu de 199 euros sur AliExpress, soit pr&#232;s de 40 % de remise sur le prix de base.
</description>
    </item>
    <item>
      <title>8 Times Scientists and Inventors Tragically Died for Their Experiments</title>
      <link>https://gizmodo.com/8-times-scientists-and-inventors-tragically-died-for-their-experiments-2000684271</link>
      <pubDate>Wed, 12 Nov 2025 12:10:04 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000684271</guid>
      <description>Innovation can be deadly.</description>
    </item>
    <item>
      <title>This new AirTag rival is disguised as a credit card to throw thieves off its tracking scent</title>
      <link>https://www.techradar.com/phones/phone-accessories/this-new-airtag-rival-is-disguised-as-a-credit-card-to-throw-thieves-off-its-tracking-scent</link>
      <pubDate>Wed, 12 Nov 2025 12:06:00 +0000</pubDate>
      <guid isPermaLink="false">NPSxEgpW83p28LZqWDCAn4</guid>
      <description>Nomad&#8217;s Tracking Card Pro is an AirTag rival with a clever trick to hide it from thieves.</description>
    </item>
    <item>
      <title>Agentic AI isn&#8217;t always the answer</title>
      <link>https://www.fastcompany.com/91436597/agentic-ai-isnt-always-the-answeragentic-ai</link>
      <pubDate>2025-11-12T12:04:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91436597/agentic-ai-isnt-always-the-answeragentic-ai</guid>
      <description>Success will come from using this tool for the right task, at the right time.
When it comes to agentic artificial intelligence, the fear of missing out factor is clear. Organizations are plopping down agents, in part, because that&#8217;s what everyone else seems to be doing. But FOMO is not a business strategy. To make agentic AI work, business leaders need to ignore the hype and concentrate on establishing exactly what agents can do for them, how, and at what cost....</description>
    </item>
    <item>
      <title>&#8216;Predator: Badlands&#8217; Star Elle Fanning Thinks Genre Movies Are as Award-Worthy as the Rest of Cinema</title>
      <link>https://gizmodo.com/predator-badlands-star-elle-fanning-thinks-genre-movies-are-as-award-worthy-as-the-rest-of-cinema-2000684570</link>
      <pubDate>Wed, 12 Nov 2025 12:00:37 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000684570</guid>
      <description>Actors in horror, sci-fi, and fantasy films have long been overlooked by the Oscars, with just a few notable exceptions.</description>
    </item>
    <item>
      <title>How to Talk to ChatGPT for Free Inside WhatsApp (While You Still Can)</title>
      <link>https://www.wired.com/story/talk-to-chatgpt-for-free-inside-whatsapp/</link>
      <pubDate>Wed, 12 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">6912725ef59d6c0083e03f3b</guid>
      <description>Meta&#8217;s messaging app offers free access to the AI chatbot, but only until January 2026.</description>
    </item>
    <item>
      <title>Teradar raises $150M for a sensor it says beats lidar and radar</title>
      <link>https://techcrunch.com/2025/11/12/teradar-exits-stealth-with-an-all-weather-sensor-for-autonomy-and-150m-in-funding/</link>
      <pubDate>Wed, 12 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3066769</guid>
      <description>Teradar's sensor uses the terahertz part of the electromagnetic spectrum, and combines the best traits of radar and lidar sensors without some of the drawbacks.</description>
    </item>
    <item>
      <title>Why Uncommon Goods is your gift-giving secret weapon amid Amazon burnout and tariffs</title>
      <link>https://www.fastcompany.com/91437796/uncommon-goods-thoughtful-gifts-tariffs</link>
      <pubDate>2025-11-12T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91437796/uncommon-goods-thoughtful-gifts-tariffs</guid>
      <description>For 25 years, Uncommon Goods has focused on hidden e-commerce gems. This year, it might be a way to make your holiday spending more meaningful.
The early darkness in most of the U.S. means that fall has set in. That&#160;also means it&#8217;s officially holiday shopping season. With the economic impact of President Trump&#8217;s ever-fluctuating tariffs an open question, there&#8217;s an opportunity for shoppers to make their spending meaningful, which opens up a lane for companies that are offering something other than the e-commerce onslaught of nearly identical products that populate sites like Amazon and Walmart...</description>
    </item>
    <item>
      <title>This recommerce site is tackling retail&#8217;s 8-billion-pound problem&#8212;returns&#8212;with buy-in from Jay-Z and Serena Williams</title>
      <link>https://www.fastcompany.com/91439235/rebel-recommerce-returned-products-for-sale</link>
      <pubDate>2025-11-12T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91439235/rebel-recommerce-returned-products-for-sale</guid>
      <description>Rebel partners with retailers to sell their returned merchandise. It just raised $25 million led by Jay-Z&#8217;s MarcyPen Capital Partners to keep growing.
America is in an overstock and returns crisis. Every year 8.4 billion pounds of products are returned to online sellers, according to the National Retail Federation. The typical solution from retailers is to send the roughly 17% of their inventory made up of returns to a landfill, regardless of the condition of the products....</description>
    </item>
    <item>
      <title>Vie num&#233;rique | Parler toutes les langues du monde</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-11-12/vie-numerique/parler-toutes-les-langues-du-monde.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 12 Nov 2025 07:00:00 -0500</pubDate>
      <guid isPermaLink="false">19cd939881403ac7bb5374b85b54a84f</guid>
      <description>Quand le PDG de Facebook, Mark Zuckerberg, a annonc&#233; qu&#8217;il rebaptisait son entreprise Meta, en octobre&#160;2021, une des choses qu&#8217;il a promises gr&#226;ce &#224; l&#8217;&#233;mergence de son IA est qu&#8217;il serait possible de pr&#233;server toutes les langues parl&#233;es sur la plan&#232;te. On est encore loin du compte, mais c&#8217;est ce qui guide le d&#233;veloppement de la g&#233;n&#233;ration de ses lunettes connect&#233;es qui vient d&#8217;&#234;tre mise en vente....</description>
    </item>
    <item>
      <title>Voici &#224; quoi ressembleront les futures voitures &#233;lectriques de Peugeot : direction r&#233;volutionnaire et nouveau style au programme</title>
      <link>https://www.frandroid.com/marques/peugeot/2865071_voici-a-quoi-ressembleront-les-futures-voitures-electriques-de-peugeot-direction-revolutionnaire-et-nouveau-style-au-programme</link>
      <pubDate>Wed, 12 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/peugeot/2865071_voici-a-quoi-ressembleront-les-futures-voitures-electriques-de-peugeot-direction-revolutionnaire-et-nouveau-style-au-programme</guid>
      <description>
Voici le Peugeot Polygon, annonciateur des futures voitures &#233;lectriques de la marque. Ce concept met en avant son Hypersquare, ce dr&#244;le de volant associ&#233; &#224; la direction &#233;lectronique steer-by-wire&#8230; et confirme que la nouvelle Peugeot 208 aura un peu de retard.
</description>
    </item>
    <item>
      <title>30 jours avec l&#8217;iPhone Air : j&#8217;avais tort de le d&#233;tester autant</title>
      <link>https://www.frandroid.com/marques/apple/2865655_mon-mois-avec-liphone-air-javais-tort-de-le-detester-autant</link>
      <pubDate>Wed, 12 Nov 2025 11:54:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2865655_mon-mois-avec-liphone-air-javais-tort-de-le-detester-autant</guid>
      <description>
Retour d'exp&#233;rience apr&#232;s 30 jours avec l'iPhone Air : comment un produit universellement critiqu&#233; (moi le premier) peut finalement faire sens.
</description>
    </item>
    <item>
      <title>Pok&#233;mon Pokopia looks adorable. Heres everything to know.</title>
      <link>https://mashable.com/article/pokemon-pokopia-explained</link>
      <pubDate>Wed, 12 Nov 2025 11:52:46 +0000</pubDate>
      <guid isPermaLink="false">01tBWA7eogPZRzW7tEwGhHW</guid>
      <description>What can you expect from Pok&#233;mon&#8217;s first life/farming sim?</description>
    </item>
  </channel>
</rss>
