<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 26 Dec 2025 08:34:04 GMT</lastBuildDate>
    <item>
      <title>Les Nothing ear (a) not&#233;s 9/10 gr&#226;ce &#224; une solide r&#233;duction de bruit perdent 40 % sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2920595_les-nothing-ear-a-notes-9-10-grace-a-une-solide-reduction-de-bruit-perdent-40-sur-amazon</link>
      <pubDate>Fri, 26 Dec 2025 08:17:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2920595_les-nothing-ear-a-notes-9-10-grace-a-une-solide-reduction-de-bruit-perdent-40-sur-amazon</guid>
      <description>
Les Nothing Ear (a) arrivent avec une fiche technique compl&#232;te, personnalisable &#224; quasiment tous les niveaux, et se permettent m&#234;me d'int&#233;grer de l'intelligence artificielle. Chez Amazon, ils perdent 40 % et tombent &#224; 59 euros.
</description>
    </item>
    <item>
      <title>Apr&#232;s 4 jours de cyberattaque, La Poste annonce un retour &#224; la normale, ou presque</title>
      <link>https://www.01net.com/actualites/apres-4-jours-cyberattaque-poste-annonce-retour-normale-presque.html</link>
      <pubDate>Fri, 26 Dec 2025 08:07:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317282</guid>
      <description>Quatre jours apr&#232;s le d&#233;but de la cyberattaque, La Poste assure que tout est plus ou moins rentr&#233; dans l'ordre. Colissimo, Digiposte et la Banque Postale fonctionnent de nouveau. Toutefois, l'attaque DDoS n'est pas encore termin&#233;e...</description>
    </item>
    <item>
      <title>The best microSD cards for the Nintendo Switch 2</title>
      <link>https://www.engadget.com/gaming/nintendo/best-microsd-cards-for-nintendo-switch-2-160052947.html?src=rss</link>
      <pubDate>Fri, 26 Dec 2025 08:00:36 +0000</pubDate>
      <guid isPermaLink="false">2df5caaa-9798-4115-a8f0-26050980cc10</guid>
      <description>If you want to expand the storage of your Nintendo Switch 2, you&#8217;ll need a microSD Express card. This is not the same as the more traditional microSD cards you may have bought for the original Switch or other gaming handhelds; Express cards are newer, faster and significantly more expensive on average. But they&#8217;re your only choice, and given how much space certain Switch 2 games chew up, you&#8217;ll probably have no choice but to get one eventually. Which to buy, though? If you&#8217;re looking for the best microSD card for the Switch 2 today, we&#8217;ve broken down what you should know before taking the plun...</description>
    </item>
    <item>
      <title>Purple Promo Codes and Deals: Up to 30% Off</title>
      <link>https://www.wired.com/story/purple-promo-code/</link>
      <pubDate>Fri, 26 Dec 2025 07:30:00 +0000</pubDate>
      <guid isPermaLink="false">68c8302f6aec50ed2359ebd3</guid>
      <description>On the hunt for the perfect mattress (and pillow)? Save on your soon-to-be favorite brand, Purple, with these coupons and deals.</description>
    </item>
    <item>
      <title>La nouvelle OnePlus Pad Go 2 est en pr&#233;commande et s&#8217;accompagne d&#8217;une montre offerte</title>
      <link>https://www.frandroid.com/bons-plans/2918987_la-nouvelle-oneplus-pad-go-2-est-en-precommande-et-saccompagne-dune-montre-offerte</link>
      <pubDate>Fri, 26 Dec 2025 07:23:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2918987_la-nouvelle-oneplus-pad-go-2-est-en-precommande-et-saccompagne-dune-montre-offerte</guid>
      <description>
Successeure de la OnePlus Pad Go, la nouvelle tablette d'entr&#233;e de gamme OnePlus Pad Go 2 est d'ores et d&#233;j&#224; disponible en pr&#233;commande, &#224; 269 euros au lieu de 349 euros. Et pour l'occasion, OnePlus vous offre sa Watch 2R.
</description>
    </item>
    <item>
      <title>Mini-PC, mod&#232;le tout-en-un&#8230; Lenovo pr&#233;parerait plein de choses pour commencer 2026</title>
      <link>https://www.frandroid.com/marques/lenovo/2920915_mini-pc-modele-tout-en-un-lenovo-aurait-lintention-den-mettre-plein-les-yeux-pour-commencer-2026</link>
      <pubDate>Fri, 26 Dec 2025 07:20:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lenovo/2920915_mini-pc-modele-tout-en-un-lenovo-aurait-lintention-den-mettre-plein-les-yeux-pour-commencer-2026</guid>
      <description>
Attendu en force au CES 2026, Lenovo laisse fuiter avant l'heure les d&#233;tails de certaines de ses nouveaut&#233;s. Parmi elles, un nouveau mini-PC cylindrique et un nouveau mod&#232;le AIO sous l'&#233;gide &#171; ThinkCentre &#187;... tous deux anim&#233;s par des puces Intel Panther Lake.
</description>
    </item>
    <item>
      <title>Apple : un iPhone Air 2 d&#232;s l&#8217;ann&#233;e prochaine ? Pourquoi on en doute</title>
      <link>https://www.frandroid.com/marques/apple/2920889_apple-un-iphone-air-2-des-lannee-prochaine-pourquoi-on-en-doute</link>
      <pubDate>Fri, 26 Dec 2025 07:12:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2920889_apple-un-iphone-air-2-des-lannee-prochaine-pourquoi-on-en-doute</guid>
      <description>
Un leaker chinois parfois bien renseign&#233; sugg&#232;re qu'Apple pourrait finalement lancer une nouvelle version de son iPhone Air d&#232;s l'ann&#233;e prochaine. Initialement, les rumeurs laissaient pourtant entendre qu'aucune nouvelle mouture de l'appareil n'arriverait avant 2027.
</description>
    </item>
    <item>
      <title>Les plus grandes r&#233;ussites dans la tech cette ann&#233;e&#160;: nos tops de 2025</title>
      <link>https://www.01net.com/actualites/les-tops-dans-la-tech-en-2025.html</link>
      <pubDate>Fri, 26 Dec 2025 07:03:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315637</guid>
      <description>Quelles sont les plus grandes r&#233;ussites de l&#8217;ann&#233;e dans les nouvelles technologies. Produits, innovations, acteurs, &#233;v&#233;nements, notre top de 2025 dans la tech revient sur les succ&#232;s incontournables certes ann&#233;e.</description>
    </item>
    <item>
      <title>How to watch Boxing Day Horse Racing 2025 for *FREE* &#8212; Watch King George VI Chase live on ITVX</title>
      <link>https://www.techradar.com/how-to-watch/horse-racing/boxing-day-horse-racing-2025-king-george-vi-chase-free-itv-racing</link>
      <pubDate>Fri, 26 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">aJiR9EFp7jsdLAZ45V9Qo4</guid>
      <description>Here's our guide on how to watch all the Boxing Day horse racing with the King George VI Chase at Kempton headlining.</description>
    </item>
    <item>
      <title>How to use AI to design your year</title>
      <link>https://www.fastcompany.com/91463174/how-to-use-ai-to-design-your-year</link>
      <pubDate>2025-12-26T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463174/how-to-use-ai-to-design-your-year</guid>
      <description>To set yourself up for success in 2026, use AI to get feedback on your goals, design the systems that support them, and forecast where things might go wrong.
If you&#8217;re an entrepreneur, at the end of the year you&#8217;re probably excited about the prospect of time off, but also daunted by the new year&#8217;s potential and all the deadlines you should be setting....</description>
    </item>
    <item>
      <title>5 Ways AI Changed Work in 2025</title>
      <link>https://www.fastcompany.com/91464151/5-ways-ai-changed-work-in-2025</link>
      <pubDate>2025-12-26T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464151/5-ways-ai-changed-work-in-2025</guid>
      <description>In 2025, AI joined the workplace where it was the superstar employee, the confidante, and the scapegoat all at once.
2025 was unquestionably the year of the AI boom at work. When generative AI like ChatGPT entered the scene a few years ago, it started as a novelty. Early adapters saw its potential to change the way we work, but for most people it was a way to rewrite Keats&#8217;s poetry in pirate speak, or remix their favorite memes.&#160;...</description>
    </item>
  </channel>
</rss>
