<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 16 Dec 2025 10:30:48 GMT</lastBuildDate>
    <item>
      <title>French government hit by cyberattack - Interior Ministry confirms email systems hit</title>
      <link>https://www.techradar.com/pro/security/french-government-hit-by-cyberattack-interior-ministry-confirms-email-systems-hit</link>
      <pubDate>Tue, 16 Dec 2025 10:26:52 +0000</pubDate>
      <guid isPermaLink="false">wkzn8gB9fiJ4xRy9GV5MHk</guid>
      <description>Speculation rises over the identity and motives of unknown hackers.</description>
    </item>
    <item>
      <title>Netflix-Warner : Le g&#233;ant de la SVoD annonce ne pas rench&#233;rir face &#224; Paramount et garde une confiance aveugle dans son deal</title>
      <link>https://www.frandroid.com/services/svod/2911207_netflix-warner-le-geant-de-la-svod-annonce-ne-pas-rencherir-face-a-paramount-et-garde-une-confiance-aveugle-dans-son-deal</link>
      <pubDate>Tue, 16 Dec 2025 10:24:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2911207_netflix-warner-le-geant-de-la-svod-annonce-ne-pas-rencherir-face-a-paramount-et-garde-une-confiance-aveugle-dans-son-deal</guid>
      <description>
Non, Netflix ne bougera pas face &#224; l'OPA de Paramount. C'est ce que Greg Peters et Ted Sarandos, les co-directeurs de la plateforme de streaming, ont annonc&#233; dans une lettre &#224; leurs employ&#233;s. Une tentative de rassurer qui pourrait passer pour une d&#233;monstration d'exc&#232;s de confiance.
</description>
    </item>
    <item>
      <title>How to watch Australia vs England on Sling TV: live stream Ashes 3rd Test cricket</title>
      <link>https://www.techradar.com/how-to-watch/cricket/australia-vs-england-sling-tv-ashes-3rd-test</link>
      <pubDate>Tue, 16 Dec 2025 10:24:03 +0000</pubDate>
      <guid isPermaLink="false">VEUrHz7ng4UnN55R2pQGKi</guid>
      <description>All the ways to watch the 3rd Ashes Test at Adelaide on Sling from anywhere in the world as England face a must-win match against Australia in the cricket.</description>
    </item>
    <item>
      <title>Test Xiaomi BW400 Pro : une cam&#233;ra de surveillance efficace et endurante</title>
      <link>https://www.frandroid.com/marques/xiaomi/2837737_test-xiaomi-bw400-pro-une-camera-de-surveillance-efficace-et-endurante</link>
      <pubDate>Tue, 16 Dec 2025 10:10:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2837737_test-xiaomi-bw400-pro-une-camera-de-surveillance-efficace-et-endurante</guid>
      <description>
La Xiaomi BW400 Pro compl&#232;te une offre de cam&#233;ras de s&#233;curit&#233; connect&#233;es d&#233;j&#224; pl&#233;thorique chez le constructeur chinois. Toutefois, entre les promesses li&#233;es &#224; l&#8217;IA, le design et un panneau solaire int&#233;gr&#233; pour l&#8217;endurance, ce mod&#232;le a tout pour intriguer et s&#233;duire.
</description>
    </item>
    <item>
      <title>CarPlay : ces deux nouvelles fonctionnalit&#233;s vont changer vos trajets en voiture</title>
      <link>https://www.frandroid.com/os/ios/2911351_carplay-ces-deux-nouvelles-fonctionnalites-vont-changer-vos-trajets-en-voiture</link>
      <pubDate>Tue, 16 Dec 2025 10:09:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/ios/2911351_carplay-ces-deux-nouvelles-fonctionnalites-vont-changer-vos-trajets-en-voiture</guid>
      <description>
Vous pensiez que CarPlay prenait la poussi&#232;re ? C'est faux. Alors que tout le monde a les yeux riv&#233;s sur le futur "CarPlay Ultra", Apple d&#233;ploie discr&#232;tement deux fonctionnalit&#233;s tr&#232;s attendues dans sa derni&#232;re mise &#224; jour iOS 26.2.
</description>
    </item>
    <item>
      <title>Un bon laptop gaming pas cher pour No&#235;l ? Ce HP Victus 15 avec une RTX 4060 est &#224; un super prix chez Boulanger</title>
      <link>https://www.frandroid.com/bons-plans/2911143_un-bon-laptop-gaming-pas-cher-pour-noel-ce-hp-victus-15-avec-une-rtx-4060-est-a-un-super-prix-chez-boulanger</link>
      <pubDate>Tue, 16 Dec 2025 10:03:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2911143_un-bon-laptop-gaming-pas-cher-pour-noel-ce-hp-victus-15-avec-une-rtx-4060-est-a-un-super-prix-chez-boulanger</guid>
      <description>
Le HP Victus 15-fa1016nf est un PC gaming milieu de gamme avec une solide configuration que vous retrouvez sur Boulanger pour 649,99 euros au lieu de 899,99 euros.
</description>
    </item>
    <item>
      <title>Apple Watch chez Free&#160;: l&#8217;option eSIM est enfin l&#224; (et il y a une surprise)</title>
      <link>https://www.01net.com/actualites/apple-watch-chez-free-loption-esim-est-enfin-la-et-il-y-a-une-surprise.html</link>
      <pubDate>Tue, 16 Dec 2025 10:02:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315526</guid>
      <description>C&#8217;est officiel : Free Mobile lance l&#8217;eSIM pour Apple Watch et, contrairement &#224; la concurrence, l&#8217;option est incluse sans surco&#251;t dans les forfaits.</description>
    </item>
    <item>
      <title>The best mobile microphones for 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-mobile-microphones-for-recording-with-a-phone-154536629.html?src=rss</link>
      <pubDate>Tue, 16 Dec 2025 10:01:25 +0000</pubDate>
      <guid isPermaLink="false">07c9467f-8fa0-4b32-9633-399c841713e5</guid>
      <description>There&#8217;s nothing more frustrating than shooting the perfect reel only to realize that the audio sounds like garbage. For budding creators, it&#8217;s a frustration; for those looking to make more professional content, it&#8217;s a dealbreaker. Fortunately, the world of mobile-specific (or phone-friendly) microphones has exploded with great options in the last few years. Whether you&#8217;ve been tasked with recording candid moments at a relative&#8217;s wedding, shooting a friend&#8217;s dance moves or are a journalist out in the field traveling light &#8212; there&#8217;s an option out there that will be perfect for you.We&#8217;ve tested a...</description>
    </item>
    <item>
      <title>CEOs Want to Keep Pouring Money Into AI, Despite Weak Returns: Survey</title>
      <link>https://gizmodo.com/ceos-want-to-keep-pouring-money-into-ai-despite-weak-returns-survey-2000700007</link>
      <pubDate>Tue, 16 Dec 2025 10:00:38 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000700007</guid>
      <description>Most executives say their AI projects aren&#8217;t delivering returns, but nearly 70% still plan to spend more next year.</description>
    </item>
    <item>
      <title>Voici nos 4 voitures &#233;lectriques pr&#233;f&#233;r&#233;es de l&#8217;ann&#233;e 2025 parmi 31 mod&#232;les</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2910461_voici-nos-4-voitures-electriques-preferees-de-lannee-2025-parmi-31-modeles</link>
      <pubDate>Tue, 16 Dec 2025 10:00:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2910461_voici-nos-4-voitures-electriques-preferees-de-lannee-2025-parmi-31-modeles</guid>
      <description>
Lors de notre &#233;mission Twitch Survolt&#233;s sp&#233;ciale fin d&#8217;ann&#233;e, nous avons d&#233;voil&#233; nos 4 voitures &#233;lectriques pr&#233;f&#233;r&#233;es de 2025. Nous avons &#233;galement class&#233; 31 voitures &#233;lectriques test&#233;es ou lanc&#233;es au cours de ce mill&#233;sime. Voici la liste compl&#232;te.
</description>
    </item>
    <item>
      <title>Team Cherry details Hollow Knight: Silksong expansion and a Switch 2 Edition of the original Hollow Knight</title>
      <link>https://www.techradar.com/gaming/team-cherry-details-hollow-knight-silksong-expansion-and-a-switch-2-edition-of-the-original-hollow-knight</link>
      <pubDate>Tue, 16 Dec 2025 09:54:50 +0000</pubDate>
      <guid isPermaLink="false">ukMLeiryQSCGf4Bkvy7bzk</guid>
      <description>Hollow Knight: Silksong's first expansion &#8212; Sea of Sorrow &#8212; is coming next year alongside a Switch 2 Edition of the original game. Here's what you need to know.</description>
    </item>
    <item>
      <title>&#171; C&#8217;est la douche froide &#187; : la r&#233;vision de sa voiture &#233;lectrique lui co&#251;te 1 200 &#8364;, c&#8217;est deux fois plus cher que dans une autre concession</title>
      <link>https://www.frandroid.com/marques/smart/2911133_cest-la-douche-froide-la-revision-de-sa-voiture-electrique-lui-coute-1-200-e-cest-deux-fois-plus-cher-que-dans-une-autre-concession</link>
      <pubDate>Tue, 16 Dec 2025 09:50:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/smart/2911133_cest-la-douche-froide-la-revision-de-sa-voiture-electrique-lui-coute-1-200-e-cest-deux-fois-plus-cher-que-dans-une-autre-concession</guid>
      <description>
Un propri&#233;taire de Smart #1 a re&#231;u un devis &#224; plus de 1 200 euros pour la r&#233;vision de sa voiture &#233;lectrique. Un tarif hallucinant, qui varie cependant en fonction des concessions.
</description>
    </item>
    <item>
      <title>L&#226;ch&#233; par Volvo, c&#8217;est la faillite pour ce fabricant d&#8217;un capteur qu&#8217;Elon Musk d&#233;teste : bient&#244;t la fin des LiDAR ?</title>
      <link>https://www.frandroid.com/marques/volvo/2911085_lache-par-volvo-cest-la-faillite-pour-ce-fabricant-dun-capteur-quelon-musk-deteste-bientot-la-fin-des-lidar</link>
      <pubDate>Tue, 16 Dec 2025 09:47:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volvo/2911085_lache-par-volvo-cest-la-faillite-pour-ce-fabricant-dun-capteur-quelon-musk-deteste-bientot-la-fin-des-lidar</guid>
      <description>
L'entreprise Luminar, qui fournissait des LiDAR pour la conduite semi-autonome des voitures &#233;lectriques de Volvo, vient de se placer en faillite apr&#232;s avoir perdu le contrat avec la marque su&#233;doise. De quoi se questionner sur l'utilit&#233; de cet &#233;quipement, ha&#239; par Elon Musk ?
</description>
    </item>
    <item>
      <title>The OnePlus Turbo has been teased &#8211; and it might include an astonishingly big battery</title>
      <link>https://www.techradar.com/phones/oneplus-phones/the-oneplus-turbo-has-been-teased-and-it-might-include-an-astonishingly-big-battery</link>
      <pubDate>Tue, 16 Dec 2025 09:44:59 +0000</pubDate>
      <guid isPermaLink="false">noQjoS3iGwz8K9b38hrqJZ</guid>
      <description>OnePlus has announced the OnePlus Turbo line, highlighting strong performance and battery life.</description>
    </item>
    <item>
      <title>HBO Max copie la t&#233;l&#233; : cette nouvelle fonction veut changer vos soir&#233;es zapping</title>
      <link>https://www.frandroid.com/services/svod/2911101_hbo-max-copie-la-tele-cette-nouvelle-fonction-veut-changer-vos-soirees-zapping</link>
      <pubDate>Tue, 16 Dec 2025 09:38:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2911101_hbo-max-copie-la-tele-cette-nouvelle-fonction-veut-changer-vos-soirees-zapping</guid>
      <description>
HBO Max lance des cha&#238;nes th&#233;matiques, une nouvelle mani&#232;re d'acc&#233;der rapidement &#224; un programme sans avoir &#224; faire d&#233;filer l'ensemble du catalogue. 
</description>
    </item>
    <item>
      <title>Facebook Messenger ne fonctionne plus sur ces appareils</title>
      <link>https://www.01net.com/actualites/facebook-messenger-fonctionne-plus-sur-ces-appareils.html</link>
      <pubDate>Tue, 16 Dec 2025 09:37:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315496</guid>
      <description>Facebook Messenger ne fonctionne d&#233;sormais plus sur certains appareils. Meta a mis fin &#224; des applications utilis&#233;es depuis des ann&#233;es, apr&#232;s avoir pr&#233;venu les utilisateurs en amont.</description>
    </item>
    <item>
      <title>Samsung arr&#234;te-t-il vraiment les SSD grand public au profit de l&#8217;IA ? Le constructeur brise le silence</title>
      <link>https://www.frandroid.com/marques/samsung/2911231_samsung-arrete-t-il-vraiment-les-ssd-grand-public-au-profit-de-lia-le-constructeur-brise-le-silence</link>
      <pubDate>Tue, 16 Dec 2025 09:28:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2911231_samsung-arrete-t-il-vraiment-les-ssd-grand-public-au-profit-de-lia-le-constructeur-brise-le-silence</guid>
      <description>
Samsung d&#233;ment l'arr&#234;t de production des SSD pour le grand public apr&#232;s qu'une rumeur insistante a fait le tour d'internet ces derniers jours.
</description>
    </item>
    <item>
      <title>Bonne nouvelle pour l&#8217;autonomie r&#233;elle du moins cher des Tesla Model Y</title>
      <link>https://www.frandroid.com/marques/tesla/2911091_bonne-nouvelle-pour-lautonomie-reelle-du-moins-cher-des-tesla-model-y</link>
      <pubDate>Tue, 16 Dec 2025 09:25:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2911091_bonne-nouvelle-pour-lautonomie-reelle-du-moins-cher-des-tesla-model-y</guid>
      <description>
D&#233;voil&#233;e en octobre 2025, la Tesla Model Y standard a r&#233;cemment &#233;t&#233; test&#233;e par un site am&#233;ricain. Et bonne nouvelle, l&#8217;autonomie s&#8217;est r&#233;v&#233;l&#233;e sup&#233;rieure &#224; celle ayant &#233;t&#233; annonc&#233;e par le constructeur pour la voiture &#233;lectrique abordable.
</description>
    </item>
    <item>
      <title>Amazon vide son stock de ce petit drone DJI pas cher pour No&#235;l</title>
      <link>https://www.frandroid.com/bons-plans/2653979_amazon-vide-son-stock-de-ce-petit-drone-dji-pas-cher-pour-noel</link>
      <pubDate>Tue, 16 Dec 2025 09:23:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2653979_amazon-vide-son-stock-de-ce-petit-drone-dji-pas-cher-pour-noel</guid>
      <description>
Le DJI Neo ne cherche pas &#224; concurrencer les gros drones pros, il joue la carte de l&#8217;accessibilit&#233; et de la fluidit&#233;. Le deuxi&#232;me mod&#232;le est sorti cette ann&#233;e, ce qui permet alors &#224; ce premier mod&#232;le lanc&#233; en 2024 de s'afficher &#224; un super prix pour No&#235;l. 
</description>
    </item>
    <item>
      <title>LG Micro RGB evo : voici les trois tailles pour enfin rendre cette techno (un peu) plus accessible</title>
      <link>https://www.frandroid.com/marques/lg/2911033_lg-devoilera-ses-premiers-televiseurs-micro-rgb-evo-en-trois-tailles-au-ces-2026</link>
      <pubDate>Tue, 16 Dec 2025 09:22:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lg/2911033_lg-devoilera-ses-premiers-televiseurs-micro-rgb-evo-en-trois-tailles-au-ces-2026</guid>
      <description>
Le constructeur sud-cor&#233;en LG s'appr&#234;te &#224; pr&#233;senter au CES 2026 son tout premier t&#233;l&#233;viseur &#233;quip&#233; de la technologie Micro RGB. Baptis&#233; LG Micro RGB evo, ce mod&#232;le haut de gamme sera propos&#233; en trois diagonales distinctes : 100 pouces, 86 pouces et 75 pouces.
</description>
    </item>
    <item>
      <title>I've been using Dyson's new ultra-light vacuum for two weeks &#8211; these are the pros and cons so far</title>
      <link>https://www.techradar.com/home/vacuums/ive-been-using-dysons-new-ultra-light-vacuum-for-two-weeks-these-are-the-pros-and-cons-so-far</link>
      <pubDate>Tue, 16 Dec 2025 09:20:35 +0000</pubDate>
      <guid isPermaLink="false">Q88MKnKzQzgHNwbCubP7A8</guid>
      <description>Dyson shrank down all this vacuum's insides and squeezed them into the handle &#8211; so what's it like to use?</description>
    </item>
    <item>
      <title>Apple TV sur Android&#160;: l&#8217;application corrige enfin son plus gros d&#233;faut</title>
      <link>https://www.01net.com/actualites/apple-tv-sur-android-lapplication-corrige-enfin-son-plus-gros-defaut.html</link>
      <pubDate>Tue, 16 Dec 2025 09:14:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315504</guid>
      <description>Mieux vaut tard que jamais. L&#8217;application Apple TV pour Android comble sa plus grosse lacune avec l&#8217;arriv&#233;e du support Google Cast. Vous pouvez d&#233;sormais diffuser vos contenus sur grand &#233;cran sans bidouille.</description>
    </item>
    <item>
      <title>iPhone et montres connect&#233;es : la fin d&#8217;un blocage historique arrive enfin</title>
      <link>https://www.frandroid.com/marques/apple/2911139_iphone-et-montres-connectees-la-fin-dun-blocage-historique-arrive-enfin</link>
      <pubDate>Tue, 16 Dec 2025 09:05:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2911139_iphone-et-montres-connectees-la-fin-dun-blocage-historique-arrive-enfin</guid>
      <description>
Forc&#233;e par l&#8217;Union europ&#233;enne, Apple est en train d&#8217;impl&#233;menter une fonctionnalit&#233; de transfert des notifications afin de rendre son &#233;cosyst&#232;me mobile compatible avec des accessoires connect&#233;s en tout genre.
</description>
    </item>
    <item>
      <title>Want to make big changes in 2026? Try this fast and easy Japanese approach</title>
      <link>https://www.fastcompany.com/91457559/kaizen-new-years-resolutions</link>
      <pubDate>2025-12-16T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91457559/kaizen-new-years-resolutions</guid>
      <description>The &#8216;kaizen&#8217; method feels like nothing. Until suddenly it feels like everything.
I&#8217;ve tried them all. A fancy planner, &#8220;perfect&#8221; workout routines, ambitious ways to read more, and writing rituals to get more done. I did the research. But what ultimately worked is something called the kaizen incremental method.&#160;</description>
    </item>
    <item>
      <title>Watching office workers eat lunch is a thing on TikTok</title>
      <link>https://www.fastcompany.com/91460729/watching-office-workers-eat-lunch-is-a-thing-on-tiktok</link>
      <pubDate>2025-12-16T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91460729/watching-office-workers-eat-lunch-is-a-thing-on-tiktok</guid>
      <description>The &#8216;What I Eat in a Day&#8217; trend has spawned a million-plus videos.
For many office workers, the typical &#8220;lunch hour&#8221; is a sad desk lunch of a sandwich or slop bowl supplemented by a rotating schedule of snacks. According to a poll conducted by Yahoo and YouGov, half of employed Americans regularly eat at their workstations.&#160;</description>
    </item>
    <item>
      <title>Les arnaques en ligne co&#251;tent une somme astronomique &#224; la France et c&#8217;est la faute de l&#8217;IA</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2910479_les-arnaques-en-ligne-coutent-une-somme-astronomique-a-la-france-et-cest-la-faute-de-lia</link>
      <pubDate>Tue, 16 Dec 2025 08:47:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2910479_les-arnaques-en-ligne-coutent-une-somme-astronomique-a-la-france-et-cest-la-faute-de-lia</guid>
      <description>
L'essor de l'intelligence artificielle facilite les escroqueries sur Internet, &#224; tel point que les d&#233;penses li&#233;es &#224; leur traitement atteignent des sommets en France.
</description>
    </item>
    <item>
      <title>Ford stoppe les frais sur la voiture &#233;lectrique : &#171;&#160;ces mod&#232;les ne seront jamais rentables&#160;&#187;, l&#8217;aveu du patron qui encaisse une perte historique de 19 milliards de dollars</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2911163_ford-freine-sur-la-voiture-electrique-ces-modeles-ne-seront-jamais-rentables-laveu-du-patron</link>
      <pubDate>Tue, 16 Dec 2025 08:41:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2911163_ford-freine-sur-la-voiture-electrique-ces-modeles-ne-seront-jamais-rentables-laveu-du-patron</guid>
      <description>
C'est officiel et c'est violent. Ford vient de tuer le F-150 Lightning, son pick-up 100 % &#233;lectrique qui devait r&#233;volutionner l'Am&#233;rique. La marque au tr&#244;ne bleu jette l'&#233;ponge, encaisse une perte historique de 19,5 milliards de dollars et change radicalement de fusil d'&#233;paule.
</description>
    </item>
  </channel>
</rss>
