<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 29 Jan 2026 15:40:32 GMT</lastBuildDate>
    <item>
      <title>Meilleur v&#233;lo &#233;lectrique (VAE) : quel mod&#232;le choisir en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-survoltes/guides-dachat-velos-electriques/917361_guide-achat-choisir-meilleurs-velos-electriques-vae</link>
      <pubDate>Thu, 29 Jan 2026 15:38:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-survoltes/guides-dachat-velos-electriques/917361_guide-achat-choisir-meilleurs-velos-electriques-vae</guid>
      <description>
Difficile de s'y retrouver dans la jungle des v&#233;los &#233;lectriques (VAE). Pour vous aider &#224; choisir celui qu'il vous faut, nous avons test&#233; et s&#233;lectionn&#233; les meilleurs v&#233;los &#233;lectriques du march&#233;.
</description>
    </item>
    <item>
      <title>&#171;&#160;Les gens d&#233;testent l&#8217;IA&#160;&#187; : le navigateur Vivaldi est farouchement contre l&#8217;IA g&#233;n&#233;rative</title>
      <link>https://www.01net.com/actualites/les-gens-detestent-lia-le-navigateur-vivaldi-est-farouchement-contre-lia-generative.html</link>
      <pubDate>Thu, 29 Jan 2026 15:37:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323340</guid>
      <description>&#192; l'heure o&#249; tous les navigateurs web multiplient les fonctions IA, il est rafra&#238;chissant de voir qu'il y en a au moins un qui a d&#233;cid&#233; d'aller &#224; contre-courant. Vivaldi veut en effet se mettre les r&#233;fractaires &#224; l'IA dans la poche.</description>
    </item>
    <item>
      <title>India is teaching Google how AI in education can scale</title>
      <link>https://techcrunch.com/2026/01/29/india-is-teaching-google-how-ai-in-education-can-scale/</link>
      <pubDate>Thu, 29 Jan 2026 15:29:31 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3087477</guid>
      <description>With the highest global usage of Gemini for learning, India is emerging as a key market shaping Google's approach to AI in education.</description>
    </item>
    <item>
      <title>FBI seizes RAMP cybercrime forum used by ransomware gangs</title>
      <link>https://www.techradar.com/pro/security/fbi-seizes-ramp-cybercrime-forum-used-by-ransomware-gangs</link>
      <pubDate>Thu, 29 Jan 2026 15:25:00 +0000</pubDate>
      <guid isPermaLink="false">nXA6boF7NzFPu9JPf9GTrM</guid>
      <description>"Years of hard work" ruined, an operator cries, as the FBI places the usual banner on clearweb sites.</description>
    </item>
    <item>
      <title>A Waymo robotaxi struck a child near a school</title>
      <link>https://www.engadget.com/transportation/a-waymo-robotaxi-struck-a-child-near-a-school-152446302.html?src=rss</link>
      <pubDate>Thu, 29 Jan 2026 15:24:46 +0000</pubDate>
      <guid isPermaLink="false">76521c23-7258-4141-8db2-769465585fa0</guid>
      <description>Waymo said one of its robotaxis struck a child, who sustained minor injuries. The incident took place in Santa Monica, California, on January 23. The company reported it to the National Highway Traffic Safety Administration (NHTSA), which has opened an investigation.&#160;The agency said the incident occurred close to a school within regular drop-off hours, with other children and a crossing guard nearby. The child ran from behind a double-parked SUV into the path of a Waymo Driver. Waymo said its vehicle detected the child immediately as they emerged and that the robotaxi braked hard to lower its ...</description>
    </item>
    <item>
      <title>Voici la galaxie la plus lointaine jamais observ&#233;e et ce qu&#8217;a vu le t&#233;lescope James-Webb d&#233;concerte les astronomes</title>
      <link>https://www.futura-sciences.com/sciences/actualites/galaxie-voici-galaxie-plus-lointaine-jamais-observee-ce-qua-vu-telescope-james-webb-deconcerte-astronomes-130705/#xtor%3DRSS-8</link>
      <pubDate>Thu, 29 Jan 2026 16:23:01 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/galaxie-voici-galaxie-plus-lointaine-jamais-observee-ce-qua-vu-telescope-james-webb-deconcerte-astronomes-130705/#xtor%3DRSS-8</guid>
      <description>Le t&#233;lescope spatial James-Webb repousse sans cesse les limites de l&#8217;observable. Sa derni&#232;re prise&#160;: une galaxie qui existait d&#233;j&#224; 280&#160;millions d&#8217;ann&#233;es apr&#232;s le Big Bang. Une galaxie de plus qui d&#233;fie les th&#233;ories des astronomes.</description>
    </item>
    <item>
      <title>Flapping Airplanes and the promise of research-driven AI</title>
      <link>https://techcrunch.com/2026/01/29/flapping-airplanes-and-the-promise-of-research-driven-ai/</link>
      <pubDate>Thu, 29 Jan 2026 15:22:29 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3087787</guid>
      <description>A new AI lab called Flapping Airplanes launched yesterday, and a Sequoia partner has an interesting take on why they stand out.</description>
    </item>
    <item>
      <title>Beyond cracked screens: how device protection can evolve to cover our digital lives</title>
      <link>https://www.techradar.com/pro/beyond-cracked-screens-how-device-protection-can-evolve-to-cover-our-digital-lives</link>
      <pubDate>Thu, 29 Jan 2026 15:19:24 +0000</pubDate>
      <guid isPermaLink="false">nw29KvZXnEq5tCbkjHkJcM</guid>
      <description>As phones store our entire digital lives, protection must expand beyond cracked screens.</description>
    </item>
    <item>
      <title>A free iPhone 16e and a cheap unlimited data plan - what's not to love about this deal at Metro by T-Mobile?</title>
      <link>https://www.techradar.com/phones/iphone/a-free-iphone-16e-and-a-cheap-unlimited-data-plan-whats-not-to-love-about-this-deal-at-metro-by-t-mobile</link>
      <pubDate>Thu, 29 Jan 2026 15:19:22 +0000</pubDate>
      <guid isPermaLink="false">jqaQH7yTkwvUeuxNPQTGTg</guid>
      <description>Metro by T-Mobile is throwing in a free iPhone 16e right now with its unlimited plans - and those are pretty damn cheap, too.</description>
    </item>
    <item>
      <title>Honda vehicles used to proactively report road safety issues in nation-first pilot</title>
      <link>https://www.engadget.com/transportation/honda-vehicles-used-to-proactively-report-road-safety-issues-in-nation-first-pilot-151629967.html?src=rss</link>
      <pubDate>Thu, 29 Jan 2026 15:16:30 +0000</pubDate>
      <guid isPermaLink="false">feac87f4-dfa2-4d8c-b0fa-894735bd364f</guid>
      <description>Honda and DriveOhio have teamed up on a new road safety initiative in which Honda vehicles are being used to collect real-time data that can advise about potential issues and road deficiencies before they become a problem. Honda&#8217;s Proactive Roadway Maintenance System, which has been in prototyping since 2021, uses "advanced vision and LiDAR sensors" to identify issues such as worn or obstructed road signs, damaged guardrails, rough roads and emerging potholes.
During the pilot, members of the Ohio Department of Transportation&#8217;s smart mobility hub drove the test vehicles on around 3,000 miles o...</description>
    </item>
    <item>
      <title>Arco is a brilliant and beautiful sci-fi film inspired by animation legends</title>
      <link>https://www.theverge.com/entertainment/869700/arco-review-sci-fi-animated-film</link>
      <pubDate>2026-01-29T10:15:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=869700</guid>
      <description>Classic 2D animation may not be as prevalent as it once was, but some of the stuff we're getting over the last few years has been incredible. That includes future classics like Mars Express and Scavengers Reign, and now you can add the Moebius-inspired Arco to the list. After making a splash on the festival [&#8230;]</description>
    </item>
    <item>
      <title>Batterie morte ou &#233;cran cass&#233; ? Samsung Care+ couvre d&#233;sormais tout, m&#234;me en voyage</title>
      <link>https://www.frandroid.com/marques/samsung/2960405_batterie-morte-ou-ecran-casse-samsung-care-couvre-desormais-tout-meme-en-voyage</link>
      <pubDate>Thu, 29 Jan 2026 15:09:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2960405_batterie-morte-ou-ecran-casse-samsung-care-couvre-desormais-tout-meme-en-voyage</guid>
      <description>
Bonne nouvelle pour les maladroits chroniques et les grands voyageurs : Samsung a d&#233;cid&#233; de muscler s&#233;rieusement son offre d'assurance mobile sur le Vieux Continent. Le g&#233;ant cor&#233;en met &#224; jour sa formule Samsung Care+ avec une promesse forte : ne plus compter le nombre de fois o&#249; vous faites tomber votre pr&#233;cieux Galaxy.
</description>
    </item>
    <item>
      <title>Mauvaise nouvelle si vous attendiez le Nothing Phone (4)</title>
      <link>https://www.frandroid.com/marques/nothing/2960273_mauvaise-nouvelle-si-vous-attendiez-le-nothing-phone-4</link>
      <pubDate>Thu, 29 Jan 2026 15:02:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nothing/2960273_mauvaise-nouvelle-si-vous-attendiez-le-nothing-phone-4</guid>
      <description>
Carl Pei, PDG de Nothing, d&#233;voile les plans de la marque pour 2026 et pr&#233;cise ce qu'il en est du Nothing Phone (4).
</description>
    </item>
    <item>
      <title>&#171; Une r&#233;duction imm&#233;diate allant de 2 &#224; 200 euros &#187; : pourquoi ce site est important &#224; conna&#238;tre pour r&#233;parer un produit</title>
      <link>https://www.frandroid.com/culture-tech/economie/2959973_une-reduction-immediate-allant-de-2-a-200-euros-pourquoi-ce-site-est-important-a-connaitre-pour-reparer-un-produit</link>
      <pubDate>Thu, 29 Jan 2026 15:01:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/economie/2959973_une-reduction-immediate-allant-de-2-a-200-euros-pourquoi-ce-site-est-important-a-connaitre-pour-reparer-un-produit</guid>
      <description>
Connaissez-vous le site JeRepare.fr ? C'est le site pratique qui centralise toutes les infos importantes sur le Bonus R&#233;paration et les appareils &#233;ligibles.
</description>
    </item>
    <item>
      <title>Ryan Coogler Spills the Tea on What Smoke and Stack Were Up to Before &#8216;Sinners&#8217;</title>
      <link>https://gizmodo.com/ryan-coogler-sinners-prequel-smoke-stack-2000715470</link>
      <pubDate>Thu, 29 Jan 2026 15:00:48 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715470</guid>
      <description>Before the twins had their barn-burning shindig at the juke joint, they were globe-trotting and breaking hearts.</description>
    </item>
    <item>
      <title>Netflix is eating Hollywood &#8212; because it has to</title>
      <link>https://www.theverge.com/podcast/869464/netflix-warner-bros-discovery-deal-paramount-skydance-hollywood-streaming-future</link>
      <pubDate>2026-01-29T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=869464</guid>
      <description>On today&#8217;s episode of Decoder, I&#8217;m talking about the bidding war over Warner Bros. Discovery, which is the biggest story in the entertainment industry right now, and for good reason. It has pretty much everything you could want in a buzzy Hollywood saga &#8212; big names, big money, and big drama. Right now, the winning [&#8230;]</description>
    </item>
    <item>
      <title>Sen. Warren pushes Altman for guarantee OpenAI isn&#8217;t seeking government bailout</title>
      <link>https://www.theverge.com/news/869983/elizabeth-warren-openai-sam-altman-bailout-letter</link>
      <pubDate>2026-01-29T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=869983</guid>
      <description>Senator Elizabeth Warren (D-MA) is pushing OpenAI for assurances it won't seek a government bailout if it doesn't turn a profit. In a letter to CEO Sam Altman, Warren says she is concerned that the company is preparing to fall back "on the classic strategy of privatizing profits and socializing losses" amid soaring spending and [&#8230;]</description>
    </item>
    <item>
      <title>Quordle hints and answers for Friday, January 30 (game #1467)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-30-january-2026</link>
      <pubDate>Thu, 29 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">55S8bTSYTuriWuyn4sHs2V</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Friday, January 30 (game #698)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-30-january-2026</link>
      <pubDate>Thu, 29 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">BixXtxvGy8FKJcg4xMdKXP</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Friday, January 30 (game #964)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-30-january-2026</link>
      <pubDate>Thu, 29 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">5e88z8JeiheaCwvJDx947M</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>Tesla&#8217;s energy storage business is growing faster than any other part of the company</title>
      <link>https://techcrunch.com/2026/01/29/teslas-energy-storage-business-is-growing-faster-than-any-other-part-of-the-company/</link>
      <pubDate>Thu, 29 Jan 2026 14:58:47 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3087791</guid>
      <description>Energy storage products like the Megapack, Megablock, and Powerwall drove</description>
    </item>
    <item>
      <title>This Spider&#8217;s &#8216;Pearl Necklace&#8217; Looks Fancy&#8212;Until You Learn What It Really Is</title>
      <link>https://gizmodo.com/this-spiders-pearl-necklace-looks-fancy-until-you-learn-what-it-really-is-2000715237</link>
      <pubDate>Thu, 29 Jan 2026 14:55:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715237</guid>
      <description>Nature is awesome, but it can also be super gross.</description>
    </item>
    <item>
      <title>Digital friction is quietly crippling UK productivity, and AI could be the turning point</title>
      <link>https://www.techradar.com/pro/digital-friction-is-quietly-crippling-uk-productivity-and-ai-could-be-the-turning-point</link>
      <pubDate>Thu, 29 Jan 2026 14:52:44 +0000</pubDate>
      <guid isPermaLink="false">pSgTWeTLFZfnmWTVtaxe6U</guid>
      <description>Small IT failures create big costs. AI can ease disruption and boost output.</description>
    </item>
    <item>
      <title>Spotify rolls out group chats</title>
      <link>https://techcrunch.com/2026/01/29/spotify-rolls-out-group-chats/</link>
      <pubDate>Thu, 29 Jan 2026 14:52:13 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3087783</guid>
      <description>Spotify users can now share the podcasts, playlists, and audiobooks they're listening to with up 10 people.</description>
    </item>
    <item>
      <title>Palantir to continue UK Ministry of Defense work in new three-year deal &#8211; &#163;240 million 'data analytics' contract awarded without procurement</title>
      <link>https://www.techradar.com/pro/security/palantir-to-continue-uk-ministry-of-defense-work-in-new-three-year-deal-gbp240-million-data-analytics-contract-awarded-without-procurement</link>
      <pubDate>Thu, 29 Jan 2026 14:51:01 +0000</pubDate>
      <guid isPermaLink="false">eE23unRoaNkPrPqxkPFvBB</guid>
      <description>UK MoD awards Palantir new three-year contract worth &#163;240 million to continue supporting data analytics capabilities.</description>
    </item>
    <item>
      <title>Apple&#8217;s new iPhone and iPad security feature limits cell networks from collecting precise location data</title>
      <link>https://techcrunch.com/2026/01/29/apples-new-iphone-and-ipad-security-feature-limits-cell-networks-from-collecting-precise-location-data/</link>
      <pubDate>Thu, 29 Jan 2026 14:50:57 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3087775</guid>
      <description>The new security feature makes it more difficult for police and malicious hackers to obtain a person's precise location data from a cell phone company.</description>
    </item>
    <item>
      <title>Microsoft a secr&#232;tement espionn&#233; des enfants gr&#226;ce &#224; Microsoft 365 Education</title>
      <link>https://www.frandroid.com/marques/microsoft/2959867_microsoft-a-secretement-espionne-des-enfants-grace-a-microsoft-365-education</link>
      <pubDate>Thu, 29 Jan 2026 14:50:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2959867_microsoft-a-secretement-espionne-des-enfants-grace-a-microsoft-365-education</guid>
      <description>
La firme de Redmond est accus&#233;e par l&#8217;autorit&#233; autrichienne de protection des donn&#233;es d&#8217;avoir install&#233; des cookies de suivis sur les machines des &#233;l&#232;ves utilisant sa suite bureautique.
</description>
    </item>
    <item>
      <title>Si vous attendiez le Nothing (4), il n&#8217;y aura rien en 2026</title>
      <link>https://www.01net.com/actualites/si-vous-attendiez-le-nothing-4-il-ny-aura-rien-en-2026.html</link>
      <pubDate>Thu, 29 Jan 2026 14:48:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323275</guid>
      <description>Fid&#232;le &#224; son image anticonformiste, Nothing s&#8217;appr&#234;te &#224; bousculer une nouvelle fois les codes du march&#233;. En 2026, la jeune marque londonienne fait l&#8217;impasse sur le tr&#232;s lucratif segment haut de gamme pour se concentrer sur le milieu de gamme et l&#8217;audio. Un choix pr&#233;sent&#233; comme strat&#233;gique par Carl Pei, mais qui pourrait aussi traduire une r&#233;alit&#233; plus pragmatique : celle d&#8217;un march&#233; des smartphones en pleine consolidation....</description>
    </item>
    <item>
      <title>The latest Apple Pencil just hit its lowest price since Black Friday</title>
      <link>https://www.techradar.com/tablets/ipad/the-latest-apple-pencil-just-hit-its-lowest-price-since-black-friday</link>
      <pubDate>Thu, 29 Jan 2026 14:47:46 +0000</pubDate>
      <guid isPermaLink="false">kZ7Q4ExAWVcA65weKaEt7g</guid>
      <description>Score &#163;20 off the Apple Pencil (USB-C) while this rare deal lasts at Amazon.</description>
    </item>
    <item>
      <title>C&#8217;est historique : la voiture &#233;lectrique vient de d&#233;tr&#244;ner l&#8217;essence et le diesel en Europe pour la premi&#232;re fois</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2960287_cest-historique-la-voiture-electrique-vient-de-detroner-lessence-et-le-diesel-en-europe-pour-la-premiere-fois</link>
      <pubDate>Thu, 29 Jan 2026 14:47:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2960287_cest-historique-la-voiture-electrique-vient-de-detroner-lessence-et-le-diesel-en-europe-pour-la-premiere-fois</guid>
      <description>
C'est un jalon symbolique qui vient de tomber : en d&#233;cembre 2025, les voitures 100 % &#233;lectriques ont d&#233;pass&#233; les mod&#232;les essence en Europe. Une premi&#232;re historique, m&#234;me si le chemin reste long avant que ce d&#233;passement devienne une r&#233;alit&#233; durable sur l'ensemble de l'ann&#233;e.
</description>
    </item>
    <item>
      <title>This ring watch squeezes in heart rate, sleep, and fitness tracking</title>
      <link>https://www.theverge.com/news/870023/rogbid-fusion-2-in-1-smart-ring-watch-heart-rate-fitness-sleep-tracking</link>
      <pubDate>2026-01-29T09:47:08-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=870023</guid>
      <description>It's not a household name, but Rogbid has been churning out budget-friendly smart wearables for around a decade. Its latest creation capitalizes on the recent trend of functional ring watches, but unlike Timex and Casio's wearables that don't do much more than tell time, the Rogbid Fusion includes smart functionality like fitness tracking, heart rate [&#8230;]...</description>
    </item>
    <item>
      <title>10 of the best-looking Apple Watch bands to buy for 2026</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/10-of-the-best-looking-apple-watch-bands-to-buy-for-2026</link>
      <pubDate>Thu, 29 Jan 2026 14:45:56 +0000</pubDate>
      <guid isPermaLink="false">ZLBkHFuqejqWWUGu2AEWdD</guid>
      <description>Switching up the look of your Apple Watch? Here's 10 of the best straps to buy right now.</description>
    </item>
    <item>
      <title>Apple's AirPods 4 with ANC are on sale for $119</title>
      <link>https://www.engadget.com/deals/apples-airpods-4-with-anc-are-on-sale-for-119-153239333.html?src=rss</link>
      <pubDate>Thu, 29 Jan 2026 14:45:38 +0000</pubDate>
      <guid isPermaLink="false">309c48af-1160-4213-97d7-a89957a5882f</guid>
      <description>Apple's AirPods 4 have a ton of improvements over the previous generation, but the version with active noise cancellation takes things up a notch. With them, you can get noise-cancelling power without the in-ear design of the AirPods Pro 3 that may bother some folks.
They're even more enticing when they're on sale, like right now. The AirPods 4 with ANC are down to $119 at the moment, or $60 less than their usual price. While we've seen the ANC model as low as $99, the $119 price tag is the best deal we've seen so far this year. 


Apple released its fourth-generation AirPods in late 2024 and ...</description>
    </item>
    <item>
      <title>Payday deal! Save $50 on this Crucial P310 1TB Gen 4 NVMe SSD at Best Buy &#8212; at just $149.99 it won't stay in stock for long</title>
      <link>https://www.techradar.com/pro/payday-deal-save-usd50-on-this-crucial-p310-1tb-gen-4-nvme-ssd-at-best-buy-at-just-usd149-99-it-wont-stay-in-stock-for-long</link>
      <pubDate>Thu, 29 Jan 2026 14:41:47 +0000</pubDate>
      <guid isPermaLink="false">BSiqYNqxvsu2T4AGTwsfvB</guid>
      <description>Crucial&#8217;s P310 1TB PCIe Gen 4 NVMe SSD is $50 off at Best Buy and delivers up to 7,100MB/s read speeds in an M.2 2280 form factor.</description>
    </item>
    <item>
      <title>Trump Admin's Plans for $500 Million USIP Building May Violate Court Order, Say Former Workers</title>
      <link>https://www.wired.com/story/trump-admins-plans-for-dollar500-million-usip-building-may-violate-court-order-say-former-workers/</link>
      <pubDate>Thu, 29 Jan 2026 14:39:10 +0000</pubDate>
      <guid isPermaLink="false">697aba54024f059590baa00b</guid>
      <description>The State Department is poised to take over a building DOGE seized from the US Institute of Peace, former staffers claim&#8212;possibly for Donald Trump&#8217;s &#8220;Board of Peace.&#8221;</description>
    </item>
    <item>
      <title>Monster Hunter Wilds : le patch miracle est l&#224;, et il change absolument tout pour les joueurs PC&#8230; et Steam Deck</title>
      <link>https://www.frandroid.com/services/jeux-video/2960215_monster-hunter-wilds-le-patch-miracle-est-la-et-il-change-absolument-tout-pour-les-joueurs-pc-et-steam-deck</link>
      <pubDate>Thu, 29 Jan 2026 14:38:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/jeux-video/2960215_monster-hunter-wilds-le-patch-miracle-est-la-et-il-change-absolument-tout-pour-les-joueurs-pc-et-steam-deck</guid>
      <description>
Capcom a d&#233;ploy&#233; un patch correctif tr&#232;s attendu pour Monster Hunter Wilds. Il corrige de nombreux probl&#232;mes de performances.
</description>
    </item>
    <item>
      <title>6 Samsung Galaxy Buds 4 Leaks That Have Already Dripped Out</title>
      <link>https://gizmodo.com/6-samsung-galaxy-buds-4-leaks-that-have-already-dripped-out-2000715190</link>
      <pubDate>Thu, 29 Jan 2026 14:35:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715190</guid>
      <description>With Samsung's next Unpacked event likely around the corner, Galaxy Buds 4 and 4 Pro rumors are pouring in.</description>
    </item>
    <item>
      <title>Fidelity is launching its own stablecoin</title>
      <link>https://www.theverge.com/news/870066/fidelity-stablecoin-fidd-ethereum</link>
      <pubDate>2026-01-29T09:32:49-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=870066</guid>
      <description>Fidelity is launching a stablecoin that investors will be able to buy and sell for $1 when it arrives in the "coming weeks." The stablecoin, called Fidelity Digital Dollar (FIDD), will live on the Ethereum network and is backed by cash reserves, cash equivalents, and short-term US Treasuries, according to CoinDesk. A stablecoin is a [&#8230;]</description>
    </item>
    <item>
      <title>Google Maps now lets you access Gemini while walking and cycling</title>
      <link>https://techcrunch.com/2026/01/29/google-maps-now-lets-you-access-gemini-while-walking-and-cycling/</link>
      <pubDate>Thu, 29 Jan 2026 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3087434</guid>
      <description>When you're walking around and navigating with Maps, you can now ask Gemini questions like "What neighborhood am I in?" or "What are top-rated restaurants nearby?"</description>
    </item>
    <item>
      <title>Google agrees to $135 million settlement for collecting Android users&#8217; data</title>
      <link>https://www.theverge.com/tech/870056/google-cellular-data-lawsuit-settlement</link>
      <pubDate>2026-01-29T09:24:45-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=870056</guid>
      <description>Android users could get a recovery payout of up to $100 each in a proposed settlement Google filed in San Jose, California on Tuesday night. As Reuters reports, the $135 million settlement is for a class action lawsuit claiming that Google collected users' cellular data without their permission, even while Google apps were closed, location [&#8230;]</description>
    </item>
    <item>
      <title>L&#8217;iPhone 17 Pro a attendu la fin des soldes d&#8217;hiver pour all&#232;ger son prix de 10 % sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2960021_liphone-17-pro-a-attendu-la-fin-des-soldes-dhiver-pour-alleger-son-prix-de-10-sur-amazon</link>
      <pubDate>Thu, 29 Jan 2026 14:21:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2960021_liphone-17-pro-a-attendu-la-fin-des-soldes-dhiver-pour-alleger-son-prix-de-10-sur-amazon</guid>
      <description>
L'iPhone 17 Pro est un smartphone moins &#233;l&#233;gant que ses pr&#233;d&#233;cesseurs, mais ses performances de haut vol, sa bonne gestion thermique et son &#233;cran bien lumineux suffisent &#224; le recommander les yeux ferm&#233;s. Pendant les soldes d'hiver, Amazon l'affiche &#224; 1 199 euros au lieu de 1 329 euros.
</description>
    </item>
    <item>
      <title>Microsoft tells us Windows 11 has hit a billion users &#8212; and if you're confused because you thought it was a failing OS, here's what's going on</title>
      <link>https://www.techradar.com/computing/windows/microsoft-tells-us-windows-11-has-hit-a-billion-users-and-if-youre-confused-because-you-thought-it-was-a-failing-os-heres-whats-going-on</link>
      <pubDate>Thu, 29 Jan 2026 14:17:40 +0000</pubDate>
      <guid isPermaLink="false">yJanqhokm4bZFs7niMLqtL</guid>
      <description>Windows 11 has hit a billion users &#8211; and faster than Windows 10 &#8211; so how does that work given all the hate aimed at Microsoft's newest OS?</description>
    </item>
    <item>
      <title>Realme P4 Power 5G&#160;: le monstre de 10&#160;001 mAh arrive officiellement en Europe</title>
      <link>https://www.01net.com/actualites/realme-p4-power-5g-le-monstre-de-10-000-mah-arrive-officiellement-en-europe.html</link>
      <pubDate>Thu, 29 Jan 2026 14:14:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323255</guid>
      <description>Fini la recharge quotidienne ? Realme vient de d&#233;voiler le P4 Power 5G, premier smartphone grand public dot&#233; d'une batterie de 10 001 mAh. La marque confirme son arriv&#233;e en Europe pour 2026.</description>
    </item>
    <item>
      <title>Sony veut enterrer la PS4 et vous explique pourquoi c&#8217;est le moment de passer &#224; la PS5</title>
      <link>https://www.frandroid.com/marques/sony/2959827_sony-veut-enterrer-la-ps4-et-vous-explique-pourquoi-cest-le-moment-de-passer-a-la-ps5</link>
      <pubDate>Thu, 29 Jan 2026 14:12:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2959827_sony-veut-enterrer-la-ps4-et-vous-explique-pourquoi-cest-le-moment-de-passer-a-la-ps5</guid>
      <description>
Alors que les rumeurs autour d'une PlayStation 6 se pr&#233;cisent pour 2028, Sony intensifie sa strat&#233;gie pour basculer ses 117 millions d'utilisateurs PS4 vers la g&#233;n&#233;ration actuelle. Entre notifications intrusives et fin de support progressive, l'&#233;tau se resserre sur la console de 2013.
</description>
    </item>
    <item>
      <title>Just in time for payday, this MSI Vector 16 HX AI laptop with Core Ultra 9, RTX 5080, 16GB RAM, and 1TB SSD is $500 off now</title>
      <link>https://www.techradar.com/pro/just-in-time-for-payday-this-msi-vector-16-hx-ai-laptop-with-core-ultra-9-rtx-5080-16gb-ram-and-1tb-ssd-is-usd500-off-now</link>
      <pubDate>Thu, 29 Jan 2026 14:09:22 +0000</pubDate>
      <guid isPermaLink="false">LPWXTiQTGjvGpw54r4NvA5</guid>
      <description>MSI&#8217;s 16-inch Vector HX AI laptop comes with an Intel Core Ultra 9 processor, 16GB RAM, and a 1TB SSD, and is $500 off at Newegg right now.</description>
    </item>
    <item>
      <title>'We believe our actions have seriously impacted one of the largest residential proxy providers': Google takes the fight to IPIDEA and removes millions of devices from criminal network</title>
      <link>https://www.techradar.com/pro/security/we-believe-our-actions-have-seriously-impacted-one-of-the-largest-residential-proxy-providers-google-takes-the-fight-to-ipidea-and-removes-millions-of-devices-from-criminal-network</link>
      <pubDate>Thu, 29 Jan 2026 14:05:00 +0000</pubDate>
      <guid isPermaLink="false">j3SiFvGTy4BgX35gYNWaDH</guid>
      <description>One of the largest residential proxy services takes a hit after Google gets involved.</description>
    </item>
    <item>
      <title>Trump&#8217;s deployments of the National Guard are costing American taxpayers nearly $500 million so far</title>
      <link>https://www.fastcompany.com/91483288/trumps-deployments-national-guard-costing-american-taxpayers-nearly-500-million-so-far</link>
      <pubDate>2026-01-29T14:04:34</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91483288/trumps-deployments-national-guard-costing-american-taxpayers-nearly-500-million-so-far</guid>
      <description>A CBO report revealed that the costs could surpass $1 billion for the rest of 2026.
The Trump administration&#8217;s high-profile deployment of federal troops to six U.S. cities has cost taxpayers roughly $496 million through the end of December, and continued deployment could cost over $1 billion for the rest of the year, according to new data from the nonpartisan Congressional Budget Office.President Donald Trump has justified sending National Guard troops into U.S. cities as part of an effort to combat crime and support local law enforcement. Critics of the move argue the deployments undermine st...</description>
    </item>
    <item>
      <title>Leica finally made a 35mm Noctilux &#8212; and it's a dreamy compact M-series lens for street photographers, with a shocking price tag</title>
      <link>https://www.techradar.com/cameras/camera-lenses/leica-finally-made-a-35mm-noctilux-its-a-dreamy-compact-m-series-lens-for-street-photographers-with-a-shocking-price-tag</link>
      <pubDate>Thu, 29 Jan 2026 14:02:02 +0000</pubDate>
      <guid isPermaLink="false">yN9qjwYFhtS9rZuMuPnNAE</guid>
      <description>Pushing the limits of luxury, the highly anticipated Leica Noctilux-M 35mm f/1.2 ASPH costs $9,650 / &#163;7,700.</description>
    </item>
    <item>
      <title>Jason Momoa Teases His &#8216;Pretty Gnarly&#8217; Lobo</title>
      <link>https://gizmodo.com/jason-momoa-lobo-supergirl-dcu-2000715144</link>
      <pubDate>Thu, 29 Jan 2026 14:00:57 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715144</guid>
      <description>Plus, why we didn't get a second season of 'Hawkeye'.</description>
    </item>
    <item>
      <title>The Stream Deck-packed gaming keyboard is a monster of good ideas</title>
      <link>https://www.theverge.com/tech/869542/corsair-galleon-stream-deck-gaming-keyboard-review</link>
      <pubDate>2026-01-29T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=869542</guid>
      <description>The Corsair Galleon 100 SD didn't just come out of the ether. The new full-size mechanical keyboard with a Stream Deck fused to its side is the result of a lot of things coming together over the years. Corsair's gaming business is more refined than ever, and Stream Deck's wide ecosystem of plug-ins makes the [&#8230;]</description>
    </item>
    <item>
      <title>3 best Prime Video thriller miniseries to binge-watch in one weekend</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/3-best-prime-video-thriller-miniseries-to-binge-watch-in-one-weekend</link>
      <pubDate>Thu, 29 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">rqds52nYqAFrrLeyYTBng6</guid>
      <description>With The Night Manager season 2 drawing to a close, here are the next Prime Video thrillers that'll have you gripped.</description>
    </item>
    <item>
      <title>Cairn's complete dedication to its arduous climb may turn off many, but I found it to be a fulfilling, gratifying, and thoughtful adventure</title>
      <link>https://www.techradar.com/gaming/cairn-review</link>
      <pubDate>Thu, 29 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">F7z9j9EAXXRujCtLhT7fQA</guid>
      <description>With its complete dedication to replicating the mechanics, drive, and satisfaction of climbing, The Game Bakers have cooked up a tough but hugely rewarding adventure game that means I can easily look past its few annoyances.</description>
    </item>
    <item>
      <title>Bluffant, j&#8217;ai jou&#233; &#224; Fortnite, Forza, Doom et Alan Wake 2 en 4K Full Ray Tracing sur une machine o&#249; &#231;a devrait &#234;tre impossible</title>
      <link>https://www.frandroid.com/marques/nvidia/2959505_bluffant-jai-joue-a-fornite-forza-doom-et-alan-wake-2-en-4k-full-ray-tracing-sur-une-machine-ou-ca-devrait-etre-impossible</link>
      <pubDate>Thu, 29 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2959505_bluffant-jai-joue-a-fornite-forza-doom-et-alan-wake-2-en-4k-full-ray-tracing-sur-une-machine-ou-ca-devrait-etre-impossible</guid>
      <description>
J'ai pu tester GeForce Now sur GNU/Linux pendant plusieurs jours. La prouesse technique est bien l&#224;, m&#234;me si quelques couacs de jeunesse sont encore pr&#233;sents.
</description>
    </item>
    <item>
      <title>Leica Noctilux-M 35 mm f/1.2 : l&#8217;objectif de l&#233;gende s&#8217;attaque enfin &#224; la photo de rue</title>
      <link>https://www.frandroid.com/marques/leica/2954943_leica-noctilux-m-35-mm-f-1-2-lobjectif-de-legende-sattaque-enfin-a-la-photo-de-rue</link>
      <pubDate>Thu, 29 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/leica/2954943_leica-noctilux-m-35-mm-f-1-2-lobjectif-de-legende-sattaque-enfin-a-la-photo-de-rue</guid>
      <description>
Leica a pr&#233;sent&#233;, ce jeudi, un nouvel objectif particuli&#232;rement lumineux pour ses bo&#238;tiers en monture M, le Leica Noctilux M 35 f/1.2 ASPH. 
</description>
    </item>
    <item>
      <title>Le calendrier se resserre : la Nasa acc&#233;l&#232;re le d&#233;part de Sophie Adenot vers la Station spatiale</title>
      <link>https://www.futura-sciences.com/sciences/actualites/sophie-adenot-calendrier-resserre-nasa-accelere-depart-sophie-adenot-vers-station-spatiale-130710/#xtor%3DRSS-8</link>
      <pubDate>Thu, 29 Jan 2026 14:57:00 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/sophie-adenot-calendrier-resserre-nasa-accelere-depart-sophie-adenot-vers-station-spatiale-130710/#xtor%3DRSS-8</guid>
      <description>Finalement, la mission Crew-12 de SpaceX pourrait d&#233;coller plus t&#244;t que pr&#233;vu. Son calendrier croise d&#233;sormais celui d&#8217;Artemis II, la prochaine grande mission lunaire habit&#233;e de la Nasa. Un rare moment o&#249; deux vols habit&#233;s majeurs pourraient se succ&#233;der &#224; quelques jours d&#8217;intervalle depuis la...</description>
    </item>
    <item>
      <title>Apple says Patreon creators must switch to subscription billing by November</title>
      <link>https://www.theverge.com/tech/870022/patreon-creator-apple-ios-subscription-billing-november-2026</link>
      <pubDate>2026-01-29T08:55:34-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=870022</guid>
      <description>Patreon will force creators to move away from legacy billing methods this fall to appease Apple's newly revived subscriptions mandate. The migration will impact 4 percent of Patreon creators who still use first-of-the-month and per creation billing models, with Apple imposing a deadline to switch to subscription billing by November 1st, 2026. On its support [&#8230;]...</description>
    </item>
    <item>
      <title>&#171;&#160;D&#233;s&#233;quilibre extr&#234;me&#160;&#187; : la p&#233;nurie de m&#233;moire pourrait durer jusqu&#8217;en 2027</title>
      <link>https://www.01net.com/actualites/desequilibre-extreme-la-penurie-de-memoire-pourrait-durer-jusquen-2027.html</link>
      <pubDate>Thu, 29 Jan 2026 13:41:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323279</guid>
      <description>Les deux principaux fabricants de m&#233;moire ont une mauvaise nouvelle : les difficult&#233;s d'approvisionnement vont se poursuivre jusqu'en 2027. Samsung et SK Hynix partagent le m&#234;me constat, et ce n'est pas de bon augure pour les prix des produits &#233;lectroniques.</description>
    </item>
    <item>
      <title>DJI RS 5 : un stabilisateur encore plus intelligent pour stabiliser ses vid&#233;os comme les pros</title>
      <link>https://www.frandroid.com/marques/dji/2960195_dji-rs-5-un-stabilisateur-encore-plus-intelligent-pour-stabiliser-ses-videos-comme-les-pros</link>
      <pubDate>Thu, 29 Jan 2026 13:41:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dji/2960195_dji-rs-5-un-stabilisateur-encore-plus-intelligent-pour-stabiliser-ses-videos-comme-les-pros</guid>
      <description>
DJI a enrichi sa gamme de stabilisateurs gimbals pour appareils photo avec l'annonce, ce jeudi, du DJI RS 5. 
</description>
    </item>
    <item>
      <title>Meta stock price surges as Mark Zuckerberg predicts most glasses will be AI-powered in &#8216;several years&#8217;</title>
      <link>https://www.fastcompany.com/91483290/meta-stock-price-surges-mark-zuckerberg-ai-glasses-smartphone-moment</link>
      <pubDate>2026-01-29T13:41:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91483290/meta-stock-price-surges-mark-zuckerberg-ai-glasses-smartphone-moment</guid>
      <description>After the Facebook parent handily beat expectations for Q4 earnings, its CEO laid out a future increasingly ruled by AI, personalization, and immersive tech.
Shares of Facebook owner Meta Platforms (Nasdaq: META) are surging in premarket trading this morning after the company announced its fourth-quarter 2025 earnings yesterday afternoon. </description>
    </item>
  </channel>
</rss>
