<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 05 Nov 2025 08:59:20 GMT</lastBuildDate>
    <item>
      <title>Des drones s&#232;ment le chaos dans les a&#233;roports de Belgique</title>
      <link>https://www.01net.com/actualites/drones-sement-chaos-aeroports-belgique.html</link>
      <pubDate>Wed, 05 Nov 2025 08:58:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305260</guid>
      <description>Trois a&#233;roports belges ont &#233;t&#233; oblig&#233;s de fermer leurs portes. Des drones non identifi&#233;s ont &#233;t&#233; rep&#233;r&#233;s &#224; proximit&#233; des pistes et des tours de contr&#244;le. Le trafic a&#233;rien a d&#251; &#234;tre suspendu &#224; plusieurs reprises, provoquant des dizaines d&#8217;annulations et de d&#233;viations de vols. Les autorit&#233;s belges redoutent une op&#233;ration coordonn&#233;e d&#8217;espionnage, vraisemblablement orchestr&#233;e par la Russie....</description>
    </item>
    <item>
      <title>Le pr&#233;-Black Friday retire d&#233;j&#224; 35 % au r&#233;cent smartphone pas cher de Samsung, le Galaxy A17 5G</title>
      <link>https://www.frandroid.com/bons-plans/2854867_le-pre-black-friday-retire-deja-35-au-recent-smartphone-pas-cher-de-samsung-le-galaxy-a17-5g</link>
      <pubDate>Wed, 05 Nov 2025 08:49:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2854867_le-pre-black-friday-retire-deja-35-au-recent-smartphone-pas-cher-de-samsung-le-galaxy-a17-5g</guid>
      <description>
Un &#233;cran OLED, de la 5G et un suivi logiciel longue dur&#233;e : le Galaxy A17 5G est un excellent mod&#232;le d&#8217;entr&#233;e de gamme. Pour l&#8217;avant Black Friday, il passe &#224; 149 euros au lieu de 229 euros sur Red By SFR apr&#232;s une offre de remboursement.
</description>
    </item>
    <item>
      <title>Black Friday 2025 : les offres sont nombreuses chez Amazon &amp; Co, voici les meilleurs deals en avant-premi&#232;re</title>
      <link>https://www.frandroid.com/bons-plans/2849105_black-friday-2025-la-braderie-continue-chez-amazon-co-voici-les-meilleures-offres-en-avant-premiere</link>
      <pubDate>Wed, 05 Nov 2025 08:42:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849105_black-friday-2025-la-braderie-continue-chez-amazon-co-voici-les-meilleures-offres-en-avant-premiere</guid>
      <description>
&#192; peine novembre entam&#233; que le Black Friday pointe d&#233;j&#224; le bout de son nez chez certains e-commer&#231;ants fran&#231;ais. On vous a donc pr&#233;par&#233; une s&#233;lection des meilleures offres du moment, mise &#224; jour en temps r&#233;el, pour vous aider &#224; d&#233;nicher les bons plans tech sans prise de t&#234;te.
</description>
    </item>
    <item>
      <title>Valve va r&#233;soudre une des plus grosses limitations du Steam Deck</title>
      <link>https://www.frandroid.com/marques/2855431_valve-va-resoudre-une-des-plus-grosses-limitations-du-steam-deck</link>
      <pubDate>Wed, 05 Nov 2025 08:41:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2855431_valve-va-resoudre-une-des-plus-grosses-limitations-du-steam-deck</guid>
      <description>
Valve annonce la mise en place d'une nouvelle fonctionnalit&#233; tr&#232;s pratique pour le Steam Deck. La console de Valve pourra t&#233;l&#233;charger des jeux et des mises &#224; jour avec un &#233;cran &#233;teint. 
</description>
    </item>
    <item>
      <title>Notre guide d&#8217;achat des meilleurs smartphones &#224; grand &#233;cran en 2025</title>
      <link>https://www.frandroid.com/guide-dachat/382644_6-alternatives-samsung-galaxy-note-7</link>
      <pubDate>Wed, 05 Nov 2025 08:35:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/382644_6-alternatives-samsung-galaxy-note-7</guid>
      <description>
D'ann&#233;e en ann&#233;e, les smartphones ne cessent de grandir. Vous &#234;tes adeptes des grands &#233;crans ? Que ce soit pour jouer, regarder des vid&#233;os ou juste pour un plus grand confort, nous avons s&#233;lectionn&#233; pour vous les meilleurs t&#233;l&#233;phones avec un grand &#233;cran -- au minimum 6,7 pouces.
</description>
    </item>
    <item>
      <title>3 heures d&#8217;&#233;lectricit&#233; gratuite par jour : &#171;&#160;une politique mal pens&#233;e, &#233;labor&#233;e &#224; la va-vite&#160;&#187;</title>
      <link>https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2855479_3-heures-delectricite-gratuite-par-jour-une-politique-mal-pensee-elaboree-a-la-va-vite</link>
      <pubDate>Wed, 05 Nov 2025 08:34:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2855479_3-heures-delectricite-gratuite-par-jour-une-politique-mal-pensee-elaboree-a-la-va-vite</guid>
      <description>
Alors que son mix &#233;lectrique est encore domin&#233; par le charbon, l&#8217;Australie anticipe un trop-plein d&#8217;&#233;nergie solaire en 2026. Pour y faire face, le pays a d&#233;cid&#233; d&#8217;imposer &#224; ses &#233;nerg&#233;ticiens de fournir chaque jour d&#8217;&#233;lectricit&#233; gratuite &#224; des millions d&#8217;habitants.
</description>
    </item>
    <item>
      <title>Google Maps devient encore plus pratique sur cette voiture avec une petite nouveaut&#233;</title>
      <link>https://www.frandroid.com/marques/polestar/2855475_google-maps-devient-encore-plus-pratique-sur-cette-voiture-avec-une-petite-nouveaute</link>
      <pubDate>Wed, 05 Nov 2025 08:26:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/polestar/2855475_google-maps-devient-encore-plus-pratique-sur-cette-voiture-avec-une-petite-nouveaute</guid>
      <description>
Polestar vient d'int&#233;grer une fonction tr&#232;s utile &#224; une de ses voitures &#233;lectriques : Google Maps affiche d&#233;sormais les voies d'autoroute &#224; prendre, directement sur l'&#233;cran conducteur de la Polestar 4.
</description>
    </item>
    <item>
      <title>I&#8217;m a big fan of the new Dyson Hot+Cool HF1 &#8211; but there are a couple of drawbacks you should consider before buying</title>
      <link>https://www.techradar.com/home/air-quality/dyson-hot-and-cool-hf1-review</link>
      <pubDate>Wed, 05 Nov 2025 08:16:17 +0000</pubDate>
      <guid isPermaLink="false">YnWRZbHYi3o5LYtXbFYn8M</guid>
      <description>The new Dyson Hot+Cool HF1 has fantastic smart features, but a couple of drawbacks may mean it&#8217;s not for you.</description>
    </item>
    <item>
      <title>Faille critique des puces Zen 5&#160;: AMD annonce un correctif</title>
      <link>https://www.01net.com/actualites/faille-critique-puces-zen-5-amd-promet-correctif.html</link>
      <pubDate>Wed, 05 Nov 2025 08:11:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305246</guid>
      <description>Un bug inqui&#233;tant dans les processeurs AMD Zen 5 a &#233;t&#233; d&#233;couvert. L&#8217;instruction RDSEED, utilis&#233;e dans le chiffrement, produit parfois des valeurs incorrectes, compromettant la s&#233;curit&#233; des syst&#232;mes. AMD a confirm&#233; le probl&#232;me et d&#233;ploie d&#233;j&#224; un correctif.</description>
    </item>
    <item>
      <title>L&#8217;excellent Honor Magic 7 Pro propuls&#233; par un Snapdragon 8 Elite perd 500 &#8364; de son prix pendant le pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2854827_lexcellent-honor-magic-7-pro-propulse-par-un-snapdragon-8-elite-perd-500-e-de-son-prix-pendant-le-pre-black-friday</link>
      <pubDate>Wed, 05 Nov 2025 08:08:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2854827_lexcellent-honor-magic-7-pro-propulse-par-un-snapdragon-8-elite-perd-500-e-de-son-prix-pendant-le-pre-black-friday</guid>
      <description>
Lanc&#233; cette ann&#233;e, le Honor Magic 7 Pro a de s&#233;rieux atouts, le premier &#233;tant &#233;videmment sa puce ultra-puissante &#224; laquelle rien ne r&#233;siste. &#192; l'approche du Black Friday, Honor et Boulanger proposent ce smartphone &#224; 799,90 euros au lieu de 1 299 euros. 
</description>
    </item>
    <item>
      <title>On a pris en main le Motorola Edge 70&#160;: enfin un smartphone ultrafin &#224; un prix correct</title>
      <link>https://www.01net.com/actualites/prise-en-main-du-edge-70-que-vaut-liphone-air-de-motorola.html</link>
      <pubDate>Wed, 05 Nov 2025 08:00:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305145</guid>
      <description>Motorola entend bien ne plus laisser &#224; Apple et Samsung le monopole du smartphone ultrafin. Avec le Edge&#8239;70, la marque am&#233;ricaine s&#8217;invite sur le terrain du design tout en finesse et l&#233;g&#232;ret&#233;. L'ambition est claire&#8239;: proposer une alternative haut de gamme, mais accessible. Un positionnement strat&#233;gique, soutenu par un partenariat muscl&#233; avec Orange et une fiche technique qui n&#8217;a pas &#224; rougir face aux t&#233;nors du march&#233;. Nous l'avons pris en main....</description>
    </item>
    <item>
      <title>Motorola&#8217;s Edge 70 is the blueprint for future thin phones</title>
      <link>https://www.theverge.com/gadgets/813377/motorola-edge-70-review</link>
      <pubDate>2025-11-05T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=813377</guid>
      <description>I've been as much of a thin phone skeptic as anyone. Why would I give up on camera specs and battery life just to shave a couple of millimeters off a phone's waistline? I asked pretty much exactly that when I first saw Samsung's Galaxy S25 Edge earlier this year. But the Motorola Edge 70 [&#8230;]</description>
    </item>
    <item>
      <title>Bang &amp; Olufsen's new elite Dolby Atmos soundbar looks like it's come from the future, and is priced like it too</title>
      <link>https://www.techradar.com/televisions/soundbars/bang-and-olufsens-new-elite-dolby-atmos-soundbar-looks-like-its-come-from-the-future-and-is-priced-like-it-too</link>
      <pubDate>Wed, 05 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">hAxrh8PhTuXjSw9J3zWqQm</guid>
      <description>The Beosound Premiere looks a million dollars, and costs slightly less</description>
    </item>
    <item>
      <title>Motorola&#8217;s iPhone Air rival brings a bigger battery, faster charging, and a much better price to the ultra-thin table</title>
      <link>https://www.techradar.com/phones/motorola-phones/motorolas-iphone-air-rival-brings-a-bigger-battery-faster-charging-and-a-much-better-price-to-the-super-slim-table</link>
      <pubDate>Wed, 05 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">j8wxtXPQfyszugEpJHgm5P</guid>
      <description>Motorola has released its super-slim Edge 70 smartphone, and I can't believe how affordable it is.</description>
    </item>
    <item>
      <title>Il pense battre Apple et Samsung &#224; leur propre jeu : voici le Motorola Edge 70, on l&#8217;a pris en main</title>
      <link>https://www.frandroid.com/marques/motorola/2853417_il-pense-battre-apple-et-samsung-a-leur-propre-jeu-voici-le-motorola-edge-70-on-la-pris-en-main</link>
      <pubDate>Wed, 05 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/motorola/2853417_il-pense-battre-apple-et-samsung-a-leur-propre-jeu-voici-le-motorola-edge-70-on-la-pris-en-main</guid>
      <description>
Le Motorola Edge 70 vient d'&#234;tre officialis&#233; en exclusivit&#233; chez Orange et nous avons d&#233;j&#224; pris en main ce nouveau smartphone ultra fin. Est-il capable de faire trembler Apple et Samsung ?
</description>
    </item>
    <item>
      <title>Windows 11&#160;: Microsoft confirme par inadvertance l&#8217;existence de la mise &#224; jour 26H1</title>
      <link>https://www.01net.com/actualites/windows-11-microsoft-confirme-par-inadvertance-lexistence-de-la-mise-a-jour-26h1.html</link>
      <pubDate>Wed, 05 Nov 2025 07:41:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305256</guid>
      <description>La rumeur d&#8217;une prochaine mise &#224; jour de Windows 11 en version 26H1, exclusive &#224; certaines machines, est &#224; pr&#233;sent confirm&#233;e.</description>
    </item>
    <item>
      <title>TikTok dans le viseur de la justice fran&#231;aise pour &#171;&#8201;promotion du suicide&#8201;&#187;</title>
      <link>https://www.frandroid.com/culture-tech/juridique/2855463_tiktok-dans-le-viseur-de-la-justice-francaise-pour-promotion-du-suicide</link>
      <pubDate>Wed, 05 Nov 2025 07:39:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/juridique/2855463_tiktok-dans-le-viseur-de-la-justice-francaise-pour-promotion-du-suicide</guid>
      <description>
Depuis son arriv&#233;e sur le territoire fran&#231;ais il y a quelques ann&#233;es, TikTok concentre toutes les pol&#233;miques. La plus r&#233;cente est sans doute l&#8217;une des plus graves avec puisqu&#8217;elle affirme que la plateforme pousserait certains jeunes au suicide.
</description>
    </item>
    <item>
      <title>Philips 65OLED959 : le TV Ambilight des gamers et des cin&#233;philes est &#224; moiti&#233; prix pendant le pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2854359_philips-65oled959-le-tv-ambilight-des-gamers-et-des-cinephiles-est-a-moitie-prix-pendant-le-pre-black-friday</link>
      <pubDate>Wed, 05 Nov 2025 07:36:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2854359_philips-65oled959-le-tv-ambilight-des-gamers-et-des-cinephiles-est-a-moitie-prix-pendant-le-pre-black-friday</guid>
      <description>
Lanc&#233; l'an dernier, le TV Philips 65OLED959 a de s&#233;rieux atouts : dalle OLED plus lumineuse, technologie Ambilight bien immersive, syst&#232;me audio 3D complet... Son autre avantage, c'est son prix qui passe de 3 990 euros &#224; 1 990 euros chez Son-Vid&#233;o, &#224; l'approche du Black Friday. 
</description>
    </item>
    <item>
      <title>Projet Suncatcher&#160;: Google pr&#233;pare des centres de donn&#233;es&#8230; sur orbite</title>
      <link>https://www.01net.com/actualites/projet-suncatcher-google-prepare-des-centres-de-donnees-sur-orbite.html</link>
      <pubDate>Wed, 05 Nov 2025 07:30:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305214</guid>
      <description>Face &#224; l'app&#233;tit insatiable d&#8217;&#233;nergie de l&#8217;intelligence artificielle, Google r&#234;ve de data centers&#8230; en orbite. Avec son projet Suncatcher, le g&#233;ant du web veut envoyer ses puces Tensor dans l&#8217;espace pour les alimenter en continu gr&#226;ce au soleil. Un pari solaire, et un brin lunaire.</description>
    </item>
    <item>
      <title>La Fiat 500 &#233;lectrique devient moins ch&#232;re qu&#8217;une Dacia Spring avec cette immense promotion</title>
      <link>https://www.frandroid.com/marques/fiat/2855411_la-fiat-500-electrique-devient-moins-chere-quune-dacia-spring-avec-cette-immense-promotion</link>
      <pubDate>Wed, 05 Nov 2025 07:29:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/fiat/2855411_la-fiat-500-electrique-devient-moins-chere-quune-dacia-spring-avec-cette-immense-promotion</guid>
      <description>
Face &#224; des ventes toujours largement insuffisantes, Fiat applique d'immenses promotions sur deux de ses mod&#232;les. La Fiat 500e devient la voiture &#233;lectrique la moins ch&#232;re du march&#233;, tandis que la 600e devient bien plus attrayante.
</description>
    </item>
    <item>
      <title>Cette nouvelle fonction des AirPods d&#233;barque enfin en France</title>
      <link>https://www.frandroid.com/marques/apple/2855455_cette-nouvelle-fonction-des-airpods-debarque-enfin-en-france</link>
      <pubDate>Wed, 05 Nov 2025 07:27:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2855455_cette-nouvelle-fonction-des-airpods-debarque-enfin-en-france</guid>
      <description>
Apple active la traduction temps r&#233;el sur AirPods en Europe&#8230; 3 mois apr&#232;s les USA. Raison ? Le DMA les force &#224; ouvrir leur techno aux concurrents.
</description>
    </item>
    <item>
      <title>Google Maps a trouv&#233; la solution pour ne plus rater les sorties d&#8217;autoroute</title>
      <link>https://www.01net.com/actualites/google-maps-trouve-solution-plus-rater-sorties-autoroute.html</link>
      <pubDate>Wed, 05 Nov 2025 07:09:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305236</guid>
      <description>Google Maps va bient&#244;t &#234;tre capable de &#171; voir &#187; la voie dans laquelle vous roulez pour vous guider plus pr&#233;cis&#233;ment. De quoi &#233;viter les sorties rat&#233;es sur l&#8217;autoroute.</description>
    </item>
    <item>
      <title>Le Galaxy S26 plus puissant qu&#8217;un MacBook Pro M5 ? Laissez-nous douter</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/processeurs/2855433_le-galaxy-s26-plus-puissant-quun-macbook-pro-m5-laissez-nous-douter</link>
      <pubDate>Wed, 05 Nov 2025 07:07:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/processeurs/2855433_le-galaxy-s26-plus-puissant-quun-macbook-pro-m5-laissez-nous-douter</guid>
      <description>
Le Galaxy S26 avec Exynos 2600 afficherait des performances monoc&#339;ur sup&#233;rieures au MacBook Pro M5.
</description>
    </item>
    <item>
      <title>&#171;&#160;Fraude informatique&#160;&#187; : l&#8217;agent IA trop malin de Perplexity qui f&#226;che Amazon</title>
      <link>https://www.01net.com/actualites/fraude-informatique-lagent-ia-trop-malin-de-perplexity-qui-fache-amazon.html</link>
      <pubDate>Wed, 05 Nov 2025 07:01:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305212</guid>
      <description>Il y a (encore) de l'eau dans le gaz entre Perplexity et Amazon. Dans l'&#339;il du cyclone, le navigateur Comet qui peut effectuer des achats dans la boutique du g&#233;ant du e-commerce. Mais voil&#224;, cet agent IA agirait sans se d&#233;clarer comme tel, enfreignant les conditions d'utilisation du site&#8230; Pour Amazon, cela repr&#233;sente m&#234;me une &#171; fraude informatique &#187;....</description>
    </item>
    <item>
      <title>Le top 3 des meilleures montres connect&#233;es ce mois-ci</title>
      <link>https://www.frandroid.com/guide-dachat/2853519_le-top-3-des-meilleures-montres-connectees-ce-mois-ci</link>
      <pubDate>Wed, 05 Nov 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2853519_le-top-3-des-meilleures-montres-connectees-ce-mois-ci</guid>
      <description>
Dans la constellation des montres connect&#233;es, certaines parviennent &#224; attirer notre attention. Voici les mod&#232;les que nous avons pr&#233;f&#233;r&#233; lors de nos tests r&#233;cents.
</description>
    </item>
  </channel>
</rss>
