<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 02 Feb 2026 15:40:48 GMT</lastBuildDate>
    <item>
      <title>Windows 11 : la grosse mise &#224; jour de f&#233;vrier est imminente, voici les principaux changements</title>
      <link>https://www.frandroid.com/marques/microsoft/2963055_windows-11-la-grosse-mise-a-jour-de-fevrier-est-imminente-voici-les-principaux-changements</link>
      <pubDate>Mon, 02 Feb 2026 15:37:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2963055_windows-11-la-grosse-mise-a-jour-de-fevrier-est-imminente-voici-les-principaux-changements</guid>
      <description>
Microsoft a pr&#233;vu une nouvelle mise &#224; jour remplie de nouvelles fonctionnalit&#233;s et correctifs en f&#233;vrier. On vous d&#233;taille les principales nouveaut&#233;s de ce prochain Patch Tuesday.
</description>
    </item>
    <item>
      <title>Ring brings its &#8216;Search Party&#8217; feature for finding lost dogs to non-Ring camera owners</title>
      <link>https://techcrunch.com/2026/02/02/ring-brings-its-search-party-feature-for-finding-lost-dogs-to-non-ring-camera-owners/</link>
      <pubDate>Mon, 02 Feb 2026 15:33:45 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3088706</guid>
      <description>Ring's Search Party feature for finding lost dogs is now available across the U.S. &#8212; even if you don't own a Ring camera.</description>
    </item>
    <item>
      <title>Les 10 smartphones les plus populaires de la semaine sur Frandroid : Xiaomi surpasse Samsung</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2491986_les-10-smartphones-les-plus-populaires-de-la-semaine-sur-frandroid-xiaomi-surpasse-samsung</link>
      <pubDate>Mon, 02 Feb 2026 15:32:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2491986_les-10-smartphones-les-plus-populaires-de-la-semaine-sur-frandroid-xiaomi-surpasse-samsung</guid>
      <description>
Pour notre top 10 des smartphones les plus populaires de la semaine sur Frandroid, Xiaomi r&#233;ussit pour l'une des premi&#232;res fois de cet exercice a supplanter la toute puissance de Samsung. 
</description>
    </item>
    <item>
      <title>Bient&#244;t adieu Visa et Mastercard : la solution europ&#233;enne de paiement arrive</title>
      <link>https://www.frandroid.com/services/banque-en-ligne/2963399_bientot-adieu-visa-et-mastercard-la-solution-europeenne-de-paiement-arrive</link>
      <pubDate>Mon, 02 Feb 2026 15:23:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/banque-en-ligne/2963399_bientot-adieu-visa-et-mastercard-la-solution-europeenne-de-paiement-arrive</guid>
      <description>
L'EPI et Alliance EuroPA signent un accord majeur pour l'avenir du paiement en Europe. Une alternative &#224; Visa et Mastercard qui sert d&#233;j&#224; 130 millions d'utilisateurs.
</description>
    </item>
    <item>
      <title>Five AI agent predictions for 2026: The year enterprises stop waiting and start winning</title>
      <link>https://www.techradar.com/pro/five-ai-agent-predictions-for-2026-the-year-enterprises-stop-waiting-and-start-winning</link>
      <pubDate>Mon, 02 Feb 2026 15:22:30 +0000</pubDate>
      <guid isPermaLink="false">YafTJRyaoafPhKfd8Ug3Ti</guid>
      <description>2026 is the year of operationalizing AI. Here are five predictions for how AI agents will reshape business in 2026.</description>
    </item>
    <item>
      <title>MongoDB instances are being hit in data extortion attacks, so make sure you're protected</title>
      <link>https://www.techradar.com/pro/security/mongodb-instances-are-being-hit-in-data-extortion-attacks-so-make-sure-youre-protected</link>
      <pubDate>Mon, 02 Feb 2026 15:20:00 +0000</pubDate>
      <guid isPermaLink="false">NjBJDBRJ5Ypr7U5CB8ip79</guid>
      <description>Hackers are hunting for vulnerable MongoDB servers and there are reportedly many to choose from.</description>
    </item>
    <item>
      <title>The Apple Watch Series 11 is back on sale for $299</title>
      <link>https://www.engadget.com/deals/the-apple-watch-series-11-is-back-on-sale-for-299-151616498.html?src=rss</link>
      <pubDate>Mon, 02 Feb 2026 15:16:17 +0000</pubDate>
      <guid isPermaLink="false">78902e66-331a-45a8-8c59-e293650f49bb</guid>
      <description>Whether you're one of the few people still keeping up with New Year's resolutions or just want an upgraded smartwatch, now is a good time to get an Apple Watch. Currently, the Apple Watch Series 11 is on sale for $299, down from $399. The 25 percent discount brings the 2025 model back down to its record-low price.
We named the Apple Watch Series 11 as our choice for best smartwatch overall. It scored a 90 in our review thanks to its 24 hours-plus of battery life and a thin, light design that's easy to wear. It also offers new health metrics, including Apple's hypertension alerts system and Sle...</description>
    </item>
    <item>
      <title>The Epstein files</title>
      <link>https://www.theverge.com/policy/872092/jeffrey-epstein-files-doj-trump-musk-brin-gates</link>
      <pubDate>2026-02-02T10:09:30-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?post_type=vm_stream&amp;p=872092</guid>
      <description>The Department of Justice has released more of its records on self-described &#8220;science philanthropist&#8221; and convicted sex offender Jeffrey Epstein. Other than Epstein, they&#8217;ve also brought an intense focus on the many powerful people who associated and corresponded with him, including Bill Gates, Elon Musk, Google co-founder Sergey Brin, and President Donald Trump. There&#8217;s also [&#8230;]...</description>
    </item>
    <item>
      <title>The future of agentic commerce: The role identity plays in hybrid experiences</title>
      <link>https://www.techradar.com/pro/the-future-of-agentic-commerce-the-role-identity-plays-in-hybrid-experiences</link>
      <pubDate>Mon, 02 Feb 2026 15:07:24 +0000</pubDate>
      <guid isPermaLink="false">te8rH2DcoUFFwGZuNNuazQ</guid>
      <description>Why seamless, secure identity defines the future of commerce.</description>
    </item>
    <item>
      <title>Galaxy Watch Ultra 2 : Samsung confirme ses plans pour sa montre la plus massive de 2026</title>
      <link>https://www.frandroid.com/marques/samsung/2963383_galaxy-watch-ultra-2-samsung-confirme-ses-plans-pour-sa-montre-la-plus-massive-de-2026</link>
      <pubDate>Mon, 02 Feb 2026 15:05:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2963383_galaxy-watch-ultra-2-samsung-confirme-ses-plans-pour-sa-montre-la-plus-massive-de-2026</guid>
      <description>
Alors que Samsung ne devrait pas pr&#233;senter ses prochaines montres avant l'&#233;t&#233; prochain, les Galaxy Watch 9 et Galaxy Watch Ultra 2 ont d&#233;j&#224; &#233;t&#233; certifi&#233;es par la GSMA.
</description>
    </item>
    <item>
      <title>Newegg just gave us an exclusive discount - here are 6 gaming laptops I'd recommend with Black Friday-level prices</title>
      <link>https://www.techradar.com/computing/gaming-laptops/newegg-just-gave-us-an-exclusive-discount-here-are-6-gaming-laptops-id-recommend-with-black-friday-level-prices</link>
      <pubDate>Mon, 02 Feb 2026 15:05:09 +0000</pubDate>
      <guid isPermaLink="false">mUhCGompZA87X7bGFaxg24</guid>
      <description>Looking for a new gaming laptop? Newegg has just provided TechRadar readers a handy exclusive code to discount its RTX 5000 series machines even further this week.</description>
    </item>
    <item>
      <title>Stranger Things: Tales From &#8216;85 hits Netflix on April 23</title>
      <link>https://www.engadget.com/entertainment/tv-movies/stranger-things-tales-from-85-hits-netflix-on-april-23-150436136.html?src=rss</link>
      <pubDate>Mon, 02 Feb 2026 15:04:36 +0000</pubDate>
      <guid isPermaLink="false">53d2eb51-bdc0-4e5b-bea0-1f2662da6fc8</guid>
      <description>While the main series might be over, Netflix is far from done with Stranger Things. The first spin-off to hit the streaming service will be Stranger Things: Tales From &#8216;85. The company had said that the animated show would arrive sometime this year and now, alongside a new trailer, it confirmed a release date of April 23.&#160;The trailer is a bit of an odd watch given that Stranger Things wrapped up only a month ago. Going from that to this animated style with a whole new voice cast is jarring, but a fun gag at the end of the clip taps into certain misconceptions the audience might have.Stranger T...</description>
    </item>
    <item>
      <title>Fin de l&#8217;IPTV sur Fire TV, Amazon bloque l&#8217;installation des APK</title>
      <link>https://www.frandroid.com/actualites-generales/2963135_fin-de-liptv-sur-fire-tv-amazon-bloque-linstallation-des-apk</link>
      <pubDate>Mon, 02 Feb 2026 15:01:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2963135_fin-de-liptv-sur-fire-tv-amazon-bloque-linstallation-des-apk</guid>
      <description>
Amazon sonne la fin de la r&#233;cr&#233;ation pour les utilisateurs bidouilleurs de ses cl&#233;s de streaming. Une mise &#224; jour logicielle bloque d&#233;sormais l'installation de certains fichiers APK, rendant le sideloading bien plus complexe sur les Fire TV.
</description>
    </item>
    <item>
      <title>&#8216;Scream 7&#8217; Calls in Early With Its New Super Bowl Trailer</title>
      <link>https://gizmodo.com/scream-7-super-bowl-trailer-2000716630</link>
      <pubDate>Mon, 02 Feb 2026 15:00:14 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000716630</guid>
      <description>Ghostface is back and promising to make Sidney and her loved ones suffer again in the latest look at 'Scream 7'.</description>
    </item>
    <item>
      <title>Docusign&amp;#8217;s CEO on the dangers of trusting AI to read, and write, your contracts</title>
      <link>https://www.theverge.com/podcast/871205/docusign-ceo-allan-thygesen-ai-contracts-e-signature-interview</link>
      <pubDate>2026-02-02T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=871205</guid>
      <description>Today, I&#8217;m talking with Allan Thygesen, who is the CEO of Docusign. You know Docusign; it&#8217;s the platform where you sign things online. It turns out 7,000 people work there, which is one of those facts you see flying around sometimes that&#8217;s always felt like perfect Decoder bait. What are all those people doing? And [&#8230;]</description>
    </item>
    <item>
      <title>Dragon Quest gets another great remake that&#8217;s perfect for newcomers</title>
      <link>https://www.theverge.com/games/871307/dragon-quest-7-reimagined-review-ps5-switch-xbox</link>
      <pubDate>2026-02-02T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=871307</guid>
      <description>When a video game series goes on for a long time, it raises a question for newcomers: Just where is the best place to jump in? In the case of Dragon Quest, there are nearly a dozen mainline titles, not to mention copious spinoffs and ports that span four decades of history. Of late, though, [&#8230;]</description>
    </item>
    <item>
      <title>Carbon Robotics built an AI model that detects and&#160;identifies&#160;plants</title>
      <link>https://techcrunch.com/2026/02/02/carbon-robotics-built-an-ai-model-that-detects-and-identifies-plants/</link>
      <pubDate>Mon, 02 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3088288</guid>
      <description>Carbon Robotics' Large Plant Model will allow farmers to kill new types of weeds without having to retrain the machines.</description>
    </item>
    <item>
      <title>Coalition demands federal Grok ban over nonconsensual sexual content</title>
      <link>https://techcrunch.com/2026/02/02/coalition-demands-federal-grok-ban-over-nonconsensual-sexual-content/</link>
      <pubDate>Mon, 02 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3088503</guid>
      <description>Nonprofits urge the U.S. government to suspend Grok in federal agencies after the xAI chatbot generated thousands of nonconsensual sexual images, raising national security and child safety concerns.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Tuesday, February 3 (game #1471)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-3-february-2026</link>
      <pubDate>Mon, 02 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">QyrLmN5tgAwz89b4xULhbT</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Tuesday, February 3 (game #968)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-3-february-2026</link>
      <pubDate>Mon, 02 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">KBSdc9qo9tErWS9A9JUayX</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Tuesday, February 3 (game #702)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-3-february-2026</link>
      <pubDate>Mon, 02 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">432pNPfLdtvhL35g4XgUpV</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Dragon Quest VII Reimagined is so good you can't tell it's a remake of a game from more than twenty years ago</title>
      <link>https://www.techradar.com/gaming/dragon-quest-vii-reimagined-review</link>
      <pubDate>Mon, 02 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">KKGwNRXywSSzsss9MKDTQG</guid>
      <description>Dragon Quest VII Reimagined would be a perfect first-ever RPG, but is just as enjoyable if it's your 50th.</description>
    </item>
    <item>
      <title>Honor Magic V5 : l&#8217;un des smartphones pliables les plus fins du monde est presque &#224; moiti&#233; prix</title>
      <link>https://www.frandroid.com/bons-plans/2963209_honor-magic-v5-lun-des-smartphones-pliables-les-plus-fins-du-monde-chute-sous-les-1-200-e</link>
      <pubDate>Mon, 02 Feb 2026 14:57:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2963209_honor-magic-v5-lun-des-smartphones-pliables-les-plus-fins-du-monde-chute-sous-les-1-200-e</guid>
      <description>
Lanc&#233; l'an dernier, le Honor Magic V5 est un smartphone pliable au format &#171; fold &#187; qui n'a quasiment rien &#224; envier au Samsung Galaxy Z Fold 7. Il est surtout moins cher que son grand rival : pendant les soldes d'hiver, on le trouve &#224; 1 189,99 euros au lieu de 1 999 euros chez Rakuten.
</description>
    </item>
    <item>
      <title>Windows 11&#160;: Microsoft a mis un temps fou pour corriger un bug de connexion tr&#232;s embarrassant</title>
      <link>https://www.01net.com/actualites/windows-11-microsoft-a-mis-un-temps-fou-pour-corriger-un-bug-de-connexion-tres-embarrassant.html</link>
      <pubDate>Mon, 02 Feb 2026 14:54:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323743</guid>
      <description>Le bug qui masquait le bouton pour saisir le mot de passe de connexion &#224; votre session Windows 11 est enfin r&#233;solu, six mois apr&#232;s sa d&#233;couverte.</description>
    </item>
    <item>
      <title>Apple revoit la fa&#231;on d&#8217;acheter un MacBook pour vous faire payer plus cher</title>
      <link>https://www.frandroid.com/marques/apple/2962989_apple-revoit-la-facon-dacheter-un-macbook-pour-vous-faire-payer-plus-cher</link>
      <pubDate>Mon, 02 Feb 2026 14:48:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2962989_apple-revoit-la-facon-dacheter-un-macbook-pour-vous-faire-payer-plus-cher</guid>
      <description>
Sur son Apple Store, Apple a discr&#232;tement modifi&#233; le parcours d'achat pour un nouveau Mac, le calquant sur celui d&#233;j&#224; en place pour l'iPhone ou l'iPad. Voyons ce que change cette nouvelle approche, tr&#232;s encadr&#233;e.
</description>
    </item>
    <item>
      <title>Google apporte une option essentielle &#224; NotebookLM sur mobile</title>
      <link>https://www.frandroid.com/marques/google/2963177_google-apporte-une-option-essentielle-a-notebooklm-sur-mobile</link>
      <pubDate>Mon, 02 Feb 2026 14:45:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2963177_google-apporte-une-option-essentielle-a-notebooklm-sur-mobile</guid>
      <description>
La firme de Mountain View a mis au point une fonctionnalit&#233; de r&#233;sum&#233; vid&#233;o au sein de son outil de prise de notes par IA.
</description>
    </item>
    <item>
      <title>13 000 milliards de dollars : Spotify et d&#8217;autres r&#233;clament une somme d&#233;lirante &#224; Anna&#8217;s Archive</title>
      <link>https://www.frandroid.com/services/streaming-musical/2963243_13-000-milliards-de-dollars-spotify-et-dautres-reclament-une-somme-delirante-a-annas-archive</link>
      <pubDate>Mon, 02 Feb 2026 14:41:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/streaming-musical/2963243_13-000-milliards-de-dollars-spotify-et-dautres-reclament-une-somme-delirante-a-annas-archive</guid>
      <description>
Spotify et plusieurs labels musicaux portent plainte contre le site Anna's Archive. Ils demandent une compensation particuli&#232;rement sal&#233;e.
</description>
    </item>
    <item>
      <title>10 ans de mises &#224; jour pour la Shield TV : Nvidia bat Google et Samsung &#224; plate couture</title>
      <link>https://www.frandroid.com/marques/nvidia/2963301_10-ans-de-mises-a-jour-pour-la-shield-tv-nvidia-bat-google-et-samsung-a-plate-couture</link>
      <pubDate>Mon, 02 Feb 2026 14:40:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2963301_10-ans-de-mises-a-jour-pour-la-shield-tv-nvidia-bat-google-et-samsung-a-plate-couture</guid>
      <description>
&#192; l'&#232;re de l'obsolescence programm&#233;e, o&#249; changer de smartphone tous les deux ans est devenu la norme, un OVNI r&#233;siste encore et toujours : la Nvidia Shield TV. Sortie en 2015, cette box Android TV continue de recevoir des mises &#224; jour, une d&#233;cennie plus tard. Comment est-ce possible ? Un dirigeant de Nvidia livre les secrets de cette long&#233;vit&#233; hors-norme.
...</description>
    </item>
    <item>
      <title>Sam Raimi Still Has Hope for a &#8216;Spider-Man 4&#8217;</title>
      <link>https://gizmodo.com/sam-raimi-spider-man-4-marvel-sony-2000716486</link>
      <pubDate>Mon, 02 Feb 2026 14:30:56 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000716486</guid>
      <description>Plus, a wild rumor about the direction of 'The Brave and the Bold'.</description>
    </item>
    <item>
      <title>UpScrolled&#8217;s founder says the social network has zoomed past 2.5M users</title>
      <link>https://techcrunch.com/2026/02/02/upscrolleds-founder-says-the-social-network-has-zoomed-past-2-5m-users/</link>
      <pubDate>Mon, 02 Feb 2026 14:29:22 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3088670</guid>
      <description>Upscrolled founder said that the social network was launched six years ago and had 150,000 users until January</description>
    </item>
    <item>
      <title>Meta exp&#233;rimente un clavier virtuel plus proche du r&#233;el pour le Quest 3</title>
      <link>https://www.01net.com/actualites/meta-experimente-un-clavier-virtuel-plus-proche-du-reel-pour-le-quest-3.html</link>
      <pubDate>Mon, 02 Feb 2026 14:29:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323745</guid>
      <description>Les utilisateurs de Quest 3 ont une raison suppl&#233;mentaire de garder leurs casques sur la t&#234;te : un clavier virtuel et un touchpad qui se positionnent sur une surface plane, comme une table ou un bureau. Ce n'est pas exactement un &#171;&#160;vrai&#160;&#187; clavier physique, mais ce sera probablement mieux que le clavier virtuel actuel.</description>
    </item>
    <item>
      <title>&#171;&#160;Nous devons am&#233;liorer Windows&#160;&#187; : pourquoi Microsoft pourrait s&#8217;inspirer d&#8217;Ubisoft et Square Enix pour sauver Windows 11</title>
      <link>https://www.frandroid.com/marques/microsoft/2962659_nous-devons-ameliorer-windows-pourquoi-microsoft-pourrait-sinspirer-dubisoft-et-square-enix-pour-sauver-windows-11</link>
      <pubDate>Mon, 02 Feb 2026 14:25:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2962659_nous-devons-ameliorer-windows-pourquoi-microsoft-pourrait-sinspirer-dubisoft-et-square-enix-pour-sauver-windows-11</guid>
      <description>
Dans la tourmente sur les soucis de stabilit&#233; de Windows 11, Microsoft annonce vouloir sauver les meubles pour regagner la confiance des utilisateurs. Une nouvelle strat&#233;gie qu'on a d&#233;j&#224; observ&#233;e &#224; plusieurs reprises dans le monde du jeu vid&#233;o.
</description>
    </item>
    <item>
      <title>Major health provider data breach may have affected thousands more people - over 700k now thought to have been hit</title>
      <link>https://www.techradar.com/pro/security/major-health-provider-data-breach-may-have-affected-thousands-more-people-over-700k-now-thought-to-have-been-hit</link>
      <pubDate>Mon, 02 Feb 2026 14:25:00 +0000</pubDate>
      <guid isPermaLink="false">tEKj92PydzRQpZV3m6SPdU</guid>
      <description>TriZetto Provider Solutions breach was spotted in October 2025 after hackers lurked for almost a year.</description>
    </item>
    <item>
      <title>What to know about the notable VIPs named in the Epstein files, from Elon Musk to former Prince Andrew</title>
      <link>https://www.fastcompany.com/91485089/what-know-about-notable-vips-named-epstein-files-from-elon-musk-former-prince-andrew</link>
      <pubDate>2026-02-02T14:22:29</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91485089/what-know-about-notable-vips-named-epstein-files-from-elon-musk-former-prince-andrew</guid>
      <description>Newly released documents from the DOJ mention the names of powerful people in tech and politics.
From tech titans to Wall Street power brokers and foreign dignitaries, a who&#8217;s who of powerful men make appearances in the huge trove of documents released by the Justice Department in connection with its investigations of Jeffrey Epstein.All have denied having anything to do with his sexual abuse of girls and young women. Yet some of them maintained friendships with Epstein, or developed them anew, even after news stories made him widely known as an alleged abuser of young girls.None have been cha...</description>
    </item>
    <item>
      <title>Linq raises $20M to enable AI assistants to live within messaging apps</title>
      <link>https://techcrunch.com/2026/02/02/linq-raises-20m-to-enable-ai-assistants-to-live-within-messaging-apps/</link>
      <pubDate>Mon, 02 Feb 2026 14:16:13 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3088487</guid>
      <description>Linq offers an API that lets  companies offer their AI assistants via iMessage, RCS and SMS.</description>
    </item>
    <item>
      <title>Elon Musk&#8217;s Grok is still undressing men</title>
      <link>https://www.theverge.com/report/872062/grok-still-undressing-men</link>
      <pubDate>2026-02-02T09:09:47-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=872062</guid>
      <description>After weeks of flooding the internet with nonconsensual sexual deepfakes, X has finally reined in Elon Musk's rogue chatbot Grok. Musk claims Grok obeys local laws and refuses to produce anything illegal - except it hasn't and it can. My testing shows Grok still readily undresses men and is still churning out intimate images on [&#8230;]</description>
    </item>
    <item>
      <title>The latest iPad mini is $100 off right now</title>
      <link>https://www.engadget.com/deals/the-latest-ipad-mini-is-100-off-right-now-140900983.html?src=rss</link>
      <pubDate>Mon, 02 Feb 2026 14:09:00 +0000</pubDate>
      <guid isPermaLink="false">19626799-ebb9-4821-a9ee-8598c32b4da3</guid>
      <description>We've finally made it to February, but, with the ongoing long nights, you might want a pick-me-up to get you through the rest of winter. Take the Apple iPad mini with the A17 Pro chip, which is on sale for $400, down from $500. Its small size is perfect for cozying up on the couch or to use on your daily commute.&#160;
Apple released this iPad mini in late 2024 and it was a solid update. We gave it an 83 in our review thanks to the power of its A17 Pro chip and that it comes with a minimum of 128GB of storage. The model currently on sale comes with 128GB, Wi-Fi and all four color options: Blue, Pur...</description>
    </item>
    <item>
      <title>Ces 10 arnaques en ligne explosent &#224; l&#8217;approche des Jeux olympiques d&#8217;hiver 2026</title>
      <link>https://www.01net.com/actualites/ces-10-arnaques-explosent-a-lapproche-des-jeux-olympiques-dhiver-2026.html</link>
      <pubDate>Mon, 02 Feb 2026 14:02:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323709</guid>
      <description>&#192; la veille de l&#8217;ouverture des Jeux d&#8217;hiver de Milano Cortina, les cybercriminels sont en embuscade. Les pirates sont bien partis pour surfer sur l&#8217;&#233;norme visibilit&#233; de l&#8217;&#233;v&#233;nement pour pi&#233;ger les internautes et les spectateurs sur place. En plus des faux sites de billets, de voyages ou d&#8217;emplois, les pirates misent sur des campagnes de phishing, des applications factices, des QR codes pi&#233;g&#233;s et m&#234;me des contenus dop&#233;s &#224; l&#8217;IA ou des deepfakes. Les chercheurs d&#8217;ESET appellent les fans de sports &#224; la plus grande vigilance....</description>
    </item>
    <item>
      <title>Surfshark's new browser tool warns you about dangerous sites before you click</title>
      <link>https://www.techradar.com/vpn/vpn-services/surfsharks-new-browser-tool-warns-you-about-dangerous-sites-before-you-click</link>
      <pubDate>Mon, 02 Feb 2026 14:02:13 +0000</pubDate>
      <guid isPermaLink="false">JYKQdbFMzQVvRgQvxLZGGD</guid>
      <description>Surfshark has updated its browser extension with a new feature that flags malicious links in Google Search results, helping users avoid malware and phishing attempts before they even click.</description>
    </item>
    <item>
      <title>The &#8216;Stranger Things: Tales from &#8217;85&#8217; Trailer Takes You Back to Hawkins</title>
      <link>https://gizmodo.com/stranger-things-tales-from-85-trailer-netflix-animated-series-2000716423</link>
      <pubDate>Mon, 02 Feb 2026 14:00:57 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000716423</guid>
      <description>Netflix brings the Hawkins gang and the Upside Down into animation with the new spinoff 'Stranger Things: Tales from '85'.</description>
    </item>
    <item>
      <title>The 'most capable and best-looking mainline Apple Watch' is back to a record-low price on Amazon</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/the-most-capable-and-best-looking-mainline-apple-watch-is-back-to-a-record-low-price-on-amazon</link>
      <pubDate>Mon, 02 Feb 2026 14:00:36 +0000</pubDate>
      <guid isPermaLink="false">FQ95nKdLNnnRELb5nRSEtZ</guid>
      <description>The Apple Watch Series 11 is the best Apple Watch for most people, and it's just hit a record low once more on Amazon.</description>
    </item>
    <item>
      <title>Now anyone can tap Ring doorbells to search for lost dogs</title>
      <link>https://www.theverge.com/tech/871916/search-party-non-ring-owners-neighbors-app</link>
      <pubDate>2026-02-02T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=871916</guid>
      <description>Ring is opening its Search Party pet finder service to non-Ring owners through the free Ring Neighbors app. The service has helped reunite owners with "more than one lost dog a day" since launch, according to the company. Anyone in the US can share a photo of their missing pet after they download and register [&#8230;]</description>
    </item>
    <item>
      <title>What is the release date for Fallout season 2 episode 8 on Prime Video?</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/what-is-the-release-date-for-fallout-season-2-episode-8-on-prime-video</link>
      <pubDate>Mon, 02 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">8TTbdXpjZ2qhpCQuvdp4EQ</guid>
      <description>It's finale week for Fallout season 2 &#8211; here's when you can watch its eighth episode.</description>
    </item>
    <item>
      <title>Get up to 20 percent off Sonos home theater gear before Super Bowl 2026</title>
      <link>https://www.engadget.com/deals/get-up-to-20-percent-off-sonos-home-theater-gear-before-super-bowl-2026-174053382.html?src=rss</link>
      <pubDate>Mon, 02 Feb 2026 13:56:27 +0000</pubDate>
      <guid isPermaLink="false">d95ac4b9-448d-4c43-906a-61793dfa0aef</guid>
      <description>It's big-game season, which means it's a good time to look for home theater gear on sale ahead of Super Bowl 2026. There are plenty of Super Bowl TV deals to consider, but if you have arguably the most important piece of the puzzle down, you may want to upgrade your sound system instead. Sonos' latest sale may have just what you need; a bunch of the company's home theater gear is up to 20 percent off right now. You can save $130 on the Beam (Gen 2) soundbar, bringing its price down to $369, and you'll also find deals on the flagship Arc Ultra soundbar, subwoofers, and more.
The Sonos Beam is t...</description>
    </item>
    <item>
      <title>La pleine Lune s&#8217;est d&#233;doubl&#233;e ? Ce spectacle irr&#233;el observ&#233; en Russie a affol&#233; les r&#233;seaux sociaux !</title>
      <link>https://www.futura-sciences.com/sciences/actualites/lune-ce-cachent-vraiment-ces-images-multiples-lunes-vues-russie-130821/#xtor%3DRSS-8</link>
      <pubDate>Mon, 02 Feb 2026 14:55:10 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/lune-ce-cachent-vraiment-ces-images-multiples-lunes-vues-russie-130821/#xtor%3DRSS-8</guid>
      <description>&#192; en croire les internautes russes, il y avait plusieurs lunes en m&#234;me temps dans leur ciel ce week-end. Ils ont des images. Mais peut-on s&#8217;y fier&#8201;?</description>
    </item>
    <item>
      <title>Cette tour PC Alienware avec pr&#232;s de 30 % de remise (RTX 5070, Ultra 7, 32 Go RAM) revient moins cher qu&#8217;un PC mont&#233; maison</title>
      <link>https://www.frandroid.com/bons-plans/2963095_cette-tour-pc-alienware-avec-pres-de-30-de-remise-rtx-5070-ultra-7-32-go-ram-revient-moins-cher-quun-pc-monte-maison</link>
      <pubDate>Mon, 02 Feb 2026 13:48:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2963095_cette-tour-pc-alienware-avec-pres-de-30-de-remise-rtx-5070-ultra-7-32-go-ram-revient-moins-cher-quun-pc-monte-maison</guid>
      <description>
Avec la p&#233;nurie des composants et la hausse des prix de la RAM et du stockage, cette tour Alienware affich&#233;e &#224; pr&#232;s de 30 % de remise tombe &#224; point nomm&#233;&#8201;: avec sa RTX 5070, son Intel Ultra 7 et ses 32 Go de RAM, elle offre une configuration taill&#233;e pour le 1440p et la 4K &#224; un tarif bien plus int&#233;ressant que le montage d&#8217;un PC &#233;quivalent.
</description>
    </item>
  </channel>
</rss>
