<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 28 Feb 2026 10:28:32 GMT</lastBuildDate>
    <item>
      <title>Il peut recharger deux MacBook &#224; pleine vitesse : ce chargeur rapide 200 W dot&#233; de 4 ports est &#224; -36 %</title>
      <link>https://www.frandroid.com/bons-plans/2988243_il-peut-recharger-deux-macbook-a-pleine-vitesse-ce-chargeur-rapide-200-w-dote-de-4-ports-est-a-36</link>
      <pubDate>Sat, 28 Feb 2026 10:24:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2988243_il-peut-recharger-deux-macbook-a-pleine-vitesse-ce-chargeur-rapide-200-w-dote-de-4-ports-est-a-36</guid>
      <description>
Avec ses quatre ports, dont trois USB-C, et sa puissance de charge maximale de 200 W, le chargeur Ugreen Nexode peut recharger rapidement plusieurs appareils simultan&#233;ment. Un appareil tr&#232;s utile au quotidien qu'Amazon propose &#224; 63,99 euros au lieu de 99,99 euros.
</description>
    </item>
    <item>
      <title>Cyberattaques en France&#160;: les derni&#232;res fuites de donn&#233;es et entreprises touch&#233;es</title>
      <link>https://www.01net.com/actualites/cyberattaques-france-dernieres-fuites-donnees-entreprises-touchees.html</link>
      <pubDate>Sat, 28 Feb 2026 10:14:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1235307</guid>
      <description>Les cyberattaques continuent de se multiplier en France. De nombreuses entreprises se sont retrouv&#233;es dans le viseur des cybercriminels. Ces attaques ont abouti au vol des donn&#233;es personnelles de la plupart des Fran&#231;ais. Ci-dessous, on fait le point sur les derni&#232;res victimes et l'&#233;volution de la situation.</description>
    </item>
    <item>
      <title>La batterie solide r&#233;volutionnaire qui int&#233;resse Stellantis et Mercedes s&#8217;approche de la production avec cette bonne nouvelle</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2994811_la-batterie-solide-revolutionnaire-qui-interesse-stellantis-et-mercedes-sapproche-de-la-production-avec-cette-bonne-nouvelle</link>
      <pubDate>Sat, 28 Feb 2026 10:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2994811_la-batterie-solide-revolutionnaire-qui-interesse-stellantis-et-mercedes-sapproche-de-la-production-avec-cette-bonne-nouvelle</guid>
      <description>
Entreprise li&#233;e &#224; Mercedes-Benz ou Stellantis, Factorial vient d'annoncer une collaboration avec Philenergy visant &#224; acc&#233;l&#233;rer l'industrialisation de ses prometteuses batteries solides pour voitures &#233;lectriques.
</description>
    </item>
    <item>
      <title>This Ruroc Helmet Ruined My Ski Holiday</title>
      <link>https://www.wired.com/story/this-helmet-ruined-my-ski-holiday/</link>
      <pubDate>Sat, 28 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">699ee74b96ff9899b69258fb</guid>
      <description>Branded intimidating and scary, this full-face Ruroc headgear for the slopes made me a pariah on the piste.</description>
    </item>
    <item>
      <title>'We start shooting pretty soon': Bridgerton season 5 already has a 'finished' script &#8212; but the finale is still a 'work in progress'</title>
      <link>https://www.techradar.com/streaming/netflix/bridgerton-season-5-update</link>
      <pubDate>Sat, 28 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">i88tnmuUhG925F6PKGDjBF</guid>
      <description>Just because we don't know much about Bridgerton season 5 doesn't mean that's the case for everyone else &#8212; the showrunners are busy making final adjustments.</description>
    </item>
    <item>
      <title>How to watch House of Villains season 3 online from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/house-of-villains-season-3</link>
      <pubDate>Sat, 28 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">32aAmyB3vG8GvsxmNndLFh</guid>
      <description>The villains are back, and nothing inside the mansion is safe. Here&#8217;s how you can watch House of Villains season 3 online and from anywhere.</description>
    </item>
    <item>
      <title>This solid-state motorcycle battery can almost fully recharge in under five minutes, according to new test results &#8212; but questions remain</title>
      <link>https://www.techradar.com/vehicle-tech/hybrid-electric-vehicles/this-solid-state-motorcycle-battery-can-almost-fully-recharge-in-under-five-minutes-according-to-new-test-results-but-questions-remain</link>
      <pubDate>Sat, 28 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">eCuGohoyBktVnu6kRtwKt7</guid>
      <description>Donut Labs backs up its bold solid-state battery claims with new tests that showcase ultra-rapid charging speeds.</description>
    </item>
    <item>
      <title>Scanning that QR code can leave you vulnerable. Here&#8217;s how to protect yourself</title>
      <link>https://www.fastcompany.com/91498172/qr-code-scan-vulnerable-protect-yourself-scam-quishing</link>
      <pubDate>2026-02-28T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91498172/qr-code-scan-vulnerable-protect-yourself-scam-quishing</guid>
      <description>It&#8217;s hard to believe that something nefarious can lie within a QR code, but it can. 
QR codes have become a convenience of modern life. Just scan the black and white mosaic with your phone&#8217;s camera and you can do everything from connect to your hotel room Wi-Fi to pay for that public parking space to pull up a restaurant menu.&#160;</description>
    </item>
    <item>
      <title>US and Israel Launch Strikes Against Iran</title>
      <link>https://www.wired.com/story/us-iran-strike-donald-trump/</link>
      <pubDate>Sat, 28 Feb 2026 09:42:54 +0000</pubDate>
      <guid isPermaLink="false">6966dab09730717f68405aee</guid>
      <description>US president Donald Trump said a &#8220;major combat operation&#8221; against Iran had begun as he called for the country&#8217;s government to be overthrown.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs mini PC &#224; acheter en 2026 ? Notre s&#233;lection</title>
      <link>https://www.frandroid.com/guide-dachat/2472618_meilleurs-mini-pc-quel-modele-choisir</link>
      <pubDate>Sat, 28 Feb 2026 09:02:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2472618_meilleurs-mini-pc-quel-modele-choisir</guid>
      <description>
Vous voulez un ordinateur de bureau compact, efficace et pas trop cher ? Le mini PC, petit et livr&#233; cl&#233; en main, est fait pour vous. Voici les meilleurs mini PC test&#233;s que l'on vous recommande.
</description>
    </item>
    <item>
      <title>JPMorgan warns a &#8216;parallel banking system&#8217; is emerging&#8212;and it could put trillions in deposits at risk</title>
      <link>https://www.fastcompany.com/91497394/jp-morgan-warns-a-parallel-banking-system-is-emerging-and-it-could-put-trillions-in-deposits-at-risk</link>
      <pubDate>2026-02-28T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91497394/jp-morgan-warns-a-parallel-banking-system-is-emerging-and-it-could-put-trillions-in-deposits-at-risk</guid>
      <description>Stablecoins continue to encroach on traditional banking.
Stablecoins that offer interest-bearing rewards may increasingly resemble bank deposits. But unlike traditional deposits, they lack the regulatory safeguards that undergird the banking system. That gap, according to JPMorgan CFO Jeremy Barnum, risks creating what he calls a &#8220;parallel banking system.&#8221;...</description>
    </item>
    <item>
      <title>Tout ce qui cloche dans le rachat de Warner Bros. Discovery par Paramount Skydance</title>
      <link>https://www.frandroid.com/services/svod/2992983_quest-ce-qui-clocherait-dans-le-rachat-de-warner-bros-par-paramount-skydance</link>
      <pubDate>Sat, 28 Feb 2026 08:33:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2992983_quest-ce-qui-clocherait-dans-le-rachat-de-warner-bros-par-paramount-skydance</guid>
      <description>
Dernier coup de th&#233;&#226;tre dans la guerre aux ench&#232;res opposant Netflix &#224; Paramount pour le rachat de Warner Bros. Discovery ! Le leader de la SVoD a annonc&#233; ne pas surench&#233;rir face &#224; la derni&#232;re offre de Paramount et semble jeter l'&#233;ponge. Pourtant, un rachat de Warner par Paramount ne serait pas une si bonne nouvelle.
</description>
    </item>
    <item>
      <title>Compact et lumineux, ce vid&#233;oprojecteur 4K brad&#233; &#224; -20 % transforme votre salon en salle de cin&#233;ma</title>
      <link>https://www.frandroid.com/bons-plans/2992155_compact-et-lumineux-ce-videoprojecteur-4k-brade-a-20-transforme-votre-salon-en-salle-de-cinema</link>
      <pubDate>Sat, 28 Feb 2026 08:32:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2992155_compact-et-lumineux-ce-videoprojecteur-4k-brade-a-20-transforme-votre-salon-en-salle-de-cinema</guid>
      <description>
Format compact, images en 4K jusqu'&#224; 150 pouces, luminosit&#233; &#233;lev&#233;e... L'Optoma Photon Life PK31 est un vid&#233;oprojecteur qui cumule les atouts. Actuellement, vous le trouverez &#224; 549 euros au lieu de 699 euros chez Boulanger, Son-Vid&#233;o et &#224; la Fnac.
</description>
    </item>
  </channel>
</rss>
