<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 26 Jan 2026 10:32:58 GMT</lastBuildDate>
    <item>
      <title>The head of Xbox Game Studios says 'we're going to try and be more consistent' with its PS5 game release strategy</title>
      <link>https://www.techradar.com/gaming/the-head-of-xbox-game-studios-says-were-going-to-try-and-be-more-consistent-with-its-ps5-game-release-strategy</link>
      <pubDate>Mon, 26 Jan 2026 10:26:52 +0000</pubDate>
      <guid isPermaLink="false">DQXpfLhGAjWrEDQhpWSKCR</guid>
      <description>Xbox Game Studios boss Craig Duncan says its PS5 strategy is working, but admits it has been "inconsistent" in regards to certain titles.</description>
    </item>
    <item>
      <title>149 millions de mots de passe Gmail, Apple, Facebook, Netflix, TikTok et Binance ont &#233;t&#233; pirat&#233;s et expos&#233;s sur Internet</title>
      <link>https://www.01net.com/actualites/149-millions-mots-passe-gmail-apple-facebook-netflix-tiktok-binance-exposes-internet.html</link>
      <pubDate>Mon, 26 Jan 2026 10:22:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322375</guid>
      <description>Pr&#232;s de 150 millions d&#8217;identifiants et de mots de passe ont &#233;t&#233; pirat&#233;s par des malwares. Laiss&#233;s en libre-service sur Internet, ils permettent d'acc&#233;der &#224; des comptes Gmail, Facebook, Apple, Netflix ou encore Binance. Des coordonn&#233;es bancaires sont &#233;galement concern&#233;es.</description>
    </item>
    <item>
      <title>How to watch Wonder Man online from anywhere &#8212; stream Marvel's new hero</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/wonder-man-marvel-online</link>
      <pubDate>Mon, 26 Jan 2026 10:15:26 +0000</pubDate>
      <guid isPermaLink="false">Nu9KFCfUUU9BHqMaZk9MbT</guid>
      <description>Marvel Phase 6 welcomes a new superhero to the scene. Here&#8217;s how you can watch Wonder Man online and from anywhere.</description>
    </item>
    <item>
      <title>TikTok broke in its first weekend with US ownership</title>
      <link>https://www.theverge.com/news/867625/tiktok-down-weekend-broke-fyp-video-uploads-review</link>
      <pubDate>2026-01-26T05:10:13-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=867625</guid>
      <description>TikTok has suffered from extensive problems on its first weekend after completing the sale of its US arm, though some issues appear to have spread globally. TikTok has yet to confirm any issues a day after troubles began, making it difficult to surmise the extent of the problems. Nevertheless, Tiktokkers - including some Verge writers [&#8230;]</description>
    </item>
    <item>
      <title>Gmail issues saw it go a little haywire and start accusing user inboxes of being spam - here's what we know</title>
      <link>https://www.techradar.com/pro/gmail-issues-saw-it-go-a-little-haywire-and-start-accusing-user-inboxes-of-being-spam-heres-what-we-know</link>
      <pubDate>Mon, 26 Jan 2026 10:04:15 +0000</pubDate>
      <guid isPermaLink="false">2rtSyUx7df9fgvwGPgyNuR</guid>
      <description>Google Workspace users' Gmail inboxes were being flooded with emails after categorization and spam filtering went haywire.</description>
    </item>
    <item>
      <title>Apr&#232;s la riposte de Spotify, les 300 To de musique vol&#233;s par les Archives d&#8217;Anna en partie inaccessibles</title>
      <link>https://www.01net.com/actualites/apres-la-riposte-de-spotify-les-300-to-de-musique-voles-par-les-archives-danna-en-partie-inaccessibles.html</link>
      <pubDate>Mon, 26 Jan 2026 10:01:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321762</guid>
      <description>Spotify et les maisons de disque ont cherch&#233;, en toute discr&#233;tion, &#224; rendre inaccessibles les 300 t&#233;raoctets de musique r&#233;cup&#233;r&#233;s ill&#233;galement par la biblioth&#232;que pirate : une tentative en partie r&#233;ussie.</description>
    </item>
    <item>
      <title>The best kitchen gadgets for 2026</title>
      <link>https://www.engadget.com/home/kitchen-tech/best-kitchen-tech-gadgets-small-appliances-124515179.html?src=rss</link>
      <pubDate>Mon, 26 Jan 2026 10:00:36 +0000</pubDate>
      <guid isPermaLink="false">8426cf6e-f934-4619-897c-80069288696c</guid>
      <description>Whether you love cooking already or you want to try to cook more at home to spend less money on takeout, there are tons of gadgets that can make your time in the kitchen even more enjoyable. As food lovers and tech reviewers, the Engadget team has tried out pizza ovens, sous vide machines, air fryers, ice cream makers and more. Here, we gathered all of the best gear we&#8217;ve tested, reviewed and used in our own kitchens for when you&#8217;re looking to spice things up in yours. We&#8217;ve also linked to our reviews and buying guides so you can dive deeper into our recommendations for the best kitchen gadget...</description>
    </item>
    <item>
      <title>Despair-Inducing Analysis Shows AI Eroding the Reliability of Science Publishing</title>
      <link>https://gizmodo.com/despair-inducing-analysis-shows-ai-eroding-the-reliability-of-science-publishing-2000713786</link>
      <pubDate>Mon, 26 Jan 2026 10:00:19 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000713786</guid>
      <description>A flood of slop has arrived in science, and everyone has to get less lazy. But does 2026 feel like a time when anyone, anywhere, is getting less lazy?</description>
    </item>
    <item>
      <title>Combining the Artemis mission and AI will fuel a new surge of moon landing deniers</title>
      <link>https://www.fastcompany.com/91480178/combining-the-artemis-mission-and-ai-will-fuel-a-new-surge-of-moon-landing-deniers</link>
      <pubDate>2026-01-26T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480178/combining-the-artemis-mission-and-ai-will-fuel-a-new-surge-of-moon-landing-deniers</guid>
      <description>NASA will be launching its moon return effort in a period of major distrust in American scientific and government institutions, and, amid the proliferation of generative AI. Will people accept reality?
On my phone, there are already videos of the next moon landing. In one, an astronaut springs off the rung of a ladder, strung out from the lander, before slowly plopping to the surface. He is, alas, still getting accustomed to the weaker gravity. ...</description>
    </item>
    <item>
      <title>L&#8217;&#233;quipage d&#8217;Artemis II a &#233;t&#233; mis en quarantaine : on vous explique pourquoi</title>
      <link>https://www.futura-sciences.com/sciences/actualites/exploration-equipage-artemis-ii-ete-mis-quarantaine-on-vous-explique-130535/#xtor%3DRSS-8</link>
      <pubDate>Mon, 26 Jan 2026 10:59:44 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/exploration-equipage-artemis-ii-ete-mis-quarantaine-on-vous-explique-130535/#xtor%3DRSS-8</guid>
      <description>&#192; l&#8217;approche du d&#233;part d&#8217;Artemis II pour un p&#233;riple autour de la Lune, l&#8217;&#233;quipage est actuellement en p&#233;riode de quarantaine. C'est l'occasion de vous expliquer bri&#232;vement pourquoi ce confinement est essentiel. Dans une vid&#233;o r&#233;cemment publi&#233;e par l&#8217;Agence spatiale canadienne, le Dr Raffi...</description>
    </item>
    <item>
      <title>Amazon retire 160 &#8364; sur le pack DJI Mini 5 Pro, le nouveau roi des drones ultra compact not&#233; 9/10</title>
      <link>https://www.frandroid.com/bons-plans/2954645_amazon-retire-160-e-sur-le-pack-dji-mini-5-pro-le-nouveau-roi-des-drones-ultra-compact-note-9-10</link>
      <pubDate>Mon, 26 Jan 2026 09:58:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2954645_amazon-retire-160-e-sur-le-pack-dji-mini-5-pro-le-nouveau-roi-des-drones-ultra-compact-note-9-10</guid>
      <description>
Le DJI Mini 5 Pro s'impose comme la nouvelle r&#233;f&#233;rence des drones ultra-compacts. Not&#233; 9/10 par nos soins, c'est un appareil que l'on recommande chaudement. Il est d'ailleurs propos&#233; dans un pack complet &#224; 839 euros, contre 999 euros de base.&#160;
</description>
    </item>
    <item>
      <title>14 voitures &#233;lectriques test&#233;es par grand froid : voici celle qui s&#8217;en sort le mieux</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2954617_14-voitures-electriques-testees-par-grand-froid-voici-celle-qui-sen-sort-le-mieux</link>
      <pubDate>Mon, 26 Jan 2026 09:57:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2954617_14-voitures-electriques-testees-par-grand-froid-voici-celle-qui-sen-sort-le-mieux</guid>
      <description>
Peut-on envisager de partir en vacances d&#8217;hiver en voiture &#233;lectrique&#160;? L&#8217;ADAC a test&#233; 14 voitures &#233;lectriques par 0&#176;C sur autoroute, et les r&#233;sultats sont contrast&#233;s. Si l'Audi A6 et la Tesla Model Y tirent leur &#233;pingle du jeu avec une efficience remarquable, d'autres mod&#232;les voient leur consommation s'envoler de plus de 40 %.
</description>
    </item>
    <item>
      <title>Le &#171;&#160;Whoop killer&#160;&#187; de Garmin en approche ? Ce qu&#8217;on sait sur le myst&#233;rieux bracelet Cirqa</title>
      <link>https://www.frandroid.com/marques/garmin/2954673_le-whoop-killer-de-garmin-en-approche-ce-quon-sait-sur-le-mysterieux-bracelet-cirqa</link>
      <pubDate>Mon, 26 Jan 2026 09:57:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/garmin/2954673_le-whoop-killer-de-garmin-en-approche-ce-quon-sait-sur-le-mysterieux-bracelet-cirqa</guid>
      <description>
Garmin a publi&#233; sur son site Internet plusieurs pages au sujet de son bracelet connect&#233; &#171; Cirqa &#187; avant de les supprimer. 
</description>
    </item>
    <item>
      <title>On conna&#238;t les box internet pr&#233;f&#233;r&#233;es des fran&#231;ais en 2025, et c&#8217;est une Freebox qui occupe le bas du classement</title>
      <link>https://www.frandroid.com/telecom/box-internet/2954631_on-connait-les-box-internet-preferees-des-francais-en-2025-et-cest-une-freebox-qui-occupe-le-bas-du-classement</link>
      <pubDate>Mon, 26 Jan 2026 09:54:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/box-internet/2954631_on-connait-les-box-internet-preferees-des-francais-en-2025-et-cest-une-freebox-qui-occupe-le-bas-du-classement</guid>
      <description>
Chaque ann&#233;e, le comparateur Zone ADSL&amp;Fibre son barom&#232;tre de la satisfaction client sur le march&#233; des t&#233;l&#233;coms. On y d&#233;couvre notamment un classement des box pr&#233;f&#233;r&#233;es (et mal-aim&#233;es) des fran&#231;ais. Quant &#224; l'offre qui remporte une m&#233;daille d'or, ce n'est pas une grande surprise.
</description>
    </item>
    <item>
      <title>L&#8217;interdiction des r&#233;seaux sociaux aux moins de 15&#160;ans pourrait entrer en vigueur d&#232;s la rentr&#233;e prochaine</title>
      <link>https://www.frandroid.com/culture-tech/politique/2954633_linterdiction-des-reseaux-sociaux-aux-moins-de-15-ans-pourrait-entrer-en-vigueur-des-la-rentree-prochaine</link>
      <pubDate>Mon, 26 Jan 2026 09:50:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/politique/2954633_linterdiction-des-reseaux-sociaux-aux-moins-de-15-ans-pourrait-entrer-en-vigueur-des-la-rentree-prochaine</guid>
      <description>
Alors que le texte a &#233;t&#233; lourdement retoqu&#233; par le Conseil d&#8217;&#201;tat, Emmanuel Macron veut encore y croire et vient de demander &#224; ce que l&#8217;interdiction des r&#233;seaux sociaux aux mineurs de moins de 15&#160;ans soit effective d&#232;s la rentr&#233;e prochaine.
</description>
    </item>
    <item>
      <title>Fnac Darty mise sur un QR code pour bousculer l&#8217;&#233;lectrom&#233;nager d&#8217;occasion</title>
      <link>https://www.01net.com/actualites/fnac-darty-mise-sur-un-qr-code-pour-bousculer-lelectromenager-doccasion.html</link>
      <pubDate>Mon, 26 Jan 2026 09:43:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322363</guid>
      <description>D&#232;s 2026, Fnac Darty &#233;quipera plus d'un million d'appareils de gros &#233;lectrom&#233;nager d'un Passeport Produit. Ce QR code, v&#233;ritable carnet de sant&#233; num&#233;rique, vise &#224; s&#233;curiser le march&#233; de la seconde main.</description>
    </item>
    <item>
      <title>ChatGPT cite Grokipedia comme source&#160;: pourquoi il faut faire attention&#160;?</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2954639_chatgpt-cite-grokipedia-comme-source-pourquoi-il-faut-faire-attention</link>
      <pubDate>Mon, 26 Jan 2026 09:41:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2954639_chatgpt-cite-grokipedia-comme-source-pourquoi-il-faut-faire-attention</guid>
      <description>
Grokip&#233;dia, l&#8217;encyclop&#233;die collaborative d&#8217;Elon Musk, commence &#224; appara&#238;tre dans les sources de r&#233;ponses de ChatGPT. Une arriv&#233;e qui suscite la m&#233;fiance, l&#8217;encyclop&#233;die ayant &#233;t&#233; point&#233;e du doigt &#224; de multiples reprises pour ses propos mensongers et son r&#233;visionnisme historique. &#160;
</description>
    </item>
    <item>
      <title>Bient&#244;t des smartphones &#224; 6 GHz ? Qualcomm voudrait transformer nos mobiles en monstres de puissance avec le Snapdragon 8 Elite Gen 6 Pro</title>
      <link>https://www.frandroid.com/marques/qualcomm/2954715_bientot-des-smartphones-a-6-ghz-qualcomm-voudrait-transformer-nos-mobiles-en-monstres-de-puissance-avec-le-snapdragon-8-elite-gen-6-pro</link>
      <pubDate>Mon, 26 Jan 2026 09:36:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/qualcomm/2954715_bientot-des-smartphones-a-6-ghz-qualcomm-voudrait-transformer-nos-mobiles-en-monstres-de-puissance-avec-le-snapdragon-8-elite-gen-6-pro</guid>
      <description>
Qualcomm pourrait lancer deux versions de son futur Snapdragon 8 Elite Gen 6, dont une variante &#171; Pro &#187; capable d'atteindre une tr&#232;s haute fr&#233;quence d'horloge gr&#226;ce &#224; une gravure en 2 nm.
</description>
    </item>
    <item>
      <title>Comparatif : les meilleurs bracelets connect&#233;s pour le sport en 2026</title>
      <link>https://www.frandroid.com/guide-dachat/321051_10-trackers-meilleurs-bracelets-connectes-2017</link>
      <pubDate>Mon, 26 Jan 2026 09:31:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/321051_10-trackers-meilleurs-bracelets-connectes-2017</guid>
      <description>
Les trackers d'activit&#233; constituent l'accessoire&#160;id&#233;al pour celles et ceux qui cherchent &#224; garder la forme. Voici notre s&#233;lection des meilleurs bracelets connect&#233;s de sant&#233; ou de sport.
</description>
    </item>
    <item>
      <title>OpenAI is chasing advertising dollars. Can publishers cash in, too?</title>
      <link>https://www.fastcompany.com/91478679/openai-is-chasing-ad-dollars-can-publishers-cash-in-too</link>
      <pubDate>2026-01-26T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91478679/openai-is-chasing-ad-dollars-can-publishers-cash-in-too</guid>
      <description>ChatGPT launching ads could squeeze publishers further&#8212;or finally give them the leverage they&#8217;ve been waiting for.
It looks like OpenAI is taking the &#8220;new year, new you&#8221; approach when it comes to its business strategy. To kick off 2026, the company announced it would soon introduce ads into ChatGPT&#8212;which was a bit of a surprise, considering CEO Sam Altman had previously said ads would be a &#8220;last resort&#8221; as a business model....</description>
    </item>
    <item>
      <title>Gravaa fait faillite : son syst&#232;me &#171; magique &#187; qui permet de gonfler ses pneus en roulant est menac&#233;</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2954755_gravaa-fait-faillite-son-systeme-magique-qui-permet-de-gonfler-ses-pneus-en-roulant-est-menace</link>
      <pubDate>Mon, 26 Jan 2026 09:27:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2954755_gravaa-fait-faillite-son-systeme-magique-qui-permet-de-gonfler-ses-pneus-en-roulant-est-menace</guid>
      <description>
Gravaa a &#233;t&#233; d&#233;clar&#233; en faillite. Cette d&#233;cision intervient malgr&#233; l'utilisation de son syst&#232;me r&#233;volutionnaire KAPS au plus haut niveau et m&#234;me commercialis&#233; aupr&#232;s du grand public.
</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : il reste un peu plus d&#8217;une semaine pour faire de bonnes affaires, les meilleures offres en DIRECT</title>
      <link>https://www.frandroid.com/bons-plans/2949895_soldes-dhiver-2026-il-reste-un-peu-plus-dune-semaine-pour-faire-de-bonnes-affaires-les-meilleures-offres-en-direct</link>
      <pubDate>Mon, 26 Jan 2026 09:27:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2949895_soldes-dhiver-2026-il-reste-un-peu-plus-dune-semaine-pour-faire-de-bonnes-affaires-les-meilleures-offres-en-direct</guid>
      <description>
C'est d&#233;j&#224; bient&#244;t la fin des soldes d'hiver. En effet, dans un peu plus d'une semaine, les e-commer&#231;ants tels qu'Amazon, Fnac, Darty, Boulanger ou encore Cdiscount vont arr&#234;ter de partager des offres en ce sens. C'est bient&#244;t la derni&#232;re d&#233;marque, l&#224; o&#249; il y a les meilleures offres &#224; saisir. Tenez-vous pr&#234;t(e)s !
</description>
    </item>
    <item>
      <title>Galaxy S26&#160;: Samsung abandonnerait enfin cette configuration devenue obsol&#232;te</title>
      <link>https://www.01net.com/actualites/galaxy-s26-samsung-abandonnerait-configuration-devenue-obsolete.html</link>
      <pubDate>Mon, 26 Jan 2026 09:26:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322359</guid>
      <description>Bonne nouvelle si vous attendez le Galaxy S26, Samsung pourrait enfin se d&#233;barrasser d'une configuration qui a fait son temps.</description>
    </item>
    <item>
      <title>Voitures &#233;lectriques : cette nouvelle &#233;tude met fin au d&#233;bat sur la pollution</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2954487_voitures-electriques-cette-nouvelle-etude-met-fin-au-debat-sur-la-pollution</link>
      <pubDate>Mon, 26 Jan 2026 09:21:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2954487_voitures-electriques-cette-nouvelle-etude-met-fin-au-debat-sur-la-pollution</guid>
      <description>
Selon une nouvelle &#233;tude, les voitures &#233;lectriques contribuent r&#233;ellement &#224; r&#233;duire la pollution atmosph&#233;rique. Et tout particuli&#232;rement la concentration de dioxyde d&#8217;azote dans l&#8217;atmosph&#232;re, entra&#238;nant un b&#233;n&#233;fice concret pour la sant&#233;.
</description>
    </item>
    <item>
      <title>Pourquoi Tim Cook et Apple sont au centre d&#8217;une pol&#233;mique aux &#201;tats-Unis</title>
      <link>https://www.frandroid.com/culture-tech/politique/2954641_pourquoi-tim-cook-et-apple-sont-au-centre-dune-polemique-aux-etats-unis</link>
      <pubDate>Mon, 26 Jan 2026 09:20:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/politique/2954641_pourquoi-tim-cook-et-apple-sont-au-centre-dune-polemique-aux-etats-unis</guid>
      <description>
&#171; On te voit &#187;, &#171; l&#232;che-bottes des fascistes &#187;, Tim Cook, le patron d'Apple, fait l'objet de violentes attaques sur les r&#233;seaux sociaux. En cause, une projection de film &#224; la Maison-Blanche.
</description>
    </item>
    <item>
      <title>Clawdbot : tout savoir sur l&#8217;agent qui peut travailler &#224; votre place</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2954659_clawdbot-tout-savoir-sur-lagent-qui-peut-travailler-a-votre-place</link>
      <pubDate>Mon, 26 Jan 2026 09:13:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2954659_clawdbot-tout-savoir-sur-lagent-qui-peut-travailler-a-votre-place</guid>
      <description>
On a pass&#233; deux ans &#224; discuter avec des fen&#234;tres de chat pour obtenir des r&#233;ponses plus ou moins vagues. Clawdbot pourrait changer &#231;a : ce n'est plus un assistant &#224; qui on parle, c'est un agent qui agit. 
</description>
    </item>
    <item>
      <title>Gmail a d&#233;raill&#233; : Google r&#233;v&#232;le pourquoi votre bo&#238;te mail a &#233;t&#233; inond&#233;e de spams</title>
      <link>https://www.01net.com/actualites/gmail-deraille-google-revele-pourquoi-boite-mail-inondee-spams.html</link>
      <pubDate>Mon, 26 Jan 2026 09:10:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322358</guid>
      <description>Ce week-end, des utilisateurs ont d&#233;couvert un Gmail m&#233;connaissable. Promotions, newsletters et pubs ont brusquement d&#233;ferl&#233; dans la bo&#238;te de r&#233;ception principale, tandis que les mails l&#233;gitimes mettaient de longues minutes &#224; arriver. Google a vite corrig&#233; le probl&#232;me et explique ce qu'il s'est pass&#233;.</description>
    </item>
    <item>
      <title>One of our favorite low-cost mini PCs has been given a major upgrade that makes it even more appealing - and you can get an extra discount now, if you act fast</title>
      <link>https://www.techradar.com/pro/one-of-our-favorite-low-cost-mini-pcs-has-been-given-a-major-upgrade-that-makes-it-even-more-appealing-and-you-can-even-get-an-extra-discount-now-if-you-act-fast</link>
      <pubDate>Mon, 26 Jan 2026 09:03:12 +0000</pubDate>
      <guid isPermaLink="false">AUdNd7SSsmF5XnWuaMLwxa</guid>
      <description>Geekom&#8217;s A5 Pro mini-PC swaps Ryzen 7 for Ryzen 5, supports up to 64 GB RAM, and offers multiple storage options.</description>
    </item>
    <item>
      <title>Synthesia hits $4B valuation, lets employees cash out</title>
      <link>https://techcrunch.com/2026/01/26/synthesia-hits-4b-valuation-lets-employees-cash-in/</link>
      <pubDate>Mon, 26 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3085527</guid>
      <description>British startup Synthesia, whose AI platform helps companies create interactive training videos, has raised a $200 million Series E round of funding that brings its valuation to $4 billion &#8212; up from $2.1 billion just a year ago.</description>
    </item>
    <item>
      <title>What is the release date and launch time for Marvel's Wonder Man on Disney+?</title>
      <link>https://www.techradar.com/streaming/disney-plus/wonder-man-release-date-when-does-the-new-marvel-tv-show-come-out-on-disney</link>
      <pubDate>Mon, 26 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">ezYxY669nnjQXV3d4LRXLd</guid>
      <description>Here's when you can watch Wonder Man, the next Marvel TV show to come to Disney+.</description>
    </item>
    <item>
      <title>How Flights for Freedom is flying trafficked children to safety</title>
      <link>https://www.fastcompany.com/91467948/how-flights-for-freedom-is-flying-trafficked-children-to-safety</link>
      <pubDate>2026-01-26T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91467948/how-flights-for-freedom-is-flying-trafficked-children-to-safety</guid>
      <description>The volunteer pilots of this California nonprofit have teamed with law enforcement and child advocates to rescue victims as young as 12. 
In 2023, Ken Lux found himself in an FBI briefing on child trafficking. The CEO of Luxe Aviation was there as the past commander of the Sacramento County Sheriff&#8217;s Office&#8217;s Air Squadron, a volunteer cadre of 50 general aviation pilots supporting police missions and community service. Lux recalls the FBI agent relaying the story of a since-jailed airline pilot who used his credentials to traffic children to clients in the Philippines with chilling negotiation...</description>
    </item>
    <item>
      <title>Why your brain needs downtime to outthink your competition</title>
      <link>https://www.fastcompany.com/91468679/why-your-brain-needs-downtime-to-outthink-your-competition</link>
      <pubDate>2026-01-26T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91468679/why-your-brain-needs-downtime-to-outthink-your-competition</guid>
      <description>To flourish in a world of ubiquitous technology and unprecedented burnout, we must stop grinding and start cultivating the &#8216;sexy bits&#8217; of productivity.
Think of your creativity like a high-performance garden: If you focus only on the visible harvest (outputs) and never allow the soil to lie fallow (liminal space) or the bees to roam freely (play), the ground eventually becomes depleted. Boredom is the signal that the soil needs replenishing, ensuring that your next season of work is a flourish rather than a struggle....</description>
    </item>
    <item>
      <title>What science reveals about the benefits of positive thinking</title>
      <link>https://www.fastcompany.com/91478157/what-science-reveals-about-the-benefits-of-positive-thinking</link>
      <pubDate>2026-01-26T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91478157/what-science-reveals-about-the-benefits-of-positive-thinking</guid>
      <description>Is mindset overrated?
Henry Ford famously noted, &#8220;Whether you think you can do it or not, you are usually right.&#8221; His point was that beliefs, especially about our talents, performance, and even luck, can be self-fulfilling. Irrespective of whether they are right or wrong, they will become true by influencing objective success outcomes.</description>
    </item>
    <item>
      <title>Le Google Pixel 8 revient pour les soldes dans un pack &#224; -40 % chez Carrefour</title>
      <link>https://www.frandroid.com/bons-plans/2474164_le-google-pixel-8-revient-pour-les-soldes-dans-un-pack-a-moins-40-pourcents-chez-carrefour</link>
      <pubDate>Mon, 26 Jan 2026 08:58:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2474164_le-google-pixel-8-revient-pour-les-soldes-dans-un-pack-a-moins-40-pourcents-chez-carrefour</guid>
      <description>
Si vous n'avez pas encore craqu&#233; pour un nouveau smartphone depuis le d&#233;but des soldes, cette offre &#224; 479,99 euros chez Carrefour comprenant un Google Pixel 8 et une Nest Cam filaire est franchement all&#233;chante. 
</description>
    </item>
    <item>
      <title>Le n&#176;1 du v&#233;lo en Europe tremble encore</title>
      <link>https://www.frandroid.com/survoltes/2954635_le-n1-du-velo-en-europe-tremble-encore</link>
      <pubDate>Mon, 26 Jan 2026 08:57:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2954635_le-n1-du-velo-en-europe-tremble-encore</guid>
      <description>
Moins de deux ans apr&#232;s une premi&#232;re restructuration financi&#232;re, Accell Group pourrait de nouveau devoir ren&#233;gocier sa dette. Selon plusieurs sources cit&#233;es par The Financial Times, la situation financi&#232;re du fabricant europ&#233;en de v&#233;los reste fragile malgr&#233; les mesures d&#233;j&#224; engag&#233;es.
</description>
    </item>
    <item>
      <title>NYT Pips hints, answers for January 26, 2026</title>
      <link>https://mashable.com/article/pips-nyt-games-hints-answers-easy-medium-hard-january-26-2026</link>
      <pubDate>Mon, 26 Jan 2026 08:39:34 +0000</pubDate>
      <guid isPermaLink="false">04Kj1ikP2YEx9OBYaCWIIT3</guid>
      <description>The New York Times' latest game, Pips, brings domino fun to your desktop. How to play Pips as well as hints in case you get stuck.</description>
    </item>
    <item>
      <title>Windows 11&#160;: Microsoft confirme (encore) un nouveau bug li&#233; &#224; son Patch Tuesday</title>
      <link>https://www.01net.com/actualites/windows-11-microsoft-confirme-encore-un-nouveau-bug-lie-a-son-patch-tuesday.html</link>
      <pubDate>Mon, 26 Jan 2026 08:39:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322361</guid>
      <description>Microsoft n&#8217;en a pas termin&#233; des probl&#232;mes avec la mise &#224; jour de Windows 11 de janvier. En proposant une mise &#224; jour pour corriger les premiers bugs, la firme de Redmond en a r&#233;veill&#233; d&#8217;autres.</description>
    </item>
  </channel>
</rss>
