<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 16 Feb 2026 10:01:04 GMT</lastBuildDate>
    <item>
      <title>Grok arrive sur les Tesla en France et c&#8217;est aussi bluffant que frustrant</title>
      <link>https://www.frandroid.com/marques/tesla/2978171_grok-arrive-sur-les-tesla-en-france-et-cest-aussi-bluffant-que-frustrant</link>
      <pubDate>Mon, 16 Feb 2026 09:59:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2978171_grok-arrive-sur-les-tesla-en-france-et-cest-aussi-bluffant-que-frustrant</guid>
      <description>
Le constructeur am&#233;ricain annonce que l&#8217;intelligence artificielle d&#8217;Elon Musk, Grok, fait son arriv&#233;e dans les voitures &#233;lectriques de Tesla. Et bonne nouvelle, la France est aussi servie. Une fonction plus utile qu'il n'y para&#238;t au premier abord, mais avec des limitations pour le moment.
</description>
    </item>
    <item>
      <title>Moins de 500 &#8364; pour un TV QLED de 70&#8243; certifi&#233; 4K avec Google TV et de l&#8217;audio Harman Kardon Dolby Atmos, difficile de faire mieux</title>
      <link>https://www.frandroid.com/bons-plans/2978175_moins-de-500-e-pour-un-tv-qled-de-70-certifie-4k-avec-google-tv-et-de-laudio-harman-kardon-dolby-atmos-difficile-de-faire-mieux</link>
      <pubDate>Mon, 16 Feb 2026 09:57:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2978175_moins-de-500-e-pour-un-tv-qled-de-70-certifie-4k-avec-google-tv-et-de-laudio-harman-kardon-dolby-atmos-difficile-de-faire-mieux</guid>
      <description>
Electro Depot vient de recevoir un arrivage int&#233;ressant : un t&#233;l&#233;viseur QLED de 70" compatible HDR, Dolby Atmos et fonctionnant avec Google, le Sharp 70HP5265E, pour 499 euros.
</description>
    </item>
    <item>
      <title>TechRadar&#8217;s Best in Show MWC 2026 Awards are on the hunt for the most exciting mobile tech &#8212; here&#8217;s how you can help</title>
      <link>https://www.techradar.com/tech-events/mwc-2026-best-in-show-awards-how-to-enter</link>
      <pubDate>Mon, 16 Feb 2026 09:55:21 +0000</pubDate>
      <guid isPermaLink="false">5h7cEeq8NYjK2xkCEZWKcL</guid>
      <description>TechRadar is teaming up with Tom&#8217;s Guide, Android Central, and T3 to bring you the very best tech on show at MWC 2026</description>
    </item>
    <item>
      <title>Faut-il attendre l&#8217;iPhone 18 Pro&#160;? Voici les 6 nouveaut&#233;s qui se profilent</title>
      <link>https://www.01net.com/actualites/faut-il-attendre-iphone-18-pro-6-nouveautes-qui-se-profilent.html</link>
      <pubDate>Mon, 16 Feb 2026 09:53:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326050</guid>
      <description>&#192; quelques mois de la pr&#233;sentation de l'iPhone 18 Pro, les rumeurs autour des am&#233;liorations apport&#233;es se font de plus en plus pr&#233;cises.</description>
    </item>
    <item>
      <title>Fini les regards indiscrets dans le m&#233;tro, Samsung tease la fonction de confidentialit&#233; ultime des Galaxy S26</title>
      <link>https://www.frandroid.com/marques/samsung/2978357_fini-les-regards-indiscrets-dans-le-metro-samsung-tease-la-fonction-de-confidentialite-ultime-des-galaxy-s26</link>
      <pubDate>Mon, 16 Feb 2026 09:50:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2978357_fini-les-regards-indiscrets-dans-le-metro-samsung-tease-la-fonction-de-confidentialite-ultime-des-galaxy-s26</guid>
      <description>
Samsung vient de publier un teaser d&#233;voilant le mode de confidentialit&#233; activable nativement sur ses futurs Galaxy S26. Baptis&#233;e &#171; Zero-peeking privacy &#187;, cette technologie permet de prot&#233;ger son contenu des regards indiscrets en un clic, sans accessoire physique.
</description>
    </item>
    <item>
      <title>Ce nouveau v&#233;lo &#233;lectrique Intersport promet confort et performance &#224; prix r&#233;duit</title>
      <link>https://www.frandroid.com/marques/nakamura/2978317_ce-nouveau-velo-electrique-intersport-promet-confort-et-performance-a-prix-reduit</link>
      <pubDate>Mon, 16 Feb 2026 09:49:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nakamura/2978317_ce-nouveau-velo-electrique-intersport-promet-confort-et-performance-a-prix-reduit</guid>
      <description>
De retour apr&#232;s plus de 2 ans d&#8217;absence dans la gamme Intersport, le v&#233;lo &#233;lectrique urbain Nakamura Crossover LTD marie position confortable, suspension g&#233;n&#233;reuse et moteur central performant pour un tarif sous les 2 000 euros.
</description>
    </item>
    <item>
      <title>Rachat de Warner Bros : un nouveau deal&#8230; avec Paramount ? Les n&#233;gociations pourraient reprendre au d&#233;triment de Netflix</title>
      <link>https://www.frandroid.com/services/svod/2978203_rachat-de-warner-bros-un-nouveau-deal-avec-paramount-les-negociations-pourraient-reprendre-au-detriment-de-netflix</link>
      <pubDate>Mon, 16 Feb 2026 09:43:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2978203_rachat-de-warner-bros-un-nouveau-deal-avec-paramount-les-negociations-pourraient-reprendre-au-detriment-de-netflix</guid>
      <description>
Retournement de situation en vue ? Alors que Warner Bros. a d&#233;j&#224; donn&#233; son accord pour vendre une partie de ses actifs &#224; Netflix, le g&#233;ant du divertissement envisagerait de reprendre les discussions avec Paramount qui vient d'avancer une offre de rachat all&#233;chante.
</description>
    </item>
    <item>
      <title>Thule et ses porte-v&#233;los ne connaissent pas la crise</title>
      <link>https://www.frandroid.com/marques/thule/2978355_thule-et-ses-porte-velos-ne-connaissent-pas-la-crise</link>
      <pubDate>Mon, 16 Feb 2026 09:37:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/thule/2978355_thule-et-ses-porte-velos-ne-connaissent-pas-la-crise</guid>
      <description>
Malgr&#233; un march&#233; du cycle fragilis&#233; depuis plusieurs ann&#233;es, le groupe su&#233;dois Thule affiche pour 2025 une progression de son chiffre d&#8217;affaires et des ventes, avec un b&#233;n&#233;fice net en l&#233;ger recul.
</description>
    </item>
    <item>
      <title>I tested Sentai, the AI voice companion for seniors &#8211; and now I get why it&#8217;s more than just another smart speaker</title>
      <link>https://www.techradar.com/ai-platforms-assistants/i-tested-sentai-the-ai-voice-companion-for-seniors-and-now-i-get-why-its-more-than-just-another-smart-speaker</link>
      <pubDate>Mon, 16 Feb 2026 09:29:48 +0000</pubDate>
      <guid isPermaLink="false">rVfwHFv8xibjzLwSH8T6gL</guid>
      <description>I tested Sentai, a UK-made AI voice companion for seniors, to see whether it&#8217;s genuinely helpful or just another smart speaker &#8212; and the results surprised me.</description>
    </item>
    <item>
      <title>OpenAI has hired the developer behind AI agent OpenClaw</title>
      <link>https://www.engadget.com/ai/openai-has-hired-the-developer-behind-ai-agent-openclaw-092934041.html?src=rss</link>
      <pubDate>Mon, 16 Feb 2026 09:29:34 +0000</pubDate>
      <guid isPermaLink="false">62f36d3c-25e7-47ed-8624-68c9899d2697</guid>
      <description>Recently we were introduced to OpenClaw, an AI that allows users to create their own agents to control apps like email, Spotify and home controls. Now, Sam Altman has announced that OpenAI has absorbed OpenClaw by hiring developer Peter Steinberger "to drive the next generation of personal agents," he wrote on X. Steinberger confirmed the news on his own blog. "I&#8217;m joining OpenAI to work on bringing agents to everyone. OpenClaw will move to a foundation and stay open and independent."&#160;
Steinberger was also in talks to join Meta, with both companies reportedly making offers in the "billions," a...</description>
    </item>
    <item>
      <title>Adieu les taxes &#224; l&#8217;importation : le constructeur chinois Chery va bient&#244;t lancer la production en Espagne de ses SUV hybrides et &#233;lectriques</title>
      <link>https://www.frandroid.com/marques/chery/2978127_adieu-les-taxes-a-limportation-le-constructeur-chinois-chery-va-bientot-lancer-la-production-en-espagne-de-ses-suv-hybrides-et-electriques</link>
      <pubDate>Mon, 16 Feb 2026 09:18:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/chery/2978127_adieu-les-taxes-a-limportation-le-constructeur-chinois-chery-va-bientot-lancer-la-production-en-espagne-de-ses-suv-hybrides-et-electriques</guid>
      <description>
Le constructeur chinois Chery va enfin pouvoir produire ses voitures &#233;lectriques en Espagne. Une bonne nouvelle, car les prix pourraient &#234;tre revus &#224; la baisse pour les clients.
</description>
    </item>
    <item>
      <title>Les arnaques en ligne se propagent au sein des r&#233;sum&#233;s IA de Google, gare aux faux num&#233;ros</title>
      <link>https://www.01net.com/actualites/les-arnaques-en-ligne-se-propagent-au-sein-des-resumes-ia-de-google-gare-aux-faux-numeros.html</link>
      <pubDate>Mon, 16 Feb 2026 09:11:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326048</guid>
      <description>Les AI Overviews de Google sont d&#233;tourn&#233;s par les cybercriminels. Pour propager leurs arnaques en ligne, les pirates inondent les aper&#231;us&#160;IA avec de faux num&#233;ros d'assistance t&#233;l&#233;phonique. L'internaute entre ainsi en contact sans s'en rendre compte avec un escroc qui va chercher &#224; lui soutirer des coordonn&#233;es bancaires&#8230;</description>
    </item>
    <item>
      <title>Decathlon frappe fort et d&#233;gaine un nouveau v&#233;lo cargo &#233;lectrique encore moins cher qu&#8217;avant mais tout aussi complet</title>
      <link>https://www.frandroid.com/marques/decathlon/2978195_decathlon-frappe-fort-et-degaine-un-nouveau-velo-cargo-electrique-encore-moins-cher-quavant-mais-tout-aussi-complet</link>
      <pubDate>Mon, 16 Feb 2026 09:05:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/decathlon/2978195_decathlon-frappe-fort-et-degaine-un-nouveau-velo-cargo-electrique-encore-moins-cher-quavant-mais-tout-aussi-complet</guid>
      <description>
Decathlon commercialise un nouveau v&#233;lo cargo longtail &#233;lectrique, l'E-Three 500, destin&#233; aux familles, avec une batterie de 711 Wh, une capacit&#233; de charge maximale de 209 kg et un prix fix&#233; &#224; 2 499 euros.
</description>
    </item>
    <item>
      <title>Demand for AI-related skills is up 109% since last year. What that means for you</title>
      <link>https://www.fastcompany.com/91492708/demand-for-ai-related-skills-is-up-109-since-last-year-what-that-means-for-you</link>
      <pubDate>2026-02-16T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91492708/demand-for-ai-related-skills-is-up-109-since-last-year-what-that-means-for-you</guid>
      <description>AI is already shaping the kinds of skills employers are seeking, according to a recent report.
AI inspired many employers to take a wait-and-see approach to hiring in 2025, but new data suggest they&#8217;ll be returning to the market in search of certain skills in 2026.</description>
    </item>
    <item>
      <title>5 things to remember on your journey to excellence</title>
      <link>https://www.fastcompany.com/91492999/5-things-to-remember-on-your-journey-to-excellence</link>
      <pubDate>2026-02-16T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91492999/5-things-to-remember-on-your-journey-to-excellence</guid>
      <description>It&#8217;s easy to do great work when everything is clicking, but excellence means being able to deliver even when it&#8217;s not.
Below, Brad Stulberg shares five key insights from his new book,&#160;The Way of Excellence: A Guide to True Greatness and Deep Satisfaction in a Chaotic World.</description>
    </item>
    <item>
      <title>Focal Hadenys : ce casque Hi-Fi ouvert premium est presque &#224; moiti&#233; prix gr&#226;ce &#224; cette offre</title>
      <link>https://www.frandroid.com/bons-plans/2491936_focal-hadenys-ce-casque-hi-fi-ouvert-premium-est-presque-a-moitie-prix-grace-a-cette-offre</link>
      <pubDate>Mon, 16 Feb 2026 08:59:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2491936_focal-hadenys-ce-casque-hi-fi-ouvert-premium-est-presque-a-moitie-prix-grace-a-cette-offre</guid>
      <description>
Le casque Hadenys, con&#231;u par la marque fran&#231;aise Focal, est un mod&#232;le ouvert qui promet notamment un son chaleureux et pr&#233;cis. Habituellement assez on&#233;reuse (comme il est d'usage chez Focal), cette r&#233;f&#233;rence est heureusement beaucoup moins ch&#232;re aujourd'hui : Fnac la propose en effet &#224; 398,97 euros au lieu de 699 euros. 
</description>
    </item>
    <item>
      <title>Pourquoi le c&#233;l&#232;bre volant &#171;&#160;Yoke&#160;&#187; des Tesla va bient&#244;t devenir ill&#233;gal en Chine</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2978089_pourquoi-le-celebre-volant-yoke-des-tesla-va-bientot-devenir-illegal-en-chine</link>
      <pubDate>Mon, 16 Feb 2026 08:52:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2978089_pourquoi-le-celebre-volant-yoke-des-tesla-va-bientot-devenir-illegal-en-chine</guid>
      <description>
Le gouvernement chinois veut d&#233;sormais serrer la vis sur les volants de type &#171;&#160;yoke&#160;&#187; sur les voitures &#233;lectriques. Et cela logiquement pour des raisons de s&#233;curit&#233;.
</description>
    </item>
    <item>
      <title>Sophie Adenot &#224; rejoint la Station spatiale internationale pour une mission de 9 mois</title>
      <link>https://www.futura-sciences.com/sciences/actualites/sophie-adenot-sophie-adenot-rejoint-station-spatiale-internationale-mission-9-mois-131310/#xtor%3DRSS-8</link>
      <pubDate>Mon, 16 Feb 2026 09:49:23 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/sophie-adenot-sophie-adenot-rejoint-station-spatiale-internationale-mission-9-mois-131310/#xtor%3DRSS-8</guid>
      <description>Apr&#232;s un voyage de 34 heures en orbite autour de la Terre, l'&#233;quipage Crew-12 a rejoint la Station spatiale internationale dans la nuit de samedi &#224; dimanche. Pour Sophie Adenot, d&#233;bute une mission de 9 mois &#224; bord du complexe orbital o&#249; l'attend un programme de recherche ambitieux comprenant 36...</description>
    </item>
    <item>
      <title>CarPlay chez Tesla ? Un souci technique d&#8217;Apple Plans et iOS 26 fait obstacle</title>
      <link>https://www.frandroid.com/marques/tesla/2978115_carplay-chez-tesla-un-souci-technique-dapple-plans-et-ios-26-fait-obstacle</link>
      <pubDate>Mon, 16 Feb 2026 08:27:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2978115_carplay-chez-tesla-un-souci-technique-dapple-plans-et-ios-26-fait-obstacle</guid>
      <description>
Tesla veut int&#233;grer CarPlay dans ses voitures, mais un souci concernant Apple Plans sur iOS 26 a retard&#233; ses plans.
</description>
    </item>
  </channel>
</rss>
