<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 14 Jan 2026 10:31:07 GMT</lastBuildDate>
    <item>
      <title>Des Galaxy S25 moins chers et quasi neufs&#160;: Samsung lance son programme &#171;&#160;Reconditionn&#233; Premium&#160;&#187; en France</title>
      <link>https://www.01net.com/actualites/galaxy-s25-moins-chers-quasi-neufs-samsung-lance-programme-reconditionne-premium-france.html</link>
      <pubDate>Wed, 14 Jan 2026 10:20:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319917</guid>
      <description>Samsung lance officiellement son programme de smartphones reconditionn&#233;s en France, d&#8217;abord pour les Galaxy S25. De quoi profiter de smartphones &#171; premium &#187; moins chers, tout en b&#233;n&#233;ficiant de composants d'origine et d'une garantie constructeur compl&#232;te. Mais les prix sont-ils vraiment int&#233;ressants ?</description>
    </item>
    <item>
      <title>Fnac et Darty se montrent tr&#232;s g&#233;n&#233;reux &#224; la 2e d&#233;marque des soldes : les 15 deals &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-vendent-au-rabais-de-nombreux-produits-tech-lors-des-soldes-dhiver-2026</link>
      <pubDate>Wed, 14 Jan 2026 10:13:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-vendent-au-rabais-de-nombreux-produits-tech-lors-des-soldes-dhiver-2026</guid>
      <description>
La 2e d&#233;marque des soldes d'hiver est lanc&#233;e ! Pour l'occasion, Fnac et Darty d&#233;gainent de nouvelles offres, &#224; commencer par un laptop gaming propuls&#233; par une RTX 5080 &#224; -30%, le Samsung Galaxy Edge &#224; prix cass&#233; ou encore un TV Samsung OLED en promo. Il y a de quoi se faire plaisir...
</description>
    </item>
    <item>
      <title>PSStream : l&#8217;application qui fait ce que Sony refuse de proposer sur PC avec les jeux PS5</title>
      <link>https://www.frandroid.com/produits-android/console/console-de-jeux/2942111_psstream-lapplication-qui-fait-ce-que-sony-refuse-de-proposer-sur-pc-avec-les-jeux-ps5</link>
      <pubDate>Wed, 14 Jan 2026 10:12:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/console-de-jeux/2942111_psstream-lapplication-qui-fait-ce-que-sony-refuse-de-proposer-sur-pc-avec-les-jeux-ps5</guid>
      <description>
Vous r&#234;viez de transformer votre Steam Deck en v&#233;ritable console PlayStation ? C'est d&#233;sormais possible. Une application nomm&#233;e PSStream vient de d&#233;barquer sur la plateforme de Valve pour moins de 4 &#8364;. Elle promet de faire ce que Sony r&#233;serve jalousement &#224; son PlayStation Portal : le streaming cloud des jeux PS5.
</description>
    </item>
    <item>
      <title>N3 Ultimate : JMGO muscle sa s&#233;rie N3 pour de tr&#232;s grandes images dans le salon</title>
      <link>https://www.frandroid.com/marques/jmgo/2942131_n3-ultimate-jmgo-muscle-sa-serie-n3-pour-de-tres-grandes-images-dans-le-salon</link>
      <pubDate>Wed, 14 Jan 2026 10:10:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/jmgo/2942131_n3-ultimate-jmgo-muscle-sa-serie-n3-pour-de-tres-grandes-images-dans-le-salon</guid>
      <description>
Pr&#233;sent&#233; en avant&#8209;premi&#232;re au CES 2026, le JMGO N3 Ultimate annonce un projecteur laser 4K tr&#232;s lumineux, taill&#233; pour des images jusqu&#8217;&#224; 300 pouces et un lancement pr&#233;vu au deuxi&#232;me trimestre 2026.
</description>
    </item>
    <item>
      <title>Cette montre aux airs d&#8217;Apple Watch Ultra promet deux semaines d&#8217;autonomie pour un prix vraiment accessible</title>
      <link>https://www.frandroid.com/marques/realme/2810415_cette-montre-connectee-a-des-allure-dapple-watch-ultra-mais-avec-deux-semaines-dautonomie-et-un-prix-bien-plus-accessible</link>
      <pubDate>Wed, 14 Jan 2026 10:05:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/realme/2810415_cette-montre-connectee-a-des-allure-dapple-watch-ultra-mais-avec-deux-semaines-dautonomie-et-un-prix-bien-plus-accessible</guid>
      <description>
Realme a lev&#233; le voile cette semaine sur sa nouvelle montre connect&#233;e, la Realme Watch 5, une montre au look d'Apple Watch Ultra pour dix fois moins cher
</description>
    </item>
    <item>
      <title>Samsung muscle son Galaxy A07 5G avec 6 ans de mises &#224; jour et une batterie g&#233;ante pour un prix d&#233;risoire</title>
      <link>https://www.frandroid.com/marques/samsung/2941909_samsung-muscle-son-galaxy-a07-5g-avec-6-ans-de-mises-a-jour-et-une-batterie-geante-pour-un-prix-derisoire</link>
      <pubDate>Wed, 14 Jan 2026 10:01:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2941909_samsung-muscle-son-galaxy-a07-5g-avec-6-ans-de-mises-a-jour-et-une-batterie-geante-pour-un-prix-derisoire</guid>
      <description>
Le futur Samsung Galaxy A07 5G ne semble plus avoir beaucoup de secrets. Android Authority a mis la main sur son support marketing. Au programme : une long&#233;vit&#233; logicielle record de 6 ans et des caract&#233;ristiques techniques en nette hausse.
</description>
    </item>
    <item>
      <title>The best USB-C hub for 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-usb-c-hub-120051833.html?src=rss</link>
      <pubDate>Wed, 14 Jan 2026 10:01:25 +0000</pubDate>
      <guid isPermaLink="false">5611e47c-9ecd-44d1-bf4d-bb3708b5554e</guid>
      <description>Having fewer ports makes laptops and tablets lighter and more affordable &#8212; but that also cuts down on your connectivity options. If you&#8217;ve got a MacBook Air, a slim Chromebook or a tablet you&#8217;d like to get more utility out of, a USB-C hub can help. Using just a single port on your device, these multiport adapters will let you hook up screens, tap into Ethernet cables, connect mice and keyboards, and transfer data to drives and memory cards. Most also give you a way to power your device through the hub to maximize port availability. We tested over a dozen models to come up with picks for every ...</description>
    </item>
    <item>
      <title>Piratage des IBAN : Free &#233;cope d&#8217;une amende de 42 millions d&#8217;euros</title>
      <link>https://www.frandroid.com/marques/free/2941993_piratage-des-iban-free-ecope-dune-amende-de-42-millions-deuros</link>
      <pubDate>Wed, 14 Jan 2026 10:01:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2941993_piratage-des-iban-free-ecope-dune-amende-de-42-millions-deuros</guid>
      <description>
Apr&#232;s le piratage massif de 2024, et pour avoir mal s&#233;curis&#233; les donn&#233;es de ses clients, Free &#233;cope d'une amende record de 42 millions d'euros.
</description>
    </item>
    <item>
      <title>&#171; La course aux caract&#233;ristiques techniques est finie &#187; : Carl Pei, co-fondateur de Nothing, alerte sur la situation du march&#233; des smartphones</title>
      <link>https://www.frandroid.com/marques/2941773_la-course-aux-caracteristiques-techniques-est-finie-dapres-le-patron-de-nothing-les-prix-des-smartphones-vont-exploser-de-30-en-2026</link>
      <pubDate>Wed, 14 Jan 2026 10:00:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2941773_la-course-aux-caracteristiques-techniques-est-finie-dapres-le-patron-de-nothing-les-prix-des-smartphones-vont-exploser-de-30-en-2026</guid>
      <description>
Carl Pei, le patron de Nothing, a &#233;galement pris la parole concernant la p&#233;nurie de m&#233;moire vive : 2026 sera l'ann&#233;e o&#249; les smartphones cesseront d'&#234;tre "abordables". La cause ? Une explosion des co&#251;ts de la m&#233;moire, aspir&#233;e par les serveurs de l'IA, qui pourrait faire grimper la facture de 30 % selon lui.
</description>
    </item>
    <item>
      <title>7 Best Phones You Can&#8217;t Buy in the US (2026), Tested and Reviewed</title>
      <link>https://www.wired.com/gallery/best-phones-you-cant-buy-in-the-united-states/</link>
      <pubDate>Wed, 14 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">67cac20bb1ef86e09d408a9e</guid>
      <description>Wondering what you&#8217;re missing out on? Here are our favorite smartphones that aren&#8217;t officially sold stateside but are available in markets like the UK and Europe.</description>
    </item>
    <item>
      <title>&#171; Une nouvelle r&#233;f&#233;rence &#187; : BMW fait fort avec sa nouvelle voiture &#233;lectrique &#224; 4 moteurs et fausse bo&#238;te de vitesses</title>
      <link>https://www.frandroid.com/marques/bmw/2941917_une-nouvelle-reference-bmw-fait-fort-avec-sa-nouvelle-voiture-electrique-a-4-moteurs-et-fausse-boite-de-vitesses</link>
      <pubDate>Wed, 14 Jan 2026 09:59:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bmw/2941917_une-nouvelle-reference-bmw-fait-fort-avec-sa-nouvelle-voiture-electrique-a-4-moteurs-et-fausse-boite-de-vitesses</guid>
      <description>
Pr&#233;vue en 2027, la future BMW M Neue Klasse commence &#224; nous donner quelques informations &#224; son sujet. Dot&#233;e de quatre moteurs et d'une fausse bo&#238;te de vitesses, la nouvelle voiture &#233;lectrique ultra-performante promet de d&#233;coiffer.
</description>
    </item>
    <item>
      <title>D&#233;brief CES 2026, l&#8217;iPhone Fold imprim&#233; en 3D et nos astuces pour choisir sa box Internet : gros programme pour l&#8217;Unlock Talk du jour</title>
      <link>https://www.frandroid.com/humanoid/emissions/2942045_debrief-ces-2026-liphone-fold-imprime-en-3d-et-nos-astuces-pour-choisir-sa-box-internet-gros-programme-pour-lunlock-talk-du-jour</link>
      <pubDate>Wed, 14 Jan 2026 09:58:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/emissions/2942045_debrief-ces-2026-liphone-fold-imprime-en-3d-et-nos-astuces-pour-choisir-sa-box-internet-gros-programme-pour-lunlock-talk-du-jour</guid>
      <description>
Rendez-vous ce mercredi 14 janvier &#224; partir de 17h sur notre cha&#238;ne Twitch Frandroidlive pour suivre la 41e &#233;dition d&#8217;Unlock Talk. Au menu du jour : un gros d&#233;brief du CES 2026, l&#8217;affaire Netflix-Warner, l&#8217;iPhone Fold et nos astuces pour bien choisir votre box Internet.
</description>
    </item>
    <item>
      <title>Apple Intelligence : on sait comment Gemini sera int&#233;gr&#233; dans Siri sans laisser de traces</title>
      <link>https://www.frandroid.com/marques/apple/2941769_apple-intelligence-comment-gemini-va-transformer-siri-sans-laisser-de-traces</link>
      <pubDate>Wed, 14 Jan 2026 09:51:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2941769_apple-intelligence-comment-gemini-va-transformer-siri-sans-laisser-de-traces</guid>
      <description>
On commence enfin &#224; y voir clair dans le deal entre Apple et Google. On pensait que Siri allait devenir un simple clone de Gemini, mais la r&#233;alit&#233; est bien plus maligne. Apple va utiliser la puissance de Google tout en effa&#231;ant m&#233;thodiquement son nom de l'interface. 
</description>
    </item>
    <item>
      <title>Cette marque d&#8217;aspirateurs robots compte bien concurrencer GoPro, DJI et Insta360 sur les cam&#233;ras d&#8217;action avec un mod&#232;le 8K</title>
      <link>https://www.frandroid.com/marques/dreame/2941879_cette-marque-daspirateurs-robots-compte-bien-concurrencer-gopro-dji-et-insta360-sur-les-cameras-daction-avec-un-modele-8k</link>
      <pubDate>Wed, 14 Jan 2026 09:50:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dreame/2941879_cette-marque-daspirateurs-robots-compte-bien-concurrencer-gopro-dji-et-insta360-sur-les-cameras-daction-avec-un-modele-8k</guid>
      <description>
Dreame a d&#233;voil&#233; une cam&#233;ra d'action modulaire capable de se fixer magn&#233;tiquement et de filmer des s&#233;quences jusqu'en 8K.
</description>
    </item>
    <item>
      <title>Google Photos : enfin vos sauvegardes ne vont plus vider votre batterie gr&#226;ce &#224; cette option</title>
      <link>https://www.frandroid.com/marques/google/2941929_google-photos-vos-sauvegardes-ne-vont-enfin-plus-vider-votre-batterie-grace-a-cette-option</link>
      <pubDate>Wed, 14 Jan 2026 09:50:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2941929_google-photos-vos-sauvegardes-ne-vont-enfin-plus-vider-votre-batterie-grace-a-cette-option</guid>
      <description>
La sauvegarde sur Google Photos pourrait bient&#244;t vous prendre moins de batterie avec cette nouvelle option.
</description>
    </item>
    <item>
      <title>Ce lot de quatre barres lumineuses Philips Hue Play est presque &#224; moiti&#233; prix pour les soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2852833_ce-lot-de-quatre-barres-lumineuses-philips-hue-play-est-presque-a-moitie-prix-pour-les-soldes-dhiver</link>
      <pubDate>Wed, 14 Jan 2026 09:48:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2852833_ce-lot-de-quatre-barres-lumineuses-philips-hue-play-est-presque-a-moitie-prix-pour-les-soldes-dhiver</guid>
      <description>
Les Philips Hue Play sont des barres lumineuses id&#233;ales pour apporter une petite touche color&#233;e &#224; une pi&#232;ce ou &#224; un setup gaming. Pour les soldes d'hiver 2026, Fnac et Darty proposent un pack de quatre &#224; 159,99 euros au lieu de 279,99 euros.
</description>
    </item>
    <item>
      <title>Voitures &#233;lectriques : la carte du monde se coupe en deux, et c&#8217;est une question de politique</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2941971_voitures-electriques-la-carte-du-monde-se-coupe-en-deux-et-cest-une-question-de-politique</link>
      <pubDate>Wed, 14 Jan 2026 09:45:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2941971_voitures-electriques-la-carte-du-monde-se-coupe-en-deux-et-cest-une-question-de-politique</guid>
      <description>
20,7 millions de v&#233;hicules. C'est le score final des ventes &#233;lectriques mondiales en 2025. Une croissance de 20 % qui cache pourtant une r&#233;alit&#233; brutale : pour la premi&#232;re fois, le march&#233; nord-am&#233;ricain d&#233;croche sous les coups de boutoir de la nouvelle administration Trump.
</description>
    </item>
    <item>
      <title>Could this be the best value phone of 2026? Get the Google Pixel 10 for a record-low price at Amazon &#8212; but it's selling out fast</title>
      <link>https://www.techradar.com/phones/google-pixel-phones/could-this-be-the-best-value-phone-of-2026-get-the-google-pixel-10-for-a-record-low-price-at-amazon-but-its-selling-out-fast</link>
      <pubDate>Wed, 14 Jan 2026 09:45:12 +0000</pubDate>
      <guid isPermaLink="false">grLEnBatj9F8UHpFNjWV7K</guid>
      <description>The Google Pixel 10 plummets to a record-low price of under &#163;600 in this limited-time deal at Amazon &#8212; but you'll need to move fast as it's already over 50% sold out.</description>
    </item>
    <item>
      <title>Batterie solide : l&#8217;Europe contre-attaque face &#224; la Chine avec cette alliance in&#233;dite</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2941815_batterie-solide-leurope-contre-attaque-face-a-la-chine-avec-cette-alliance-inedite</link>
      <pubDate>Wed, 14 Jan 2026 09:40:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2941815_batterie-solide-leurope-contre-attaque-face-a-la-chine-avec-cette-alliance-inedite</guid>
      <description>
Deux entreprises europ&#233;ennes s&#8217;associent afin de d&#233;velopper des batteries solides con&#231;ues sur le Vieux Continent. Le but&#160;? D&#233;marrer la production &#224; partir de 2030.
</description>
    </item>
    <item>
      <title>Mandat d&#8217;arr&#234;t contre le PDG de OnePlus&#160;: de quoi Ta&#239;wan accuse Pete Lau&#160;?</title>
      <link>https://www.01net.com/actualites/mandat-darret-contre-pdg-de-oneplus-taiwan-accuse-pete-lau.html</link>
      <pubDate>Wed, 14 Jan 2026 09:39:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319931</guid>
      <description>Un mandat d'arr&#234;t a &#233;t&#233; &#233;mis par Taiwan &#224; l'encontre de Pete Lau, le cofondateur et PDG de OnePlus. L'entrepreneur chinois est accus&#233; d&#8217;avoir recrut&#233; ill&#233;galement plus de 70 ing&#233;nieurs ta&#239;wanais via des soci&#233;t&#233;s &#233;cran, en violation avec la loi en vigueur &#224; Taiwan.</description>
    </item>
    <item>
      <title>Google Traduction pourrait bient&#244;t profiter de sa plus importante mise &#224; jour</title>
      <link>https://www.01net.com/actualites/google-traduction-pourrait-bientot-profiter-de-sa-plus-importante-mise-a-jour.html</link>
      <pubDate>Wed, 14 Jan 2026 09:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319934</guid>
      <description>Google serait en train de pr&#233;parer une des plus importantes mises &#224; jour pour son application de traduction.</description>
    </item>
    <item>
      <title>What Taoism can teach us about learning in the age of AI</title>
      <link>https://www.fastcompany.com/91470166/taoism-learning-age-of-ai</link>
      <pubDate>2026-01-14T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91470166/taoism-learning-age-of-ai</guid>
      <description>5 ancient principles that are as relevant today as they ever were.
As our attention spans and cognitive abilities are increasingly damaged by digital overuse and AI-mediated shortcuts, the ability to focus deeply and learn something in depth is quickly becoming a critical skill.&#160;</description>
    </item>
    <item>
      <title>Avec Chrome 144, Google corrige 10 failles, dont 6 vuln&#233;rabilit&#233;s du moteur V8</title>
      <link>https://www.01net.com/actualites/avec-chrome-144-google-corrige-10-failles-moteur-v8.html</link>
      <pubDate>Wed, 14 Jan 2026 08:55:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319914</guid>
      <description>Chrome 144 est en cours de d&#233;ploiement. La mise &#224; jour colmate dix failles de s&#233;curit&#233;, dont six rien que dans le moteur JavaScript V8. Parmi elles, une vuln&#233;rabilit&#233; d&#8217;acc&#232;s m&#233;moire qui permet de voler des donn&#233;es.</description>
    </item>
    <item>
      <title>Free &#233;cope d&#8217;une amende sal&#233;e apr&#232;s la cyberattaque d&#8217;octobre 2024</title>
      <link>https://www.01net.com/actualites/free-ecope-dune-amende-salee-apres-la-cyberattaque-doctobre-2024.html</link>
      <pubDate>Wed, 14 Jan 2026 08:48:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319916</guid>
      <description>Apr&#232;s la cyberattaque d'octobre 2024 qui a touch&#233; 24 millions d'abonn&#233;s, le gendarme fran&#231;ais de la vie priv&#233;e a sanctionn&#233; Free d'une amende de 42 millions d'euros. Contact&#233; par 01net.com, l'op&#233;rateur, qui conteste la d&#233;cision d&#233;crite comme &#171; d'une s&#233;v&#233;rit&#233; in&#233;dite &#187;, indique qu'il fera appel.</description>
    </item>
  </channel>
</rss>
