<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 26 Dec 2025 10:27:05 GMT</lastBuildDate>
    <item>
      <title>&#171;&#160;D&#233;sol&#233;, mais nous n&#8217;allons pas revenir sur notre r&#233;glementation&#160;&#187; sur le Num&#233;rique, tacle la num&#233;ro 2 de Bruxelles</title>
      <link>https://www.01net.com/actualites/desole-mais-nous-nallons-pas-revenir-sur-notre-reglementation-sur-le-numerique-tacle-la-numero-2-de-bruxelles.html</link>
      <pubDate>Fri, 26 Dec 2025 10:05:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317281</guid>
      <description>Pour Teresa Ribera, la Commissaire europ&#233;enne charg&#233;e de la Concurrence, l'Union europ&#233;enne doit &#233;couter, mais ne jamais c&#233;der aux exigences de l'administration am&#233;ricaine.</description>
    </item>
    <item>
      <title>Xiaomi 17 Ultra : une bonne et une mauvaise nouvelle pour la France</title>
      <link>https://www.frandroid.com/marques/xiaomi/2921101_xiaomi-17-ultra-une-bonne-et-une-mauvaise-nouvelle-pour-la-france</link>
      <pubDate>Fri, 26 Dec 2025 10:01:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2921101_xiaomi-17-ultra-une-bonne-et-une-mauvaise-nouvelle-pour-la-france</guid>
      <description>
On a de tr&#232;s bonnes raisons d'esp&#233;rer une sortie du Xiaomi 17 Ultra en France, mais comme pour son pr&#233;d&#233;cesseur, un compromis serait fait sur la batterie.
</description>
    </item>
    <item>
      <title>The best SSDs for PS5 in 2026</title>
      <link>https://www.engadget.com/gaming/playstation/best-ssd-for-ps5-130004175.html?src=rss</link>
      <pubDate>Fri, 26 Dec 2025 10:00:35 +0000</pubDate>
      <guid isPermaLink="false">e75133dc-8c16-459b-9bf8-6f3892cd7c77</guid>
      <description>Storage fills up fast on a PS5, especially when a single game can take up as much space as an entire last-gen library. Adding moreSSD space is the easiest way to stop playing Tetris with your installs, and once it is set up, your console loads games just as quickly as it does from the built-in drive. It is a small upgrade that makes a big difference if you jump between several titles at once.The tricky part is knowing which SSDs actually work with the PS5. You need a drive that meets Sony&#8217;s speed requirements and stays cool under long play sessions. Some models include a heatsink, while others...</description>
    </item>
    <item>
      <title>Massive Boxing Day sale is live at Amazon UK &#8212; here are the 27 best deals picked by a shopping expert</title>
      <link>https://www.techradar.com/seasonal-sales/massive-boxing-day-sale-is-live-at-amazon-uk-here-are-the-27-best-deals-picked-by-a-shopping-expert</link>
      <pubDate>Fri, 26 Dec 2025 10:00:18 +0000</pubDate>
      <guid isPermaLink="false">TW7SDRh3FvrbDFj9tAA4wD</guid>
      <description>I've searched through the Boxing Day sale at Amazon UK and hand-picked the 27 best deals on appliances, laptops, TVs, and more top tech.</description>
    </item>
    <item>
      <title>More Than 50 People Became AI Billionaires in 2025</title>
      <link>https://gizmodo.com/more-than-50-people-became-ai-billionaires-in-2025-2000703396</link>
      <pubDate>Fri, 26 Dec 2025 10:00:03 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703396</guid>
      <description>AI hype has lost its luster, but a lot of AI people are super rich now.</description>
    </item>
    <item>
      <title>Samsung Galaxy Z Flip 7 vs Samsung Galaxy Z Flip 6&#160;: comment choisir le meilleur smartphone pliant &#224; clapet&#160;?</title>
      <link>https://www.frandroid.com/versus/2762871_samsung-galaxy-z-flip-7-vs-samsung-galaxy-z-flip-6-comment-choisir-le-meilleur-smartphone-pliant-a-clapet</link>
      <pubDate>Fri, 26 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/versus/2762871_samsung-galaxy-z-flip-7-vs-samsung-galaxy-z-flip-6-comment-choisir-le-meilleur-smartphone-pliant-a-clapet</guid>
      <description>
Les Z Flip de chez Samsung sont les smartphones pliants les plus vendus au monde. Proposant un entre-deux original entre les smartphones et les t&#233;l&#233;phones &#224; clapet des ann&#233;es 2000, ils s&#233;duisent tout type de public. Alors comment s'en sort le Samsung Galaxy Z Flip 7 par rapport &#224; son pr&#233;d&#233;cesseur&#160;?
</description>
    </item>
    <item>
      <title>Un syst&#232;me de Garmin fait atterrir un avion sans pilote</title>
      <link>https://www.01net.com/actualites/un-systeme-de-garmin-fait-atterrir-un-avion-sans-pilote.html</link>
      <pubDate>Fri, 26 Dec 2025 09:36:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317307</guid>
      <description>Un avion l&#233;ger en situation d'urgence a pu compter sur le syst&#232;me Autoland de Garmin pour effectuer un atterrissage sans intervention ses pilotes.</description>
    </item>
    <item>
      <title>Xiaomi's 17 Ultra Leica Edition smartphone comes with a manual zoom ring</title>
      <link>https://www.engadget.com/mobile/smartphones/xiaomis-17-ultra-leica-edition-smartphone-comes-with-a-manual-zoom-ring-093502893.html?src=rss</link>
      <pubDate>Fri, 26 Dec 2025 09:35:02 +0000</pubDate>
      <guid isPermaLink="false">d606a47e-5a7a-4677-845a-45a0f7212978</guid>
      <description>Xiaomi just launched its flagship 17 Ultra by Leica phone that may make you feel bad about your current device's cameras. Naturally it's a spec monster, with a 1-inch sensor 50MP f/1.67 main camera and 1/1.4-inch 200MP periscope telephoto camera. But it also offers an interesting new mechanical feature: a manual zoom ring that also activates the camera automatically when you rotate it.
Both the regular Xiaomi 17 Ultra and Leica edition come with a Snapdragon 8 Elite Gen 5 SoC with up to 16GB of LPDDR5X RAM and 1TB of UFS 4.1 storage, along with a 6.9-inch 120Hz AMOLED display that can hit up t...</description>
    </item>
    <item>
      <title>Boulanger casse le prix du Google Pixel 10 Pro, en pack avec ses chargeurs 67 W et sans fil PixelSnap 25 W</title>
      <link>https://www.frandroid.com/bons-plans/2872893_boulanger-casse-le-prix-du-google-pixel-10-pro-en-pack-avec-ses-chargeurs-67-w-et-sans-fil-pixelsnap-25-w</link>
      <pubDate>Fri, 26 Dec 2025 09:22:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2872893_boulanger-casse-le-prix-du-google-pixel-10-pro-en-pack-avec-ses-chargeurs-67-w-et-sans-fil-pixelsnap-25-w</guid>
      <description>
Le Google Pixel 10 Pro d&#233;barque dans un bundle qui booste. &#192; l&#8217;int&#233;rieur : tout ce qu&#8217;il faut pour le recharger comme il faut, en rapide et m&#234;me en sans fil gr&#226;ce &#224; la nouveaut&#233; PixelSnap. Avec une offre de reprise, l&#8217;ensemble tombe &#224; 799 euros.
</description>
    </item>
    <item>
      <title>Gmail&#160;: Google annonce la nouveaut&#233; qu&#8217;on attend depuis 20 ans</title>
      <link>https://www.01net.com/actualites/gmail-google-annonce-nouveaute-on-attend-depuis-20-ans.html</link>
      <pubDate>Fri, 26 Dec 2025 09:15:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317290</guid>
      <description>Gmail s&#8217;appr&#234;te &#224; lever l'une des plus grosses frustrations de ses utilisateurs. Pour la premi&#232;re fois, il va devenir possible de modifier son adresse @gmail.com sans devoir cr&#233;er un nouveau compte. Ce changement s'accompagne d'une s&#233;rie de restrictions.</description>
    </item>
    <item>
      <title>What to do if your robot vacuum keeps losing connection: 6 tips to fix it</title>
      <link>https://www.techradar.com/home/robot-vacuums/what-to-do-if-your-robot-vacuum-keeps-losing-connection</link>
      <pubDate>Fri, 26 Dec 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">9ab23gvaRj6AfpUGdULiG7</guid>
      <description>It's one of the most frustrating problems you can experience with your robot vacuums &#8211; here's how to restore your connection.</description>
    </item>
    <item>
      <title>Why there are so many successful family businesses</title>
      <link>https://www.fastcompany.com/91452433/family-businesses-win-without-fighting</link>
      <pubDate>2025-12-26T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91452433/family-businesses-win-without-fighting</guid>
      <description>Research shows family businesses are uniquely skilled at keeping competitors out of their market space&#8212;often without actually competing with them.
When you hear the phrase &#8220;family business,&#8221; you might think of the backstabbing Roys of Succession or the dysfunctional Duttons of Yellowstone. But while TV&#8217;s family companies are entertaining, their real-life counterparts may be even more compelling....</description>
    </item>
    <item>
      <title>&#171; Il faut toujours des boutons physiques &#187; : le patron du design de Stellantis nous explique comment il compte se diff&#233;rencier de Tesla et des marques chinoises</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2915311_il-faut-toujours-des-boutons-physiques-le-patron-du-design-de-stellantis-nous-explique-comment-il-compte-se-differencier-de-tesla-et-des-marques-chinoises</link>
      <pubDate>Fri, 26 Dec 2025 08:54:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2915311_il-faut-toujours-des-boutons-physiques-le-patron-du-design-de-stellantis-nous-explique-comment-il-compte-se-differencier-de-tesla-et-des-marques-chinoises</guid>
      <description>
Nous avons rencontr&#233; Gilles Vidal, le nouveau patron du design des marques europ&#233;ennes de Stellantis, pour conna&#238;tre sa vision du futur de l'automobile. Apr&#232;s l'int&#233;r&#234;t de l'intelligence artificielle et l'&#233;volution des silhouettes des voitures &#233;lectriques, nous avons &#233;chang&#233; sur les &#233;volutions des habitacles et des planches de bord en cette p&#233;riode propices aux &#233;crans. Voici ce que nous avons appris.
...</description>
    </item>
    <item>
      <title>Le Xiaomi 17 Ultra est l&#224; avec une recette implacable : zoom optique d&#233;ment et batterie immense</title>
      <link>https://www.frandroid.com/marques/xiaomi/2921065_le-xiaomi-17-ultra-est-la-avec-une-recette-implacable-zoom-optique-dement-et-batterie-immense</link>
      <pubDate>Fri, 26 Dec 2025 08:46:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2921065_le-xiaomi-17-ultra-est-la-avec-une-recette-implacable-zoom-optique-dement-et-batterie-immense</guid>
      <description>
Voici le Xiaomi 17 Ultra, un smartphone haut de gamme avec un t&#233;l&#233;objectif p&#233;riscopique de 200 Mpx et une batterie immense de 6800 mAh.
</description>
    </item>
    <item>
      <title>15 accidents mortels en Tesla et toujours la m&#234;me cause&#160;: une enqu&#234;te accuse un &#233;quipement des voitures</title>
      <link>https://www.01net.com/actualites/15-accidents-mortels-en-tesla-et-toujours-la-meme-cause-une-enquete-accuse-un-equipement-des-voitures.html</link>
      <pubDate>Fri, 26 Dec 2025 08:35:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317287</guid>
      <description>Souvent reconnues pour leur grande s&#233;curit&#233; sur la route, et leur propension &#224; faire baisser le nombre d&#8217;accidents par kilom&#232;tres parcourus, les Tesla auraient pourtant un d&#233;faut majeur en cas d&#8217;accident.

Selon une enqu&#234;te men&#233;e par le tr&#232;s s&#233;rieux Bloomberg, les v&#233;hicules &#233;lectriques de Tesla auraient un s&#233;rieux souci en mati&#232;re de gestion post impact. L&#8217;analyse a port&#233; sur les accidents mortels ayant eu lieu en Tesla, aux &#201;tats-Unis, et si les causes de d&#233;c&#232;s peuvent &#234;tre multifactorielles, un &#233;l&#233;ment revient dans 15 accidents mortels : le blocage des portes. Autrement dit, apr&#232;s l&#8217;accident...</description>
    </item>
  </channel>
</rss>
