<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 11 Dec 2025 10:30:02 GMT</lastBuildDate>
    <item>
      <title>Finalize your trip to Japan with Jetpac eSIM- claim a 15% discount code valid on all Japan plans</title>
      <link>https://www.techradar.com/pro/finalize-your-trip-to-japan-with-jetpac-esim-claim-a-15-percent-discount-code-valid-on-all-japan-plans</link>
      <pubDate>Thu, 11 Dec 2025 10:26:14 +0000</pubDate>
      <guid isPermaLink="false">WNQHTJaQdajv3cUvSLFrLC</guid>
      <description>Jetpac is known for its ease of use, strong connection speeds, extensive global coverage in 200+ destinations, and intuitive app.</description>
    </item>
    <item>
      <title>Apr&#232;s le retrait de Bosch, le plus grand salon v&#233;lo d&#8217;Europe change radicalement de strat&#233;gie et tend une nouvelle fois la main aux marques</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2906295_apres-le-retrait-de-bosch-le-plus-grand-salon-velo-deurope-change-radicalement-de-strategie-et-tend-une-nouvelle-fois-la-main-aux-marques</link>
      <pubDate>Thu, 11 Dec 2025 10:12:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2906295_apres-le-retrait-de-bosch-le-plus-grand-salon-velo-deurope-change-radicalement-de-strategie-et-tend-une-nouvelle-fois-la-main-aux-marques</guid>
      <description>
Eurobike ouvre un appel &#224; contributions pour l&#8217;&#233;dition 2026 alors que le salon traverse une crise majeure. L&#8217;objectif ici est de donner l&#8217;opportunit&#233; aux marques de sugg&#233;rer des sujets et des intervenants pour l&#8217;&#233;v&#233;nement.
</description>
    </item>
    <item>
      <title>Warner Bros. admet que l&#8217;accord avec Netflix pourrait &#234;tre annul&#233;, si Paramount Skydance met quelques milliards en plus</title>
      <link>https://www.frandroid.com/services/svod/2906133_warner-bros-admet-que-laccord-avec-netflix-pourrait-etre-annule-si-paramount-skydance-met-quelques-milliards-en-plus</link>
      <pubDate>Thu, 11 Dec 2025 10:11:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2906133_warner-bros-admet-que-laccord-avec-netflix-pourrait-etre-annule-si-paramount-skydance-met-quelques-milliards-en-plus</guid>
      <description>
Le deal entre Warner Bros. Discovery et Netflix pourrait capoter plus rapidement qu'on ne le pensait, et c'est David Zaslav qui en fait l'aveu. Le PDG du conglom&#233;rat a effectivement annonc&#233; que l'accord de vente pouvait &#234;tre annul&#233; &#224; condition que Paramount mette encore un peu la main &#224; la poche.
</description>
    </item>
    <item>
      <title>La cl&#233; de voiture sur smartphone se g&#233;n&#233;ralise : la preuve avec Samsung et Porsche</title>
      <link>https://www.frandroid.com/marques/porsche/2906229_la-cle-de-voiture-sur-smartphone-se-generalise-la-preuve-avec-samsung-et-porsche</link>
      <pubDate>Thu, 11 Dec 2025 10:09:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/porsche/2906229_la-cle-de-voiture-sur-smartphone-se-generalise-la-preuve-avec-samsung-et-porsche</guid>
      <description>
Les nouvelles voitures &#233;lectriques de Porsche deviennent compatibles avec la cl&#233; num&#233;rique des smartphones Samsung. De quoi d&#233;verrouiller les Macan et Cayenne avec son Galaxy et partager leur acc&#232;s &#224; des contacts d'un geste.
</description>
    </item>
    <item>
      <title>Google Pixel 10a : pourquoi vous n&#8217;avez sans doute aucune raison de l&#8217;attendre</title>
      <link>https://www.frandroid.com/marques/google/2906225_google-pixel-10a-pourquoi-vous-navez-sans-doute-aucune-raison-de-lattendre</link>
      <pubDate>Thu, 11 Dec 2025 10:07:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2906225_google-pixel-10a-pourquoi-vous-navez-sans-doute-aucune-raison-de-lattendre</guid>
      <description>
Une r&#233;cente fuite sur le Pixel 10a semble r&#233;v&#233;ler une triste nouvelle : le t&#233;l&#233;phone reprendrait &#224; l'identique la fiche technique du Pixel 9a de cette ann&#233;e.
</description>
    </item>
    <item>
      <title>Tim Cook en croisade contre la v&#233;rification d&#8217;&#226;ge obligatoire sur l&#8217;App Store</title>
      <link>https://www.01net.com/actualites/tim-cook-en-croisade-contre-la-verification-dage-obligatoire-sur-lapp-store.html</link>
      <pubDate>Thu, 11 Dec 2025 10:02:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314986</guid>
      <description>Apple ne veut pas prendre la responsabilit&#233; de la v&#233;rification de l&#8217;&#226;ge des utilisateurs de l&#8217;App Store. Tim Cook a pris son b&#226;ton de p&#232;lerin pour batailler contre un projet de loi qui imposerait une telle mesure au niveau national aux &#201;tats-Unis.</description>
    </item>
    <item>
      <title>The best noise-canceling headphones for 2025</title>
      <link>https://www.engadget.com/audio/headphones/best-noise-canceling-headphones-130029881.html?src=rss</link>
      <pubDate>Thu, 11 Dec 2025 10:00:35 +0000</pubDate>
      <guid isPermaLink="false">5de7a513-2989-4305-b9a9-0cf68ac17136</guid>
      <description>Noise is hard to escape, whether it&#8217;s the hum of traffic, the buzz of a busy office or the neighbor&#8217;s lawn mower starting up right when you need to focus. That&#8217;s where noise-canceling headphones earn their keep. A good pair doesn&#8217;t just quiet the world around you, it creates a pocket of calm so you can actually enjoy your music, podcasts or peace and quiet.Modern noise-canceling headphones have come a long way, combining powerful ANC with clearer sound, longer battery life and smarter features like adaptive modes and multipoint connectivity. Some emphasize comfort for long flights, while other...</description>
    </item>
    <item>
      <title>Uber Reportedly Downplaying EV Incentives for Drivers As It Prepares to Miss Emissions Goals</title>
      <link>https://gizmodo.com/uber-reportedly-downplaying-ev-incentives-for-drivers-as-it-prepares-to-miss-emissions-goals-2000698087</link>
      <pubDate>Thu, 11 Dec 2025 10:00:03 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000698087</guid>
      <description>Trump 2.0 has been hard on EV adoption. Uber is just one more example.</description>
    </item>
    <item>
      <title>OpenAI turns 10 today. Where will it be in another decade?</title>
      <link>https://www.fastcompany.com/91447143/openai-anniversary-sam-altman-chatgpt</link>
      <pubDate>2025-12-11T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91447143/openai-anniversary-sam-altman-chatgpt</guid>
      <description>A shock announcement at an academic conference led to one of the most important companies on the planet. But what&#8217;s next?
On December 11, 2015, OpenAI arrived on the scene with a bang. Announced on the penultimate day of the Conference on Neural Information Processing Systems, an academic confab held in Montreal&#8217;s Palais des Congr&#232;s by Elon Musk, Sam Altman, and others, the organization had been in the planning for months (an infamous July 2015 meeting at the Rosewood Sand Hill Hotel brought on board many of OpenAI&#8217;s key early staffers)....</description>
    </item>
    <item>
      <title>The hardest startup in America</title>
      <link>https://www.fastcompany.com/91448561/this-is-the-hardest-startup-in-america</link>
      <pubDate>2025-12-11T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448561/this-is-the-hardest-startup-in-america</guid>
      <description>Augustus Doricko&#8217;s Rainmaker uses cloud seeding tech to bring rain where it&#8217;s needed. In the process, he&#8217;s been swept up in a storm of controversy involving accusations that he&#8217;s playing God, an agent of the deep state, and worse. 
Augustus Doricko, founder and CEO of cloud-seeding startup Rainmaker, surveys the sky from a sunbaked hillside 5 miles from Utah&#8217;s Great Salt Lake. On this balmy Sunday afternoon in late September, the lake is calm, but its serenity belies a potentially catastrophic problem: The Great Salt Lake is shrinking&#8212;and is at risk of disappearing altogether....</description>
    </item>
    <item>
      <title>Is it really so bad to be fake at work?</title>
      <link>https://www.fastcompany.com/91453568/fake-at-work-strategic-authenticity</link>
      <pubDate>2025-12-11T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91453568/fake-at-work-strategic-authenticity</guid>
      <description>In fact, total honesty is not a virtue, but a hazard.
Faking tends to get a bad rap. We celebrate authenticity, praise, and honesty, and preach radical transparency&#8212;as if the workplace would magically improve if everyone walked around expressing their unfiltered &#8220;true selves.&#8221;</description>
    </item>
    <item>
      <title>This startup is building a network of home batteries to help solve the grid&#8217;s woes</title>
      <link>https://www.fastcompany.com/91458082/this-startup-is-building-a-network-of-home-batteries-to-help-solve-the-grids-woes</link>
      <pubDate>2025-12-11T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91458082/this-startup-is-building-a-network-of-home-batteries-to-help-solve-the-grids-woes</guid>
      <description>Haven works with homeowners to freely installs batteries and solar to homes that qualify for state incentives around areas where the grid is particularly overloaded.
As data centers strain the power grid, utilities are scrambling to build new power plants. But a startup in California is one of a handful focusing on the problem from a different angle: building a network of batteries and solar panels at homes to relieve pressure on the grid more quickly....</description>
    </item>
    <item>
      <title>Super prix pour le Samsung Galaxy Book 4 Edge : ce performant laptop sous Snapdragon X est &#224; moins de 600 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2451814_super-prix-pour-le-samsung-galaxy-book-4-edge-ce-performant-laptop-sous-snapdragon-x-est-a-moins-de-600-euros</link>
      <pubDate>Thu, 11 Dec 2025 09:49:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2451814_super-prix-pour-le-samsung-galaxy-book-4-edge-ce-performant-laptop-sous-snapdragon-x-est-a-moins-de-600-euros</guid>
      <description>
L&#233;ger, performant et endurant, le Samsung Galaxy Book 4 Edge a&#160;toutes ces qualit&#233;s que l&#8217;on attend d&#8217;un laptop pour travailler. Aujourd&#8217;hui, il est possible de l&#8217;obtenir &#224; seulement 599 euros.
</description>
    </item>
    <item>
      <title>&#171;&#160;Une grosse faille&#160;&#187; : comment cette erreur de l&#8217;Europe a provoqu&#233; une arriv&#233;e massive des voitures hybrides chinoises</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2906035_une-grosse-faille-comment-cette-erreur-de-leurope-a-provoque-une-arrivee-massive-des-voitures-hybrides-chinoises</link>
      <pubDate>Thu, 11 Dec 2025 09:43:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2906035_une-grosse-faille-comment-cette-erreur-de-leurope-a-provoque-une-arrivee-massive-des-voitures-hybrides-chinoises</guid>
      <description>
Face &#224; l&#8217;invasion de voitures &#233;lectriques chinoises, l&#8217;Europe a d&#233;cid&#233; de mettre en place des droits de douane punitifs. Mais il semblerait que cette mesure ait en fait eu l&#8217;effet inverse, alors que les ventes d&#8217;autos de l&#8217;Empire du Milieu ne cessent de grimper sur le Vieux Continent.
</description>
    </item>
    <item>
      <title>Myst&#232;re en Russie&#160;: des centaines de Porsche transform&#233;es en briques, sabotage ou bug&#160;?</title>
      <link>https://www.01net.com/actualites/mystere-en-russie-des-centaines-de-porsche-transformees-en-briques-sabotage-ou-bug.html</link>
      <pubDate>Thu, 11 Dec 2025 09:34:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314966</guid>
      <description>En Russie, c&#8217;est l&#8217;h&#233;catombe pour les propri&#233;taires de Porsche. Leurs bolides refusent de d&#233;marrer. Sabotage &#224; distance ou bug du syst&#232;me antivol ?</description>
    </item>
    <item>
      <title>Bagues connect&#233;es : oubliez les designs lisses, voici pourquoi ce mod&#232;le Diesel sort du lot</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/bagues-connectees/2906177_bagues-connectees-oubliez-les-designs-lisses-voici-pourquoi-ce-modele-diesel-sort-du-lot</link>
      <pubDate>Thu, 11 Dec 2025 09:32:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/bagues-connectees/2906177_bagues-connectees-oubliez-les-designs-lisses-voici-pourquoi-ce-modele-diesel-sort-du-lot</guid>
      <description>
La marque indienne Ultrahuman a d&#233;voil&#233; une nouvelle &#233;dition de sa bague connect&#233;e Ultrahuman Ring Air. Con&#231;ue en partenariat avec la marque Diesel, elle propose un design qui sort clairement du lot. 
</description>
    </item>
    <item>
      <title>Quels sont les meilleurs vid&#233;oprojecteurs &#224; ultra courte focale en 2025 ? Notre s&#233;lection</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-tv/1272065_quels-sont-les-meilleurs-videoprojecteur-a-ultra-courte-focale</link>
      <pubDate>Thu, 11 Dec 2025 09:30:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-tv/1272065_quels-sont-les-meilleurs-videoprojecteur-a-ultra-courte-focale</guid>
      <description>
Envie d'une image de plusieurs m&#232;tres de large, mais pas envie de percer des trous dans le plafond pour installer un vid&#233;oprojecteur ? Nous avons choisi les meilleurs mod&#232;les de vid&#233;oprojecteurs &#224; courte, et ultra courte focale, que nous avons pu tester.
</description>
    </item>
    <item>
      <title>The best memes of 2025, from 6-7 to Gods country. See the list.</title>
      <link>https://mashable.com/article/best-memes-of-2025-list</link>
      <pubDate>Thu, 11 Dec 2025 09:27:57 +0000</pubDate>
      <guid isPermaLink="false">0251onwkStcVWoAuZeJ2osS</guid>
      <description>From 100 men vs. a gorilla, to jokes about the new pope, and so much more &#8212; we've had some good memes in 2025.</description>
    </item>
    <item>
      <title>Comment les voitures &#233;lectriques chinoises de Xpeng ont r&#233;ussi &#224; d&#233;passer Tesla sur un point clef</title>
      <link>https://www.frandroid.com/marques/xpeng/2906067_comment-les-voitures-electriques-chinoises-de-xpeng-ont-reussi-a-depasser-tesla-sur-un-point-clef</link>
      <pubDate>Thu, 11 Dec 2025 09:22:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2906067_comment-les-voitures-electriques-chinoises-de-xpeng-ont-reussi-a-depasser-tesla-sur-un-point-clef</guid>
      <description>
Si la startup chinoise Xpeng s&#8217;est fortement inspir&#233;e des voitures &#233;lectriques de Tesla et a appris du constructeur am&#233;ricain, elle fait d&#233;sormais mieux que ce dernier, notamment sur la conduite autonome.
</description>
    </item>
    <item>
      <title>Ayaneo&#8217;s first Android phone looks like a return of the Xperia Play</title>
      <link>https://www.theverge.com/news/842243/ayaneo-pocket-play-gaming-phone-android-sony-xperia-play</link>
      <pubDate>2025-12-11T04:16:52-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=842243</guid>
      <description>Retro gaming handheld manufacturer Ayaneo has finally revealed the design of its first Android phone, which has been teased since August. Fittingly, it too is a throwback - to 2011's Sony Ericcson Xperia Play. The Pocket Play has a screen that slides up to reveal a full set of inset physical controls, including a D-pad, [&#8230;]</description>
    </item>
    <item>
      <title>Windows 11 : vos jeux plantent avec une carte graphique AMD ? Ces deux mises &#224; jour corrigent enfin le probl&#232;me</title>
      <link>https://www.frandroid.com/marques/amd/2906091_windows-11-vos-jeux-plantent-avec-une-carte-graphique-amd-ces-deux-mises-a-jour-corrigent-enfin-le-probleme</link>
      <pubDate>Thu, 11 Dec 2025 09:08:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amd/2906091_windows-11-vos-jeux-plantent-avec-une-carte-graphique-amd-ces-deux-mises-a-jour-corrigent-enfin-le-probleme</guid>
      <description>
De r&#233;centes mises &#224; jour de Windows 11 et des pilotes AMD auraient r&#233;solu de nombreux probl&#232;mes d'instabilit&#233; sur les jeux r&#233;cents.
</description>
    </item>
    <item>
      <title>Le Galaxy Z TriFold r&#233;serve une fonction bien pratique si vous travaillez sur PC</title>
      <link>https://www.frandroid.com/marques/samsung/2906079_le-galaxy-z-trifold-reserve-une-fonction-bien-pratique-si-vous-travaillez-sur-pc</link>
      <pubDate>Thu, 11 Dec 2025 09:04:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2906079_le-galaxy-z-trifold-reserve-une-fonction-bien-pratique-si-vous-travaillez-sur-pc</guid>
      <description>
Le Galaxy Z TriFold est d&#233;j&#224; parvenu &#224; capturer la curiosit&#233; du grand public avec son aspect &#224; mi-chemin entre le smartphone et la tablette. Mais le mobile embarque en plus des fonctionnalit&#233;s logicielles int&#233;ressantes, comme la possibilit&#233; de l&#8217;utiliser en tant que second &#233;cran.
</description>
    </item>
    <item>
      <title>Cyberattaque contre des &#171;&#160;dizaines de banques europ&#233;ennes&#160;&#187; : votre compte est peut-&#234;tre dans le viseur de Spiderman</title>
      <link>https://www.01net.com/actualites/cyberattaque-cours-contre-dizaines-banques-europeennes-votre-compte-peut-etre-viseur-spiderman.html</link>
      <pubDate>Thu, 11 Dec 2025 09:01:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314959</guid>
      <description>Une menace d'envergure plane sur les banques europ&#233;ennes. &#192; l'aide d'un kit de phishing baptis&#233; Spiderman, des cybercriminels cherchent actuellement &#224; s'emparer de vos donn&#233;es pour siphonner votre compte bancaire. Des dizaines de banques, et des services financiers, comme PayPal, sont vis&#233;s.</description>
    </item>
    <item>
      <title>How to watch 2026 PDC World Darts Championship online: FREE live streams, schedule, seeds, Round 1 preview and draw</title>
      <link>https://www.techradar.com/how-to-watch/sport/2026-pdc-world-darts-championship-free</link>
      <pubDate>Thu, 11 Dec 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">3dPTcs4tLz7QQrWMZpTr2Y</guid>
      <description>The world's top tungsten talent visit the Ally Pally mecca in London, here's how to watch 2026 World Darts Championship live streams online from anywhere in the world.</description>
    </item>
    <item>
      <title>Here&#8217;s how to spot AI-written content</title>
      <link>https://www.fastcompany.com/91453689/heres-how-to-spot-ai-written-content</link>
      <pubDate>2025-12-11T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91453689/heres-how-to-spot-ai-written-content</guid>
      <description>Large language models are quietly reshaping the way people write research papers&#8212;and scientists are catching colleagues using AI to do their work.&#160; &#160;
Large language models are quietly reshaping the way people write research papers&#8212;and scientists are catching colleagues using AI to do their work.&#160; &#160;</description>
    </item>
    <item>
      <title>Cars to AI: How new tech drives demand for specialized materials</title>
      <link>https://www.fastcompany.com/91458221/ai-cars-tech-specialized-materials-minerals</link>
      <pubDate>2025-12-11T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91458221/ai-cars-tech-specialized-materials-minerals</guid>
      <description>Critical materials give leverage to countries that have a monopoly in mining and processing them. 
Generative artificial intelligence has become widely accepted as a tool that increases productivity. Yet the technology is far from mature. Large language models advance rapidly from one generation to the next, and experts can only speculate how AI will affect the workforce and people&#8217;s daily lives....</description>
    </item>
    <item>
      <title>Le prix du Google Pixel 9 Pro XL fond comme neige au soleil pour No&#235;l (-45 %)</title>
      <link>https://www.frandroid.com/bons-plans/2823769_le-prix-du-google-pixel-9-pro-xl-fond-comme-neige-au-soleil-pour-noel</link>
      <pubDate>Thu, 11 Dec 2025 08:58:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2823769_le-prix-du-google-pixel-9-pro-xl-fond-comme-neige-au-soleil-pour-noel</guid>
      <description>
C'est une vente flash express de No&#235;l sur Amazon, pendant laquelle le Google Pixel 9 Pro XL chute &#224; seulement 658,44 euros alors qu'il en valait 1 199 euros &#224; son lancement en 2024. Attention, les stocks sont tr&#232;s limit&#233;s !
</description>
    </item>
    <item>
      <title>P&#233;nurie de RAM : ces 3 PC bien &#233;quip&#233;s sont encore propos&#233;s &#224; bon prix (pour l&#8217;instant) [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/2903721_penurie-de-ram-ces-3-pc-bien-equipes-sont-encore-proposes-a-bon-prix-pour-linstant</link>
      <pubDate>Thu, 11 Dec 2025 08:56:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2903721_penurie-de-ram-ces-3-pc-bien-equipes-sont-encore-proposes-a-bon-prix-pour-linstant</guid>
      <description>
Vous ne pensiez pas vous (r&#233;)&#233;quiper avant au moins un an ? La p&#233;nurie de RAM va certainement bouleverser vos plans. Heureusement, il est encore temps de renouveler son mat&#233;riel &#224; prix tr&#232;s correct gr&#226;ce &#224; PcComponentes.
</description>
    </item>
    <item>
      <title>10 nouvelles voitures &#233;lectriques au crash-test : Mercedes et les chinois brillent quand Alpine d&#233;&#231;oit</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2905999_10-nouvelles-voitures-electriques-au-crash-test-mercedes-et-les-chinois-brillent-quand-alpine-decoit</link>
      <pubDate>Thu, 11 Dec 2025 08:51:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2905999_10-nouvelles-voitures-electriques-au-crash-test-mercedes-et-les-chinois-brillent-quand-alpine-decoit</guid>
      <description>
L&#8217;EuroNCAP vient de d&#233;voiler les r&#233;sultats de ses derniers crash-tests en date. Et si Mercedes brille avec sa nouvelle CLA, ce n&#8217;est pas la m&#234;me histoire pour Alpine avec sa nouvelle voiture &#233;lectrique.
</description>
    </item>
    <item>
      <title>Spotify teste une fonction pour g&#233;n&#233;rer des playlists &#224; l&#8217;aide d&#8217;un prompt</title>
      <link>https://www.01net.com/actualites/spotify-teste-une-fonction-pour-generer-des-playlists-a-laide-dun-prompt.html</link>
      <pubDate>Thu, 11 Dec 2025 08:45:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314984</guid>
      <description>La plate-forme de diffusion en streaming veut vous laisser contr&#244;ler son algorithme. Spotify est en train de tester une nouvelle fonctionnalit&#233; permettant de cr&#233;er des playlists bas&#233;es sur votre historique d&#8217;&#233;coute &#224; l&#8217;aide d&#8217;un simple prompt.</description>
    </item>
    <item>
      <title>Ces autoroutes &#233;lectriques qui permettent &#224; la France d&#8217;&#233;viter &#171;&#160;40 blackouts par an&#160;&#187;</title>
      <link>https://www.frandroid.com/survoltes/energie/2906061_ces-autoroutes-electriques-qui-permettent-a-la-france-deviter-40-blackouts-par-an</link>
      <pubDate>Thu, 11 Dec 2025 08:38:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/2906061_ces-autoroutes-electriques-qui-permettent-a-la-france-deviter-40-blackouts-par-an</guid>
      <description>
Pour &#233;viter que le blackout espagnol ne se reproduise, l'Europe veut cr&#233;er huit autoroutes de l'&#233;nergie. Des autoroutes existent d&#233;j&#224;, permettant d'&#233;viter 40 blackout &#224; la France par an.
</description>
    </item>
  </channel>
</rss>
