<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 17 Jan 2026 17:21:09 GMT</lastBuildDate>
    <item>
      <title>Elon Musk is looking for a $134 billion payout from OpenAI and Microsoft</title>
      <link>https://www.engadget.com/big-tech/elon-musk-is-looking-for-a-134-billion-payout-from-openai-and-microsoft-171824945.html?src=rss</link>
      <pubDate>Sat, 17 Jan 2026 17:18:24 +0000</pubDate>
      <guid isPermaLink="false">40e8ea3d-a297-4d71-8697-77d39bd3d115</guid>
      <description>We now have some idea of what's at stake in the longstanding feud between Elon Musk and OpenAI. As first reported by Bloomberg, the latest filing, as part of a lawsuit that accuses the AI giant of abandoning its non-profit status, claims that Musk is owed anywhere between $79 billion and $134 billion in damages from the "wrongful gains" of OpenAI and Microsoft.
Musk claimed in the filing that he's entitled to a portion of OpenAI's recent valuation at $500 billion, after contributing $38 million in "seed funding" during the AI company's startup years. Along with providing "roughly 60 percent of...</description>
    </item>
    <item>
      <title>'It&#8217;s like wrapping the wind from all sides': Drone-like airship with 24 blades is world's first megawatt-class tethered wind turbine &#8212; S2000 rises to 2Km and can generate a whopping 3MW</title>
      <link>https://www.techradar.com/pro/its-like-wrapping-the-wind-from-all-sides-drone-like-airship-with-24-blades-is-worlds-first-megawatt-class-tethered-wind-turbine-s2000-rises-to-2km-and-can-generate-a-whopping-3mw</link>
      <pubDate>Sat, 17 Jan 2026 17:10:00 +0000</pubDate>
      <guid isPermaLink="false">VcAe3WfHLodHMhiukB9fvD</guid>
      <description>A Chinese firm has tested the world&#8217;s first megawatt class airborne wind turbine platform designed to feed electricity directly into the grid.</description>
    </item>
    <item>
      <title>Test du Valerion VisionMaster Max : un vid&#233;oprojecteur triple laser qui vise les sommets pour votre salle de cin&#233;ma</title>
      <link>https://www.frandroid.com/marques/valerion/2926079_test-du-valerion-visionmaster-max-un-videoprojecteur-triple-laser-qui-vise-les-sommets-pour-votre-salle-de-cinema</link>
      <pubDate>Sat, 17 Jan 2026 17:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/valerion/2926079_test-du-valerion-visionmaster-max-un-videoprojecteur-triple-laser-qui-vise-les-sommets-pour-votre-salle-de-cinema</guid>
      <description>
Le Valerion VisionMaster Max est un vid&#233;oprojecteur lifestyle et plut&#244;t compact qui veut transformer un salon ou une salle d&#233;di&#233;e en v&#233;ritable espace de projection haut de gamme. Plus lumineux que le VisionMaster Pro 2 et dot&#233; d&#8217;un iris dynamique ainsi que d&#8217;un lens shift motoris&#233;, il vise un public exigeant. Nous l&#8217;avons test&#233;.
</description>
    </item>
    <item>
      <title>I took a ride in Hyundai's new fully-autonomous robotaxi &#8211; and it&#8217;s surprisingly good at navigating the wild streets of Las Vegas</title>
      <link>https://www.techradar.com/vehicle-tech/hybrid-electric-vehicles/i-took-a-ride-in-hyundais-fully-autonomous-robotaxi-and-its-surprisingly-good-at-navigating-the-wild-streets-of-las-vegas</link>
      <pubDate>Sat, 17 Jan 2026 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">PYeJK7gwDvNJpf2ZWKmoQh</guid>
      <description>Hyundai and Motional are rolling out a new robotaxi service in Las Vegas later this year, but the end goal is driverless cars you can own</description>
    </item>
    <item>
      <title>Grab a four-pack of AirTags on sale for $65</title>
      <link>https://www.engadget.com/deals/grab-a-four-pack-of-airtags-on-sale-for-65-202333514.html?src=rss</link>
      <pubDate>Sat, 17 Jan 2026 16:59:45 +0000</pubDate>
      <guid isPermaLink="false">24b60c33-f851-4bee-9d8b-9c00c8cc034a</guid>
      <description>Most Apple products are pretty expensive, but some of the most affordable (and useful) ones are AirTags. The Bluetooth trackers are priced pretty reasonably even when not on sale, but they can be a steal if you can get them on a discount &#8212; like right now. A four pack of AirTags is on sale for $65 at Amazon, which is only a few dollars more than the record-low price we saw during Black Friday this year.


AirTags can be useful for people who travel frequently, helping you to keep track of essentials like your passport as well as a way to keep tabs on luggage while you're on the go. If you do pu...</description>
    </item>
    <item>
      <title>Mammotion Maston : le leader de la tonte sans fil d&#233;voile un robot pro &#233;quip&#233; d&#8217;un bras articul&#233;</title>
      <link>https://www.frandroid.com/marques/mammotion/2946043_mammotion-maston-le-leader-de-la-tonte-sans-fil-devoile-un-robot-pro-equipe-dun-bras-articule</link>
      <pubDate>Sat, 17 Jan 2026 16:53:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/mammotion/2946043_mammotion-maston-le-leader-de-la-tonte-sans-fil-devoile-un-robot-pro-equipe-dun-bras-articule</guid>
      <description>
Mammotion, fra&#238;chement couronn&#233; num&#233;ro 1 mondial des tondeuses sans fil, profite du CES 2026 pour franchir une nouvelle &#233;tape. En pr&#233;sentant le Maston, la marque d&#233;voile son tout premier robot tondeuse d&#233;di&#233; aux professionnels. Encore &#224; l'&#233;tat de prototype, cette machine impressionne par ses capacit&#233;s tout-terrain et, surtout, par l'int&#233;gration d'un bras articul&#233; intelligent.
...</description>
    </item>
    <item>
      <title>La Xiaomi Electric Scooter 4 Pro Max devient plus attractive gr&#226;ce &#224; cette r&#233;duction de 31 % du c&#244;t&#233; de la Fnac</title>
      <link>https://www.frandroid.com/bons-plans/2942649_la-xiaomi-electric-scooter-4-pro-max-devient-plus-attractive-grace-a-cette-reduction-de-24-du-cote-de-la-fnac</link>
      <pubDate>Sat, 17 Jan 2026 16:32:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2942649_la-xiaomi-electric-scooter-4-pro-max-devient-plus-attractive-grace-a-cette-reduction-de-24-du-cote-de-la-fnac</guid>
      <description>
Si au moment de la sortie, le r&#233;el int&#233;r&#234;t de cette Xiaomi Electric Scooter 4 Pro Max pouvait poser question, cette trottinette &#233;lectrique devient r&#233;ellement int&#233;ressante gr&#226;ce &#224; cette remise de la Fnac. Pendant les soldes d'hiver, elle est vendue pour 431,99 euros.
</description>
    </item>
    <item>
      <title>Oshen built the first&#160;ocean&#160;robot to collect data in a&#160;Category 5 hurricane</title>
      <link>https://techcrunch.com/2026/01/17/oshen-built-the-first-ocean-robot-to-collect-data-in-a-category-5-hurricane/</link>
      <pubDate>Sat, 17 Jan 2026 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3082677</guid>
      <description>Oshen has signed contracts with multiple government agencies for its C-Star robots to collect ocean data autonomously.</description>
    </item>
    <item>
      <title>No, Skyrim&#8217;s Switch 2 port isn&#8217;t that bad &#8212; but there&#8217;s room for improvement</title>
      <link>https://www.techradar.com/gaming/the-elder-scrolls-5-skyrim-anniversary-edition-nintendo-switch-2-review</link>
      <pubDate>Sat, 17 Jan 2026 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">guyiAVRD7EAzjP5SXN9XaB</guid>
      <description>Skyrim&#8217;s Switch 2 port is a decent way to enjoy the sprawling RPG, though it&#8217;s held back by some irksome issues.</description>
    </item>
    <item>
      <title>Keep your huge screens and triple cameras &#8212; I just want the iPhone 5s back</title>
      <link>https://www.techradar.com/phones/iphone/keep-your-huge-screens-and-triple-cameras-i-just-want-the-iphone-5s-back</link>
      <pubDate>Sat, 17 Jan 2026 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">sJ3XEyPFDt5FmxzjurpF5G</guid>
      <description>It&#8217;s finally time to put the spotlight on the iPhone 5s &#8211; not like I&#8217;ve mentioned it much.</description>
    </item>
    <item>
      <title>Australian Open 2026 Free Streams: TV Channels, Full Schedule and Preview for Opening Grand Slam</title>
      <link>https://www.techradar.com/how-to-watch/tennis/australian-open-2026-free</link>
      <pubDate>Sat, 17 Jan 2026 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">cu3gn7kp3DcNUc298bs8KB</guid>
      <description>Watch free tennis streams from Melbourne Park in the season's first grand slam &#8211; 2026 Australian Open TV channels, broadcasters and streams.</description>
    </item>
    <item>
      <title>D&#233;bris spatiaux : cette &#171;&#160;armure&#160;&#187; nouvelle g&#233;n&#233;ration pourrait devenir indispensable aux satellites. Explications avec son concepteur</title>
      <link>https://www.futura-sciences.com/sciences/actualites/debris-spatiaux-debris-spatiaux-cette-armure-nouvelle-generation-pourrait-devenir-indispensable-satellites-explications-son-concepteur-130184/#xtor%3DRSS-8</link>
      <pubDate>Sat, 17 Jan 2026 16:57:54 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/debris-spatiaux-debris-spatiaux-cette-armure-nouvelle-generation-pourrait-devenir-indispensable-satellites-explications-son-concepteur-130184/#xtor%3DRSS-8</guid>
      <description>Dans un environnement spatial de plus en plus encombr&#233;, o&#249; des d&#233;bris orbitant &#224; des vitesses d&#233;passant les sept kilom&#232;tres par seconde mettent en p&#233;ril la s&#233;curit&#233; des satellites et des astronautes, la start-up Atomic-6 se positionne en pionni&#232;re avec une innovation r&#233;volutionnaire : des tuiles...</description>
    </item>
    <item>
      <title>The LG C5 and Apple&#8217;s M4 Mac Mini are both steeply discounted this weekend</title>
      <link>https://www.theverge.com/gadgets/863503/apple-mac-mini-m4-lg-c5-oled-tv-deal-sale</link>
      <pubDate>2026-01-17T10:38:25-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=863503</guid>
      <description>Happy Saturday, folks! This week, Best Buy kicked off its so-called &#8220;Winter Sale,&#8221; introducing a whole host of price cuts that range from not-so-good to legitimately great, at least for this time of year. We&#8217;ll be publishing many of the highlights in a dedicated news post tomorrow, though, per usual, not all of this week&#8217;s [&#8230;]</description>
    </item>
    <item>
      <title>The New &#8216;Exorcist&#8217; and &#8216;Paranormal Activity&#8217; Will Haunt Your 2027</title>
      <link>https://gizmodo.com/the-new-exorcist-and-paranormal-activity-will-haunt-your-2027-2000711416</link>
      <pubDate>Sat, 17 Jan 2026 15:30:42 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711416</guid>
      <description>Hope you like horror in your spring season, because 'Exorcist' and 'Paramount' are both landing in spring 2027.</description>
    </item>
  </channel>
</rss>
