<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 07 Dec 2025 19:18:28 GMT</lastBuildDate>
    <item>
      <title>X Claims It Banned the European Commission&#8217;s Ad Account. It Says It Wasn&#8217;t Using Ads</title>
      <link>https://gizmodo.com/x-claims-it-banned-the-european-commissions-ad-account-it-says-it-wasnt-using-ads-2000696517</link>
      <pubDate>Sun, 07 Dec 2025 19:16:02 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000696517</guid>
      <description>X's clapback came after the Commission fined it $140 million. The gesture appears to be toothless.</description>
    </item>
    <item>
      <title>OpenAI&#8217;s head of ChatGPT says posts appearing to show in-app ads are &#8216;not real or not ads&#8217;</title>
      <link>https://www.engadget.com/ai/openais-head-of-chatgpt-says-posts-appearing-to-show-in-app-ads-are-not-real-or-not-ads-190454584.html?src=rss</link>
      <pubDate>Sun, 07 Dec 2025 19:04:54 +0000</pubDate>
      <guid isPermaLink="false">f72773e8-903a-469a-97ab-27115b4320c5</guid>
      <description>Those might not exactly be ads you're seeing on ChatGPT, at least according to OpenAI. Nick Turley, OpenAI's head of ChatGPT, clarified the confusion around potential ads appearing with the AI chatbot. In a post on X, Turley said "there are no live tests for ads" and that "any screenshots you've seen are either not real or not ads." The OpenAI exec's explanation comes after another post from former xAI employee Benjamin De Kraker on X that has gained traction, which featured a screenshot showing an option to shop at Target within a ChatGPT conversation.
OpenAI's Daniel McAuley responded to the...</description>
    </item>
    <item>
      <title>Guerre des &#233;toiles &#171; made in France &#187;, &#233;pisode V : les r&#234;ves de Salazar</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronautique-guerre-etoiles-made-in-france-episode-v-reves-salazar-127064/#xtor%3DRSS-8</link>
      <pubDate>Sun, 07 Dec 2025 20:01:51 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronautique-guerre-etoiles-made-in-france-episode-v-reves-salazar-127064/#xtor%3DRSS-8</guid>
      <description>Depuis 2019, la France cherche &#224; pouvoir prot&#233;ger ses satellites militaires strat&#233;giques en cas d&#8217;attaque ennemie. La start-up Dark &#8211; bas&#233;e &#224; Bordeaux &#8211; proposait un v&#233;hicule capable d&#8217;interception d&#8217;un satellite, mais l&#8217;entreprise a r&#233;cemment mis la cl&#233; sous la porte faute de financement...</description>
    </item>
    <item>
      <title>I was spending too much time at my desk; that is, until I discovered this app</title>
      <link>https://www.techradar.com/computing/websites-apps/go-jauntly</link>
      <pubDate>Sun, 07 Dec 2025 19:00:00 +0000</pubDate>
      <guid isPermaLink="false">j4sEdGpStbWDiAuWJXWHzd</guid>
      <description>Homescreen Heroes: Go Jauntly is the pocket-sized encyclopedia for urban and nature walks.</description>
    </item>
    <item>
      <title>Le Philips Hue Bridge Pro se retrouve d&#233;j&#224; dans un pack de d&#233;marrage complet qui brade son prix &#224; -30 %</title>
      <link>https://www.frandroid.com/bons-plans/2900911_le-philips-hue-bridge-pro-se-retrouve-deja-dans-un-pack-de-demarrage-qui-brade-son-prix-a-30</link>
      <pubDate>Sun, 07 Dec 2025 18:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2900911_le-philips-hue-bridge-pro-se-retrouve-deja-dans-un-pack-de-demarrage-qui-brade-son-prix-a-30</guid>
      <description>
Le nouveau cerveau "Pro" de l'&#233;cosyst&#232;me Hue de Philips est sorti sur le march&#233; lors de l'IFA 2025 en septembre. Il se retrouve d&#233;j&#224; dans un pack de d&#233;couverte avec des ampoules pour (re)partir sur une bonne base. Le pack Hue Bridge Pro s'affiche &#224; 139,99 euros au lieu de 199,99 euros sur Darty.
</description>
    </item>
    <item>
      <title>Meilleurs casques gaming PC : notre comparatif et nos conseils en 2025</title>
      <link>https://www.frandroid.com/guide-dachat/676229_meilleurs-casques-gamer</link>
      <pubDate>Sun, 07 Dec 2025 18:02:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/676229_meilleurs-casques-gamer</guid>
      <description>
Poss&#233;der un casque si vous &#234;tes un joueur PC est quasiment indispensable, notamment si vous aimez faire du multijoueur. Pour communiquer avec vos co&#233;quipiers, vous aurez besoin d'un bon micro. C'est pourquoi un solide casque audio gamer sera votre meilleur ami sur PC : voici notre comparatif.
</description>
    </item>
    <item>
      <title>Emmanuel Macron menace la Chine de droits de douane imm&#233;diats sur la tech et les voitures &#233;lectriques</title>
      <link>https://www.frandroid.com/culture-tech/politique/2901377_emmanuel-macron-menace-la-chine-de-droits-de-douane-immediats-sur-la-tech-et-les-voitures-electriques</link>
      <pubDate>Sun, 07 Dec 2025 17:46:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/politique/2901377_emmanuel-macron-menace-la-chine-de-droits-de-douane-immediats-sur-la-tech-et-les-voitures-electriques</guid>
      <description>
Vous pensiez que la guerre commerciale &#233;tait une sp&#233;cialit&#233; am&#233;ricaine ? Vous vous trompez. Emmanuel Macron vient de menacer la Chine de sanctions douani&#232;res "dans les tout prochains mois". L'objectif est clair : forcer la main de P&#233;kin pour sauver l'industrie europ&#233;enne, des batteries aux voitures &#233;lectriques.
</description>
    </item>
    <item>
      <title>Metas Phoenix mixed reality glasses delayed to 2027</title>
      <link>https://mashable.com/article/meta-phoenix-mixed-reality-glasses-delayed</link>
      <pubDate>Sun, 07 Dec 2025 17:37:25 +0000</pubDate>
      <guid isPermaLink="false">02mQ9PxZVxNG7QwaUDDLE2N</guid>
      <description>The company is pushing the rumored project to 2027 as Meta focuses on internal updates.</description>
    </item>
    <item>
      <title>X shuts down the European Commission&#8217;s ad account the day after major fine</title>
      <link>https://www.engadget.com/social-media/x-shuts-down-the-european-commissions-ad-account-the-day-after-major-fine-173553267.html?src=rss</link>
      <pubDate>Sun, 07 Dec 2025 17:35:53 +0000</pubDate>
      <guid isPermaLink="false">706fac67-afe9-40c8-a605-09cf4b656139</guid>
      <description>Just a day after receiving a roughly $140 million fine, X has terminated the ad account of the European Commission. Nikita Bier, X's head of product, accused the European Commission of using an exploit to artificially boost the reach of its post announcing the major fine.
In the post, Bier said that the commission "logged into [their] dormant ad account to take advantage of an exploit in our Ad Composer" and posted "a link that deceives users into thinking it&#8217;s a video and to artificially increase its reach." Bier explained in a separate post that the exploit has "never been abused like this" ...</description>
    </item>
    <item>
      <title>&#171;&#160;Ils vont tout &#233;craser&#160;&#187; : MKBHD teste la voiture &#233;lectrique chinoise de Xiaomi et son verdict est sans appel</title>
      <link>https://www.frandroid.com/marques/xiaomi/2901353_ils-vont-tout-ecraser-mkbhd-teste-la-voiture-electrique-chinoise-de-xiaomi-et-son-verdict-est-sans-appel</link>
      <pubDate>Sun, 07 Dec 2025 17:34:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2901353_ils-vont-tout-ecraser-mkbhd-teste-la-voiture-electrique-chinoise-de-xiaomi-et-son-verdict-est-sans-appel</guid>
      <description>
Il aura fallu que la Xiaomi SU7 atterrisse entre les mains de MKBHD pour que l'Am&#233;rique r&#233;alise. Le plus grand youtubeur tech du monde vient de prendre une claque. Sa conclusion ? "Si ces voitures arrivent aux US, elles vont tout cuisiner". Bon, il commet une erreur grossi&#232;re sur le prix, mais le r&#233;veil est brutal.
</description>
    </item>
    <item>
      <title>We may have to wait until 2027 for the launch of the next pair of Meta mixed reality smart glasses</title>
      <link>https://www.techradar.com/computing/virtual-reality-augmented-reality/we-may-have-to-wait-until-2027-for-the-launch-of-the-next-pair-of-meta-mixed-reality-smart-glasses</link>
      <pubDate>Sun, 07 Dec 2025 17:30:00 +0000</pubDate>
      <guid isPermaLink="false">xhhk5rfyCuyriooLUrm5rZ</guid>
      <description>One of the many AI-powered wearable devices that Meta is working on has apparently been pushed back a year.</description>
    </item>
    <item>
      <title>A New &#8216;Starfleet Academy&#8217; Clip Lets Paul Giamatti Go Wild</title>
      <link>https://gizmodo.com/a-new-starfleet-academy-clip-lets-paul-giamatti-go-wild-2000696525</link>
      <pubDate>Sun, 07 Dec 2025 17:25:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000696525</guid>
      <description>Looks like Giamatti's having a ball as a bad guy on 'Starfleet Academy' with an axe to grind against Holly Hunter.</description>
    </item>
  </channel>
</rss>
