<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 13 Jan 2026 10:29:49 GMT</lastBuildDate>
    <item>
      <title>I've found 16 standing desks under $100 to transform your home office for less</title>
      <link>https://www.techradar.com/pro/ive-found-16-standing-desks-under-usd100-to-transform-your-home-office-for-less</link>
      <pubDate>Tue, 13 Jan 2026 10:26:48 +0000</pubDate>
      <guid isPermaLink="false">vSEs84Dbdyi5DZJfxghT3J</guid>
      <description>Save on these height-adjustable desks for your WFH workspace.</description>
    </item>
    <item>
      <title>Sony WF-1000XM6 : la sortie se pr&#233;cise pour f&#233;vrier 2026 avec un prix en baisse</title>
      <link>https://www.frandroid.com/marques/sony/2940639_sony-wf-1000xm6-la-sortie-se-precise-pour-fevrier-2026-avec-un-prix-en-baisse</link>
      <pubDate>Tue, 13 Jan 2026 10:25:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2940639_sony-wf-1000xm6-la-sortie-se-precise-pour-fevrier-2026-avec-un-prix-en-baisse</guid>
      <description>
Selon plusieurs &#233;l&#233;ments concordants, Sony s'appr&#234;terait &#224; lancer sa nouvelle g&#233;n&#233;ration d'&#233;couteurs sans fil premium, les WF-1000XM6, attendus pour la mi-f&#233;vrier 2026, soit pr&#232;s de deux ans et demi apr&#232;s celle des WF-1000XM5, commercialis&#233;s &#224; l'&#233;t&#233; 2023.
</description>
    </item>
    <item>
      <title>Dur&#233;e de vie des batteries : cette &#233;tude met fin pour de bon aux id&#233;es re&#231;ues sur la voiture &#233;lectrique</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2940403_duree-de-vie-des-batteries-cette-etude-met-fin-pour-de-bon-aux-idees-recues-sur-la-voiture-electrique</link>
      <pubDate>Tue, 13 Jan 2026 10:23:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2940403_duree-de-vie-des-batteries-cette-etude-met-fin-pour-de-bon-aux-idees-recues-sur-la-voiture-electrique</guid>
      <description>
La derni&#232;re &#233;tude en date de GeoTab indique que la d&#233;gradation des batteries de voitures &#233;lectriques est tr&#232;s faible. Cependant, la recharge rapide reste le principal facteur d&#8217;acc&#233;l&#233;ration de cette derni&#232;re.
</description>
    </item>
    <item>
      <title>Best Baby Gear (2026): Baby Monitors, Strollers, Crib Mattresses</title>
      <link>https://www.wired.com/story/best-baby-gear-guide/</link>
      <pubDate>Tue, 13 Jan 2026 10:23:00 +0000</pubDate>
      <guid isPermaLink="false">695ec181bbd4755fc7697656</guid>
      <description>From baby monitors and sound machines to smart bassinets and car seats, here&#8217;s the baby tech we&#8217;ve tested and recommend.</description>
    </item>
    <item>
      <title>Microsoft is retiring its Office Lens app on iOS and Android</title>
      <link>https://www.theverge.com/news/861102/microsoft-office-lens-app-end-of-support-retirement</link>
      <pubDate>2026-01-13T05:18:59-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=861102</guid>
      <description>Microsoft is removing its Lens scanner app from iOS and Android in the coming months. Microsoft Lens, or Office Lens as it's known to most, will no longer be supported on February 9th and the app won't be functional after March 9th. The portable scanner features of Lens are available in OneDrive instead, making a [&#8230;]</description>
    </item>
    <item>
      <title>Anthropic Cowork : l&#8217;IA peut d&#233;sormais organiser votre Mac, pour trier, renommer et cr&#233;er vos documents &#224; votre place</title>
      <link>https://www.frandroid.com/os/macos/2940399_anthropic-cowork-lia-peut-desormais-organiser-votre-mac-pour-trier-renommer-et-creer-vos-documents-a-votre-place</link>
      <pubDate>Tue, 13 Jan 2026 10:12:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/macos/2940399_anthropic-cowork-lia-peut-desormais-organiser-votre-mac-pour-trier-renommer-et-creer-vos-documents-a-votre-place</guid>
      <description>
Les d&#233;veloppeurs utilisaient l'outil de programmation d'Anthropic pour&#8230; trier leurs factures. L'entreprise a compris le message et lance aujourd'hui Cowork sur macOS. Cette fonctionnalit&#233; transforme Claude en v&#233;ritable agent de bureau capable d'encha&#238;ner les t&#226;ches en autonomie.
</description>
    </item>
    <item>
      <title>Pourquoi Volkswagen lance un plan massif pour &#233;conomiser 1 milliard d&#8217;euros</title>
      <link>https://www.frandroid.com/marques/volkswagen/2940293_pourquoi-volkswagen-lance-un-plan-massif-pour-economiser-1-milliard-deuros</link>
      <pubDate>Tue, 13 Jan 2026 10:12:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2940293_pourquoi-volkswagen-lance-un-plan-massif-pour-economiser-1-milliard-deuros</guid>
      <description>
Alors que la situation de Volkswagen reste fragile, le constructeur allemand d&#233;voile sa nouvelle strat&#233;gie de r&#233;duction des co&#251;ts. Et il mise &#233;videmment beaucoup sur les voitures &#233;lectriques.
</description>
    </item>
    <item>
      <title>Pour l&#8217;Anses, il faut des r&#233;seaux sociaux &#171;&#160;uniquement con&#231;us et param&#233;tr&#233;s pour prot&#233;ger&#160;&#187;&#160;les mineurs</title>
      <link>https://www.01net.com/actualites/pour-lanses-il-faut-des-reseaux-sociaux-uniquement-concus-et-parametres-pour-proteger-les-mineurs.html</link>
      <pubDate>Tue, 13 Jan 2026 10:08:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319618</guid>
      <description>L'autorit&#233; en charge de prot&#233;ger la sant&#233; des Fran&#231;ais a publi&#233; un rapport analysant l'impact des r&#233;seaux sociaux sur la sant&#233; mentale des adolescents. Elle pr&#233;conise de revoir en profondeur le fonctionnement de ces plateformes, et de les contraindre &#224; proposer aux mineurs uniquement des r&#233;seaux sociaux respectueux de la sant&#233; mentale : autant de principes &#224; appliquer qui pourraient se heurter &#224; la r&#233;alit&#233; juridique....</description>
    </item>
    <item>
      <title>Google Home passe au niveau sup&#233;rieur avec 20 nouvelles automatisations</title>
      <link>https://www.01net.com/actualites/google-home-passe-niveau-superieur-20-nouvelles-automatisations.html</link>
      <pubDate>Tue, 13 Jan 2026 10:06:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319633</guid>
      <description>Google Home commence fort l'ann&#233;e 2026 en int&#233;grant 20 nouveaux d&#233;clencheurs et actions pour automatiser votre maison.</description>
    </item>
    <item>
      <title>Boulanger d&#233;gaine d&#233;j&#224; ses meilleures offres avant la 2e d&#233;marque des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2931541_boulanger-degaine-deja-ses-meilleures-offres-avant-la-2e-demarque-des-soldes</link>
      <pubDate>Tue, 13 Jan 2026 10:02:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931541_boulanger-degaine-deja-ses-meilleures-offres-avant-la-2e-demarque-des-soldes</guid>
      <description>
Les soldes d&#8217;hiver battent leur plein et la deuxi&#232;me d&#233;marque pointe d&#233;j&#224; le bout de son nez. Chez Boulanger, les bonnes affaires s&#8217;encha&#238;nent avec une pluie de r&#233;ductions sur une large s&#233;lection de produits Tech. On a parcouru le site pour vous d&#233;nicher les meilleurs bons plans &#224; ne surtout pas manquer.
</description>
    </item>
    <item>
      <title>The best streaming devices for 2026</title>
      <link>https://www.engadget.com/entertainment/streaming/best-streaming-devices-media-players-123021395.html?src=rss</link>
      <pubDate>Tue, 13 Jan 2026 10:01:26 +0000</pubDate>
      <guid isPermaLink="false">b557f10a-a837-40b3-aaa6-4ae77c2f9039</guid>
      <description>With the dominance of smart TVs, streaming sticks and boxes may seem redundant &#8212; but if your smart set is slow or has a frustrating user interface, a streaming device will let you bypass your TV&#8217;s built-in OS and use Google TV, Fire TV, Apple TV or something else instead. There are a lot of streaming gadgets out there, all with different operating systems, memory capacities, video resolutions and bonus features, such as headphone connections and ambient modes that fill your screen with stills when you&#8217;re not watching. We tested options from the major brands and broke down exactly what each dev...</description>
    </item>
    <item>
      <title>Everything You Need to Know About Importing a Chinese Smartphone</title>
      <link>https://www.wired.com/story/tips-on-importing-a-chinese-smartphone/</link>
      <pubDate>Tue, 13 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">6960e7ba86eb48f234d51f02</guid>
      <description>The top Chinese smartphones are innovation-packed spec beasts, but it&#8217;s not always a good idea to import from the East.</description>
    </item>
    <item>
      <title>Galaxy Z Fold 8, le premier smartphone pliable sans aucun pli visible</title>
      <link>https://www.frandroid.com/marques/samsung/2940269_galaxy-z-fold-8-le-premier-smartphone-pliable-sans-aucun-pli-visible</link>
      <pubDate>Tue, 13 Jan 2026 09:59:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2940269_galaxy-z-fold-8-le-premier-smartphone-pliable-sans-aucun-pli-visible</guid>
      <description>
Lors du CES 2026, Samsung Display a fait sensation en pr&#233;sentant une nouvelle technologie OLED garantissant une surface parfaitement plane. Selon les derni&#232;res indiscr&#233;tions, c&#8217;est le futur Galaxy Z Fold 8 qui devrait en profiter en premier.
</description>
    </item>
    <item>
      <title>Rad Power Bikes au bord du gouffre : fermetures en cha&#238;ne et derni&#232;re chance de rachat</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2940487_rad-power-bikes-au-bord-du-gouffre-fermetures-en-chaine-et-derniere-chance-de-rachat</link>
      <pubDate>Tue, 13 Jan 2026 09:55:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2940487_rad-power-bikes-au-bord-du-gouffre-fermetures-en-chaine-et-derniere-chance-de-rachat</guid>
      <description>
En pleine faillite, Rad Power Bikes poursuit sa restructuration en fermant deux de ses magasins physiques en Am&#233;rique du Nord. L&#8217;entreprise am&#233;ricaine dispose d&#233;sormais de quelques semaines pour trouver un repreneur.
</description>
    </item>
    <item>
      <title>Chrome 150 sera la derni&#232;re version compatible avec ces vieux Mac</title>
      <link>https://www.01net.com/actualites/chrome-150-sera-la-derniere-version-compatible-avec-ces-vieux-mac.html</link>
      <pubDate>Tue, 13 Jan 2026 09:54:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319621</guid>
      <description>Google vient d&#8217;annoncer que son navigateur Web ne prendrait bient&#244;t plus en charge certains Mac un peu anciens. Chrome 150 sera la derni&#232;re version compatible avec les machines fonctionnant sous macOS 12 Monterey.</description>
    </item>
    <item>
      <title>Epson promet une image vraiment Cin&#233;ma avec son nouveau vid&#233;oprojecteur au son Bose sous Google TV &#224; seulement quelques centim&#232;tres du mur ou de l&#8217;&#233;cran</title>
      <link>https://www.frandroid.com/marques/epson/2939507_epson-promet-une-image-vraiment-cinema-avec-son-nouveau-videoprojecteur-au-son-bose-sous-google-tv-a-seulement-quelques-centimetres-du-mur-ou-de-lecran</link>
      <pubDate>Tue, 13 Jan 2026 09:51:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/epson/2939507_epson-promet-une-image-vraiment-cinema-avec-son-nouveau-videoprojecteur-au-son-bose-sous-google-tv-a-seulement-quelques-centimetres-du-mur-ou-de-lecran</guid>
      <description>
Epson annonce le Lifestudio Grand EH-LS970, un vid&#233;oprojecteur laser 4K &#224; focale ultra-courte de 4000 lumens, con&#231;u pour le home cin&#233;ma premium avec audio Bose int&#233;gr&#233; et Google TV. Con&#231;u pour ceux qui ne supportent pas l&#8217;effet arc-en-ciel des mod&#232;les DLP.
</description>
    </item>
    <item>
      <title>You can now claim a free Arc Raiders reward as the game soars past 12 million total players worldwide since launch &#8212; here&#8217;s how to get the Golden Raider Tool</title>
      <link>https://www.techradar.com/gaming/you-can-now-claim-a-free-arc-raiders-reward-as-the-game-soars-past-12-million-total-players-worldwide-since-launch-heres-how-to-get-the-golden-raider-tool</link>
      <pubDate>Tue, 13 Jan 2026 09:50:16 +0000</pubDate>
      <guid isPermaLink="false">f4fyfxsLRVQ5FPxifLxTun</guid>
      <description>Arc Raiders has surpassed 12 million players across all players. To celebrate, players can now login to claim a free Golden Raider Tool reward.</description>
    </item>
    <item>
      <title>P&#233;nurie de RAM : et si la Chine venait sauver le march&#233; PC europ&#233;en ?</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/2940387_penurie-de-ram-et-si-la-chine-venait-sauver-le-marche-pc-europeen</link>
      <pubDate>Tue, 13 Jan 2026 09:48:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/2940387_penurie-de-ram-et-si-la-chine-venait-sauver-le-marche-pc-europeen</guid>
      <description>
Alors que HP r&#233;fl&#233;chirait &#224; int&#233;grer de la m&#233;moire DRAM chinoise &#224; certains de ses PC portables, la Chine se place en v&#233;ritable alternative pour compenser la crise que traverse le march&#233; cette ann&#233;e.
</description>
    </item>
    <item>
      <title>Cette excellente station de recharge 3-en-1 compatible Qi2 est &#224; moiti&#233; prix pour les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2337684_cette-excellente-station-de-recharge-3-en-1-compatible-qi2-est-a-moitie-prix-pour-les-soldes</link>
      <pubDate>Tue, 13 Jan 2026 09:44:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2337684_cette-excellente-station-de-recharge-3-en-1-compatible-qi2-est-a-moitie-prix-pour-les-soldes</guid>
      <description>
La Belkin BoostCharge Pro est une station de recharge pratique qui va pouvoir recharger trois appareils Apple en m&#234;me temps, mais qui offre &#233;galement une compatibilit&#233; avec tous les appareils compatibles avec la norme Qi2. Un mod&#232;le polyvalent qui est &#224; son meilleur prix pour les soldes : 59,99 euros au lieu de 139,99 euros. 
</description>
    </item>
    <item>
      <title>Appels, autonomie, performances : ce qui change pour votre smartphone Pixel avec la nouvelle mise &#224; jour</title>
      <link>https://www.frandroid.com/marques/google/2940231_appels-autonomie-performances-ce-qui-change-pour-votre-smartphone-pixel-avec-la-nouvelle-mise-a-jour</link>
      <pubDate>Tue, 13 Jan 2026 09:42:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2940231_appels-autonomie-performances-ce-qui-change-pour-votre-smartphone-pixel-avec-la-nouvelle-mise-a-jour</guid>
      <description>
Une nouvelle mise &#224; jour Android vient apporter diff&#233;rents correctifs attendus pour les smartphones de Google.
</description>
    </item>
    <item>
      <title>Elon Musk et Mars&#160;: 2026 est arriv&#233;, le Starship est-il pr&#234;t pour l&#8217;impossible&#160;?</title>
      <link>https://www.01net.com/actualites/elon-musk-et-mars-2026-est-arrive-le-starship-est-il-pret-pour-limpossible.html</link>
      <pubDate>Tue, 13 Jan 2026 09:32:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319544</guid>
      <description>L'ann&#233;e fatidique est l&#224;. Elon Musk l'avait promis : SpaceX visera Mars &#171; fin 2026 &#187;. Alors que le compte &#224; rebours est lanc&#233;, entre alignement plan&#233;taire critique et d&#233;fis techniques, le Starship peut-il vraiment d&#233;coller cette ann&#233;e ?</description>
    </item>
    <item>
      <title>Plus de 1000 km d&#8217;autonomie : Volkswagen pr&#233;sente une &#233;tonnante voiture &#233;lectrique avec moteur essence</title>
      <link>https://www.frandroid.com/marques/volkswagen/2940207_plus-de-1000-km-dautonomie-volkswagen-presente-une-etonnante-voiture-electrique-avec-moteur-essence</link>
      <pubDate>Tue, 13 Jan 2026 09:30:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2940207_plus-de-1000-km-dautonomie-volkswagen-presente-une-etonnante-voiture-electrique-avec-moteur-essence</guid>
      <description>
Quelques jours apr&#232;s avoir d&#233;voil&#233; ses informations techniques, le nouveau Volkswagen ID. Era 9X se montre en image. L&#8217;occasion de d&#233;couvrir le style de cette voiture &#233;lectrique &#224; prolongateur, de quoi promettre une autonomie d&#233;mentielle.
</description>
    </item>
    <item>
      <title>Quel est le meilleur PC portable &#224; acheter pour moins de 1000 &#8364; en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/638396_quels-sont-les-meilleurs-pc-portables-a-moins-de-1000-euros-en-2019</link>
      <pubDate>Tue, 13 Jan 2026 09:30:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/638396_quels-sont-les-meilleurs-pc-portables-a-moins-de-1000-euros-en-2019</guid>
      <description>
On trouve aujourd'hui d'excellents ordinateurs portables avec un rapport qualit&#233;/prix int&#233;ressant. Mais l'offre est tr&#232;s vari&#233;e, alors comment choisir ? Voici nos recommandations des meilleurs mod&#232;les de PC portables sous les 1 000 euros.
</description>
    </item>
    <item>
      <title>&#171; Nous sommes devenus trop bureaucratiques &#187; : l&#8217;autocritique rare du patron de Canyon, qui vise &#171; 1 milliard &#187; de chiffre d&#8217;affaires</title>
      <link>https://www.frandroid.com/marques/canyon/2940389_nous-sommes-devenus-trop-bureaucratiques-lautocritique-rare-du-patron-de-canyon-qui-vise-1-milliard-de-chiffre-daffaires</link>
      <pubDate>Tue, 13 Jan 2026 09:19:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/canyon/2940389_nous-sommes-devenus-trop-bureaucratiques-lautocritique-rare-du-patron-de-canyon-qui-vise-1-milliard-de-chiffre-daffaires</guid>
      <description>
Dans un entretien accord&#233; au Financial Times, Roman Arnold d&#233;taille les priorit&#233;s strat&#233;giques de Canyon, alors que le fondateur a repris les commandes op&#233;rationnelles de la marque allemande en septembre 2025. Il y &#233;voque la situation financi&#232;re du groupe, ses axes de d&#233;veloppement et les ajustements internes initi&#233;s depuis son retour.
</description>
    </item>
    <item>
      <title>Fnac et Darty vendent au rabais de nombreux produits Tech lors des soldes d&#8217;hiver 2026</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-vendent-au-rabais-de-nombreux-produits-tech-lors-des-soldes-dhiver-2026</link>
      <pubDate>Tue, 13 Jan 2026 09:19:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-vendent-au-rabais-de-nombreux-produits-tech-lors-des-soldes-dhiver-2026</guid>
      <description>
&#192; la veille de la 2e d&#233;marque des soldes, Fnac et Darty fait le plein d'offres : on trouve des smartphones premium en pack &#224; prix cass&#233;, des TV &#224; moiti&#233; prix ou encore des laptops performants en r&#233;duction. D&#233;couvrez toutes les offres qui valent le coup. 
</description>
    </item>
    <item>
      <title>US Senators call on Apple and Google to ban X and Grok from app stores amid image-generation controversy</title>
      <link>https://www.techradar.com/ai-platforms-assistants/us-senators-call-on-apple-and-google-to-ban-x-and-grok-from-app-stores-amid-image-generation-controversy</link>
      <pubDate>Tue, 13 Jan 2026 09:17:08 +0000</pubDate>
      <guid isPermaLink="false">XhWNuGrxUKCS7sXSfpScXV</guid>
      <description>US Senators have told Apple and Google to take action over Grok creating explicit images of women and children.</description>
    </item>
    <item>
      <title>Pour pirater votre compte Facebook, les hackers ont une nouvelle tactique &#171;&#160;presque impossible &#224; d&#233;tecter&#160;&#187;</title>
      <link>https://www.01net.com/actualites/pour-pirater-votre-compte-facebook-les-hackers-ont-une-nouvelle-tactique-presque-impossible-a-detecter.html</link>
      <pubDate>Tue, 13 Jan 2026 09:01:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319594</guid>
      <description>Facebook reste le terrain de jeu pr&#233;f&#233;r&#233; des cybercriminels. Pour pirater votre compte, les cybercriminels redoublent d'ing&#233;niosit&#233;. Depuis quelques mois, les pirates s'appuient sur une nouvelle tactique de piratage qui est &#171; presque impossible &#224; d&#233;tecter &#187;. Elle comprend une fausse fen&#234;tre de connexion &#171; navigateur dans le navigateur &#187; qui permet de siphonner vos identifiants et mots de passe en quelques secondes....</description>
    </item>
    <item>
      <title>How to watch Tell Me Lies season 3 online from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/tell-me-lies-season-3-online</link>
      <pubDate>Tue, 13 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">DTfxUwVUb5WdESAxzSQWdY</guid>
      <description>Can Lucy and Stephen get things back on track after rekindling their relationship? Here&#8217;s how you can watch Tell Me Lies season 3 online and from anywhere.</description>
    </item>
    <item>
      <title>Nouvelle fuite de donn&#233;es en France&#160;: 150&#160;000 dossiers de patients vol&#233;s</title>
      <link>https://www.01net.com/actualites/fuite-donnees-doctolib-informations-milliers-francais-compromises.html</link>
      <pubDate>Tue, 13 Jan 2026 08:44:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318023</guid>
      <description>Doctolib s'est retrouv&#233; au c&#339;ur d'une nouvelle fuite de donn&#233;es ce week-end. Plus de 150 000 fiches patients issues de l&#8217;H&#244;pital priv&#233; de la Miotte et d&#8217;un cabinet d&#8217;ophtalmologie de Sallanches circulent sur le dark web. Les deux &#233;tablissements passaient par Doctolib pour permettre aux patients de prendre rendez-vous. Interrog&#233; par 01net, Doctolib d&#233;ment fermement toute violation et pr&#233;cise que les donn&#233;es n'ont pas &#233;t&#233; vol&#233;es sur ses serveurs. C'est &#233;galement le cas d'un des &#233;tablissements &#233;pingl&#233;s par les pirates....</description>
    </item>
    <item>
      <title>Nintendo&#160;: il n&#8217;y aurait pas de hausse des prix pour la Switch 2&#8230; pour l&#8217;instant</title>
      <link>https://www.01net.com/actualites/nintendo-il-ny-aurait-pas-de-hausse-des-prix-pour-la-switch-2-pour-linstant.html</link>
      <pubDate>Tue, 13 Jan 2026 08:31:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319590</guid>
      <description>L'&#233;volution des prix de la m&#233;moire vive est regard&#233;e comme le lait sur le feu par les constructeurs de produits informatiques. C'est le cas aussi chez Nintendo, mais il faut relativiser : si une hausse des prix de la Switch 2 devait intervenir, ce ne serait pas pour tout de suite.</description>
    </item>
  </channel>
</rss>
