<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 09 Dec 2025 09:28:51 GMT</lastBuildDate>
    <item>
      <title>Xiaomi brade son TV QLED XXL de 100 pouces (144 Hz) et s&#8217;affiche enfin &#224; un prix plus raisonnable</title>
      <link>https://www.frandroid.com/bons-plans/2819995_xiaomi-brade-son-tv-qled-xxl-de-100-pouces-144-hz-et-saffiche-enfin-a-un-prix-plus-raisonnable</link>
      <pubDate>Tue, 09 Dec 2025 09:18:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2819995_xiaomi-brade-son-tv-qled-xxl-de-100-pouces-144-hz-et-saffiche-enfin-a-un-prix-plus-raisonnable</guid>
      <description>
Un t&#233;l&#233;viseur de 100 pouces, c&#8217;est grand et le prix est aussi &#233;lev&#233; que sa taille. Mais c'est sans compter sur Xiaomi qui brade son gigantesque TV et se trouve maintenant &#224; 1 699 euros contre 1 999 euros de base. 
</description>
    </item>
    <item>
      <title>Bruxelles soup&#231;onne Google de b&#226;tir son empire de l&#8217;IA sur le dos des &#233;diteurs et des cr&#233;ateurs</title>
      <link>https://www.01net.com/actualites/bruxelles-soupconne-google-de-batir-son-empire-de-la-sur-le-dos-des-editeurs-et-des-createurs.html</link>
      <pubDate>Tue, 09 Dec 2025 09:12:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314459</guid>
      <description>Et une de plus ! Malgr&#233; la pression de l&#8217;administration Trump, la Commission europ&#233;enne continue d&#8217;aligner les entreprises am&#233;ricaines pour leurs pratiques anticoncurrentielles. Google se retrouve (encore une fois) dans la ligne de mire pour son exploitation des contenus en ligne afin d&#8217;entra&#238;ner son IA.</description>
    </item>
    <item>
      <title>01net Awards&#160;: le meilleur smartphone de 2025 est&#8230;</title>
      <link>https://www.01net.com/actualites/01net-awards-le-meilleur-smartphone-de-2025-est.html</link>
      <pubDate>Tue, 09 Dec 2025 09:03:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314371</guid>
      <description>La r&#233;daction de 01net.com d&#233;signe les meilleurs produits de l&#8217;ann&#233;e. D&#233;couvrez tous les jours les vainqueurs de chaque cat&#233;gorie jusqu&#8217;&#224; la remise des prix le 10 d&#233;cembre, en live s&#8217;il vous plait !</description>
    </item>
    <item>
      <title>More Parents Are Refusing Vitamin K for Their Newborns. Here&#8217;s Why That&#8217;s a Bad Idea</title>
      <link>https://gizmodo.com/more-parents-are-refusing-vitamin-k-for-their-newborns-heres-why-thats-a-bad-idea-2000696870</link>
      <pubDate>Tue, 09 Dec 2025 09:00:29 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000696870</guid>
      <description>For around 60 years, doctors have routinely given infants a vitamin K shot to prevent uncontrolled bleeding.</description>
    </item>
    <item>
      <title>01net Awards 2025&#160;: comment nous suivre en direct</title>
      <link>https://www.01net.com/actualites/01net-awards-2025-comment-nous-suivre-en-direct.html</link>
      <pubDate>Tue, 09 Dec 2025 08:54:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314450</guid>
      <description>C'est ce 10 d&#233;cembre &#224; 18h30 que la c&#233;r&#233;monie de remise des prix des 01net Awards 2025 a lieu. Qui sont les gagnants, comment nous suivre ? On vous r&#233;sume tout.</description>
    </item>
    <item>
      <title>The Garmin f&#275;nix 8 just got a $350 discount at Amazon &#8211; its best-ever price</title>
      <link>https://mashable.com/article/dec-9-garmin-fenix-8-deal</link>
      <pubDate>Tue, 09 Dec 2025 08:53:01 +0000</pubDate>
      <guid isPermaLink="false">01U1W552ZEQg4Ks87yv8FHT</guid>
      <description>Save 29% on the Garmin f&#275;nix 8 at Amazon.</description>
    </item>
    <item>
      <title>This Hisense 75-inch QD7 TV deal is its lowest-ever price at Amazon</title>
      <link>https://mashable.com/article/dec-9-hisense-qd7-deal</link>
      <pubDate>Tue, 09 Dec 2025 08:46:25 +0000</pubDate>
      <guid isPermaLink="false">06yFzYn4jW4rxyP5z3w9yjK</guid>
      <description>Save 25% on the Hisense 75-inch QD7 at Amazon.</description>
    </item>
    <item>
      <title>Espionnage&#160;: des alertes Apple et Google partout dans le monde, dont la France</title>
      <link>https://www.01net.com/actualites/espionnage-des-alertes-apple-et-google-partout-dans-le-monde-dont-la-france.html</link>
      <pubDate>Tue, 09 Dec 2025 08:45:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314443</guid>
      <description>D&#233;but d&#233;cembre, Apple et Google ont envoy&#233; des notifications de menace &#224; des utilisateurs d&#8217;iPhone et de smartphones Android partout dans le monde, y compris en France comme le rapporte le CERT-FR . Ces utilisateurs sont cibl&#233;s par des cyber criminels &#339;uvrant pour le compte d&#8217;organisations soutenues par des &#201;tats.</description>
    </item>
    <item>
      <title>The Samsung 32-Inch Odyssey G55C is back at its lowest-ever price at Amazon</title>
      <link>https://mashable.com/article/dec-9-samsung-odyssey-g55c-deal</link>
      <pubDate>Tue, 09 Dec 2025 08:40:44 +0000</pubDate>
      <guid isPermaLink="false">00ONNc2hKsqkE0rf4BniOJu</guid>
      <description>Save 39% on the Samsung 32-Inch Odyssey G55C at Amazon.</description>
    </item>
    <item>
      <title>Survols de drones en France&#160;: la base ultra-sensible de Creil a ripost&#233;, mais les appareils ont disparu</title>
      <link>https://www.01net.com/actualites/survols-drones-france-base-ultra-sensible-creil-riposte-mais-appareils-disparu.html</link>
      <pubDate>Tue, 09 Dec 2025 08:22:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314421</guid>
      <description>Des drones ont &#233;t&#233; identifi&#233;s au-dessus de la base militaire de Creil. Les d&#233;fenses ont tent&#233; d'abattre les engins, mais ceux-ci ont disparu dans la nuit. Il s'agit d'un nouveau site particuli&#232;rement sensible qui re&#231;oit la visite d'un essaim d'a&#233;ronefs.</description>
    </item>
    <item>
      <title>Apple Watch Series 11, SE 3, Ultra 2&#8230; quel mod&#232;le d&#8217;Apple Watch choisir en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/1674555_apple-watch-les-meilleures-montres-connectees-dapple-en-2023</link>
      <pubDate>Tue, 09 Dec 2025 08:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1674555_apple-watch-les-meilleures-montres-connectees-dapple-en-2023</guid>
      <description>
Les Apple Watch repr&#233;sentent un excellent choix de montres connect&#233;es pour les utilisateurs d&#8217;iPhone. Notre comparatif des diff&#233;rents mod&#232;les disponibles vous guidera dans le choix de l&#8217;Apple Watch la plus adapt&#233;e &#224; vos besoins.
</description>
    </item>
    <item>
      <title>D&#233;j&#224; 8 bless&#233;s signal&#233;s : pourquoi ces v&#233;los &#233;lectriques et m&#233;caniques sont rappel&#233;s en urgence</title>
      <link>https://www.frandroid.com/marques/cube/2902949_deja-8-blesses-signales-pourquoi-ces-velos-electriques-et-mecaniques-sont-rappeles-en-urgence</link>
      <pubDate>Tue, 09 Dec 2025 08:09:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/cube/2902949_deja-8-blesses-signales-pourquoi-ces-velos-electriques-et-mecaniques-sont-rappeles-en-urgence</guid>
      <description>
Trois fabricants de v&#233;los - Stromer, Klever Mobility et Cube - rappellent plusieurs de leurs mod&#232;les &#233;lectriques et m&#233;caniques apr&#232;s la d&#233;couverte d&#8217;un d&#233;faut sur une fourche WREN pouvant compromettre la s&#233;curit&#233; des cyclistes.
</description>
    </item>
    <item>
      <title>Amazon casse le prix de la Huawei Watch GT 5 version 46 mm, une montre connect&#233;e de sport ultra-endurante</title>
      <link>https://www.frandroid.com/bons-plans/2901965_amazon-casse-le-prix-de-la-huawei-watch-gt-5-version-46-mm-une-montre-connectee-de-sport-ultra-endurante</link>
      <pubDate>Tue, 09 Dec 2025 08:08:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2901965_amazon-casse-le-prix-de-la-huawei-watch-gt-5-version-46-mm-une-montre-connectee-de-sport-ultra-endurante</guid>
      <description>
Malgr&#233; la sortie r&#233;cente de la Huawei Watch GT 6, la Huawei Watch GT 5 demeure, un an apr&#232;s son lancement, une excellente montre de sport, qui a en plus l'avantage d'&#234;tre tr&#232;s endurante. Actuellement, Amazon la propose &#224; 169,99 euros au lieu de 269,99 euros. 
</description>
    </item>
    <item>
      <title>Fairphone's newest eco-friendly headphones have a feature I wish Bose or Sony would use &#8211; and the sound's good too</title>
      <link>https://www.techradar.com/audio/wireless-headphones/fairphone-fairbuds-xl-2025-review</link>
      <pubDate>Tue, 09 Dec 2025 08:05:00 +0000</pubDate>
      <guid isPermaLink="false">Hbu2n8mSsZ9t3kiaaTkgr</guid>
      <description>The most eco-friendly headphones just got a little bit eco friendlier &#8211; and slightly better sounding, too</description>
    </item>
    <item>
      <title>You can put the best part of Fairphone&amp;#8217;s new headphones into the older model</title>
      <link>https://www.theverge.com/news/839481/fairphone-xl-wireless-headphones-repairable-modular</link>
      <pubDate>2025-12-09T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=839481</guid>
      <description>Over two years after Fairphone introduced its first pair of modular and repairable wireless headphones, the company has announced an upgraded version. The new Fairbuds XL look similar to the originals but feature an updated design with more comfortable fabrics and improved sound thanks to new drivers. What's most interesting about these is that thanks [&#8230;]...</description>
    </item>
    <item>
      <title>Fairphone updates its over ear headphones with better sound</title>
      <link>https://www.engadget.com/audio/fairphone-updates-its-over-ear-headphones-with-better-sound-080000773.html?src=rss</link>
      <pubDate>Tue, 09 Dec 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">1b2023f2-cd30-4c42-9320-102883f95551</guid>
      <description>Two years ago, Fairphone launched a pair of modular, fully-repairable headphones called the Fairbuds XL. Now, the Dutch social enterprise is releasing an updated version where the focus isn&#8217;t just on the quality of its hardware, but on the merits of its raw materials.&#160;The 2025 Fairbuds XL ship with new &#8220;premium&#8221; 40mm dynamic drivers and stronger N52 rated magnets for &#8220;more power and enhanced bass response.&#8221; Listeners should expect to hear &#8220;improved accuracy in mid and high frequencies&#8221; thanks to improved audio tuning. And there&#8217;s a new paper-based speaker membrane that&#8217;s more refined than what...</description>
    </item>
    <item>
      <title>Many workers plan to quit after cashing their year-end bonus checks</title>
      <link>https://www.fastcompany.com/91456017/many-workers-plan-to-quit-after-cashing-their-year-end-bonus-checks</link>
      <pubDate>2025-12-09T08:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91456017/many-workers-plan-to-quit-after-cashing-their-year-end-bonus-checks</guid>
      <description>Despite a strong desire to move on, experts say there won&#8217;t be much room to maneuver in 2026.
A majority of those expecting a holiday bonus this year are planning to check out once the check clears.</description>
    </item>
    <item>
      <title>Gr&#226;ce &#224; l&#8217;Europe, vous pourrez bient&#244;t &#233;viter les publicit&#233;s cibl&#233;es sur Facebook et Instagram</title>
      <link>https://www.frandroid.com/marques/meta/2902943_grace-a-leurope-vous-pourrez-bientot-eviter-les-publicites-ciblees-sur-facebook-et-instagram</link>
      <pubDate>Tue, 09 Dec 2025 07:52:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2902943_grace-a-leurope-vous-pourrez-bientot-eviter-les-publicites-ciblees-sur-facebook-et-instagram</guid>
      <description>
Sous la menace d&#8217;une amende sal&#233;e de la part de la Commission europ&#233;enne, Meta va d&#233;ployer un syst&#232;me permettant aux internautes pr&#233;sents sur le Vieux Continent de recevoir des publicit&#233;s plus g&#233;n&#233;riques.
</description>
    </item>
  </channel>
</rss>
