<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 23 Dec 2025 17:24:33 GMT</lastBuildDate>
    <item>
      <title>Nvidia is reportedly reshuffling its cloud efforts to better combat growing competition</title>
      <link>https://www.techradar.com/pro/nvidia-is-reportedly-reshuffling-its-cloud-efforts-to-help-deal-with-growing-competition</link>
      <pubDate>Tue, 23 Dec 2025 17:20:00 +0000</pubDate>
      <guid isPermaLink="false">brFqgQR3sFPWTiQwnR2oSZ</guid>
      <description>Nvidia had reportedly scaled back its cloud businesses so as not to take on AWS, Azure and Google Cloud.</description>
    </item>
    <item>
      <title>Safety Panel Calls Out NASA for Downplaying the Boeing Starliner Mess</title>
      <link>https://gizmodo.com/safety-panel-calls-nasa-out-for-downplaying-the-boeing-starliner-mess-2000702881</link>
      <pubDate>Tue, 23 Dec 2025 17:15:50 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702881</guid>
      <description>The space agency failed to declare the spacecraft's thruster glitch as a mishap, creating confusion and uncertainty.</description>
    </item>
    <item>
      <title>US insurance giant Aflac says hackers stole personal and health data of 22.6 million</title>
      <link>https://techcrunch.com/2025/12/23/us-insurance-giant-aflac-says-hackers-stole-personal-data-of-22-6-million/</link>
      <pubDate>Tue, 23 Dec 2025 17:14:04 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078570</guid>
      <description>Aflac, one of the largest insurance companies in the U.S., confirmed hackers stole reams of personal data, including Social Security numbers, identity documents, and health information.</description>
    </item>
    <item>
      <title>L&#8217;excellent Samsung Galaxy A56 accompagn&#233; de son &#233;clatante dalle Amoled perd 42 % de son prix</title>
      <link>https://www.frandroid.com/bons-plans/2919741_lexcellent-samsung-galaxy-a56-accompagne-de-son-eclatante-dalle-amoled-perd-42-de-son-prix</link>
      <pubDate>Tue, 23 Dec 2025 17:06:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2919741_lexcellent-samsung-galaxy-a56-accompagne-de-son-eclatante-dalle-amoled-perd-42-de-son-prix</guid>
      <description>
Le Samsung A56 est un super smartphone de milieu de gamme, notamment gr&#226;ce &#224; une superbe dalle Amoled. Chez Amazon, il tombe &#224; 289 euros et s'approche des t&#233;l&#233;phones les plus abordables du march&#233;.
</description>
    </item>
    <item>
      <title>Forfaits Sosh : ce qu&#8217;il faut savoir sur les offres internet et mobiles de l&#8217;op&#233;rateur low-cost d&#8217;Orange</title>
      <link>https://www.frandroid.com/services/operateurs-mobiles/1629865_sosh-notre-avis-sur-loperateur-low-cost-dorange-en-2023</link>
      <pubDate>Tue, 23 Dec 2025 17:02:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/operateurs-mobiles/1629865_sosh-notre-avis-sur-loperateur-low-cost-dorange-en-2023</guid>
      <description>
Sosh est la filiale low-cost d'Orange, elle permet de profiter du r&#233;seau de l'op&#233;rateur historique &#224; un prix plus accessible et sans engagement. Cette ann&#233;e, Sosh a consid&#233;rablement modernis&#233; son offre avec notamment l'arriv&#233;e d'une box Wi-Fi 7 &#224; bas co&#251;t comme ce que fait B&amp;YOU, mais le reste est-il &#224; la hauteur ?
</description>
    </item>
    <item>
      <title>Droit d&#8217;auteur&#160;: une nouvelle plainte vise six g&#233;ants de l&#8217;IA aux &#201;tats-Unis</title>
      <link>https://www.01net.com/actualites/droit-dauteur-une-nouvelle-plainte-vise-six-geants-de-lia-aux-etats-unis.html</link>
      <pubDate>Tue, 23 Dec 2025 17:01:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316866</guid>
      <description>Des auteurs ont d&#233;cid&#233;, outre Atlantique, de porter plainte contre les principales soci&#233;t&#233;s de l'IA. Comme dans d'autres proc&#233;dures, les &#233;crivains accusent les g&#233;ants du secteur d'avoir utilis&#233; des biblioth&#232;ques illicites, dans lesquelles se trouvent leurs oeuvres, pour entra&#238;ner leurs syst&#232;mes. Ce sans autorisation et en violation de leur droit d'auteur, selon ces derniers....</description>
    </item>
    <item>
      <title>Les astronomes stup&#233;faits : la temp&#234;te g&#233;ante de Jupiter oscille comme un bol de g&#233;latine</title>
      <link>https://www.futura-sciences.com/sciences/actualites/systeme-solaire-astronomes-stupefaits-tempete-geante-jupiter-oscille-comme-bol-gelatine-c7g3-128692/#xtor%3DRSS-8</link>
      <pubDate>Tue, 23 Dec 2025 18:01:03 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/systeme-solaire-astronomes-stupefaits-tempete-geante-jupiter-oscille-comme-bol-gelatine-c7g3-128692/#xtor%3DRSS-8</guid>
      <description>La Grande tache rouge de Jupiter est observ&#233;e par les astronomes depuis au moins 150&#160;ans.&#160;Ils&#160;ont r&#233;cemment d&#233;couvert&#160;un comportement tout &#224; fait inattendu gr&#226;ce au t&#233;lescope spatial Hubble.</description>
    </item>
    <item>
      <title>&#8216;Anaconda&#8217; Slithers on That Line of So Bad, It&#8217;s Good</title>
      <link>https://gizmodo.com/anaconda-movie-review-jack-black-paul-rudd-2000702059</link>
      <pubDate>Tue, 23 Dec 2025 17:00:46 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702059</guid>
      <description>Jack Black, Paul Rudd, Steve Zahn, and Thandiwe Newton star in the meta comedy remake, out Christmas Day.</description>
    </item>
    <item>
      <title>This founder just landed funding for a second go at the same problem: affordable custom home design</title>
      <link>https://techcrunch.com/2025/12/23/this-founder-just-landed-backing-for-a-second-go-at-the-same-problem-affordable-custom-home-design/</link>
      <pubDate>Tue, 23 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078462</guid>
      <description>Drafted is now nearly five months old, and it's everything Atmos wasn't.</description>
    </item>
    <item>
      <title>Here are the best live service games to spend the Holiday season in, from Fortnite&#8217;s cozy Winterfest to the snow-covered hills of Arc Raiders</title>
      <link>https://www.techradar.com/gaming/here-are-the-best-live-service-games-to-spend-the-holiday-season-in-from-fortnites-cozy-winterfest-to-the-snow-covered-hills-of-arc-raiders</link>
      <pubDate>Tue, 23 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">jNCn96y93nYL6PxeRvWpff</guid>
      <description>It's time to settle into the various Holiday events currently running in live service games. Here's my picks for the 6 best that are worth your time over Christmas.</description>
    </item>
    <item>
      <title>Prime members can claim loads of free games in latest Amazon giveaway including one of the best PC strategy games ever</title>
      <link>https://www.techradar.com/gaming/prime-members-can-claim-loads-of-free-games-in-latest-amazon-giveaway-including-one-of-the-best-pc-strategy-games-ever</link>
      <pubDate>Tue, 23 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">RPxAxko4iVhhzQwf4aeRsZ</guid>
      <description>Amazon Prime members shouldn't miss the current deluge of free games available with Luna.</description>
    </item>
    <item>
      <title>Voici le meilleur smartphone de l&#8217;ann&#233;e &#8211; Frandroid Awards 2025</title>
      <link>https://www.frandroid.com/marques/samsung/2896283_voici-le-meilleur-smartphone-de-lannee-frandroid-awards-2025</link>
      <pubDate>Tue, 23 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2896283_voici-le-meilleur-smartphone-de-lannee-frandroid-awards-2025</guid>
      <description>
Parmi les mod&#232;les test&#233;s par Frandroid, le Samsung Galaxy S25 Ultra se distingue en recevant le prix du meilleur smartphone de 2025 lors des Frandroid Awards avec Delos. Voici pourquoi.
</description>
    </item>
    <item>
      <title>Marissa Mayer&#8217;s new startup Dazzle raises $8M led by Forerunner&#8217;s Kirsten Green</title>
      <link>https://techcrunch.com/2025/12/23/marissa-mayers-new-startup-dazzle-raises-8m-led-by-forerunners-kirsten-green/</link>
      <pubDate>Tue, 23 Dec 2025 16:48:45 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078478</guid>
      <description>Mayer launched Dazzle after shuttering her photo and contact management startup Sunshine.</description>
    </item>
    <item>
      <title>Cyberattaque La Poste&#160;: des hackers prorusses revendiquent la paralysie des services</title>
      <link>https://www.01net.com/actualites/cyberattaque-la-poste-des-hackers-prorusses-revendiquent-la-paralysie-des-services.html</link>
      <pubDate>Tue, 23 Dec 2025 16:47:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316924</guid>
      <description>Alors que les services en ligne de La Poste reviennent p&#233;niblement &#224; la normale ce mardi, une piste se dessine sur l'identit&#233; des assaillants. Le groupe de cybercriminels prorusses &#171; NoName057(16) &#187; a revendiqu&#233; l'attaque sur les r&#233;seaux sociaux. Une information &#224; prendre avec pr&#233;caution, qui n'a pas &#233;t&#233; confirm&#233;e par l'entreprise publique.</description>
    </item>
    <item>
      <title>Trump&#8217;s War on Offshore Wind Is a Gut Punch to the AI Boom</title>
      <link>https://gizmodo.com/trumps-war-on-offshore-wind-is-a-gut-punch-to-the-ai-boom-2000702936</link>
      <pubDate>Tue, 23 Dec 2025 16:45:44 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702936</guid>
      <description>U.S. electricity consumption is growing for the first time in a decade l due to AI, so why are we stunting renewable energy development?</description>
    </item>
    <item>
      <title>Xbox cloud gaming comes to newer Amazon Fire TV models</title>
      <link>https://www.engadget.com/gaming/xbox/xbox-cloud-gaming-comes-to-newer-amazon-fire-tv-models-163517432.html?src=rss</link>
      <pubDate>Tue, 23 Dec 2025 16:35:17 +0000</pubDate>
      <guid isPermaLink="false">976bab01-5aef-428b-98aa-a44da5067130</guid>
      <description>Xbox has brought cloud gaming gaming to some Amazon Fire TV models. These include the Fire TV 4-Series and the Fire TV Omni QLED Series. This lets people play Xbox games directly on the television, without needing a bulky console or even something like a Fire TV stick.&#160;
Gamers do need a couple of things. First and foremost, this service requires a subscription to Game Pass. Plans start at $10 a month and shoot all the way up to $30 per month. They'll also need a compatible wireless controller, though most Bluetooth-enabled gamepads should work.
Amazon
The feature works for every game on the Ga...</description>
    </item>
    <item>
      <title>Une &#171; grosse claque &#187; : le patron europ&#233;en du design Stellantis nous explique comment l&#8217;IA leur permet de gagner du temps et de l&#8217;argent</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2901117_une-grosse-claque-le-patron-europeen-du-design-stellantis-nous-explique-comment-lia-leur-permet-de-gagner-du-temps-et-de-largent</link>
      <pubDate>Tue, 23 Dec 2025 16:34:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2901117_une-grosse-claque-le-patron-europeen-du-design-stellantis-nous-explique-comment-lia-leur-permet-de-gagner-du-temps-et-de-largent</guid>
      <description>
Apr&#232;s une br&#232;ve excursion chez Renault, Gilles Vidal revient chez Stellantis pour chapeauter le design des marques europ&#233;ennes du groupe. Nous l'avons rencontr&#233; pour discuter du futur du design automobile &#224; l'&#232;re de la voiture &#233;lectrique, de l'intelligence artificielle et des innombrables marques chinoises.
</description>
    </item>
    <item>
      <title>FCC bans new foreign-made drones over national security concerns</title>
      <link>https://www.fastcompany.com/91465772/fcc-bans-new-foreign-chinese-made-drones-national-security</link>
      <pubDate>2025-12-23T16:33:31</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91465772/fcc-bans-new-foreign-chinese-made-drones-national-security</guid>
      <description>The FCC cited upcoming major events, including the 2026 World Cup, as reasons to address potential drone threats.
The Federal Communications Commission on Monday said it would ban new foreign-made drones, a move that will keep new Chinese-made drones such as those from DJI and Autel out of the U.S. market.</description>
    </item>
    <item>
      <title>DOJ appears to bungle Epstein Files redactions</title>
      <link>https://www.theverge.com/news/849639/epstein-files-doj-redactions-links</link>
      <pubDate>2025-12-23T11:33:23-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=849639</guid>
      <description>The Justice Department has blamed its delayed release of some so-called Epstein files on needing more time to redact sensitive information, like details identifying the victims of convicted sex offender Jeffrey Epstein. But at least some of the redactions so far released appear to mistakenly disclose information meant to be obscured from the public. A [&#8230;]...</description>
    </item>
    <item>
      <title>Au Br&#233;sil aussi, Apple va devoir ouvrir l&#8217;App Store &#224; la concurrence</title>
      <link>https://www.01net.com/actualites/au-bresil-aussi-apple-va-devoir-ouvrir-lapp-store-a-la-concurrence.html</link>
      <pubDate>Tue, 23 Dec 2025 16:30:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316911</guid>
      <description>Sous la pression des r&#233;gulateurs, Apple consent &#224; une nouvelle entaille dans l&#8217;armure de l&#8217;App Store. Au Br&#233;sil, le groupe s&#8217;est engag&#233; &#224; ouvrir son &#233;cosyst&#232;me &#224; des paiements et boutiques alternatives, mettant fin &#224; une enqu&#234;te antitrust &#8212; sans renoncer pour autant &#224; ses commissions, ni &#224; sa strat&#233;gie d&#8217;ouverture au compte-gouttes.</description>
    </item>
    <item>
      <title>The Boox Note Air 5C Makes Me More Excited for the Next Generation of Color E-Notetakers</title>
      <link>https://gizmodo.com/boox-note-air-5c-review-excited-for-next-generation-of-color-e-readers-2000702650</link>
      <pubDate>Tue, 23 Dec 2025 16:30:17 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702650</guid>
      <description>Yes, the Boox Note Air 5C is less expensive than a Kindle Scribe Colorsoft. It's still not cheap by any standard.</description>
    </item>
    <item>
      <title>Watch lists are broken. Federation could fix them.</title>
      <link>https://www.theverge.com/column/849255/watch-lists-broken-federation-share-data</link>
      <pubDate>2025-12-23T11:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=849255</guid>
      <description>This is Lowpass by Janko Roettgers, a newsletter on the ever-evolving intersection of tech and entertainment, syndicated just for The Verge subscribers once a week. Lowpass is taking a winter break and will be back on January 8, 2026. All I want for Christmas is to find that darn movie I've been meaning to watch. [&#8230;]</description>
    </item>
    <item>
      <title>La &#171;&#160;refonte&#160;&#187; 3G de Free tourne au cauchemar pour certains smartphones</title>
      <link>https://www.frandroid.com/marques/free/2920091_la-refonte-3g-de-free-tourne-au-cauchemar-pour-certains-smartphones</link>
      <pubDate>Tue, 23 Dec 2025 16:23:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2920091_la-refonte-3g-de-free-tourne-au-cauchemar-pour-certains-smartphones</guid>
      <description>
Votre t&#233;l&#233;phone affiche "4G", vos donn&#233;es fonctionnent, mais vos appels coupent ou n'aboutissent jamais ? Ne cherchez pas, ce n'est pas une panne temporaire. C'est structurel. Free est en train de transformer son r&#233;seau, et si votre smartphone n'est pas pr&#234;t, vous risquez bien plus qu'une conversation manqu&#233;e. 
</description>
    </item>
    <item>
      <title>New York&#8217;s landmark AI safety bill was defanged &#8212; and universities were part of the push against it</title>
      <link>https://www.theverge.com/ai-artificial-intelligence/849293/ai-alliance-universities-colleges-funding-ad-campaign-against-raise-act</link>
      <pubDate>2025-12-23T11:18:49-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=849293</guid>
      <description>A group of tech companies and academic institutions spent tens of thousands of dollars in the past month - likely between $17,000 and $25,000 - on an ad campaign against New York's landmark AI safety bill, which may have reached more than two million people, according to Meta's Ad Library. The landmark bill is called [&#8230;]</description>
    </item>
    <item>
      <title>Dyson Spot+Scrub Ai robot vacuum first impressions: an impressive featureset but a disappointing app</title>
      <link>https://www.techradar.com/home/robot-vacuums/dyson-spot-scrub-ai-first-impressions</link>
      <pubDate>Tue, 23 Dec 2025 16:17:29 +0000</pubDate>
      <guid isPermaLink="false">HoX8MCb9p4cS2i2ccBCFY5</guid>
      <description>All I want for Christmas is a Dyson robovac redemption &#8211; can the Spot+Scrub Ai deliver it?</description>
    </item>
    <item>
      <title>New York Times reporter files lawsuit against AI companies</title>
      <link>https://www.engadget.com/ai/new-york-times-reporter-files-lawsuit-against-ai-companies-161624268.html?src=rss</link>
      <pubDate>Tue, 23 Dec 2025 16:16:24 +0000</pubDate>
      <guid isPermaLink="false">0a2b6ba1-a862-46c1-945f-94803697dae6</guid>
      <description>Investigative reporter John Carreyrou of the New York Times filed a lawsuit against xAI, Anthropic, Google, OpenAI, Meta and Perplexity on Monday for allegedly training their AI models on copyrighted books without permission. Carreyrou is perhaps best known for exposing the Theranos fraudulent blood test scandal.
According to Reuters, the lawsuit was filed alongside five other writers who all claim big tech companies have been violating their intellectual property rights in the name of building large language models.
This comes after a banner year for IP lawsuits against AI companies brought b...</description>
    </item>
    <item>
      <title>Nissan says Red Hat breach affected thousands of customers</title>
      <link>https://www.techradar.com/pro/security/nissan-says-red-hat-breach-affected-thousands-of-customers</link>
      <pubDate>Tue, 23 Dec 2025 16:10:00 +0000</pubDate>
      <guid isPermaLink="false">spAJwDtevwvNLaqriy6UzY</guid>
      <description>The September 2025 breach at Red Hat also exposed Nissan customer files -affecting around 21,000 people.</description>
    </item>
    <item>
      <title>Dozens of Flock AI camera feeds were just out there</title>
      <link>https://www.theverge.com/news/849624/flock-ai-camera-feeds-exposed-benn-jordan</link>
      <pubDate>2025-12-23T11:09:58-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=849624</guid>
      <description>The livestreams connected to more than 60 of Flock's AI-powered surveillance cameras were left available to view on the web, allowing someone to see live feeds of each location without needing a username or password, according to findings from tech YouTuber Benn Jordan and 404 Media. Flock is a technology company that works with thousands [&#8230;]</description>
    </item>
    <item>
      <title>&#8216;It&#8217;s good to have limitations&#8217;: Clair Obscur: Expedition 33's creative director says Sandfall Interactive's next game won&#8217;t on a bigger scale despite huge success</title>
      <link>https://www.techradar.com/gaming/its-good-to-have-limitations-clair-obscur-expedition-33s-creative-director-says-sandfall-interactives-next-game-wont-on-a-bigger-scale-despite-huge-success</link>
      <pubDate>Tue, 23 Dec 2025 16:07:35 +0000</pubDate>
      <guid isPermaLink="false">SzmXJKYkkrFJDm6UaYV3tC</guid>
      <description>Sandfall Interactive's CEO and creative director, Guillaume Broche, has said the studio won't be expanding the scale of its next game, despite Clair Obscur: Expedition 33's success, because it loves "making games more than we love managing."</description>
    </item>
    <item>
      <title>Des Galaxy S Ultra et Z Fold &#224; 400 euros : la police d&#233;mant&#232;le une fabrique de faux Samsung</title>
      <link>https://www.frandroid.com/marques/samsung/2920031_des-galaxy-s-ultra-et-z-fold-a-400-euros-la-police-demantele-une-fabrique-de-faux-samsung</link>
      <pubDate>Tue, 23 Dec 2025 16:06:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2920031_des-galaxy-s-ultra-et-z-fold-a-400-euros-la-police-demantele-une-fabrique-de-faux-samsung</guid>
      <description>
Une vaste op&#233;ration de contrefa&#231;on de smartphones Samsung a &#233;t&#233; d&#233;mantel&#233;e &#224; New Delhi. Quatre individus assemblaient des mod&#232;les Galaxy S Ultra, Z Fold et Z Flip &#224; partir de composants import&#233;s de Chine pour les revendre.
</description>
    </item>
    <item>
      <title>Fuel their curiosity for less &#8212; save $28 on the Amazon Echo Dot Kids smart speaker</title>
      <link>https://www.techradar.com/home/smart-speakers/fuel-their-curiosity-for-less-save-usd28-on-the-amazon-echo-dot-kids-smart-speaker</link>
      <pubDate>Tue, 23 Dec 2025 16:06:00 +0000</pubDate>
      <guid isPermaLink="false">eVcbCggoZSPAD8SDHRrniW</guid>
      <description>With parental controls, an extended warranty, and a one-year subscription to Amazon Kids+, this is a deal worth taking.</description>
    </item>
    <item>
      <title>Les plaques d&#8217;immatriculation roses d&#233;barquent en France le 1er janvier 2026, voici pourquoi</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2835417_les-plaques-dimmatriculation-roses-debarquent-en-france-le-1er-janvier-2026-voici-pourquoi</link>
      <pubDate>Tue, 23 Dec 2025 16:05:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2835417_les-plaques-dimmatriculation-roses-debarquent-en-france-le-1er-janvier-2026-voici-pourquoi</guid>
      <description>
Aujourd'hui, une plaque provisoire WW ressemble exactement &#224; une plaque normale. M&#234;me format blanc, m&#234;me typo. Demain, elles seront roses.
</description>
    </item>
    <item>
      <title>9 of the best gift cards available in the UK with immediate delivery &#8212; Amazon, PlayStation, Ikea, John Lewis, and more</title>
      <link>https://www.techradar.com/seasonal-sales/9-of-the-best-gift-cards-available-in-the-uk-with-immediate-delivery-amazon-playstation-ikea-john-lewis-and-more</link>
      <pubDate>Tue, 23 Dec 2025 16:05:00 +0000</pubDate>
      <guid isPermaLink="false">UQJ8MJtuf5D9rwxFtL4QpP</guid>
      <description>Missed the final shipping days, but still need a last-minute gift? No problem - here are some of the best gift cards available this Christmas with immediate digital delivery.</description>
    </item>
    <item>
      <title>Amazon&#8217;s AI assistant Alexa+ now works with Angi, Expedia, Square, and Yelp</title>
      <link>https://techcrunch.com/2025/12/23/amazons-ai-assistant-alexa-now-works-with-angi-expedia-square-and-yelp/</link>
      <pubDate>Tue, 23 Dec 2025 16:04:57 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078530</guid>
      <description>The new integrations join other services like Yelp, Uber, OpenTable and others.</description>
    </item>
    <item>
      <title>J&#8217;adore la tech, mais je ne suis pas s&#251;r de vouloir de Google Gemini dans mon frigo Samsung</title>
      <link>https://www.frandroid.com/marques/samsung/2920035_jadore-la-tech-mais-je-ne-suis-pas-sur-de-vouloir-que-google-scanne-mon-frigo-samsung</link>
      <pubDate>Tue, 23 Dec 2025 16:02:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2920035_jadore-la-tech-mais-je-ne-suis-pas-sur-de-vouloir-que-google-scanne-mon-frigo-samsung</guid>
      <description>
On connaissait les frigos connect&#233;s. Samsung a du nouveau pour le CES 2026 avec une approche radicale : utiliser la vision par ordinateur de Google Gemini pour scanner l'int&#233;rieur de vos bo&#238;tes de conservation. L'id&#233;e ? Vous dire quoi cuisiner avec vos restes. Le prix &#224; payer ? Google s'invite (encore plus) dans votre intimit&#233;.
</description>
    </item>
    <item>
      <title>Tesla ferait rouler un nombre ridicule de robotaxis &#224; Austin</title>
      <link>https://www.01net.com/actualites/tesla-ferait-rouler-un-nombre-ridicule-de-robotaxis-a-austin.html</link>
      <pubDate>Tue, 23 Dec 2025 16:02:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316884</guid>
      <description>Le service de robotaxis Tesla lanc&#233; cet &#233;t&#233; &#224; Austin serait un miroir aux alouettes. Les donn&#233;es collect&#233;es par un &#233;tudiant ing&#233;nieur montre que le constructeur ferait circuler moins d'une dizaine de v&#233;hicules autonomes (chacun avec un superviseur humain au volant) dans la ville texane. Un volume ridicule, mais qui n'emp&#234;che pas Elon Musk d'annoncer monts et merveilles....</description>
    </item>
    <item>
      <title>Japan will restart the world&#8217;s largest nuclear plant after clearing this last major hurdle</title>
      <link>https://www.fastcompany.com/91465767/japan-restart-worlds-largest-nuclear-plant-after-clearing-last-major-hurdle</link>
      <pubDate>2025-12-23T16:01:54</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91465767/japan-restart-worlds-largest-nuclear-plant-after-clearing-last-major-hurdle</guid>
      <description>The Kashiwazaki-Kariwa plant, which has been offline since 2012, is made up of seven reactors. 
The governor of Niigata on Tuesday formally gave local consent to put two reactors at the Kashiwazaki-Kariwa nuclear power plant in the north-central prefecture back online, clearing a last hurdle toward restarting the plant idled for more than a decade following the 2011 meltdowns at another plant managed by the same utility....</description>
    </item>
    <item>
      <title>Is Doctor Doom going after all the super babies in Avengers: Doomsday?</title>
      <link>https://mashable.com/article/avengers-doomsday-is-doctor-doom-going-after-all-the-superbabies</link>
      <pubDate>Tue, 23 Dec 2025 16:01:41 +0000</pubDate>
      <guid isPermaLink="false">06b8v2PxLQZy7ItUUdDE5z2</guid>
      <description>Between "Fantastic Four: First Steps" end-credits scene and the "Avengers: Doomsday" trailer, it seems like Doctor Doom is going after kids.</description>
    </item>
    <item>
      <title>Watch ILM Recreate the Death Star Trench Run Out of Virtual Gingerbread</title>
      <link>https://gizmodo.com/star-wars-minis-trailer-ilm-death-star-gingerbread-2000702916</link>
      <pubDate>Tue, 23 Dec 2025 16:00:25 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702916</guid>
      <description>The festive short kicks off a new 'Star Wars Minis' series that recreates classic moments from film and TV in new materials and styles.</description>
    </item>
    <item>
      <title>Belkin&#8217;s camera grip power bank is a few upgrades away from being a must-have</title>
      <link>https://www.theverge.com/gadgets/847321/belkin-stage-powergrip-wireless-power-bank-hands-on</link>
      <pubDate>2025-12-23T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=847321</guid>
      <description>Belkin's Stage PowerGrip has shown me that I should be asking more from a wireless magnetic power bank than just boosting battery life while it hangs off the back of my phone. Its clever design adds layers of extra functionality, and the inclusion of a retractable two-way charging cable expands the number of devices you [&#8230;]</description>
    </item>
    <item>
      <title>Lemon Slice nabs $10.5M from YC and Matrix to build out its digital avatar tech</title>
      <link>https://techcrunch.com/2025/12/23/lemon-slice-nabs-10-5m-from-yc-and-matrix-to-build-out-its-digital-avatar-tech/</link>
      <pubDate>Tue, 23 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078171</guid>
      <description>Digital avatar generation company Lemon Slice is working to add a video layer to AI chatbots with a new diffusion model that can create digital avatars from a single image.</description>
    </item>
    <item>
      <title>How to watch Arsenal vs Crystal Palace for *FREE* &#8212; Stream Carabao Cup Quarter-Final 25/26</title>
      <link>https://www.techradar.com/how-to-watch/football/arsenal-vs-crystal-palace-carabao-cup-quarter-final-25-26-free</link>
      <pubDate>Tue, 23 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">jnsVskvW7yxc2ZAVVSsYzY</guid>
      <description>All the ways to watch Arsenal vs Crystal Palace live streams, with Ebere Eze and Eddie Nketiah set to face their old sides in the Carabao Cup quarter-finals.</description>
    </item>
    <item>
      <title>Ce chargeur ultra-rapide Realme (120 W) co&#251;te moins de 20 &#8364;, mais &#231;a ne va pas durer</title>
      <link>https://www.frandroid.com/bons-plans/2919507_ce-chargeur-ultra-rapide-realme-120-w-coute-moins-de-20-e-mais-ca-ne-va-pas-durer</link>
      <pubDate>Tue, 23 Dec 2025 15:55:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2919507_ce-chargeur-ultra-rapide-realme-120-w-coute-moins-de-20-e-mais-ca-ne-va-pas-durer</guid>
      <description>
Compact et puissant, le chargeur Realme SuperVOOC de 120 W permet aux appareils compatibles d'atteindre les 100 % en un rien de temps. Actuellement, Amazon le propose &#224; 19,99 euros au lieu de 29,99 euros, aujourd'hui uniquement.
</description>
    </item>
    <item>
      <title>One last holiday hurrah for the $50 off deal on the Switch 2</title>
      <link>https://www.theverge.com/gadgets/849552/switch-2-bundle-gaming-ps5-holiday-deal-sale</link>
      <pubDate>2025-12-23T10:51:11-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=849552</guid>
      <description>In case you&#8217;ve waited until the very last minute to buy Christmas gifts, and there&#8217;s a Switch 2 on your shopping list, you&#8217;ve really lucked out here. Not only is Nintendo&#8217;s powerful handheld readily available online and in stores, it&#8217;s still $50 off for the best console bundle you can buy. The set that includes [&#8230;]</description>
    </item>
    <item>
      <title>The Wegovy Weight-Loss Pill Is Officially Here</title>
      <link>https://gizmodo.com/the-wegovy-pill-is-officially-here-2000702882</link>
      <pubDate>Tue, 23 Dec 2025 15:50:31 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702882</guid>
      <description>It's the first GLP-1 pill approved for treating obesity.</description>
    </item>
    <item>
      <title>Top DOJ Official Shut Down Enforcement Against Crypto Companies While Holding More Than $150,000 in Crypto Investments</title>
      <link>https://gizmodo.com/top-doj-official-shut-down-enforcement-against-crypto-companies-while-holding-more-than-150000-in-crypto-investments-2000702901</link>
      <pubDate>Tue, 23 Dec 2025 15:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702901</guid>
      <description>The second-highest official at the DOJ, Todd Blanche rose to prominence as Trump&#8217;s personal defense attorney. His actions violated the federal conflicts of interest law and his ethics agreement, experts say.</description>
    </item>
    <item>
      <title>France&#8217;s postal and banking services disrupted by suspected DDoS attack</title>
      <link>https://techcrunch.com/2025/12/23/frances-postal-and-banking-services-disrupted-by-suspected-ddos-attack/</link>
      <pubDate>Tue, 23 Dec 2025 15:42:23 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078527</guid>
      <description>France's postal service, La Poste, said it was hit by a disruptive cyberattack that knocked its services offline.</description>
    </item>
    <item>
      <title>Surfshark expands dedicated IP to Linux in its latest desktop update</title>
      <link>https://www.techradar.com/vpn/vpn-services/surfshark-expands-dedicated-ip-to-linux-in-its-latest-desktop-update</link>
      <pubDate>Tue, 23 Dec 2025 15:39:52 +0000</pubDate>
      <guid isPermaLink="false">Qj4r2MMTdvvQiDq8bmSEMf</guid>
      <description>Surfshark has added dedicated IP support to its Linux GUI app, extending a feature it&#8217;s been focusing on since 2023.</description>
    </item>
    <item>
      <title>The Samsung Galaxy Tab A9 Plus is back to its super-cheap Black Friday price</title>
      <link>https://www.techradar.com/tablets/the-samsung-galaxy-tab-a9-plus-is-back-to-its-super-cheap-black-friday-price</link>
      <pubDate>Tue, 23 Dec 2025 15:35:00 +0000</pubDate>
      <guid isPermaLink="false">ZYAKRi9N4nEhQiUyp6BfUY</guid>
      <description>The Samsung Galaxy Tab A9 Plus is a basic entry-level tablet, and it's now back down to its super-low Black Friday price on Amazon.</description>
    </item>
    <item>
      <title>Quel est le meilleur des iPhone : la s&#233;lection des mod&#232;les &#224; acheter (et ceux &#224; &#233;viter)</title>
      <link>https://www.frandroid.com/guide-dachat/smartphones/705312_meilleur-iphone</link>
      <pubDate>Tue, 23 Dec 2025 15:32:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/smartphones/705312_meilleur-iphone</guid>
      <description>
Faut-il acheter le dernier iPhone ou bien opter pour un autre smartphone de chez Apple ? C'est &#224; cette question que nous allons tenter de r&#233;pondre dans ce guide d'achat. Quel iPhone choisir ? Voici les conseils et recommandations de la r&#233;daction de Frandroid.
</description>
    </item>
    <item>
      <title>This Modern &#8216;Game Boy&#8217; Can Play Dreamcast, GameCube, and PS2 Games</title>
      <link>https://gizmodo.com/ayaneo-pocket-vert-can-play-dreamcast-gamecube-and-ps2-games-2000702884</link>
      <pubDate>Tue, 23 Dec 2025 15:30:27 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702884</guid>
      <description>It looks pretty solid!</description>
    </item>
    <item>
      <title>YggTorrent au bord de l&#8217;implosion&#160;: la guerre est d&#233;clar&#233;e entre le site pirate et sa communaut&#233;</title>
      <link>https://www.01net.com/actualites/yggtorrent-au-bord-de-limplosion-la-guerre-est-declaree-entre-le-site-pirate-et-sa-communaute.html</link>
      <pubDate>Tue, 23 Dec 2025 15:28:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316887</guid>
      <description>C'est une fronde in&#233;dite qui secoue le g&#233;ant du t&#233;l&#233;chargement ill&#233;gal fran&#231;ais. Depuis ce d&#233;but de semaine, YggTorrent est le th&#233;&#226;tre d'un conflit ouvert entre ses administrateurs et ses utilisateurs les plus actifs. En cause : un durcissement commercial jug&#233; inacceptable, qui a entra&#238;n&#233; le bannissement d'une des &#233;quipes de pirates les plus populaires du r&#233;seau....</description>
    </item>
    <item>
      <title>Find all your lost items in seconds with $10 off the Tile Slim</title>
      <link>https://mashable.com/article/dec-23-tile-slim-tracker-deal</link>
      <pubDate>Tue, 23 Dec 2025 15:26:23 +0000</pubDate>
      <guid isPermaLink="false">03PBcHiO3OiRdozA8XhXWPf</guid>
      <description>As of Dec. 23, get the Tile Slim Bluetooth tracker for $10 off its normal price at Amazon.</description>
    </item>
    <item>
      <title>OpenAI&#8217;s Outlook on AI Browser Security Is Bleak, but Maybe a Little More AI Can Fix It</title>
      <link>https://gizmodo.com/openais-outlook-on-ai-browser-security-is-bleak-but-maybe-a-little-more-ai-can-fix-it-2000702902</link>
      <pubDate>Tue, 23 Dec 2025 15:25:15 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702902</guid>
      <description>The company behind ChatGPT says prompt injection vulnerabilities will likely never be fully &#8216;solved.&#8217;</description>
    </item>
    <item>
      <title>University of Phoenix data breach may have hit over 3.5 million victims - here's what we know</title>
      <link>https://www.techradar.com/pro/security/university-of-phoenix-data-breach-may-have-hit-over-3-5-million-victims-heres-what-we-know</link>
      <pubDate>Tue, 23 Dec 2025 15:25:00 +0000</pubDate>
      <guid isPermaLink="false">kzGGt4XVant4wUcdaG3v33</guid>
      <description>Cl0p claims another victim as University of Phoenix confirms losing data of around 3.5 million people.</description>
    </item>
  </channel>
</rss>
