<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 22 Jan 2026 09:37:40 GMT</lastBuildDate>
    <item>
      <title>Bouygues Telecom d&#233;voile son nouveau d&#233;codeur&#160;b.tv&#160;&#171;&#160;boost&#233; &#224; l&#8217;IA&#160;&#187;, et il y a d&#233;j&#224; quelque chose qui cloche</title>
      <link>https://www.frandroid.com/marques/bouygues-telecom/2951483_bouygues-telecom-devoile-son-nouveau-decodeur-b-tv-booste-a-lia-et-il-y-a-deja-quelque-chose-qui-cloche</link>
      <pubDate>Thu, 22 Jan 2026 09:35:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bouygues-telecom/2951483_bouygues-telecom-devoile-son-nouveau-decodeur-b-tv-booste-a-lia-et-il-y-a-deja-quelque-chose-qui-cloche</guid>
      <description>
En m&#234;me temps que trois nouvelles Bbox ainsi qu'une cl&#233; TV, Bouygues Telecom a pr&#233;sent&#233; lors de sa conf&#233;rence de presse du 20 janvier un tout nouveau d&#233;codeur TV. Le d&#233;codeur b.tv est le premier d&#233;codeur TV d'un FAI fran&#231;ais &#224; &#234;tre boost&#233; &#224; l'IA pour le upscaling, un argument qui peine &#224; convaincre aujourd'hui.
</description>
    </item>
    <item>
      <title>Pirater la derni&#232;re nouveaut&#233; de ChatGPT est un vrai jeu d&#8217;enfant</title>
      <link>https://www.01net.com/actualites/pirater-derniere-nouveaute-chatgpt-vrai-jeu-enfant.html</link>
      <pubDate>Thu, 22 Jan 2026 09:32:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321760</guid>
      <description>&#171; Traduire avec ChatGPT &#187;, l'alternative &#224; Google Traduction d'OpenAI, vient de se faire pirater par des chercheurs. Ils ont r&#233;ussi &#224; prouver que l'IA oublie facilement ses restrictions dans le cadre d'une injection par injection de requ&#234;te. ChatGPT ne voit alors aucun probl&#232;me &#224; fournir la recette d'un cocktail Molotov.</description>
    </item>
    <item>
      <title>Amazon profite de la 3e d&#233;marque des soldes pour d&#233;stocker &#224; petit prix de nombreux produits Tech : le TOP 15 des offres</title>
      <link>https://www.frandroid.com/bons-plans/2933045_amazon-profite-de-la-3e-demarque-des-soldes-pour-destocker-a-petit-prix-de-nombreux-produits-tech</link>
      <pubDate>Thu, 22 Jan 2026 09:28:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933045_amazon-profite-de-la-3e-demarque-des-soldes-pour-destocker-a-petit-prix-de-nombreux-produits-tech</guid>
      <description>
Le top d&#233;part de la 3&#7497; d&#233;marque est lanc&#233; ! Les soldes d&#8217;hiver se poursuivent avec des offres toujours aussi attractives chez Amazon, accessibles &#224; tous, m&#234;me sans abonnement Prime. Mieux encore, certains produits Tech r&#233;cents voient leurs prix chuter &#224; cette occasion &#8212; &#224; l&#8217;image du tout nouveau OnePlus&#8201;15, d&#233;j&#224; affich&#233; &#224; prix r&#233;duit.
</description>
    </item>
    <item>
      <title>Samsung d&#233;voile par erreur l&#8217;une des plus grosses nouveaut&#233;s du Galaxy S26 Ultra</title>
      <link>https://www.01net.com/actualites/samsung-devoile-par-erreur-grosses-nouveautes-galaxy-s26-ultra.html</link>
      <pubDate>Thu, 22 Jan 2026 09:25:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321787</guid>
      <description>En partageant des captures d'&#233;cran de son application Good Lock, Samsung a malencontreusement confirm&#233; une des fonctionnalit&#233;s phares du Galaxy S26 Ultra.</description>
    </item>
    <item>
      <title>This has to be a mistake &#8212; Resident Evil Requiem on Switch 2 is less than &#163;20 to pre-order in the UK right now</title>
      <link>https://www.techradar.com/gaming/this-has-to-be-a-mistake-resident-evil-requiem-on-switch-2-is-less-than-gbp20-to-pre-order-in-the-uk-right-now</link>
      <pubDate>Thu, 22 Jan 2026 09:21:02 +0000</pubDate>
      <guid isPermaLink="false">g8PBDTB3s8RBZkrK3bAWgm</guid>
      <description>This Resident Evil Requeim pre-order deal is so good it looks like a pricing error - order it now for a ridiculously low price.</description>
    </item>
    <item>
      <title>Windows 11 : vos applications ne se lancent plus ? Voici la solution pour corriger l&#8217;erreur 0x803f8001</title>
      <link>https://www.frandroid.com/marques/microsoft/2951557_windows-11-vos-applications-ne-se-lancent-plus-voici-la-solution-pour-corriger-lerreur-0x803f8001</link>
      <pubDate>Thu, 22 Jan 2026 09:16:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2951557_windows-11-vos-applications-ne-se-lancent-plus-voici-la-solution-pour-corriger-lerreur-0x803f8001</guid>
      <description>
Plusieurs applications ne semblent plus fonctionner sur Windows 11 depuis quelques jours. Plusieurs solutions existent cependant.
</description>
    </item>
    <item>
      <title>Klipsch ProMedia Lumina : mettez de la couleur sur votre bureau et profitez d&#8217;un son chaud en 2.1</title>
      <link>https://www.frandroid.com/marques/klipsch/2951213_klipsch-promedia-lumina-mettez-de-la-couleur-sur-votre-bureau-et-profitez-dun-son-chaud-en-2-1</link>
      <pubDate>Thu, 22 Jan 2026 09:15:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/klipsch/2951213_klipsch-promedia-lumina-mettez-de-la-couleur-sur-votre-bureau-et-profitez-dun-son-chaud-en-2-1</guid>
      <description>
Le fabricant am&#233;ricain Klipsch pr&#233;sente ProMedia Lumina, un syst&#232;me 2.1 de bureau avec &#233;clairage LED destin&#233; aux gamers, cr&#233;ateurs de contenus, t&#233;l&#233;travailleurs et m&#233;lomanes, qui veut associer des performances audio haut rendement, une connectivit&#233; moderne et un design soign&#233; avec une pointe d&#8217;&#233;clairage.
</description>
    </item>
    <item>
      <title>Une recharge aussi rapide qu&#8217;une voiture : l&#8217;argument choc de Mercedes pour ses camions &#233;lectriques</title>
      <link>https://www.frandroid.com/marques/mercedes-benz/2951447_une-recharge-aussi-rapide-quune-voiture-largument-choc-de-mercedes-pour-ses-camions-electriques</link>
      <pubDate>Thu, 22 Jan 2026 09:14:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/mercedes-benz/2951447_une-recharge-aussi-rapide-quune-voiture-largument-choc-de-mercedes-pour-ses-camions-electriques</guid>
      <description>
Mercedes va r&#233;aliser un test grandeur nature de sa technologie de recharge ultra-rapide en m&#233;gawatt, capable de recharger l'immense batterie de ses poids lourds aussi rapidement qu'une voiture. Au total, deux camions &#233;lectriques vont parcourir 2 400 kilom&#232;tres entre l&#8217;Allemagne et la Su&#232;de.
</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver : la 3e d&#233;marque d&#233;marre fort, voici les offres qui m&#233;ritent votre argent</title>
      <link>https://www.frandroid.com/bons-plans/2949895_soldes-dhiver-3e-demarque-meilleures-offres-en-direct</link>
      <pubDate>Thu, 22 Jan 2026 09:05:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2949895_soldes-dhiver-3e-demarque-meilleures-offres-en-direct</guid>
      <description>
Cela fait d&#233;j&#224; deux semaines que les soldes d'hiver ont commenc&#233; en France et que les e-commer&#231;ants tels qu'Amazon, Fnac, Darty, Boulanger ou encore Cdiscount partagent des offres. Depuis hier, c'est la 3e d&#233;marque et les promotions se multiplient. 
</description>
    </item>
    <item>
      <title>Linux, Android et Windows&#160;11 sur un seul et m&#234;me smartphone, &#231;a vous dit&#8201;?</title>
      <link>https://www.frandroid.com/android/rom-custom-2/2951515_linux-android-et-windows-11-sur-un-seul-et-meme-smartphone-ca-vous-dit</link>
      <pubDate>Thu, 22 Jan 2026 09:04:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/rom-custom-2/2951515_linux-android-et-windows-11-sur-un-seul-et-meme-smartphone-ca-vous-dit</guid>
      <description>
Et si nos smartphones n&#8217;&#233;taient pas artificiellement brid&#233;s pour ne fonctionner qu&#8217;avec un seul syst&#232;me d&#8217;exploitation&#8201;? Et s&#8217;il &#233;tait possible de go&#251;ter au meilleur des mondes PC et mobiles sur un seul appareil&#8201;? C&#8217;est le monde que tente, maladroitement, de nous faire imaginer le NexPhone.
</description>
    </item>
    <item>
      <title>Hack chez Tesla&#160;: 2 failles ont &#233;t&#233; d&#233;couvertes dans le tableau de bord des voitures &#233;lectriques</title>
      <link>https://www.01net.com/actualites/hack-chez-tesla-2-failles-decouvertes-tableau-bord-voitures-electriques.html</link>
      <pubDate>Thu, 22 Jan 2026 09:01:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321744</guid>
      <description>Des chercheurs fran&#231;ais ont d&#233;couvert deux failles zero day dans le tableau de bord de Tesla. En exploitant ces deux vuln&#233;rabilit&#233;s critiques, ils ont pu prendre le contr&#244;le du syst&#232;me et potentiellement voler des donn&#233;es sensibles.</description>
    </item>
    <item>
      <title>La derni&#232;re Pixel Watch de Google est d&#233;j&#224; 130 &#8364; moins ch&#232;re gr&#226;ce &#224; cette offre des soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2893591_la-derniere-pixel-watch-de-google-est-deja-130-euros-moins-chere-grace-a-cette-offre-des-soldes-dhiver</link>
      <pubDate>Thu, 22 Jan 2026 08:58:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2893591_la-derniere-pixel-watch-de-google-est-deja-130-euros-moins-chere-grace-a-cette-offre-des-soldes-dhiver</guid>
      <description>
La r&#233;cente Pixel Watch 4 profite d&#233;j&#224; d&#8217;une belle remise &#224; l&#8217;occasion des soldes d&#8217;hiver&#8239;: 269 euros au lieu de 399&#8239;euros. La montre connect&#233;e de Google atteint son prix le plus bas &#224; ce jour. 
</description>
    </item>
    <item>
      <title>Le Volvo EX60 &#233;lectrique aux 810 km d&#8217;autonomie re&#231;oit d&#233;j&#224; une nouvelle version pour tra&#238;ner dans la boue</title>
      <link>https://www.frandroid.com/marques/volvo/2951377_le-volvo-ex60-electrique-aux-810-km-dautonomie-recoit-deja-une-nouvelle-version-pour-trainer-dans-la-boue</link>
      <pubDate>Thu, 22 Jan 2026 08:50:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volvo/2951377_le-volvo-ex60-electrique-aux-810-km-dautonomie-recoit-deja-une-nouvelle-version-pour-trainer-dans-la-boue</guid>
      <description>
Tout juste d&#233;voil&#233;, le nouveau Volvo EX60 se d&#233;cline &#233;galement en une version Cross Country au look plus baroudeur. Mais sous le capot, la fiche technique de la voiture &#233;lectrique ne change pas.
</description>
    </item>
    <item>
      <title>Huawei s&#8217;attaquerait enfin &#224; Garmin avec une nouvelle montre pour ravir les sportifs exigeants</title>
      <link>https://www.frandroid.com/marques/huawei/2951493_huawei-sattaquerait-enfin-a-garmin-avec-une-nouvelle-montre-pour-ravir-les-sportifs-exigeants</link>
      <pubDate>Thu, 22 Jan 2026 08:49:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/huawei/2951493_huawei-sattaquerait-enfin-a-garmin-avec-une-nouvelle-montre-pour-ravir-les-sportifs-exigeants</guid>
      <description>
Selon les informations du leaker Digital Chat Station, Huawei pr&#233;parerait une montre destin&#233;e aux sportifs de haut niveau. De quoi confirmer l'int&#233;r&#234;t de la marque pour le sport apr&#232;s le sponsoring d'athl&#232;tes de haut niveau. 
</description>
    </item>
    <item>
      <title>Un ado de 15 ans permet &#224; des joueurs de deux jeux diff&#233;rents de s&#8217;affronter ensemble : voici le crossplay qui d&#233;fie l&#8217;impossible !</title>
      <link>https://www.frandroid.com/marques/2951517_un-ado-de-15-ans-permet-a-des-joueurs-de-deux-jeux-differents-de-saffronter-ensemble-voici-le-crossplay-qui-defie-limpossible</link>
      <pubDate>Thu, 22 Jan 2026 08:47:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2951517_un-ado-de-15-ans-permet-a-des-joueurs-de-deux-jeux-differents-de-saffronter-ensemble-voici-le-crossplay-qui-defie-limpossible</guid>
      <description>
On pensait la fronti&#232;re infranchissable entre le ma&#238;tre et son &#233;l&#232;ve spirituel, mais il a fallu qu'un adolescent de 15 ans s'en m&#234;le pour prouver le contraire. &#192; peine sorti, Hytale communique d&#233;j&#224; avec Minecraft gr&#226;ce &#224; une prouesse technique qui bluffe tout le monde.
</description>
    </item>
    <item>
      <title>Rachat SFR&#160;: Orange, Bouygues et Free font une mise au point sur les &#171;&#160;rumeurs&#160;&#187;</title>
      <link>https://www.01net.com/actualites/rachat-sfr-les-discussions-ont-repris-entre-bouygues-iliad-orange-et-altice.html</link>
      <pubDate>Thu, 22 Jan 2026 08:36:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321769</guid>
      <description>Du nouveau dans le dossier du rachat de SFR ? Bouygues Telecom, Orange et Free (groupe Iliad) annoncent ce jeudi 22 janvier avoir repris les n&#233;gociations avec Altice. Les trois soci&#233;t&#233;s pourraient rehausser leur offre de trois milliards d'euros, pour atteindre les 20 milliards.</description>
    </item>
    <item>
      <title>ElevenLabs r&#233;unit Liza Minelli et Art Garfunkel pour un album &#171;&#160;co-cr&#233;&#233;&#160;&#187; avec l&#8217;IA</title>
      <link>https://www.01net.com/actualites/elevenlabs-reunit-liza-minelli-et-art-garfunkel-pour-un-album-co-cree-avec-lia.html</link>
      <pubDate>Thu, 22 Jan 2026 08:31:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321710</guid>
      <description>Si l'IA g&#233;n&#233;rative suscite le rejet chez de nombreux artistes, d'autres en revanche ont choisi d'embrasser la technologie. Les v&#233;t&#233;rans Liza Minelli et Art Garfunkel, ainsi que des noms en devenir ont particip&#233; &#224; l'&#233;laboration d'un album produit par ElevenLabs, un acteur majeur du clonage vocal par IA.</description>
    </item>
    <item>
      <title>9 capteurs et 100 millisecondes pour se d&#233;clencher : cet airbag v&#233;lo veut r&#233;volutionner la s&#233;curit&#233; des cyclistes pro</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2951475_9-capteurs-et-100-millisecondes-pour-se-declencher-cet-airbag-velo-veut-revolutionner-la-securite-des-cyclistes-pro</link>
      <pubDate>Thu, 22 Jan 2026 08:26:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2951475_9-capteurs-et-100-millisecondes-pour-se-declencher-cet-airbag-velo-veut-revolutionner-la-securite-des-cyclistes-pro</guid>
      <description>
Un airbag sp&#233;cifiquement con&#231;u pour les cyclistes professionnels fait son apparition dans une &#233;quipe du WorldTour. Baptis&#233; Aerobag, ce dispositif est utilis&#233; &#224; l&#8217;entra&#238;nement cette saison par l&#8217;&#233;quipe Picnic PostNL.
</description>
    </item>
    <item>
      <title>Ubisoft axes Prince of Persia: Sands of Time remake, announces major company restructure</title>
      <link>https://mashable.com/article/ubisoft-prince-persia-sands-time-remake-cancelled</link>
      <pubDate>Thu, 22 Jan 2026 08:14:46 +0000</pubDate>
      <guid isPermaLink="false">00IVcZKjL3SQxZWDR91GpSb</guid>
      <description>Ubisoft has cancelled the 'Prince of Persia: The Sands of Time' remake as part of a major company restructure.</description>
    </item>
    <item>
      <title>The best live TV streaming services to cut cable in 2026</title>
      <link>https://www.engadget.com/entertainment/streaming/best-live-tv-streaming-service-133000410.html?src=rss</link>
      <pubDate>Thu, 22 Jan 2026 08:00:37 +0000</pubDate>
      <guid isPermaLink="false">50eb34db-c0fc-4bfb-ab41-1cbe97faffd8</guid>
      <description>Sports fans who want to catch every last game and news junkies who want to watch network news as it unfolds have two main options: cable or a live TV streaming service. Cable or satellite service often requires extra equipment and convoluted contracts. Live TV streaming services only require an internet connection and a smart TV. These plans used to be cheaper and more user-friendly, too, but price hikes, media consolidation and contract disputes are starting to change the value a bit. We tested out all the major players to compare what you get and help you make sense of the options out there....</description>
    </item>
    <item>
      <title>Quels sont les meilleurs appareils photos num&#233;riques hybrides en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-photo-et-video/1338125_selection-des-meilleurs-appareils-photos-hybrides</link>
      <pubDate>Thu, 22 Jan 2026 08:00:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-photo-et-video/1338125_selection-des-meilleurs-appareils-photos-hybrides</guid>
      <description>
Les appareils photo dits &#171; hybrides &#187; ont supplant&#233; les reflex sur le march&#233; des bo&#238;tiers photo. Ils n&#233;cessitent un investissement financier important : autant bien choisir celui qui sera adapt&#233; &#224; vos besoins et ambitions. Nous avons test&#233;, s&#233;lectionn&#233; et rassembl&#233; pour vous les mod&#232;les les plus int&#233;ressants en 2026.
</description>
    </item>
    <item>
      <title>Le NexPhone est un smartphone capable de faire tourner Android, Linux et Windows 11</title>
      <link>https://www.01net.com/actualites/le-nexphone-est-un-smartphone-capable-de-faire-tourner-android-linux-et-windows-11.html</link>
      <pubDate>Thu, 22 Jan 2026 08:00:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321682</guid>
      <description>Android, Linux, Windows : pourquoi choisir ? Le NexPhone se rit des fronti&#232;res puisqu'il est capable de faire tourner les plateformes les plus populaires, &#224; l'exception d'iOS.</description>
    </item>
    <item>
      <title>Logitech&#8217;s new AI-powered webcam will let you really take center stage at your meetings</title>
      <link>https://www.techradar.com/pro/logitechs-new-ai-powered-webcam-will-let-you-really-take-center-stage-at-your-meetings</link>
      <pubDate>Thu, 22 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">dHVGVb4TKRP8kaBGz82S6N</guid>
      <description>AI-powered features give Logitech's new Rally AI Cameras a smarter way to present.</description>
    </item>
    <item>
      <title>Xiaomi renouvelle tout : 4 nouvelles trottinettes d&#233;voil&#233;es, les roues de 12 pouces se g&#233;n&#233;ralisent petit &#224; petit</title>
      <link>https://www.frandroid.com/marques/xiaomi/2951407_xiaomi-renouvelle-tout-4-nouvelles-trottinettes-devoilees-les-roues-de-12-pouces-se-generalisent-petit-a-petit</link>
      <pubDate>Thu, 22 Jan 2026 07:46:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2951407_xiaomi-renouvelle-tout-4-nouvelles-trottinettes-devoilees-les-roues-de-12-pouces-se-generalisent-petit-a-petit</guid>
      <description>
Quatre nouvelles trottinettes &#233;lectriques rejoignent l'offre de Xiaomi, avec une tendance forte qui se d&#233;gage : la g&#233;n&#233;ralisation progressive des roues de 12 pouces. 
</description>
    </item>
    <item>
      <title>Une selle v&#233;lo avec une poign&#233;e : la belle id&#233;e de ce VTC &#233;lectrique boost&#233; par Bosch et tout &#233;quip&#233;</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2950587_une-selle-velo-avec-une-poignee-la-belle-idee-de-ce-vtc-electrique-booste-par-bosch-et-tout-equipe</link>
      <pubDate>Thu, 22 Jan 2026 07:44:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2950587_une-selle-velo-avec-une-poignee-la-belle-idee-de-ce-vtc-electrique-booste-par-bosch-et-tout-equipe</guid>
      <description>
De retour avec le syst&#232;me Bosch Performance Line CX culminant &#224; 100 Nm de couple, le v&#233;lo &#233;lectrique BH Atom NX SUV s'offre une double suspension en cadre haut et ouvert, pour s&#8217;adonner &#224; toutes les pratiques.
</description>
    </item>
    <item>
      <title>Wordle today: Answer, hints for January 22, 2026</title>
      <link>https://mashable.com/article/wordle-today-answer-january-22-2026</link>
      <pubDate>Thu, 22 Jan 2026 07:43:47 +0000</pubDate>
      <guid isPermaLink="false">028IbM9SCWPqIdZxPItOfRl</guid>
      <description>Here's the answer for "Wordle" #1677 on January 22 as well as a few hints, tips, and clues to help you solve it yourself.</description>
    </item>
  </channel>
</rss>
