<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 29 Dec 2025 14:27:07 GMT</lastBuildDate>
    <item>
      <title>Rien de plus pratique que cet &#233;cran portable Full HD de 15,6&#8243; en promo &#224; -25 % facile &#224; transporter</title>
      <link>https://www.frandroid.com/bons-plans/2922271_rien-de-plus-pratique-que-cet-ecran-portable-full-hd-de-156-en-promo-a-25-facile-a-transporter</link>
      <pubDate>Mon, 29 Dec 2025 14:19:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2922271_rien-de-plus-pratique-que-cet-ecran-portable-full-hd-de-156-en-promo-a-25-facile-a-transporter</guid>
      <description>
Le mod&#232;le M156F04 de la marque UFYQL est un &#233;cran portable de 15,6 pouces qui peut se brancher &#224; n'importe quel appareil pour diffuser un flux Full HD. Il est &#224; retrouver &#224; 59,99 euros au lieu de 79,99 euros.
</description>
    </item>
    <item>
      <title>Life on Europa Could Feed On This Unexpected Source of Energy</title>
      <link>https://gizmodo.com/life-on-europa-could-feed-on-this-unexpected-source-of-energy-2000703619</link>
      <pubDate>Mon, 29 Dec 2025 14:15:31 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703619</guid>
      <description>Jupiter's icy Moon is one of the most promising places to search for life in the solar system.</description>
    </item>
    <item>
      <title>Ces Pixel abandonn&#233;s par Google passent &#224; Android 16 gr&#226;ce &#224; LineageOS</title>
      <link>https://www.frandroid.com/marques/google/2922323_ces-pixel-abandonnes-par-google-passent-a-android-16-grace-a-lineageos</link>
      <pubDate>Mon, 29 Dec 2025 14:12:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2922323_ces-pixel-abandonnes-par-google-passent-a-android-16-grace-a-lineageos</guid>
      <description>
La derni&#232;re version de la ROM alternative LineageOS, bas&#233;e sur Android 16, redonne une seconde jeunesse &#224; de vieux mod&#232;les de Pixel jusque l&#224; non compatibles.
</description>
    </item>
    <item>
      <title>Comment Samsung pourrait s&#8217;inspirer d&#8217;Apple pour la puce Exynos de ses Galaxy S28</title>
      <link>https://www.frandroid.com/marques/samsung/2921971_comment-samsung-pourrait-sinspirer-dapple-pour-la-puce-exynos-de-ses-galaxy-s28</link>
      <pubDate>Mon, 29 Dec 2025 14:12:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2921971_comment-samsung-pourrait-sinspirer-dapple-pour-la-puce-exynos-de-ses-galaxy-s28</guid>
      <description>
De nouvelles informations laissent &#224; penser qu'&#224; la mani&#232;re d'Apple, Samsung pourrait d'ici deux ans accoucher d'un processeur Exynos &#233;quip&#233; d'un tandem CPU / GPU con&#231;u en interne... d&#233;laissant ainsi le partenariat (graphique) entretenu depuis plusieurs ann&#233;es avec AMD.
</description>
    </item>
    <item>
      <title>Downtime caused historic issues in 2025 - but who lost out most?</title>
      <link>https://www.techradar.com/pro/security/downtime-caused-historic-issues-in-2025-but-who-lost-out-most</link>
      <pubDate>Mon, 29 Dec 2025 14:10:00 +0000</pubDate>
      <guid isPermaLink="false">gy5T2kang7ESxEFDXpjFjh</guid>
      <description>For many, 2025 will be remembered by outages and lost revenue opportunities.</description>
    </item>
    <item>
      <title>Samsung plans to bring Google Photos to its TVs in 2026</title>
      <link>https://techcrunch.com/2025/12/29/samsung-plans-to-bring-google-photos-to-its-tvs-in-2026/</link>
      <pubDate>Mon, 29 Dec 2025 14:06:23 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3079158</guid>
      <description>Samsung said that Memories features for Google Photos will be exclusive to its TVs for six months</description>
    </item>
    <item>
      <title>Tech resolutions</title>
      <link>https://www.techradar.com/tag/techresolutions</link>
      <pubDate>Mon, 29 Dec 2025 14:05:34 +0000</pubDate>
      <guid isPermaLink="false">haQWu49jYAwC4A3RbufPPN</guid>
      <description>TechRadar's guide to starting 2026 in the best possible way</description>
    </item>
    <item>
      <title>Volkswagen et Xpeng s&#8217;unissent : voici l&#8217;ID. Unyx 07, la voiture &#233;lectrique allemande made in China</title>
      <link>https://www.frandroid.com/marques/volkswagen/2921831_volkswagen-et-xpeng-sunissent-voici-lid-unyx-07-la-voiture-electrique-allemande-made-in-china</link>
      <pubDate>Mon, 29 Dec 2025 14:03:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2921831_volkswagen-et-xpeng-sunissent-voici-lid-unyx-07-la-voiture-electrique-allemande-made-in-china</guid>
      <description>
D&#233;velopp&#233;e par Volkswagen en partenariat avec Xpeng, la nouvelle ID. Unyx 07 nous donne de nouvelles informations &#224; son sujet. La voiture &#233;lectrique revendique 231 chevaux et une autonomie de 558 kilom&#232;tres.
</description>
    </item>
    <item>
      <title>Un piratage du jeu Rainbow Six Siege fait perdre des millions de dollars &#224; Ubisoft</title>
      <link>https://www.01net.com/actualites/un-piratage-du-jeu-rainbow-six-siege-fait-perdre-des-millions-de-dollars-a-ubisoft.html</link>
      <pubDate>Mon, 29 Dec 2025 14:02:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317497</guid>
      <description>Ubisoft a essuy&#233; ce week-end une importante br&#232;che de s&#233;curit&#233; sur un de ses jeux en ligne vedette, Rainbow Six Siege. Les pirates ont pu s'infiltrer dans les serveurs internes et faire n'importe quoi, y compris distribuer des milliards de cr&#233;dits aux joueurs. L'&#233;diteur a d&#251; fermer les serveurs pendant quelques heures, avant de les rouvrir prudemment....</description>
    </item>
    <item>
      <title>Could Jordan Peele Be Heading to the MCU?</title>
      <link>https://gizmodo.com/jordan-peele-marvel-mcu-blade-midnight-sons-2000703415</link>
      <pubDate>Mon, 29 Dec 2025 14:00:35 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703415</guid>
      <description>Plus, James Cameron is hoping to make some progress on a new remake of 'Fantastic Voyage' in 2026.</description>
    </item>
    <item>
      <title>VCs predict strong enterprise AI adoption next year &#8212; again</title>
      <link>https://techcrunch.com/2025/12/29/vcs-predict-strong-enterprise-ai-adoption-next-year-again/</link>
      <pubDate>Mon, 29 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078782</guid>
      <description>More than 20 venture capitalists share their thoughts on AI agents, enterprise AI budgets and more for 2026.</description>
    </item>
    <item>
      <title>Everything we expect from Xbox in 2026, including Halo on PlayStation and the return of Fable</title>
      <link>https://www.techradar.com/gaming/xbox-predictions-2026</link>
      <pubDate>Mon, 29 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">Pd5Hxc2djrHDSzLFqVLhbT</guid>
      <description>Xbox&#8217;s 2026 is likely to be a major year, if not for the current generation, then for the next. Here are our predictions for what Microsoft's gaming arm will be up to next year.</description>
    </item>
    <item>
      <title>What is the release date for Fallout season 2 episode 3 on Prime Video?</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/what-is-the-release-date-for-fallout-season-2-episode-3-on-prime-video</link>
      <pubDate>Mon, 29 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">9A96TJYhqYVSFJKV2558Xk</guid>
      <description>It's almost time to ring in the New Year with Fallout season 2's next episode.</description>
    </item>
    <item>
      <title>The best shows to watch on HBO Max from 2025</title>
      <link>https://www.theverge.com/entertainment/846829/hbo-max-best-shows-2025</link>
      <pubDate>2025-12-29T08:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=846829</guid>
      <description>With all the drama surrounding Warner Bros. Discovery's plans to sell itself to another company, it's not currently clear how much longer HBO Max will continue to exist in its current form. But for the time being, the streamer is chock full of solid series you might want to consider watching if you find yourself [&#8230;]</description>
    </item>
    <item>
      <title>Ouvrir sa Tesla avec un iPhone sans batterie : cela serait pour bient&#244;t</title>
      <link>https://www.frandroid.com/marques/tesla/2922291_ouvrir-sa-tesla-avec-un-iphone-sans-batterie-cela-serait-pour-bientot</link>
      <pubDate>Mon, 29 Dec 2025 13:28:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2922291_ouvrir-sa-tesla-avec-un-iphone-sans-batterie-cela-serait-pour-bientot</guid>
      <description>
Pendant que Rivian d&#233;ploie le support officiel d'Apple Car Key, Tesla faisait de la r&#233;sistance avec son syst&#232;me propri&#233;taire. Le code de l'application mobile vend la m&#232;che : le support arrive. Et c'est une excellente nouvelle pour votre iPhone.
</description>
    </item>
    <item>
      <title>Samsung plans to integrate Google Photos into its TVs</title>
      <link>https://www.engadget.com/home/samsung-plans-to-integrate-google-photos-into-its-tvs-132739713.html?src=rss</link>
      <pubDate>Mon, 29 Dec 2025 13:27:39 +0000</pubDate>
      <guid isPermaLink="false">331b3488-b299-4bd5-ac4a-00cca446bcba</guid>
      <description>Samsung has announced that it "aims to be the first" to natively integrate Google Photos into TVs. The aim is for Google Photos to work seamlessly with Vision AI Companion, Samsung's souped-up version of Bixby. This would help to make user photos part of the day-to-day TV experience, with photos appearing while navigating the TV's OS during "contextual and convenient moments."
The company says users will be able to explore their Google Photos libraries in three new experiences. The first is called Memories, and will show curated stories based on "people, locations and meaningful moments." This...</description>
    </item>
    <item>
      <title>Xiaomi&#8217;s 17 Ultra Leica edition has a rotatable camera zoom</title>
      <link>https://www.theverge.com/news/850599/xiaomi-17-ultra-leica-edition-zoom-ring</link>
      <pubDate>2025-12-29T08:23:33-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=850599</guid>
      <description>Xiaomi used the Christmas period to launch its top flagship phone for the year, the 17 Ultra. It drops the extra rear display that's the key selling point of the 17 Pro, but instead adds in the option of a manual zoom ring, built directly into the phone's camera island. That rotating zoom is only [&#8230;]</description>
    </item>
    <item>
      <title>En 2026, ces &#233;crans gaming Samsung et HKC vont enfin d&#233;passer les 1000 Hz, mais pour quoi faire ?</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/ecran-pc/2921867_en-2026-les-ecrans-gaming-vont-enfin-depasser-les-1000-hz-mais-pour-quoi-faire</link>
      <pubDate>Mon, 29 Dec 2025 13:22:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/ecran-pc/2921867_en-2026-les-ecrans-gaming-vont-enfin-depasser-les-1000-hz-mais-pour-quoi-faire</guid>
      <description>
Samsung et HKC ont d&#233;voil&#233; deux &#233;crans &#224; plus de 1 000 Hz qui seront officiellement pr&#233;sent&#233;s au CES 2026 de Las Vegas. Si la barri&#232;re bris&#233;e est symbolique, elle n'indique cependant pas une tendance de fond pour les &#233;crans de jeu sur PC.
</description>
    </item>
    <item>
      <title>Samsung d&#233;voile sa gamme audio 2026&#160;: des enceintes &#171;&#160;&#339;uvres d&#8217;art&#160;&#187; et des barres de son optimis&#233;es par l&#8217;IA</title>
      <link>https://www.01net.com/actualites/samsung-devoile-sa-gamme-audio-2026-des-enceintes-oeuvres-dart-et-des-barres-de-son-optimisees-par-lia.html</link>
      <pubDate>Mon, 29 Dec 2025 13:13:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317486</guid>
      <description>En amont du CES de Las Vegas, Samsung pr&#233;sente ses nouveaut&#233;s audio pour l'ann&#233;e 2026. Le constructeur cor&#233;en mise cette ann&#233;e sur une collaboration esth&#233;tique avec le designer Erwan Bouroullec et renouvelle son haut de gamme cin&#233;ma.</description>
    </item>
    <item>
      <title>Le Google Pixel 8 s&#8217;offre une fonction photo venue du Pixel 9</title>
      <link>https://www.frandroid.com/marques/google/2922055_le-google-pixel-8-soffre-une-fonction-photo-venue-du-pixel-9</link>
      <pubDate>Mon, 29 Dec 2025 13:01:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2922055_le-google-pixel-8-soffre-une-fonction-photo-venue-du-pixel-9</guid>
      <description>
Google met &#224; jour l'application Cam&#233;ra du Google Pixel 8 pour y introduire une fonctionnalit&#233; autrefois r&#233;serv&#233;e au Pixel 9 et 10. 
</description>
    </item>
    <item>
      <title>EDF Tempo : prix du kWh, jours rouges et rentabilit&#233;</title>
      <link>https://www.frandroid.com/survoltes/energie/1809417_edf-tempo-tout-comprendre-a-ce-forfait-capable-de-reduire-vos-factures-delectricite</link>
      <pubDate>Mon, 29 Dec 2025 13:01:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/1809417_edf-tempo-tout-comprendre-a-ce-forfait-capable-de-reduire-vos-factures-delectricite</guid>
      <description>
Toutes les solutions sont bonnes &#224; prendre pour r&#233;duire sa facture efficacement. L'une d'entre elles, chez EDF, s'appelle Tempo. Voici comment &#231;a fonctionne.
</description>
    </item>
    <item>
      <title>How to watch the Sony Afeela CES 2026 press conference</title>
      <link>https://www.engadget.com/transportation/evs/how-to-watch-the-sony-afeela-ces-2026-press-conference-130048921.html?src=rss</link>
      <pubDate>Mon, 29 Dec 2025 13:00:48 +0000</pubDate>
      <guid isPermaLink="false">55dc3f84-855b-40ed-9b3d-0dc382a60c59</guid>
      <description>
Longtime CES observers know that Sony's press conference is the traditional capper to the press day that precedes the show floor's official opening the following day. And while that appears to be the same for 2026, there's a twist: Instead of an overview of Sony's electronics, video game and Hollywood studio plans for the new year, the presser will apparently have a more narrow focus: electric vehicles. Apparently the full event will be focused on two vehicles from Sony Honda Mobility &#8212; the Afeela 1 car that has made repeat appearances at CES, as well as an all-new concept model at the event....</description>
    </item>
    <item>
      <title>iMP Tech Mini Arcade Pro Review: A Nintendo Switch Arcade Cabinet</title>
      <link>https://www.wired.com/review/imp-mini-arcade-pro/</link>
      <pubDate>Mon, 29 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">694963652fa5f12763332a12</guid>
      <description>A fun diversion for retro gaming on the Nintendo Switch 2&#8212;if you can stand to look at it.</description>
    </item>
    <item>
      <title>Windows on Arm had another good year</title>
      <link>https://www.theverge.com/gadgets/850074/2025-windows-arm-laptops-qualcomm-intel-amd-nvidia</link>
      <pubDate>2025-12-29T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=850074</guid>
      <description>In 2024, Qualcomm's Snapdragon X chips finally made Arm-based Windows laptops viable. Unlike previous Arm laptops that struggled to even run Windows well, this new class offered solid performance and the best battery life on Windows, and they impressed us in Microsoft's own Surface Laptop and Surface Pro offerings. But inconsistent app compatibility remained the [&#8230;]...</description>
    </item>
    <item>
      <title>I&#8217;m The Verge&#8217;s Senior Internet Typist, ask me anything while Nilay&#8217;s away!</title>
      <link>https://www.theverge.com/entertainment/850407/liz-lopatto-ask-me-anything</link>
      <pubDate>2025-12-29T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=850407</guid>
      <description>Hello from the dead week of the year, when all sane people have logged off to spend time with their families. This is when I typically write at least one deeply weird post while I'm working over the holiday. One time I got left alone on New Year's Day and posted about cats all day [&#8230;]</description>
    </item>
    <item>
      <title>Top cybersecurity habits to take into 2026</title>
      <link>https://www.techradar.com/vpn/vpn-services/top-cybersecurity-habits-to-take-into-2026</link>
      <pubDate>Mon, 29 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">pFjai6Y63ntrtcU4adey9F</guid>
      <description>New Year's resolutions... with a twist!</description>
    </item>
    <item>
      <title>Make 2026 the year your kid gets off their device</title>
      <link>https://mashable.com/article/how-to-get-kids-off-their-phones-screens</link>
      <pubDate>Mon, 29 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">03XBCahHdlHalLhhpnSBY61</guid>
      <description>4 strategies for resetting their relationship with time-sucking tech.</description>
    </item>
    <item>
      <title>Test du Dyson PencilVac Fluffycones : autonomie juste, bac minuscule&#8230; et pourtant je ne veux plus le rendre</title>
      <link>https://www.frandroid.com/marques/dyson/2911875_test-dyson-pencilvac-fluffycones</link>
      <pubDate>Mon, 29 Dec 2025 12:55:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dyson/2911875_test-dyson-pencilvac-fluffycones</guid>
      <description>
Si vous vivez dans une maison de campagne avec de la moquette &#233;paisse et un Maine Coon, arr&#234;tez tout de suite de lire ce test : ce produit n'est pas pour vous. Le PencilVac est l'aspirateur le plus clivant jamais sorti par Dyson.
</description>
    </item>
    <item>
      <title>These five ingenious materials from 2025 could make buildings greener</title>
      <link>https://www.fastcompany.com/91453939/material-design-inventions-2025</link>
      <pubDate>2025-12-29T12:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91453939/material-design-inventions-2025</guid>
      <description>&#8216;Climate-adaptive&#8217; paint and &#8216;Superwood&#8217;: These material inventions have huge potential to make our built environment more sustainable.
Construction materials are responsible for nearly one-third of global carbon dioxide emissions. And as global demand for construction continues to rise (it has&#160;already tripled&#160;over the past 25 years), its emissions are bound to climb even higher.eIn fact, some, like environmental engineer and University of Virginia professor Andres Clarens, see materials&#8217; potential negative impact as so existential that he calls them the &#8220;last major frontier&#8221; in the fight agai...</description>
    </item>
  </channel>
</rss>
