<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 30 Nov 2025 08:43:40 GMT</lastBuildDate>
    <item>
      <title>Le Black Friday frappe encore plus fort ce week-end : voici le TOP 100 des meilleures offres</title>
      <link>https://www.frandroid.com/bons-plans/2889393_le-veritable-black-friday-commence-enfin-voici-le-top-50-des-meilleures-offres-pour-le-jour-j</link>
      <pubDate>Sun, 30 Nov 2025 08:35:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2889393_le-veritable-black-friday-commence-enfin-voici-le-top-50-des-meilleures-offres-pour-le-jour-j</guid>
      <description>
Entre les offres en avant-premi&#232;re, les promos du 11.11 ou encore la Black Week, le mois de novembre a &#233;t&#233; assez mouvement&#233; en offres. Mais, ce n'est pas fini : le Black Friday a d&#233;but&#233; officiellement vendredi dernier avec de nouvelles offres pour tout le week-end. Nous avons fait le tri des meilleures promotions Tech, faites vous plaisir !
</description>
    </item>
    <item>
      <title>iPad 2025 : E.Leclerc fracasse gentiment le prix de la nouvelle tablette Apple</title>
      <link>https://www.frandroid.com/produits-android/tablette/2892247_ipad-2025-e-leclerc-fracasse-gentiment-le-prix-de-la-nouvelle-tablette-apple</link>
      <pubDate>Sun, 30 Nov 2025 08:34:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/tablette/2892247_ipad-2025-e-leclerc-fracasse-gentiment-le-prix-de-la-nouvelle-tablette-apple</guid>
      <description>
C'est probablement un des meilleurs rapports qualit&#233;-prix de l'iPad lors du Black Friday. Le tout nouveau mod&#232;le 2025, enfin &#233;quip&#233; de 128 Go de base, revient &#224; 322 &#8364; chez E.Leclerc gr&#226;ce &#224; une offre fid&#233;lit&#233; massive. Pour une tablette qui durera 6 ans, c'est donn&#233;.
</description>
    </item>
    <item>
      <title>NAS 4 baies : TerraMaster brade son serveur Intel N5095, id&#233;al pour Plex</title>
      <link>https://www.frandroid.com/bons-plans/bons-plans-hardware/2892231_nas-4-baies-terramaster-brade-son-serveur-intel-n5095-ideal-pour-plex</link>
      <pubDate>Sun, 30 Nov 2025 08:27:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/bons-plans-hardware/2892231_nas-4-baies-terramaster-brade-son-serveur-intel-n5095-ideal-pour-plex</guid>
      <description>
C'est le ticket d'entr&#233;e le plus bas du march&#233; pour un "vrai" serveur domestique. Le TerraMaster F4-425, un NAS 4 baies &#233;quip&#233; d'un processeur Intel Celeron, tombe &#224; 271,99 &#8364; sur Amazon (vendeur tiers, via coupon). &#192; ce tarif, la concurrence ne propose que des mod&#232;les an&#233;miques &#224; 2 baies. C'est l'occasion parfaite pour monter son propre cloud ou serveur multim&#233;dia &#224; moindre frais.
...</description>
    </item>
    <item>
      <title>Test du TV Samsung 55QN80F&#160;: t&#233;l&#233;viseur Premium Mini LED qui a presque tout d&#8217;un grand</title>
      <link>https://www.frandroid.com/marques/samsung/2864693_test-du-tv-samsung-55qn80f-televiseur-premium-mini-led-qui-a-presque-tout-dun-grand</link>
      <pubDate>Sun, 30 Nov 2025 08:24:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2864693_test-du-tv-samsung-55qn80f-televiseur-premium-mini-led-qui-a-presque-tout-dun-grand</guid>
      <description>
Samsung propose le mod&#232;le 55QN80F dans sa gamme Neo QLED. Ce t&#233;l&#233;viseur embarquant un syst&#232;me de r&#233;tro&#233;clairage Mini LED vient concurrencer les r&#233;f&#233;rences du march&#233; en misant sur un &#233;quilibre entre polyvalence, qualit&#233; d'image et fonctionnalit&#233;s connect&#233;es. Nous l&#8217;avons test&#233;.
</description>
    </item>
    <item>
      <title>20h d&#8217;autonomie pour 427 &#8364; : ce PC Lenovo est une belle offre pour s&#8217;&#233;quiper pas cher</title>
      <link>https://www.frandroid.com/bons-plans/bons-plans-pc-portable/2892219_20h-dautonomie-pour-427-e-ce-pc-lenovo-est-une-belle-offre-pour-sequiper-pas-cher</link>
      <pubDate>Sun, 30 Nov 2025 08:17:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/bons-plans-pc-portable/2892219_20h-dautonomie-pour-427-e-ce-pc-lenovo-est-une-belle-offre-pour-sequiper-pas-cher</guid>
      <description>
C'est le r&#234;ve de tout &#233;tudiant ou travailleur nomade : un PC Windows qui tient 20 heures sur batterie sans co&#251;ter un SMIC. Ce r&#234;ve devient r&#233;alit&#233; gr&#226;ce &#224; la Fnac. Le Lenovo IdeaPad Slim 3 &#233;quip&#233; de la puce Snapdragon X tombe &#224; 427 &#8364;. C'est le ticket d'entr&#233;e le plus bas du march&#233; pour acc&#233;der &#224; la nouvelle &#232;re des "AI PC" endurants.
</description>
    </item>
    <item>
      <title>Stop aux souris &#171;&#160;no-name&#160;&#187; : la Razer DeathAdder Essential est &#224; 11 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/bons-plans-gaming/2892207_stop-aux-souris-no-name-la-razer-deathadder-essential-est-a-11-e</link>
      <pubDate>Sun, 30 Nov 2025 08:04:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/bons-plans-gaming/2892207_stop-aux-souris-no-name-la-razer-deathadder-essential-est-a-11-e</guid>
      <description>
La Razer DeathAdder Essential, mod&#232;le iconique s'il en est, tombe &#224; 11 &#8364; tout rond sur Amazon. &#192; ce tarif, elle co&#251;te moins cher que les copies douteuses vendues en supermarch&#233;. C'est l'occasion parfaite pour remplacer votre vieille souris de bureau ou en prendre une de secours.
</description>
    </item>
    <item>
      <title>How to watch Crystal Palace vs Manchester United: live stream Premier League 2025/26 game, TV channels, preview</title>
      <link>https://www.techradar.com/how-to-watch/football/how-to-watch-crystal-palace-vs-manchester-united-live-stream-premier-league-2025-26-game-tv-channels-preview</link>
      <pubDate>Sun, 30 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">hMQSYq6hMbWzFa5BWVPzCg</guid>
      <description>All the ways to watch Crystal Palace vs Manchester United live streams online and from anywhere as the Eagles look to inflict another loss on United.</description>
    </item>
    <item>
      <title>iPhone 16 &#224; ce prix : oubliez le 17, l&#8217;affaire de ce Black Friday est ici</title>
      <link>https://www.frandroid.com/bons-plans/bons-plans-smartphone/2892199_iphone-16-a-ce-prix-oubliez-le-17-laffaire-de-ce-black-friday-est-ici</link>
      <pubDate>Sun, 30 Nov 2025 07:51:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/bons-plans-smartphone/2892199_iphone-16-a-ce-prix-oubliez-le-17-laffaire-de-ce-black-friday-est-ici</guid>
      <description>
L'iPhone 17 est sorti, il est brillant, mais il co&#251;te encore trop cher. La vraie strat&#233;gie gagnante de ce Black Friday 2025, c'est de regarder juste derri&#232;re. L'iPhone 16, encore surpuissant, chute &#224; 639,99 &#8364; sur Rakuten. C'est le prix d'un milieu de gamme pour le smartphone d'il y a un an.
</description>
    </item>
    <item>
      <title>Does Amazon do a Cyber Monday sale? Everything to know about the 2025 shopping event.</title>
      <link>https://mashable.com/article/does-amazon-do-cyber-monday-2025</link>
      <pubDate>Sun, 30 Nov 2025 07:39:02 +0000</pubDate>
      <guid isPermaLink="false">02yL1WBQfaBXMIHVb02J4lm</guid>
      <description>Does Amazon do a Cyber Monday sale? Here's everything you need to know about Amazon's Cyber Monday plans in 2025.</description>
    </item>
    <item>
      <title>OpenAI reveals ChatGPT&#8217;s most popular features &#8211; and the top one might surprise you</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/openai-reveals-chatgpts-most-popular-features-and-the-top-one-might-surprise-you</link>
      <pubDate>Sun, 30 Nov 2025 07:37:57 +0000</pubDate>
      <guid isPermaLink="false">iKCZTeEkUYkXLfNJkGW539</guid>
      <description>To celebrate its third birthday, OpenAI has revealed exactly how we're using ChatGPT.</description>
    </item>
    <item>
      <title>Expert-picked early Cyber Monday deals: We found record prices on AirPods, Kindles, Lego, and PS5 consoles</title>
      <link>https://mashable.com/article/best-cyber-monday-deals-2025</link>
      <pubDate>Sun, 30 Nov 2025 07:34:21 +0000</pubDate>
      <guid isPermaLink="false">00vaWUHsKHQZcZQov4pd76I</guid>
      <description>The best Cyber Monday deals of 2025 let you save $250 on MacBooks, 27% on Kindles, and 55% on Amazon devices. See the latest deals as Cyber Monday approaches.</description>
    </item>
    <item>
      <title>Cyber Monday 2025: Live updates on the deals still live from Amazon, Target, Walmart, and more</title>
      <link>https://mashable.com/live/best-early-cyber-monday-deals-2025</link>
      <pubDate>Sun, 30 Nov 2025 07:24:08 +0000</pubDate>
      <guid isPermaLink="false">01y3tnDkBJkqfxjZcb9gGTR</guid>
      <description>Get live updates on Black Friday sales and early Cyber Monday deals. We found savings of $150 on Dyson Supersonic hair dryers, $300 off Samsung TVs, and record prices on AirPods.</description>
    </item>
    <item>
      <title>Une alliance pirate historique&#160;: les hackers russes et nord-cor&#233;ens unissent leurs forces pour semer le chaos</title>
      <link>https://www.01net.com/actualites/alliance-pirate-historique-hackers-russes-nord-coreens-unissent-mener-cyberattaques.html</link>
      <pubDate>Sun, 30 Nov 2025 07:01:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311378</guid>
      <description>Pour la premi&#232;re fois, des groupes de hackers russes et nord-cor&#233;ens unissent leurs forces. Des chercheurs ont en effet d&#233;couvert que les gangs Gamaredon et Lazarus ont mis leurs ressources en commun&#8230; et &#231;a n'augure rien de bon.</description>
    </item>
    <item>
      <title>Why an ethics assessment should come before a promotion</title>
      <link>https://www.fastcompany.com/91448918/why-an-ethics-assessment-should-come-before-a-promotion</link>
      <pubDate>2025-11-30T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448918/why-an-ethics-assessment-should-come-before-a-promotion</guid>
      <description>Research shows employees who commit unethical behavior have typically been in a company for at least six years&#8212;long enough to get promoted. 
Research shows employees who engage in unethical behavior&#8212;surprisingly&#8212;are not new to their organizations. They have been there for a considerable amount of time, typically at least six years, and have risen through their companies. Worse, the longer they have been with their organizations, the greater the financial and reputational damage when unethical behavior occurs.&#160;...</description>
    </item>
    <item>
      <title>Black Friday : voici les 3 forfaits mobile &#224; retenir cette semaine (dont une monstrueuse en data)</title>
      <link>https://www.frandroid.com/bons-plans/2889881_black-friday-voici-les-3-forfaits-mobile-a-retenir-cette-semaine-dont-une-monstrueuse-en-data</link>
      <pubDate>Sun, 30 Nov 2025 06:50:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2889881_black-friday-voici-les-3-forfaits-mobile-a-retenir-cette-semaine-dont-une-monstrueuse-en-data</guid>
      <description>
SFR, YouPrice et Cdiscount Mobile d&#233;gainent leurs meilleures offres pour cette semaine de Black Friday, ciblant aussi bien les grands consommateurs de streaming que les voyageurs connect&#233;s.
</description>
    </item>
  </channel>
</rss>
