<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 13 Jan 2026 12:57:26 GMT</lastBuildDate>
    <item>
      <title>Grok et deepfakes&#160;: pour la France, la strat&#233;gie d&#8217;Elon Musk est &#171;&#160;compl&#232;tement hypocrite&#160;&#187;</title>
      <link>https://www.01net.com/actualites/grok-et-deepfakes-pour-la-france-la-strategie-delon-musk-est-completement-hypocrite.html</link>
      <pubDate>Tue, 13 Jan 2026 12:47:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319724</guid>
      <description>L'ambassadrice de la France pour l'intelligence artificielle, Clara Chappaz, ne d&#233;col&#232;re pas. Rendre payante la g&#233;n&#233;ration d'images sur Grok apr&#232;s le scandale des deepfakes est une r&#233;ponse &#171; cynique &#187; qui permet &#224; X de mon&#233;tiser les abus.</description>
    </item>
    <item>
      <title>New ruling in Rockstar Games legal battle means the GTA 6 studio won't be forced to pay fired employees interim relief &#8212; 'We regret that we were put in a position where dismissals were necessary'</title>
      <link>https://www.techradar.com/gaming/new-ruling-in-rockstar-games-legal-battle-means-the-gta-6-studio-wont-be-forced-to-pay-fired-employees-interim-relief-we-regret-that-we-were-put-in-a-position-where-dismissals-were-necessary</link>
      <pubDate>Tue, 13 Jan 2026 12:45:19 +0000</pubDate>
      <guid isPermaLink="false">ZkWUXMTn88hkHsAPdmC4JW</guid>
      <description>A judge has officially ruled that Rockstar Games won't be forced to pay interim relief to the 34 Grand Theft Auto 6 developers it fired in October, after the IWGB accused the studio of union-busting.</description>
    </item>
    <item>
      <title>WhatsApp planche sur un syst&#232;me de contr&#244;le parental</title>
      <link>https://www.frandroid.com/marques/meta/2940627_whatsapp-planche-sur-un-systeme-de-controle-parental</link>
      <pubDate>Tue, 13 Jan 2026 12:37:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2940627_whatsapp-planche-sur-un-systeme-de-controle-parental</guid>
      <description>
Les &#233;quipes de Meta veulent aider les parents &#224; prot&#233;ger au mieux les &#233;changes de leurs enfants.
</description>
    </item>
    <item>
      <title>PC shipments just grew unexpectedly amid RAM shortages</title>
      <link>https://www.theverge.com/news/861124/pc-market-growth-q4-2025-idc</link>
      <pubDate>2026-01-13T07:30:48-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=861124</guid>
      <description>The PC market is bracing for a turbulent year ahead, but shipments managed to exceed expectations in the recent holiday quarter. IDC reports that shipments grew nearly 10 percent year-over-year in the fourth quarter of 2025, reaching 76.4 million in total. Microsoft's end of Windows 10 support undoubtedly helped push PC shipments up, but IDC [&#8230;]</description>
    </item>
    <item>
      <title>Superorganism raises $25M to back&#160;biodiversity startups</title>
      <link>https://techcrunch.com/2026/01/13/superorganism-raises-25m-to-back-biodiversity-startups/</link>
      <pubDate>Tue, 13 Jan 2026 12:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3082183</guid>
      <description>Superorganism launched in 2023 as what it claims is the first venture capital firm focused on biodiversity, aiming to serve as the conservationist on the cap table for nature-friendly startups. Now, the firm has closed its first fund, securing $25.9 million in capital commitments from Cisco Foundation, AMB Holdings, and Builders Vision, among others, along [&#8230;]...</description>
    </item>
    <item>
      <title>CMF Watch 3 Pro : la r&#233;cente montre de Nothing est d&#233;j&#224; &#224; -42 % gr&#226;ce aux soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2940665_cmf-watch-3-pro-la-recente-montre-de-nothing-est-deja-a-42-grace-aux-soldes-dhiver</link>
      <pubDate>Tue, 13 Jan 2026 12:27:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2940665_cmf-watch-3-pro-la-recente-montre-de-nothing-est-deja-a-42-grace-aux-soldes-dhiver</guid>
      <description>
D&#233;voil&#233;e l'an dernier, la CMF Watch 3 Pro est une montre connect&#233;e peu ch&#232;re, bourr&#233;e de fonctionnalit&#233;s et int&#233;grant m&#234;me ChatGPT. Pendant les soldes, AliExpress l'affiche &#224; 58,92 euros au lieu de 99 euros. 
</description>
    </item>
    <item>
      <title>Brazil orders Meta to suspend policy banning third-party AI chatbots from WhatsApp</title>
      <link>https://techcrunch.com/2026/01/13/brazil-orders-meta-to-suspend-policy-banning-third-party-ai-chatbots-from-whatsapp/</link>
      <pubDate>Tue, 13 Jan 2026 12:21:47 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3082217</guid>
      <description>Brazil's competition watchdog has ordered WhatsApp to put on hold its policy that bars third-party AI companies from using its business API to offer chatbots on the app. The agency has also started an investigation against the company to determine if the policy is anti-competitive.</description>
    </item>
    <item>
      <title>The new Sims 4 x Coach collab is the probably only way you'll get free designer handbags</title>
      <link>https://www.techradar.com/gaming/the-new-sims-4-x-coach-collab-is-the-probably-only-way-youll-get-free-designer-handbags</link>
      <pubDate>Tue, 13 Jan 2026 12:20:48 +0000</pubDate>
      <guid isPermaLink="false">SUqkhg7466mg6srdwbsEaM</guid>
      <description>A collection of free clothes just dropped in The Sims 4 as part of the game's latest collab.</description>
    </item>
    <item>
      <title>&#171;&#160;T&#8217;es mort&#160;?&#160;&#187; | Une application chinoise pour personnes seules fait r&#233;agir</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-01-13/t-es-mort/une-application-chinoise-pour-personnes-seules-fait-reagir.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Tue, 13 Jan 2026 07:16:02 -0500</pubDate>
      <guid isPermaLink="false">a407252b7c8932bb862c807b3702dfe2</guid>
      <description>&#171;&#160;T&#8217;es mort&#160;?&#160;&#187;&#160;: cette nouvelle application au nom provocateur, qui permet d&#8217;envoyer des alertes si son utilisateur ne se signale pas r&#233;guli&#232;rement, cartonne en Chine, o&#249; les personnes vivant en solo sont de plus en plus nombreuses.</description>
    </item>
    <item>
      <title>The Morning After: Apple will use Gemini to power Siri AI</title>
      <link>https://www.engadget.com/general/the-morning-after-engadget-newsletter-151521620.html?src=rss</link>
      <pubDate>Tue, 13 Jan 2026 12:15:21 +0000</pubDate>
      <guid isPermaLink="false">ccb5b39a-91b9-4139-8b54-19f7fc38ebaf</guid>
      <description>Apple and Google have confirmed that Gemini&#8217;s models power the new version of Siri and other generative AI features. CNBC broke the news, but Apple and Google soon followed up with a lengthy joint statement. Here&#8217;s part of it: &#8220;Apple determined that Google&#8217;s Al technology provides the most capable foundation for Apple Foundation Models&#8230; Apple Intelligence will continue to run on Apple devices and Private Cloud Compute, while maintaining Apple&#8217;s industry-leading privacy standards.&#8221;
In June, it was reported that Apple was considering partnerships with OpenAI and Anthropic for Siri (the voice ass...</description>
    </item>
    <item>
      <title>Amazon is pushing Alexa+ upgrades on Prime members &#8211; and users aren't happy about it</title>
      <link>https://www.techradar.com/ai-platforms-assistants/amazon-is-pushing-alexa-upgrades-on-prime-members-and-users-arent-happy-about-it</link>
      <pubDate>Tue, 13 Jan 2026 12:14:32 +0000</pubDate>
      <guid isPermaLink="false">RQ9hYL7HZbG9Fbn3iZdVG7</guid>
      <description>If you're an Amazon Prime member in the US, you might find you're getting an automatic upgrade to Alexa+.</description>
    </item>
    <item>
      <title>Samsung s&#8217;attaque au march&#233; de l&#8217;occasion avec le &#171; Reconditionn&#233; Premium &#187; pour payer son smartphone moins cher</title>
      <link>https://www.frandroid.com/marques/samsung/2940859_samsung-sattaque-au-marche-de-loccasion-avec-le-reconditionne-premium-pour-payer-son-smartphone-moins-cher</link>
      <pubDate>Tue, 13 Jan 2026 12:00:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2940859_samsung-sattaque-au-marche-de-loccasion-avec-le-reconditionne-premium-pour-payer-son-smartphone-moins-cher</guid>
      <description>
Samsung officialise l'arriv&#233;e de son programme &#171; Reconditionn&#233; Premium &#187; en France. Promettant des appareils remis &#224; neuf avec des pi&#232;ces d'origine et une garantie constructeur, le g&#233;ant cor&#233;en entend bien faire de l'ombre aux reconditionneurs tiers.
</description>
    </item>
    <item>
      <title>Peter Capaldi Thinks &#8216;Doctor Who&#8217; Has to Become Less Important to Survive</title>
      <link>https://gizmodo.com/peter-capaldi-doctor-who-disney-budget-2000709395</link>
      <pubDate>Tue, 13 Jan 2026 12:00:11 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000709395</guid>
      <description>The Twelfth Doctor himself has some thoughts about where 'Doctor Who' has gone wrong recently.</description>
    </item>
    <item>
      <title>Board Review: Tabletop Video Games With Physical Pieces</title>
      <link>https://www.wired.com/review/board-tabletop-game-console/</link>
      <pubDate>Tue, 13 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">695d20971d29f63444edbd88</guid>
      <description>I loved Board&#8217;s unique blend of tabletop gaming, but my family gave it mixed reviews.</description>
    </item>
    <item>
      <title>From Airbnb to the White House: Joe Gebbia is reshaping the government in Trump&#8217;s image</title>
      <link>https://www.fastcompany.com/91458973/chief-design-officer-joe-gebbia-reshaping-the-government</link>
      <pubDate>2026-01-13T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91458973/chief-design-officer-joe-gebbia-reshaping-the-government</guid>
      <description>Trump decimated the U.S. government&#8217;s digital design agencies and replaced them with a personal propaganda czar.
During President Donald Trump&#8217;s first administration, he left hundreds of government designers, across half a dozen or more agencies, to do their jobs.</description>
    </item>
    <item>
      <title>The limited-edition Star Wars Outlaws is down to its lowest-ever price at Amazon</title>
      <link>https://mashable.com/article/jan-13-star-wars-outlaws-ps5-deal</link>
      <pubDate>Tue, 13 Jan 2026 11:59:22 +0000</pubDate>
      <guid isPermaLink="false">04UnO3TvbLj7GfBUkUgOZYT</guid>
      <description>Score 60% off Amazon's exclusive 'Star Wars Outlaws &#8212; Limited Edition', with $40 off its PS5 price.</description>
    </item>
    <item>
      <title>Jimmy Kimmel spends 2 minutes breaking down exactly how much the world hates America</title>
      <link>https://mashable.com/video/jimmy-kimmel-world-hates-america</link>
      <pubDate>Tue, 13 Jan 2026 11:59:20 +0000</pubDate>
      <guid isPermaLink="false">03yudZNSDXnElx18gKxPtAD</guid>
      <description>Jimmy Kimmel has given a damning breakdown of how he believes the world currently views America.</description>
    </item>
    <item>
      <title>Elon Musk implores you not to buy a Tesla Roadster if safety is important to you</title>
      <link>https://www.techradar.com/vehicle-tech/elon-musk-implores-you-not-to-buy-a-tesla-roadster-if-safety-is-important-to-you</link>
      <pubDate>Tue, 13 Jan 2026 11:56:11 +0000</pubDate>
      <guid isPermaLink="false">YG9M5FqfLFetQdTrE6oFUP</guid>
      <description>Elon Musk warns customers not to buy a Roadster if safety is important in most recent podcast appearance.</description>
    </item>
    <item>
      <title>The Apple Mac mini is back under $500 at Amazon &#8212; act fast to save over $90</title>
      <link>https://mashable.com/article/jan-13-apple-mac-mini-deal</link>
      <pubDate>Tue, 13 Jan 2026 11:52:10 +0000</pubDate>
      <guid isPermaLink="false">010X0CDLPUYLhRTg75RfPH9</guid>
      <description>As of Jan. 13, the Apple 2024 Mac mini is on sale for $499.99 at Amazon, 17% off its list price of $599.</description>
    </item>
    <item>
      <title>&#171;&#160;L&#8217;optimisation est risqu&#233;e&#160;&#187; : dans ce jeu, vos FPS sont votre barre de vie</title>
      <link>https://www.frandroid.com/produits-android/console/2940761_loptimisation-est-risquee-dans-ce-jeu-vos-fps-sont-votre-barre-de-vie</link>
      <pubDate>Tue, 13 Jan 2026 11:46:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2940761_loptimisation-est-risquee-dans-ce-jeu-vos-fps-sont-votre-barre-de-vie</guid>
      <description>
Et si optimiser les performances d'un jeu avait un autre avantage que la fluidit&#233; ? FPS Quest promet d'indexer votre barre de vie avec votre fr&#233;quence d'images par seconde. Enfin, pas tout &#224; fait.
</description>
    </item>
    <item>
      <title>Galaxy A07 5G&#160;: le moins cher des Samsung sera mis &#224; jour jusqu&#8217;en 2032</title>
      <link>https://www.01net.com/actualites/galaxy-a07-5g-moins-cher-samsung-mis-a-jour-jusquen-2032.html</link>
      <pubDate>Tue, 13 Jan 2026 11:42:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319686</guid>
      <description>Samsung promet d&#233;sormais six ans de mises &#224; jour pour son nouveau mod&#232;le 5G le moins cher : le Galaxy A07 5G.</description>
    </item>
    <item>
      <title>Boulanger solde un pack Philips Hue qui a tout ce qu&#8217;il faut pour s&#233;curiser et illimuner votre domicile</title>
      <link>https://www.frandroid.com/bons-plans/2817805_boulanger-solde-un-pack-philips-hue-qui-a-tout-ce-quil-faut-pour-securiser-et-illimuner-votre-domicile</link>
      <pubDate>Tue, 13 Jan 2026 11:38:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2817805_boulanger-solde-un-pack-philips-hue-qui-a-tout-ce-quil-faut-pour-securiser-et-illimuner-votre-domicile</guid>
      <description>
Boulanger propose un kit Philips Hue tr&#232;s complet : avec une cam&#233;ra de surveillance, deux ampoules et des d&#233;tecteurs d&#8217;ouverture de portes, ce pack est utile pour s&#233;curiser votre maison, tout en ajoutant une petite ambiance. Bonne nouvelle : il passe de 199,99 euros &#224; 139,99 euros gr&#226;ce &#224; cette offre des soldes.&#160;
</description>
    </item>
    <item>
      <title>The Samsung Odyssey G5 gaming monitor is almost half price &#8212; now only $249.99</title>
      <link>https://mashable.com/article/jan-13-samsung-odyssey-g5-gaming-monitor-deal</link>
      <pubDate>Tue, 13 Jan 2026 11:37:32 +0000</pubDate>
      <guid isPermaLink="false">04k3LHblzVDiNFSWNBaYorj</guid>
      <description>The Samsung Odyssey gaming monitor is now only $249.99, both for the 32-inch and 27-inch models.</description>
    </item>
    <item>
      <title>Arnaque &#224; la carte Vitale en cours&#160;: m&#233;fiez-vous des mails de l&#8217;Assurance Maladie, c&#8217;est peut-&#234;tre une redoutable attaque phishing</title>
      <link>https://www.01net.com/actualites/arnaque-carte-vitale-cours-mefiez-vous-mails-assurance-maladie-peut-etre-redoutable-attaque-phishing.html</link>
      <pubDate>Tue, 13 Jan 2026 11:33:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319623</guid>
      <description>Une nouvelle arnaque &#224; la carte Vitale se propage en France. Des pirates diffusent actuellement une s&#233;rie de mails de phishing qui pr&#233;tendent provenir de l'Assurance maladie. Profitant des r&#233;centes fuites de donn&#233;es de sant&#233;, les cybercriminels tentent de pirater les coordonn&#233;es bancaires des Fran&#231;ais.</description>
    </item>
    <item>
      <title>Moon phase today: What the Moon will look like on January 13</title>
      <link>https://mashable.com/article/moon-phase-today-jan-13</link>
      <pubDate>Tue, 13 Jan 2026 11:32:10 +0000</pubDate>
      <guid isPermaLink="false">04zTO3R9LbQ7aufVZrfNmnX</guid>
      <description>See the Moon phase expected for January 13, 2025 as well as when the next Full Moon is expected.</description>
    </item>
    <item>
      <title>Wordle today: Answer, hints for January 13, 2026</title>
      <link>https://mashable.com/article/wordle-today-answer-january-13-2026</link>
      <pubDate>Tue, 13 Jan 2026 11:31:44 +0000</pubDate>
      <guid isPermaLink="false">02fEKMWyFszKATBm63UlCEE</guid>
      <description>Here's the answer for "Wordle" #1668 on January 13 as well as a few hints, tips, and clues to help you solve it yourself.</description>
    </item>
    <item>
      <title>NYT Connections hints today: Clues, answers for January 13, 2026</title>
      <link>https://mashable.com/article/nyt-connections-hint-answer-today-january-13-2026</link>
      <pubDate>Tue, 13 Jan 2026 11:31:20 +0000</pubDate>
      <guid isPermaLink="false">042bWpqDhbFqPNJxPmCbxfy</guid>
      <description>Connections is a New York Times word game that's all about finding the "common threads between words." How to solve the puzzle.</description>
    </item>
    <item>
      <title>NYT Strands hints, answers for January 13, 2026</title>
      <link>https://mashable.com/article/strands-nyt-hint-january-13-2026</link>
      <pubDate>Tue, 13 Jan 2026 11:31:12 +0000</pubDate>
      <guid isPermaLink="false">03eOWWuCM5CQQQibFI6sVhk</guid>
      <description>The NYT Strands hints and answers you need to make the most of your puzzling experience.</description>
    </item>
    <item>
      <title>Can the Garmin Forerunner 55 replace a personal coach for half-marathon prep?</title>
      <link>https://mashable.com/article/can-the-garmin-forerunner-55-replace-a-personal-coach</link>
      <pubDate>Tue, 13 Jan 2026 11:30:32 +0000</pubDate>
      <guid isPermaLink="false">04Kxv1K7FPR6b1sVOA59R4D</guid>
      <description>Can the Garmin Forerunner 55 help you train for a half-marathon? Can it replace a personal coach?</description>
    </item>
    <item>
      <title>Spanish energy giant Endesa says it was hit by data breach, customers affected and 20 million files allegedly put up for sale</title>
      <link>https://www.techradar.com/pro/security/spanish-energy-giant-endesa-says-it-was-hit-by-data-breach-customers-affected-and-20-million-files-allegedly-put-up-for-sale</link>
      <pubDate>Tue, 13 Jan 2026 11:30:24 +0000</pubDate>
      <guid isPermaLink="false">s4DoDbfEmrghwn2HZduo64</guid>
      <description>A large database is being offered on the dark web.</description>
    </item>
    <item>
      <title>Reid Hoffman Wants Silicon Valley to &#8216;Stand Up&#8217; Against the Trump Administration</title>
      <link>https://www.wired.com/story/the-big-interview-podcast-reid-hoffman/</link>
      <pubDate>Tue, 13 Jan 2026 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">696181d00ad0cc15489a6a1c</guid>
      <description>The LinkedIn cofounder and frequent Trump target has a simple message for his peers: &#8220;Just speak up about the things that you think are true.&#8221;</description>
    </item>
    <item>
      <title>Atonemo Streamplayer Review: Make Old Speakers New Again</title>
      <link>https://www.wired.com/review/atonemo-streamplayer/</link>
      <pubDate>Tue, 13 Jan 2026 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">69652aadc28bcbc41cac508f</guid>
      <description>Can this discrete audio puck really drag any old speakers into the streaming age?</description>
    </item>
    <item>
      <title>Converge Bio raises $25M, backed by Bessemer and execs from Meta, OpenAI, Wiz</title>
      <link>https://techcrunch.com/2026/01/13/ai-drug-discovery-startup-converge-bio-pulls-in-25m-from-bessemer-and-execs-from-meta-openai-and-wiz/</link>
      <pubDate>Tue, 13 Jan 2026 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3081727</guid>
      <description>AI drug discovery startup Converge Bio raised $25 million in a Series A led by Bessemer Venture Partners, with additional backing from executives at Meta, OpenAI, and Wiz.</description>
    </item>
    <item>
      <title>'Small decisions have long tails' &#8211; I asked ChatGPT for my horoscope, and what it told me was surprisingly grounding</title>
      <link>https://www.techradar.com/ai-platforms-assistants/small-decisions-have-long-tails-i-asked-chatgpt-for-my-horoscope-and-what-it-told-me-was-surprisingly-grounding</link>
      <pubDate>Tue, 13 Jan 2026 11:28:05 +0000</pubDate>
      <guid isPermaLink="false">piMb8eEMeVuxpgUviPoq9g</guid>
      <description>ChatGPT's horoscope led to a surprisingly grounded reflection on the future</description>
    </item>
    <item>
      <title>Hulu has dropped Tell Me Lies season 3 episode 3 a week early &#8212; and its shock cliffhanger could be the show's most brutal ending ever</title>
      <link>https://www.techradar.com/streaming/hulu/tell-me-lies-season-3-episode-3-early-release</link>
      <pubDate>Tue, 13 Jan 2026 11:26:34 +0000</pubDate>
      <guid isPermaLink="false">zF52xdtFZ7JspVCBTpwz2j</guid>
      <description>Surprise! Tell Me Lies season 3 episode 3 is streaming on Hulu a week earlier than expected &#8211; and we're now left on the most jaw-dropping cliffhanger in the show's history.</description>
    </item>
    <item>
      <title>Voiture &#233;lectrique &#224; 100 euros : comment Renault a tout rafl&#233; en 2025</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2940689_voiture-electrique-a-100-euros-comment-renault-a-tout-rafle-en-2025</link>
      <pubDate>Tue, 13 Jan 2026 11:21:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2940689_voiture-electrique-a-100-euros-comment-renault-a-tout-rafle-en-2025</guid>
      <description>
Lanc&#233; fin septembre 2025, le leasing social vient de s'achever avec 50 000 voitures &#233;lectriques disponibles &#224; partir de 100 euros par mois. L'occasion de faire un bilan, et de s'apercevoir que la R5 (et Renault en g&#233;n&#233;ral) sont les grands gagnants du dispositif.
</description>
    </item>
    <item>
      <title>Call of Duty might just be about to drop on Nintendo Switch 2 according to a new leak</title>
      <link>https://www.techradar.com/gaming/nintendo/call-of-duty-might-just-be-about-to-drop-on-nintendo-switch-2-according-to-a-new-leak</link>
      <pubDate>Tue, 13 Jan 2026 11:08:25 +0000</pubDate>
      <guid isPermaLink="false">vApykzRcqEQS9KS2hy3STe</guid>
      <description>A recent leak suggests that the Call of Duty series is set to arrive on Nintendo Switch 2 in the near future.</description>
    </item>
    <item>
      <title>Jon Stewart summarises the current state of the world in 20 minutes</title>
      <link>https://mashable.com/video/jon-stewart-trump-venezuela-greenland-ice</link>
      <pubDate>Tue, 13 Jan 2026 11:05:24 +0000</pubDate>
      <guid isPermaLink="false">01zccPx4EfOW5VJCe3NQVUP</guid>
      <description>Jon Stewart has summarised recent events, from ICE's shooting of Renee Good to Trump's stance on Greenland and Venezuela, in his latest "Daily Show" monologue.</description>
    </item>
    <item>
      <title>A modern head-fi great is bringing out planar magnetic headphones with huge drivers and an even bigger frequency range &#8212; and yet the headband might be the coolest part</title>
      <link>https://www.techradar.com/audio/turntables/a-modern-head-fi-great-is-bringing-out-planar-magnetic-headphones</link>
      <pubDate>Tue, 13 Jan 2026 11:01:49 +0000</pubDate>
      <guid isPermaLink="false">ufCGuWE2RxZBenNVKiCsWH</guid>
      <description>Moondrop's new planar magnetic headphones feature 100mm drivers and a 3D-printed headband</description>
    </item>
    <item>
      <title>Trump Declared a Space Race With China. The US Is Losing</title>
      <link>https://www.wired.com/story/china-us-moon-race-trump-losing/</link>
      <pubDate>Tue, 13 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">691cca2c6dccde5821e66577</guid>
      <description>If you want to put people back on the moon, don&#8217;t gut the agency in charge of getting them there.</description>
    </item>
    <item>
      <title>Proton's Lumo AI chatbot now has an encrypted space for your projects</title>
      <link>https://www.engadget.com/ai/protons-lumo-ai-chatbot-now-has-an-encrypted-space-for-your-projects-110000298.html?src=rss</link>
      <pubDate>Tue, 13 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">d669e558-d864-4821-a17f-c9a1636327df</guid>
      <description>Proton&#8217;s latest update for Lumo, its privacy-focused chatbot, introduces a feature called Projects. It&#8217;s a dedicated and encrypted space for tasks that you know you&#8217;ll access again and again over an extended period of time, such as papers you&#8217;ll have to work on the whole semester or plans for a big trip you&#8217;re taking later this year. Lumo will remember and keep all the information and all the files you upload for every project you create. Any document you upload or resources you add to the chat will sync across devices, so you don&#8217;t have to repeat yourself every time you access a task. Project...</description>
    </item>
    <item>
      <title>This skyline-stealing mural also powers its building</title>
      <link>https://www.fastcompany.com/91473283/this-skyline-stealing-mural-also-powers-its-building</link>
      <pubDate>2026-01-13T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91473283/this-skyline-stealing-mural-also-powers-its-building</guid>
      <description>A residential tower in Edmonton, Alberta, uses colorful solar panels to turn a mural into a power source.
At first glance, the most striking part of the SunRise, a recently redeveloped residential tower in Edmonton, Alberta, is the boldly colored facade, with strips of primary color and a lively mural. Called The Land We Share, the vibrant landscape sketch has sparkled on the skyline since its unveiling this past summer....</description>
    </item>
    <item>
      <title>Nintendo president says the increasing cost of RAM is 'something we must monitor closely', but says there is no 'immediate impact on earnings' where the Switch 2 is concerned</title>
      <link>https://www.techradar.com/gaming/nintendo/nintendo-president-says-the-increasing-cost-of-ram-is-something-we-must-monitor-closely-but-says-there-is-no-immediate-impact-on-earnings-where-the-switch-2-is-concerned</link>
      <pubDate>Tue, 13 Jan 2026 10:59:21 +0000</pubDate>
      <guid isPermaLink="false">cjVXtJGcUEP45jiKEfnj9n</guid>
      <description>Nintendo president Shuntaro Furukawa says the company is monitoring the increase in RAM pricing and memory shortage within the industry, but wouldn't comment on whether the issue could affect the Switch 2 price tag.</description>
    </item>
    <item>
      <title>Xiaomi multiplie les deals avec l&#8217;arriv&#233;e de la 2e d&#233;marque des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2936033_les-produits-xiaomi-ne-sont-pas-epargnes-lors-des-soldes-dhiver-voici-les-8-meilleurs-deals</link>
      <pubDate>Tue, 13 Jan 2026 10:58:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2936033_les-produits-xiaomi-ne-sont-pas-epargnes-lors-des-soldes-dhiver-voici-les-8-meilleurs-deals</guid>
      <description>
Pour cette premi&#232;re semaine des soldes Xiaomi commence fort en proposant m&#234;me son nouveau Poco M8 en promo. Demain d&#233;marre la 2&#7497; d&#233;marque, mais on trouve&#160;d&#233;j&#224;&#160;de tr&#232;s bonnes affaires sur ses smartphones, tablettes et t&#233;l&#233;viseurs... D&#233;couvrez les meilleures offres.
</description>
    </item>
    <item>
      <title>Prix des PC portables : l&#8217;astuce radicale de HP pour limiter la hausse des prix, mais pas pour tout le monde</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/2940387_penurie-de-ram-et-si-la-chine-venait-sauver-le-marche-pc-europeen</link>
      <pubDate>Tue, 13 Jan 2026 10:57:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/2940387_penurie-de-ram-et-si-la-chine-venait-sauver-le-marche-pc-europeen</guid>
      <description>
Alors que HP r&#233;fl&#233;chirait &#224; int&#233;grer de la m&#233;moire DRAM chinoise &#224; certains de ses PC portables, la Chine se place en v&#233;ritable alternative pour compenser la crise que traverse le march&#233; cette ann&#233;e.
</description>
    </item>
  </channel>
</rss>
