<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 15 Dec 2025 07:28:44 GMT</lastBuildDate>
    <item>
      <title>Microsoft Copilot s&#8217;invite sur votre TV LG : pourquoi cette int&#233;gration agace d&#233;j&#224; les utilisateurs</title>
      <link>https://www.frandroid.com/marques/lg/2909629_microsoft-copilot-sinvite-sur-votre-tv-lg-pourquoi-cette-integration-agace-deja-les-utilisateurs</link>
      <pubDate>Mon, 15 Dec 2025 07:25:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lg/2909629_microsoft-copilot-sinvite-sur-votre-tv-lg-pourquoi-cette-integration-agace-deja-les-utilisateurs</guid>
      <description>
Les utilisateurs de t&#233;l&#233;viseurs LG voient progressivement arriver Copilot via une r&#233;cente mise &#224; jour de webOS. Probl&#232;me : l'application ne peut pas &#234;tre supprim&#233;e.
</description>
    </item>
    <item>
      <title>Le prix du r&#233;cent DJI Romo S, un aspirateur robot ultra-puissant, d&#233;gringole de 500 euros</title>
      <link>https://www.frandroid.com/bons-plans/2908799_le-prix-du-recent-dji-romo-s-un-aspirateur-robot-ultra-puissant-degringole-de-500-euros</link>
      <pubDate>Mon, 15 Dec 2025 07:23:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2908799_le-prix-du-recent-dji-romo-s-un-aspirateur-robot-ultra-puissant-degringole-de-500-euros</guid>
      <description>
D&#233;j&#224; bien install&#233; sur le march&#233; des drones, DJI a r&#233;cemment investi le secteur des aspirateurs robots et d&#233;voil&#233; trois r&#233;f&#233;rences, dont le Romo S, qui nous int&#233;resse ici. Un mod&#232;le bourr&#233; de technologies, et que l'on trouve &#224; 799 euros au lieu de 1 299 euros chez plusieurs e-commer&#231;ants.
</description>
    </item>
    <item>
      <title>La menace des dashcams&#160;: comment votre voiture peut devenir un outil de surveillance de masse</title>
      <link>https://www.01net.com/actualites/menace-dashcams-voiture-peut-devenir-outil-surveillance-masse.html</link>
      <pubDate>Mon, 15 Dec 2025 07:13:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314865</guid>
      <description>Des chercheurs ont montr&#233; qu&#8217;une simple dashcam peut se transformer en un outil de surveillance de masse. Avec une cam&#233;ra pirat&#233;e, des cybercriminels peuvent en effet espionner tout ce qu'il se passe autour et &#224; l'int&#233;rieur de votre voiture.</description>
    </item>
    <item>
      <title>Samsung Galaxy A17 5G vs POCO X7&#160;: comment choisir le meilleur smartphone d&#8217;entr&#233;e de gamme&#160;?</title>
      <link>https://www.frandroid.com/versus/2871049_samsung-galaxy-a17-5g-vs-poco-x7-comment-choisir-le-meilleur-smartphone-dentree-de-gamme</link>
      <pubDate>Mon, 15 Dec 2025 06:55:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/versus/2871049_samsung-galaxy-a17-5g-vs-poco-x7-comment-choisir-le-meilleur-smartphone-dentree-de-gamme</guid>
      <description>
Sur l'entr&#233;e de gamme, l'ogre Samsung subit les assauts motiv&#233;s d'un Xiaomi qui ne rel&#226;che jamais ses efforts et offre, avec le POCO X7, un rapport qualit&#233;-prix absolument redoutable. Comment faire son choix, si l'on h&#233;site avec un Galaxy A17&#160;?
</description>
    </item>
    <item>
      <title>Outlook ne s&#8217;ouvre plus sur votre PC&#160;? Voici ce qu&#8217;il faut faire pour r&#233;gler le probl&#232;me</title>
      <link>https://www.01net.com/actualites/outlook-ne-souvre-plus-sur-votre-pc-voici-ce-quil-faut-faire-pour-regler-le-probleme.html</link>
      <pubDate>Mon, 15 Dec 2025 06:52:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315294</guid>
      <description>Des utilisateurs du client de messagerie de Microsoft rapportent qu&#8217;ils n&#8217;arrivent plus &#224; l&#8217;ouvrir depuis quelques jours. Si vous &#234;tes dans cette situation, tout n&#8217;est pas perdu. Il est possible de d&#233;bloquer la situation assez facilement.</description>
    </item>
    <item>
      <title>Waze teste enfin cette fonction que Google Maps a depuis des ann&#233;es</title>
      <link>https://www.01net.com/actualites/waze-teste-enfin-fonction-google-maps-depuis-des-annees.html</link>
      <pubDate>Mon, 15 Dec 2025 06:51:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315287</guid>
      <description>Waze commence enfin &#224; tester l&#8217;affichage des feux de circulation sur sa carte. Une nouveaut&#233; tr&#232;s attendue par les utilisateurs de l&#8217;application.</description>
    </item>
    <item>
      <title>J&#8217;ai revendu mon Vision Pro et je ne le regrette pas</title>
      <link>https://www.01net.com/actualites/jai-revendu-mon-vision-pro-et-je-ne-le-regrette-pas.html</link>
      <pubDate>Mon, 15 Dec 2025 06:47:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310221</guid>
      <description>Je r&#234;vais de vivre et de travailler dans &#171; l&#8217;informatique spatiale &#187; avant tout le monde. Dix-huit mois plus tard, j&#8217;ai surtout compris que le futur selon Apple pesait lourd sur le nez, co&#251;tait trop cher et prenait la poussi&#232;re. J&#8217;ai donc revendu mon Vision Pro, et je ne regrette rien.</description>
    </item>
    <item>
      <title>Xgimi Horizon 20 : ce nouveau vid&#233;oprojecteur 4K id&#233;al pour le gaming est d&#233;j&#224; en promotion</title>
      <link>https://www.frandroid.com/bons-plans/2908353_xgimi-horizon-20-ce-nouveau-videoprojecteur-4k-ideal-pour-le-gaming-est-deja-en-promotion</link>
      <pubDate>Mon, 15 Dec 2025 06:34:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2908353_xgimi-horizon-20-ce-nouveau-videoprojecteur-4k-ideal-pour-le-gaming-est-deja-en-promotion</guid>
      <description>
Pr&#233;sent&#233; lors du salon IFA de Berlin en septembre 2025, le Xgimi Horizon 20 est un tout nouveau vid&#233;oprojecteur haut de gamme taill&#233; pour les amateurs de cin&#233;ma et de gaming. Boulanger, Son-Vid&#233;o et Easy Lounge le proposent d'ores et d&#233;j&#224; &#224; prix r&#233;duit : 1 599 euros au lieu de 1 699 euros.
</description>
    </item>
    <item>
      <title>Waze va enfin se doter d&#8217;une fonctionnalit&#233; dont Google Maps dispose depuis longtemps</title>
      <link>https://www.frandroid.com/marques/google/2909623_waze-va-enfin-se-doter-dune-fonctionnalite-dont-google-maps-dispose-depuis-longtemps</link>
      <pubDate>Mon, 15 Dec 2025 06:29:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2909623_waze-va-enfin-se-doter-dune-fonctionnalite-dont-google-maps-dispose-depuis-longtemps</guid>
      <description>
Alors que Waze appartient &#224; Google depuis des ann&#233;es, l&#8217;appli de navigation isra&#233;lienne est encore en retard sur certaines fonctionnalit&#233;s par rapport &#224; sa grande s&#339;ur. Heureusement, l&#8217;&#233;cart se resserre petit &#224; petit, comme le prouve l&#8217;arriv&#233;e des feux rouges sur le logiciel.
</description>
    </item>
    <item>
      <title>iRobot files for bankruptcy</title>
      <link>https://www.theverge.com/news/844460/irobot-files-for-bankruptcy</link>
      <pubDate>2025-12-15T01:11:18-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=844460</guid>
      <description>After 35 years, the maker of the Roomba robot vacuum filed for bankruptcy protection late Sunday night. Following warnings issued earlier this year that it was fast running out of options, iRobot says it is entering Chapter 11 protection and will be acquired by its contract manufacturer, the Chinese-based Picea Robotics. The company says it [&#8230;]</description>
    </item>
  </channel>
</rss>
