<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 15 Nov 2025 17:29:53 GMT</lastBuildDate>
    <item>
      <title>Here are 25 of our favorite outdoorsy deals from REI&#8217;s massive Holiday Sale</title>
      <link>https://www.theverge.com/gadgets/821397/best-rei-holiday-sale-2025-deals</link>
      <pubDate>2025-11-15T12:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=821397</guid>
      <description>REI doesn&#8217;t do Black Friday, but that doesn&#8217;t mean you won&#8217;t be able to save this holiday season. The outdoor retailer&#8217;s annual Holiday Sale is now underway and runs through November 24th, offering up to 30 percent off gadgets and gear designed for the outdoors. Right now, you can save on Garmin watches, headlamps, sleeping [&#8230;]</description>
    </item>
    <item>
      <title>Le Black Friday n&#8217;&#233;pargne pas la Switch 2 ! Voici les meilleurs deals sur les consoles, jeux, manettes et accessoires</title>
      <link>https://www.frandroid.com/bons-plans/2853043_meme-la-nintendo-switch-2-nechappe-pas-au-black-friday-voici-les-12-meilleurs-deals-sur-les-consoles-manettes-et-accessoires</link>
      <pubDate>Sat, 15 Nov 2025 16:58:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2853043_meme-la-nintendo-switch-2-nechappe-pas-au-black-friday-voici-les-12-meilleurs-deals-sur-les-consoles-manettes-et-accessoires</guid>
      <description>
L'ann&#233;e 2025 a &#233;t&#233; on ne peut plus riche pour le jeu vid&#233;o. Outre la sortie de nouveaux titres, la Nintendo Switch 2 a la part belle depuis plusieurs mois. D'autant plus qu'elle fait partie des meilleures offres dans cette s&#233;lection du pr&#233;-Black Friday, en pack avec Mario Kart World ou avec des accessoires suppl&#233;mentaires.
</description>
    </item>
    <item>
      <title>Behold, &#8216;Varanasi&#8217;, the Next Movie from S.S. Rajamouli</title>
      <link>https://gizmodo.com/behold-varanasi-the-next-movie-from-s-s-rajamouli-2000686433</link>
      <pubDate>Sat, 15 Nov 2025 16:56:07 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000686433</guid>
      <description>The 'RRR' and 'Baahubali' director is back with another action movie epic with the 2027-bound 'Varanasi.'</description>
    </item>
    <item>
      <title>Samsung Galaxy S26 et S26 Plus : design, photo, performances, fen&#234;tre de sortie, prix&#8230; Tout savoir sur les prochains smartphones.</title>
      <link>https://www.frandroid.com/marques/samsung/2867815_samsung-galaxy-s26-et-s26-plus-design-photo-performances-fenetre-de-sortie-prix-tout-savoir-sur-les-prochains-smartphones</link>
      <pubDate>Sat, 15 Nov 2025 16:55:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2867815_samsung-galaxy-s26-et-s26-plus-design-photo-performances-fenetre-de-sortie-prix-tout-savoir-sur-les-prochains-smartphones</guid>
      <description>
Voici tout ce qu'on sait d&#233;j&#224; sur les Samsung Galaxy S26 et Galaxy S26 Plus qui arrivent d&#233;but 2026 (fen&#234;tre de sortie, design, prix, performances...).
</description>
    </item>
    <item>
      <title>Boulanger continue de liquider ses stocks le week-end du pr&#233;-Black Friday : voici les 23 meilleures offres</title>
      <link>https://www.frandroid.com/bons-plans/2859523_boulanger-multiplie-deja-les-promotions-au-pre-black-friday-les-16-deals-a-retenir</link>
      <pubDate>Sat, 15 Nov 2025 16:39:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2859523_boulanger-multiplie-deja-les-promotions-au-pre-black-friday-les-16-deals-a-retenir</guid>
      <description>
Depuis fin octobre, Boulanger lance ses offres pr&#233;-Black Friday avec jusqu&#8217;&#224; 40&#8239;% de r&#233;duction sur de nombreux produits tech, dont smartphones, TV, ordinateurs portables et appareils audio. D&#233;couvrez celles qui valent le d&#233;tour. 
</description>
    </item>
    <item>
      <title>The Best TVs We&#8217;ve Reviewed in 2025: Sony, Samsung, LG, and More</title>
      <link>https://www.wired.com/gallery/best-tvs/</link>
      <pubDate>Sat, 15 Nov 2025 16:30:00 +0000</pubDate>
      <guid isPermaLink="false">5bff11760dae8918461793cd</guid>
      <description>From LEDs to fancy OLED models, in 4K and beyond, these are our favorite televisions at every price.</description>
    </item>
    <item>
      <title>Tim Cook, le patron d&#8217;Apple, pourrait &#234;tre remplac&#233; d&#232;s l&#8217;ann&#233;e prochaine</title>
      <link>https://www.01net.com/actualites/tim-cook-le-patron-dapple-pourrait-etre-remplace-des-lannee-prochaine.html</link>
      <pubDate>Sat, 15 Nov 2025 16:18:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308475</guid>
      <description>Tim Cook pourrait quitter le poste de CEO d'Apple en 2026, apr&#232;s 15 ans pass&#233;s &#224; la t&#234;te de l'entreprise. Si John Ternus, le vice-pr&#233;sident en charge de l'ing&#233;nierie mat&#233;rielle, semble bien plac&#233; pour le remplacer, la d&#233;cision en reviendra au conseil d'administration.</description>
    </item>
    <item>
      <title>Amazon enl&#232;ve 400 &#8364; sur ce robot-tondeuse tout terrain haut de gamme (jusqu&#8217;&#224; 800 m&#178;) pour le pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2868819_amazon-enleve-400-e-sur-ce-robot-tondeuse-tout-terrain-haut-de-gamme-jusqua-800-m%c2%b2-pour-le-pre-black-friday</link>
      <pubDate>Sat, 15 Nov 2025 16:10:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2868819_amazon-enleve-400-e-sur-ce-robot-tondeuse-tout-terrain-haut-de-gamme-jusqua-800-m%c2%b2-pour-le-pre-black-friday</guid>
      <description>
Le pr&#233;-Black Friday fait cavalier seul depuis le 31 octobre, balan&#231;ant des promos comme des signaux de fum&#233;e avant la temp&#234;te. Aujourd&#8217;hui, c&#8217;est un robot tondeuse taill&#233; pour les jardins caboss&#233;s qui passe &#224; l&#8217;offensive, le Mammotion Luba Mini AWD 800 tombe &#224; 999,99 euros, contre 1 399,99 euros habituellement, chez Boulanger.
</description>
    </item>
    <item>
      <title>Possessor(s) is a fast-paced action game that gets off to a slow start</title>
      <link>https://www.theverge.com/games/821117/possessors-review-pc-ps5</link>
      <pubDate>2025-11-15T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=821117</guid>
      <description>I remember being blown away by the 2024 reveal trailer for Possessor(s), the new game from Hyper Light Drifter developer Heart Machine. The trailer features a striking art design, where an animated 2D character explores and fights in side-scrolling environments with gorgeous 3D backgrounds, and it's all set to moody, powerful music. The final game, [&#8230;]...</description>
    </item>
    <item>
      <title>Le Black Friday casse les prix des aspirateurs robots, lumi&#232;res, airfryer&#8230; la maison connect&#233;e s&#8217;&#233;toffe avec ces offres</title>
      <link>https://www.frandroid.com/bons-plans/2858095_black-friday-en-avance-sur-les-aspirateurs-robot-laveurs-robot-tondeuses-airfryers-voici-la-selection-des-meilleures-promotions-domotiques</link>
      <pubDate>Sat, 15 Nov 2025 15:50:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2858095_black-friday-en-avance-sur-les-aspirateurs-robot-laveurs-robot-tondeuses-airfryers-voici-la-selection-des-meilleures-promotions-domotiques</guid>
      <description>
Aspirateur-robot ou balai-laveur, air fryer, &#233;clairage connect&#233;, cam&#233;ras de surveillance... Le Black Friday en avant-premi&#232;re n'oublie pas les offres sur la maison connect&#233;e. Pour mettre un pied dans la domotique ou am&#233;liorer son foyer connect&#233;, voici les meilleures offres.
</description>
    </item>
    <item>
      <title>Cdiscount redouble d&#8217;efforts ce week-end du pr&#233;-Black Friday avec de bien belles promotions</title>
      <link>https://www.frandroid.com/bons-plans/2850059_cdiscount-degaine-de-belles-offres-pour-le-pre-black-friday-voici-les-12-deals-a-retenir</link>
      <pubDate>Sat, 15 Nov 2025 15:35:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850059_cdiscount-degaine-de-belles-offres-pour-le-pre-black-friday-voici-les-12-deals-a-retenir</guid>
      <description>
Cdiscount participe depuis plus d'une semaine au pr&#233;-Black Friday et continue d&#8217;ajouter de nouvelles offres avec des prix tr&#232;s attractifs sur de nombreux produits Tech, dont smartphones, TV et consoles de jeux. Voici les offres les plus int&#233;ressantes du moment.
</description>
    </item>
    <item>
      <title>Carol&#8217;s Fake &#8216;Pluribus&#8217; Book Gets a Very Real Chapter You Can Read for Free</title>
      <link>https://gizmodo.com/carols-fake-pluribus-book-gets-a-very-real-chapter-you-can-read-for-free-2000686302</link>
      <pubDate>Sat, 15 Nov 2025 15:30:52 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000686302</guid>
      <description>See if Carol's as good a romantasy writer as 'Pluribus' paints her with an excerpt for her latest novel, 'Bloodsong of Wycaro.'</description>
    </item>
  </channel>
</rss>
