<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 03 Feb 2026 06:58:44 GMT</lastBuildDate>
    <item>
      <title>Porsche Cayenne &#233;lectrique&#160;: les secrets de la batterie qui offre 640 km d&#8217;autonomie &#224; un SUV de 2,6 tonnes</title>
      <link>https://www.01net.com/actualites/porsche-cayenne-electrique-les-secrets-de-la-batterie-qui-offre-640-km-dautonomie-a-un-suv-de-26-tonnes.html</link>
      <pubDate>Tue, 03 Feb 2026 06:57:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323797</guid>
      <description>Comment Porsche fabrique-t-il la batterie de son Cayenne &#233;lectrique ? Et pourquoi est-elle unique. Pour le savoir, on est all&#233;s en Slovaquie dans l&#8217;usine de fabrication des nouvelles batteries de Porsche.</description>
    </item>
    <item>
      <title>Sony WF-1000XM6 : une fuite massive d&#233;voile un design totalement repens&#233; et un nouveau bo&#238;tier</title>
      <link>https://www.frandroid.com/marques/sony/2963717_sony-wf-1000xm6-une-fuite-massive-devoile-un-design-totalement-repense-et-un-nouveau-boitier</link>
      <pubDate>Tue, 03 Feb 2026 06:57:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2963717_sony-wf-1000xm6-une-fuite-massive-devoile-un-design-totalement-repense-et-un-nouveau-boitier</guid>
      <description>
Attendus dans les prochaines semaines, les WF-1000XM6, prochains &#233;couteurs haut de gamme de Sony, ont d&#233;j&#224; fait l'objet d'une fuite importante avec l'apparition d'une page produit chez un revendeur tha&#239;landais.
</description>
    </item>
    <item>
      <title>En fusionnant SpaceX et xAI, Elon Musk joue son va-tout</title>
      <link>https://www.frandroid.com/marques/spacex/2963719_en-fusionnant-spacex-et-xai-elon-musk-joue-son-va-tout</link>
      <pubDate>Tue, 03 Feb 2026 06:54:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/spacex/2963719_en-fusionnant-spacex-et-xai-elon-musk-joue-son-va-tout</guid>
      <description>
Une entreprise &#224; mille milliards de dollars, des centres de donn&#233;es dans l&#8217;espace et la conqu&#234;te de Mars. La fusion de xAi et de SpaceX tout juste annonc&#233; par Elon Musk d&#233;borde de promesses plus ou moins r&#233;alistes.
</description>
    </item>
    <item>
      <title>La technologie Nvidia G-SYNC compatible avec les TV Samsung OLED 2026 et certains moniteurs</title>
      <link>https://www.frandroid.com/marques/samsung/2963723_la-technologie-nvidia-g-sync-compatible-avec-les-tv-samsung-oled-2026-et-certains-moniteurs</link>
      <pubDate>Tue, 03 Feb 2026 06:42:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2963723_la-technologie-nvidia-g-sync-compatible-avec-les-tv-samsung-oled-2026-et-certains-moniteurs</guid>
      <description>
Samsung Electronics vient d'annoncer que l'ensemble de sa gamme de t&#233;l&#233;viseurs OLED pour 2026 sera compatible avec la technologie Nvidia G-SYNC. Cette certification concerne les mod&#232;les S95H, S90H et S85H, ainsi que les nouveaux moniteurs gaming Odyssey G6 pour une exp&#233;rience de jeu plus fluide.
</description>
    </item>
    <item>
      <title>Pourquoi ce forfait &#224; 5,49 euros devient soudainement l&#8217;un des plus int&#233;ressants du march&#233; ?</title>
      <link>https://www.frandroid.com/bons-plans/2963447_pourquoi-ce-forfait-a-549-euros-devient-soudainement-lun-des-plus-interessants-du-marche</link>
      <pubDate>Tue, 03 Feb 2026 06:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2963447_pourquoi-ce-forfait-a-549-euros-devient-soudainement-lun-des-plus-interessants-du-marche</guid>
      <description>
NRJ Mobile d&#233;cide de muscler son jeu sur l'entr&#233;e de gamme. L'op&#233;rateur virtuel ajoute gratuitement 10 Go &#224; son offre la plus accessible, qui passe ainsi &#224; 30 Go pour moins de 6 euros par mois.
</description>
    </item>
    <item>
      <title>01net morning&#160;: test de l&#8217;enceinte Ikea &#224; 5&#160;euros, les t&#233;l&#233;viseurs 8K en voie d&#8217;extinction, massacre chez les cryptos</title>
      <link>https://www.01net.com/actualites/01net-morning-test-de-lenceinte-ikea-a-5-euros-les-televiseurs-8k-en-voie-dextinction-massacre-chez-les-cryptos.html</link>
      <pubDate>Tue, 03 Feb 2026 06:29:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323806</guid>
      <description>Bonjour &#224; tous, voici la matinale de 01net ! Qu&#8217;avez-vous manqu&#233; hier ? Retrouvez toute l&#8217;actu &#224; connaitre pour d&#233;marrer la journ&#233;e du bon pied !</description>
    </item>
    <item>
      <title>Dyson just brought out a new hard-floor cleaner, and I'm sorry, but I prefer the old one &#8211; here's why</title>
      <link>https://www.techradar.com/home/vacuums/dyson-clean-wash-hygiene-vs-washg1</link>
      <pubDate>Tue, 03 Feb 2026 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">WnqGGxrBmeCJYg9oZXEMh7</guid>
      <description>In 'improving' its WashG1 hard floor cleaner, Dyson got rid of everything that made it great.</description>
    </item>
    <item>
      <title>This 3-part framework can help you land your dream job</title>
      <link>https://www.fastcompany.com/91480187/this-three-part-framework-can-help-you-land-your-dream-job</link>
      <pubDate>2026-02-03T06:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480187/this-three-part-framework-can-help-you-land-your-dream-job</guid>
      <description>Getting your dream job requires more than just talent. Here&#8217;s what else you need to focus on.
For two decades, I&#8217;ve mentored professionals at every career stage: first as a high school teacher and administrator, and presently as a university professor and corporate consultant. One pattern emerges across every career pathway&#8212;the people who find strong fits for their talents aren&#8217;t the ones with the most impressive single credential. They&#8217;re the ones who understand how three things work together: Skills. Credentials. Network....</description>
    </item>
    <item>
      <title>3 ways to attract employees who will love their jobs</title>
      <link>https://www.fastcompany.com/91481135/3-ways-to-attract-employees-who-will-love-their-jobs</link>
      <pubDate>2026-02-03T06:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91481135/3-ways-to-attract-employees-who-will-love-their-jobs</guid>
      <description>Employees who love their jobs can make a company&#8212;here&#8217;s how you can find them.
If you&#8217;re a CEO, entrepreneur, recruiter, or hiring manager, you know how important it is to hire the right people for the right roles. But hiring the right people for the right roles goes way beyond simply attracting &#8220;the best and brightest&#8221; of your industry. Just because someone is highly qualified, great at what they do and has impressive experience, doesn&#8217;t mean they are a good fit for your organization or your culture. If you want your business to thrive in the marketplace, you need to filter out potential empl...</description>
    </item>
    <item>
      <title>What is vagueposting? The cryptic social media trend that&#8217;s driving everyone crazy</title>
      <link>https://www.fastcompany.com/91485243/what-is-vagueposting-the-cryptic-social-media-trend-thats-driving-everyone-crazy</link>
      <pubDate>2026-02-03T05:19:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91485243/what-is-vagueposting-the-cryptic-social-media-trend-thats-driving-everyone-crazy</guid>
      <description>The intentionally cryptic posting trend has surged on TikTok and X, fueled by algorithms and a race for engagement.
Can I say it?</description>
    </item>
    <item>
      <title>Hurdle hints and answers for February 3, 2026</title>
      <link>https://mashable.com/article/hurdle-hints-answers-february-3-2026</link>
      <pubDate>Tue, 03 Feb 2026 05:00:00 +0000</pubDate>
      <guid isPermaLink="false">01nY8xIMAD6pxZwlEMZYSXh</guid>
      <description>Hints and answers to today's Hurdle all in one place.</description>
    </item>
    <item>
      <title>Moon phase today: What the Moon will look like on February 3</title>
      <link>https://mashable.com/article/moon-phase-today-feb-3</link>
      <pubDate>Tue, 03 Feb 2026 05:00:00 +0000</pubDate>
      <guid isPermaLink="false">04KPSTDUye4muW83r872IfS</guid>
      <description>See the Moon phase expected for February 3, 2025 as well as when the next Full Moon is expected.</description>
    </item>
  </channel>
</rss>
