<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 25 Jan 2026 10:27:08 GMT</lastBuildDate>
    <item>
      <title>Cette batterie externe 20 000 mAh avec trois ports chute sous les 50 &#8364; pendant les soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2953301_cette-batterie-externe-20-000-mah-avec-trois-ports-chute-sous-les-50-e-pendant-les-soldes-dhiver</link>
      <pubDate>Sun, 25 Jan 2026 10:22:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2953301_cette-batterie-externe-20-000-mah-avec-trois-ports-chute-sous-les-50-e-pendant-les-soldes-dhiver</guid>
      <description>
La batterie Ugreen Nexode cumule les atouts, entre sa capacit&#233; de 20 000 mAh, sa puissance de 130 W et son c&#226;ble USB-C bien pratique. Son meilleur argument ? Son prix, qui passe de 79,99 euros &#224; 49,98 euros sur Amazon pendant les soldes.
</description>
    </item>
    <item>
      <title>Quels sont les meilleurs PC ultraportables en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/1661013_meilleurs-pc-ultraportables-quel-modele-de-pc-nomade-choisir</link>
      <pubDate>Sun, 25 Jan 2026 10:00:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1661013_meilleurs-pc-ultraportables-quel-modele-de-pc-nomade-choisir</guid>
      <description>
Vous &#234;tes &#224; la recherche d&#8217;un ordinateur portable &#224; la fois l&#233;ger, compact et performant ? Les ultraportables, aussi appel&#233;s ultrabooks, sont faits pour vous. Voici notre s&#233;lection des meilleurs mod&#232;les, soigneusement test&#233;s par l&#8217;&#233;quipe de Frandroid.
</description>
    </item>
    <item>
      <title>Unwinding with screens may be making us more stressed. Try this&#160;instead</title>
      <link>https://www.fastcompany.com/91478602/unwinding-with-screens-may-be-making-us-more-stressed-try-this-instead</link>
      <pubDate>2026-01-25T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91478602/unwinding-with-screens-may-be-making-us-more-stressed-try-this-instead</guid>
      <description>People routinely engage with multiple screens at once, respond to frequent notifications, and switch rapidly between several streams of content. 
As Americans increasingly report feeling overwhelmed by daily life, many are using self-care to cope. Conversations and social media feeds are saturated with the language of &#8220;me time,&#8221; burnout, boundaries, and nervous system regulation....</description>
    </item>
    <item>
      <title>Juridiction VPN : tout savoir sur les Alliances 5 Eyes, 9 Eyes 14 Eyes et les cercles de surveillance</title>
      <link>https://www.frandroid.com/services/vpn/2952047_alliances-5-eyes-9-eyes-et-14-eyes-tout-savoir-sur-la-juridiction-des-vpn-et-les-cercles-de-surveillance</link>
      <pubDate>Sun, 25 Jan 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/vpn/2952047_alliances-5-eyes-9-eyes-et-14-eyes-tout-savoir-sur-la-juridiction-des-vpn-et-les-cercles-de-surveillance</guid>
      <description>
La surveillance des donn&#233;es est pratiqu&#233;e depuis des d&#233;cennies par les services de renseignement du monde entier, et au c&#339;ur de ce syst&#232;me, nous retrouvons l'alliance des Eyes d&#233;clin&#233;e en trois strates. Ces alliances sont souvent &#233;voqu&#233;es lorsqu'il est question des VPN, voici tout ce qu'il faut savoir &#224; leur sujet.
</description>
    </item>
    <item>
      <title>Vague d&#8217;arnaques au colis en France&#160;: tout savoir sur ces escroqueries 2.0 qui exploitent vos donn&#233;es</title>
      <link>https://www.01net.com/actualites/arnaques-colis-font-ravages-france-pirates-sont-plus-redoutables.html</link>
      <pubDate>Sun, 25 Jan 2026 09:01:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321876</guid>
      <description>Les arnaques aux colis explosent en France. Ces derni&#232;res semaines, des faux livreurs ont envoy&#233; &#233;norm&#233;ment de mails et de SMS tr&#232;s cr&#233;dibles, truff&#233;s de donn&#233;es personnelles. Ces escroqueries 2.0 sont devenues tr&#232;s redoutables et tr&#232;s difficiles &#224; rep&#233;rer. On fait le point sur la nouvelle vague d'arnaques qui d&#233;ferle sur la France.</description>
    </item>
    <item>
      <title>How Trump&#8217;s Greenland ambitions could destroy the modern world&#160;order</title>
      <link>https://www.fastcompany.com/91477843/trumps-greenland-ambitions-could-destroy-the-modern-world-order</link>
      <pubDate>2026-01-25T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91477843/trumps-greenland-ambitions-could-destroy-the-modern-world-order</guid>
      <description>The world would look dramatically different without the Allies&#8217; victories in the two World Wars, the stable worldwide economic system, and NATO and the U.N. keeping the world relatively peaceful.
Make Denmark angry. Make Norway angry. Make NATO&#8217;s leaders angry.</description>
    </item>
    <item>
      <title>Xiaomi Tag : ce qu&#8217;on sait sur ce potentiel concurrent des Apple AirTags et Samsung Galaxy SmartTags</title>
      <link>https://www.frandroid.com/marques/xiaomi/2954303_xiaomi-tag-ce-quon-sait-sur-ce-potentiel-concurrent-des-apple-airtags-et-samsung-galaxy-smarttags</link>
      <pubDate>Sun, 25 Jan 2026 08:54:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2954303_xiaomi-tag-ce-quon-sait-sur-ce-potentiel-concurrent-des-apple-airtags-et-samsung-galaxy-smarttags</guid>
      <description>
Quelques informations circulent sur un potentiel traqueur Bluetooth Xiaomi Tag. Voici ce qu'il faut retenir du porte-cl&#233; connect&#233;.
</description>
    </item>
    <item>
      <title>Plus de la moiti&#233; des cryptos sont mortes en 2025, c&#8217;est un bain de sang</title>
      <link>https://www.01net.com/actualites/plus-moitie-cryptos-nees-depuis-2021-mortes.html</link>
      <pubDate>Sun, 25 Jan 2026 08:33:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320965</guid>
      <description>En 2025, une grande partie des cryptomonnaies cr&#233;es depuis 2021 ont disparu. Les turbulences du march&#233; crypto, et les diff&#233;rents krachs, ont provoqu&#233; la mort de millions de projets...surtout des initiatives sans le moindre int&#233;r&#234;t. En parall&#232;le, on se rend compte que beaucoup de cryptos ont perdu toute leur valeur.</description>
    </item>
    <item>
      <title>Le prix de ce TV OLED LG de 42&#8243; d&#233;gringole pendant les soldes, (mais &#231;a ne va pas durer)</title>
      <link>https://www.frandroid.com/bons-plans/2953503_le-prix-de-ce-tv-oled-lg-de-42-degringole-pendant-les-soldes-mais-ca-ne-va-pas-durer</link>
      <pubDate>Sun, 25 Jan 2026 08:33:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2953503_le-prix-de-ce-tv-oled-lg-de-42-degringole-pendant-les-soldes-mais-ca-ne-va-pas-durer</guid>
      <description>
Id&#233;al pour les amateurs de cin&#233;ma et de gaming, le TV LG OLED42C5 occupe la premi&#232;re place de notre top des meilleurs petits t&#233;l&#233;viseurs du moment. La bonne nouvelle, c'est que ce mod&#232;le est propos&#233; &#224; 699 euros au lieu de 999 euros chez Rakuten, pendant les soldes. Attention, la promo n'est valable que ce dimanche.
</description>
    </item>
  </channel>
</rss>
