<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 14 Feb 2026 09:36:10 GMT</lastBuildDate>
    <item>
      <title>AirDrop d&#233;barque sur les Pixel 9, et c&#8217;est une excellente nouvelle</title>
      <link>https://www.frandroid.com/android/2977969_airdrop-debarque-sur-les-pixel-9-et-cest-une-excellente-nouvelle</link>
      <pubDate>Sat, 14 Feb 2026 09:30:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/2977969_airdrop-debarque-sur-les-pixel-9-et-cest-une-excellente-nouvelle</guid>
      <description>
Le mur entre Android et iOS continue de s'effondrer. Apr&#232;s les Pixel 10, c'est au tour des Pixel 9 de go&#251;ter &#224; la compatibilit&#233; AirDrop via Quick Share.
</description>
    </item>
    <item>
      <title>&#171;&#160;C&#8217;est du d&#233;lire&#160;&#187; : une faille permet d&#8217;acc&#233;der &#224; tous les aspirateurs robots DJI Romo</title>
      <link>https://www.frandroid.com/marques/2977963_cest-du-delire-une-faille-permet-dacceder-a-tous-les-aspirateurs-robots-dji-romo</link>
      <pubDate>Sat, 14 Feb 2026 09:22:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2977963_cest-du-delire-une-faille-permet-dacceder-a-tous-les-aspirateurs-robots-dji-romo</guid>
      <description>
On savait que les robots aspirateurs n'&#233;taient pas des mod&#232;les de discr&#233;tion, mais l&#224;, DJI fait fort. Une faille monumentale a permis &#224; un utilisateur d'acc&#233;der aux cam&#233;ras, aux micros et aux plans de milliers de logements &#224; travers le monde.
</description>
    </item>
    <item>
      <title>VR's golden age is over, and there wasn't much gold there</title>
      <link>https://www.techradar.com/pro/vrs-golden-age-is-over-and-there-wasnt-much-gold-there</link>
      <pubDate>Sat, 14 Feb 2026 09:10:00 +0000</pubDate>
      <guid isPermaLink="false">Et5yHFa3oRR4kJj9jotJ3m</guid>
      <description>Meta's shift from immersive virtual reality to smart glasses leaves no clear home for business-grade VR/AR headsets.</description>
    </item>
    <item>
      <title>AI can be a catalyst for sustainability: here&#8217;s why that&#8217;s not a contradiction</title>
      <link>https://www.techradar.com/pro/ai-can-be-a-catalyst-for-sustainability-heres-why-thats-not-a-contradiction</link>
      <pubDate>Sat, 14 Feb 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">NHWMXTRh2HP6XzAyLF6heH</guid>
      <description>AI&#8217;s energy demands don&#8217;t tell the whole story. Used strategically, it can accelerate sustainability progress.</description>
    </item>
    <item>
      <title>Quelles sont les meilleures cam&#233;ras &#224; 360 degr&#233;s en 2026 ? Notre comparatif</title>
      <link>https://www.frandroid.com/guide-dachat/2953705_quelles-sont-les-meilleures-cameras-a-360-degres-en-2026-notre-comparatif</link>
      <pubDate>Sat, 14 Feb 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2953705_quelles-sont-les-meilleures-cameras-a-360-degres-en-2026-notre-comparatif</guid>
      <description>
Sur le march&#233; des cam&#233;ras d'action, les mod&#232;les &#224; 360 degr&#233;s sont de vrais challenges techniques pour les constructeurs. C'est un secteur assez restreint dans lequel trouver le bon mod&#232;le peut &#234;tre difficile. C'est pourquoi nous avons s&#233;lectionn&#233; les meilleures cam&#233;ras &#224; 360 degr&#233;s du march&#233;. 
</description>
    </item>
    <item>
      <title>L&#8217;Europe booste le march&#233; des voitures &#233;lectriques, la Chine et les &#201;tats-Unis le plombent</title>
      <link>https://www.01net.com/actualites/leurope-booste-le-marche-des-voitures-electriques-la-chine-et-les-etats-unis-le-plombent.html</link>
      <pubDate>Sat, 14 Feb 2026 08:56:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325934</guid>
      <description>Les ventes mondiales de v&#233;hicules &#233;lectriques ont recul&#233; de 3 % en janvier 2026. En cause, un net ralentissement en Chine et en Am&#233;rique du Nord, malgr&#233; une dynamique positive en Europe.</description>
    </item>
    <item>
      <title>Adoption d&#8217;iOS 26&#160;: Apple confirme un l&#233;ger retard</title>
      <link>https://www.01net.com/actualites/adoption-dios-26-apple-confirme-un-leger-retard.html</link>
      <pubDate>Sat, 14 Feb 2026 08:30:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326008</guid>
      <description>C'est officiel : l'adoption d"iOS 26 est bien en retrait par rapport &#224; son pr&#233;d&#233;cesseur, iOS 18. De peu, mais la diff&#233;rence demeure tout de m&#234;me assez sensible.</description>
    </item>
    <item>
      <title>Huawei fait perdre 100 &#8364; &#224; sa montre ultra haut gamme et corrige son gros d&#233;faut, le prix</title>
      <link>https://www.frandroid.com/bons-plans/2974907_huawei-fait-perdre-100-e-a-sa-montre-ultra-haut-gamme-et-corrige-son-gros-defaut-le-prix</link>
      <pubDate>Sat, 14 Feb 2026 08:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2974907_huawei-fait-perdre-100-e-a-sa-montre-ultra-haut-gamme-et-corrige-son-gros-defaut-le-prix</guid>
      <description>
Huawei renouvelle sa montre ultra haut de gamme : avec son design massif et &#233;l&#233;gant, ses fonctions pouss&#233;es pour la sant&#233; et son suivi sportif avanc&#233;, la Watch Ultimate 2 devient plus int&#233;ressante maintenant qu'elle passe de 899 euros &#224; 799 euros. 
</description>
    </item>
    <item>
      <title>Cyberattaques chinoises et Gemini&#160;: Google s&#8217;attend &#224; un &#171;&#160;coup dur&#160;&#187;</title>
      <link>https://www.01net.com/actualites/cyberattaques-chinoises-gemini-google-sattend-coup-dur.html</link>
      <pubDate>Sat, 14 Feb 2026 08:04:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325541</guid>
      <description>Les cyberattaques chinoises reposant sur Gemini se multiplient. Google a remarqu&#233; qu'un gang d'espions chinois avait pris l'habitude d'utiliser l'IA g&#233;n&#233;rative pour d&#233;busquer des failles de s&#233;curit&#233;. L&#8217;entreprise met en garde contre un &#171; prochain coup dur &#187; pour la cybers&#233;curit&#233;.</description>
    </item>
    <item>
      <title>Meta pr&#233;pare une fonction secr&#232;te pour ses lunettes Ray-Ban, et c&#8217;est aussi impressionnant qu&#8217;inqui&#233;tant</title>
      <link>https://www.frandroid.com/marques/meta/2977953_meta-prepare-une-fonction-secrete-pour-ses-lunettes-ray-ban-et-cest-aussi-impressionnant-quinquietant</link>
      <pubDate>Sat, 14 Feb 2026 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2977953_meta-prepare-une-fonction-secrete-pour-ses-lunettes-ray-ban-et-cest-aussi-impressionnant-quinquietant</guid>
      <description>
D'apr&#232;s les informations du New York Times, Meta compterait ajouter des fonctions de reconnaissance faciale sur ses lunettes connect&#233;es. La firme miserait sur le tumulte politique pour que cette nouveaut&#233; ne fasse pas de vagues. 
</description>
    </item>
    <item>
      <title>DJI&#8217;s first robovac is an autonomous cleaning drone you can&#8217;t trust</title>
      <link>https://www.theverge.com/tech/877012/dji-romo-review-robot-vacuum-drone-mop</link>
      <pubDate>2026-02-14T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/877012/the-latest-instax-printer-is-a-pricey-but-worthy-upgrade</guid>
      <description>It's been eight years since I last reviewed a robot vacuum. Having spent the last two months with a new flagship, I'm shocked by how much they've advanced from early bump-and-run models. In October, DJI launched its very first robovacs in Europe. I've been testing the top-of-the-line Romo P model, which doesn't yet have a [&#8230;]</description>
    </item>
    <item>
      <title>The DJI Romo robovac had security so poor, this man remotely accessed thousands of them</title>
      <link>https://www.theverge.com/tech/879088/dji-romo-hack-vulnerability-remote-control-camera-access-mqtt</link>
      <pubDate>2026-02-14T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=879088</guid>
      <description>Sammy Azdoufal claims he wasn't trying to hack every robot vacuum in the world. He just wanted to remote control his brand-new DJI Romo vacuum with a PS5 gamepad, he tells The Verge, because it sounded fun. But when his homegrown remote control app started talking to DJI's servers, it wasn't just one vacuum cleaner [&#8230;]</description>
    </item>
  </channel>
</rss>
