<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 13 Dec 2025 11:21:03 GMT</lastBuildDate>
    <item>
      <title>I tested the HHKB Professional Classic Type-S &#8212; a niche option for those prepared to learn a new keyboard layout to get Topre key mechanisms</title>
      <link>https://www.techradar.com/computing/keyboards/hhkb-professional-classic-type-s-keyboard-review</link>
      <pubDate>Sat, 13 Dec 2025 11:05:00 +0000</pubDate>
      <guid isPermaLink="false">HBkZeaSbbpKkGxTCfWkB8E</guid>
      <description>The HHKB Professional Classic Type-S is a radically deconstructed keyboard design that focuses on compact layout rather than easy adaptability.</description>
    </item>
    <item>
      <title>The Worst Ways RFK Jr. Has Harmed Public Health This Year</title>
      <link>https://gizmodo.com/the-worst-ways-rfk-jr-has-harmed-public-health-this-year-2000698509</link>
      <pubDate>Sat, 13 Dec 2025 11:00:22 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000698509</guid>
      <description>The return of measles, weakening vaccines, and the complete destruction of the CDC are just a few of Kennedy's ignoble accomplishments in 2025.</description>
    </item>
    <item>
      <title>Gear News of the Week: Android Gets Emergency Live Video, and the Pixel Watch 4 Supports Gestures</title>
      <link>https://www.wired.com/story/gear-news-of-the-week-android-gets-emergency-live-video-and-the-pixel-watch-4-supports-gestures/</link>
      <pubDate>Sat, 13 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">693b974039402e6010e54956</guid>
      <description>Plus: Apple Fitness+ expands to new markets, it&#8217;s even easier to add photos to Aura&#8217;s digital frames, and the new Nocs speakers go heavy metal.</description>
    </item>
    <item>
      <title>The race to zero downtime is on &#8211; and AI is leading it</title>
      <link>https://www.techradar.com/pro/the-race-to-zero-downtime-is-on-and-ai-is-leading-it</link>
      <pubDate>Sat, 13 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">yC8uMDjDTYpUihYYXTsEH9</guid>
      <description>As digital systems grow complex, AI shifts reliability from firefighting outages to predicting and preventing failure.</description>
    </item>
    <item>
      <title>New US border checks could involve scanning your last five years of social media history&#8211; here's what you need to know</title>
      <link>https://www.techradar.com/computing/social-media/new-us-border-checks-could-involve-scanning-your-last-five-years-of-social-media-history-heres-what-you-need-to-know</link>
      <pubDate>Sat, 13 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">42AdN2gxbnHB6tWhpgmDy6</guid>
      <description>The US government plans to check visitors&#8217; social media posts and potentially bar them from entry under new proposed rules.</description>
    </item>
    <item>
      <title>Voitures connect&#233;es | Les automobilistes ont-ils perdu le contr&#244;le&#160;?</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-12-13/voitures-connectees/les-automobilistes-ont-ils-perdu-le-controle.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Sat, 13 Dec 2025 06:00:00 -0500</pubDate>
      <guid isPermaLink="false">74798d8c1d9936c48dd9104a0abccc81</guid>
      <description>Les voitures connect&#233;es ne nous transportent pas seulement du point&#160;A au point&#160;B. Elles nous observent et nous &#233;coutent, constate l&#8217;Union des consommateurs, qui s&#8217;inqui&#232;te de la fa&#231;on dont les consommateurs sont en train de perdre le contr&#244;le de leurs renseignements personnels une fois qu&#8217;ils sont en voiture.</description>
    </item>
    <item>
      <title>Test du CMF Headphone Pro : &#224; 99 euros, Nothing donne une le&#231;on d&#8217;humilit&#233; aux g&#233;ants de l&#8217;audio</title>
      <link>https://www.frandroid.com/marques/cmf/2901517_test-du-cmf-headphone-pro-a-99-euros-nothing-donne-une-lecon-dhumilite-aux-geants-de-laudio</link>
      <pubDate>Sat, 13 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/cmf/2901517_test-du-cmf-headphone-pro-a-99-euros-nothing-donne-une-lecon-dhumilite-aux-geants-de-laudio</guid>
      <description>
Difficile de croire qu&#8217;un casque vendu sous la barre symbolique des cent euros puisse r&#233;ellement inqui&#233;ter les t&#233;nors du march&#233;. C&#8217;est pourtant le pari insolent de CMF by Nothing avec son Headphone Pro. Nous avons pass&#233; ce trublion au crible pour voir s&#8217;il s&#8217;agit du meilleur rapport qualit&#233;-prix de l&#8217;ann&#233;e ou d&#8217;un simple coup d&#8217;esbroufe.
</description>
    </item>
    <item>
      <title>Mission spatiale : une invitation au voyage dans le temps et dans l&#8217;espace</title>
      <link>https://www.futura-sciences.com/sciences/actualites/espace-mission-spatiale-invitation-voyage-temps-espace-128112/#xtor%3DRSS-8</link>
      <pubDate>Sat, 13 Dec 2025 11:30:40 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/espace-mission-spatiale-invitation-voyage-temps-espace-128112/#xtor%3DRSS-8</guid>
      <description>Avec l'exposition Mission spatiale, la Cit&#233; des sciences et de l'industrie propose un r&#233;cit accessible, document&#233; et sensoriel de la conqu&#234;te spatiale pass&#233;e et future.</description>
    </item>
    <item>
      <title>PcComponentes r&#233;siste &#224; la crise de la RAM : voici 3 PC performants au prix d&#8217;avant &#224; ne pas rater [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/2903721_penurie-de-ram-ces-3-pc-bien-equipes-sont-encore-proposes-a-bon-prix-pour-linstant</link>
      <pubDate>Sat, 13 Dec 2025 10:30:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2903721_penurie-de-ram-ces-3-pc-bien-equipes-sont-encore-proposes-a-bon-prix-pour-linstant</guid>
      <description>
Pour jouer &#224; Arc Raiders avec ses proches ou pr&#233;parer l'hypoth&#233;tique annonce de GTA VI sur PC, voici trois propositions de tours gaming &#224; saisir avant que les prix s'envolent.
</description>
    </item>
    <item>
      <title>How to Use Smart Lighting Around the Home: Reviewer Recommendations</title>
      <link>https://www.wired.com/story/how-to-use-smart-lighting/</link>
      <pubDate>Sat, 13 Dec 2025 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">693165dcbae73f21e0de4540</guid>
      <description>I&#8217;ve been reviewing smart lighting for years. Here are tips on how to prep, what to choose, and the smart lights that work best in each room.</description>
    </item>
    <item>
      <title>I've found a new favorite pair of sub-$100 cuff-style open earbuds, with some surprisingly premium features</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/soundpeats-clip1-review</link>
      <pubDate>Sat, 13 Dec 2025 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">umFgyBnRmtMz28QrbWB4im</guid>
      <description>The Soundpeats Clip1 are budget clipping open earbuds done right, and they're great budget alternatives to Shokz or Bose options.</description>
    </item>
    <item>
      <title>No&#235;l arrive bien t&#244;t chez Honor : ce pack smartphone pliant + tablette co&#251;te 1 000 &#8364; de moins</title>
      <link>https://www.frandroid.com/bons-plans/2908703_noel-arrive-bien-tot-chez-honor-ce-pack-smartphone-pliant-tablette-coute-1-000-e-de-moins</link>
      <pubDate>Sat, 13 Dec 2025 10:18:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2908703_noel-arrive-bien-tot-chez-honor-ce-pack-smartphone-pliant-tablette-coute-1-000-e-de-moins</guid>
      <description>
Pour l'achat du Honor Magic V5 qui passe de 1 999 euros &#224; 1 599,90 euros, la marque offre une tablette Honor MagicPad 10, une cover/clavier Bluetooth et une coque de protection, soit 549,70 euros de cadeaux.
</description>
    </item>
    <item>
      <title>The Instagram-Fueled Boom in Copycat Vintage Car-Body Shells</title>
      <link>https://www.wired.com/story/the-instagram-fueled-boom-in-copycat-vintage-car-body-shells/</link>
      <pubDate>Sat, 13 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">69382379783f3a6380a7fbff</guid>
      <description>Instagram is awash with Asian firms showing how they can remake old Broncos, Defenders, and other whole classic cars&#8212;better and much cheaper than in the US.</description>
    </item>
    <item>
      <title>Try these 4 Android battery tips to keep your Google Pixel running longer than ever</title>
      <link>https://www.fastcompany.com/91435564/4-android-battery-tips-google-pixel-running-longer-keep-charge-phone</link>
      <pubDate>2025-12-13T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91435564/4-android-battery-tips-google-pixel-running-longer-keep-charge-phone</guid>
      <description>Google Pixel users, here&#8217;s how save precious battery juice. 
Your smartphone is only as good as the charge it holds. It doesn&#8217;t matter if you have the newest flagship iPhone or Android&#8212;when the device&#8217;s battery dies, all the bells and whistles don&#8217;t mean diddly. And manufacturers know it.</description>
    </item>
    <item>
      <title>Kara Swisher dishes on OpenAI, Meta, Google&#8212;and the bidding war for Warner Bros. Discovery</title>
      <link>https://www.fastcompany.com/91459948/kara-swisher-dishes-on-openai-meta-google-and-the-bidding-war-for-warner-bros-discovery</link>
      <pubDate>2025-12-13T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91459948/kara-swisher-dishes-on-openai-meta-google-and-the-bidding-war-for-warner-bros-discovery</guid>
      <description>Kara Swisher gives her takes on the latest tech news, from Gemini to the streaming wars to what Tim Cook and Bob Iger should do next.
Can ChatGPT dethrone Gemini? Is Tim Cook capable of leading Apple into the next wave of AI? As 2025 winds down, journalist and podcast host Kara Swisher cuts through the noise and decodes what&#8217;s really happening across OpenAI, Meta, Google, and more. Then, Swisher sizes up the state of Disney, Netflix, and the escalating bidding war for Warner Bros. Discovery.&#160;...</description>
    </item>
    <item>
      <title>Google Traduction a enfin le droit &#224; sa r&#233;volution : il ne traduit plus mot &#224; mot</title>
      <link>https://www.frandroid.com/marques/google/2909437_google-traduction-a-enfin-le-droit-a-sa-revolution-il-ne-traduit-plus-mot-a-mot</link>
      <pubDate>Sat, 13 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2909437_google-traduction-a-enfin-le-droit-a-sa-revolution-il-ne-traduit-plus-mot-a-mot</guid>
      <description>
Google Traduction va enfin arr&#234;ter de traduire mot &#224; mot pour r&#233;ellement proposer une traduction intelligente.
</description>
    </item>
  </channel>
</rss>
