<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 26 Jan 2026 13:51:07 GMT</lastBuildDate>
    <item>
      <title>The EU is investigating Grok and X over potentially illegal deepfakes</title>
      <link>https://www.engadget.com/ai/the-eu-is-investigating-grok-and-x-over-potentially-illegal-deepfakes-134506678.html?src=rss</link>
      <pubDate>Mon, 26 Jan 2026 13:45:06 +0000</pubDate>
      <guid isPermaLink="false">78acf3f3-e92c-43f2-825e-c811407578f6</guid>
      <description>Europe is probing Elon Musk&#8217;s X for failing to take action to prevent the spread of AI-generated sexually explicit images including child sexual abuse material (CSAM), regulators said in a press release. The European Commission&#8217;s investigation could result in &#8220;further enforcement steps&#8221; against X, not long after it levied a $140 million fine against the platform. &#8220;Sexual deepfakes of women and children are a violent, unacceptable form of degradation. With this investigation, we will determine whether X has met its legal obligations under the DSA [Digital Services Act], or whether it treated ri...</description>
    </item>
    <item>
      <title>Pour les soldes, Amazon brade &#224; moiti&#233; prix le Motorola Razr 60, qui devient le moins cher des smartphones pliables de 2025</title>
      <link>https://www.frandroid.com/bons-plans/2735845_pour-les-soldes-amazon-brade-a-moitie-prix-le-motorola-razr-60-qui-devient-le-moins-cher-des-smartphones-pliables-de-2025</link>
      <pubDate>Mon, 26 Jan 2026 13:43:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2735845_pour-les-soldes-amazon-brade-a-moitie-prix-le-motorola-razr-60-qui-devient-le-moins-cher-des-smartphones-pliables-de-2025</guid>
      <description>
Si vous &#234;tes tent&#233; par un smartphone &#224; clapet pendant les soldes, le Razr 60 de Motorola pourrait bien vous convaincre. Son prix est m&#234;me plus int&#233;ressant gr&#226;ce &#224; cette offre des soldes 2026 sur Amazon : 461 euros contre 899 euros de base, gr&#226;ce &#224; une remise imm&#233;diate cumul&#233;e &#224; un bonus reprise de 100 euros. 
</description>
    </item>
    <item>
      <title>Namecheap in 60 minutes: launching a site on a budget</title>
      <link>https://www.techradar.com/pro/website-hosting/namecheap-in-60-minutes-launching-a-site-on-a-budget</link>
      <pubDate>Mon, 26 Jan 2026 13:39:00 +0000</pubDate>
      <guid isPermaLink="false">mHDcT2685y7mwFPWv2BYeB</guid>
      <description>Can budget hosting provide the same performance and experience as premium options?</description>
    </item>
    <item>
      <title>Our 'camera of the year' just hit a brand new record-low price &#8212; the Nikon Z5 II is great value right now</title>
      <link>https://www.techradar.com/cameras/mirrorless-cameras/our-camera-of-the-year-just-hit-a-brand-new-record-low-price-the-nikon-z5-ii-is-great-value-right-now</link>
      <pubDate>Mon, 26 Jan 2026 13:38:10 +0000</pubDate>
      <guid isPermaLink="false">9pFHVN8NesMkwXfDtBZCeV</guid>
      <description>On the lookout for your next full-frame camera? Definitely consider this record-breaking &#163;340 discount on the excellent Nikon Z5 II.</description>
    </item>
    <item>
      <title>TurboTax Deluxe has been discounted to $45 ahead of tax season</title>
      <link>https://www.engadget.com/deals/turbotax-deluxe-has-been-discounted-to-45-ahead-of-tax-season-204848732.html?src=rss</link>
      <pubDate>Mon, 26 Jan 2026 13:35:36 +0000</pubDate>
      <guid isPermaLink="false">8d4b28c6-34f1-44bb-800a-eec732a96ded</guid>
      <description>Tax season is fast approaching, and unfortunately for 2026, Direct File isn't an option anymore. The free, government-provided service was shut down, so you'll need to look to other federal programs, including IRS Free File, to file your paperwork. If you don't qualify for Free File, TurboTax might be your best bet for a relatively cheap, efficient way to file your taxes. While it pains us to suggest you give money to a company that has spent decades lobbying to ensure America's tax system remains a nightmare, we can at least help you save a bit of cash if you've determined TurboTax is a neces...</description>
    </item>
    <item>
      <title>The Disney+ Hulu bundle is down to $10 for one month right now</title>
      <link>https://www.engadget.com/deals/the-disney-hulu-bundle-is-down-to-10-for-one-month-right-now-192814643.html?src=rss</link>
      <pubDate>Mon, 26 Jan 2026 13:29:39 +0000</pubDate>
      <guid isPermaLink="false">c4b6e8a2-981f-4fc9-b476-d49dcaeed4ba</guid>
      <description>You have the best chance to save on streaming services during the holiday shopping season, but throughout the year, the occasional deal pops up that's worth considering. Case in point: this new Disney+ deal. New and eligible returning subscribers can sign up for the Disney+ Hulu bundle (with ads) for $10 for one month of access. That's $3 off the usual price of the bundle for one month, and more than 58 percent off if you consider the cost of each service individually (Disney+ at $12 per month and, separately, Hulu also at $12 per month).
We'd be remiss if we didn't mention that this isn't qui...</description>
    </item>
    <item>
      <title>Meilleurs iPhone : la s&#233;lection des mod&#232;les &#224; acheter (et ceux &#224; &#233;viter) en 2026</title>
      <link>https://www.frandroid.com/guide-dachat/smartphones/705312_meilleur-iphone</link>
      <pubDate>Mon, 26 Jan 2026 13:27:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/smartphones/705312_meilleur-iphone</guid>
      <description>
Faut-il acheter le dernier iPhone ou bien opter pour un mod&#232;le plus ancien ? C'est &#224; cette question que nous allons tenter de r&#233;pondre dans ce guide d'achat. Quel iPhone choisir ? Voici les conseils et recommandations de la r&#233;daction de Frandroid.
</description>
    </item>
    <item>
      <title>Intel d&#233;laisse-t-il les PC grand public au profit de l&#8217;IA ? La firme clarifie sa strat&#233;gie</title>
      <link>https://www.frandroid.com/marques/intel/2954975_intel-delaisse-t-il-les-pc-grand-public-au-profit-de-lia-la-firme-clarifie-sa-strategie</link>
      <pubDate>Mon, 26 Jan 2026 13:22:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/intel/2954975_intel-delaisse-t-il-les-pc-grand-public-au-profit-de-lia-la-firme-clarifie-sa-strategie</guid>
      <description>
Intel cherche l'&#233;quilibre. Durant l'annonce de ses derniers r&#233;sultats financiers, le g&#233;ant am&#233;ricain a promis de ne pas trop d&#233;garnir sa part de production vou&#233;e au grand public&#8230; m&#234;me si la firme admet bien volontiers mobiliser l'essentiel de ses capacit&#233;s de production pour honorer un maximum de commandes li&#233;es &#224; l'IA.
</description>
    </item>
    <item>
      <title>Don&#8217;t wait for the rumored OLED MacBook Pro &#8211; here are 3 reasons why the M5 MacBook Pro could be a wiser upgrade</title>
      <link>https://www.techradar.com/computing/dont-wait-for-the-rumored-oled-macbook-pro-here-are-3-reasons-why-the-m5-macbook-pro-could-be-a-wiser-upgrade</link>
      <pubDate>Mon, 26 Jan 2026 13:14:40 +0000</pubDate>
      <guid isPermaLink="false">ocRjFuAKMME5PcKL2o7WyG</guid>
      <description>Apple&#8217;s M6 MacBook Pro could be a risky, expensive option. Opting for the M5 model might be a safer bet.</description>
    </item>
    <item>
      <title>Deepfakes sexuels&#160;: la Commission europ&#233;enne lance une enqu&#234;te sur X et Grok</title>
      <link>https://www.01net.com/actualites/deepfakes-sexuels-la-commission-europeenne-lance-une-enquete-sur-x-et-grok.html</link>
      <pubDate>Mon, 26 Jan 2026 13:13:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322491</guid>
      <description>La Commission europ&#233;enne tape du poing sur la table contre le r&#233;seau social d'Elon Musk. Bruxelles lance en effet une enqu&#234;te formelle sur la g&#233;n&#233;ration d'images d&#233;nud&#233;es g&#233;n&#233;r&#233;es sans consentement par Grok, y compris &#224; partir de photos d'enfants.</description>
    </item>
    <item>
      <title>'Simply irresponsible': Microsoft confirms it will give your BitLocker encryption keys to the FBI if asked - but there is a way to keep your data private</title>
      <link>https://www.techradar.com/pro/security/microsoft-confirms-it-will-give-your-bitlocker-encryption-keys-to-the-fbi-if-asked</link>
      <pubDate>Mon, 26 Jan 2026 13:05:00 +0000</pubDate>
      <guid isPermaLink="false">MPMuyh6Xc8riQSJsTh2ko9</guid>
      <description>Moved called "simply irresponsible" - but there is a way to protect your private data.</description>
    </item>
    <item>
      <title>Proton VPN reveals major Linux makeover &#8211; both for GUI and CLI users</title>
      <link>https://www.techradar.com/vpn/vpn-services/proton-vpn-reveals-major-linux-makeover-both-for-gui-and-cli-users</link>
      <pubDate>Mon, 26 Jan 2026 13:04:43 +0000</pubDate>
      <guid isPermaLink="false">BbaA8mcu3YUfsWaJwq2sqg</guid>
      <description>Proton has released a set of updates for both its Linux GUI and Linux CLI VPN apps. Here's all you need to know.</description>
    </item>
    <item>
      <title>The Bose QuietComfort Ultra headphones are 35 percent off</title>
      <link>https://www.engadget.com/deals/the-bose-quietcomfort-ultra-headphones-are-35-percent-off-130020033.html?src=rss</link>
      <pubDate>Mon, 26 Jan 2026 13:00:20 +0000</pubDate>
      <guid isPermaLink="false">3ef67374-c3f4-4d92-8879-6b274fb81e89</guid>
      <description>It's that time of year where a great pair of headphones double as earmuffs and a current sale will ensure you get a great quality &#8212; and good looking &#8212; option. One of our favorite wireless headphones for 2026 is available for 35 percent off.&#160;
Amazon is offering the first-generation Bose QuietComfort Ultra Bluetooth Headphones for $279, down from $429. Since coming out last April, they've become our choice for best noise-canceling wireless headphones. Notably, the sale is only available in the headphone's nice limited edition Deep Plum model.&#160; 


We gave the Bose QuietComfort Ultra headphones an...</description>
    </item>
    <item>
      <title>The best gear to upgrade your home theater setup</title>
      <link>https://www.engadget.com/home/home-theater/the-best-gear-to-upgrade-your-home-theater-setup-130000755.html?src=rss</link>
      <pubDate>Mon, 26 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">03b3658c-9f1e-4779-b855-ee86cb3a153d</guid>
      <description>A good home theater setup goes beyond just having the right TV (although that certainly does help a lot). Getting the right sound for your space, the right lighting and making sure your streaming gear is up to date are all things that can go a long way to making your setup feel premium.And don&#8217;t think that just because you&#8217;re not hosting movie night every weekend that a good home theater setup is a waste. Whether your family is full of cinephiles, you love playing video games with your kids or you plan on hosting friends to watch Super Bowl 2026, the right home theater equipment can make your ...</description>
    </item>
    <item>
      <title>Tempted by the IKEA donut lamp? The upgraded Philips Hue Flourish might be an even better smart home buy</title>
      <link>https://www.techradar.com/home/smart-lights/tempted-by-the-ikea-donut-lamp-the-upgraded-philips-hue-flourish-might-be-an-even-better-smart-home-buy</link>
      <pubDate>Mon, 26 Jan 2026 12:53:22 +0000</pubDate>
      <guid isPermaLink="false">8jFjVf5tCZzBBqMeoyyN4A</guid>
      <description>In the market for a new smart lamp for your table? Philips Hue is updating one of its models.</description>
    </item>
    <item>
      <title>How to watch Edmonton Oilers vs. Anaheim Ducks online for free</title>
      <link>https://mashable.com/article/edmonton-oilers-anaheim-ducks-nhl-2026-live-stream-for-free</link>
      <pubDate>Mon, 26 Jan 2026 12:31:01 +0000</pubDate>
      <guid isPermaLink="false">03hYYMYlUJEWH0z71514HdD</guid>
      <description>How to watch NHL for free. Live stream Edmonton Oilers vs. Anaheim Ducks in the NHL for free from anywhere in the world.</description>
    </item>
    <item>
      <title>YouTube Music just got a big queue upgrade that users have wanted for years &#8211; and now Apple Music fans are demanding the same</title>
      <link>https://www.techradar.com/audio/audio-streaming/youtube-music-just-got-a-big-queue-upgrade-that-users-have-wanted-for-years-and-now-apple-music-fans-are-demanding-the-same</link>
      <pubDate>Mon, 26 Jan 2026 12:26:00 +0000</pubDate>
      <guid isPermaLink="false">ktyLqmhpgzVfeLKyywskki</guid>
      <description>YouTube Music users can now pick up where they left off across Android and iOS devices, but Apple Music has yet to do the same.</description>
    </item>
    <item>
      <title>Good leaders don&#8217;t shut down when employees push back&#8212;they do this instead</title>
      <link>https://www.fastcompany.com/91468687/why-listening-to-pushback-builds-both-insight-and-trust-and-how-that-changes-everything-listening-insight-pushback-trust</link>
      <pubDate>2026-01-26T12:25:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91468687/why-listening-to-pushback-builds-both-insight-and-trust-and-how-that-changes-everything-listening-insight-pushback-trust</guid>
      <description>Your resistance problem is actually an intelligence problem.
Twenty years ago, as the top digital and innovation executive for Citi&#8217;s credit card business, I led the team that spent months building what looked like a brilliant partnership. We&#8217;d found a startup with a disruptive payments platform&#8212;one that became the forerunner of what has become a new payment type used by millions of consumers today. The deal: strategic investment in exchange for access to the startup&#8217;s codebase as a sandbox for innovation pilots. No more waiting in the legacy systems queue. Just rapid prototyping with leading-...</description>
    </item>
    <item>
      <title>Les prix des SSD NVMe explosent, mais ce Samsung 4 To avec dissipateur reste &#224; un prix normal pour le moment</title>
      <link>https://www.frandroid.com/bons-plans/2954913_les-prix-des-ssd-nvme-explosent-mais-ce-samsung-4-to-avec-dissipateur-reste-a-un-prix-normal-pour-le-moment</link>
      <pubDate>Mon, 26 Jan 2026 12:23:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2954913_les-prix-des-ssd-nvme-explosent-mais-ce-samsung-4-to-avec-dissipateur-reste-a-un-prix-normal-pour-le-moment</guid>
      <description>
Avec la hausse des prix du stockage, certaines offres m&#233;ritent qu&#8217;on s&#8217;y attarde. Le SSD NVMe Samsung 990 Pro, dans sa version 4 To avec dissipateur thermique int&#233;gr&#233;, est actuellement affich&#233; &#224; 369 euros. Un tarif correct pour un mod&#232;le haut de gamme qui devient une bonne affaire &#224; saisir avant une &#233;ventuelle remont&#233;e des prix.
</description>
    </item>
    <item>
      <title>Super&#233;thanol-E85&#160;: E.Leclerc veut d&#233;mocratiser la conversion avec une offre &#224; prix cass&#233;</title>
      <link>https://www.01net.com/actualites/superethanol-e85-e-leclerc-veut-democratiser-la-conversion-avec-une-offre-a-prix-casse.html</link>
      <pubDate>Mon, 26 Jan 2026 12:21:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322434</guid>
      <description>E.Leclerc d&#233;voile ce 26 janvier une offre de conversion au Super&#233;thanol-E85 dans ses centres auto. Avec un tarif comp&#233;titif et une installation rapide, l'enseigne promet plus de 700 euros d'&#233;conomies par an.</description>
    </item>
    <item>
      <title>1Password &#224; une solution simple pour se prot&#233;ger des faux sites</title>
      <link>https://www.frandroid.com/culture-tech/securite-applications/2954989_1password-a-une-solution-simple-pour-se-proteger-des-faux-sites</link>
      <pubDate>Mon, 26 Jan 2026 12:16:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/securite-applications/2954989_1password-a-une-solution-simple-pour-se-proteger-des-faux-sites</guid>
      <description>
Le gestionnaire de mot de passe a trouv&#233; une solution simple pour aider ses utilisateurs &#224; ne pas se faire avoir par une strat&#233;gie basique des arnaques en ligne.
</description>
    </item>
    <item>
      <title>Microsoft&#8217;s first Windows 11 update of 2026 has been a mess</title>
      <link>https://www.theverge.com/news/867647/microsoft-windows-11-january-2026-update-bugs-issues</link>
      <pubDate>2026-01-26T07:04:08-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=867647</guid>
      <description>Microsoft's first update for Windows 11 in 2026 has been a buggy mess, to say the least. After reports of shutdown issues on some machines, Microsoft issued an emergency update to fix its January 2026 Windows 11 update last weekend. Now, exactly a week later, the software maker has been forced to issue a second [&#8230;]</description>
    </item>
    <item>
      <title>Scandale sur Windows&#160;: Microsoft a permis au FBI de d&#233;verrouiller des PC chiffr&#233;s avec BitLocker</title>
      <link>https://www.01net.com/actualites/scandale-windows-microsoft-permis-fbi-deverrouiller-pc-chiffres-bitlocker.html</link>
      <pubDate>Mon, 26 Jan 2026 12:01:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322420</guid>
      <description>BitLocker a un talon d&#8217;Achille, et c'est Microsoft. L'&#233;diteur a accept&#233; de remettre au FBI des cl&#233;s de r&#233;cup&#233;ration stock&#233;es dans son cloud. Avec ces cl&#233;s, les agents f&#233;d&#233;raux ont pu d&#233;chiffrer les donn&#233;es de trois ordinateurs. Cette affaire montre que Microsoft est en mesure de communiquer vos cl&#233;s si la justice le demande.</description>
    </item>
    <item>
      <title>Microsoft admits Windows 11 update is nuking system drives, albeit there's a 'limited number of reports' of these disasters</title>
      <link>https://www.techradar.com/computing/windows/microsoft-admits-windows-11-update-is-nuking-system-drives-albeit-theres-a-limited-number-of-reports-of-these-disasters</link>
      <pubDate>Mon, 26 Jan 2026 12:00:33 +0000</pubDate>
      <guid isPermaLink="false">C4hv8CSPXxX6La2BVt3yY</guid>
      <description>Windows 11 runs into another disastrous bug with its latest update &#8212; Microsoft admits an 'issue in which devices are failing to boot', worryingly.</description>
    </item>
    <item>
      <title>We Strapped on Exoskeletons and Raced. There&#8217;s One Clear Winner</title>
      <link>https://www.wired.com/story/story/we-raced-exoskeletons-and-theres-one-clear-winner/</link>
      <pubDate>Mon, 26 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">696f6317590fc20efaaa15e3</guid>
      <description>WIRED put the latest consumer exoskeletons from Dnsys and Hypershell in a head-to-head test on a pro athletic track. On your marks &#8230;</description>
    </item>
    <item>
      <title>What is &#8216;situational retirement&#8217;&#8212;and should you give it a try?</title>
      <link>https://www.fastcompany.com/91477180/if-you-hate-the-word-retire-try-situational-retirement-on-for-size</link>
      <pubDate>2026-01-26T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91477180/if-you-hate-the-word-retire-try-situational-retirement-on-for-size</guid>
      <description>Whether not quite fully retired or merely under-employed, this is how to live while waiting for the phone to ring.
As an operative researcher for luxury retail companies, I spent my career grabbing onto one corporate contract after the next, like a tree-swinging retainer monkey. But in a tariff-distressed industry, those contract &#8220;branches&#8221; grew further and further apart until I was left hanging. Then a colleague experiencing a similar work gap said, &#8220;Well, I guess we&#8217;re retired.&#8221;...</description>
    </item>
    <item>
      <title>Davos reveals mixed messages on CEO confidence&#8212;and new narratives on AI</title>
      <link>https://www.fastcompany.com/91479712/davos-reveals-mixed-messages-on-ceo-confidence-and-new-narratives-on-ai</link>
      <pubDate>2026-01-26T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91479712/davos-reveals-mixed-messages-on-ceo-confidence-and-new-narratives-on-ai</guid>
      <description>&#8216;Modern CEO&#8217; goes to the World Economic Forum Annual Meeting in Davos. Here&#8217;s what leaders here are saying.
Hello and welcome to Modern CEO! I&#8217;m Stephanie Mehta, CEO and chief content officer of Mansueto Ventures. Each week this newsletter explores inclusive approaches to leadership drawn from conversations with executives and entrepreneurs, and from the pages of Inc. and Fast Company. If you received this newsletter from a friend, you can sign up to get it yourself every Monday morning....</description>
    </item>
    <item>
      <title>Strava's finally given Apple Watch users a WorkOutdoors-style feature they've been missing in the Workout app for years</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/stravas-finally-given-apple-watch-users-a-workoutdoors-style-feature-theyve-been-missing-in-the-workout-app-for-years</link>
      <pubDate>Mon, 26 Jan 2026 11:59:11 +0000</pubDate>
      <guid isPermaLink="false">tzk8jBMfExn2qc85Q94qs</guid>
      <description>Strava users on Apple Watch can now follow pre-generated routes while recording a workout, just like the native Garmin feature.</description>
    </item>
    <item>
      <title>How to watch Sabalenka vs. Jovic online for free</title>
      <link>https://mashable.com/article/sabalenka-jovic-australian-open-2026-live-stream-for-free</link>
      <pubDate>Mon, 26 Jan 2026 11:55:53 +0000</pubDate>
      <guid isPermaLink="false">044ZI7YoruOCUgjOUKnz4ml</guid>
      <description>Watch Australian Open for free. Live stream Sabalenka vs. Jovic in the 2026 Australian Open online for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Of all the new 2026 robot lawn mowers, these are the 3 I'm most excited to try out</title>
      <link>https://www.techradar.com/home/smart-home/of-all-the-new-2026-robot-lawn-mowers-these-are-the-3-im-most-excited-to-try-out</link>
      <pubDate>Mon, 26 Jan 2026 11:54:14 +0000</pubDate>
      <guid isPermaLink="false">beA9q5dzeS5XLmQv4iSFRa</guid>
      <description>There are plenty of excellent lawbots heading our way in 2026, but these 3 stand out from the crowd.</description>
    </item>
    <item>
      <title>Voici les plateformes SVoD pr&#233;f&#233;r&#233;es des fran&#231;ais : Apple TV cr&#233;e la surprise et d&#233;tr&#244;ne un Canal+ en chute libre</title>
      <link>https://www.frandroid.com/services/svod/2954955_les-plateformes-svod-preferees-des-francais-apple-tv-cree-la-surprise-et-detrone-un-canal-en-chute-libre</link>
      <pubDate>Mon, 26 Jan 2026 11:52:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2954955_les-plateformes-svod-preferees-des-francais-apple-tv-cree-la-surprise-et-detrone-un-canal-en-chute-libre</guid>
      <description>
Sp&#233;cialiste de l'actualit&#233; cin&#233;/s&#233;rie et du march&#233; de la VoD, le site JustWatch vient de d&#233;voiler son dernier rapport sur les parts de march&#233; en France. Bien que le classement reste quasiment immobile, on pourrait assister &#224; une redistribution des cartes avec quelques surprises.
</description>
    </item>
    <item>
      <title>Le milliardaire tch&#232;que David Kretinsky veut prendre le contr&#244;le de Fnac Darty</title>
      <link>https://www.01net.com/actualites/le-milliardaire-tcheque-david-kretinsky-veut-prendre-le-controle-de-fnac-darty.html</link>
      <pubDate>Mon, 26 Jan 2026 11:52:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322433</guid>
      <description>Du mouvement &#224; venir chez Fnac Darty ? Le milliardaire tch&#232;que veut devenir actionnaire majoritaire de l'enseigne culturelle la plus connue des Fran&#231;ais.</description>
    </item>
    <item>
      <title>Make stealing time a crime: How to protect your most valuable resource</title>
      <link>https://www.fastcompany.com/91465220/make-stealing-time-a-crime-how-to-protect-your-most-valuable-resource-time-management</link>
      <pubDate>2026-01-26T11:52:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91465220/make-stealing-time-a-crime-how-to-protect-your-most-valuable-resource-time-management</guid>
      <description>Time has become the ultimate luxury. Here&#8217;s how to guard it.
I&#8217;m always amazed at how easily we give our time to others without thinking, and then are mad later when it was wasted. What exactly did we think was going to happen? That everyone was going to be prepared, productive, and appreciative?&#160;</description>
    </item>
  </channel>
</rss>
