<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 06 Jan 2026 08:37:33 GMT</lastBuildDate>
    <item>
      <title>Amazon brade &#224; -30 % cette batterie externe Anker 20 000 mAh qui peut recharger 4 fois un iPhone 17</title>
      <link>https://www.frandroid.com/bons-plans/2929249_amazon-brade-a-30-cette-batterie-externe-anker-20-000-mah-qui-peut-recharger-4-fois-un-iphone-17</link>
      <pubDate>Tue, 06 Jan 2026 08:33:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2929249_amazon-brade-a-30-cette-batterie-externe-anker-20-000-mah-qui-peut-recharger-4-fois-un-iphone-17</guid>
      <description>
La batterie externe Anker Zolo de 20&#8239;000&#8239;mAh profite d&#8217;une belle promotion &#224; 33&#8239;euros au lieu de 45&#8239;euros sur Amazon. Un accessoire compact, mais puissant, capable de redonner vie &#224; plusieurs appareils gr&#226;ce &#224; ses 4 ports.
</description>
    </item>
    <item>
      <title>Amazon lance Alexa+ sur le Web pour d&#233;fier ChatGPT, Gemini et consorts</title>
      <link>https://www.01net.com/actualites/amazon-lance-alexa-web-defier-chatgpt-gemini-consorts.html</link>
      <pubDate>Tue, 06 Jan 2026 08:31:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318285</guid>
      <description>Avec Alexa.com, Amazon lance finalement Alexa+ sur le Web. Avec ce nouveau service accessible depuis un navigateur, le g&#233;ant am&#233;ricain cherche &#224; concurrencer les cadors de l'IA, comme  ChatGPT et Gemini.</description>
    </item>
    <item>
      <title>OpenAI's rumored acquisition plans for Pinterest provoke fury among some users</title>
      <link>https://www.techradar.com/ai-platforms-assistants/openais-rumored-acquisition-plans-for-pinterest-provoke-fury-among-some-users</link>
      <pubDate>Tue, 06 Jan 2026 08:19:56 +0000</pubDate>
      <guid isPermaLink="false">3VNhPs7VefExHSPJFtHeS4</guid>
      <description>A speculative report suggesting OpenAI might acquire Pinterest ignited a consumer backlash among Pinterest users.</description>
    </item>
    <item>
      <title>Google a tu&#233; une des fonctionnalit&#233;s les plus pratiques et les moins connues de Gmail</title>
      <link>https://www.frandroid.com/marques/google/2930199_google-a-tue-une-des-fonctionnalites-les-plus-pratiques-et-les-moins-connues-de-gmail</link>
      <pubDate>Tue, 06 Jan 2026 08:18:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2930199_google-a-tue-une-des-fonctionnalites-les-plus-pratiques-et-les-moins-connues-de-gmail</guid>
      <description>
Depuis le d&#233;but du mois de janvier 2026, Google a d&#233;sactiv&#233; la prise en charge du protocole&#160;POP3 sur Gmail. De quoi r&#233;duire la capacit&#233; du service &#224; r&#233;cup&#233;rer les courriers venant d&#8217;autres adresses mail.
</description>
    </item>
    <item>
      <title>Asus surprend tout le monde avec un PC dessin&#233; par le cr&#233;ateur de Metal Gear Solid &#224; un prix ind&#233;cent</title>
      <link>https://www.frandroid.com/marques/asus/2924825_asus-surprend-tout-le-monde-avec-un-pc-dessine-par-le-createur-de-metal-gear-solid</link>
      <pubDate>Tue, 06 Jan 2026 08:16:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/asus/2924825_asus-surprend-tout-le-monde-avec-un-pc-dessine-par-le-createur-de-metal-gear-solid</guid>
      <description>
Asus d&#233;voile une collaboration inattendue avec le cr&#233;ateur de jeux vid&#233;o embl&#233;matique Hideo Kojima et son studio Kojima Productions. R&#233;sultat : un PC en &#233;dition limit&#233;e con&#231;u par le designer de Metal Gear Solid.
</description>
    </item>
    <item>
      <title>AMD d&#233;voile le rempla&#231;ant du tr&#232;s populaire 9800X3D</title>
      <link>https://www.frandroid.com/marques/amd/2929153_amd-officialise-le-ryzen-7-9850x3d-ce-qui-change-vraiment-sur-ce-nouveau-processeur-de-jeu</link>
      <pubDate>Tue, 06 Jan 2026 08:15:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amd/2929153_amd-officialise-le-ryzen-7-9850x3d-ce-qui-change-vraiment-sur-ce-nouveau-processeur-de-jeu</guid>
      <description>
Le Ryzen 7 9850X3D est officiel, mais le nouveau processeur de bureau d'AMD n'apporte finalement que tr&#232;s peu de choses par rapport au 9800X3D.
</description>
    </item>
    <item>
      <title>Pourquoi les Mac et iPad r&#233;cents peuvent maintenant aller plus vite en Wi-Fi</title>
      <link>https://www.01net.com/actualites/pourquoi-les-mac-et-ipad-recents-peuvent-maintenant-aller-plus-vite-en-wi-fi.html</link>
      <pubDate>Tue, 06 Jan 2026 08:01:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318277</guid>
      <description>Gr&#226;ce &#224; une mise &#224; jour logicielle distribu&#233;e dans iPadOS 26.2 et macOS 26.2, les utilisateurs d'iPad et de Mac r&#233;cents b&#233;n&#233;ficient depuis peu d'une connexion Wi-Fi plus rapide, dans les conditions optimales.</description>
    </item>
    <item>
      <title>I&#8217;ve worn the all-new Shokz open earbuds for 4 days and the &#8216;noise reduction&#8217; is so good, I forget they&#8217;re open-ear</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/ive-worn-the-all-new-shokz-open-earbuds-for-4-days-and-the-noise-reduction-is-so-good-i-forget-theyre-open-ear</link>
      <pubDate>Tue, 06 Jan 2026 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">KZVw3djRKPuTbAwTsyq8QH</guid>
      <description>Head-tracked spatial audio and ANC in open earbuds? Yes, you can, with the latest flagship offering from Shokz</description>
    </item>
    <item>
      <title>OpenFit Pro : les &#233;couteurs &#224; oreilles libres qui veulent r&#233;inventer la r&#233;duction de bruit et l&#8217;autonomie pour un usage non-stop</title>
      <link>https://www.frandroid.com/marques/shokz/2926421_openfit-pro-le-casque-a-oreilles-libres-qui-veut-reinventer-la-reduction-de-bruit-et-lautonomie-pour-un-usage-non-stop</link>
      <pubDate>Tue, 06 Jan 2026 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/shokz/2926421_openfit-pro-le-casque-a-oreilles-libres-qui-veut-reinventer-la-reduction-de-bruit-et-lautonomie-pour-un-usage-non-stop</guid>
      <description>
La marque Shokz profite du salon du CES 2026 pour annoncer la commercialisation d&#8217;un nouveau casque. Baptis&#233; OpenFit Pro, il a pour ambition d&#8217;apporter un son plus riche, une r&#233;duction de bruit active in&#233;dite pour ce format et une grande autonomie, tout en restant confortable sur de longues journ&#233;es d&#8217;&#233;coute.
</description>
    </item>
    <item>
      <title>Mammotion d&#233;voile son nouveau robot tondeuse truff&#233; de technologie au CES 2026</title>
      <link>https://www.01net.com/actualites/mammotion-devoile-son-nouveau-robot-tondeuse-truffe-de-technologie-au-ces-2026.html</link>
      <pubDate>Tue, 06 Jan 2026 08:00:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317965</guid>
      <description>Mammotion d&#233;voile au CES 2026 le Luba 3 AWD, un robot-tondeuse haut de gamme qui veut bousculer le march&#233; avec son syst&#232;me de navigation Tri-Fusion m&#234;lant LiDAR, IA et guidage satellite. Capable de g&#233;rer jusqu&#8217;&#224; 10 000 m&#178; selon les versions, il s&#8217;accompagne de deux mod&#232;les plus abordables, les Luba Mini 2 AWD et Yuka Mini 2, pour couvrir tous les types de jardins....</description>
    </item>
    <item>
      <title>CES Live Blog, Day 2: More of the Coolest Tech From Las Vegas</title>
      <link>https://www.wired.com/live/ces-2026-live-blog/</link>
      <pubDate>Tue, 06 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">6957fd7ea2ad6e107579ae74</guid>
      <description>Read our live updates from CES 2026 to see the latest consumer gadgetry in all of its chatbot-enabled, sensor-packed, AI-infused glory.</description>
    </item>
    <item>
      <title>These open-ear buds actually have decent noise reduction</title>
      <link>https://www.theverge.com/tech/853290/shokz-open-fit-pro-hands-on-ces-2026-headphones-wearables</link>
      <pubDate>2026-01-06T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=853290</guid>
      <description>My biggest gripe about open-ear buds is that they're rotten for loud city commutes. Cue a pedantic audiophile pointing out that the whole premise of open-ear buds is to not block out sound. Yes, yes. But the unfortunate truth is that often means if you want open-ear buds for one situation, you'll have to buy [&#8230;]</description>
    </item>
    <item>
      <title>CES 2026: Shokz' new earbuds effectively reduce noise while keeping your ears open</title>
      <link>https://www.engadget.com/audio/headphones/ces-2026-shokz-new-earbuds-effectively-reduce-noise-while-keeping-your-ears-open-080000996.html?src=rss</link>
      <pubDate>Tue, 06 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">c7276387-942e-43c9-bbe7-15cc23735bfb</guid>
      <description>Shokz may have made its name with bone-conduction headsets, but the company has also built open-style earbuds in recent years. At CES 2026, the company is debuting its most recent model, the OpenFit Pro, which combines effective noise reduction with Dolby Atmos support in a premium set of wireless buds. As the name suggests, these sit outside of your ears, secured by an over-the-ear hook, so that you can stay in tune with your surroundings at all times. 
To me, the main appeal of the OpenFit Pro is the new Noise Reduction Mode that acts as a bit of active noise cancellation (ANC) for the open ...</description>
    </item>
    <item>
      <title>Mammotion renouvelle sa gamme et s&#8217;occupe enfin de couper les bordures &#224; votre place</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/robots-tondeuses/2926353_mammotion-renouvelle-sa-gamme-et-soccupe-enfin-de-couper-les-bordures-a-votre-place</link>
      <pubDate>Tue, 06 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/robots-tondeuses/2926353_mammotion-renouvelle-sa-gamme-et-soccupe-enfin-de-couper-les-bordures-a-votre-place</guid>
      <description>
Le trublion des robots tondeuses renouvelle sa gamme embl&#233;matique avec l'annonce de trois nouveaux mod&#232;les. Bien que ceux-ci soient des &#233;volutions de la gamme existante, ils apportent un lot d'am&#233;liorations, &#224; la fois en termes de navigation, mais &#233;galement au niveau des performances de tonte.
</description>
    </item>
    <item>
      <title>Mova muscle son jeu avec deux tondeuses robots 4&#215;4 et une toute nouvelle gamme moins cher</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/robots-tondeuses/2926989_mova-muscle-son-jeu-avec-deux-tondeuses-robots-4x4-et-une-toute-nouvelle-gamme-moins-cher</link>
      <pubDate>Tue, 06 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/robots-tondeuses/2926989_mova-muscle-son-jeu-avec-deux-tondeuses-robots-4x4-et-une-toute-nouvelle-gamme-moins-cher</guid>
      <description>
Mova profite du CES 2026 pour lever le voile sur deux nouveaux robots tondeuses tout-terrain, tout en officialisant les tarifs et la disponibilit&#233; des gammes LiDAX Ultra et ViAX d&#233;j&#224; aper&#231;ues &#224; l'IFA.
</description>
    </item>
    <item>
      <title>This desktop charger turns your iPhone into a robotic AI assistant</title>
      <link>https://www.theverge.com/tech/856077/yoona-deskmate-iphone-robot-companion-ai-assistant</link>
      <pubDate>2026-01-06T02:59:19-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=856077</guid>
      <description>CES is packed with AI companions and assistant robots this year, but the DeskMate from Loona is a clever take on the idea: it's a desktop charging hub, with three USB-C ports, one USB-A, and a MagSafe pad, that automatically activates an AI companion app when you attach your iPhone to the wireless charger. What's [&#8230;]</description>
    </item>
    <item>
      <title>Cette marque d&#8217;aspirateurs lance un robot peluche pour vous tenir compagnie</title>
      <link>https://www.frandroid.com/marques/ecovacs/2929905_cette-marque-daspirateurs-lance-un-robot-peluche-pour-vous-tenir-compagnie</link>
      <pubDate>Tue, 06 Jan 2026 07:56:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/ecovacs/2929905_cette-marque-daspirateurs-lance-un-robot-peluche-pour-vous-tenir-compagnie</guid>
      <description>
Ecovacs ne veut plus seulement nettoyer votre maison, mais veut l&#8217;habiter en vous tenant compagnie. Avec LilMilo, la marque lance son premier robot compagnon, bas&#233; sur de la robotique &#233;motionnelle et au design organique qui ressemble &#224; s'y m&#233;prendre &#224; un petit chien.
</description>
    </item>
    <item>
      <title>Un PC gaming puissant et pas cher&#160;: Alienware veut changer la fa&#231;on dont on joue sur laptop</title>
      <link>https://www.01net.com/actualites/un-pc-gaming-puissant-et-pas-cher-alienware-veut-changer-la-facon-dont-on-joue-sur-laptop.html</link>
      <pubDate>Tue, 06 Jan 2026 07:55:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317955</guid>
      <description>Comment toucher plus de gamers ? En rendant les PC de jeu plus accessibles. C&#8217;est ce que voudrait faire Alienware avec un premier laptop gaming abordable, d&#232;s cette ann&#233;e.</description>
    </item>
    <item>
      <title>Il y a d&#233;j&#224; une r&#233;duction sur les Nothing Ear (3), des &#233;couteurs true wireless avec audio Hi-Res premium et ce look si particulier</title>
      <link>https://www.frandroid.com/bons-plans/2928549_il-y-a-deja-une-reduction-sur-les-nothing-ear-3-des-ecouteurs-true-wireless-avec-audio-hi-res-premium-et-ce-look-si-particulier</link>
      <pubDate>Tue, 06 Jan 2026 07:40:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2928549_il-y-a-deja-une-reduction-sur-les-nothing-ear-3-des-ecouteurs-true-wireless-avec-audio-hi-res-premium-et-ce-look-si-particulier</guid>
      <description>
Nothing continue de surprendre, en bien, avec des &#233;couteurs sans-fil de qualit&#233;, les Nothing Ear (3) que vous retrouvez &#224; 149 euros au lieu de 179 euros.
</description>
    </item>
    <item>
      <title>Garmin veut surveiller votre nutrition avec son appli</title>
      <link>https://www.01net.com/actualites/garmin-veut-maintenant-surveiller-votre-nutrition-avec-son-appli.html</link>
      <pubDate>Tue, 06 Jan 2026 07:39:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318294</guid>
      <description>L&#8217;application Garmin Connect int&#232;gre &#224; pr&#233;sent un syst&#232;me de suivi nutritionnel pour vous aider &#224; enregistrer vos repas et compter vos calories. L&#8217;option n&#8217;est toutefois accessible qu&#8217;avec un abonnement Garmin Connect Plus.</description>
    </item>
    <item>
      <title>Les robots Atlas remplaceront-ils tous les humains dans les usines Hyundai&#160;?</title>
      <link>https://www.01net.com/actualites/atlas-le-robot-humanoide-de-boston-dynamics-pointera-bientot-dans-les-usines-hyundai.html</link>
      <pubDate>Tue, 06 Jan 2026 07:30:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318273</guid>
      <description>Hyundai veut d&#233;ployer dans ses usines les robots humanoides de sa filiale Boston Dynamics et ce, &#224; partir de 2028. Cette &#171; collaboration homme-robot &#187; ne vise pas &#224; remplacer les humains, mais&#8230; &#224; les &#171;&#160;assister&#160;&#187;.</description>
    </item>
    <item>
      <title>Amazon vient concurrencer ChatGPT avec Alexa.com&#8230; mais pas encore chez nous</title>
      <link>https://www.frandroid.com/marques/amazon/2930169_amazon-vient-concurrencer-chatgpt-avec-alexa-com-mais-pas-encore-chez-nous</link>
      <pubDate>Tue, 06 Jan 2026 07:22:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazon/2930169_amazon-vient-concurrencer-chatgpt-avec-alexa-com-mais-pas-encore-chez-nous</guid>
      <description>
Gr&#226;ce &#224; son ubiquit&#233;, ChatGPT est quasiment devenu synonyme d&#8217;utilisation de l&#8217;IA. Amazon souhaite bousculer cette domination sans pareille en lan&#231;ant Alexa.com&#8230; mais il y a encore du boulot.
</description>
    </item>
    <item>
      <title>Un an apr&#232;s, Dell r&#233;pare sa plus grande erreur et relance la marque XPS</title>
      <link>https://www.01net.com/actualites/un-an-apres-dell-repare-sa-plus-grande-erreur-et-relance-la-marque-xps.html</link>
      <pubDate>Tue, 06 Jan 2026 07:22:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317951</guid>
      <description>Dell renoue avec la marque XPS qu&#8217;il avait souhait&#233; faire dispara&#238;tre l&#8217;an dernier et avec son repr&#233;sentant le plus embl&#233;matique : le XPS 13.</description>
    </item>
    <item>
      <title>Narwal adds AI to its vacuum cleaners to monitor pets and find jewelry</title>
      <link>https://techcrunch.com/2026/01/05/narwal-adds-ai-to-its-vacuum-cleaners-to-monitor-pets-and-find-jewelry/</link>
      <pubDate>Tue, 06 Jan 2026 07:18:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3080168</guid>
      <description>Narwal's new robo vacuum cleaner switches to quiet mode near a baby's crib.</description>
    </item>
    <item>
      <title>Ce SSD a deux qualit&#233;s que vous ne voyez pas en photo</title>
      <link>https://www.frandroid.com/produits-android/hardware/stockage/2930085_ce-ssd-a-deux-qualites-que-vous-ne-voyez-pas-en-photo</link>
      <pubDate>Tue, 06 Jan 2026 07:11:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/stockage/2930085_ce-ssd-a-deux-qualites-que-vous-ne-voyez-pas-en-photo</guid>
      <description>
Le Lexar Air Portable SSD est compact, ultra l&#233;ger (19 grammes) et tr&#232;s r&#233;sistant en plus de proposer 2 To de stockage.
</description>
    </item>
    <item>
      <title>La carte microSD ultime &#224; 2 To ? Voici la derni&#232;re nouveaut&#233; sign&#233;e Lexar</title>
      <link>https://www.frandroid.com/produits-android/hardware/stockage/2929911_la-carte-microsd-ultime-a-2-to-voici-la-derniere-nouveaute-signee-lexar</link>
      <pubDate>Tue, 06 Jan 2026 07:05:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/stockage/2929911_la-carte-microsd-ultime-a-2-to-voici-la-derniere-nouveaute-signee-lexar</guid>
      <description>
Lexar lance une nouvelle carte microSDXC ultra rapide d&#233;di&#233;e aux contenus vid&#233;o.
</description>
    </item>
    <item>
      <title>LEGO Smart Play&#160;: et maintenant les briques parlent et interagissent entre elles&#160;!</title>
      <link>https://www.01net.com/actualites/son-et-lumiere-les-nouveaux-lego-star-wars-reinventent-linteractivite-entre-les-briques.html</link>
      <pubDate>Tue, 06 Jan 2026 07:01:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318262</guid>
      <description>LEGO ajoute une dimension interactive &#224; ses briques et &#224; ses mini-figurines avec le nouveau syst&#232;me Smart Play qui permet aux cr&#233;ations d'interagir entre elles avec des sons et des effets lumineux. Trois sets Star Wars sont d'ores et d&#233;j&#224; &#233;quip&#233;s.</description>
    </item>
    <item>
      <title>Your mind needs a training plan, here&#8217;s how to build one</title>
      <link>https://www.fastcompany.com/91463968/your-mind-needs-a-training-plan-heres-how-to-build-one</link>
      <pubDate>2026-01-06T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463968/your-mind-needs-a-training-plan-heres-how-to-build-one</guid>
      <description>What if we trained mental capacity the same way we train physical fitness: through reps, metrics, and practice?
It&#8217;s the first week of January, and you&#8217;re already drowning in Slack messages. You told yourself this year would be different, that you&#8217;d set boundaries and stop overcommitting. But here you are, saying yes to another meeting you don&#8217;t have time for, staying late to fix something that could wait, feeling that familiar knot in your stomach every Sunday night....</description>
    </item>
    <item>
      <title>Framing ADHD as a strength can lead to better mental health</title>
      <link>https://www.fastcompany.com/91469133/framing-adhd-as-a-strength-can-lead-to-better-mental-health</link>
      <pubDate>2026-01-06T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91469133/framing-adhd-as-a-strength-can-lead-to-better-mental-health</guid>
      <description>New research suggests that recognizing ADHD-related strengths like creativity and hyperfocus may improve mental health and well-being.
Those with Attention Deficient Hyperactivity Disorder, better known as ADHD, often experience challenges that neurotypical people do not, such as distractibility or low frustration tolerance. However, there is a growing body of evidence that suggests that ADHD also has an upside. And, according to a new study, being aware of these positives may create some mental health perks.&#160;...</description>
    </item>
    <item>
      <title>&#171;&#160;On vend plus en ne le disant pas&#160;&#187; : Dell admet que l&#8217;IA ne fait pas vendre de PC</title>
      <link>https://www.frandroid.com/marques/dell/2926241_on-vend-plus-en-ne-le-disant-pas-dell-admet-que-lia-ne-fait-pas-vendre-de-pc</link>
      <pubDate>Tue, 06 Jan 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dell/2926241_on-vend-plus-en-ne-le-disant-pas-dell-admet-que-lia-ne-fait-pas-vendre-de-pc</guid>
      <description>
Vous en avez marre qu'on vous colle de l'IA &#224; toutes les sauces ? Vous n'&#234;tes pas seul. Dell s'est rendu compte d'une r&#233;alit&#233; brutale : le terme &#171; AI PC &#187; ne fait pas vendre. Pire, il embrouille tout le monde. 
</description>
    </item>
    <item>
      <title>Ceci est un laboratoire miniature qui peut aider beaucoup de monde</title>
      <link>https://www.frandroid.com/events/ces/2929735_ceci-est-un-laboratoire-miniature-qui-peut-aider-beaucoup-de-monde</link>
      <pubDate>Tue, 06 Jan 2026 06:51:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/events/ces/2929735_ceci-est-un-laboratoire-miniature-qui-peut-aider-beaucoup-de-monde</guid>
      <description>
Ce bo&#238;tier miniaturise une technologie de laboratoire pour d&#233;tecter les potentiels allerg&#232;nes dans les aliments que vous vous appr&#234;tez &#224; manger.
</description>
    </item>
    <item>
      <title>Samsung l&#8217;a fait&#160;: le plus gros d&#233;faut des smartphones pliants appartient au pass&#233;</title>
      <link>https://www.01net.com/actualites/samsung-plus-gros-defaut-smartphones-pliants-appartient-passe.html</link>
      <pubDate>Tue, 06 Jan 2026 06:47:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318280</guid>
      <description>Samsung Display profite du CES 2026 pour d&#233;voiler un &#233;cran pliable dont la pliure centrale est devenue totalement invisible. Une prouesse technique qui pourrait &#233;quiper le futur Galaxy Z Fold 8 et le premier iPhone pliable d'Apple.</description>
    </item>
    <item>
      <title>Des v&#233;los &#233;lectriques chinois plus s&#251;rs : une nouvelle norme va grandement booster leur s&#233;curit&#233;</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2929251_des-velos-electriques-chinois-plus-surs-une-nouvelle-norme-va-grandement-booster-leur-securite</link>
      <pubDate>Tue, 06 Jan 2026 06:44:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2929251_des-velos-electriques-chinois-plus-surs-une-nouvelle-norme-va-grandement-booster-leur-securite</guid>
      <description>
Apr&#232;s une premi&#232;re vague d'applications impliquant une forte chute des incendies, la Chine force sa nouvelle r&#233;glementation en mati&#232;re de batteries et de chargeurs depuis d&#233;cembre, ce qui pourrait aussi b&#233;n&#233;ficier &#224; l&#8217;Europe.
</description>
    </item>
  </channel>
</rss>
