<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 05 Jan 2026 10:30:43 GMT</lastBuildDate>
    <item>
      <title>Starlink offers free internet access in Venezuela following Maduro raid</title>
      <link>https://www.engadget.com/big-tech/starlink-offers-free-internet-access-in-venezuela-following-maduro-raid-102705135.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 10:27:05 +0000</pubDate>
      <guid isPermaLink="false">e719aaee-2e27-45da-91a4-d4ebab9fd51f</guid>
      <description>SpaceX&#8217;s Starlink is offering customers in Venezuela free access to its internet service after the US captured the country&#8217;s president, Nicol&#225;s Maduro. According to CNBC, some areas of Caracas and other parts of the country lost power and internet connectivity in the wake of the operation.&#160;Starlink says its focus is &#8220;on enabling connectivity for new and existing customers to support the people of Venezuela.&#8221; At the time of writing, Starlink does not yet appear to formally operate in the country, as its availability map states that service there is "coming soon."&#160;Still, Starlink says it is proa...</description>
    </item>
    <item>
      <title>SwitchBot Obboto : une lampe globe avec 2900 LEDs pour le pixel art</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/2927995_switchbot-obboto-une-lampe-globe-avec-2900-leds-pour-le-pixel-art</link>
      <pubDate>Mon, 05 Jan 2026 10:24:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/2927995_switchbot-obboto-une-lampe-globe-avec-2900-leds-pour-le-pixel-art</guid>
      <description>
Il faut qu'on parle de l'obsession de mettre de l'IA partout. M&#234;me dans une lampe. SwitchBot d&#233;voile l'Obboto, un globe lumineux capable de g&#233;n&#233;rer des "animations d'ambiance contr&#244;l&#233;es par l'IA". Au-del&#224; du buzzword, c'est surtout un tr&#232;s joli afficheur pixel art qui pourrait bien faire de l'ombre au c&#233;l&#232;bre LaMetric Time.
</description>
    </item>
    <item>
      <title>La manette Pro de la Nintendo Switch 2 revient en promotion pour le d&#233;but de l&#8217;ann&#233;e 2026</title>
      <link>https://www.frandroid.com/bons-plans/2633865_la-manette-pro-de-la-nintendo-switch-2-revient-en-promotion-pour-le-debut-de-lannee-2026</link>
      <pubDate>Mon, 05 Jan 2026 10:22:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2633865_la-manette-pro-de-la-nintendo-switch-2-revient-en-promotion-pour-le-debut-de-lannee-2026</guid>
      <description>
Plus performante que la premi&#232;re version, la Nintendo Switch 2 Pro Controller est un accessoire id&#233;al qui permet d'exploiter tout le potentiel de la r&#233;cente console de la marque. Pour ce d&#233;but d'ann&#233;e 2026, on la trouve &#224; 69,99 euros au lieu de 89,90 euros chez Micromania.
</description>
    </item>
    <item>
      <title>Nvidia pr&#233;parerait une appli GeForce Now pour Linux</title>
      <link>https://www.01net.com/actualites/nvidia-preparerait-une-appli-geforce-now-pour-linux.html</link>
      <pubDate>Mon, 05 Jan 2026 10:22:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318075</guid>
      <description>Les joueurs abonn&#233;s au service de jeux en streaming de NVIDIA vont enfin pouvoir en profiter sur Linux. Nvdia serait sur le point de d&#233;voiler un nouveau client natif pour cet OS.</description>
    </item>
    <item>
      <title>SwitchBot lance une station m&#233;t&#233;o avec &#233;cran E-Ink de 7,5 pouces boost&#233;e &#224; l&#8217;IA</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/2926729_switchbot-lance-une-station-meteo-avec-ecran-e-ink-de-75-pouces-boostee-a-lia</link>
      <pubDate>Mon, 05 Jan 2026 10:18:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/2926729_switchbot-lance-une-station-meteo-avec-ecran-e-ink-de-75-pouces-boostee-a-lia</guid>
      <description>
SwitchBot continue de tisser sa toile dans la maison connect&#233;e. Cette fois, la marque s'attaque &#224; l'affichage domestique avec une station m&#233;t&#233;o dot&#233;e d'un &#233;cran E-Ink. Loin d'&#234;tre un simple thermom&#232;tre de luxe, c'est un v&#233;ritable hub d'informations qui promet m&#234;me des "briefings m&#233;t&#233;o" boost&#233;s &#224; l'IA. 
</description>
    </item>
    <item>
      <title>Microsoft va se calmer sur l&#8217;affichage des publicit&#233;s dans Windows 11</title>
      <link>https://www.frandroid.com/marques/microsoft/2927461_microsoft-va-se-calmer-sur-laffichage-des-publicites-dans-windows-11</link>
      <pubDate>Mon, 05 Jan 2026 10:09:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2927461_microsoft-va-se-calmer-sur-laffichage-des-publicites-dans-windows-11</guid>
      <description>
Les &#233;quipes de Microsoft testent une nouvelle option dans les param&#232;tres de Partage pour limiter certaines suggestions publicitaires dans Windows 11.
</description>
    </item>
    <item>
      <title>Nearly half a million patients exposed in healthcare breach - here's what we know</title>
      <link>https://www.techradar.com/pro/security/nearly-half-a-million-patients-exposed-in-healthcare-breach-heres-what-we-know</link>
      <pubDate>Mon, 05 Jan 2026 10:08:42 +0000</pubDate>
      <guid isPermaLink="false">QQwkTatKxtUBgzcK2pUMzA</guid>
      <description>Last May, Qilin struck Covenant Health, but initial reports claimed it to be a limited incident.</description>
    </item>
    <item>
      <title>ASUS ne sortira aucun smartphone en 2026&#160;: vers la fin d&#8217;une &#232;re&#160;?</title>
      <link>https://www.01net.com/actualites/asus-ne-sortira-aucun-smartphone-en-2026-vers-la-fin-dune-ere.html</link>
      <pubDate>Mon, 05 Jan 2026 10:02:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318048</guid>
      <description>Le couperet est tomb&#233; pour les fans de la marque ta&#239;wanaise : ASUS confirme qu'aucun nouveau mod&#232;le ne verra le jour cette ann&#233;e. Une &#171; pause &#187; qui ressemble &#233;trangement &#224; des adieux.</description>
    </item>
    <item>
      <title>The 5 best meditation apps for 2026</title>
      <link>https://www.engadget.com/apps/best-meditation-app-140047993.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 10:01:27 +0000</pubDate>
      <guid isPermaLink="false">4823369b-dc62-4e7a-8b4c-144062f5d2af</guid>
      <description>Daily life can get loud, and meditation apps offer a simple way to carve out a little breathing room. You do not need experience to start, and you do not need to commit to long sessions either. Most apps guide you through short practices that help with focus, sleep and stress, making it easy to build a routine even on busy days.There are plenty of meditation apps to choose from, each with its own style and approach. Some focus on mindfulness basics, others offer structured programs and a few add community features for accountability. I tested the most popular options to find the best meditatio...</description>
    </item>
    <item>
      <title>Silicon Valley Is Flirting with a Very Stupid New Way to Die</title>
      <link>https://gizmodo.com/silicon-valley-is-flirting-with-a-very-stupid-new-way-to-die-2000705108</link>
      <pubDate>Mon, 05 Jan 2026 10:00:46 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705108</guid>
      <description>Peptides are legal and relatively harmless. Habitually injecting yourself with mysterious powders though?</description>
    </item>
    <item>
      <title>Flu Is Relentless. Crispr Might Be Able to Shut It Down</title>
      <link>https://www.wired.com/story/crispr-flu-antivirals/</link>
      <pubDate>Mon, 05 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">694049627b304af519561d7b</guid>
      <description>Innovative research into the gene-editing tool targets influenza&#8217;s ability to replicate&#8212;stopping it in its tracks.</description>
    </item>
    <item>
      <title>Kodiak taps Bosch to scale its self-driving truck tech</title>
      <link>https://techcrunch.com/2026/01/05/kodiak-taps-bosch-to-scale-its-self-driving-truck-tech/</link>
      <pubDate>Mon, 05 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3079614</guid>
      <description>There is no timeline for when these systems will become available. But once they do, Kodiak could bring its tech to more trucks, faster.</description>
    </item>
    <item>
      <title>Exoplan&#232;tes : 30 ans apr&#232;s la premi&#232;re d&#233;couverte, la chasse entre dans une phase d&#233;cisive</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-exoplanetes-30-ans-apres-premiere-decouverte-chasse-phase-decisive-129380/#xtor%3DRSS-8</link>
      <pubDate>Mon, 05 Jan 2026 10:57:48 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-exoplanetes-30-ans-apres-premiere-decouverte-chasse-phase-decisive-129380/#xtor%3DRSS-8</guid>
      <description>Depuis les ann&#233;es 2010, l&#8217;Observatoire de la C&#244;te d&#8217;Azur (OCA) m&#232;ne des campagnes d'observation&#160;dans l'Antarctique dans le cadre du projet&#160;Astep (Antarctic Search for Transiting Extrasolar Planets). En th&#233;orie, cela permet de chercher, &#224; moindre co&#251;t, des exoplan&#232;tes habitables proches du...</description>
    </item>
    <item>
      <title>Motorola Razr Fold : le premier smartphone pliable au format livre de la marque a fuit&#233;</title>
      <link>https://www.frandroid.com/marques/motorola/2927445_motorola-razr-fold-le-premier-smartphone-pliable-au-format-livre-de-la-marque-a-fuite</link>
      <pubDate>Mon, 05 Jan 2026 09:57:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/motorola/2927445_motorola-razr-fold-le-premier-smartphone-pliable-au-format-livre-de-la-marque-a-fuite</guid>
      <description>
Alors que Motorola s'est jusqu'ici cantonn&#233; au march&#233; des smartphones &#224; clapet, une fuite r&#233;v&#232;le l'existence du &#171; Razr Fold &#187;. Ce mod&#232;le, au format livre, viendrait directement concurrencer les r&#233;f&#233;rences de Samsung et Google d&#232;s 2026.
</description>
    </item>
    <item>
      <title>2025 Digital rights review: Spyware, AI war &amp; EU regulations</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/2025-digital-rights-review-spyware-ai-war-and-eu-regulations</link>
      <pubDate>Mon, 05 Jan 2026 09:52:57 +0000</pubDate>
      <guid isPermaLink="false">xsFWfwms4CwAnQGHLzVdWY</guid>
      <description>We spoke to the digital rights organization Access Now about the most significant developments of the past 12 months. Here's what they said.</description>
    </item>
    <item>
      <title>Les voitures &#233;lectriques de Xiaomi viennent de r&#233;ussir un exploit que Tesla a mis 2 fois plus de temps &#224; atteindre</title>
      <link>https://www.frandroid.com/marques/xiaomi/2927385_les-voitures-electriques-de-xiaomi-viennent-de-reussir-un-exploit-que-tesla-a-mis-2-fois-plus-de-temps-a-atteindre</link>
      <pubDate>Mon, 05 Jan 2026 09:50:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2927385_les-voitures-electriques-de-xiaomi-viennent-de-reussir-un-exploit-que-tesla-a-mis-2-fois-plus-de-temps-a-atteindre</guid>
      <description>
Avec plus de 410 000 exemplaires vendus en 2025, les voitures &#233;lectriques de Xiaomi ont d&#233;pass&#233; les attentes. &#192; tel point que son patron a annonc&#233; &#234;tre rentable, et de relever son objectif de livraisons pour 2026.
</description>
    </item>
    <item>
      <title>Garmin Instinct 3 Amoled : Amazon brade d&#233;j&#224; &#224; -44 % cette montre outdoor lanc&#233;e en 2025</title>
      <link>https://www.frandroid.com/bons-plans/2531487_garmin-instinct-3-amoled-amazon-brade-deja-a-moins-44-pourcents-cette-montre-outdoor-lancee-en-2025</link>
      <pubDate>Mon, 05 Jan 2026 09:46:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2531487_garmin-instinct-3-amoled-amazon-brade-deja-a-moins-44-pourcents-cette-montre-outdoor-lancee-en-2025</guid>
      <description>
Annonc&#233;e lors du CES 2025 de Las Vegas, la Garmin Instinct 3 Amoled est une montre connect&#233;e sportive qui vous accompagne partout au tarif exceptionnel de 251,54 euros, au lieu de 449 euros habituellement. 
</description>
    </item>
    <item>
      <title>Data sovereignty: not just an issue for governments</title>
      <link>https://www.techradar.com/pro/data-sovereignty-not-just-an-issue-for-governments</link>
      <pubDate>Mon, 05 Jan 2026 09:46:04 +0000</pubDate>
      <guid isPermaLink="false">9EUuH2yq7HsYojSpAAGvDR</guid>
      <description>Data sovereignty is a major concern not just for governments but for organizations across sectors.</description>
    </item>
    <item>
      <title>Le gros coup de Decathlon, qui pourrait booster le v&#233;lo (&#233;lectrique) d&#8217;entreprise en France</title>
      <link>https://www.frandroid.com/marques/decathlon/2927657_le-gros-coup-de-decathlon-qui-pourrait-booster-le-velo-electrique-dentreprise-en-france</link>
      <pubDate>Mon, 05 Jan 2026 09:43:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/decathlon/2927657_le-gros-coup-de-decathlon-qui-pourrait-booster-le-velo-electrique-dentreprise-en-france</guid>
      <description>
Decathlon Pulse, la filiale d&#8217;investissement de Decathlon, va devenir majoritaire dans le groupe Bikeleasing, sp&#233;cialiste de la location de v&#233;los d&#8217;entreprise dans les pays germanophones. Une acquisition qui en dit long sur les ambitions du groupe fran&#231;ais.
</description>
    </item>
    <item>
      <title>Jackery d&#233;voile un robot solaire autonome et une pergola photovolta&#239;que</title>
      <link>https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2927715_jackery-devoile-un-robot-solaire-autonome-et-une-pergola-photovoltaique</link>
      <pubDate>Mon, 05 Jan 2026 09:41:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2927715_jackery-devoile-un-robot-solaire-autonome-et-une-pergola-photovoltaique</guid>
      <description>
On pensait avoir tout vu en mati&#232;re de batteries externes. Mais Jackery vient de dynamiter le CES 2026. Ici, ce n'est pas une simple station qu'on jette dans le coffre : la marque pr&#233;sente un robot autonome qui chasse le soleil et une pergola photovolta&#239;que pour votre jardin.
</description>
    </item>
    <item>
      <title>Alerte Chrome, Edge et Firefox&#160;: un empire de l&#8217;espionnage chinois a &#233;t&#233; d&#233;couvert</title>
      <link>https://www.01net.com/actualites/alerte-chrome-edge-firefox-empire-espionnage-chinois-decouvert.html</link>
      <pubDate>Mon, 05 Jan 2026 09:36:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318042</guid>
      <description>Un empire chinois de l'espionnage sur Chrome, Edge et Firefox a &#233;t&#233; d&#233;busqu&#233; par les chercheurs en cybers&#233;curit&#233; de Koi. Patient et m&#233;thodique, le groupe DarkSpectre a inond&#233; les boutiques d'extensions en apparence l&#233;gitimes qui sont en fait taill&#233;es pour siphonner vos donn&#233;es. L'entit&#233; vise notamment les informations sur des r&#233;unions d'entreprises....</description>
    </item>
    <item>
      <title>L&#8217;OLED RGB est la technologie &#224; surveiller sur les &#233;crans PC en 2026, mais &#231;a change quoi ?</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/ecran-pc/2927239_loled-rgb-est-la-technologie-a-surveiller-sur-les-ecrans-pc-en-2026-mais-ca-change-quoi</link>
      <pubDate>Mon, 05 Jan 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/ecran-pc/2927239_loled-rgb-est-la-technologie-a-surveiller-sur-les-ecrans-pc-en-2026-mais-ca-change-quoi</guid>
      <description>
Vous connaissez le probl&#232;me des &#233;crans OLED sur PC. C'est magnifique pour jouer, mais d&#232;s qu'il faut taper un mail, le texte bave et les contours sont flous. C'est fini. Au CES 2026, LG et Samsung basculent enfin vers l'OLED RGB. Asus d&#233;gaine le premier avec un &#233;cran qui promet de r&#233;concilier Excel et Cyberpunk.
</description>
    </item>
    <item>
      <title>Nouvelle fuite de donn&#233;es en France&#160;: Doctolib d&#233;ment &#234;tre responsable du vol de 150&#160;000 dossiers de patients</title>
      <link>https://www.01net.com/actualites/fuite-donnees-doctolib-informations-milliers-francais-compromises.html</link>
      <pubDate>Mon, 05 Jan 2026 09:29:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318023</guid>
      <description>Doctolib s'est retrouv&#233; au c&#339;ur d'une nouvelle fuite de donn&#233;es ce week-end. Plus de 150 000 fiches patients issues de l&#8217;H&#244;pital priv&#233; de la Miotte et d&#8217;un cabinet d&#8217;ophtalmologie de Sallanches circulent sur le dark web. Les deux &#233;tablissements passaient par Doctolib pour permettre aux patients de prendre rendez-vous. Interrog&#233; par 01net, Doctolib d&#233;ment fermement toute violation et pr&#233;cise que les donn&#233;es n'ont pas &#233;t&#233; vol&#233;es sur ses serveurs....</description>
    </item>
    <item>
      <title>Fini la corv&#233;e du rangement avant l&#8217;aspirateur&#160;? Narwal pr&#233;sente le Flow 2</title>
      <link>https://www.01net.com/actualites/fini-corvee-rangement-avant-aspirateur-narwal-presente-flow-2.html</link>
      <pubDate>Mon, 05 Jan 2026 09:27:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318047</guid>
      <description>Le Narwal Flow 2, fra&#238;chement d&#233;voil&#233; au CES 2026, entend r&#233;soudre l'un des d&#233;fauts r&#233;currents des robots : aspirer des petits objets ou des c&#226;bles, qui n&#233;cessitent souvent de voler &#224; leur secours.</description>
    </item>
    <item>
      <title>Pure Fibre de B&amp;YOU : tout ce qu&#8217;il faut savoir sur l&#8217;offre 8 Gb/s pas ch&#232;re de Bouygues Telecom</title>
      <link>https://www.frandroid.com/marques/bouygues-telecom/2546819_pure-fibre-de-byou-tout-ce-quil-faut-savoir-sur-loffre-8-gb-s-pas-chere-de-bouygues-telecom</link>
      <pubDate>Mon, 05 Jan 2026 09:26:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bouygues-telecom/2546819_pure-fibre-de-byou-tout-ce-quil-faut-savoir-sur-loffre-8-gb-s-pas-chere-de-bouygues-telecom</guid>
      <description>
Malgr&#233; une l&#233;g&#232;re augmentation de son prix d&#233;but 2026, la Pure Fibre de B&amp;YOU reste l'un des forfaits internet les plus populaires du march&#233;. Une offre single-play avec un routeur premium (d&#233;bit 8 Gb/s, Wi-Fi 7 tri-bande...) pour un prix d'entr&#233;e de gamme. Voici tout ce qu'il faut savoir sur la Pure Fibre.
</description>
    </item>
    <item>
      <title>&#199;a y est, Tesla a commenc&#233; sa production de son nouveau Cybercab</title>
      <link>https://www.frandroid.com/marques/tesla/2927299_ca-y-est-tesla-a-commence-sa-production-de-son-nouveau-cybercab</link>
      <pubDate>Mon, 05 Jan 2026 09:17:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2927299_ca-y-est-tesla-a-commence-sa-production-de-son-nouveau-cybercab</guid>
      <description>
Le constructeur am&#233;ricain Tesla vient de d&#233;voiler sa vid&#233;o r&#233;capitulative de l&#8217;ann&#233;e 2025. Et la marque en profite pour confirmer le d&#233;marrage de la production de sa prochaine voiture &#233;lectrique : le Cybercab autonome.
</description>
    </item>
    <item>
      <title>Voici le Honor Magic 8 Lite&#160;: il mise tout sur la robustesse et l&#8217;autonomie</title>
      <link>https://www.01net.com/actualites/voici-le-honor-magic-8-lite-il-mise-tout-sur-la-robustesse-et-lautonomie.html</link>
      <pubDate>Mon, 05 Jan 2026 09:15:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317873</guid>
      <description>Honor annonce la sortie de son nouveau smartphone, le Magic 8 Lite. Gr&#226;ce &#224; lui, la marque souhaite proposer un smartphone plus r&#233;sistant et avec plus d'autonomie sur le segment du milieu de gamme &#224; l'aide d'une batterie en silicium-carbone, une certification IP69K et la promesse de mise &#224; jour logiciel pendant 6 ans.</description>
    </item>
    <item>
      <title>Prix des smartphones et des TV Samsung : une hausse &#171;&#160;in&#233;vitable&#160;&#187; confirm&#233;e par le patron</title>
      <link>https://www.frandroid.com/marques/samsung/2927417_prix-des-smartphones-samsung-une-hausse-inevitable-confirmee-par-le-patron</link>
      <pubDate>Mon, 05 Jan 2026 09:03:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2927417_prix-des-smartphones-samsung-une-hausse-inevitable-confirmee-par-le-patron</guid>
      <description>
Samsung a perdu sa couronne face &#224; Apple en 2025, et &#231;a ne leur pla&#238;t pas. La r&#233;ponse ? Une alliance massive avec Google pour propulser Gemini sur 800 millions d'appareils. Mais attendez avant de sortir la carte bleue. TM Roh pr&#233;vient : avec la p&#233;nurie de m&#233;moire qui frappe l'industrie, une hausse des prix est d&#233;sormais "in&#233;vitable".
</description>
    </item>
    <item>
      <title>Les Redmi Note 15 sont l&#224; : que valent les champions du rapport qualit&#233;-prix de Xiaomi en 2026&#160;?</title>
      <link>https://www.01net.com/actualites/les-redmi-note-15-sont-la-que-valent-les-champions-du-rapport-qualite-prix-de-xiaomi-en-2026.html</link>
      <pubDate>Mon, 05 Jan 2026 09:00:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317876</guid>
      <description>Xiaomi officialise une toute nouvelle g&#233;n&#233;ration de smartphones Redmi avec la gamme Redmi Note 15. Compos&#233;e de plusieurs mod&#232;les 4G et 5G, cette gamme, qui repr&#233;sente pr&#232;s de 50 % des ventes de la marque en France, entend poursuivre la recette qui a fait le succ&#232;s de Redmi, un excellent rapport qualit&#233;-prix.</description>
    </item>
    <item>
      <title>Prise en main du Xiaomi Redmi Note 15 5G&#160;: le futur best-seller de 2026 est (peut-&#234;tre) l&#224;</title>
      <link>https://www.01net.com/actualites/prise-en-main-du-xiaomi-redmi-note-15-5g-le-futur-best-seller-de-2026-est-peut-etre-la.html</link>
      <pubDate>Mon, 05 Jan 2026 09:00:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317966</guid>
      <description>Le nouveau Redmi Note 15 5G de Xiaomi mise sur la finesse, une robustesse &#171; Titan &#187; et l'IA pour s'imposer comme la r&#233;f&#233;rence de l'entr&#233;e de gamme en 2026.</description>
    </item>
    <item>
      <title>New BBC crime drama Lynley is 'completely different' to its predecessor &#8212; but don't rule out other detective crossovers</title>
      <link>https://www.techradar.com/streaming/entertainment/new-bbc-crime-drama-lynley-is-completely-different-to-its-predecessor-but-dont-rule-out-other-detective-crossovers</link>
      <pubDate>Mon, 05 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">SChpd86AeuwikDj8jTXhwg</guid>
      <description>If you remember The Inspector Lynley Mysteries from the early 2000s, the BBC's new adaptation is a world away. But that doesn't mean it can't have other detective crossovers.</description>
    </item>
    <item>
      <title>7 things every leader must do to prepare their organization for 2026</title>
      <link>https://www.fastcompany.com/91462416/leaders-prepare-organization-2026-ai</link>
      <pubDate>2026-01-05T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91462416/leaders-prepare-organization-2026-ai</guid>
      <description>Here&#8217;s a blueprint for staying ahead in a world that&#8217;s changing faster than ever.
2026 will be a crucial inflection point for businesses. The data are striking&#8212;the proportion of employees using AI in their role in the U.S. doubled between 2023 and 2025. Across the Atlantic, 30% of EU workers are already using AI in their jobs. And according to Gartner, by 2026 more than 100 million workers will collaborate with &#8220;robo-colleagues.&#8221;...</description>
    </item>
    <item>
      <title>Prise en main du Honor Magic 8 Lite : le smartphone increvable qui ne craint ni l&#8217;eau ni les chutes</title>
      <link>https://www.frandroid.com/marques/honor/2922339_prise-en-main-du-honor-magic-8-lite-le-smartphone-increvable-qui-ne-craint-ni-leau-ni-les-chutes</link>
      <pubDate>Mon, 05 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/honor/2922339_prise-en-main-du-honor-magic-8-lite-le-smartphone-increvable-qui-ne-craint-ni-leau-ni-les-chutes</guid>
      <description>
Honor renforce son offre de milieu de gamme, avec ce Magic 8 Lite, qui est d&#233;sormais totalement &#233;tanche et - surtout -  s'annonce beaucoup plus endurant, gr&#226;ce &#224; une batterie de tr&#232;s grande capacit&#233;.
</description>
    </item>
    <item>
      <title>Prise en main du Redmi Note 15 5G : Xiaomi veut un smartphone durable et pas cher</title>
      <link>https://www.frandroid.com/marques/2918381_prise-en-main-du-redmi-note-15-5g-xiaomi-veut-un-smartphone-durable-et-pas-cher</link>
      <pubDate>Mon, 05 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2918381_prise-en-main-du-redmi-note-15-5g-xiaomi-veut-un-smartphone-durable-et-pas-cher</guid>
      <description>
Xiaomi renouvelle son milieu de gamme phare avec le Redmi Note 15 5G. Au programme : une batterie utilisant une technologie Silicon-Carbone pour allier finesse et endurance, un &#233;cran AMOLED tr&#232;s lumineux et une promesse de durabilit&#233; logicielle &#233;tendue.
</description>
    </item>
    <item>
      <title>Flutterwave buys Nigeria&#8217;s Mono in rare African fintech exit</title>
      <link>https://techcrunch.com/2026/01/05/flutterwave-buys-nigerias-mono-in-rare-african-fintech-exit/</link>
      <pubDate>Mon, 05 Jan 2026 08:55:28 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3079500</guid>
      <description>Africa&#8217;s largest fintech company, Flutterwave, has acquired Nigerian open banking startup Mono in an all-stock deal valued between $25 million and $40 million, according to people familiar with the transaction. The acquisition brings together two of Africa&#8217;s leading fintech infrastructure companies. Flutterwave operates one of the continent&#8217;s widest payments networks, while Mono, often described as [&#8230;]...</description>
    </item>
    <item>
      <title>What the post-quantum shift means for your security strategy</title>
      <link>https://www.techradar.com/pro/what-the-post-quantum-shift-means-for-your-security-strategy</link>
      <pubDate>Mon, 05 Jan 2026 08:43:21 +0000</pubDate>
      <guid isPermaLink="false">W4b5JCEfwyUuyqKApTwU3V</guid>
      <description>Quantum computing threatens today&#8217;s encryption. Why organizations must adopt hybrid, post-quantum TLS now.</description>
    </item>
    <item>
      <title>Samsung First Look: See the Galaxy Z TriFold up close in this CES 2026 video</title>
      <link>https://mashable.com/article/ces-2026-samsung-first-look-galaxy-z-trifold</link>
      <pubDate>Mon, 05 Jan 2026 08:32:29 +0000</pubDate>
      <guid isPermaLink="false">00yEasjCYRBMB9dmBxkUgg9</guid>
      <description>The Samsung Galaxy Z TriFold doesn't have a U.S. release date, but Mashable went hands-on with the device at CES 2026.</description>
    </item>
  </channel>
</rss>
