<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 11 Feb 2026 08:56:17 GMT</lastBuildDate>
    <item>
      <title>Toyota prouve qu&#8217;il croit enfin &#224; la voiture &#233;lectrique avec ce nouveau SUV (mais il y a un gros b&#233;mol pour la France)</title>
      <link>https://www.frandroid.com/marques/toyota/2973181_toyota-prouve-quil-croit-enfin-a-la-voiture-electrique-avec-ce-nouveau-suv-mais-il-y-a-un-gros-bemol-pour-la-france</link>
      <pubDate>Wed, 11 Feb 2026 08:43:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/toyota/2973181_toyota-prouve-quil-croit-enfin-a-la-voiture-electrique-avec-ce-nouveau-suv-mais-il-y-a-un-gros-bemol-pour-la-france</guid>
      <description>
La voiture &#233;lectrique semble enfin trouver gr&#226;ce aux yeux de Toyota. Le constructeur japonais l&#232;ve le voile sur son Highlander, qui s&#8217;offre une toute nouvelle g&#233;n&#233;ration pr&#233;vue pour 2027, mais (pour le moment) r&#233;serv&#233;e aux &#201;tats-Unis.
</description>
    </item>
    <item>
      <title>Android&#160;17 arrive &#171;&#8201;bient&#244;t&#8201;&#187; en version b&#234;ta</title>
      <link>https://www.frandroid.com/marques/google/2973243_android-17-arrive-bientot-en-version-beta</link>
      <pubDate>Wed, 11 Feb 2026 08:42:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2973243_android-17-arrive-bientot-en-version-beta</guid>
      <description>
Android&#160;16 n&#8217;a m&#234;me pas un an que Google pense d&#233;j&#224; &#224; l&#8217;avenir. Le g&#233;ant de la recherche a annonc&#233; que les premi&#232;res versions b&#234;ta du nouveau syst&#232;me arriveraient &#171; bient&#244;t &#187;.
</description>
    </item>
    <item>
      <title>Ils vendent plus mais gagnent beaucoup moins : l&#8217;ann&#233;e tr&#232;s contrast&#233;e du g&#233;ant Shimano</title>
      <link>https://www.frandroid.com/marques/shimano/2973265_ils-vendent-plus-mais-gagnent-beaucoup-moins-lannee-tres-contrastee-du-geant-shimano</link>
      <pubDate>Wed, 11 Feb 2026 08:39:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/shimano/2973265_ils-vendent-plus-mais-gagnent-beaucoup-moins-lannee-tres-contrastee-du-geant-shimano</guid>
      <description>
Leader mondial des transmissions et syst&#232;mes de freinage pour v&#233;los, Shimano a publi&#233; des r&#233;sultats 2025 en l&#233;g&#232;re croissance en chiffre d&#8217;affaires, mais marqu&#233;s par un net recul de son b&#233;n&#233;fice net dans un contexte de march&#233;s r&#233;gionaux contrast&#233;s.
</description>
    </item>
    <item>
      <title>Ces 6 failles Windows sont exploit&#233;es dans des cyberattaques, installez la mise &#224; jour de Microsoft</title>
      <link>https://www.01net.com/actualites/ces-6-failles-windows-sont-exploitees-dans-des-cyberattaques-installez-la-mise-a-jour-de-microsoft.html</link>
      <pubDate>Wed, 11 Feb 2026 08:22:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325265</guid>
      <description>Microsoft vient de colmater 58 vuln&#233;rabilit&#233;s d&#233;busqu&#233;es dans le code de Windows. Six de ces failles sont activement exploit&#233;es par des cybercriminels pour d&#233;tourner les fonctions de s&#233;curit&#233; du syst&#232;me d'exploitation.</description>
    </item>
    <item>
      <title>Zendure SolarFlow 2400 Pro et AC+ : tout savoir sur les nouvelles batteries solaires</title>
      <link>https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2972221_zendure-solarflow-2400-pro-et-ac-tout-savoir-sur-les-nouvelles-batteries-solaires</link>
      <pubDate>Wed, 11 Feb 2026 08:17:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2972221_zendure-solarflow-2400-pro-et-ac-tout-savoir-sur-les-nouvelles-batteries-solaires</guid>
      <description>
On a fait 12 000 km pour voir o&#249; sont n&#233;es vos prochaines batteries. On &#233;tait chez Zendure, en Chine &#224; Shenzhen, pour le lancement de la nouvelle gamme SolarFlow : 2400 Pro, 2400 AC+ et 1600 AC+. 
</description>
    </item>
    <item>
      <title>10 millions de dollars pour 30 secondes : Dreame a cass&#233; sa tirelire pour pr&#233;senter sa voiture &#233;lectrique de 1 800 ch</title>
      <link>https://www.frandroid.com/marques/dreame/2973153_10-millions-de-dollars-pour-30-secondes-dreame-a-casse-sa-tirelire-pour-presenter-sa-voiture-electrique-de-1-800-ch</link>
      <pubDate>Wed, 11 Feb 2026 08:10:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dreame/2973153_10-millions-de-dollars-pour-30-secondes-dreame-a-casse-sa-tirelire-pour-presenter-sa-voiture-electrique-de-1-800-ch</guid>
      <description>
Dreame, sp&#233;cialis&#233;e dans les aspirateurs et autres produits &#233;lectrom&#233;nagers, a fait sensation lors du Super Bowl LX. L&#8217;entreprise chinoise y a diffus&#233; une publicit&#233; pour sa nouvelle supercar &#233;lectrique, la Nebula Next 01.
</description>
    </item>
    <item>
      <title>Pens&#233;e pour les sportifs, la montre connect&#233;e Polar Grit X2 s&#232;me d&#233;j&#224; 80 &#8364; de son prix</title>
      <link>https://www.frandroid.com/bons-plans/2972563_pensee-pour-les-sportifs-la-montre-connectee-polar-grit-x2-seme-80-e-de-son-prix</link>
      <pubDate>Wed, 11 Feb 2026 08:05:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2972563_pensee-pour-les-sportifs-la-montre-connectee-polar-grit-x2-seme-80-e-de-son-prix</guid>
      <description>
Si elle se d&#233;marque par un design &#233;l&#233;gant et un &#233;cran Amoled de 1,28 pouce, les d&#233;fauts de la Polar Grit X2 ne peuvent pas &#234;tre ignor&#233;s. Toutefois, ils sont att&#233;nu&#233;s par cette promotion de presque 17 % qui fait tomber son prix &#224; 399 euros chez Alltricks.
</description>
    </item>
    <item>
      <title>Pour &#233;teindre l&#8217;incendie, Discord assure que la v&#233;rification de l&#8217;&#226;ge ne s&#8217;appliquera pas &#224; la majorit&#233; des utilisateurs</title>
      <link>https://www.01net.com/actualites/pour-eteindre-lincendie-discord-assure-que-la-verification-de-lage-ne-sappliquera-pas-a-la-majorite-des-utilisateurs.html</link>
      <pubDate>Wed, 11 Feb 2026 08:01:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325256</guid>
      <description>La mise en place d'un syst&#232;me de v&#233;rification de l'&#226;ge sur Discord a provoqu&#233; une bel incendie que la plateforme tente maintenant d'&#233;teindre avec une &#171; clarification&#160;&#187; de la mesure. Trop peu, trop tard ?</description>
    </item>
    <item>
      <title>The best smart plugs in 2026</title>
      <link>https://www.engadget.com/home/smart-home/best-smart-plug-131542429.html?src=rss</link>
      <pubDate>Wed, 11 Feb 2026 08:00:36 +0000</pubDate>
      <guid isPermaLink="false">8cfaceb8-8bf5-462c-b201-c1b14f426a70</guid>
      <description>Smart plugs aren&#8217;t the most complicated smart home device &#8212; they really just turn stuff off and on &#8212; but they do make life a little easier. Since using smart plugs, I&#8217;ve grown accustomed to having the living room lamps click on just before sunset and go off when I say goodnight to Alexa or the Google Assistant/Gemini (Siri can turn off a few of my lights, but isn&#8217;t compatible with all of them). Most smart home device makers have a plug or two in their lineups, but finding one that&#8217;s compatible with your chosen ecosystem, that&#8217;s easy to set up and reliably connects can involve a little trial an...</description>
    </item>
    <item>
      <title>La voiture &#233;lectrique de Cupra produite en Chine &#233;chappe aux droits de douane : pourquoi &#231;a ne devrait rien changer pour vous</title>
      <link>https://www.frandroid.com/marques/cupra/2973139_la-voiture-electrique-de-cupra-produite-en-chine-echappe-aux-droits-de-douane-pourquoi-ca-ne-devrait-rien-changer-pour-vous</link>
      <pubDate>Wed, 11 Feb 2026 07:48:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/cupra/2973139_la-voiture-electrique-de-cupra-produite-en-chine-echappe-aux-droits-de-douane-pourquoi-ca-ne-devrait-rien-changer-pour-vous</guid>
      <description>
C&#8217;est officiel, le Cupra Tavascan est finalement exempt&#233; de droits de douane en Europe, malgr&#233; sa production en Chine. Toutefois, le prix de la voiture &#233;lectrique ne devrait pas baisser pour autant pour les clients.
</description>
    </item>
    <item>
      <title>Windows 11&#160;: Microsoft d&#233;ploie une mise &#224; jour que personne ne peut installer</title>
      <link>https://www.01net.com/actualites/windows-11-microsoft-deploie-une-mise-a-jour-que-personne-ne-peut-installer.html</link>
      <pubDate>Wed, 11 Feb 2026 07:43:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325268</guid>
      <description>Microsoft a profit&#233; du d&#233;ploiement de son Patch Tuesday de f&#233;vrier pour lancer une nouvelle version de son syst&#232;me d&#8217;exploitation. Windows 11 26H1 est l&#224;, mais il n'existe officiellement aucun PC capable de l'installer.</description>
    </item>
    <item>
      <title>Google facilite la suppression d&#8217;informations personnelles et d&#8217;images explicites de ses r&#233;sultats</title>
      <link>https://www.01net.com/actualites/google-facilite-la-suppression-dinformations-personnelles-et-dimages-explicites-de-ses-resultats.html</link>
      <pubDate>Wed, 11 Feb 2026 07:30:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325249</guid>
      <description>Personne n'aime trouver des images indiscr&#232;tes (ou pire encore, g&#233;n&#233;r&#233;es par IA) de soi sur Google, voire des informations confidentielles qui n'ont pas &#224; &#234;tre au su et au vu de tous. Le g&#233;ant du web a renforc&#233; ses outils permettant aux internautes de demander le retrait de ces documents des r&#233;sultats d'une recherche.</description>
    </item>
    <item>
      <title>Discord affirme que &#171;&#8201;la grande majorit&#233; des utilisateurs&#8201;&#187; &#233;chappera &#224; la v&#233;rification de l&#8217;&#226;ge</title>
      <link>https://www.frandroid.com/android/applications/2973171_discord-affirme-que-la-grande-majorite-des-utilisateurs-echappera-a-la-verification-de-lage</link>
      <pubDate>Wed, 11 Feb 2026 07:27:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/applications/2973171_discord-affirme-que-la-grande-majorite-des-utilisateurs-echappera-a-la-verification-de-lage</guid>
      <description>
Pris dans une pol&#233;mique sur la v&#233;rification de l&#8217;&#226;ge de ses utilisateurs et utilisatrices, Discord tente de calmer le jeu en expliquant que cela ne touchera pas grand monde.
</description>
    </item>
    <item>
      <title>Renault lance enfin sa Twingo &#233;lectrique &#224; moins de 20 000 &#8364; : voici ce qu&#8217;on perd &#224; ce prix</title>
      <link>https://www.frandroid.com/marques/renault/2973147_renault-lance-enfin-sa-twingo-electrique-a-moins-de-20-000-e-voici-ce-quon-perd-a-ce-prix</link>
      <pubDate>Wed, 11 Feb 2026 07:16:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2973147_renault-lance-enfin-sa-twingo-electrique-a-moins-de-20-000-e-voici-ce-quon-perd-a-ce-prix</guid>
      <description>
Quelques semaines apr&#232;s la version la mieux &#233;quip&#233;e, la Renault Twingo E-Tech "premier prix" ouvre ses commandes. De quoi officiellement pouvoir profiter de la version &#224; moins de 20 000 &#8364; (hors bonus) de cette petite voiture &#233;lectrique.
</description>
    </item>
    <item>
      <title>Mi-air fryer, mi-multicuiseur, le nouveau Moulinex Cookeo Infinity est d&#233;j&#224; en promo (mais &#231;a ne va pas durer)</title>
      <link>https://www.frandroid.com/bons-plans/2972637_mi-air-fryer-mi-multicuiseur-le-nouveau-moulinex-cookeo-infinity-est-deja-en-promo-mais-ca-ne-va-pas-durer</link>
      <pubDate>Wed, 11 Feb 2026 07:16:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2972637_mi-air-fryer-mi-multicuiseur-le-nouveau-moulinex-cookeo-infinity-est-deja-en-promo-mais-ca-ne-va-pas-durer</guid>
      <description>
Dot&#233; d'une fonction air fryer et de tr&#232;s nombreux modes de cuisson, le Moulinex Cookeo Infinity est le multicuiseur ultime que celles et ceux qui n&#8217;ont pas le temps de cuisiner au quotidien pourraient bien s'arracher. Ce mercredi seulement, Rakuten le propose en plus &#224; 419,99 euros au lieu de 449,99 euros.
</description>
    </item>
    <item>
      <title>Samsung to hold its Galaxy S26 event on February 25</title>
      <link>https://techcrunch.com/2026/02/10/samsung-to-hold-its-galaxy-s26-event-on-february-25/</link>
      <pubDate>Wed, 11 Feb 2026 07:06:44 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3091848</guid>
      <description>Samsung is going to launch S26 lineup just before Mobile World Congress (MWC).</description>
    </item>
    <item>
      <title>Amazon teste discr&#232;tement Alexa+ en France</title>
      <link>https://www.01net.com/actualites/amazon-teste-discretement-alexa-en-france.html</link>
      <pubDate>Wed, 11 Feb 2026 07:01:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325245</guid>
      <description>Amazon a d&#233;ploy&#233; d&#233;but f&#233;vrier Alexa+, la version dop&#233;e &#224; l'IA g&#233;n&#233;rative de l'assistant&#8230; mais uniquement aux &#201;tats-Unis. Ce qui pose la question de savoir quand cette nouveaut&#233; sortira en France. Surprise : c'est d&#233;j&#224; le cas, mais aupr&#232;s d'une poign&#233;e d'utilisateurs dans le cadre d'un test. Amazon a pr&#233;cis&#233; &#224; 01net qu'il n'y avait aucune date pr&#233;cise pour le lancement grand public....</description>
    </item>
  </channel>
</rss>
