<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 23 Jan 2026 14:30:12 GMT</lastBuildDate>
    <item>
      <title>Gemini peut d&#233;sormais vraiment vous aider &#224; r&#233;viser le bac</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2953351_gemini-peut-desormais-vraiment-vous-aider-a-reviser-le-bac</link>
      <pubDate>Fri, 23 Jan 2026 14:26:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2953351_gemini-peut-desormais-vraiment-vous-aider-a-reviser-le-bac</guid>
      <description>
Google n'en finit plus d'ajouter des fonctions &#224; son IA Gemini. Bien consciente que ChatGPT est tr&#232;s utilis&#233; pour les r&#233;visions, la firme propose d&#233;sormais un mode sp&#233;cial pour Gemini.
</description>
    </item>
    <item>
      <title>Le Tesla Model Y vient de s&#8217;am&#233;liorer : voici ce qui change (et ce qu&#8217;il manque encore)</title>
      <link>https://www.frandroid.com/marques/tesla/2953415_le-tesla-model-y-vient-de-sameliorer-voici-ce-qui-change-et-ce-quil-manque-encore</link>
      <pubDate>Fri, 23 Jan 2026 14:22:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2953415_le-tesla-model-y-vient-de-sameliorer-voici-ce-qui-change-et-ce-quil-manque-encore</guid>
      <description>
Ce n'&#233;tait qu'une question de temps : apr&#232;s la Chine et les &#201;tats-Unis, le Tesla Model Y s'am&#233;liore subtilement en Europe, notamment en qualit&#233; per&#231;ue. Dommage : les versions 7 places et les nouvelles batteries, dont l'arriv&#233;e semble imminente, manquent &#224; l'appel.
</description>
    </item>
    <item>
      <title>Soldes montres connect&#233;es : les 14 promotions pour &#234;tre &#224; l&#8217;heure &#224; ses s&#233;ances de sport ! Voici notre top des meilleurs bons plans</title>
      <link>https://www.frandroid.com/bons-plans/2937331_soldes-montres-connectees-les-14-promotions-pour-etre-a-lheure-a-ses-seances-de-sport-voici-notre-top-des-meilleurs-bons-plans</link>
      <pubDate>Fri, 23 Jan 2026 14:19:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2937331_soldes-montres-connectees-les-14-promotions-pour-etre-a-lheure-a-ses-seances-de-sport-voici-notre-top-des-meilleurs-bons-plans</guid>
      <description>
Les soldes d'hiver permettent de faire de bonnes affaires sur de nombreux produits Tech, dont les montres connect&#233;es ! Ces accessoires lifestyle &amp; sport profitent eux aussi d&#8217;une vague de promotions : voici les offres &#224; retenir.  
</description>
    </item>
    <item>
      <title>Apple pourrait d&#233;voiler tr&#232;s rapidement de nouveaux MacBook Pro</title>
      <link>https://www.01net.com/actualites/apple-pourrait-devoiler-tres-rapidement-de-nouveaux-macbook-pro.html</link>
      <pubDate>Fri, 23 Jan 2026 14:15:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322197</guid>
      <description>Apple pr&#233;pare tr&#232;s certainement de nouveaux MacBook Pro. Le constructeur organise non pas une keynote, mais une &#171;&#160;Apple Experience &#187; la semaine prochaine, durant laquelle seront convi&#233;s des cr&#233;ateurs. Un moment id&#233;al pour leur pr&#233;senter le nouvel abonnement Creator Studio&#8230; et pourquoi pas des portables in&#233;dits.</description>
    </item>
    <item>
      <title>Le Galaxy S26 Ultra pourrait bien signer l&#8217;arr&#234;t de mort des protections d&#8217;&#233;cran</title>
      <link>https://www.frandroid.com/marques/samsung/2953359_le-galaxy-s26-ultra-pourrait-bien-signer-larret-de-mort-des-protections-decran</link>
      <pubDate>Fri, 23 Jan 2026 14:14:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2953359_le-galaxy-s26-ultra-pourrait-bien-signer-larret-de-mort-des-protections-decran</guid>
      <description>
Vous faites partie de ceux qui passent dix minutes &#224; chasser la moindre bulle d'air sous un film plastique hors de prix ? Samsung pourrait bient&#244;t rendre ce rituel obsol&#232;te avec le Galaxy S26 Ultra, dont les nouvelles technologies d'affichage promettent d&#8217;&#233;nerver les fabricants d'accessoires.
</description>
    </item>
    <item>
      <title>One Familiar Face Isn&#8217;t Back for &#8216;The Mummy 4&#8217; Yet</title>
      <link>https://gizmodo.com/the-mummy-4-oded-fehr-ardeth-bay-2000713209</link>
      <pubDate>Fri, 23 Jan 2026 14:00:32 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000713209</guid>
      <description>Plus, somehow 'Primitive War' returned, and is bringing 'secret Cold War agendas' with it.</description>
    </item>
    <item>
      <title>Comment transf&#233;rer une eSIM entre deux smartphones ?</title>
      <link>https://www.frandroid.com/telecom/2733813_transfert-desim-voici-le-guide-pour-transferer-facilement-une-sim-virtuelle-entre-deux-smartphones</link>
      <pubDate>Fri, 23 Jan 2026 14:00:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2733813_transfert-desim-voici-le-guide-pour-transferer-facilement-une-sim-virtuelle-entre-deux-smartphones</guid>
      <description>
L'eSIM est aujourd'hui disponible aupr&#232;s des quatre grands op&#233;rateurs et de quelques op&#233;rateurs virtuels. Si elle est pratique &#224; installer, son transfert d'un smartphone &#224; l'autre n'est pas forc&#233;ment &#233;vident. La d&#233;marche n'est pourtant pas compliqu&#233;e une fois qu'on la conna&#238;t, d'o&#249; ce guide.
</description>
    </item>
    <item>
      <title>The Best Paper Notebooks and Journals, Tested and Reviewed (2026): Leuchttherm, Midori, Field Notes</title>
      <link>https://www.wired.com/gallery/the-best-paper-notebook-and-journals/</link>
      <pubDate>Fri, 23 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">66c37ae6bfbc1f252e6030c1</guid>
      <description>Celebrate National Handwriting Day (I did not make that up) with new notebooks, a journal, or sketchbooks.</description>
    </item>
    <item>
      <title>Spartacus: House of Ashur episode 8 reveals the most distressing gladiator death in the Starz show to date &#8212; and its cast 'felt completely shaken' after filming</title>
      <link>https://www.techradar.com/streaming/entertainment/spartacus-house-of-ashur-episode-8-interview</link>
      <pubDate>Fri, 23 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">SuUp2TzkGuQHRmnsWLPr7c</guid>
      <description>The final scene of a Spartacus: House of Ashur episode is always a shocker, but episode 8 is the most deeply upsetting yet... even for its cast.</description>
    </item>
    <item>
      <title>What is the release date for A Knight of the Seven Kingdoms episode 2 on HBO Max?</title>
      <link>https://www.techradar.com/streaming/hbo-max/what-is-the-release-date-for-a-knight-of-the-seven-kingdoms-episode-2-on-hbo-max</link>
      <pubDate>Fri, 23 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">qJNic2xGRJia56wdRSTSwh</guid>
      <description>Find out when and where you can watch episode 2 of A Knight of the Seven Kingdoms.</description>
    </item>
    <item>
      <title>Samsung Bespoke Fridge with AI review: All the bells and whistles</title>
      <link>https://www.engadget.com/home/kitchen-tech/samsung-bespoke-fridge-with-ai-review-all-the-bells-and-whistles-140000099.html?src=rss</link>
      <pubDate>Fri, 23 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">1511d80f-6cd2-4573-bcf8-da54b7c99e56</guid>
      <description>At their core, refrigerators are relatively simple devices. If you're the type of person to view every extra feature as a component that could potentially go wrong, basic iceboxes are probably the kind you go for. But for those on the other end of the spectrum, Samsung's latest Bespoke Refrigerators with AI inside have more bells and whistles than you might think possible &#8212; including an optional 32-inch screen.
Editor's note: The model we tested for this review came out in the second half of 2025 and will continue to be on sale throughout 2026. Hardware will remain the same, the only changes w...</description>
    </item>
    <item>
      <title>Ring can now verify if a video has been altered</title>
      <link>https://www.engadget.com/home/smart-home/ring-can-now-verify-if-a-video-has-been-altered-140000140.html?src=rss</link>
      <pubDate>Fri, 23 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">9d4563e0-3185-47a5-a9a4-8c4221e5d167</guid>
      <description>Ring has launched a new tool that can tell you if a video clip captured by its camera has been altered or not. The company says that every video downloaded from Ring starting in December 2025 going forward will come with a digital security seal. &#8220;Think of it like the tamper-evident seal on a medicine bottle,&#8221; it explained. Its new tool, called Ring Verify, can tell you if a video has been altered in any way. Even adjusting a video clip&#8217;s brightness or trimming a few seconds off will break that seal, and the tool will tell you that it cannot be verified. All you have to do is visit the tool&#8217;s w...</description>
    </item>
    <item>
      <title>Professor Reports That OpenAI Deleted His Work, World Laughs in His Face</title>
      <link>https://gizmodo.com/professor-reports-that-openai-deleted-his-work-world-laughs-in-his-face-2000713196</link>
      <pubDate>Fri, 23 Jan 2026 13:55:24 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000713196</guid>
      <description>"Amazing sob story: 'ChatGPT deleted all the work I hadn't done.'"</description>
    </item>
    <item>
      <title>TurboTax Deluxe is on sale for only $45 ahead of tax season</title>
      <link>https://www.engadget.com/deals/turbotax-deluxe-is-on-sale-for-only-45-ahead-of-tax-season-204848111.html?src=rss</link>
      <pubDate>Fri, 23 Jan 2026 13:46:27 +0000</pubDate>
      <guid isPermaLink="false">8d4b28c6-34f1-44bb-800a-eec732a96ded</guid>
      <description>With the spring approaching, it's time to start thinking about how you'll file your taxes. Unfortunately, with the recent demise of Direct File, there isn't a free, government-provided alternative to TurboTax in 2026, and you'll need to look to other federal programs, including IRS Free File, to file your paperwork. If you don't qualify for Free File, chances are you'll need to dish out cash for Intuit's software. And while we hate to suggest you give money to a company that has spent decades lobbying to ensure America's tax system remains a nightmare, we can at least save you some money if Tu...</description>
    </item>
    <item>
      <title>Il est encore temps d&#8217;acheter un puissant laptop sous RTX 5070 + 32 Go de RAM &#224; bon prix pendant les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2804861_il-est-encore-temps-dacheter-un-puissant-laptop-sous-rtx-5070-32-go-de-ram-a-bon-prix-pendant-les-soldes</link>
      <pubDate>Fri, 23 Jan 2026 13:44:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2804861_il-est-encore-temps-dacheter-un-puissant-laptop-sous-rtx-5070-32-go-de-ram-a-bon-prix-pendant-les-soldes</guid>
      <description>
En ce moment, vous avez le PC portable gaming Lenovo Legion 5 15IRX10 pour 1 299,99 euros alors qu'il &#233;tait propos&#233; &#224; 1 799,99 euros &#224; sa sortie. Il y a d&#233;j&#224; eu moins cher, mais &#231;a reste un tr&#232;s bon prix compte tenu de la p&#233;nurie des composants. 
</description>
    </item>
    <item>
      <title>Coup dur pour Asus : le fabricant forc&#233; de r&#233;agir apr&#232;s des d&#233;faillances critiques sur le 9800X3D</title>
      <link>https://www.frandroid.com/marques/asus/2953353_coup-dur-pour-asus-le-fabricant-force-de-reagir-apres-des-defaillances-critiques-sur-le-9800x3d</link>
      <pubDate>Fri, 23 Jan 2026 13:43:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/asus/2953353_coup-dur-pour-asus-le-fabricant-force-de-reagir-apres-des-defaillances-critiques-sur-le-9800x3d</guid>
      <description>
Asus lance une enqu&#234;te interne sur ses cartes m&#232;res haut de gamme alors que de nombreux utilisateurs ont &#233;t&#233; victimes d'instabilit&#233;s avec le processeur 9800X3D de chez AMD.
</description>
    </item>
    <item>
      <title>The Best Over-the-Counter Sleep Aids (2026), Tested and Reviewed</title>
      <link>https://www.wired.com/gallery/best-over-the-counter-sleep-aids/</link>
      <pubDate>Fri, 23 Jan 2026 13:31:00 +0000</pubDate>
      <guid isPermaLink="false">66db752b667dbf063f229510</guid>
      <description>I tested an array of alternative sleep aids, from gummies to wearable patches, to see if they would help my chronic insomnia.</description>
    </item>
    <item>
      <title>INTC stock is plunging today despite Intel earnings that beat Wall Street expectations. Here are 2 reasons why</title>
      <link>https://www.fastcompany.com/91479999/intc-intel-stock-price-plunges-today-despite-q4-2025-earnings-beat-2-reasons-why</link>
      <pubDate>2026-01-23T13:15:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91479999/intc-intel-stock-price-plunges-today-despite-q4-2025-earnings-beat-2-reasons-why</guid>
      <description>Shares are down more than 13% in pre-market trading on Friday. What&#8217;s spooking investors?
Shares in Intel Corporation (Nasdaq: INTC) are plunging in pre-market trading this morning. The stock price fall comes after the chipmaker reported its Q4 2025 earnings after the closing bell yesterday. But it&#8217;s Intel&#8217;s forecast, rather than its latest results, that seems to be driving the stock price&#8217;s fall. Here&#8217;s what you need to know....</description>
    </item>
    <item>
      <title>Apple's AirPods Pro 3 drop back down to a record-low price</title>
      <link>https://www.engadget.com/deals/apples-airpods-pro-3-drop-back-down-to-a-record-low-price-140752588.html?src=rss</link>
      <pubDate>Fri, 23 Jan 2026 13:14:56 +0000</pubDate>
      <guid isPermaLink="false">de5cb579-515c-483f-bc51-396db9990b07</guid>
      <description>AirPods Pro 3 have returned to an all-time-low price. You can pick them up for $200 right now, which is $50 off and the best discount we've seen since the earbuds came out at the end of last year.
We gave these AirPods a score of 90 out of 100 in our review and we consider them the best wireless earbuds for iPhone users. The third generation model is a substantial update to an already impressive product, bringing new features like live translation to the table. 


The AirPods Pro 3 also offer heart-rate tracking, allowing them to stream live data to Apple Fitness and other third-party workout ...</description>
    </item>
    <item>
      <title>Google Photos d&#233;ploie ses nouveaux stickers&#8230; en priorit&#233; sur iPhone plut&#244;t que sur Android</title>
      <link>https://www.frandroid.com/android/applications/google-apps/2953097_google-photos-deploie-ses-nouveaux-stickers-en-priorite-sur-iphone-plutot-que-sur-android</link>
      <pubDate>Fri, 23 Jan 2026 13:12:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/applications/google-apps/2953097_google-photos-deploie-ses-nouveaux-stickers-en-priorite-sur-iphone-plutot-que-sur-android</guid>
      <description>
Google Photos propose d&#233;sormais un dossier de stickers personnalis&#233;s dans l&#8217;onglet Collections, mais uniquement sur iOS. Selon Google, Android y aura droit plus tard.
</description>
    </item>
    <item>
      <title>&#8216;We think it&#8217;s vitally important to be transparent with listeners and fair to artists&#8217;: Deezer says viral &#8216;singer&#8217; Sienna Rose, with millions of Spotify streams, is an AI fake</title>
      <link>https://www.techradar.com/audio/audio-streaming/we-think-its-vitally-important-to-be-transparent-with-listeners-and-fair-to-artists-deezer-says-viral-singer-sienna-rose-with-millions-of-spotify-streams-is-an-ai-fake</link>
      <pubDate>Fri, 23 Jan 2026 13:10:23 +0000</pubDate>
      <guid isPermaLink="false">3Cc2U2zSK6GrfCpdtbCbb8</guid>
      <description>'Singer' Sienna Rose is riding the Spotify charts, but her entire act is an AI-generated fa&#231;ade.</description>
    </item>
    <item>
      <title>Engadget Podcast: Why would Apple want to make an AI pin?</title>
      <link>https://www.engadget.com/ai/engadget-podcast-why-would-apple-want-to-make-an-ai-pin-130732754.html?src=rss</link>
      <pubDate>Fri, 23 Jan 2026 13:07:32 +0000</pubDate>
      <guid isPermaLink="false">f69b37ef-2fc2-476c-9c75-96cba9a59b0e</guid>
      <description>Apple is reportedly working on an AI pin of its very own to compete with OpenAI's non-existent pin. No, it doesn't really make much sense to us, either. In this episode, Devindra and Engadget Managing Editor Cherlynn Low discuss why Apple might be quick to jump on the AI pin trend, even before it jumps into smart rings. Also, we dive into Sony&#8217;s Bravia TV deal with TCL, and the aftermath of Verizon&#8217;s massive service outage.Subscribe!iTunesSpotifyPocket CastsStitcherGoogle PodcastsTopicsTCL is taking over Sony&#8217;s Bravia TV business in a new joint venture &#8211; 0:58Last week&#8217;s Verizon outage was reso...</description>
    </item>
    <item>
      <title>Microsoft Teams will soon warn you about possible brand spoof calls</title>
      <link>https://www.techradar.com/pro/microsoft-teams-will-soon-warn-you-about-possible-brand-spoof-calls</link>
      <pubDate>Fri, 23 Jan 2026 13:05:00 +0000</pubDate>
      <guid isPermaLink="false">XpXxT8ULBc9QvsVBaufsWg</guid>
      <description>Microsoft Teams will now scan first-time external callers for any signs of brand impersonation.</description>
    </item>
    <item>
      <title>Beast of Reincarnation director says Game Freak's priority is delivering a quality 'gameplay experience' rather than graphical fidelity &#8212; but the game still certainly appears to be a visual upgrade compared to Pok&#233;mon</title>
      <link>https://www.techradar.com/gaming/beast-of-reincarnation-director-says-game-freaks-priority-is-delivering-a-quality-gameplay-experience-rather-than-graphical-fidelity-but-the-game-still-certainly-appears-to-be-a-visual-upgrade-compared-to-pokemon</link>
      <pubDate>Fri, 23 Jan 2026 13:04:08 +0000</pubDate>
      <guid isPermaLink="false">kGdMsqvhUu2aDFMJqztUg</guid>
      <description>Beast of Reincarnation game director Kota Furushima has said Game Freak is more focused on delivering on the gameplay experience rather than graphical fidelity.</description>
    </item>
    <item>
      <title>CD Projekt Red's The Witcher 4 may be up there with GTA 6 in rumored production costs</title>
      <link>https://www.techradar.com/gaming/cd-projekt-reds-the-witcher-4-may-be-up-there-with-gta-6-in-rumored-production-costs</link>
      <pubDate>Fri, 23 Jan 2026 13:03:20 +0000</pubDate>
      <guid isPermaLink="false">jqvnC8qLFfA9CVJKhRDfJ3</guid>
      <description>CD Projekt Red's The Witcher 4 seemingly has a huge budget behind it.</description>
    </item>
    <item>
      <title>&#8216;A Knight of the Seven Kingdoms&#8217; Notched a Solid Ratings Debut</title>
      <link>https://gizmodo.com/a-knight-of-the-seven-kingdoms-notched-a-solid-ratings-debut-2000713173</link>
      <pubDate>Fri, 23 Jan 2026 13:00:24 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000713173</guid>
      <description>The HBO 'Game of Thrones' spin-off pulled in nearly seven million viewers across its first three days.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs &#233;couteurs sans fil en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guide-audio/482350_quels-sont-les-meilleurs-ecouteurs-true-wireless-a-moins-de-200-euros-en-2018</link>
      <pubDate>Fri, 23 Jan 2026 13:00:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-audio/482350_quels-sont-les-meilleurs-ecouteurs-true-wireless-a-moins-de-200-euros-en-2018</guid>
      <description>
Les &#233;couteurs sans fil Bluetooth se sont impos&#233;s comme des accessoires essentiels au quotidien, tant pour la musique que pour les appels ou le sport. Nous avons s&#233;lectionn&#233; et test&#233; pour vous les meilleurs mod&#232;les d'&#233;couteurs sans fil les plus adapt&#233;s &#224; vos besoins et &#224; votre budget.
</description>
    </item>
    <item>
      <title>Lenovo LOQ 15 Review: The Best Gaming Laptop Under $1,000</title>
      <link>https://www.wired.com/review/lenovo-loq-15/</link>
      <pubDate>Fri, 23 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">6969772365b341ab43cc5842</guid>
      <description>It's rare to find a gaming laptop under $1,000 without any major compromises, but the Lenovo LOQ 15 surprises.</description>
    </item>
    <item>
      <title>TikTok seals deal forming new joint American venture with major investors</title>
      <link>https://www.fastcompany.com/91479993/tiktok-seals-deal-forming-new-joint-american-venture-major-investors</link>
      <pubDate>2026-01-23T12:59:37</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91479993/tiktok-seals-deal-forming-new-joint-american-venture-major-investors</guid>
      <description>The deal ends the threat of a ban for the popular platform used by millions of Americans.
TikTok has finalized a deal to create a new American entity, avoiding the looming threat of a ban in the United States that has been in discussion for years on the platform now used by more than 200 million Americans.The social video platform company signed agreements with major investors including Oracle, Silver Lake and the Emirati investment firm MGX to form the new TikTok U.S. joint venture. The new version will operate under &#8220;defined safeguards that protect national security through comprehensive dat...</description>
    </item>
    <item>
      <title>Jimmy Kimmel breaks down the FCCs latest threat to talk shows</title>
      <link>https://mashable.com/video/jimmy-kimmel-fcc-threats-brendan-carr-equal-time</link>
      <pubDate>Fri, 23 Jan 2026 12:59:27 +0000</pubDate>
      <guid isPermaLink="false">07ph5DBU6nD7MFuoXUh54fs</guid>
      <description>The FCC is once again coming for "Jimmy Kimmel Live!" with new threats around "equal time" rules for interviews with political candidates.</description>
    </item>
    <item>
      <title>Tesla discontinues Autopilot in bid to boost adoption of its Full Self-Driving software</title>
      <link>https://techcrunch.com/2026/01/23/tesla-discontinues-autopilot-in-bid-to-boost-adoption-of-its-full-self-driving-software/</link>
      <pubDate>Fri, 23 Jan 2026 12:56:44 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3085445</guid>
      <description>The company is also currently facing a 30-day suspension of its manufacturing and dealer licenses in California for deceptive marketing about Autopilot's capabilities.</description>
    </item>
    <item>
      <title>Crowdstrike and Nord Security partnership nests Falcon Go and Falcon Enterprise directly through NordLayer &#8211; combined enterprise-grade protection with VPN and ZTNA for SMBs</title>
      <link>https://www.techradar.com/pro/security/crowdstrike-and-nord-security-partnership-nests-falcon-go-and-falcon-enterprise-directly-through-nordlayer-combined-enterprise-grade-protection-with-vpn-and-ztna-for-smbs</link>
      <pubDate>Fri, 23 Jan 2026 12:54:13 +0000</pubDate>
      <guid isPermaLink="false">VLmbb652HS3Lmn9pByApAZ</guid>
      <description>CrowdStrike and Nord Security partner to bring enterprise-grade security to small and medium businesses.</description>
    </item>
    <item>
      <title>&#171;&#8201;Une chance inou&#239;e&#8201;&#187; : les astronomes ont vu l&#8217;avalanche qui d&#233;clenche les &#233;ruptions solaires, et bien plus encore !</title>
      <link>https://www.futura-sciences.com/sciences/actualites/eruption-solaire-une-chance-inouie-astronomes-ont-vu-avalanche-declenche-eruptions-solaires-bien-plus-encore-130477/#xtor%3DRSS-8</link>
      <pubDate>Fri, 23 Jan 2026 13:49:14 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/eruption-solaire-une-chance-inouie-astronomes-ont-vu-avalanche-declenche-eruptions-solaires-bien-plus-encore-130477/#xtor%3DRSS-8</guid>
      <description>Une temp&#234;te solaire a enflamm&#233; notre ciel en ce d&#233;but de semaine. Aujourd&#8217;hui, deux missions spatiales nous r&#233;v&#232;lent quelques-uns des secrets des col&#232;res du&#160;Soleil. Les avalanches magn&#233;tiques qui d&#233;clenchent ses &#233;ruptions. Et d&#8217;autres observations inattendues&#8230;</description>
    </item>
    <item>
      <title>The Morning After: Apple might be making its own AirTag-sized AI wearable</title>
      <link>https://www.engadget.com/general/the-morning-after-apple-might-be-making-its-own-airtag-sized-ai-wearable-121500060.html?src=rss</link>
      <pubDate>Fri, 23 Jan 2026 12:48:29 +0000</pubDate>
      <guid isPermaLink="false">dc14cd40-545e-4816-921c-61c6a8087d35</guid>
      <description>It&#8217;s been a while since rumors and reports suggested Apple is exploring a new divisive product category, and it&#8217;s been several years since the Apple car. Unfortunately, the new challenger is a wearable AI pin with cameras, mics and&#8230; zero interest from me.According to a report from The Information, it&#8217;ll resemble a slightly thicker AirTag with an aluminum and glass exterior. The report suggests it&#8217;ll have two cameras (standard and wide-angle) for photos and video. It may also have three microphones and a (swoon) physical button. I love a physical button.TMAAppleHow is Apple going to pitch it? W...</description>
    </item>
    <item>
      <title>Apple accuses Europe of 'delay tactics' following alternative app store collapse</title>
      <link>https://www.engadget.com/big-tech/apple-accuses-europe-of-delay-tactics-following-alternative-app-store-collapse-124701591.html?src=rss</link>
      <pubDate>Fri, 23 Jan 2026 12:47:01 +0000</pubDate>
      <guid isPermaLink="false">7cc91a59-c185-43e6-8299-6a9fbd09438e</guid>
      <description>Following the shutdown of an alternative app store, Apple has accused the European Commission (EC) of using &#8220;political delay tactics&#8221; as an excuse to probe and fine the company, Bloomberg reported. Apple issued the statement preemptively as commission is reportedly preparing to blame Apple for the shutdown of third-party app store Setapp due to what the developer called &#8220;still-evolving and complex business terms.&#8221;As part of an EU ruling, Apple was forced to allow third-party marketplaces for apps once the Digital Markets Act (DMA) took effect in 2024. Apple agreed to allow such stores, but imp...</description>
    </item>
    <item>
      <title>The deal to keep TikTok in the US is now finalized &#8211; here are 5 things you need to know</title>
      <link>https://www.techradar.com/computing/tiktok/the-deal-to-keep-tiktok-in-the-us-is-now-finalized-here-are-5-things-you-need-to-know</link>
      <pubDate>Fri, 23 Jan 2026 12:45:01 +0000</pubDate>
      <guid isPermaLink="false">AoM8DyYKv66iHYPtECCui8</guid>
      <description>A new US-led consortium is taking control of TikTok in the United States, but original owner ByteDance is still involved.</description>
    </item>
    <item>
      <title>Best Buy's Presidents' Day preview sale is live &#8212; here are 35 deals I'd buy on TVs, appliances, laptops and more</title>
      <link>https://www.techradar.com/seasonal-sales/best-buys-presidents-day-preview-sale-is-live-here-are-35-deals-id-buy-on-tvs-appliances-laptops-and-more</link>
      <pubDate>Fri, 23 Jan 2026 12:43:54 +0000</pubDate>
      <guid isPermaLink="false">kbzr3M9Mut8R2v4ZgyyLKG</guid>
      <description>Best Buy's weekend sale is like a Presidents' Day preview, and I'm rounding up 35 deals I recommend buying now, including appliances, TVs, laptops, Apple devices, and more.</description>
    </item>
    <item>
      <title>How to watch Spizzirri vs. Sinner online for free</title>
      <link>https://mashable.com/article/spizzirri-sinner-australian-open-2026-live-stream-for-free</link>
      <pubDate>Fri, 23 Jan 2026 12:41:27 +0000</pubDate>
      <guid isPermaLink="false">0640GPLunBWJK14fCd0V4nw</guid>
      <description>Watch Australian Open for free. Live stream Spizzirri vs. Sinner in the 2026 Australian Open online for free from anywhere in the world.</description>
    </item>
    <item>
      <title>I test vacuums for a living &#8211; these are the 3 best cheap stick vacuums you can buy</title>
      <link>https://www.techradar.com/home/vacuums/i-test-vacuums-for-a-living-these-are-the-3-best-cheap-stick-vacuums-you-can-buy</link>
      <pubDate>Fri, 23 Jan 2026 12:40:03 +0000</pubDate>
      <guid isPermaLink="false">mdrHanGVfdX49Jvg5AHGiZ</guid>
      <description>All of these vacuums deliver reliable, efficient cleaning without breaking the bank &#8211; with prices starting as low as &#163;169.99.</description>
    </item>
    <item>
      <title>Why you should treat your brand as an operating system</title>
      <link>https://www.fastcompany.com/91473272/why-you-should-treat-your-brand-as-an-operating-system-brand-strategy</link>
      <pubDate>2026-01-23T12:34:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91473272/why-you-should-treat-your-brand-as-an-operating-system-brand-strategy</guid>
      <description>In today&#8217;s environment, brand can&#8217;t just be a visual wrapper. It has to be something more fundamental.
For much of the modern corporate era, brand has been treated as surface area. A story told outward. A set of signals designed to persuade, attract, and differentiate. When companies spoke about brand, they were usually talking about perception: how they looked in the market, how they sounded, how they were received....</description>
    </item>
    <item>
      <title>Elon Musk Isn&#8217;t an Optimist, He&#8217;s a Salesman</title>
      <link>https://gizmodo.com/elon-musk-isnt-an-optimist-hes-a-salesman-2000713014</link>
      <pubDate>Fri, 23 Jan 2026 12:30:35 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000713014</guid>
      <description>At Davos, Musk sold a vision of himself that doesn't align with reality.</description>
    </item>
  </channel>
</rss>
