<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 31 Dec 2025 15:26:05 GMT</lastBuildDate>
    <item>
      <title>Boulanger liquide son stock du MacBook Air M2 pour le dernier jour de l&#8217;ann&#233;e : 699 &#8364; seulement</title>
      <link>https://www.frandroid.com/bons-plans/2904513_boulanger-liquide-son-stock-du-macbook-air-m2-pour-le-dernier-jour-de-lannee-699-seulement</link>
      <pubDate>Wed, 31 Dec 2025 15:22:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2904513_boulanger-liquide-son-stock-du-macbook-air-m2-pour-le-dernier-jour-de-lannee-699-seulement</guid>
      <description>
Sorti en 2022, le MacBook Air M2 reste une valeur s&#251;re pour celles et ceux qui cherchent un ordinateur portable &#224; la fois l&#233;ger, performant et endurant. Bonne nouvelle : ce mod&#232;le iconique voit son prix chuter &#224; seulement 699 euros chez Boulanger, un tarif in&#233;dit qui le rend plus tentant que jamais.
</description>
    </item>
    <item>
      <title>Oubliez les Ray-Ban Meta ? Lenovo pr&#233;pare des lunettes IA capables de traduire vos conversations en temps r&#233;el</title>
      <link>https://www.frandroid.com/marques/lenovo/2924503_oubliez-les-ray-ban-meta-lenovo-prepare-des-lunettes-ia-capables-de-traduire-vos-conversations-en-temps-reel</link>
      <pubDate>Wed, 31 Dec 2025 15:20:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lenovo/2924503_oubliez-les-ray-ban-meta-lenovo-prepare-des-lunettes-ia-capables-de-traduire-vos-conversations-en-temps-reel</guid>
      <description>
La marque chinoise Lenovo pr&#233;senterait bient&#244;t son concept de lunettes intelligentes. Voyons ce qu'elles permettraient de faire.
</description>
    </item>
    <item>
      <title>Le guide indispensable pour acheter une Peugeot 208 &#233;lectrique d&#8217;occasion sans risque</title>
      <link>https://www.frandroid.com/marques/peugeot/2772117_le-guide-indispensable-pour-acheter-une-peugeot-208-electrique-doccasion-sans-risque</link>
      <pubDate>Wed, 31 Dec 2025 15:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/peugeot/2772117_le-guide-indispensable-pour-acheter-une-peugeot-208-electrique-doccasion-sans-risque</guid>
      <description>
Pr&#233;sent&#233;e en 2019 et commercialis&#233;e en 2020, la Peugeot e-208 a rencontr&#233; un joli succ&#232;s commercial, de quoi voir cette petite voiture &#233;lectrique inonder les sites de petites annonces. Entre les diff&#233;rentes batteries, versions et prix, nous vous guidons pour choisir la meilleure Peugeot 208 &#233;lectrique d&#8217;occasion.
</description>
    </item>
    <item>
      <title>How to watch FIS Cross-Country World Cup 2025/26 for *FREE* &#8211; live streams, schedule</title>
      <link>https://www.techradar.com/how-to-watch/cricket/how-to-watch-fis-cross-country-world-cup-2025-26-for-free-live-streams-schedule</link>
      <pubDate>Wed, 31 Dec 2025 15:12:52 +0000</pubDate>
      <guid isPermaLink="false">oCh6BQFyPvruKh4VzxvQQW</guid>
      <description>All the ways to watch FIS Cross-Country World Cup 2025/26 live streams online for FREE, with hopes high for Johannes H&#248;sflot Kl&#230;bo and Jessie Diggins.</description>
    </item>
    <item>
      <title>The 8 high-precision 3D printers that really impressed us in 2025</title>
      <link>https://www.techradar.com/pro/the-8-high-precision-3d-printers-that-really-impressed-us-in-2025</link>
      <pubDate>Wed, 31 Dec 2025 15:06:35 +0000</pubDate>
      <guid isPermaLink="false">NAyczcJXPSQXCK9S4qMxiN</guid>
      <description>As hardware editor, I've picked out the most accurate 3D printers that stood out during all our tests</description>
    </item>
    <item>
      <title>Every fusion startup that has raised over $100M</title>
      <link>https://techcrunch.com/2025/12/31/every-fusion-startup-that-has-raised-over-100m/</link>
      <pubDate>Wed, 31 Dec 2025 15:05:21 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=2878248</guid>
      <description>Fusion startups have raised $7.1 billion to date, with the majority of it going to a handful of companies.</description>
    </item>
    <item>
      <title>5K et tailles extr&#234;mes pour les nouveaux moniteurs gaming de LG</title>
      <link>https://www.01net.com/actualites/5k-et-tailles-extremes-pour-les-nouveaux-moniteurs-gaming-de-lg.html</link>
      <pubDate>Wed, 31 Dec 2025 15:03:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317770</guid>
      <description>Les moniteurs LG de la nouvelle gamme UltraGear evo ont des particularit&#233;s qui les sortent de l'ordinaire. D'une, ils affichent une d&#233;finition 5K qui n'est pas si courante. De deux, ils utilisent une technologie d'upscale int&#233;gr&#233;e pour pallier les &#233;ventuelles faiblesses de votre PC. Et de trois, il y a dans le tas un mod&#232;le absolument &#233;norme qui va probablement vous obliger &#224; revoir l'am&#233;nagement du bureau !...</description>
    </item>
    <item>
      <title>The 10 top government, legal startups from Disrupt Startup Battlefield</title>
      <link>https://techcrunch.com/2025/12/31/the-10-top-government-legal-startups-from-disrupt-startup-battlefield/</link>
      <pubDate>Wed, 31 Dec 2025 15:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3076638</guid>
      <description>Here is the full list of the government and legal Startup Battlefield 200 selectees, along with a note on what made us select them for the competition.</description>
    </item>
    <item>
      <title>All of io9&#8217;s Best of 2025 Posts, in One Handy Place</title>
      <link>https://gizmodo.com/year-in-review-2025-best-movies-tv-2000704337</link>
      <pubDate>Wed, 31 Dec 2025 15:00:47 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000704337</guid>
      <description>Take one last look back at the year that was with all of our Year in Review stories.</description>
    </item>
    <item>
      <title>NASA Needs A Drone Detector At Kennedy Space Center</title>
      <link>https://gizmodo.com/nasa-needs-a-drone-detector-at-kennedy-space-center-2000704323</link>
      <pubDate>Wed, 31 Dec 2025 15:00:28 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000704323</guid>
      <description>The space agency requested plans for a UAS detection system at its primary rocket launch site.</description>
    </item>
    <item>
      <title>Net neutrality was back, until it wasn&#8217;t</title>
      <link>https://www.theverge.com/report/851629/net-neutrality-fcc-retrospective-2025</link>
      <pubDate>2025-12-31T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=851629</guid>
      <description>The fight for net neutrality never seems to be truly won or lost. Federal net neutrality rules have been on and off for the past 15 years. The Federal Communications Commission (FCC) passed the Open Internet Order under President Barack Obama in 2010, prohibiting ISPs from blocking or throttling lawful internet traffic, the baseline rule [&#8230;]</description>
    </item>
    <item>
      <title>Quordle hints and answers for Thursday, January 1 (game #1438)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-1-january-2026</link>
      <pubDate>Wed, 31 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">kVZv5BWQLSVhyUatHH9GWC</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Thursday, January 1 (game #935)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-1-january-2026</link>
      <pubDate>Wed, 31 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">ZhpbPgSdBmpEoFjMnmbXr6</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Thursday, January 1 (game #669)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-1-january-2026</link>
      <pubDate>Wed, 31 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">cW4HhsnW6TdypBiNNwRXo9</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Leaked video shows the Galaxy S26 Ultra&#8217;s new camera island</title>
      <link>https://www.theverge.com/news/851931/samsung-galaxy-236-ultra-video-photo-leak</link>
      <pubDate>2025-12-31T09:51:29-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=851931</guid>
      <description>New photos and video seem to confirm previous leaks hinting that the Samsung Galaxy S26 Ultra will sport a new camera bump. OnLeaks posted images of what look like dummy phones on X, following renders it leaked back in September. We've seen a similarly raised island on the Galaxy Z Fold 7, which 9to5Google points [&#8230;]</description>
    </item>
    <item>
      <title>Sonos Beam Gen 2 vs Marshall Heston 60: here&#8217;s the compact Dolby Atmos soundbar I&#8217;d recommend</title>
      <link>https://www.techradar.com/televisions/soundbars/sonos-beam-gen-2-vs-marshall-heston-60</link>
      <pubDate>Wed, 31 Dec 2025 14:44:45 +0000</pubDate>
      <guid isPermaLink="false">JYJhCh5TeeQtFKZh7JKzW</guid>
      <description>The Sonos Beam Gen 2 and Marshall Heston 60 are both excellent compact soundbars, but only one can come out on top.</description>
    </item>
    <item>
      <title>Micro pour le podcast et le streaming : notre s&#233;lection</title>
      <link>https://www.frandroid.com/guide-dachat/1407721_notre-selection-des-meilleurs-micros-pour-le-podcast-et-le-streaming</link>
      <pubDate>Wed, 31 Dec 2025 14:43:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1407721_notre-selection-des-meilleurs-micros-pour-le-podcast-et-le-streaming</guid>
      <description>
Vous souhaitez vous lancer dans le podcast ? Investir dans un bon micro est une &#233;tape indispensable. D&#233;couvrez notre s&#233;lection des meilleurs micros pour faire du podcast ou du streaming.
</description>
    </item>
    <item>
      <title>Ce TV OLED Philips Ambilight de 77 pouces profite d&#8217;une remise XXL et devient l&#8217;une des meilleures affaires de fin d&#8217;ann&#233;e</title>
      <link>https://www.frandroid.com/bons-plans/2800221_ce-tv-oled-philips-ambilight-de-77-pouces-profite-dune-remise-xxl-et-devient-lune-des-meilleures-affaires-de-fin-dannee</link>
      <pubDate>Wed, 31 Dec 2025 14:36:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2800221_ce-tv-oled-philips-ambilight-de-77-pouces-profite-dune-remise-xxl-et-devient-lune-des-meilleures-affaires-de-fin-dannee</guid>
      <description>
Le Philips 77OLED760 s&#8217;affiche &#224; un prix rarement vu : ce t&#233;l&#233;viseur OLED de 77 pouces passe de 2 999 euros &#224; 1 939 euros. Une belle opportunit&#233; pour s&#8217;offrir une immersion XXL avant la fin de l&#8217;ann&#233;e, surtout &#224; ce tarif pour un mod&#232;le aussi complet.
</description>
    </item>
    <item>
      <title>OpenAI's mysterious ChatGPT gadget could take the form of an AI-powered pen</title>
      <link>https://www.techradar.com/ai-platforms-assistants/openai/openais-mysterious-chatgpt-gadget-could-take-the-form-of-an-ai-powered-pen</link>
      <pubDate>Wed, 31 Dec 2025 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">MCkj3QYzmUJDe2UuQQgg5Q</guid>
      <description>Progress is apparently being made on the OpenAI device, and there might be more than one of them.</description>
    </item>
    <item>
      <title>I've tested more than 30 Bluetooth speakers, but this model surprised me for one key reason &#8212; and it's not from Bose or JBL</title>
      <link>https://www.techradar.com/audio/speakers/ive-tested-more-than-30-bluetooth-speakers-but-this-model-surprised-me-for-one-key-reason-and-its-not-from-bose-or-jbl</link>
      <pubDate>Wed, 31 Dec 2025 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">vyv8Ed25attPeuzp4eHCsA</guid>
      <description>The Marshall Middleton II plates up impeccable audio quality, and its stereo sound is absolutely spectacular.</description>
    </item>
    <item>
      <title>Zohran Mamdani&#8217;s NYC mayoral term will begin with a swearing-in at this fitting, but unusual, location</title>
      <link>https://www.fastcompany.com/91467988/zohran-mamdanis-nyc-mayoral-term-begin-swearing-in-fitting-unusual-location</link>
      <pubDate>2025-12-31T14:29:57</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91467988/zohran-mamdanis-nyc-mayoral-term-begin-swearing-in-fitting-unusual-location</guid>
      <description>Mamdani will be administered an oath at midnight by New York State Attorney General Letitia James.
Zohran Mamdani was a trailblazing candidate whom many in his city of 8 million &#8212; some with hope, some with trepidation &#8212; expect to be a disruptive New York mayor.</description>
    </item>
    <item>
      <title>The Dreame X40 Ultra robovac is about $700 off, nearly matching its best price</title>
      <link>https://www.theverge.com/gadgets/851325/dreame-x40-ultra-baseus-163w-retractable-car-charger-deal-sale</link>
      <pubDate>2025-12-31T09:23:43-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=851325</guid>
      <description>With the year coming to a close, now&#8217;s a good time to set yourself up for a cleaner, more organized start in 2026. The Dreame X40 Ultra &#8212; one of our favorite robot vacuum deals from Black Friday &#8212; can handle most of the heavy lifting for you, and it&#8217;s once again on sale. You [&#8230;]</description>
    </item>
    <item>
      <title>L&#8217;industrie musicale face &#224; l&#8217;IA : quels impacts sur la recommandation et la cr&#233;ation ? [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/2923611_lindustrie-musicale-face-a-lia-quels-impacts-sur-la-recommandation-et-la-creation</link>
      <pubDate>Wed, 31 Dec 2025 14:10:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2923611_lindustrie-musicale-face-a-lia-quels-impacts-sur-la-recommandation-et-la-creation</guid>
      <description>
Marre des contenus musicaux g&#233;n&#233;r&#233;s par IA ? Des artistes pay&#233;s &#224; l&#8217;emporte-pi&#232;ce ? Si c'est le cas, c'est qu'il est temps de vous pencher sur les pratiques des plateformes de streaming musical. Certaines font plus d&#8217;efforts que d&#8217;autres &#224; l&#8217;image de Deezer et de sa politique concernant les contenus 100 % g&#233;n&#233;r&#233;s par IA.&#160;
</description>
    </item>
    <item>
      <title>On a vu la premi&#232;re voiture &#233;lectrique chinoise qui conduit seule &#224; 120 km/h : la GAC Hyptec A800</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2904239_on-a-vu-la-premiere-voiture-electrique-chinoise-qui-conduit-seule-a-120-km-h-la-gac-hyptec-a800</link>
      <pubDate>Wed, 31 Dec 2025 14:10:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2904239_on-a-vu-la-premiere-voiture-electrique-chinoise-qui-conduit-seule-a-120-km-h-la-gac-hyptec-a800</guid>
      <description>
On a pu monter &#224; bord de la voiture &#233;lectrique chinois qui a obtenu la premi&#232;re licence locale pour conduite en autonomie &#224; 120 km/h. La GAC Hyptec A800 et voici notre premier avis.
</description>
    </item>
    <item>
      <title>La PS5 vient de subir sa plus grosse fuite depuis son lancement</title>
      <link>https://www.frandroid.com/marques/sony/2924489_la-ps5-vient-de-subir-sa-plus-grosse-fuite-depuis-son-lancement</link>
      <pubDate>Wed, 31 Dec 2025 14:07:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2924489_la-ps5-vient-de-subir-sa-plus-grosse-fuite-depuis-son-lancement</guid>
      <description>
Le jailbreak de la PS5 est d&#233;sormais une r&#233;alit&#233; alors que les cl&#233;s de chiffrement de la console ont fuit&#233;. Une aubaine pour les pirates et une bien mauvaise nouvelle pour Sony.
</description>
    </item>
    <item>
      <title>The Best Gadgets of December 2025</title>
      <link>https://gizmodo.com/the-best-gadgets-of-december-2025-2000704366</link>
      <pubDate>Wed, 31 Dec 2025 14:00:34 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000704366</guid>
      <description>The end of the holiday season is a precursor to a weird, wacky, and chaotic 2026.</description>
    </item>
    <item>
      <title>It&#8217;s 2026 in the South Pacific. Here&#8217;s how this major city kicked off the new year</title>
      <link>https://www.fastcompany.com/91467984/its-2026-south-pacific-heres-how-this-major-city-kicked-off-new-year</link>
      <pubDate>2025-12-31T14:00:05</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91467984/its-2026-south-pacific-heres-how-this-major-city-kicked-off-new-year</guid>
      <description>South Pacific countries are the first to ring in the new year. 
Auckland rang in 2026 with a downtown fireworks display launched from New Zealand&#8217;s tallest structure, Sky Tower, making it the first major city to greet the new year at a celebration dampened by rain.South Pacific countries are the first to bid farewell to 2025. Clocks strike midnight in Auckland, a population of 1.7 million, 18 hours before the famous ball drops in New York&#8217;s Times Square.The five-minute display involved 3,500 fireworks launched from various floors of the 240-meter (787-foot) Sky Tower. Smaller community events ...</description>
    </item>
    <item>
      <title>Android : d&#233;couvrez quelle version &#233;quipe le plus de smartphones en 2025</title>
      <link>https://www.frandroid.com/android/mises-a-jour-android/1447927_versions-android-plus-utilisees-fragmentation</link>
      <pubDate>Wed, 31 Dec 2025 14:00:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/mises-a-jour-android/1447927_versions-android-plus-utilisees-fragmentation</guid>
      <description>
Utilisez-vous la version d'Android la plus r&#233;pandue ? Voici les derniers chiffres de la fragmentation de l'OS de Google pour savoir qui d'Android 16, Android 15, Android 14, Android 13 ou Android 12 est la mouture la plus d&#233;ploy&#233;e dans le monde.
</description>
    </item>
    <item>
      <title>The dumbest things that happened in tech this year</title>
      <link>https://techcrunch.com/2025/12/31/the-dumbest-things-that-happened-in-tech-this-year/</link>
      <pubDate>Wed, 31 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078541</guid>
      <description>From Sam Altman's olive oil "scandal" to Soham Parekh's viral moment, a lot of silly stuff has gone down in tech this year.</description>
    </item>
    <item>
      <title>Looking for the best games to play with the family? These must-play titles are perfect for bringing everyone together over New Year's</title>
      <link>https://www.techradar.com/gaming/looking-for-the-best-games-to-play-with-the-family-these-must-play-titles-are-perfect-for-bringing-everyone-together-over-new-years</link>
      <pubDate>Wed, 31 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">QYsBWXcZiXs64d883YZxHL</guid>
      <description>These family favorites are fantastic choices if you're looking for games to keep everyone entertained over the holidays.</description>
    </item>
    <item>
      <title>European space agency confirms 'external servers' breached in cyberattack</title>
      <link>https://www.techradar.com/pro/security/european-space-agency-confirms-external-servers-breached-in-cyberattack</link>
      <pubDate>Wed, 31 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">2w2PH5Wuny7MHThz9k32HJ</guid>
      <description>The ESA is investigating the extent of the breach, while hackers share stolen files on the dark web.</description>
    </item>
    <item>
      <title>How to use a VPN</title>
      <link>https://www.engadget.com/cybersecurity/vpn/how-to-use-a-vpn-140000564.html?src=rss</link>
      <pubDate>Wed, 31 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">52aa4501-7372-4990-ab5c-a027e398a215</guid>
      <description>Chances are that if a VPN is marketed to everyday users, it more or less runs itself. As long as you go with one of the best VPNs instead of setting up your own manual connection, the interface is likely built so you have to engage with it as little as possible. Generally, if you find yourself constantly thinking about your VPN while using it &#8212; as happened to me with Norton VPN &#8212; that's a bad thing and you should change providers.That said, it's still useful to get a high-level view of how to use a VPN, especially if you've never used one before. In this article, I'll walk you through how to d...</description>
    </item>
    <item>
      <title>Ce mini projecteur laser ultra lumineux &#224; prix cass&#233; affiche des images 4K jusqu&#8217;&#224; 200&#8243; sur votre mur</title>
      <link>https://www.frandroid.com/bons-plans/2827229_ce-mini-projecteur-laser-ultra-lumineux-a-prix-casse-affiche-des-images-4k-jusqua-200-sur-votre-mur</link>
      <pubDate>Wed, 31 Dec 2025 13:52:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2827229_ce-mini-projecteur-laser-ultra-lumineux-a-prix-casse-affiche-des-images-4k-jusqua-200-sur-votre-mur</guid>
      <description>
En promotion &#224; 999 &#8364; au lieu de 1 299 &#8364;, le Hisense M2 Pro fait tomber la barri&#232;re d&#8217;entr&#233;e de la projection laser 4K &#224; la maison, avec une image jusqu&#8217;&#224; 200 pouces, un triple laser ultra color&#233; et une plateforme Vidaa U compl&#232;te pour le streaming.
</description>
    </item>
    <item>
      <title>Les derniers chiffres de Google sont tomb&#233;s : Android 16 progresse bien et une version historique disparait</title>
      <link>https://www.frandroid.com/android/mises-a-jour-android/2924449_les-derniers-chiffres-de-google-sont-tombes-android-16-progresse-bien-et-une-version-historique-disparait</link>
      <pubDate>Wed, 31 Dec 2025 13:45:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/mises-a-jour-android/2924449_les-derniers-chiffres-de-google-sont-tombes-android-16-progresse-bien-et-une-version-historique-disparait</guid>
      <description>
Google partage pour la premi&#232;re fois les chiffres de d&#233;ploiement d'Android 16. Au passage, on apprend que le tr&#232;s vieil Android 4.4 KitKat n'est plus comptabilis&#233;.
</description>
    </item>
    <item>
      <title>We let ChatGPT judge impossible superhero debates &#8212; here's how it ruled</title>
      <link>https://www.techradar.com/ai-platforms-assistants/we-let-chatgpt-judge-impossible-superhero-debates</link>
      <pubDate>Wed, 31 Dec 2025 13:45:27 +0000</pubDate>
      <guid isPermaLink="false">K28N6WM59GaquQyxgz7dnY</guid>
      <description>ChatGPT referees superhero debates</description>
    </item>
    <item>
      <title>Les 18 voitures &#233;lectriques qu&#8217;on attend le plus en 2026 : des citadines aux berlines &#224; 800 km d&#8217;autonomie</title>
      <link>https://www.frandroid.com/survoltes/2923619_les-18-voitures-electriques-quon-attend-le-plus-en-2026-des-citadines-aux-berlines-a-800-km-dautonomie</link>
      <pubDate>Wed, 31 Dec 2025 13:42:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2923619_les-18-voitures-electriques-quon-attend-le-plus-en-2026-des-citadines-aux-berlines-a-800-km-dautonomie</guid>
      <description>
Voici les 18 voitures &#233;lectriques les plus attendues de 2026. De la Polo de Volkswagen &#224; la Ferrari Elettrica en passant par la Dacia Spring sur base Twingo, on a list&#233; les mod&#232;les qui devraient apporter du renouveau dans de nombreux segments.
</description>
    </item>
    <item>
      <title>Surprise&#160;: le Trump Phone dor&#233; ne sortira pas cette ann&#233;e</title>
      <link>https://www.01net.com/actualites/surprise-le-trump-phone-dore-ne-sortira-pas-cette-annee.html</link>
      <pubDate>Wed, 31 Dec 2025 13:31:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317761</guid>
      <description>Le Trump Phone plaqu&#233; or ne sortira pas avant la fin de l'ann&#233;e, qui approche &#224; grands pas. Le smartphone &#171; made in USA &#187;, pr&#233;sent&#233; en juin en grande pompe par Trump Mobile, devait initialement &#234;tre lanc&#233; dans le courant de l'&#233;t&#233;.</description>
    </item>
    <item>
      <title>Killing in the name of&#8230; nothing</title>
      <link>https://www.theverge.com/policy/849609/charlie-kirk-shooting-ideology-literacy-politics</link>
      <pubDate>2025-12-31T08:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=849609</guid>
      <description>In a good and just society, it would have been possible to bury Charlie Kirk without either threatening mass violence toward his enemies or making light of his death with a furry sex meme. But America in 2025 did not remotely resemble a working society, let alone a civil one, and Kirk's killing came prepackaged [&#8230;]</description>
    </item>
    <item>
      <title>Rotel's bijou integrated amp is small but mighty &#8212;and it became my system's pint-sized powerhouse</title>
      <link>https://www.techradar.com/audio/hi-fi/rotel-dx-5-review</link>
      <pubDate>Wed, 31 Dec 2025 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">6bsAKjC9zpva3MsUhjpGLM</guid>
      <description>Rotel has belatedly realised that &#8216;small&#8217; really might be &#8216;beautiful&#8217; after all &#8211; and the DX-5 wants to be your miniature stereo hero</description>
    </item>
  </channel>
</rss>
