<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 16 Feb 2026 16:52:30 GMT</lastBuildDate>
    <item>
      <title>Quels sont les smartphones disposant encore d&#8217;une prise casque (jack) en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/674360_quel-smartphone-avec-prise-jack-choisir-en-2020</link>
      <pubDate>Mon, 16 Feb 2026 16:44:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/674360_quel-smartphone-avec-prise-jack-choisir-en-2020</guid>
      <description>
La prise jack 3,5 mm a peu &#224; peu disparu des smartphones. En 2026, il faut se faire une raison : plus aucun t&#233;l&#233;phone ne s'en encombre. &#192; la place, le port USB-C, qui est lui aussi capable de transmettre du son.
</description>
    </item>
    <item>
      <title>Fuite de donn&#233;es au CNRS&#160;: des informations personnelles d&#8217;employ&#233;s ont &#233;t&#233; vol&#233;es</title>
      <link>https://www.01net.com/actualites/fuite-donnees-cnrs-informations-personnelles-demployes-volees.html</link>
      <pubDate>Mon, 16 Feb 2026 16:32:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326188</guid>
      <description>Le Centre National de la Recherche Scientifique (CNRS) a subi une fuite de donn&#233;es massive. Des informations sensibles concernant d'anciens employ&#233;s recrut&#233;s avant 2007 ont &#233;t&#233; exfiltr&#233;es par des cybercriminels.</description>
    </item>
    <item>
      <title>The Vatican introduces an AI-assisted live translation service</title>
      <link>https://www.engadget.com/ai/the-vatican-introduces-an-ai-assisted-live-translation-service-163014907.html?src=rss</link>
      <pubDate>Mon, 16 Feb 2026 16:30:14 +0000</pubDate>
      <guid isPermaLink="false">9f3c09b9-c985-428a-b3a2-83ae5a16f420</guid>
      <description>The Vatican is leaning into AI. AI-assisted live translations are being introduced for Holy Mass attendees &#8212; the holy masses if you will. The Papal Basilica of Saint Peter in the Vatican has teamed up with Translated, a language service provider, to create live translations in 60 languages.&#160;
"Saint Peter&#8217;s Basilica has, for centuries, welcomed the faithful from every nation and tongue. In making available a tool that helps many to understand the words of the liturgy, we wish to serve the mission that defines the centre of the Catholic Church, universal by its very vocation," Cardinal Mauro Gam...</description>
    </item>
    <item>
      <title>Testing the new Dyson wet floor cleaner made me love my WashG1 even more &#8212; and it just crashed to an absurdly cheap price for Presidents' Day</title>
      <link>https://www.techradar.com/home/vacuums/testing-the-new-dyson-wet-floor-cleaner-made-me-love-my-washg1-even-more-and-it-just-crashed-to-an-absurdly-cheap-price-for-presidents-day</link>
      <pubDate>Mon, 16 Feb 2026 16:29:13 +0000</pubDate>
      <guid isPermaLink="false">tUmRZWvzoXsJA34FQZRuxE</guid>
      <description>With this discount, the nimble WashG1 wet floor cleaner is a no-brainer.</description>
    </item>
    <item>
      <title>ExpressVPN's lowest-ever price ends today &#8212; here are the quickest (and best) ways to save</title>
      <link>https://www.techradar.com/vpn/vpn-services/expressvpns-lowest-ever-price-ends-today-here-are-the-quickest-and-best-ways-to-save</link>
      <pubDate>Mon, 16 Feb 2026 16:28:41 +0000</pubDate>
      <guid isPermaLink="false">ZmDLgwFzfWAJVMqu5qrJyE</guid>
      <description>Plans are cheaper than the likes of Proton and NordVPN, but not for much longer</description>
    </item>
    <item>
      <title>Apr&#232;s la RAM, alerte sur les disques dur : ce constructeur majeur est en rupture pour le reste de 2026</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/2979167_apres-la-ram-alerte-sur-les-disques-dur-ce-constructeur-majeur-est-en-rupture-pour-le-reste-de-2026</link>
      <pubDate>Mon, 16 Feb 2026 16:28:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/2979167_apres-la-ram-alerte-sur-les-disques-dur-ce-constructeur-majeur-est-en-rupture-pour-le-reste-de-2026</guid>
      <description>
La crise de la RAM devient une crise de la m&#233;moire au sens large. Western Digital annonce avoir d&#233;j&#224; &#233;coul&#233; l'int&#233;gralit&#233; de sa production de 2026.
</description>
    </item>
    <item>
      <title>LG's impressive UltraWide 34-inch monitor is one of the best deals I've seen in Best Buy's Presidents' Day sale</title>
      <link>https://www.techradar.com/pro/lgs-impressive-ultrawide-34-inch-monitor-is-one-of-the-best-deals-ive-seen-in-best-buys-presidents-day-sale</link>
      <pubDate>Mon, 16 Feb 2026 16:21:00 +0000</pubDate>
      <guid isPermaLink="false">y8EWFrJJyZH89a6W23Cm5D</guid>
      <description>LG&#8217;s UltraWide 34-inch monitor is down to $210 at Best Buy, making it one of the cheapest ways to grab a big-screen IPS display from a well-known brand.</description>
    </item>
    <item>
      <title>'The gaming laptop deal to end all gaming laptop deals' - get a Lenovo with an RTX 5070 and OLED display for $1,194</title>
      <link>https://www.techradar.com/computing/gaming-laptops/the-gaming-laptop-deal-to-end-all-gaming-laptop-deals-get-a-lenovo-with-an-rtx-5070-and-oled-display-for-usd1-194</link>
      <pubDate>Mon, 16 Feb 2026 16:18:34 +0000</pubDate>
      <guid isPermaLink="false">dbyGhSArJiMSqFSipBHz7H</guid>
      <description>Here's how to get a gaming laptop with an RTX 5070 and OLED display for a record-low price today.</description>
    </item>
    <item>
      <title>Here 50 Presidents Day deals actually worth shopping for</title>
      <link>https://www.theverge.com/gadgets/875949/best-presidents-day-sales-deals-2026</link>
      <pubDate>2026-02-16T11:12:34-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=875949</guid>
      <description>Deals have been admittedly pretty dry since the holidays, but now that February is in full swing, we&#8217;re starting to see strong discounts return across a range of categories. In fact, thanks to Valentine&#8217;s Day, the Super Bowl, and &#8212; as of this week &#8212; Presidents Day, retailers are once again offering a slew of [&#8230;]</description>
    </item>
    <item>
      <title>Presidents&#8217; Day is an excellent time to save money on the latest iPads &#8212; I've found today's 11 best deals from $299</title>
      <link>https://www.techradar.com/tablets/presidents-day-is-an-excellent-time-to-save-money-on-the-latest-ipads-ive-found-todays-11-best-deals-from-usd299</link>
      <pubDate>Mon, 16 Feb 2026 16:11:55 +0000</pubDate>
      <guid isPermaLink="false">vNo4cah9fvert3Ykcj6F57</guid>
      <description>I've rounded up what I reckon are the best Presidents' Day iPad deals to snap up before they sell out.</description>
    </item>
    <item>
      <title>Google patches first Chrome zero-day of the year - so update now or face attack</title>
      <link>https://www.techradar.com/pro/security/google-patches-first-chrome-zero-day-of-the-year-so-update-now-or-face-attack</link>
      <pubDate>Mon, 16 Feb 2026 16:10:00 +0000</pubDate>
      <guid isPermaLink="false">kQBmEHvoGNvcFX2SaGDFbb</guid>
      <description>An 8.3/10 use after free in CSS Google Chrome bug was patched after being abused by unnamed threat actors.</description>
    </item>
    <item>
      <title>Pairs Figure Skating Finale Free Streams: Running Order, Preview for Gold Medal Decider at 2026 Winter Olympics</title>
      <link>https://www.techradar.com/how-to-watch/sport/pairs-figure-skating-finale-2026-winter-olympics-free</link>
      <pubDate>Mon, 16 Feb 2026 16:06:34 +0000</pubDate>
      <guid isPermaLink="false">SfQyjCvCP5CA9nB7mBiRp7</guid>
      <description>All the ways to watch Pairs Figure Skating finale 2026 live streams for FREE, with Miura Riku and Kihara Ryuichi facing an uphill battle in the Free Skate.</description>
    </item>
    <item>
      <title>Could DMT Be a New Treatment for Depression? A Small Study Says Yes</title>
      <link>https://gizmodo.com/could-dmt-be-a-new-treatment-for-depression-a-small-study-says-yes-2000720779</link>
      <pubDate>Mon, 16 Feb 2026 16:05:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000720779</guid>
      <description>People taking DMT tended to experience significant relief from their depression for up to three months, the researchers found.</description>
    </item>
    <item>
      <title>Le r&#233;seau social X bri&#232;vement en panne dans plusieurs pays</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-02-16/le-reseau-social-x-brievement-en-panne-dans-plusieurs-pays.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Mon, 16 Feb 2026 11:04:50 -0500</pubDate>
      <guid isPermaLink="false">0d7d9458dcaf38919a4cf25100e31b9a</guid>
      <description>Le r&#233;seau social X a connu une panne dans plusieurs pays lundi pendant quelques heures, ont constat&#233; des observateurs sp&#233;cialis&#233;s et des journalistes de l&#8217;AFP, de nouveaux dysfonctionnements pour l&#8217;entreprise d&#8217;Elon Musk.</description>
    </item>
    <item>
      <title>Mettez vite Chrome &#224; jour, Google corrige une faille permettant de contr&#244;ler le navigateur</title>
      <link>https://www.frandroid.com/marques/google/2978819_mettez-vite-chrome-a-jour-google-corrige-une-faille-permettant-de-controler-le-navigateur</link>
      <pubDate>Mon, 16 Feb 2026 16:04:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2978819_mettez-vite-chrome-a-jour-google-corrige-une-faille-permettant-de-controler-le-navigateur</guid>
      <description>
Premi&#232;re faille &#171; zero day &#187; de 2026 pour Chrome. Un correctif d'urgence est disponible
</description>
    </item>
    <item>
      <title>Netgear Nighthawk M7 Portable 5G Router Review: A Little Stability Goes a Long Way</title>
      <link>https://gizmodo.com/netgear-nighthawk-m7-portable-5g-router-review-a-little-stability-goes-a-long-way-2000722453</link>
      <pubDate>Mon, 16 Feb 2026 16:00:37 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000722453</guid>
      <description>The Nighthawk 5G M7 is a versatile travel Wi-Fi router the size of a chunky smartphone.</description>
    </item>
    <item>
      <title>The Magic of &#8216;Ponyo&#8217; Comes to Life at the Academy Museum</title>
      <link>https://gizmodo.com/the-magic-of-ponyo-comes-to-life-at-the-academy-museum-2000721980</link>
      <pubDate>Mon, 16 Feb 2026 16:00:26 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000721980</guid>
      <description>Studio Ghibli and Hayao Miyazaki donated over 100 pieces for the exhibit, open through January 2027.</description>
    </item>
    <item>
      <title>13 &#233;mulateurs Switch dans la ligne de mire de Nintendo</title>
      <link>https://www.01net.com/actualites/13-emulateurs-switch-dans-la-ligne-de-mire-de-nintendo.html</link>
      <pubDate>Mon, 16 Feb 2026 15:58:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326189</guid>
      <description>Nintendo a ferm&#233; les yeux pendant des ann&#233;es sur l'&#233;mulation Switch&#8230; mais c'est bien termin&#233;. En 2024, le constructeur obtenait l'arr&#234;t de toute activit&#233; pour Yuzu et Ryujinx, les deux principaux &#233;mulateurs &#224; l'&#233;poque. Mais c'est un jeu du chat et de la souris permanent, car de nombreuses alternatives sont apparues, et Nintendo est reparti &#224; la chasse....</description>
    </item>
    <item>
      <title>Galaxy Buds 4 et Buds 4 Pro : les images officielles avant la pr&#233;sentation</title>
      <link>https://www.frandroid.com/marques/samsung/2979043_galaxy-buds-4-et-buds-4-pro-les-images-officielles-avant-la-presentation</link>
      <pubDate>Mon, 16 Feb 2026 15:55:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2979043_galaxy-buds-4-et-buds-4-pro-les-images-officielles-avant-la-presentation</guid>
      <description>
Samsung s&#8217;appr&#234;te &#224; lancer ses Galaxy Buds 4 et Galaxy Buds 4 Pro aux c&#244;t&#233;s des Galaxy S26, avec un design revu, une r&#233;duction de bruit renforc&#233;e et des fonctions connect&#233;es plus pouss&#233;es. Des images officielles vient d&#8217;apparaitre sur la toile &#224; la faveur d&#8217;un revendeur.
</description>
    </item>
    <item>
      <title>Don't buy AirPods Pro 3 in the Presidents' Day Sales! Buy any of these 4 earbuds deals instead &#8211;all recommended by me, an audio expert</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/dont-buy-airpods-pro-3-in-the-presidents-day-sales-buy-any-of-these-4-earbuds-deals-instead-all-recommended-by-me-an-audio-expert</link>
      <pubDate>Mon, 16 Feb 2026 15:53:05 +0000</pubDate>
      <guid isPermaLink="false">tHQgcxX7f6RjHraKoYrQi6</guid>
      <description>AirPods Pro 3 are still a little pricey, no? These excellent options are a better bet for your hard-earned cash</description>
    </item>
    <item>
      <title>&#8216;It&#8217;s bonkers&#8217;: Newegg sells a $229 16-core Xeon mini PC with a true Nvidia video card, 8GB RAM, 256GB SSD and is barely slower than Apple M3</title>
      <link>https://www.techradar.com/pro/its-bonkers-newegg-sells-a-usd229-16-core-xeon-mini-pc-with-a-true-nvidia-video-card-8gb-ram-256gb-ssd-and-is-barely-slower-than-apple-m3</link>
      <pubDate>Mon, 16 Feb 2026 15:51:41 +0000</pubDate>
      <guid isPermaLink="false">5WY7PNaULAD7jgTPBWckEY</guid>
      <description>With an odd name (and Windows 10 in tow) but some cracking hardware, this is a deal that will split opinions.</description>
    </item>
    <item>
      <title>Ce TV Samsung Neo QLED 55&#8243; 144 Hz taill&#233;e pour le gaming b&#233;n&#233;ficie d&#8217;une triple remise pour 41 % de r&#233;duction au total</title>
      <link>https://www.frandroid.com/bons-plans/2978859_ce-tv-samsung-neo-qled-55-144-hz-taillee-pour-le-gaming-beneficie-dune-triple-remise-pour-41-de-reduction-au-total</link>
      <pubDate>Mon, 16 Feb 2026 15:51:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2978859_ce-tv-samsung-neo-qled-55-144-hz-taillee-pour-le-gaming-beneficie-dune-triple-remise-pour-41-de-reduction-au-total</guid>
      <description>
Chez Ubaldi il y a de sacr&#233;es offres sur le TV Samsung TQ55QN70F, un mod&#232;le Neo QLED de 55" fluide et boost&#233; &#224; l'IA qu'il est possible de r&#233;cup&#233;rer pour 530 euros au lieu de 899 euros.
</description>
    </item>
    <item>
      <title>&#171; Nous avons d&#233;cid&#233; de maintenir les moteurs diesel &#187; : pourquoi Stellantis fait marche arri&#232;re sur les voitures &#233;lectriques</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2978729_nous-avons-decide-de-maintenir-les-moteurs-diesel-pourquoi-stellantis-fait-marche-arriere-sur-les-voitures-electriques</link>
      <pubDate>Mon, 16 Feb 2026 15:45:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2978729_nous-avons-decide-de-maintenir-les-moteurs-diesel-pourquoi-stellantis-fait-marche-arriere-sur-les-voitures-electriques</guid>
      <description>
Alors que l'industrie automobile europ&#233;enne jurait ses grands dieux n'avoir d'yeux que pour l'&#233;lectrique, Stellantis fait marche arri&#232;re. Discr&#232;tement, le groupe a r&#233;introduit au moins 7 mod&#232;les diesel sur le Vieux Continent.
</description>
    </item>
    <item>
      <title>Les 10 smartphones les plus populaires de la semaine sur Frandroid : Samsung et Xiaomi dominent, OnePlus 15 cr&#233;e la surprise</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2491986_les-10-smartphones-les-plus-populaires-de-la-semaine-sur-frandroid-samsung-et-xiaomi-dominent-oneplus-15-cree-la-surprise</link>
      <pubDate>Mon, 16 Feb 2026 15:39:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2491986_les-10-smartphones-les-plus-populaires-de-la-semaine-sur-frandroid-samsung-et-xiaomi-dominent-oneplus-15-cree-la-surprise</guid>
      <description>
Pour notre top 10 des smartphones les plus populaires de la semaine sur Frandroid, Xiaomi et Samsung continuent de rivaliser, tandis que OnePlus tente de se faire une place.
</description>
    </item>
    <item>
      <title>Dell XPS 14 (2026) Review: Congratulations, You (Almost) Made a MacBook</title>
      <link>https://gizmodo.com/dell-xps-14-2026-review-congratulations-you-almost-made-a-macbook-2000721760</link>
      <pubDate>Mon, 16 Feb 2026 15:30:45 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000721760</guid>
      <description>The return of the Dell XPS offers us a great PC&#8212;with an odd keyboard and a depressing price.</description>
    </item>
    <item>
      <title>Layers of 3 revealed via a mysterious trailer and poem</title>
      <link>https://www.engadget.com/gaming/layers-of-3-revealed-via-a-mysterious-trailer-and-poem-153021903.html?src=rss</link>
      <pubDate>Mon, 16 Feb 2026 15:30:21 +0000</pubDate>
      <guid isPermaLink="false">06c5a9ae-5479-4223-9982-12a1bb4d4d11</guid>
      <description>
Bloober Team has revealed Layer of Fear 3 following a Valentine's Day countdown that started at the beginning of 2026. The new chapter will include not only a game but a novel and music, the company said in a press release.&#160;
The developer revealed the new IP via a live-action teaser, with an actor reading lines from William Blake's poem, The Sick Rose. A painting then fell from the wall, and the actor then turned over an hourglass with red sand, with a tagline stating "The door won't stay closed." No gameplay or other information like the release date was revealed.
What Bloober did say, thoug...</description>
    </item>
    <item>
      <title>Fresh Spider-Man: Brand New Day leak reveals first official look at its villains &#8212; and Marvel fans aren't happy about the design of one of them</title>
      <link>https://www.techradar.com/streaming/entertainment/fresh-spider-man-brand-new-day-leak-reveals-first-official-look-at-its-villains-and-marvel-fans-arent-happy-about-the-design-for-one-of-them</link>
      <pubDate>Mon, 16 Feb 2026 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">nAyzcpaCi6VnFdUKJVnJV8</guid>
      <description>A Spider-Man 4 merchandise leak has seemingly revealed its villains ahead of the MCU movie's long-awaited trailer debut.</description>
    </item>
    <item>
      <title>L&#8217;iPhone 17e arrive bient&#244;t : date de sortie, encoche, A19, MagSafe, voici tout ce que l&#8217;on sait</title>
      <link>https://www.frandroid.com/marques/apple/2970489_liphone-17e-arrive-bientot-date-de-sortie-encoche-a19-magsafe-voici-tout-ce-que-lon-sait</link>
      <pubDate>Mon, 16 Feb 2026 15:29:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2970489_liphone-17e-arrive-bientot-date-de-sortie-encoche-a19-magsafe-voici-tout-ce-que-lon-sait</guid>
      <description>
L'iPhone 17e ne se contenterait pas de corriger les errances ergonomiques de son a&#238;n&#233;. Il devrait enfin adopter la Dynamic Island ainsi qu'une charge MagSafe.
</description>
    </item>
    <item>
      <title>Tyra Banks takes no accountability for America&#8217;s Next Top Model&#8217;s endless mistakes and danger &#8212; but we didn&#8217;t need a new Netflix documentary for that</title>
      <link>https://www.techradar.com/streaming/netflix/tyra-banks-takes-no-accountability-for-americas-next-top-models-endless-mistakes-and-danger-but-we-didnt-need-a-new-netflix-documentary-for-that</link>
      <pubDate>Mon, 16 Feb 2026 15:29:28 +0000</pubDate>
      <guid isPermaLink="false">VTaECLAoxuVayK2WSfbxs7</guid>
      <description>Any young girl in the 2000s could tell the truth about America's Next Top Model better than anybody, and it feels like the new Netflix documentary gets the airbrush treatment.</description>
    </item>
    <item>
      <title>I've found 3 high-performance video editing laptops with massive price-cuts in Lenovo Presidents' Day sales - unmissable deals for content creators</title>
      <link>https://www.techradar.com/pro/ive-found-3-high-performance-video-editing-laptops-with-massive-price-cuts-in-lenovo-presidents-day-sales-unmissable-deals-for-content-creators</link>
      <pubDate>Mon, 16 Feb 2026 15:25:58 +0000</pubDate>
      <guid isPermaLink="false">8kEeamaBeuaKWHfNpHSSgP</guid>
      <description>Lenovo's Doorbuster deals are a Presidents' Day sales must-buy for creators who want to save big.</description>
    </item>
    <item>
      <title>Skip Amazon and Walmart &#8212; Best Buy's Presidents' Day sale has the best prices on TVs, appliances, AirPods, laptops, and more</title>
      <link>https://www.techradar.com/seasonal-sales/skip-amazon-and-walmart-best-buys-presidents-day-sale-has-the-best-prices-on-tvs-appliances-airpods-laptops-and-more</link>
      <pubDate>Mon, 16 Feb 2026 15:20:14 +0000</pubDate>
      <guid isPermaLink="false">LkfjHtrXhkxZc5XGDXzFnc</guid>
      <description>Look no further: Best Buy's Presidents' Day sale has the best prices that I'd found on TVs, Apple devices, appliances, laptops, smartwatches, and more.</description>
    </item>
    <item>
      <title>Beat the RAM crisis with these laptop Presidents Day Sales for less than $400</title>
      <link>https://www.techradar.com/computing/laptops/beat-the-ram-crisis-with-these-laptop-presidents-day-sales-for-less-than-usd400</link>
      <pubDate>Mon, 16 Feb 2026 15:17:30 +0000</pubDate>
      <guid isPermaLink="false">bA7hzHyFWN4vUY2P3mWDQB</guid>
      <description>I&#8217;m a laptop expert, and these Presidents Day Sales deals are the only ones I&#8217;d spend my money on.</description>
    </item>
    <item>
      <title>North Korean job scammers target JavaScript and Python developers with fake interview tasks spreading malware</title>
      <link>https://www.techradar.com/pro/security/north-korean-job-scammers-target-javascript-and-python-developers-with-fake-interview-tasks-spreading-malware</link>
      <pubDate>Mon, 16 Feb 2026 15:15:00 +0000</pubDate>
      <guid isPermaLink="false">3MoqZ4T5MWqXnL8vyBAx84</guid>
      <description>Operation Dream Job is evolving once again, and now comes through malicious dependencies on bare-bones projects.</description>
    </item>
    <item>
      <title>While the U.S. marks Presidents&#8217; Day, Lunar New Year begins for millions of Chinese Americans</title>
      <link>https://www.fastcompany.com/91493468/while-the-u-s-marks-presidents-day-lunar-new-year-begins-for-millions-of-chinese-americans</link>
      <pubDate>2026-02-16T15:12:55</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91493468/while-the-u-s-marks-presidents-day-lunar-new-year-begins-for-millions-of-chinese-americans</guid>
      <description>As Americans mark Presidents&#8217; Day, millions around the world are welcoming Lunar New Year&#8212;one of the most culturally significant holidays of the year.
In the United States, it&#8217;s one of our annual holidays today, Presidents&#8217; Day, which celebrates the dozens of American presidents we&#8217;ve had over the centuries. But on the other side of the world, an even larger holiday is kicking off: Chinese New Year. Here&#8217;s what you need to know about the festival and its importance to the millions of Chinese Americans in the United States....</description>
    </item>
    <item>
      <title>Confronting AI&#8217;s data privacy paradox</title>
      <link>https://www.techradar.com/pro/confronting-ais-data-privacy-paradox</link>
      <pubDate>Mon, 16 Feb 2026 15:10:33 +0000</pubDate>
      <guid isPermaLink="false">ceegGPzWDZgSeJNXy3D7QU</guid>
      <description>As AI projects advance, enterprises must prioritize secure, flexible cloud infrastructure to protect their data.</description>
    </item>
    <item>
      <title>MSI RTX 5090 Lightning now costs up to $15K on eBay &#8212; but there's a better way to buy the GPU</title>
      <link>https://www.techradar.com/computing/gpu/msi-rtx-5090-lightning-now-costs-up-to-usd15k-on-ebay-but-theres-a-better-way-to-buy-the-gpu</link>
      <pubDate>Mon, 16 Feb 2026 15:08:24 +0000</pubDate>
      <guid isPermaLink="false">KDubqB7HkcDox4zer2wFGg</guid>
      <description>The RTX 5090 Lightning is ludicrously expensive on eBay, so enthusiasts hunting for this pricey GPU should consider buying from the UK.</description>
    </item>
    <item>
      <title>Un acc&#232;s &#224; internet bient&#244;t plus cher &#224; cause des prix de la m&#233;moire&#160;?</title>
      <link>https://www.01net.com/actualites/un-acces-a-internet-bientot-plus-cher-a-cause-des-prix-de-la-memoire.html</link>
      <pubDate>Mon, 16 Feb 2026 15:06:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326178</guid>
      <description>Les prix des box internet vont-ils augmenter en m&#234;me temps que ceux de la m&#233;moire ? C'est &#224; craindre : tous les &#233;quipements grand public qui int&#232;grent de la RAM sont frapp&#233;s de plein fouet par la ru&#233;e actuelle de l'industrie de l'IA pour ces composants. Et aucun produit n'est &#224; l'abri.</description>
    </item>
    <item>
      <title>Voici l&#8217;op&#233;rateur mobile pr&#233;f&#233;r&#233; des Fran&#231;ais en 2026 selon l&#8217;Arcep</title>
      <link>https://www.frandroid.com/services/operateurs-mobiles/2978891_voici-loperateur-mobile-prefere-des-francais-en-2026-selon-larcep</link>
      <pubDate>Mon, 16 Feb 2026 15:03:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/operateurs-mobiles/2978891_voici-loperateur-mobile-prefere-des-francais-en-2026-selon-larcep</guid>
      <description>
L'Arcep vient de publier son grand bilan de sant&#233; annuel des t&#233;l&#233;coms en France. Si notre connexion internet globale s'am&#233;liore doucement et que les pannes se font plus rares, un v&#233;ritable fl&#233;au explose et parasite notre quotidien : le d&#233;marchage abusif et l'usurpation de num&#233;ros de t&#233;l&#233;phone.
</description>
    </item>
    <item>
      <title>Apple&#8217;s doing something on March 4th</title>
      <link>https://www.theverge.com/tech/879671/apple-special-experience-event-march-2026</link>
      <pubDate>2026-02-16T10:02:41-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=879671</guid>
      <description>Apple is hosting a "special Apple experience" in New York City on Wednesday, March 4th at 9AM ET, instead of at the Apple Park location it typically uses for events. It's also hosting press in the cities of London and Shanghai at the same time. The invitation includes the words "You're invited" and an Apple [&#8230;]</description>
    </item>
    <item>
      <title>What Would the First Week of World War III Look Like in Space?</title>
      <link>https://gizmodo.com/what-would-the-first-week-of-world-war-iii-look-like-in-space-2000721504</link>
      <pubDate>Mon, 16 Feb 2026 15:00:03 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000721504</guid>
      <description>"Think Wall-E, just a lot more depressing."</description>
    </item>
    <item>
      <title>Let&amp;#8217;s talk about Ring, lost dogs, and the surveillance state</title>
      <link>https://www.theverge.com/podcast/879203/ring-search-party-super-bowl-ai-surveillance-privacy-security</link>
      <pubDate>2026-02-16T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=879203</guid>
      <description>Today, let&#8217;s talk about the camera company Ring, lost dogs, and the surveillance state.&#160; You probably saw this ad during the Super Bowl a couple of weekends ago: Since it aired for a massive audience at the Super Bowl, Ring&#8217;s Search Party commercial has become a lightning rod for controversy &#8212; it&#8217;s easy to see [&#8230;]</description>
    </item>
    <item>
      <title>Quordle hints and answers for Tuesday, February 17 (game #1485)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-17-february-2026</link>
      <pubDate>Mon, 16 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">MoPydpQL3J8ujW4HWxycCS</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Tuesday, February 17 (game #982)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-17-february-2026</link>
      <pubDate>Mon, 16 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">N4HXHfCXyhYnxG8nFove7E</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Tuesday, February 17 (game #716)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-17-february-2026</link>
      <pubDate>Mon, 16 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">WrjemUhaKtN2ZyoiydnYPG</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Apple's next event is set for March 4</title>
      <link>https://www.engadget.com/computing/laptops/apples-next-event-is-set-for-march-4-145931890.html?src=rss</link>
      <pubDate>Mon, 16 Feb 2026 14:59:31 +0000</pubDate>
      <guid isPermaLink="false">a82eb626-64a5-420a-81c1-58ba2b7ab2b9</guid>
      <description>Apple has lined up its first event of the year. The company has invited members of the press to an &#8220;Apple Experience&#8221; that&#8217;s taking place in New York City on March 4 at 9AM ET. It hasn&#8217;t yet confirmed whether it will stream the event publicly. According to MacRumors, versions of this Apple Experience will also take place simultaneously in London and Shanghai.It seems likely that Apple will take this opportunity to unveil its latest slate of iPads and MacBooks. Bloomberg&#8217;s Mark Gurman reported earlier this month that Apple was planning to make a number of hardware announcements &#8220;as early as the...</description>
    </item>
    <item>
      <title>I'm a Homes editor &#8211; here are the best deals in the Shark Presidents' Day sale</title>
      <link>https://www.techradar.com/tech/im-a-homes-editor-here-are-the-best-deals-in-the-shark-presidents-day-sale</link>
      <pubDate>Mon, 16 Feb 2026 14:55:56 +0000</pubDate>
      <guid isPermaLink="false">e9EwkxyUmjisgfr65JPnp4</guid>
      <description>There's 29% off my favorite vacuum cleaner and 30% of my go-to hair styler &#8211; and that's just for starters.</description>
    </item>
  </channel>
</rss>
