<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 28 Feb 2026 09:31:19 GMT</lastBuildDate>
    <item>
      <title>Tout ce qui cloche dans le rachat de Warner Bros. Discovery par Paramount Skydance</title>
      <link>https://www.frandroid.com/services/svod/2992983_quest-ce-qui-clocherait-dans-le-rachat-de-warner-bros-par-paramount-skydance</link>
      <pubDate>Sat, 28 Feb 2026 08:33:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2992983_quest-ce-qui-clocherait-dans-le-rachat-de-warner-bros-par-paramount-skydance</guid>
      <description>
Dernier coup de th&#233;&#226;tre dans la guerre aux ench&#232;res opposant Netflix &#224; Paramount pour le rachat de Warner Bros. Discovery ! Le leader de la SVoD a annonc&#233; ne pas surench&#233;rir face &#224; la derni&#232;re offre de Paramount et semble jeter l'&#233;ponge. Pourtant, un rachat de Warner par Paramount ne serait pas une si bonne nouvelle.
</description>
    </item>
    <item>
      <title>Compact et lumineux, ce vid&#233;oprojecteur 4K brad&#233; &#224; -20 % transforme votre salon en salle de cin&#233;ma</title>
      <link>https://www.frandroid.com/bons-plans/2992155_compact-et-lumineux-ce-videoprojecteur-4k-brade-a-20-transforme-votre-salon-en-salle-de-cinema</link>
      <pubDate>Sat, 28 Feb 2026 08:32:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2992155_compact-et-lumineux-ce-videoprojecteur-4k-brade-a-20-transforme-votre-salon-en-salle-de-cinema</guid>
      <description>
Format compact, images en 4K jusqu'&#224; 150 pouces, luminosit&#233; &#233;lev&#233;e... L'Optoma Photon Life PK31 est un vid&#233;oprojecteur qui cumule les atouts. Actuellement, vous le trouverez &#224; 549 euros au lieu de 699 euros chez Boulanger, Son-Vid&#233;o et &#224; la Fnac.
</description>
    </item>
    <item>
      <title>Crash mortel en Xiaomi SU7 : Lei Jun brise le silence et confirme l&#8217;abandon des poign&#233;es de porte controvers&#233;es</title>
      <link>https://www.frandroid.com/marques/xiaomi/2994771_crash-mortel-en-xiaomi-su7-lei-jun-brise-le-silence-et-confirme-labandon-des-poignees-de-porte-controversees</link>
      <pubDate>Sat, 28 Feb 2026 08:21:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2994771_crash-mortel-en-xiaomi-su7-lei-jun-brise-le-silence-et-confirme-labandon-des-poignees-de-porte-controversees</guid>
      <description>
Quelques jours apr&#232;s les r&#233;sultats de l'enqu&#234;te sur un accident mortel d'une Xiaomi SU7, qui mettent en lumi&#232;re le dysfonctionnement des poign&#233;es de porte &#233;lectroniques, le patron de Xiaomi a pris la parole pour d&#233;fendre la s&#233;curit&#233; de ses voitures &#233;lectriques. De quoi pr&#233;senter une nouvelle poign&#233;e, cette fois-ci m&#233;canique.
</description>
    </item>
    <item>
      <title>Tenways nearly perfects the shareable city e-bike</title>
      <link>https://www.theverge.com/reviews/885040/tenways-cgo-compact-review-sharable-adaptable</link>
      <pubDate>2026-02-28T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/885040/brompton-g-e-bike-review-truth-in-advertising</guid>
      <description>Good electric bikes are expensive. So why not buy one and share it? That's the idea behind the Tenways CGO Compact e-bike I've been sharing with my wife and teenage daughter for the last two weeks. It adapts in seconds without any tools to comfortably fit riders of varying heights thanks to its low-entry frame, [&#8230;]</description>
    </item>
    <item>
      <title>Context, not compute, will define the next generation of intelligence</title>
      <link>https://www.techradar.com/pro/context-not-compute-will-define-the-next-generation-of-intelligence</link>
      <pubDate>Sat, 28 Feb 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">uWDwJq3ZBdEsXgPAD9k4QU</guid>
      <description>AI&#8217;s next leap won&#8217;t come from bigger models or longer context windows, but from better-organized knowledge.</description>
    </item>
    <item>
      <title>Omloop Het Nieuwsblad Free Streams: How to watch the first cobbled classic of 2026</title>
      <link>https://www.techradar.com/how-to-watch/cycling/omloop-nieuwsblad-2026</link>
      <pubDate>Sat, 28 Feb 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">eaAar4ov6wSbBBWghrUDek</guid>
      <description>All the ways to watch 2026 Omloop Nieuwsblad live streams online and from anywhere, as the World Tour teams hit the Belgian cobbles for the first time this year.</description>
    </item>
    <item>
      <title>Gran Turismo 7 sur Switch 2 : pourquoi Sony teste son jeu chez Nintendo</title>
      <link>https://www.frandroid.com/marques/sony/2994649_gran-turismo-7-sur-switch-2-pourquoi-sony-teste-son-jeu-chez-nintendo</link>
      <pubDate>Sat, 28 Feb 2026 07:34:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2994649_gran-turismo-7-sur-switch-2-pourquoi-sony-teste-son-jeu-chez-nintendo</guid>
      <description>
Le jeu de course de Sony, pour l'heure exclusif aux consoles PlayStation, aurait eu droit &#224; une version Nintendo Switch 2 en interne, sans que l'on sache pourquoi.
</description>
    </item>
  </channel>
</rss>
