<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 19 Feb 2026 07:51:21 GMT</lastBuildDate>
    <item>
      <title>Google Maps bride son acc&#232;s aux personnes ne disposant pas de compte Google</title>
      <link>https://www.frandroid.com/marques/google/2982391_google-maps-bride-son-acces-aux-personnes-ne-disposant-pas-de-compte-google</link>
      <pubDate>Thu, 19 Feb 2026 07:41:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2982391_google-maps-bride-son-acces-aux-personnes-ne-disposant-pas-de-compte-google</guid>
      <description>
L&#8217;acc&#232;s &#224; Google Maps sur le web est largement brid&#233; depuis peu pour les internautes qui ne n&#8217;utilisent pas de compte Google. Plusieurs fonctionnalit&#233;s, dont les photos et les avis, sont inaccessibles dans cette configuration.
</description>
    </item>
    <item>
      <title>Amazon fait perdre 400 &#8364; &#224; ce puissant laptop Lenovo, avec &#233;cran OLED et Ryzen&#160;7</title>
      <link>https://www.frandroid.com/bons-plans/2981693_amazon-fait-perdre-400-e-a-ce-puissant-laptop-lenovo-avec-ecran-oled-et-ryzen-7</link>
      <pubDate>Thu, 19 Feb 2026 07:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2981693_amazon-fait-perdre-400-e-a-ce-puissant-laptop-lenovo-avec-ecran-oled-et-ryzen-7</guid>
      <description>
La crise de la RAM et du stockage a aussi des cons&#233;quences sur le prix des PC portables... mais on vous a trouv&#233; un bon deal : ce laptop Lenovo avec un &#233;cran OLED et anim&#233; par une puce Ryzen 7 voit son prix chuter &#224; 699 euros au lieu de 1 099 euros au d&#233;part. 
</description>
    </item>
    <item>
      <title>CarPlay s&#8217;ouvre enfin aux chatbots&#160;: ChatGPT bient&#244;t en voiture&#160;!</title>
      <link>https://www.01net.com/actualites/carplay-souvre-enfin-aux-chatbots-chatgpt-bientot-en-voiture.html</link>
      <pubDate>Thu, 19 Feb 2026 07:30:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326750</guid>
      <description>Apple pr&#233;pare le terrain aux chatbots dans CarPlay. Le constructeur a en effet cr&#233;&#233; une nouvelle section d'applications iOS pouvant pr&#233;tendre &#224; un affichage sur les &#233;crans des voitures : les apps de conversation vocale. On pourra bient&#244;t discuter avec ChatGPT ou Gemini en conduisant, sans bidouille.</description>
    </item>
    <item>
      <title>Google lance un appareil photo Snapseed pour l&#8217;iPhone</title>
      <link>https://www.01net.com/actualites/google-lance-un-appareil-photo-snapseed-pour-liphone.html</link>
      <pubDate>Thu, 19 Feb 2026 07:16:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326768</guid>
      <description>L&#8217;application de retouche photo qui &#233;tait tomb&#233;e aux oubliettes fait un retour en force. En plus de vous laisser retoucher vos photos, Snapseed peut d&#233;sormais les prendre en y appliquant des filtres en direct.</description>
    </item>
    <item>
      <title>Google Maps&#160;: pourquoi les avis et les photos disparaissent soudainement pour certains utilisateurs&#160;?</title>
      <link>https://www.01net.com/actualites/google-maps-pourquoi-avis-photos-disparaissent-soudainement-certains-utilisateurs.html</link>
      <pubDate>Thu, 19 Feb 2026 07:11:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326756</guid>
      <description>Google Maps restreint d&#233;sormais drastiquement l'acc&#232;s aux avis et aux photos pour les utilisateurs non connect&#233;s &#224; un compte Google.</description>
    </item>
    <item>
      <title>Apr&#232;s les images et la vid&#233;o, Gemini compose d&#233;sormais des chansons</title>
      <link>https://www.01net.com/actualites/apres-les-images-et-la-video-gemini-compose-desormais-des-chansons.html</link>
      <pubDate>Thu, 19 Feb 2026 07:02:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326747</guid>
      <description>Apr&#232;s la g&#233;n&#233;ration d'images et de vid&#233;os, pourquoi ne pas s'attaquer maintenant &#224; la musique ? L'app Gemini et sa version web peuvent d&#233;sormais &#171;&#160;cr&#233;er&#160;&#187;&#160;des chansons de 30 secondes &#224; partir d'une simple requ&#234;te texte. Y compris en fran&#231;ais.</description>
    </item>
    <item>
      <title>Brendan Fraser on resilience at work in your 50s: &#8216;The silences in a career can be deafening&#8217;</title>
      <link>https://www.fastcompany.com/91488606/brendan-fraser-on-resilience-at-work-in-your-50s-the-silences-in-a-career-can-be-deafening</link>
      <pubDate>2026-02-19T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91488606/brendan-fraser-on-resilience-at-work-in-your-50s-the-silences-in-a-career-can-be-deafening</guid>
      <description>The Oscar winner talked to AARP The Magazine about depression and career dry spells&#8212;and how huge achievements can come later in life.
&#8220;Before&#160;The Whale, I had everything to prove. And now, to be honest, not so much,&#8221; Oscar winner Brendan Fraser, 57, told&#160;AARP The Magazine&#160;in an interview last month.&#160;</description>
    </item>
    <item>
      <title>How emotional intelligence can help us overcome imposter syndrome</title>
      <link>https://www.fastcompany.com/91494234/how-emotional-intelligence-can-help-us-overcome-imposter-syndrome</link>
      <pubDate>2026-02-19T06:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91494234/how-emotional-intelligence-can-help-us-overcome-imposter-syndrome</guid>
      <description>The more you&#8217;re in touch with your emotional world, the better you&#8217;ll weather self-doubt.
Imposter syndrome happens when we have the feeling that we do not deserve what we have achieved, fearing that we&#8217;ll be discovered to be fakes or frauds. Our successes, we tell ourselves, were achieved not through our actual abilities and talents, but through some combination of luck, timing, and mistakes others made that allowed us to slip through the cracks. Nobody is immune to this feeling, and it affects all segments of the public&#8212;from leaders, artists, actors, and the people we see as high achievers.&#160;...</description>
    </item>
    <item>
      <title>01net morning&#160;: &#224; la d&#233;couverte du Pixel 10a&#160;!</title>
      <link>https://www.01net.com/actualites/01net-morning-a-la-decouverte-du-pixel-10a.html</link>
      <pubDate>Thu, 19 Feb 2026 06:29:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326745</guid>
      <description>Bonjour &#224; tous, voici la matinale de 01net ! Qu&#8217;avez-vous manqu&#233; hier ? Retrouvez toute l&#8217;actu &#224; connaitre pour d&#233;marrer la journ&#233;e du bon pied !</description>
    </item>
    <item>
      <title>Apr&#232;s les lunettes Ray-Ban, Meta plancherait sur une montre connect&#233;e boost&#233;e &#224; l&#8217;IA</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2982373_apres-les-lunettes-ray-ban-meta-plancherait-sur-une-montre-connectee-boostee-a-lia</link>
      <pubDate>Thu, 19 Feb 2026 06:29:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2982373_apres-les-lunettes-ray-ban-meta-plancherait-sur-une-montre-connectee-boostee-a-lia</guid>
      <description>
La course aux wearables n&#8217;est pas finie. Si Apple veut concurrencer Meta dans le monde des lunettes connect&#233;es, la firme de Mark Zuckerberg compte bien faire de m&#234;me dans celui des smartwatch.
</description>
    </item>
    <item>
      <title>Une montre sportive Garmin &#224; moins de 200 &#8364; : la Forerunner 165 avec son &#233;cran AMOLED va briller sur votre poignet</title>
      <link>https://www.frandroid.com/bons-plans/2981973_une-montre-sportive-garmin-a-moins-de-200-e-la-forerunner-165-avec-son-ecran-amoled-va-briller-sur-votre-poignet</link>
      <pubDate>Thu, 19 Feb 2026 06:20:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2981973_une-montre-sportive-garmin-a-moins-de-200-e-la-forerunner-165-avec-son-ecran-amoled-va-briller-sur-votre-poignet</guid>
      <description>
Garmin est une marque r&#233;put&#233;e chez les sportifs, particuli&#232;rement les runners, et il y en a pour tous les budgets, en t&#233;moigne la Garmin Forerunner 165, un mod&#232;le d'entr&#233;e de gamme brad&#233; 199,99 euros au lieu de 279,99 euros chez Decathlon.
</description>
    </item>
    <item>
      <title>Dyson just made the smallest wet cleaner I&#8217;ve ever seen &#8212; and the vacuum master claims it'glides effortlessly and reaches where others can&#8217;t'</title>
      <link>https://www.techradar.com/home/vacuums/dyson-just-made-the-smallest-wet-cleaner-ive-ever-seen-and-the-vacuum-master-claims-it-glides-effortlessly-and-reaches-where-others-cant</link>
      <pubDate>Thu, 19 Feb 2026 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">ivpcqPJd7HP8wJaATZx7vK</guid>
      <description>The new Dyson PencilWash is a powered wet floor cleaner packed into the size and shape of a manual mop.</description>
    </item>
    <item>
      <title>Why the ADHD brain is a perfect pairing for AI</title>
      <link>https://www.fastcompany.com/91493923/why-the-adhd-brain-is-a-perfect-pairing-for-ai</link>
      <pubDate>2026-02-19T06:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91493923/why-the-adhd-brain-is-a-perfect-pairing-for-ai</guid>
      <description>Those with the condition tend to struggle in the domains where AI excels, and vice versa. 
In 2013, when Meredith O&#8217;Connor was 16, the music video for her debut single &#8220;Celebrity&#8221; went viral. Afterward, she channeled her own stardom into championing childhood mental health: As a hyperactive kid, O&#8217;Connor says she was often the subject of bullying, and when her music career gave her a platform, she was eager to use it to advocate on behalf of other victims....</description>
    </item>
  </channel>
</rss>
