<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 09 Feb 2026 17:52:48 GMT</lastBuildDate>
    <item>
      <title>I test XR glasses for a living, and this $35 accessory is a must-buy if you hate how quickly your device&#8217;s battery drains</title>
      <link>https://www.techradar.com/computing/virtual-reality-augmented-reality/i-test-xr-glasses-for-a-living-and-this-usd35-accessory-is-a-must-buy-if-you-hate-how-quickly-your-devices-battery-drains</link>
      <pubDate>Mon, 09 Feb 2026 17:49:42 +0000</pubDate>
      <guid isPermaLink="false">Sb5RnWyRtYyb8NqZ9WVvuj</guid>
      <description>Got XR glasses? Save yourself from battery troubles and get a cheap USB-C adapter like this one from RayNeo.</description>
    </item>
    <item>
      <title>Ferrari&#8217;s first EV will have an interior designed by Jony Ive</title>
      <link>https://www.theverge.com/transportation/875799/ferrari-luce-jony-ive-interior-design-photos</link>
      <pubDate>2026-02-09T12:45:42-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=875799</guid>
      <description>Ferrari released the first interior images of the company's first all-electric supercar, called the Ferrari Luce ("light" in Italian). This is the second time the Italian automaker has teased the Luce (formerly Elettrica) without showing us the actual car, or even a silhouette. But the interior images should suffice given the bold-faced name of the [&#8230;]...</description>
    </item>
    <item>
      <title>Anthropic closes in on $20B round</title>
      <link>https://techcrunch.com/2026/02/09/anthropic-closes-in-on-20b-round/</link>
      <pubDate>Mon, 09 Feb 2026 17:37:23 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3091038</guid>
      <description>The company raised $13 billion in equity funding just five months ago, but intense competition between frontier labs and the ongoing cost of compute have made them eager to raise as quickly as possible.</description>
    </item>
    <item>
      <title>Amazon retire 34 % sur cette batterie externe Ugreen de 25 000 mAh (145 W) qui recharge 3 appareils en m&#234;me temps</title>
      <link>https://www.frandroid.com/bons-plans/2971417_amazon-retire-34-sur-cette-batterie-externe-ugreen-de-25-000-mah-145-w-qui-recharge-3-appareils-en-meme-temps</link>
      <pubDate>Mon, 09 Feb 2026 17:35:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2971417_amazon-retire-34-sur-cette-batterie-externe-ugreen-de-25-000-mah-145-w-qui-recharge-3-appareils-en-meme-temps</guid>
      <description>
Compacte, puissante et capable de recharger jusqu&#8217;&#224; trois appareils en simultan&#233;, la batterie externe Ugreen Nexode 145 W s&#8217;impose vite comme un indispensable du quotidien. Bonne nouvelle : elle est affich&#233;e &#224; seulement 54 &#8364; au lieu de 82 &#8364; sur Amazon.
</description>
    </item>
    <item>
      <title>What AI builders can learn from fraud models that run in 300 milliseconds</title>
      <link>https://venturebeat.com/orchestration/what-ai-builders-can-learn-from-fraud-models-that-run-in-300-milliseconds</link>
      <pubDate>Mon, 09 Feb 2026 17:30:00 GMT</pubDate>
      <guid isPermaLink="false">1Yd96pmpLB2igiYzNnGRtm</guid>
      <description>Fraud protection is a race against scale.&#160;For instance, Mastercard&#8217;s network processes roughly 160 billion transactions a year, and experiences surges of 70,000 transactions a second during peak periods (like the December holiday rush). Finding the fraudulent purchases among those &#8212; without chasing false alarms &#8212; is an incredible task, which is why fraudsters have been able to game the system.&#160;But now, sophisticated AI models can probe down to individual transactions, pinpointing the ones that seem suspicious &#8212; in milliseconds&#8217; time. This is the heart of Mastercard&#8217;s flagship fraud platform, D...</description>
    </item>
    <item>
      <title>Jony Ive Designed the Interior for Ferrari&#8217;s New EV, Take a Look Inside</title>
      <link>https://gizmodo.com/jony-ive-designed-the-interior-for-ferraris-new-ev-take-a-look-inside-2000719731</link>
      <pubDate>Mon, 09 Feb 2026 17:25:50 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000719731</guid>
      <description>The Italian luxury sports car company and Jony Ive&#8217;s creative collective LoveFrom have been working on the car for the past five years.</description>
    </item>
    <item>
      <title>J&#8217;ai essay&#233; le Skoda Epiq : le SUV le plus abordable du groupe Volkswagen &#224; partir de 25 000 &#8364;</title>
      <link>https://www.frandroid.com/marques/skoda/2963627_jai-essaye-le-skoda-epiq-le-suv-le-plus-abordable-du-groupe-volkswagen-a-partir-de-25-000-e</link>
      <pubDate>Mon, 09 Feb 2026 17:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/skoda/2963627_jai-essaye-le-skoda-epiq-le-suv-le-plus-abordable-du-groupe-volkswagen-a-partir-de-25-000-e</guid>
      <description>
Apr&#232;s des ann&#233;es d&#8217;attente, le groupe Volkswagen arrive sur le march&#233; des voitures &#233;lectriques compactes et accessibles. Parmi la vague de nouveaut&#233;s du groupe pr&#233;vue pour 2026 sur le segment B figure le Skoda Epiq, un SUV pragmatique que j&#8217;ai pu essayer en avant-premi&#232;re, dans sa version camoufl&#233;e de prototype.
</description>
    </item>
    <item>
      <title>L&#8217;iPhone 17e arrive bient&#244;t : date de sortie, encoche, A19, MagSafe, voici tout ce que l&#8217;on sait</title>
      <link>https://www.frandroid.com/marques/apple/2970489_liphone-17e-arrive-bientot-date-de-sortie-encoche-a19-magsafe-voici-tout-ce-que-lon-sait</link>
      <pubDate>Mon, 09 Feb 2026 17:10:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2970489_liphone-17e-arrive-bientot-date-de-sortie-encoche-a19-magsafe-voici-tout-ce-que-lon-sait</guid>
      <description>
L'iPhone 17e ne se contenterait pas de corriger les errances ergonomiques de son a&#238;n&#233;. Il devrait enfin adopter la Dynamic Island ainsi qu'une charge MagSafe.
</description>
    </item>
    <item>
      <title>&#171;&#160;Plus rapide qu&#8217;internet et le smartphone&#160;&#187; : en trois ans, la moiti&#233; des Fran&#231;ais ont d&#233;j&#224; adopt&#233; l&#8217;IA g&#233;n&#233;rative</title>
      <link>https://www.01net.com/actualites/plus-rapide-quinternet-et-le-smartphone-en-trois-ans-la-moitie-des-francais-ont-deja-adopte-lia-generative.html</link>
      <pubDate>Mon, 09 Feb 2026 17:09:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324879</guid>
      <description>Que retenir de la grande enqu&#234;te sur nos usages num&#233;riques, publi&#233;e lundi 9 f&#233;vrier ? Si les Fran&#231;ais sont de plus en plus utilisateurs d'outils d'IA g&#233;n&#233;rative comme ChatGPT ou Le Chat, d&#8217;autres donn&#233;es ont retenu notre attention.</description>
    </item>
    <item>
      <title>Here are 11 TVs from Best Buy's Presidents' Day sale recommended by an expert</title>
      <link>https://www.techradar.com/seasonal-sales/here-are-11-tvs-from-best-buys-presidents-day-sale-recommended-by-an-expert</link>
      <pubDate>Mon, 09 Feb 2026 17:07:37 +0000</pubDate>
      <guid isPermaLink="false">cDdQuebwZyTGfaXg2saqCZ</guid>
      <description>As TechRadar's deals editor, I'm rounding up the 11 best TVs that I recommend buying at Best Buy's Presidents' Day sale.</description>
    </item>
    <item>
      <title>La Chine acc&#233;l&#232;re sur les batteries solides pour voitures &#233;lectriques avec cette nouvelle initiative</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2970965_la-chine-accelere-sur-les-batteries-solides-pour-voitures-electriques-avec-cette-nouvelle-initiative</link>
      <pubDate>Mon, 09 Feb 2026 17:07:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2970965_la-chine-accelere-sur-les-batteries-solides-pour-voitures-electriques-avec-cette-nouvelle-initiative</guid>
      <description>
Lors d'un sommet organis&#233; &#224; P&#233;kin, les g&#233;ants chinois de l'automobile et de la batterie ont dress&#233; un &#233;tat des lieux sans concession autour des fameuses batteries solides. Entre avanc&#233;es prometteuses et obstacles persistants, l'industrie chinoise mise sur 2026 comme ann&#233;e charni&#232;re pour passer des laboratoires &#224; la route.
</description>
    </item>
    <item>
      <title>YouTube TV launches curated subscription packages this week</title>
      <link>https://www.engadget.com/entertainment/tv-movies/youtube-tv-launches-curated-subscription-packages-this-week-170710000.html?src=rss</link>
      <pubDate>Mon, 09 Feb 2026 17:07:10 +0000</pubDate>
      <guid isPermaLink="false">914d6dab-3d34-4cc5-b877-bf671dc32c8c</guid>
      <description>YouTube is launching YouTube TV Plans this week, after revealing the program back in December. These are genre-specific subscription packages that let users opt into a curated version of the service and save a few bucks in the process. Yeah. It's pretty much cable, proving you can't cut a cord if it's made out of invisible radio waves.
There more than ten plans available and they are all cheaper than the typical asking price of $83 per month. There's a Sports Plan that costs $65 per month and includes channels like FS1, NBC Sports Network and all of the ESPN networks. Subscribers will pay $72 ...</description>
    </item>
    <item>
      <title>Not Quantum, Not Classical: This Light-Based Computer Is Something Else Entirely</title>
      <link>https://gizmodo.com/not-quantum-not-classical-this-light-based-computer-is-something-else-entirely-2000719687</link>
      <pubDate>Mon, 09 Feb 2026 17:05:08 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000719687</guid>
      <description>While it's no replacement for either computer, the new device is a powerful alternative for addressing some very practical challenges.</description>
    </item>
    <item>
      <title>HP&#8217;s massive President&#8217;s Day sale: Save up to $2845 (not a typo!) on AI-powered laptops and 4K desktops</title>
      <link>https://www.techradar.com/pro/hps-massive-presidents-day-sale-save-up-to-usd2845-not-a-typo-on-ai-powered-laptops-and-4k-desktops</link>
      <pubDate>Mon, 09 Feb 2026 17:02:16 +0000</pubDate>
      <guid isPermaLink="false">cLWdS5GdwYDFrkjbTfJ2NB</guid>
      <description>HP is holding a massive President&#8217;s Day sale, with one AI laptop a massive $2,845 (74%) off its usual price.</description>
    </item>
    <item>
      <title>The best microSD cards in 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-microsd-card-130038282.html?src=rss</link>
      <pubDate>Mon, 09 Feb 2026 17:01:26 +0000</pubDate>
      <guid isPermaLink="false">f411cada-3f1e-487d-8d9a-cb5d30c19fba</guid>
      <description>Most microSD cards are fast enough for boosting storage space and making simple file transfers, but some provide a little more value than others. If you&#8217;ve got a device that still accepts microSD cards &#8212; whether it&#8217;s an older gaming handheld, the new Nintendo Switch 2, a dash cam, a drone or an Android tablet &#8212; we&#8217;ve scoured the market and put close to 20 top contenders through a number of benchmark tests. You can find our recommendations for the best microSD cards below, alongside some general shopping advice worth knowing before you buy.
Best microSD cards of 2026






Best microSD Express ...</description>
    </item>
    <item>
      <title>The Best (and Nerdiest) Gifts to Give Your Valentine This Year</title>
      <link>https://gizmodo.com/best-valentines-gifts-fandom-star-wars-marvel-godzilla-2000719157</link>
      <pubDate>Mon, 09 Feb 2026 17:00:50 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000719157</guid>
      <description>Share your fandom with the one you love this year with our array of cute and nerdy gifts.</description>
    </item>
    <item>
      <title>Ex-Googlers are building infrastructure to help companies understand their video data</title>
      <link>https://techcrunch.com/2026/02/09/ex-googlers-are-building-infrastructure-to-help-companies-understand-their-video-data/</link>
      <pubDate>Mon, 09 Feb 2026 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3090785</guid>
      <description>Founded by former Google Japan leaders, InfiniMind is building enterprise AI to turn vast, unused video archives into searchable, actionable business intelligence.</description>
    </item>
    <item>
      <title>Snapchat now lets you inform others when you have arrived at your destination</title>
      <link>https://techcrunch.com/2026/02/09/snapchat-now-lets-you-inform-others-when-you-have-arrived-at-your-destination/</link>
      <pubDate>Mon, 09 Feb 2026 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3090989</guid>
      <description>With its new "Arrival Notifications," users can now set one-time or recurring alerts for locations beyond their home, providing an automatic way to share when they&#8217;ve arrived at their destination.</description>
    </item>
    <item>
      <title>Discord passe &#224; la v&#233;rification d&#8217;&#226;ge&#160;: fini l&#8217;anonymat&#160;?</title>
      <link>https://www.01net.com/actualites/discord-passe-a-la-verification-dage-fini-lanonymat.html</link>
      <pubDate>Mon, 09 Feb 2026 16:59:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324944</guid>
      <description>Discord va d&#233;ployer un syst&#232;me mondial de v&#233;rification d&#8217;&#226;ge, m&#234;lant reconnaissance faciale, analyse d&#8217;identit&#233; et d&#233;tection automatique. Une mesure pr&#233;sent&#233;e comme protectrice, mais qui soul&#232;ve d&#233;j&#224; de vives inqui&#233;tudes sur la vie priv&#233;e des utilisateurs.</description>
    </item>
    <item>
      <title>Scared your printer will stop working with Windows 11? Don't be &#8212; here's what you need to know about Microsoft's support plans</title>
      <link>https://www.techradar.com/computing/windows/scared-your-printer-will-stop-working-with-windows-11-dont-be-heres-what-you-need-to-know-about-microsofts-support-plans</link>
      <pubDate>Mon, 09 Feb 2026 16:59:38 +0000</pubDate>
      <guid isPermaLink="false">FLQz8vURPK3hfHPyKiz9NA</guid>
      <description>Heard some printers are going to stop working with Windows 11? Here's what you need to know, and what to do if you own an affected model.</description>
    </item>
    <item>
      <title>GitHub est en panne dans le monde entier</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/2971537_github-est-en-panne-dans-le-monde-entier</link>
      <pubDate>Mon, 09 Feb 2026 16:43:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/2971537_github-est-en-panne-dans-le-monde-entier</guid>
      <description>
Depuis 16h30, les internautes remontent des probl&#232;mes d'acc&#232;s &#224; GitHub.
</description>
    </item>
    <item>
      <title>Jeux vid&#233;o et violence&#160;: Emmanuel Macron tente d&#8217;&#233;teindre l&#8217;incendie qu&#8217;il a lui m&#234;me allum&#233;</title>
      <link>https://www.01net.com/actualites/jeux-video-et-violence-emmanuel-macron-tente-deteindre-lincendie-quil-a-lui-meme-allume.html</link>
      <pubDate>Mon, 09 Feb 2026 16:42:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324954</guid>
      <description>Le moins qu'on puisse dire, c'est que l'annonce par Emmanuel Macron la semaine derni&#232;re d'une mission pour d&#233;terminer l'impact des jeux vid&#233;o sur la sant&#233; des jeunes a suscit&#233; une certaine exasp&#233;ration dans l'industrie, dans la communaut&#233; des joueurs, et aussi chez Epic Games puisque Fortnite a &#233;t&#233; pris pour cible par le chef de l'&#201;tat. Il essaie maintenant d'&#233;teindre l'incendie....</description>
    </item>
    <item>
      <title>Is Apple Fitness+ running out of gas? Fresh rumors suggest it&#8217;s &#8216;under review&#8217; &#8211; and could be folded into the Health app</title>
      <link>https://www.techradar.com/health-fitness/is-apple-fitness-running-out-of-gas-fresh-rumors-suggest-its-under-review-and-could-be-folded-into-the-health-app</link>
      <pubDate>Mon, 09 Feb 2026 16:39:41 +0000</pubDate>
      <guid isPermaLink="false">fZPTbaJRicnvUWxAWUpe69</guid>
      <description>Apple Fitness+ could merge with the Health app and an AI-powered wellbeing coach, a new report claims.</description>
    </item>
    <item>
      <title>Ce robot autonome nous a livr&#233; un colis dans une chambre d&#8217;h&#244;tel et on l&#8217;a suivi pour savoir comment il &#233;tait con&#231;u</title>
      <link>https://www.frandroid.com/produits-android/robots/2970573_ce-robot-autonome-nous-a-livre-un-colis-dans-une-chambre-dhotel-et-on-la-suivi-pour-savoir-comment-il-etait-concu</link>
      <pubDate>Mon, 09 Feb 2026 16:38:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/robots/2970573_ce-robot-autonome-nous-a-livre-un-colis-dans-une-chambre-dhotel-et-on-la-suivi-pour-savoir-comment-il-etait-concu</guid>
      <description>
D&#233;couvrez notre reportage vid&#233;o en immersion chez Pudu, un g&#233;ant chinois des robots autonomes qui veut s'imposer dans un maximum de lieux publics (h&#244;tels, a&#233;roports, bureaux, trains, etc.).
</description>
    </item>
    <item>
      <title>The best Presidents Day streaming deals: Starz, YouTube TV, Hulu, and more</title>
      <link>https://mashable.com/article/best-presidents-day-streaming-deals-2026</link>
      <pubDate>Mon, 09 Feb 2026 16:35:40 +0000</pubDate>
      <guid isPermaLink="false">03cwWOWxoMTKERRaNdAMvpB</guid>
      <description>Save up to $180 on the best Presidents' Day streaming deals, including Hulu, Disney+, Starz, and YouTube TV.</description>
    </item>
    <item>
      <title>Attention, Google Photos peut effacer vos clich&#233;s si vous faites cette erreur</title>
      <link>https://www.frandroid.com/marques/google/2971037_attention-google-photos-peut-effacer-vos-cliches-si-vous-faites-cette-erreur</link>
      <pubDate>Mon, 09 Feb 2026 16:29:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2971037_attention-google-photos-peut-effacer-vos-cliches-si-vous-faites-cette-erreur</guid>
      <description>
L'application Google Photos est tr&#232;s pratique, mais parfois elle ne se comporte pas comme on l'imagine spontan&#233;ment.
</description>
    </item>
    <item>
      <title>Vive le r&#233;trogaming avec cette console Atari 2600+ aux couleurs de Pac-Man en promo et compatible avec les cartouches de l&#8217;&#233;poque</title>
      <link>https://www.frandroid.com/bons-plans/2971285_vive-le-retrogaming-avec-cette-console-atari-2600-aux-couleurs-de-pac-man-en-promo-et-compatible-avec-les-cartouches-de-lepoque</link>
      <pubDate>Mon, 09 Feb 2026 16:27:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2971285_vive-le-retrogaming-avec-cette-console-atari-2600-aux-couleurs-de-pac-man-en-promo-et-compatible-avec-les-cartouches-de-lepoque</guid>
      <description>
Si vous aimez les jeux &#224; l'ancienne et que le prix du r&#233;trogaming vous fait sauter au plafond, cette authentique Atari 2600+ d'un tr&#232;s beau jaune vif est brad&#233;e &#224; 127,20 euros au lieu de 149,99 euros sur Amazon.
</description>
    </item>
    <item>
      <title>The best early Presidents Day mattress deals take up to 60% off a new bed, sheets, and pillows</title>
      <link>https://mashable.com/article/best-presidents-day-mattress-deals-2026</link>
      <pubDate>Mon, 09 Feb 2026 16:26:46 +0000</pubDate>
      <guid isPermaLink="false">01WpfyMpccgkkKkAXp1epCn</guid>
      <description>President's Day mattress sales include saving up to 60% from brands like Purple, Bear, Avocado, Naturepedic, and more.</description>
    </item>
    <item>
      <title>Unable to Reach Mars, Musk Does the Most Musk Thing Possible</title>
      <link>https://gizmodo.com/unable-to-reach-mars-musk-does-the-most-musk-thing-possible-2000719686</link>
      <pubDate>Mon, 09 Feb 2026 16:25:49 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000719686</guid>
      <description>Colonizing Mars has been the ultimate mission of SpaceX for decades, but it would appear that reality is finally setting in for CEO Elon Musk.</description>
    </item>
    <item>
      <title>Google&#8217;s Pixel 9A is back down to $349, its cheapest price so far</title>
      <link>https://www.theverge.com/gadgets/875742/google-pixel9a-switch-2-case-netgear-gigabit-deal-sale</link>
      <pubDate>2026-02-09T11:24:56-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=875742</guid>
      <description>The Pixel 9A is an incredible phone that&#8217;s worth hopping on while it&#8217;s $349 for the 128GB version in blue, black, or pink at Amazon and Best Buy. It&#8217;s discounted ahead of the new Pixel 10A, for which Google will open pre-orders on February 18. That&#8217;s also when the company will share more details regarding [&#8230;]</description>
    </item>
    <item>
      <title>Hacktivist scrapes over 500,000 stalkerware customers&#8217; payment records</title>
      <link>https://techcrunch.com/2026/02/09/hacktivist-scrapes-over-500000-stalkerware-customers-payment-records/</link>
      <pubDate>Mon, 09 Feb 2026 16:20:12 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3090993</guid>
      <description>More than half-a-million people who bought access to phone surveillance and social media snooping apps had their email address and partial payment card numbers published online.</description>
    </item>
    <item>
      <title>&#171;&#160;Votre forfait &#233;volue&#160;&#187; : cette pratique des op&#233;rateurs mobiles a la vie dure, et elle est peut-&#234;tre ill&#233;gale</title>
      <link>https://www.frandroid.com/telecom/2970689_votre-forfait-evolue-cette-pratique-des-operateurs-mobiles-a-la-vie-dure-et-elle-est-peut-etre-illegale</link>
      <pubDate>Mon, 09 Feb 2026 16:17:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2970689_votre-forfait-evolue-cette-pratique-des-operateurs-mobiles-a-la-vie-dure-et-elle-est-peut-etre-illegale</guid>
      <description>
S'il y a bien une pratique commerciale qu'on voudrait voir dispara&#238;tre &#224; tout jamais, c'est la vente quasi-forc&#233;e d'options payantes. Ou du moins celle qui n'appelle pas au consentement explicite des usagers. Une pratique qui n'est pas ill&#233;gale, mais vraiment limite et d&#233;loyale pour les associations de consommateurs.
</description>
    </item>
    <item>
      <title>I've looked through the entire Best Buy Presidents' Day sale - these are the 8 laptop deals I'd recommend to anyone</title>
      <link>https://www.techradar.com/seasonal-sales/ive-looked-through-the-entire-best-buy-presidents-day-sale-these-are-the-8-laptop-deals-id-recommend-to-anyone</link>
      <pubDate>Mon, 09 Feb 2026 16:14:57 +0000</pubDate>
      <guid isPermaLink="false">CBscPBf9nr7UuYxXDZKEM7</guid>
      <description>Need a new laptop? Best Buy's huge Presidents' Day sale is already live and it features excellent price cuts on laptops from Asus, Acer, Dell, and Apple.</description>
    </item>
    <item>
      <title>I tested the Lenovo ThinkVision P27Q-40 - and it's the IT manager&#8217;s dream display, allowing for fleet control at scale, reliability by users, and ease of use for all</title>
      <link>https://www.techradar.com/pro/lenovo-thinkvision-p27q-40-monitor-review</link>
      <pubDate>Mon, 09 Feb 2026 16:14:31 +0000</pubDate>
      <guid isPermaLink="false">Evww2jf7CGqhdT5yU5JsAX</guid>
      <description>The Lenovo ThinkVision P27Q-40 is a reliable 27-inch QHD Panel with decent colors, great blue light filtering, a spectacular variable refresh rate, built in USB-C hub, and integrated fleet management for IT pros to have a handle on their suite of devices</description>
    </item>
    <item>
      <title>I'm overdue a smart speaker upgrade, and these are the 3 models I'm tempted by this Presidents' Day</title>
      <link>https://www.techradar.com/home/smart-home/im-overdue-a-smart-speaker-upgrade-and-these-are-the-3-models-im-tempted-by-this-presidents-day</link>
      <pubDate>Mon, 09 Feb 2026 16:14:21 +0000</pubDate>
      <guid isPermaLink="false">Ujbx5ewZyb3TT7xnUA7Yh5</guid>
      <description>President's Day sales are here, and if you're after a smart speaker upgrade like me, these are the deals I'm tempted by.</description>
    </item>
    <item>
      <title>Misinformation is scaling. We need to get better at countering it</title>
      <link>https://www.fastcompany.com/91486049/misinformation-scaling-we-need-get-better-countering-it</link>
      <pubDate>2026-02-09T16:14:02</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91486049/misinformation-scaling-we-need-get-better-countering-it</guid>
      <description>AI tools are supercharging scams, deepfakes, and doubt. Journalists can&#8217;t debunk it all&#8212;but they can help.
Most days, an email lands in my inbox with the promise to amplify my growth&#8212;my newsletter subscribers, the reach of my podcasts, the number of client leads, etc. I&#8217;ve gotten used to random people pitching me on their services, and some of the messages expertly prey on my insecurities as a business owner (&#8220;you&#8217;re leaving so much on the table,&#8221; et al.). I never answer any of them, but I sometimes wonder which ones might actually be legit....</description>
    </item>
    <item>
      <title>Listen up: The AirPods Pro 2 are in stock and just 99 cents away from their lowest price ever</title>
      <link>https://mashable.com/article/feb-9-apple-airpods-pro-2-deal</link>
      <pubDate>Mon, 09 Feb 2026 16:13:17 +0000</pubDate>
      <guid isPermaLink="false">00cmhy7SJU08d53zHUYZNji</guid>
      <description>Grab the Apple AirPods Pro for just $139.99 at Woot through Feb. 15 (or until supplies last).</description>
    </item>
    <item>
      <title>To Succeed, the Next-Gen Xbox Needs to Steal These PC Features</title>
      <link>https://gizmodo.com/to-succeed-the-next-gen-xbox-needs-to-steal-these-pc-features-2000719649</link>
      <pubDate>Mon, 09 Feb 2026 16:11:31 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000719649</guid>
      <description>You may have more than one choice of next-gen Xbox, and not just from Microsoft.</description>
    </item>
    <item>
      <title>OpenAI : 100 milliards, de la pub et une croissance &#171;&#160;folle&#160;&#187;, la contre-attaque de Sam Altman</title>
      <link>https://www.frandroid.com/marques/openai/2971421_openai-100-milliards-de-la-pub-et-une-croissance-folle-la-contre-attaque-de-sam-altman</link>
      <pubDate>Mon, 09 Feb 2026 16:07:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/openai/2971421_openai-100-milliards-de-la-pub-et-une-croissance-folle-la-contre-attaque-de-sam-altman</guid>
      <description>
Alors qu'OpenAI s'appr&#234;te &#224; boucler une lev&#233;e de fonds titanesque de 100 milliards de dollars, Sam Altman rassure ses troupes : la machine est relanc&#233;e. Mais cette reconqu&#234;te face &#224; la concurrence a un prix : l'arriv&#233;e controvers&#233;e de la publicit&#233; sur ChatGPT d&#233;bute officiellement aujourd'hui.
</description>
    </item>
    <item>
      <title>Leaked specs for Sony&#8217;s next flagship wireless earbuds reveal ANC upgrades</title>
      <link>https://www.theverge.com/tech/875782/sony-wf-1000xm6-earbuds-spec-leak</link>
      <pubDate>2026-02-09T11:05:03-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=875782</guid>
      <description>Following images of Sony's new WF-1000XM6 earbuds shared by a retailer last week ahead of an official announcement, reliable leaker billbil-kun has revealed what they're claiming are the full specs and new features of the company's next flagship buds. The WF-1000XM6 will be powered by a new QN3e processor that's "three times faster" than what's [&#8230;]</description>
    </item>
    <item>
      <title>Dunkin is giving away free iced coffee on Feb. 9 &#8212; how to redeem this limited-time offer</title>
      <link>https://mashable.com/article/dunkin-free-coffee-promo-code</link>
      <pubDate>Mon, 09 Feb 2026 16:01:39 +0000</pubDate>
      <guid isPermaLink="false">01AjsKIsywfBtQ5zKIEGJJp</guid>
      <description>How to get free coffee from Dunkin' &#8212; get a free iced coffee with this promo code on Feb. 9.</description>
    </item>
    <item>
      <title>Your Daily Coffee Fix Could Be a Secret Weapon Against Dementia, Study Finds</title>
      <link>https://gizmodo.com/your-daily-coffee-fix-could-be-a-secret-weapon-again-dementia-study-finds-2000719622</link>
      <pubDate>Mon, 09 Feb 2026 16:00:37 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000719622</guid>
      <description>New research finds caffeinated coffee or tea consumption is linked to reduced dementia risk.</description>
    </item>
    <item>
      <title>The Hits, Misses, and Snubs of the Super Bowl 2026 Trailers</title>
      <link>https://gizmodo.com/super-bowl-trailers-2026-best-worst-2000719348</link>
      <pubDate>Mon, 09 Feb 2026 16:00:07 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000719348</guid>
      <description>We had promos of astronauts, mercenaries, and Mario through Super Bowl LX. How'd they all stack up against each other?</description>
    </item>
    <item>
      <title>We might finally be getting Linux 7.0 at last</title>
      <link>https://www.techradar.com/pro/we-might-finally-be-getting-linux-7-0-at-last</link>
      <pubDate>Mon, 09 Feb 2026 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">GUVDQrWs8fX2aomk7tKaeL</guid>
      <description>Linux 6.19 is out which can only mean one thing &#8211; Torvalds confirms Linux 7.0 is coming next.</description>
    </item>
    <item>
      <title>Linux 6.19 arrives with a teaser for Linux 7.0</title>
      <link>https://www.theverge.com/tech/875784/linux-kernel-7-0-announced</link>
      <pubDate>2026-02-09T10:58:43-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=875784</guid>
      <description>On Sunday, Linux developer Linus Torvalds announced the release of Linux 6.19, which will be the last update in this kernel cycle, as previously reported by Phoronix. It adds support for the modern AMDGPU driver for older AMD GCN 1.0 and 1.1 graphics cards, like Radeon HD 7000 series GPUs, along with Vulkan support through [&#8230;]</description>
    </item>
    <item>
      <title>I tested the Lenovo ThinkPad X13 Gen 6 - a featherlight business laptop that's good for on-the-go productivity and only let down by the screen</title>
      <link>https://www.techradar.com/pro/lenovo-thinkpad-x13-gen-6-business-laptop-review</link>
      <pubDate>Mon, 09 Feb 2026 15:55:00 +0000</pubDate>
      <guid isPermaLink="false">Cfe6ysLLyz9i6GTf8gjKBf</guid>
      <description>The Lenovo ThinkPad X13 Gen 6 is a featherlight productivity laptop designed for business professionals on the go.</description>
    </item>
    <item>
      <title>&#8216;You won&#8217;t see what&#8217;s coming next &#8212; I can&#8217;t stop watching&#8217;: fans are hooked on a new Nordic Prime Video show that will keep you up at night</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/you-wont-see-whats-coming-next-i-cant-stop-watching-fans-are-hooked-on-a-new-nordic-prime-video-show-that-will-keep-you-up-at-night</link>
      <pubDate>Mon, 09 Feb 2026 15:53:23 +0000</pubDate>
      <guid isPermaLink="false">LfiJMKbSjLo4pL8KTbXtWZ</guid>
      <description>You don&#8217;t need The Killing or Trapped &#8212; this new Prime Video show is the perfect Nordic Noir to stream during the woeful winter weather.</description>
    </item>
  </channel>
</rss>
