<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 20 Feb 2026 14:42:38 GMT</lastBuildDate>
    <item>
      <title>&#171;&#160;Une superintelligence ferait mieux que moi&#160;&#187; : le constat choc de Sam Altman sur nos emplois</title>
      <link>https://www.01net.com/actualites/une-superintelligence-ferait-mieux-que-moi-le-constat-choc-de-sam-altman-sur-nos-emplois.html</link>
      <pubDate>Fri, 20 Feb 2026 14:32:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327153</guid>
      <description>En Inde, le patron d'OpenAI, Sam Altman, pr&#233;dit une superintelligence capable de surpasser les humains d'ici 2028. M&#234;me les PDG vont trinquer.</description>
    </item>
    <item>
      <title>YouTube d&#233;ploie Gemini sur TV : ce nouveau bouton permet d&#8217;interroger les vid&#233;os</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2984847_youtube-deploie-gemini-sur-tv-ce-nouveau-bouton-permet-dinterroger-les-videos</link>
      <pubDate>Fri, 20 Feb 2026 14:30:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2984847_youtube-deploie-gemini-sur-tv-ce-nouveau-bouton-permet-dinterroger-les-videos</guid>
      <description>
Fini le temps o&#249; vous regardiez passivement une recette de cuisine en essayant de deviner les proportions. Google d&#233;ploie actuellement son bouton &#171; Demander &#187; (Ask), propuls&#233; par l'intelligence artificielle Gemini, directement sur l'application YouTube de votre t&#233;l&#233;viseur. Une nouveaut&#233; qui promet de changer notre fa&#231;on de consommer la vid&#233;o depuis le canap&#233;.
...</description>
    </item>
    <item>
      <title>Why investors are going gaga over solid-state transformers</title>
      <link>https://techcrunch.com/2026/02/20/why-investors-are-going-gaga-over-solid-state-transformers/</link>
      <pubDate>Fri, 20 Feb 2026 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3094571</guid>
      <description>The technology promises to replace several parts of the grid with one device that&#8217;s both controllable and updatable.</description>
    </item>
    <item>
      <title>Nintendo&#8217;s next big Pok&#233;mon presentation is on February 27th</title>
      <link>https://www.theverge.com/games/881332/nintendo-pokemon-presents-pokemon-day</link>
      <pubDate>2026-02-20T09:25:52-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=881332</guid>
      <description>Pok&#233;mon Day is always a big deal for Nintendo fans, but with this year being the franchise's 30th anniversary, the next Pok&#233;mon Presents stream is likely to bring the heat when it begins on February 27th at 9AM ET. With Pok&#233;mon Legends: Z-A behind us and Pok&#233;mon Pokopia right around the corner, chances are high [&#8230;]</description>
    </item>
    <item>
      <title>Google rejected nearly two million Android apps and blocked more than 80,000 developer accounts from Google Play in 2025</title>
      <link>https://www.techradar.com/pro/security/google-rejected-nearly-two-million-android-apps-and-blocked-more-than-80-000-developer-accounts-from-google-play-in-2025</link>
      <pubDate>Fri, 20 Feb 2026 14:20:00 +0000</pubDate>
      <guid isPermaLink="false">StxmtA87wE3zK5878RHrVS</guid>
      <description>The numbers of removed apps and accounts are less than previous years, but still worryingly high.</description>
    </item>
    <item>
      <title>Avec 40 % de remise sur le The Frame 2025, c&#8217;est la chute de prix qu&#8217;on attendait pour le plus beau t&#233;l&#233;viseur de Samsung</title>
      <link>https://www.frandroid.com/bons-plans/2869427_avec-40-de-remise-sur-le-the-frame-2025-cest-la-chute-de-prix-quon-attendait-pour-le-plus-beau-televiseur-de-samsung</link>
      <pubDate>Fri, 20 Feb 2026 14:18:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2869427_avec-40-de-remise-sur-le-the-frame-2025-cest-la-chute-de-prix-quon-attendait-pour-le-plus-beau-televiseur-de-samsung</guid>
      <description>
Le TV Samsung The Frame est l&#8217;un des plus originaux avec son design atypique en forme de tableau.&#160;Celui de 2025 met le paquet avec un taux de rafra&#238;chissement &#224; 144 Hz et si vous attendiez un prix accessible, c'est le moment : la version 55 pouces passe de 1 490 euros &#224; 879 euros. 
</description>
    </item>
    <item>
      <title>New Research Suggests You Actually Want QR Code Menus Replaced by&#8230; Augmented Reality?</title>
      <link>https://gizmodo.com/new-research-suggests-you-actually-want-qr-code-menus-replaced-by-augmented-reality-2000724318</link>
      <pubDate>Fri, 20 Feb 2026 14:10:07 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000724318</guid>
      <description>Could a 3D burger spinning on your phone screen save the restaurant industry?</description>
    </item>
    <item>
      <title>Le Pixel 11 devrait s&#233;rieusement muscler son jeu sur la s&#233;curit&#233;</title>
      <link>https://www.frandroid.com/marques/google/2984757_le-pixel-11-devrait-serieusement-muscler-son-jeu-sur-la-securite</link>
      <pubDate>Fri, 20 Feb 2026 14:06:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2984757_le-pixel-11-devrait-serieusement-muscler-son-jeu-sur-la-securite</guid>
      <description>
Alors que le Pixel 10 est sorti depuis peu, c'est d&#233;j&#224; son successeur qui fait parler de lui. Selon de nouvelles fuites, le Google Pixel 11, propuls&#233; par la future puce Tensor G6, s&#8217;appr&#234;terait &#224; int&#233;grer une nouvelle version de sa puce de s&#233;curit&#233; Titan introduite en 2021.
</description>
    </item>
    <item>
      <title>Dangerous Massiv Android malware poses as IPTV app to infect devices and steal banking info</title>
      <link>https://www.techradar.com/pro/security/dangerous-massiv-android-malware-poses-as-iptv-app-to-infect-devices-and-steal-banking-info</link>
      <pubDate>Fri, 20 Feb 2026 14:04:13 +0000</pubDate>
      <guid isPermaLink="false">dh7YFed7AjawGUd2RqzUh3</guid>
      <description>Fake IPTV apps used as covers for malware are rising in popularity, researchers discover.</description>
    </item>
    <item>
      <title>Une IA a voulu &#171;&#160;supprimer et recr&#233;er l&#8217;environnement&#160;&#187; d&#8217;un serveur Amazon&#8230; et a provoqu&#233; une panne</title>
      <link>https://www.01net.com/actualites/une-ia-a-voulu-supprimer-et-recreer-lenvironnement-dun-serveur-amazon-et-a-provoque-une-panne.html</link>
      <pubDate>Fri, 20 Feb 2026 14:03:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327197</guid>
      <description>Mettre l'IA aux commandes d'un serveur n'est peut-&#234;tre pas une tr&#232;s bonne id&#233;e. Amazon Web Services a connu au moins deux interruptions de service ces derniers mois. En cause : des agents IA sp&#233;cialis&#233;s dans le d&#233;veloppement logiciel qui ont provoqu&#233; des pannes en faisant n'importe quoi. Amazon affirme n&#233;anmoins qu'il s'agissait d'erreur humaine.</description>
    </item>
    <item>
      <title>It Might Be an Even Longer Wait for &#8216;KPop Demon Hunters 2&#8217;</title>
      <link>https://gizmodo.com/kpop-demon-hunters-2-production-update-release-date-2000724187</link>
      <pubDate>Fri, 20 Feb 2026 14:00:49 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000724187</guid>
      <description>Plus, 'Scream 7' can't escape the long arm of 'Scary Movie 6'.</description>
    </item>
    <item>
      <title>The first discount on Samsung's newest cheap tablet has landed</title>
      <link>https://www.techradar.com/tablets/the-first-discount-on-samsungs-newest-cheap-tablet-has-landed</link>
      <pubDate>Fri, 20 Feb 2026 14:00:30 +0000</pubDate>
      <guid isPermaLink="false">8vpgM5fUH3KnePMpNUBKYm</guid>
      <description>The Samsung Galaxy Tab A11 Plus just got its first ever discount at Amazon, making the cheap yet capable tablet even more affordable.</description>
    </item>
    <item>
      <title>Nintendo turned its biggest flop into an expensive, uncomfortable novelty</title>
      <link>https://www.theverge.com/games/881677/nintendo-switch-virtual-boy-review</link>
      <pubDate>2026-02-20T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=881677</guid>
      <description>I've written about a lot of different video game hardware over the years, from new consoles to retro gadgets to whatever you want to call the Playdate. But I can't remember ever being perpetually sore from testing a device; such are the joys of the Virtual Boy. Nintendo has turned its biggest flop into an [&#8230;]</description>
    </item>
    <item>
      <title>What is the release date for A Knight of the Seven Kingdoms episode 6 on HBO Max?</title>
      <link>https://www.techradar.com/streaming/hbo-max/what-is-the-release-date-for-a-knight-of-the-seven-kingdoms-episode-6-on-hbo-max</link>
      <pubDate>Fri, 20 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">BK73pG5ZkXGkFofGVjqCgC</guid>
      <description>The final episode of A Knight of the Seven Kingdoms' debut season comes out soon &#8212; here's when and where you can watch it.</description>
    </item>
    <item>
      <title>OpenAI says 18 to 24-year-olds account for nearly 50% of ChatGPT usage in India</title>
      <link>https://techcrunch.com/2026/02/20/openai-says-18-to-24-year-olds-account-for-nearly-50-of-chatgpt-usage-in-india/</link>
      <pubDate>Fri, 20 Feb 2026 13:57:03 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3094890</guid>
      <description>The company said on Friday that users between 18 and 24 years of age account for nearly 50% of all messages sent by Indians to ChatGPT, and users under 30 accounted for 80% of usage in the country.</description>
    </item>
    <item>
      <title>Fuite de donn&#233;es chez PayPal&#160;: des transactions non autoris&#233;es ont touch&#233; certains comptes</title>
      <link>https://www.01net.com/actualites/fuite-donnees-paypal-transactions-non-autorisees-touche-certains-comptes.html</link>
      <pubDate>Fri, 20 Feb 2026 13:55:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327169</guid>
      <description>PayPal r&#233;v&#232;le avoir &#233;t&#233; victime d'une fuite de donn&#233;es. Pendant pr&#232;s de six mois, des donn&#233;es sensibles de clients, dont des num&#233;ros de s&#233;curit&#233; sociale, ont &#233;t&#233; collect&#233;es par des pirates. La faille a conduit &#224; des transactions frauduleuses.</description>
    </item>
    <item>
      <title>A brave YouTuber just modded their iPhone Air with a transparent case and built-in SIM card slot thanks to a 'dream collaboration' &#8212; but it isn't for the faint-hearted</title>
      <link>https://www.techradar.com/phones/a-brave-youtuber-just-modded-their-iphone-air-with-a-transparent-case-and-built-in-sim-card-slot-thanks-to-a-dream-collaboration-but-it-isnt-for-the-faint-hearted</link>
      <pubDate>Fri, 20 Feb 2026 13:48:55 +0000</pubDate>
      <guid isPermaLink="false">RTvqPURCScM3qJseu9EcjT</guid>
      <description>One YouTuber hacked their iPhone Air to give it a transparent back and a SIM card slot. But the fresh new design also comes with a few downsides.</description>
    </item>
    <item>
      <title>Your Coffee Grinder Is as Important as Your Brewer&#8212;Here Are the 5 Best We&#8217;ve Tested</title>
      <link>https://www.wired.com/gallery/best-coffee-grinders/</link>
      <pubDate>Fri, 20 Feb 2026 13:42:18 +0000</pubDate>
      <guid isPermaLink="false">5ea0453804fd570008ac40e5</guid>
      <description>We used particle size analysis and real-world testing to find the best conical burr, flat burr, and blade grinders for every budget and style of coffee drinker.</description>
    </item>
    <item>
      <title>Wildlight Entertainment announces Highguard update that will add a new Base and Raid Tool despite recent website troubles</title>
      <link>https://www.techradar.com/gaming/wildlight-entertainment-announces-highguard-update-that-will-add-a-new-base-and-raid-tool-despite-recent-website-troubles</link>
      <pubDate>Fri, 20 Feb 2026 13:41:32 +0000</pubDate>
      <guid isPermaLink="false">KmkghD2QksNip3aQMkxk9j</guid>
      <description>Despite recent website troubles, Wildlight Entertainment has confirmed that Highguard is still alive with the announcement of a new content update.</description>
    </item>
    <item>
      <title>Amazon officially dethrones Walmart as America's biggest company - and it's not done yet</title>
      <link>https://www.techradar.com/pro/amazon-officially-dethrones-walmart-as-americas-biggest-company-and-its-not-done-yet</link>
      <pubDate>Fri, 20 Feb 2026 13:35:00 +0000</pubDate>
      <guid isPermaLink="false">Zgw3pmarpromg5wujGFhnW</guid>
      <description>Amazon's full-year revenue has surpassed Walmart's, knocking Walmart off the top after 13 years.</description>
    </item>
    <item>
      <title>I&#8217;ve been happily using the Canon EOS R5 for four years &#8211; here&#8217;s why I&#8217;m skipping the Mark II</title>
      <link>https://www.techradar.com/cameras/mirrorless-cameras/ive-been-happily-using-the-canon-eos-r5-for-four-years-heres-why-im-skipping-the-mark-ii</link>
      <pubDate>Fri, 20 Feb 2026 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">KcPVnN8bW4VoKsXeKLKRzS</guid>
      <description>Canon's EOS R5 was so ahead of its time in 2020 that I'm still using it professionally in 2026 &#8211; here's why I'm holding out for the Mark III version before I upgrade</description>
    </item>
    <item>
      <title>Envie d&#8217;un setup gaming XXL ? Ce moniteur MSI incurv&#233; de 49 pouces (OLED et 144 Hz) est &#224; -40 %</title>
      <link>https://www.frandroid.com/bons-plans/2579129_envie-dun-setup-gaming-xxl-ce-moniteur-msi-incurve-de-49-pouces-oled-et-144-hz-est-a-40</link>
      <pubDate>Fri, 20 Feb 2026 13:26:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2579129_envie-dun-setup-gaming-xxl-ce-moniteur-msi-incurve-de-49-pouces-oled-et-144-hz-est-a-40</guid>
      <description>
Le MSI MPG 491CQP QD-OLED promet une immersion totale avec sa dalle incurv&#233;e XXL de 49 pouces, une fluidit&#233; exemplaire &#224; 144 Hz et une qualit&#233; d&#8217;image &#233;blouissante. Bonne nouvelle : il est actuellement en promo &#224; 792 euros au lieu de 1 399 euros au d&#233;part.
</description>
    </item>
    <item>
      <title>Engadget Podcast: Instagram on trial and the RAMaggedon rages on</title>
      <link>https://www.engadget.com/ai/engadget-podcast-instagram-on-trial-and-the-ramaggedon-rages-on-131526178.html?src=rss</link>
      <pubDate>Fri, 20 Feb 2026 13:15:26 +0000</pubDate>
      <guid isPermaLink="false">366667e9-7a72-4f83-aaa7-276278f27551</guid>
      <description>This week, Meta CEO Mark Zuckerberg testified in a landmark social media trial, claiming the company only wanted to make Instagram "useful" and not addictive. In this episode, we chat about Zuck's testimony and the potential implications of this trial for social media companies. Also, we dive into the latest effects of the RAMaggedon RAM shortage, including a potential PlayStation 6 delay and a dire future for practically every consumer electronics company.Subscribe!iTunesSpotifyPocket CastsStitcherGoogle PodcastsTopicsMark Zuckerberg testifies that Instagram was meant to be &#8220;useful,&#8221; not addi...</description>
    </item>
    <item>
      <title>Frozen food products sold at Trader Joe&#8217;s may have glass fragments. Toss this recalled chicken fried rice</title>
      <link>https://www.fastcompany.com/91495931/frozen-food-products-sold-at-trader-joes-may-have-glass-fragments-toss-this-recalled-chicken-fried-rice</link>
      <pubDate>2026-02-20T13:14:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91495931/frozen-food-products-sold-at-trader-joes-may-have-glass-fragments-toss-this-recalled-chicken-fried-rice</guid>
      <description>According to the USDA, more than 3 million pounds of not-ready-to-eat products are being recalled after customers complained of glass in the rice. 
You can put a lot of different things in fried rice, but certainly not glass. Unfortunately, that might be an ingredient in certain packages of Trader Joe&#8217;s chicken fried rice.</description>
    </item>
    <item>
      <title>How to watch Canada vs. Finland in mens ice hockey online for free</title>
      <link>https://mashable.com/article/canada-finland-winter-ice-hockey-2026-live-stream-for-free</link>
      <pubDate>Fri, 20 Feb 2026 13:11:18 +0000</pubDate>
      <guid isPermaLink="false">03sFSD0zciL7nluzsbWegO3</guid>
      <description>How to watch ice hockey for free. Live stream Canada vs. Finland in men's ice hockey for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Score a record-low price on the Magic: The Gathering Avatar The Last Airbender Collector Booster Box &#8212; save over $100 at Amazon</title>
      <link>https://mashable.com/article/feb-20-magic-the-gathering-avatar-the-last-airbender-collector-booster</link>
      <pubDate>Fri, 20 Feb 2026 13:06:00 +0000</pubDate>
      <guid isPermaLink="false">03j8O8vUsN1tV32R0YqMhdR</guid>
      <description>The MTG Avatar: The Last Airbender Collector Booster Box drops to a record-low $346.16 at Amazon, letting you save over $100.</description>
    </item>
    <item>
      <title>Hubble r&#233;v&#232;le une &#233;nigmatique galaxie compos&#233;e presque uniquement de mati&#232;re noire !</title>
      <link>https://www.futura-sciences.com/sciences/actualites/matiere-noire-hubble-revele-enigmatique-galaxie-composee-presque-uniquement-matiere-noire-131451/#xtor%3DRSS-8</link>
      <pubDate>Fri, 20 Feb 2026 14:03:36 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/matiere-noire-hubble-revele-enigmatique-galaxie-composee-presque-uniquement-matiere-noire-131451/#xtor%3DRSS-8</guid>
      <description>Depuis un si&#232;cle, les t&#233;lescopes ne cessent de nous montrer &#224; quel point est riche et vari&#233; le fameux &#171; Royaume des n&#233;buleuses&#160;&#187; de Edwin Hubble pour reprendre le titre d'un c&#233;l&#232;bre ouvrage de l'astronome &#233;tats-unien. Le t&#233;lescope portant son nom continue &#224; contribuer &#224; notre &#233;tonnement et notre...</description>
    </item>
    <item>
      <title>Grab the Lego Star Wars: The Phantom Menace Mos Espa Podrace set for under $60 at Amazon</title>
      <link>https://mashable.com/article/feb-20-lego-star-wars-phantom-menace-mos-espa-podrace-deal</link>
      <pubDate>Fri, 20 Feb 2026 13:01:55 +0000</pubDate>
      <guid isPermaLink="false">02O6ZTYUld2cq2blecDbGEm</guid>
      <description>As of Feb. 20, the Lego Star Wars: The Phantom Menace Mos Espa Podrace set is on sale at Amazon for $55.99, 30% off its list price of $79.99.</description>
    </item>
    <item>
      <title>Wizards of the Coast Has a Very Long Explanation for Why It Changed Raph&#8217;s Weapon in the Ninja Turtles &#8216;Magic&#8217; Set</title>
      <link>https://gizmodo.com/magic-the-gathering-teenage-mutant-ninja-turtles-raphael-weapon-sai-2000724311</link>
      <pubDate>Fri, 20 Feb 2026 13:00:48 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000724311</guid>
      <description>No, it's not an art error: Raph's weapon of choice has had a bit of a tweak for the new 'Teenage Mutant Ninja Turtles' set for 'Magic: The Gathering.'</description>
    </item>
    <item>
      <title>Epilogue GB Operator Review: Play Your Game Boy Games on a Laptop</title>
      <link>https://www.wired.com/review/epilogue-gb-operator/</link>
      <pubDate>Fri, 20 Feb 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">6995e47e491f7983f585c77e</guid>
      <description>Epilogue&#8217;s adorable GB Operator plug-in gizmo is a must-have for collectors of retro Nintendo Game Boy games.</description>
    </item>
    <item>
      <title>Meta will ruin its smart glasses by being Meta</title>
      <link>https://www.theverge.com/column/881744/meta-smart-glasses-facial-recognition-rayban-privacy-wearables</link>
      <pubDate>2026-02-20T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=881744</guid>
      <description>Whenever I write about Meta's Ray-Ban smart glasses, I already know the comments I'm going to get. Cool hardware, but hard pass on anything Meta makes; will wait for someone else to come along. It's hard to imagine that sentiment changing anytime soon after The New York Times reported that Meta mulled launching facial recognition [&#8230;]</description>
    </item>
    <item>
      <title>US website 'freedom.gov' will allow Europeans to view hate speech and other blocked content</title>
      <link>https://www.engadget.com/big-tech/us-website-freedomgov-will-allow-europeans-to-view-hate-speech-and-other-blocked-content-130000014.html?src=rss</link>
      <pubDate>Fri, 20 Feb 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">b25e4c65-3f68-42b7-b8f1-a2deea5a8628</guid>
      <description>The US State Department is building a web portal, where Europeans and anyone else can see online content banned by their governments, according to Reuters. It was supposed to be launched at Munich Security Conference last month, but some state department officials reportedly voiced their concerns about the project. The portal will be hosted on freedom.gov, which currently just shows the image above. &#8220;Freedom is Coming,&#8221; the homepage reads. &#8220;Information is power. Reclaim your human right to free expression. Get Ready.&#8221;Reuters says officials discussed making a virtual private network function av...</description>
    </item>
    <item>
      <title>These Olympics show a clear demand for gender equity</title>
      <link>https://www.fastcompany.com/91494795/these-olympics-show-a-clear-demand-for-gender-equity</link>
      <pubDate>2026-02-20T13:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91494795/these-olympics-show-a-clear-demand-for-gender-equity</guid>
      <description>Why is the U.S. still lagging behind?
</description>
    </item>
    <item>
      <title>The Logitech G435 wireless gaming headset is at its best price in 2026 &#8212; save $40 on Amazon</title>
      <link>https://mashable.com/article/feb-20-logitech-g435-wireless-gaming-headset-deal</link>
      <pubDate>Fri, 20 Feb 2026 12:49:14 +0000</pubDate>
      <guid isPermaLink="false">01M82y4Lz2KAAGozhzLKyuW</guid>
      <description>Logitech G435 Lightspeed wireless gaming headset falls to $39.99 at Amazon &#8212; 50% off, and its best price of the year.</description>
    </item>
    <item>
      <title>Tesla&amp;#8217;s cheaper $60,000 Cybertruck is still a Cybertruck</title>
      <link>https://www.theverge.com/transportation/881873/tesla-cybertruck-awd-price-cut</link>
      <pubDate>2026-02-20T07:47:12-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=881873</guid>
      <description>Tesla has announced a new all-wheel drive Cybertruck that starts at $59,990, the cheapest the controversial truck has been sold for yet - though still well above the $40,000 price tag Elon Musk had initially promised. It's been joined by a $15,000 price cut for the high-end Cyberbeast variant, as Tesla doubles down on its [&#8230;]</description>
    </item>
    <item>
      <title>The OpenAI mafia: 18 startups founded by alumni</title>
      <link>https://techcrunch.com/2026/02/20/the-openai-mafia-15-of-the-most-notable-startups-founded-by-alumni/</link>
      <pubDate>Fri, 20 Feb 2026 12:45:55 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=2998812</guid>
      <description>The OpenAI mafia: 15 of the most notable startups founded by alumni</description>
    </item>
    <item>
      <title>LA County lawsuit accuses Roblox of exposing children to 'grooming and exploitation'</title>
      <link>https://www.engadget.com/gaming/la-county-lawsuit-accuses-roblox-of-exposing-children-to-grooming-and-exploitation-124523028.html?src=rss</link>
      <pubDate>Fri, 20 Feb 2026 12:45:23 +0000</pubDate>
      <guid isPermaLink="false">34f460d4-ce66-4b9c-acc0-6b841ce9e7b7</guid>
      <description>Los Angeles County has sued Roblox for "unfair and deceptive business practices," claiming the platform's moderation and age-verification systems are inadequate. "Roblox portrays its platform as a safe and appropriate place for children to play," the complaint states. "In reality, and as Roblox well knows, the design of its platform makes children easy prey for pedophiles."&#160;
Representatives accused Roblox of failing to implement adequate platform safety features to prevent child endangerment. "Specifically, Roblox has not effectively moderated game content or enforced age-appropriate restricti...</description>
    </item>
    <item>
      <title>To celebrate The Legend of Zelda&#8217;s 40th anniversary, I&#8217;m splashing out on some of the best merch and games the franchise has to offer</title>
      <link>https://www.techradar.com/gaming/ps5/zelda-40th-anniversary-collection</link>
      <pubDate>Fri, 20 Feb 2026 12:43:32 +0000</pubDate>
      <guid isPermaLink="false">VcyAemi95gsB7amdKP2MEH</guid>
      <description>The Legend of Zelda turns 40 today, meaning there's no better time to shop for the best merch, games and accessories</description>
    </item>
  </channel>
</rss>
