<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 05 Dec 2025 08:33:36 GMT</lastBuildDate>
    <item>
      <title>Xiaomi Poco X7 Pro : en rupture de stock sur son site officiel, le champion du gaming perd plus de 150 &#8364; sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2899151_xiaomi-poco-x7-pro-en-rupture-de-stock-sur-son-site-officiel-le-champion-du-gaming-perd-plus-de-150-e-sur-amazon</link>
      <pubDate>Fri, 05 Dec 2025 08:32:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2899151_xiaomi-poco-x7-pro-en-rupture-de-stock-sur-son-site-officiel-le-champion-du-gaming-perd-plus-de-150-e-sur-amazon</guid>
      <description>
Sorti en d&#233;but d&#8217;ann&#233;e, le Poco X7 Pro n&#8217;a pas mis longtemps &#224; dispara&#238;tre des &#233;tals : victime de son propre succ&#232;s, il est introuvable sur le site de Xiaomi depuis des semaines. Mais c'est sans compter sur Amazon qui le propose en promo &#224; 269 euros au lieu des 433 euros pour sa version 512 Go. 
</description>
    </item>
    <item>
      <title>Un Xiaomi Store pose ses valises &#224; V&#233;lizy 2&#160;: ce qui vous attend pour l&#8217;ouverture de ce vendredi</title>
      <link>https://www.01net.com/actualites/un-xiaomi-store-pose-ses-valises-a-velizy-2-ce-qui-vous-attend-pour-louverture-de-ce-vendredi.html</link>
      <pubDate>Fri, 05 Dec 2025 08:30:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313850</guid>
      <description>Ce vendredi 5 d&#233;cembre, Xiaomi inaugure sa seconde boutique en propre en France, au centre commercial Westfield V&#233;lizy 2. Une ouverture qui confirme la nouvelle strat&#233;gie de la marque : reprendre la main sur sa distribution physique apr&#232;s les &#233;checs du pass&#233;, tout en arrosant les premiers clients de cadeaux.</description>
    </item>
    <item>
      <title>Tesla lance la voiture la moins ch&#232;re de son histoire en France : voici la Model 3 Standard</title>
      <link>https://www.frandroid.com/marques/tesla/2899617_tesla-lance-la-voiture-la-moins-chere-de-son-histoire-en-france-voici-la-model-3-standard</link>
      <pubDate>Fri, 05 Dec 2025 08:27:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2899617_tesla-lance-la-voiture-la-moins-chere-de-son-histoire-en-france-voici-la-model-3-standard</guid>
      <description>
Quelques semaines apr&#232;s sa pr&#233;sentation, la nouvelle Tesla Model 3 standard est disponible &#224; la commande en France. La voiture &#233;lectrique abordable d&#233;marre &#224; seulement 36 990 euros dans cette version. C'est la moins ch&#232;re des Tesla de l'histoire.
</description>
    </item>
    <item>
      <title>Adieu les casques, bonjour les lunettes : Meta l&#226;cherait le m&#233;tavers pour tout miser sur l&#8217;IA</title>
      <link>https://www.frandroid.com/marques/meta/2899601_adieu-les-casques-bonjour-les-lunettes-meta-lacherait-le-metavers-pour-tout-miser-sur-lia</link>
      <pubDate>Fri, 05 Dec 2025 08:18:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2899601_adieu-les-casques-bonjour-les-lunettes-meta-lacherait-le-metavers-pour-tout-miser-sur-lia</guid>
      <description>
D'apr&#232;s les informations de l'agence Bloomberg, Meta aurait d&#233;cid&#233; de l&#226;cher du lest sur le m&#233;tavers afin de r&#233;orienter sa strat&#233;gie vers l'intelligence artificielle. 
</description>
    </item>
    <item>
      <title>01net Awards&#160;: la meilleure barre de son de l&#8217;ann&#233;e est&#8230;</title>
      <link>https://www.01net.com/actualites/01net-awards-la-meilleure-barre-de-son-de-lannee-est.html</link>
      <pubDate>Fri, 05 Dec 2025 08:12:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313823</guid>
      <description>La r&#233;daction de 01net.com d&#233;signe les meilleurs produits de l&#8217;ann&#233;e. D&#233;couvrez tous les jours les vainqueurs de chaque cat&#233;gorie jusqu&#8217;&#224; la remise des prix le 10 d&#233;cembre, en live s&#8217;il vous plait !</description>
    </item>
    <item>
      <title>Your company needs a neurodiversity coach</title>
      <link>https://www.fastcompany.com/91441024/can-coaching-help-neurodiverse-individuals-thrive-at-work</link>
      <pubDate>2025-12-05T08:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91441024/can-coaching-help-neurodiverse-individuals-thrive-at-work</guid>
      <description>Neurodiversity diagnoses are on the rise, and it manifests differently in every individual. To help employees thrive, businesses need to embrace that.
Before becoming a coach for neurodiverse individuals with ADHD, Justine Capelle Collis had a successful advertising career. She worked in Australia and the UK, and also across the US and Canadian markets. Her clients have included Fortune 500 companies and government agencies.&#160;...</description>
    </item>
    <item>
      <title>Netflix est &#224; deux doigts de racheter Warner Bros (HBO, Harry Potter, Game of Thrones)</title>
      <link>https://www.frandroid.com/services/svod/2899611_netflix-est-a-deux-doigts-de-racheter-warner-bros-hbo-harry-potter-game-of-thrones</link>
      <pubDate>Fri, 05 Dec 2025 07:48:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2899611_netflix-est-a-deux-doigts-de-racheter-warner-bros-hbo-harry-potter-game-of-thrones</guid>
      <description>
C&#8217;est un accord qui pourrait durablement transformer le paysage audiovisuel mondial. Dans un retournement de situation inattendue, Netflix est rentr&#233; en n&#233;gociations exclusives pour racheter Warner Bros Discovery et toutes ses licences phares.
</description>
    </item>
    <item>
      <title>I tested the Hinomi H2 Pro - and this office chair folds in half and has some wild lumbar support</title>
      <link>https://www.techradar.com/pro/hinomi-h2-pro-office-chair-review</link>
      <pubDate>Fri, 05 Dec 2025 07:47:00 +0000</pubDate>
      <guid isPermaLink="false">gcfBeUfccxbwvH5CXiHFnS</guid>
      <description>Hinomi's H2 Pro builds on the H1 Pro we reviewed earlier this year, retaining the ability to fold and making adjustments in other areas.</description>
    </item>
    <item>
      <title>Prise en main du Huawei Mate 80 Pro Max : il ne passe pas inaper&#231;u</title>
      <link>https://www.frandroid.com/marques/huawei/2899097_prise-en-main-du-huawei-mate-80-pro-max-il-ne-passe-pas-inapercu</link>
      <pubDate>Fri, 05 Dec 2025 07:37:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/huawei/2899097_prise-en-main-du-huawei-mate-80-pro-max-il-ne-passe-pas-inapercu</guid>
      <description>
J'ai pu prendre en main rapidement le Huawei Mate 80 Pro Max. Voici donc quelques photos et quelques petites remarques sur ce t&#233;l&#233;phone tr&#232;s haut de gamme.
</description>
    </item>
    <item>
      <title>Le v&#233;lo&#160;&#233;lectrique pliant de Nakamura devient une bonne alternative &#224; la solution de Decathlon, surtout avec 200 &#8364; de moins</title>
      <link>https://www.frandroid.com/bons-plans/2898401_le-velo-electrique-pliant-de-nakamura-devient-une-bonne-alternative-a-la-solution-de-decathlon-surtout-avec-200-e-de-moins</link>
      <pubDate>Fri, 05 Dec 2025 07:36:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2898401_le-velo-electrique-pliant-de-nakamura-devient-une-bonne-alternative-a-la-solution-de-decathlon-surtout-avec-200-e-de-moins</guid>
      <description>
Le Nakamura Felxy Boost est un v&#233;lo pliant &#224; assistance &#233;lectrique principalement ax&#233; pour les d&#233;placements urbains, &#224; retrouver pour 1 199,99 euros sur Interport au lieu de 1 399,99 euros.
</description>
    </item>
    <item>
      <title>La cam&#233;ra pour toilettes de Kohler n&#8217;est pas si priv&#233;e que &#231;a</title>
      <link>https://www.01net.com/actualites/la-camera-pour-toilettes-de-kohler-nest-pas-si-privee-que-ca.html</link>
      <pubDate>Fri, 05 Dec 2025 07:13:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313831</guid>
      <description>Les images capt&#233;es par la cam&#233;ra Dekoda sont lisibles par son constructeur, Kohler. C'est d&#233;j&#224; un probl&#232;me de confidentialit&#233; en soi, mais ce qui est pire c'est que cet appareil s'installe&#8230; sur la cuvette des toilettes ! Elle sert en effet &#224; analyser les selles et renseigne sur la sant&#233; intestinale du propri&#233;taire.</description>
    </item>
    <item>
      <title>Test de la Harman Kardon Aura Studio 5&#160;: quand le son devient lumi&#232;re, l&#8217;enceinte de salon qui fascine vos sens</title>
      <link>https://www.frandroid.com/marques/harman-kardon/2894147_test-de-la-harman-kardon-aura-studio-5-quand-le-son-devient-lumiere-lenceinte-de-salon-qui-fascine-vos-sens</link>
      <pubDate>Fri, 05 Dec 2025 07:03:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/harman-kardon/2894147_test-de-la-harman-kardon-aura-studio-5-quand-le-son-devient-lumiere-lenceinte-de-salon-qui-fascine-vos-sens</guid>
      <description>
La Harman Kardon Aura Studio 5 est une enceinte de salon design trois voies qui mise autant sur la sc&#232;ne sonore &#224; 360 degr&#233;s que sur un syst&#232;me lumineux tr&#232;s travaill&#233;, avec une puissance de 160 W pens&#233;e pour des pi&#232;ces de taille moyenne &#224; grande. En voici son test complet.&#8203;
</description>
    </item>
    <item>
      <title>Google Messages change sa fa&#231;on d&#8217;afficher les photos</title>
      <link>https://www.01net.com/actualites/google-messages-change-facon-afficher-photos.html</link>
      <pubDate>Fri, 05 Dec 2025 07:01:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313838</guid>
      <description>Google Messages commence &#224; activer la nouvelle interface de son lecteur de photos, avec pas mal de changements au programme.</description>
    </item>
    <item>
      <title>Logitech Promo Code: $25 Off This Holiday Season</title>
      <link>https://www.wired.com/story/logitech-promo-code/</link>
      <pubDate>Fri, 05 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">6719439e8a5bb38da70ec1ba</guid>
      <description>Get an exclusive discount of $25 off $200+ this holiday season when you sign up for Logitech emails.</description>
    </item>
    <item>
      <title>AI is reshaping work. It could also spark an entrepreneurial boom</title>
      <link>https://www.fastcompany.com/91452382/ai-could-spark-the-next-entrepreneurial-boom</link>
      <pubDate>2025-12-05T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91452382/ai-could-spark-the-next-entrepreneurial-boom</guid>
      <description>Workers who pair their expertise with AI&#8217;s capabilities will be the ones who embrace entrepreneurship, turning passion projects into real businesses faster than ever.
For a while now, we&#8217;ve been hearing warnings about AI eliminating jobs. First, it was only at the fringes. But now it&#8217;s starting to bite into roles once thought untouchable. It isn&#8217;t just administrative work, copywriting, or design anymore; even advisory roles, data analytics, and coding are being reshaped by automation.&#160;...</description>
    </item>
    <item>
      <title>5 research-backed tips for powering through the rest of the year</title>
      <link>https://www.fastcompany.com/91452489/5-research-backed-tips-for-powering-through-the-rest-of-the-year</link>
      <pubDate>2025-12-05T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91452489/5-research-backed-tips-for-powering-through-the-rest-of-the-year</guid>
      <description>As deadlines pile up and holiday demands escalate, it&#8217;s easy to feel overwhelmed. These strategies can help.
It&#8217;s the end of the year and the pressure is on, demands are high, and you&#8217;re probably close to the end of your rope as you try to wrap up your remaining projects before the holidays start. If that&#8217;s you, you&#8217;re not alone. Holiday stress is very common: In a survey by LifeStance Health, 57% of respondents said they experience stress over the season....</description>
    </item>
    <item>
      <title>Galaxy Watch Ultra 2 : Samsung lancerait une nouvelle montre &#171; ultra &#187; haut de gamme d&#232;s l&#8217;an prochain</title>
      <link>https://www.frandroid.com/actualites-generales/2899589_galaxy-watch-ultra-2-samsung-lancerait-une-nouvelle-montre-ultra-haut-de-gamme-des-lan-prochain</link>
      <pubDate>Fri, 05 Dec 2025 06:50:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2899589_galaxy-watch-ultra-2-samsung-lancerait-une-nouvelle-montre-ultra-haut-de-gamme-des-lan-prochain</guid>
      <description>
Apr&#232;s une premi&#232;re Galaxy Watch Ultra lanc&#233;e en 2024, Samsung plancherait actuellement sur une Galaxy Watch Ultra 2 attendue en 2026. Celle-ci serait lanc&#233;e &#224; l'&#233;t&#233;, en m&#234;me temps que la future Galaxy Watch 9. 
</description>
    </item>
  </channel>
</rss>
