<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 06 Nov 2025 17:39:56 GMT</lastBuildDate>
    <item>
      <title>Italian political consultant says he was targeted with Paragon spyware</title>
      <link>https://techcrunch.com/2025/11/06/italian-political-consultant-says-he-was-targeted-with-paragon-spyware/</link>
      <pubDate>Thu, 06 Nov 2025 17:35:30 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3065658</guid>
      <description>WhatsApp notified the consultant, who works for left-wing politicians, that his phone was targeted with spyware made by Paragon.</description>
    </item>
    <item>
      <title>En Alsace, l&#8217;usine de Huawei qui n&#8217;a jamais ouvert est visiblement d&#233;j&#224; &#224; vendre</title>
      <link>https://www.01net.com/actualites/en-alsace-lusine-de-huawei-qui-na-jamais-ouvert-est-visiblement-deja-a-vendre.html</link>
      <pubDate>Thu, 06 Nov 2025 17:33:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305685</guid>
      <description>L'usine Huawei de Brumath, projet &#224; 250 millions d'euros, n'accueillera probablement jamais ses 500 employ&#233;s. Ce &#171; site fant&#244;me &#187; serait m&#234;me d&#233;j&#224; en vente, selon plusieurs sources.</description>
    </item>
    <item>
      <title>The latest Blink Video Doorbell is over 50 percent off</title>
      <link>https://www.theverge.com/tech/815637/blink-video-doorbell-second-generation-early-black-friday-deal-sale</link>
      <pubDate>2025-11-06T12:25:43-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815637</guid>
      <description>With Black Friday and the holiday season approaching, packages will start piling up, making now a good time to take steps to protect your doorstep from porch pirates. Thankfully, multiple retailers are already offering early Black Friday discounts on smart security devices to help you keep tabs on deliveries, with Amazon&#8217;s and Best Buy&#8217;s deal [&#8230;]</description>
    </item>
    <item>
      <title>Battlefield REDSEC is a by-the-numbers battle royale that&#8217;s lacking a sense of character, but there&#8217;s no question that Battlefield fits the genre perfectly</title>
      <link>https://www.techradar.com/gaming/battlefield-redsec-is-a-by-the-numbers-battle-royale-thats-lacking-a-sense-of-character-but-theres-no-question-that-battlefield-fits-the-genre-perfectly</link>
      <pubDate>Thu, 06 Nov 2025 17:25:20 +0000</pubDate>
      <guid isPermaLink="false">LQ7kCwvnh7PHFX9Fk6zG3E</guid>
      <description>Battlefield REDSEC is a solid foundation made up of the best bits from your other favorite games, though it&#8217;s in danger of being eclipsed by newer, more innovative competitors.</description>
    </item>
    <item>
      <title>Here&#8217;s the List of 40 Airports Expected to Be Impacted by Shutdown Flight Reductions</title>
      <link>https://gizmodo.com/heres-the-list-of-40-airports-expected-to-be-impacted-by-shutdown-flight-reductions-2000682501</link>
      <pubDate>Thu, 06 Nov 2025 17:20:09 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682501</guid>
      <description>The FAA is reducing flights due to the historically long government shutdown.</description>
    </item>
    <item>
      <title>N&#8217;essayez pas d&#8217;effacer les rayures de votre smartphone, c&#8217;est une mauvaise id&#233;e</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2858987_nessayez-pas-deffacer-les-rayures-de-votre-smartphone-cest-une-mauvaise-idee</link>
      <pubDate>Thu, 06 Nov 2025 17:15:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2858987_nessayez-pas-deffacer-les-rayures-de-votre-smartphone-cest-une-mauvaise-idee</guid>
      <description>
Si vous esp&#233;riez voir dispara&#238;tre les micro-rayures de votre &#233;cran de smartphone gr&#226;ce &#224; une machine de polissage, un expert vient de doucher vos espoirs. 
</description>
    </item>
    <item>
      <title>Early Black Friday deal alert: MSI&#8217;s 27-inch Full HD monitor now only &#163;68 with a three-year warranty</title>
      <link>https://www.techradar.com/pro/early-black-friday-deal-alert-msis-27-inch-full-hd-monitor-now-only-gbp68-with-a-three-year-warranty</link>
      <pubDate>Thu, 06 Nov 2025 17:12:21 +0000</pubDate>
      <guid isPermaLink="false">pR5YS8TyrYgXj7JQobaiUT</guid>
      <description>Black Friday savings start now! MSI&#8217;s PRO MP275 monitor hits record-low &#163;68 price point.</description>
    </item>
    <item>
      <title>Stranger Things: Tales From &#8216;85 winds the clock back in new trailer</title>
      <link>https://www.theverge.com/streaming/815627/stranger-things-tales-from-85-teaser</link>
      <pubDate>2025-11-06T12:11:44-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815627</guid>
      <description>While Stranger Things's upcoming fifth season will bring the Hawkins gang's story to a close, Netflix's new Stranger Things animated spinoff series is about to send the crew on a side quest set in the recent past. Today, Netflix dropped a teaser video for Stranger Things: Tales From '85, a new spinoff that takes place [&#8230;]</description>
    </item>
    <item>
      <title>These Wildly Expensive Wireless Earbuds Go Overboard on Drivers</title>
      <link>https://gizmodo.com/fokus-prestige-encore-wireless-earbuds-features-release-date-price-2000682422</link>
      <pubDate>Thu, 06 Nov 2025 17:10:18 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682422</guid>
      <description>And they're made partially of real wood, because why not?</description>
    </item>
    <item>
      <title>Black Friday 2025 : les offres sont d&#233;j&#224; nombreuses sur Amazon &amp; Co, mais voici les meilleurs deals en avant-premi&#232;re</title>
      <link>https://www.frandroid.com/bons-plans/2849105_black-friday-2025-la-braderie-continue-chez-amazon-co-voici-les-meilleures-offres-en-avant-premiere</link>
      <pubDate>Thu, 06 Nov 2025 17:08:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849105_black-friday-2025-la-braderie-continue-chez-amazon-co-voici-les-meilleures-offres-en-avant-premiere</guid>
      <description>
&#192; peine novembre entam&#233; que le Black Friday pointe d&#233;j&#224; le bout de son nez chez certains e-commer&#231;ants fran&#231;ais. On vous a donc pr&#233;par&#233; une s&#233;lection des meilleures offres du moment, mise &#224; jour en temps r&#233;el, pour vous aider &#224; d&#233;nicher les bons plans tech sans prise de t&#234;te.
</description>
    </item>
    <item>
      <title>University of Pennsylvania confirms recent cyberattack led to major data theft</title>
      <link>https://www.techradar.com/pro/security/university-of-pennsylvania-confirms-recent-cyberattack-led-to-major-data-theft</link>
      <pubDate>Thu, 06 Nov 2025 17:08:00 +0000</pubDate>
      <guid isPermaLink="false">bG8fAvW7QuZNseLzyLBuJ4</guid>
      <description>Hackers claim to have stolen 1.2 million records, and have been insulting the University.</description>
    </item>
    <item>
      <title>Rockstar co-founder Dan Houser says Red Dead Redemption 3 'will probably happen' but would be sad not to be part of it</title>
      <link>https://www.techradar.com/gaming/rockstar-co-founder-dan-houser-says-red-dead-redemption-3-will-probably-happen-but-would-be-sad-not-to-be-part-of-it</link>
      <pubDate>Thu, 06 Nov 2025 17:04:47 +0000</pubDate>
      <guid isPermaLink="false">CxTnBL4SVksJYkT2z6Kb8Q</guid>
      <description>Red Dead Redemption 2 writer Dan Houser believes a third game will eventually be made, but has admitted he would be sad not being involved in its development.</description>
    </item>
    <item>
      <title>Best Adaptogen Drinks and Functional Drinks of 2025: Get Clear</title>
      <link>https://www.wired.com/gallery/best-adaptogen-drinks/</link>
      <pubDate>Thu, 06 Nov 2025 17:04:27 +0000</pubDate>
      <guid isPermaLink="false">68ff567690983867dce5ecc0</guid>
      <description>I tasted dozens of mushroom teas, kava drinks, and party drinks to find the best. Brez and Juni are the two I recommend for most people looking for focus.</description>
    </item>
    <item>
      <title>La technologie de batterie que l&#8217;on attendait chez Samsung et Apple atterrit dans un Motorola pas cher</title>
      <link>https://www.01net.com/actualites/la-technologie-de-batterie-que-lon-attendait-chez-samsung-et-apple-atterrit-dans-un-motorola-pas-cher.html</link>
      <pubDate>Thu, 06 Nov 2025 17:03:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305827</guid>
      <description>Vous pensiez que le silicium carbone, nouvelle technologie miracle pour agrandir les batteries, &#233;taient r&#233;serv&#233;e au haut de gamme ? Motorola prouve que non avec son G57 POWER.</description>
    </item>
    <item>
      <title>Ecovacs Goat G1-2000 : cet excellent robot tondeuse est 1 450 &#8364; moins cher qu&#8217;&#224; son lancement gr&#226;ce au pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2858427_ecovacs-goat-g1-2000-cet-excellent-robot-tondeuse-est-1-450-e-moins-cher-qua-son-lancement-grace-au-pre-black-friday</link>
      <pubDate>Thu, 06 Nov 2025 17:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2858427_ecovacs-goat-g1-2000-cet-excellent-robot-tondeuse-est-1-450-e-moins-cher-qua-son-lancement-grace-au-pre-black-friday</guid>
      <description>
Si l&#8217;id&#233;e de passer ses week-ends derri&#232;re une tondeuse n&#8217;a plus vraiment la cote, les robots sont devenus des alli&#233;s de choix. Faciles &#224; configurer, discrets et efficaces et sans fil, &#224; l&#8217;image du Goat G1-2000 d&#8217;Ecovacs. Un mod&#232;le not&#233; 9/10 l&#8217;an dernier, qui voit aujourd&#8217;hui son prix chuter &#224; 549 euros sur Amazon, alors qu'il en valait 2 000 euros &#224; son lancement en novembre 2024. 
...</description>
    </item>
    <item>
      <title>The 7 Biggest Differences Between the &#8216;Running Man&#8217; Movies</title>
      <link>https://gizmodo.com/running-man-movies-differences-glen-powell-arnold-schwarzenegger-2000682126</link>
      <pubDate>Thu, 06 Nov 2025 17:00:42 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682126</guid>
      <description>Arnold Schwarzenegger's 1987 film and Glen Powell's 2025 film are very different, but which has the edge?</description>
    </item>
    <item>
      <title>Google Finance offers Gemini AI tools to stock traders</title>
      <link>https://www.theverge.com/news/815300/google-finance-gets-ai-deep-search</link>
      <pubDate>2025-11-06T12:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815300</guid>
      <description>Google&#8217;s well-honed strategy of adding AI to absolutely everything continues: the company announced on Thursday that Google Finance is getting a Deep Search feature to turbocharge its AI chatbot, as well as other upgrades to support traders like prediction market support. The new Deep Search feature will let you get more detailed responses and ask [&#8230;]...</description>
    </item>
    <item>
      <title>Guide d&#8217;achat : les meilleurs v&#233;los cargo longtails &#233;lectriques de 2025</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-survoltes/guides-dachat-velos-electriques/1595501_velo-cargo-electrique-notre-comparatif-des-meilleurs-modeles</link>
      <pubDate>Thu, 06 Nov 2025 16:57:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-survoltes/guides-dachat-velos-electriques/1595501_velo-cargo-electrique-notre-comparatif-des-meilleurs-modeles</guid>
      <description>
Les v&#233;los cargo permettent de transporter beaucoup plus de choses que les v&#233;los &#233;lectriques classiques. Voici notre s&#233;lection des meilleurs v&#233;los cargo &#233;lectriques de type longtails que la r&#233;daction de Frandroid a pu tester.
</description>
    </item>
    <item>
      <title>Microsoft AI says it&amp;#8217;ll make superintelligent AI that won&amp;#8217;t be terrible for humanity</title>
      <link>https://www.theverge.com/news/815619/microsoft-ai-humanist-superintelligence</link>
      <pubDate>2025-11-06T11:51:08-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815619</guid>
      <description>Microsoft AI wants you to know that its work toward superintelligence involves keeping humans &#8220;at the top of the food chain.&#8221; In a lengthy blog post on Thursday, Microsoft AI head Mustafa Suleyman highlighted the formation of a new team dedicated to developing a &#8220;humanist superintelligence&#8221; that&#8217;s &#8220;designed only to serve humanity.&#8221; This kind of [&#8230;]</description>
    </item>
    <item>
      <title>Le Black Friday liquide les stocks de smartphones  : voici le meilleur des promos sur les iPhone d&#8217;Apple, Samsung Galaxy et Google Pixel</title>
      <link>https://www.frandroid.com/bons-plans/2848295_le-black-friday-liquide-les-stocks-de-smartphones-notre-top-10-des-promos-sur-les-iphone-dapple-samsung-galaxy-et-google-pixel</link>
      <pubDate>Thu, 06 Nov 2025 16:49:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848295_le-black-friday-liquide-les-stocks-de-smartphones-notre-top-10-des-promos-sur-les-iphone-dapple-samsung-galaxy-et-google-pixel</guid>
      <description>
Le Black Friday est bien en avance cette ann&#233;e, et de tous les produits tech, ce sont les smartphones qui en profitent le plus. Samsung Galaxy, iPhone d'Apple, Google Pixel, Xiaomi Redmi, de l'entr&#233;e au haut de gamme, voyons ce que r&#233;servent les e-commer&#231;ants en ce d&#233;but de Black November.
</description>
    </item>
    <item>
      <title>A new study warns deep-sea mining could disrupt the marine food web, impacting what we eat</title>
      <link>https://www.fastcompany.com/91436596/new-study-warns-deep-sea-mining-could-disrupt-marine-food-web-impacting-what-we-eat</link>
      <pubDate>2025-11-06T16:48:28</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91436596/new-study-warns-deep-sea-mining-could-disrupt-marine-food-web-impacting-what-we-eat</guid>
      <description>Nations are pursuing deep-sea mining for critical minerals used in tech and the military sector. 
Drilling for minerals deep in the ocean could have immense consequences for the tiny animals at the core of the vast marine food web &#8212; and ultimately affect fisheries and the food we find on our plates, according to a new study.Deep-sea mining means drilling the seafloor for &#8220;polymetallic nodules&#8221; loaded with critical minerals including copper, iron, zinc and more. While not yet commercialized, nations are pursuing deep-sea operations amid rising demand for these minerals in electric vehicles and ...</description>
    </item>
    <item>
      <title>Voici la recette secr&#232;te de Renault pour cr&#233;er une voiture &#233;lectrique &#224; 20 000 &#8364; : dans les coulisses de la cr&#233;ation de la nouvelle Twingo</title>
      <link>https://www.frandroid.com/marques/renault/2854889_voici-la-recette-secrete-de-renault-pour-creer-une-voiture-electrique-a-20-000-e-dans-les-coulisses-de-la-creation-de-la-nouvelle-twingo</link>
      <pubDate>Thu, 06 Nov 2025 16:46:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2854889_voici-la-recette-secrete-de-renault-pour-creer-une-voiture-electrique-a-20-000-e-dans-les-coulisses-de-la-creation-de-la-nouvelle-twingo</guid>
      <description>
Les voitures &#233;lectriques &#224; moins de 20 000 euros sont encore rares, et d'autant plus celles produites en Europe. La Renault Twingo y arrive pourtant ; nous sommes partis &#224; la rencontre de ses cr&#233;ateurs pour savoir comment ils y sont parvenus. Voici ce que nous avons d&#233;couvert.
</description>
    </item>
    <item>
      <title>New Research Throws the Ultimate Fate of the Universe Into Question</title>
      <link>https://gizmodo.com/new-research-throws-the-ultimate-fate-of-the-universe-into-question-2000682183</link>
      <pubDate>Thu, 06 Nov 2025 16:45:15 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682183</guid>
      <description>The popular consensus among scientists is that the universe will continue expanding until the bitter end. A team of researchers is now pumping the brakes on that idea.</description>
    </item>
    <item>
      <title>Tinder is testing an AI matching feature called Chemistry</title>
      <link>https://mashable.com/article/tinder-ai-matching-feature-chemistry</link>
      <pubDate>Thu, 06 Nov 2025 16:37:46 +0000</pubDate>
      <guid isPermaLink="false">05FITMYp7lqEDB7LYvVm779</guid>
      <description>Match Group reported that its dating app Tinder is testing an interactive, AI-powered matching featuee called Chemistry.</description>
    </item>
    <item>
      <title>How the attack on trans healthcare affects every American</title>
      <link>https://www.fastcompany.com/91436660/how-the-attack-on-trans-healthcare-affects-every-american</link>
      <pubDate>2025-11-06T16:36:44</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91436660/how-the-attack-on-trans-healthcare-affects-every-american</guid>
      <description>The erosion of freedom rarely happens overnight; it&#8217;s written into law, one ruling at a time. ACLU&#8217;s Chase Strangio lays bare how the U.S. legal system is failing its people under a growing wave of authoritarianism and systemic rollbacks of civil liberties.
The erosion of freedom rarely happens overnight; it&#8217;s written into law, one ruling at a time. ACLU&#8217;s Chase Strangio lays bare how the U.S. legal system is failing its people under a growing wave of authoritarianism and systemic rollbacks of civil liberties....</description>
    </item>
    <item>
      <title>The Google Pixel 10 has never been this cheap before</title>
      <link>https://mashable.com/article/nov-6-google-pixel-10-deal</link>
      <pubDate>Thu, 06 Nov 2025 16:34:05 +0000</pubDate>
      <guid isPermaLink="false">033DTnTzbSCLYyl00lxjv3S</guid>
      <description>Grab an unlocked Google Pixel 10 with 128GB of storage for an all-time low price of $599 at Amazon. That's $200 off a 2025 phone.</description>
    </item>
    <item>
      <title>Ampoules, capteurs, t&#233;l&#233;commandes&#160;: Ikea connecte tout gr&#226;ce &#224; Matter</title>
      <link>https://www.01net.com/actualites/ampoules-capteurs-telecommandes-ikea-connecte-tout-grace-a-matter.html</link>
      <pubDate>Thu, 06 Nov 2025 16:30:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305832</guid>
      <description>&#201;clairage, capteurs, t&#233;l&#233;commandes : ce n'est pas un lancement, c'est une v&#233;ritable invasion chez Ikea, qui a d&#233;voil&#233; 21 (!) nouveaux appareils domotiques aujourd'hui. Un point commun entre tous ces appareils : leur compatibilit&#233; Matter.</description>
    </item>
    <item>
      <title>The First Look at &#8216;Stranger Things: Tales From &#8217;85&#8217; Reveals an Animated Adventure</title>
      <link>https://gizmodo.com/strange-things-tales-from-85-trailer-netflix-animated-2000682471</link>
      <pubDate>Thu, 06 Nov 2025 16:30:28 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682471</guid>
      <description>Ahead of 'Stranger Things' season 5, Netflix has given us a first look at its new animated spinoff, coming in 2026.</description>
    </item>
    <item>
      <title>Sports streaming is a fragmented hot mess</title>
      <link>https://www.theverge.com/column/815571/sports-streaming-mess</link>
      <pubDate>2025-11-06T11:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815571</guid>
      <description>This is Lowpass by Janko Roettgers, a newsletter on the ever-evolving intersection of tech and entertainment, syndicated just for The Verge subscribers once a week. This week, JJ Watt finally had enough. The former NFL star, who played for the Houston Texans for close to a decade, took to X to declare that he was [&#8230;]</description>
    </item>
    <item>
      <title>Apple Music will soon let you share songs and lyrics to your WhatsApp status as the fight against Spotify continues</title>
      <link>https://www.techradar.com/audio/apple-music/apple-music-will-soon-let-you-share-songs-and-lyrics-to-your-whatsapp-status-as-the-fight-against-spotify-continues</link>
      <pubDate>Thu, 06 Nov 2025 16:30:00 +0000</pubDate>
      <guid isPermaLink="false">ZesJbMqALZuAdYkCB6cmXG</guid>
      <description>Apple is reportedly working on direct integration between Apple Music and WhatsApp to match previously-released Spotify features as Wrapped season approaches</description>
    </item>
    <item>
      <title>Passer &#224; Windows 11 sans se ruiner : d&#233;couvrez ce PC portable HP efficace &#224; seulement 419 &#8364; [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2856789_passer-a-windows-11-sans-se-ruiner-decouvrez-ce-pc-portable-hp-efficace-a-seulement-419-e</link>
      <pubDate>Thu, 06 Nov 2025 16:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2856789_passer-a-windows-11-sans-se-ruiner-decouvrez-ce-pc-portable-hp-efficace-a-seulement-419-e</guid>
      <description>
Les bonnes affaires du jour c&#244;t&#233; informatique sont &#224; faire chez PcComponentes : le revendeur espagnol brade plusieurs de ses r&#233;f&#233;rences en clavier azerty &#224; quelques encablures du Black Friday.
</description>
    </item>
    <item>
      <title>The ultra-rare Ukiyoe version of the MSI Prestige laptop is $500 off as the Best Buy drop for Nov. 6</title>
      <link>https://mashable.com/article/nov-6-best-buy-drops-msi-prestige-laptop-ukiyoe-edition-deal</link>
      <pubDate>Thu, 06 Nov 2025 16:26:41 +0000</pubDate>
      <guid isPermaLink="false">01I9W4TbdHLfF0t5cwsOJHh</guid>
      <description>The limited edition Ukiyoe MSI Prestige laptop is on sale for $1,499.99 ($500 off) at Best Buy on Nov. 6 only &#8212; and MSI isn't restocking these.</description>
    </item>
    <item>
      <title>Gemini Deep Research is able to delve into your Gmail, Docs, Drive and even Chat - but will it really make you more productive?</title>
      <link>https://www.techradar.com/pro/gemini-deep-research-can-now-connect-to-your-gmail-docs-drive-and-even-chat</link>
      <pubDate>Thu, 06 Nov 2025 16:26:00 +0000</pubDate>
      <guid isPermaLink="false">WXz79eGHHV8Ptux34Wvdc7</guid>
      <description>Deep Research can now get even more context from Gmail, Google Drive and Chat, as well as Search.</description>
    </item>
    <item>
      <title>This Florida Doctor&#8217;s Office Gave Its Own Patients Hepatitis C</title>
      <link>https://gizmodo.com/this-florida-doctors-office-gave-its-own-patients-hepatitis-c-2000682425</link>
      <pubDate>Thu, 06 Nov 2025 16:25:35 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682425</guid>
      <description>The Florida Department of Health found that several patients of Lily J. Voepel caught the bloodborne infection while under her care.</description>
    </item>
    <item>
      <title>What is vibe coding? Plus 7 AI coding tools to get started right away.</title>
      <link>https://mashable.com/article/what-is-vibe-coding-tools-for-beginners</link>
      <pubDate>Thu, 06 Nov 2025 16:24:21 +0000</pubDate>
      <guid isPermaLink="false">05E3j4PBLoW0x9VHPDR3KIv</guid>
      <description>Okay, but what is vibe coding, really? Stop nodding and smiling every time you hear this phrase and get started with AI vibe coding tools.</description>
    </item>
    <item>
      <title>Doctolib sanctionn&#233; pour avoir verrouill&#233; le march&#233; des prises de rendez-vous en ligne</title>
      <link>https://www.frandroid.com/android/applications/2858899_doctolib-sanctionne-pour-avoir-verrouille-le-marche-des-prises-de-rendez-vous-en-ligne</link>
      <pubDate>Thu, 06 Nov 2025 16:20:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/applications/2858899_doctolib-sanctionne-pour-avoir-verrouille-le-marche-des-prises-de-rendez-vous-en-ligne</guid>
      <description>
Doctolib, la star de la prise de rendez-vous m&#233;dicaux en ligne, vient d&#8217;&#234;tre frapp&#233;e par une sanction importante. L&#8217;Autorit&#233; de la concurrence fran&#231;aise lui a inflig&#233; une amende de 4,6 millions d&#8217;euros pour des pratiques jug&#233;es abusives sur le march&#233;.
</description>
    </item>
    <item>
      <title>This Cheap Dual-Screen Handheld Is the Best Way to Recreate the Nintendo DS</title>
      <link>https://gizmodo.com/anbernic-rg-ds-best-way-to-recreate-nintendo-ds-2000682443</link>
      <pubDate>Thu, 06 Nov 2025 16:15:41 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682443</guid>
      <description>Not only is it the cheapest option, but it's the only one that offers purist controls.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs TV TCL en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/1610991_quelles-sont-les-meilleures-tv-tcl-disponibles</link>
      <pubDate>Thu, 06 Nov 2025 16:15:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1610991_quelles-sont-les-meilleures-tv-tcl-disponibles</guid>
      <description>
Sur le march&#233; des t&#233;l&#233;viseurs, la marque chinoise TCL est de plus en plus pr&#233;sente, notamment avec des mod&#232;les aux tarifs agressifs. Pour vous aider, nous avons s&#233;lectionn&#233; les meilleurs TV TCL disponibles actuellement.
</description>
    </item>
    <item>
      <title>Celebrate Stranger Things Day with a first look at animated series Stranger Things: Tales From 85</title>
      <link>https://mashable.com/article/stranger-things-tales-from-85-first-look-netflix</link>
      <pubDate>Thu, 06 Nov 2025 16:09:46 +0000</pubDate>
      <guid isPermaLink="false">042A1FipxfrwdKanZBrKWZr</guid>
      <description>Netflix released a featurette, first look images, and cast list for the upcoming animated series "Stranger Things: Tales From '85."</description>
    </item>
    <item>
      <title>Stranger Things: Tales From 85 trailer, images, voice cast, and 2026 release window unveiled by Netflix for Stranger Things Day 2025</title>
      <link>https://www.techradar.com/streaming/netflix/stranger-things-tales-from-85-trailer-images-voice-cast-and-2026-release-window-unveiled-by-netflix-for-stranger-things-day-2025</link>
      <pubDate>Thu, 06 Nov 2025 16:04:17 +0000</pubDate>
      <guid isPermaLink="false">NB6PErTrHxBR2jNfeycxMY</guid>
      <description>Netflix has revealed some new details about its first Stranger Things spin-off, including a whole new cast for Eleven, Mike, and more.</description>
    </item>
    <item>
      <title>Avant-Black Friday smartphones &#224; moins de 500 euros : les meilleures offres sur les Samsung Galaxy, Xiaomi Redmi et Nothing Phone</title>
      <link>https://www.frandroid.com/bons-plans/2856691_le-black-month-est-la-avec-des-reductions-phares-le-top-des-meilleures-offres-de-smartphones-a-moins-de-500-e</link>
      <pubDate>Thu, 06 Nov 2025 16:02:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2856691_le-black-month-est-la-avec-des-reductions-phares-le-top-des-meilleures-offres-de-smartphones-a-moins-de-500-e</guid>
      <description>
Si le Black Friday se fera attendre jusqu'&#224; la fin du mois, les e-commer&#231;ants fran&#231;ais n'ont eux pas attendu pour lancer des offres. Les smartphones font partie des produits qui profitent de r&#233;ductions vraiment int&#233;ressantes, notamment sur l'entr&#233;e et le milieu de gamme. 
</description>
    </item>
    <item>
      <title>The Roman Empire&#8217;s Entire Road Network Just Got Mapped, and It&#8217;s Mind-Blowing</title>
      <link>https://gizmodo.com/the-roman-empires-entire-road-network-just-got-mapped-and-its-mind-blowing-2000681707</link>
      <pubDate>Thu, 06 Nov 2025 16:00:57 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000681707</guid>
      <description>A new study identified over 68,000 more miles of ancient Roman roads than were previously known.</description>
    </item>
    <item>
      <title>Watch &#8216;Shimmer,&#8217; a Gorgeous and Poignant Sci-Fi Short With Oscar Aspirations (Exclusive)</title>
      <link>https://gizmodo.com/watch-shimmer-a-gorgeous-and-poignant-sci-fi-short-with-oscar-aspirations-exclusive-2000681710</link>
      <pubDate>Thu, 06 Nov 2025 16:00:30 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000681710</guid>
      <description>io9 talks to Mexican filmmaker Andr&#233;s Palma about his animated creation, the tale of a family trying to survive the post-apocalypse.</description>
    </item>
    <item>
      <title>Pebblebee&#8217;s new trackers are brighter, louder, thinner, and more colorful</title>
      <link>https://www.theverge.com/news/814728/pebblebee-clip-card-5-trackers-apple-find-my-google-hub</link>
      <pubDate>2025-11-06T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814728</guid>
      <description>Pebblebee has announced new versions of its AirTag-like Clip tracker and wallet-sized Card tracker. The new Clip 5 features a similar design to the previous version with a built-in loop for attaching it to a keychain but includes improvements focused on its personal safety features, plus more color options. The new Card 5 is 30 [&#8230;]</description>
    </item>
    <item>
      <title>The world&#8217;s first Thin-Ply Carbon Diaphragm headphones are here from an audio icon &#8211; and I need to try them</title>
      <link>https://www.techradar.com/audio/speakers/the-worlds-first-thin-ply-carbon-diaphragm-headphones-are-here-from-an-audio-icon-and-i-need-to-try-them</link>
      <pubDate>Thu, 06 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">MG9eANfnwEN2u2CJtoMJ8o</guid>
      <description>Meet HEDDphone D1: A HEDD-y mix of futuristic technology in open-back cans</description>
    </item>
    <item>
      <title>Stream Ring&#160;: l&#8217;inqui&#233;tante bague connect&#233;e qui enregistre et imite votre voix</title>
      <link>https://www.01net.com/actualites/stream-ring-linquietante-bague-connectee-qui-enregistre-et-imite-votre-voix.html</link>
      <pubDate>Thu, 06 Nov 2025 15:59:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305702</guid>
      <description>La start-up am&#233;ricaine Sandbar, fond&#233;e par deux anciens employ&#233;s de Meta, lance une bague connect&#233;e qui retranscrit vos notes vocales et vous r&#233;pond avec un clone de votre propre voix. Disponible en pr&#233;commande &#224; partir de 249 dollars, elle arrivera &#224; l'&#233;t&#233; 2026.</description>
    </item>
    <item>
      <title>Meta earns about $7 billion a year on scam ads, report says</title>
      <link>https://mashable.com/article/meta-7-billion-dollars-scam-ads</link>
      <pubDate>Thu, 06 Nov 2025 15:57:57 +0000</pubDate>
      <guid isPermaLink="false">02NUTTxvXrVIHXcRoe1pOmn</guid>
      <description>Meta reportedly made a lot of money off of fraudulent ads, according to the company's own internal documents, a new report claims.</description>
    </item>
    <item>
      <title>Pok&#233;mon Legends: Z-A Mega Dimension DLC has an official release date and the first trailer confirms new Mega Evolutions</title>
      <link>https://www.techradar.com/gaming/pokemon-legends-z-a-mega-dimension-dlc-has-an-official-release-date-and-the-first-trailer-confirms-new-mega-evolutions</link>
      <pubDate>Thu, 06 Nov 2025 15:57:09 +0000</pubDate>
      <guid isPermaLink="false">KgNLR8hzDZG2AGi8rkme8a</guid>
      <description>The Pok&#233;mon Company has announced the release date for the first expansion for Pok&#233;mon Legends: Z-A.</description>
    </item>
    <item>
      <title>Nvidia CEO Says China &#8216;Will Win&#8217; the Global AI Race as the U.S. Falls Behind in Energy</title>
      <link>https://gizmodo.com/nvidia-ceo-says-china-will-win-the-global-ai-race-as-the-u-s-falls-behind-in-energy-2000682396</link>
      <pubDate>Thu, 06 Nov 2025 15:55:52 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682396</guid>
      <description>It's all thanks to China's energy policy, Nvidia's Jensen Huang claims.</description>
    </item>
    <item>
      <title>Spotify is launching a weekly mini &#8216;Wrapped&#8217;</title>
      <link>https://www.theverge.com/news/815521/spotify-listening-stats-weekly-feature-wrapped</link>
      <pubDate>2025-11-06T10:53:10-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815521</guid>
      <description>Spotify has introduced a new &#8220;listening stats&#8221; feature that gives you a weekly overview of your recent music streaming habits. It essentially acts like a mini version of Spotify&#8217;s annual Wrapped review, showing you which artists and songs you&#8217;ve listened to the most each week, and making curated playlists inspired by those results. Listening stats [&#8230;]...</description>
    </item>
    <item>
      <title>Nintendo is about to retire the OG Switch</title>
      <link>https://mashable.com/article/nintendo-retiring-original-switch</link>
      <pubDate>Thu, 06 Nov 2025 15:52:22 +0000</pubDate>
      <guid isPermaLink="false">05rZvc72Bi0SQgUXBQdSWOv</guid>
      <description>The original Nintendo Switch is being sunsetted after several years of honorable service.</description>
    </item>
    <item>
      <title>Le Samsung Galaxy A36 5G dop&#233; &#224; l&#8217;IA est &#224; moiti&#233; prix pendant ce pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2658803_le-samsung-galaxy-a36-5g-dope-a-lia-est-a-moitie-prix-pendant-ce-pre-black-friday</link>
      <pubDate>Thu, 06 Nov 2025 15:49:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2658803_le-samsung-galaxy-a36-5g-dope-a-lia-est-a-moitie-prix-pendant-ce-pre-black-friday</guid>
      <description>
D&#233;voil&#233; en d&#233;but d'ann&#233;e, le Samsung Galaxy A36 5G fait partie des premiers smartphones de la s&#233;rie Galaxy A &#224; offrir les fonctions IA du constructeur. S'il vous int&#233;resse, sachez que ce digne successeur du tr&#232;s bon Galaxy A35 est en ce moment propos&#233; &#224; 209 euros au lieu de 399,99 euros pendant le pr&#233;-Black Friday chez Cdiscount
</description>
    </item>
    <item>
      <title>Avec l&#8217;iPhone Air 2, Apple pourrait corriger un des gros d&#233;fauts de son smartphone ultra fin</title>
      <link>https://www.01net.com/actualites/avec-liphone-air-2-apple-pourrait-corriger-un-des-gros-defauts-de-son-smartphone-ultra-fin.html</link>
      <pubDate>Thu, 06 Nov 2025 15:47:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305796</guid>
      <description>Apple ne renonce pas &#224; l&#8217;ultrafin. Malgr&#233; des ventes timides, l&#8217;iPhone Air 2 miserait sur un nouveau capteur ultra grand-angle pour combler son principal retard face &#224; Samsung et Motorola.</description>
    </item>
    <item>
      <title>Best Buy's early Black Friday sale is filled with unbelievable TV deals &#8211; shop the 15 best from Samsung, Sony, and LG</title>
      <link>https://www.techradar.com/televisions/best-buys-early-black-friday-sale-is-filled-with-unbelievable-tv-deals-shop-the-15-best-from-samsung-sony-and-lg</link>
      <pubDate>Thu, 06 Nov 2025 15:47:06 +0000</pubDate>
      <guid isPermaLink="false">PKC3oXJUWZajNMBh8v84d5</guid>
      <description>Best Buy's early Black Friday sale is now live, featuring incredible TV deals. Here are the 15 best, with savings of over $1,000 from Samsung, LG, and Sony.</description>
    </item>
    <item>
      <title>The Apple Watch Series 10 is just 99 cents away from its best price ever</title>
      <link>https://mashable.com/article/nov-6-apple-watch-series-10-deal</link>
      <pubDate>Thu, 06 Nov 2025 15:45:07 +0000</pubDate>
      <guid isPermaLink="false">040iiaoX69PRyROM22f6q5D</guid>
      <description>The Apple Watch Series 10 is down to just $279.99 at Amazon. That's 30% off and just 99 cents away from its best-ever price.</description>
    </item>
    <item>
      <title>Mastodon&#8217;s latest software update brings quote posts to all server operators</title>
      <link>https://techcrunch.com/2025/11/06/mastodons-latest-software-update-brings-quote-posts-to-all-server-operators/</link>
      <pubDate>Thu, 06 Nov 2025 15:43:52 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3065618</guid>
      <description>Mastodon's latest software version brings quote posts with added controls to all servers.</description>
    </item>
    <item>
      <title>Iran&#8217;s "VPN mafia" blamed for delays on the lifting of Telegram ban &#8211; here's what we know</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/irans-vpn-mafia-blamed-for-delays-on-the-lifting-of-telegram-ban-heres-what-we-know</link>
      <pubDate>Thu, 06 Nov 2025 15:42:09 +0000</pubDate>
      <guid isPermaLink="false">AfiVPeC6CzSdjEPBps55bG</guid>
      <description>While reports suggested Iran is ready to lift the ban, Durov's platform remains restricted. An Iranian lawmaker said the VPN industry is to blame this time.</description>
    </item>
    <item>
      <title>Early Black Friday TV deals are live in the UK &#8211; I've found the 9 best offers from &#163;89.99</title>
      <link>https://www.techradar.com/televisions/early-black-friday-tv-deals-are-live-in-the-uk-ive-found-the-9-best-offers-from-gbp89-99</link>
      <pubDate>Thu, 06 Nov 2025 15:40:48 +0000</pubDate>
      <guid isPermaLink="false">hSxk6aYLgmwqCxfMbEVUwE</guid>
      <description>Black Friday is always a great time of the year to buy a new TV, so I've rounded up the best deals available now in the early sales.</description>
    </item>
  </channel>
</rss>
