<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 05 Jan 2026 13:46:34 GMT</lastBuildDate>
    <item>
      <title>Ce laptop gaming 16&#8243; QHD 165 Hz avec RTX 5070 perd 300 &#8364; : l&#8217;affaire &#224; ne pas rater en ce d&#233;but 2026</title>
      <link>https://www.frandroid.com/bons-plans/2927537_ce-laptop-gaming-16-qhd-165-hz-avec-rtx-5070-perd-300-e-laffaire-a-ne-pas-rater-en-ce-debut-2026</link>
      <pubDate>Mon, 05 Jan 2026 13:43:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2927537_ce-laptop-gaming-16-qhd-165-hz-avec-rtx-5070-perd-300-e-laffaire-a-ne-pas-rater-en-ce-debut-2026</guid>
      <description>
Bonne nouvelle pour les gamers&#8239;! Le Gigabyte AERO X16, arm&#233; d&#8217;un Ryzen AI 9, d&#8217;une RTX 5070 et d&#8217;un &#233;cran QHD 165&#8239;Hz, passe &#224; 1&#8239;539&#8239;euros au lieu de 1&#8239;819&#8239; euros. Une affaire en or pour d&#233;buter 2025 avec une machine surpuissante sans exploser son budget.
</description>
    </item>
    <item>
      <title>Just don't immerse it: Jackery reveals world's lightest kWh-capacity IP65-rated portable power station &#8212; and it can even withstand a 1m fall</title>
      <link>https://www.techradar.com/pro/just-dont-immerse-it-jackery-reveals-worlds-lightest-kwh-capacity-ip65-rated-portable-power-station-and-it-can-even-withstand-a-1m-fall</link>
      <pubDate>Mon, 05 Jan 2026 13:35:16 +0000</pubDate>
      <guid isPermaLink="false">Zak5Tc5G4hP5gRUweaZwF7</guid>
      <description>The Jackery Explorer 1500 Ultra is a professional-grade portable power station offering high-capacity energy, rapid recharge, IP65 durability, and extreme environmental resilience.</description>
    </item>
    <item>
      <title>AirTag deal: Get a four-pack of the Bluetooth trackers for only $65</title>
      <link>https://www.engadget.com/deals/airtag-deal-get-a-four-pack-of-the-bluetooth-trackers-for-only-65-202333050.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 13:34:55 +0000</pubDate>
      <guid isPermaLink="false">24b60c33-f851-4bee-9d8b-9c00c8cc034a</guid>
      <description>Apple keeps most of its product pricing on a tight leash, but we do see the company's AirTags go on sale pretty frequently. Another cost cut has come around for this item just in time for the holidays. Amazon is currently selling a four-pack of AirTags for $65. At a third off the regular cost, that price is pretty close to the record low discount of $63 we've seen for these Bluetooth trackers.


AirTags can be useful for people who travel frequently, helping you to keep track of essentials like your passport as well as a way to keep tabs on luggage while you're on the go. If you do purchase so...</description>
    </item>
    <item>
      <title>Clap de fin pour l&#8217;Apple Vision Pro ? Pourquoi Apple aurait d&#233;j&#224; stopp&#233; la production de son casque</title>
      <link>https://www.frandroid.com/marques/2928071_clap-de-fin-pour-lapple-vision-pro-pourquoi-apple-aurait-deja-stoppe-la-production-de-son-casque</link>
      <pubDate>Mon, 05 Jan 2026 13:28:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2928071_clap-de-fin-pour-lapple-vision-pro-pourquoi-apple-aurait-deja-stoppe-la-production-de-son-casque</guid>
      <description>
Le casque de r&#233;alit&#233; mixte d&#8217;Apple ne se vend pas aussi bien que l&#8217;aurait esp&#233;r&#233; la firme. Selon des experts du secteur, Apple aurait m&#234;me cess&#233; la production de l&#8217;Apple Vision Pro au d&#233;but de l&#8217;ann&#233;e 2025.
</description>
    </item>
    <item>
      <title>La nouvelle balance connect&#233;e de Withings ne se contente plus de mesurer le poids</title>
      <link>https://www.01net.com/actualites/la-nouvelle-balance-connectee-de-withings-ne-se-contente-plus-de-mesurer-le-poids.html</link>
      <pubDate>Mon, 05 Jan 2026 13:20:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318145</guid>
      <description>Withings revient &#224; ses premi&#232;res amours avec une nouvelle balance connect&#233;e, la Body Scan 2. Le constructeur fran&#231;ais promet une photographie en 90 secondes de l&#8217;&#233;tat cardiovasculaire, m&#233;tabolique et cellulaire, gr&#226;ce &#224; une soixantaine d&#8217;indicateurs.</description>
    </item>
    <item>
      <title>J&#8217;ai vu le prix des nouveaux chargeurs USB-C d&#8217;IKEA, et c&#8217;est un probl&#232;me pour la concurrence</title>
      <link>https://www.frandroid.com/marques/ikea/2928513_jai-vu-le-prix-des-nouveaux-chargeurs-usb-c-dikea-et-cest-un-probleme-pour-la-concurrence</link>
      <pubDate>Mon, 05 Jan 2026 13:18:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/ikea/2928513_jai-vu-le-prix-des-nouveaux-chargeurs-usb-c-dikea-et-cest-un-probleme-pour-la-concurrence</guid>
      <description>
Vous avez l'habitude de payer vos chargeurs 20 ou 30 euros ? Arr&#234;tez tout de suite. IKEA vient de dynamiter le march&#233; avec une violence rare. Avec sa nouvelle gamme Sj&#246;ss, l'enseigne propose des blocs de charge fiables &#224; partir de 2,99 euros. &#192; ce tarif-l&#224;, on couvre &#224; peine les frais de transport.
</description>
    </item>
    <item>
      <title>Blu-ray just turned 20 years old and it&#8217;s still my go-to optical disc for movies &#8212; here&#8217;s why</title>
      <link>https://www.techradar.com/televisions/blu-ray/blu-ray-just-turned-20-years-old-and-its-still-my-go-to-optical-disc-for-movies-heres-why</link>
      <pubDate>Mon, 05 Jan 2026 13:10:45 +0000</pubDate>
      <guid isPermaLink="false">o6GLWqmKcywEvWbatoGnkQ</guid>
      <description>If thinking back to CES 2006 makes you feel old, don&#8217;t &#8211; just keep on collecting</description>
    </item>
    <item>
      <title>L&#8217;ANFR fait le m&#233;nage : ces 8 smartphones n&#8217;auraient jamais d&#251; atterrir dans votre poche</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2928461_lanfr-fait-le-menage-ces-8-smartphones-nauraient-jamais-du-atterrir-dans-votre-poche</link>
      <pubDate>Mon, 05 Jan 2026 13:07:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2928461_lanfr-fait-le-menage-ces-8-smartphones-nauraient-jamais-du-atterrir-dans-votre-poche</guid>
      <description>
L'ANFR vient de taper du poing sur la table. L'agence ordonne le retrait imm&#233;diat de huit smartphones du march&#233; fran&#231;ais. Entre des niveaux d'ondes qui d&#233;passent les bornes et des appareils vendus sans aucune certification europ&#233;enne.
</description>
    </item>
    <item>
      <title>Everything announced at CES 2026</title>
      <link>https://www.engadget.com/general/everything-announced-at-ces-2026-130124802.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 13:01:24 +0000</pubDate>
      <guid isPermaLink="false">fd3b4bbf-1b78-4e34-9914-70a2e6f85389</guid>
      <description>It's the first week of a new year and there's no time for the tech world to slowly ease back into things following the holidays. That's because CES 2026 is in full swing, with all manner of companies descending on Las Vegas to reveal their latest innovations and what they're planning to bring your way in the near future.&#160;Many of the Engadget crew are on the ground to check out as much of the new tech as possible. Of course, we're keeping tabs on all of the major CES press conferences too. Samsung has already held its First Look presentation, which focuses on home products, while LG has shown o...</description>
    </item>
    <item>
      <title>Des parieurs crypto ont gagn&#233; une fortune gr&#226;ce &#224; la capture de Nicol&#225;s Maduro</title>
      <link>https://www.01net.com/actualites/investisseurs-crypto-gagne-fortune-grace-capture-nicolas-maduro.html</link>
      <pubDate>Mon, 05 Jan 2026 13:01:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318088</guid>
      <description>La capture de Nicol&#225;s Maduro par l&#8217;arm&#233;e am&#233;ricaine a aussi fait exploser les compteurs sur PolyMarket. En misant sur son arrestation avant m&#234;me le d&#233;but des frappes, quelques parieurs anonymes ont empoch&#233; des centaines de milliers de dollars en cryptomonnaies.</description>
    </item>
    <item>
      <title>JBL just announced a bunch of new earbuds at CES</title>
      <link>https://www.engadget.com/audio/headphones/jbl-just-announced-a-bunch-of-new-earbuds-at-ces-130044239.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 13:00:44 +0000</pubDate>
      <guid isPermaLink="false">c6ff7736-63ca-4e16-8302-2fdf7b38f9ad</guid>
      <description>JBL just revealed a bunch of new earbuds at CES 2026, suiting just about every ear canal out there. First up, there are several new additions to the Endurance line of sports-adjacent earbuds.
The baddest of the bunch is likely the Endurance Zone, which offers 32 hours of battery life and fast charging. They include the company's proprietary OpenSound technology, which directs audio signals to the ears without blocking the ear canal. This means that wearers should be able to detect ambient noise during a workout. This is extremely helpful when someone is asking to use the machine because you've...</description>
    </item>
    <item>
      <title>JBL expands open-ear lineup with new buds coming to the US in March</title>
      <link>https://www.theverge.com/tech/852021/jbl-open-ear-earbuds-ces-2026</link>
      <pubDate>2026-01-05T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=852021</guid>
      <description>JBL has announced wide availability of three new open-style earbuds in early 2026. The JBL Sense Pro and Sense Lite join the original Sense, which came out in 2024. The new Sense Pro and Lite use JBL's OpenSound technology, support Dual Connect and Fast Pair, have an adjustable ear hook for better comfort, and allow [&#8230;]</description>
    </item>
    <item>
      <title>JBL expands Endurance workout line with four new earbuds</title>
      <link>https://www.theverge.com/tech/853331/jbl-endurance-workout-earbuds-ces-2026</link>
      <pubDate>2026-01-05T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=853331</guid>
      <description>JBL is adding a wide range of workout earbuds to its arsenal, with updates to the existing Peak and Run earbuds and the introduction of the Zone and Pace open-ear design buds. The variety of earbuds include open-style, sealed with ANC, and some inexpensive wired options, and cost between $24.95 and $179.95. Sitting at the [&#8230;]</description>
    </item>
    <item>
      <title>JBL is going all-in on open earbuds at CES 2026: meet the firm&#8217;s 3 new open-fit options</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/jbls-going-all-in-on-open-earbuds-at-ces-2026-meet-every-new-open-fit-option-in-las-vegas</link>
      <pubDate>Mon, 05 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">4tQjYnoRaBQywc4eWVxzPS</guid>
      <description>JBL really wants to keep your ear canals free of intrusion in 2026 &#8211;and the Soundgear Clips, Sense Pro and Sense Lite prove it.</description>
    </item>
    <item>
      <title>JBL launches a trio of gaming headsets for CES</title>
      <link>https://www.engadget.com/audio/headphones/jbl-launches-a-trio-of-gaming-headsets-for-ces-130000929.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">6f97c1e6-de94-4899-b3be-fef5b59038e2</guid>
      <description>For CES this year, JBL has added three new gaming headsets to its JBL Quantum product lineup. JBL Quantum 950X is the latest set of flagship headphones from the brand, with 50mm carbon dynamic drivers and features such as spatial audio, 3D head tracking and active noise cancelation. The set is compatible with PC, consoles and mobile platforms through 2.4GHz, Bluetooth 5.3 or wired connection. The 950X has a pair of hot-swappable and rechargeable batteries that give 50 hours of playtime. It comes with a 6mm cardioid boom microphone that uses AI noise reduction to keep background sounds out of i...</description>
    </item>
    <item>
      <title>PC gamers face a miserable new year as Nvidia RTX 5000 GPUs are reportedly hit by shortages due to RAM crisis</title>
      <link>https://www.techradar.com/computing/gpu/pc-gamers-face-a-miserable-new-year-as-nvidia-rtx-5000-gpus-are-reportedly-hit-by-shortages-due-to-ram-crisis</link>
      <pubDate>Mon, 05 Jan 2026 12:59:14 +0000</pubDate>
      <guid isPermaLink="false">EPFFxVRFKSoQALSXisSxFb</guid>
      <description>PC gaming could be in disarray in 2026, if reports of Nvidia RTX 5000 GPU shortages continue to surface.</description>
    </item>
    <item>
      <title>Asus ne sortira aucun smartphone en 2026 : la production est suspendue</title>
      <link>https://www.frandroid.com/marques/asus/2928449_asus-ne-sortira-aucun-smartphone-en-2026-la-production-est-suspendue</link>
      <pubDate>Mon, 05 Jan 2026 12:54:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/asus/2928449_asus-ne-sortira-aucun-smartphone-en-2026-la-production-est-suspendue</guid>
      <description>
L'histoire se r&#233;p&#232;te-t-elle ? Apr&#232;s Acer en 2016 et LG en 2021, c'est au tour d'Asus de vaciller. Le fabricant a confirm&#233; l'arr&#234;t des lancements pour toute l'ann&#233;e 2026. Officiellement, ce n'est pas un retrait d&#233;finitif. Officieusement, &#231;a y ressemble terriblement.
</description>
    </item>
    <item>
      <title>CES 2026 live Q&amp;A &#8211; ask our experts anything about the wildest new tech at the Vegas show</title>
      <link>https://www.techradar.com/tech-events/ces-2026-live-q-and-a</link>
      <pubDate>Mon, 05 Jan 2026 12:50:58 +0000</pubDate>
      <guid isPermaLink="false">uVYhLsSzyEDQbSjFeD3KvL</guid>
      <description>CES 2026 has started, and we're here to answer your burning questions about everything on show in Vegas. Hit us up below.</description>
    </item>
    <item>
      <title>Govee unveils 3 new smart lights, plus a host of new features to help you create the perfect mood</title>
      <link>https://www.techradar.com/home/smart-lights/govee-unveils-3-new-smart-lights-plus-a-host-of-new-features-to-help-you-create-the-perfect-mood</link>
      <pubDate>Mon, 05 Jan 2026 12:41:24 +0000</pubDate>
      <guid isPermaLink="false">r6DTs8njVWrst98b7NskUb</guid>
      <description>There are three new smart lights joining the Govee family, and they're looking to be serious Philips Hue competitors.</description>
    </item>
    <item>
      <title>The Samsung Galaxy Buds 4 have leaked again &#8211; here are 3 upgrades to expect from the wireless earbuds</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/the-samsung-galaxy-buds-4-have-leaked-again-here-are-3-upgrades-to-expect-from-the-wireless-earbuds</link>
      <pubDate>Mon, 05 Jan 2026 12:37:30 +0000</pubDate>
      <guid isPermaLink="false">iYDmjKDFbXQvusTRkYXEXE</guid>
      <description>Samsung is slowly getting around to releasing another two pairs of its flagship wireless earbuds.</description>
    </item>
    <item>
      <title>Garmin has a new plan to improve your fitness using your food intake &#8212; if you pay for Connect+</title>
      <link>https://www.techradar.com/health-fitness/garmin-has-a-new-plan-to-improve-your-fitness-using-your-food-intake-if-you-pay-for-connect</link>
      <pubDate>Mon, 05 Jan 2026 12:37:04 +0000</pubDate>
      <guid isPermaLink="false">Awtxi55amcteKGmjJHf574</guid>
      <description>The Garmin Connect app will add the ability to enter food intake using a quick photo (for Connect+ users).</description>
    </item>
    <item>
      <title>Windows 11 finishes an embarrassing last in speed test of six Windows generations &#8212; but there's a big catch</title>
      <link>https://www.techradar.com/computing/windows/windows-11-finishes-an-embarrassing-last-in-speed-test-of-six-windows-generations-but-theres-a-big-catch</link>
      <pubDate>Mon, 05 Jan 2026 12:36:41 +0000</pubDate>
      <guid isPermaLink="false">4Tvo6HKFGTvSm6cMdoNBwA</guid>
      <description>There are obvious sticking points with the methodology of the suite of tests, but the results are still worth discussing.</description>
    </item>
    <item>
      <title>Brigitte Macron&#160;: les dix pr&#233;venus condamn&#233;s pour cyberharc&#232;lement, des peines allant jusqu&#8217;&#224; six mois ferme</title>
      <link>https://www.01net.com/actualites/brigitte-macron-les-dix-prevenus-condamnes-pour-cyberharcelement-des-peines-allant-jusqua-six-mois-ferme.html</link>
      <pubDate>Mon, 05 Jan 2026 12:19:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318116</guid>
      <description>Ce lundi 5 janvier, le tribunal correctionnel de Paris a rendu son jugement dans l'affaire du cyberharc&#232;lement de Brigitte Macron. Les dix pr&#233;venus, qui &#233;taient accus&#233;s d&#8217;avoir diffus&#233; ou relay&#233; une rumeur transphobe visant la Premi&#232;re dame, ont &#233;t&#233; reconnus coupables de cyberharc&#232;lement.</description>
    </item>
    <item>
      <title>Moiti&#233; prix sur un TV LG OLED 4K 144 Hz de 77&#8243; avec Dolby Vision et Atmos pour du cin&#233;ma et du gaming haute qualit&#233;</title>
      <link>https://www.frandroid.com/bons-plans/2928147_moitie-prix-sur-un-tv-lg-oled-4k-144-hz-de-77-avec-dolby-vision-et-atmos-pour-du-cinema-et-du-gaming-haute-qualite</link>
      <pubDate>Mon, 05 Jan 2026 12:19:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2928147_moitie-prix-sur-un-tv-lg-oled-4k-144-hz-de-77-avec-dolby-vision-et-atmos-pour-du-cinema-et-du-gaming-haute-qualite</guid>
      <description>
Il n'est pas rare de retrouver des TV &#224; prix cass&#233; sur PC Componentes : mais un LG OLED 4K 144 Hz de 77 pouces pour 1 734,55 euros au lieu de 3 599 euros, c'est fort.
</description>
    </item>
    <item>
      <title>Motorola s&#8217;attaquerait enfin au Galaxy Z Fold avec un myst&#233;rieux Razr Fold</title>
      <link>https://www.01net.com/actualites/motorola-sattaquerait-enfin-au-galaxy-z-fold-avec-un-mysterieux-razr-fold.html</link>
      <pubDate>Mon, 05 Jan 2026 12:16:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318089</guid>
      <description>La marque, sp&#233;cialiste du format &#224; clapet, s'appr&#234;te enfin &#224; jouer dans la cour des grands. Une fuite r&#233;v&#232;le l'existence du &#171; Razr Fold &#187;, son premier smartphone pliant au format livre, accompagn&#233; d'un nouveau fleuron ultra-fin.</description>
    </item>
    <item>
      <title>The Lego Botanicals Artificial Wildflower Bouquet is over $10 off at Amazon</title>
      <link>https://mashable.com/article/jan-5-lego-botanicals-artificial-wildflower-bouquet-deal</link>
      <pubDate>Mon, 05 Jan 2026 12:16:18 +0000</pubDate>
      <guid isPermaLink="false">02md7RvjxbaqTJNoUTJAeTR</guid>
      <description>As of Jan. 5, the Lego Botanicals Artificial Wildflower Bouquet is on sale at Amazon for $47.98, 20% off its list price of $59.99.</description>
    </item>
    <item>
      <title>AI hasn&#8217;t lived up to the hype &#8211; but can CES 2026 fix that?</title>
      <link>https://www.techradar.com/ai-platforms-assistants/ai-hasnt-lived-up-to-the-hype-but-can-ces-2026-fix-that</link>
      <pubDate>Mon, 05 Jan 2026 12:16:04 +0000</pubDate>
      <guid isPermaLink="false">GuzkLceYCk3NiPBb8iHrdf</guid>
      <description>All I want for CES 2026 is AI that lives up to the hype &#8211; but I&#8217;m not holding my breathAI hasn&#8217;t lived up to the hype &#8211; but can CES 2026 fix that?</description>
    </item>
    <item>
      <title>LG&#8217;s new OLED TV is just 9mm thick</title>
      <link>https://techcrunch.com/2026/01/05/lgs-new-oled-tv-is-just-9mm-thick/</link>
      <pubDate>Mon, 05 Jan 2026 12:13:11 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3079654</guid>
      <description>This year LG is showing off its manufacturing chops at CES with a new Wallpaper OLED TV that is just 9mm thick.</description>
    </item>
    <item>
      <title>Luminar claims founder Austin Russell is dodging a subpoena in the bankruptcy case</title>
      <link>https://techcrunch.com/2026/01/05/luminar-claims-founder-austin-russell-is-dodging-a-subpoena-in-the-bankruptcy-case/</link>
      <pubDate>Mon, 05 Jan 2026 12:10:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3079525</guid>
      <description>The Luminar founder claims he has been cooperative.</description>
    </item>
    <item>
      <title>8BitDo's FlipPad controller could be a great way to play retro games on your phone</title>
      <link>https://www.techradar.com/gaming/8bitdos-flippad-controller-could-be-a-great-way-to-play-retro-games-on-your-phone</link>
      <pubDate>Mon, 05 Jan 2026 12:07:49 +0000</pubDate>
      <guid isPermaLink="false">DPBJ2sm9kt4SiDDwNvHiQe</guid>
      <description>The 8BitDo FlipPad is a retro controller for your phone, coming later this year.</description>
    </item>
    <item>
      <title>&#8216;Shogun&#8217; Creator Says Season 2 &#8216;Defies Expectations&#8217;</title>
      <link>https://www.wired.com/story/shogun-creator-says-season-2-defies-expectations/</link>
      <pubDate>Mon, 05 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">6941f285cb4966424bfc5352</guid>
      <description>The historical series Shogun was an international hit that won a record 18 Emmy Awards. With production on season 2 starting, the writer and executive producer talk about their new challenges.</description>
    </item>
    <item>
      <title>Magnesium Supplements Crash Course (2026): Benefits and Side Effects</title>
      <link>https://www.wired.com/story/what-are-magnesium-supplements-good-for/</link>
      <pubDate>Mon, 05 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">68a7446cf73ac00118b69960</guid>
      <description>Promises of better sleep&#8212;and better poops&#8212;are driving the magnesium supplements craze.</description>
    </item>
    <item>
      <title>Teradar reveals its first terahertz-band vision sensor for cars</title>
      <link>https://techcrunch.com/2026/01/05/teradar-reveals-its-first-terahertz-band-vision-sensor-for-cars/</link>
      <pubDate>Mon, 05 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3079636</guid>
      <description>The company is tapping the terahertz band of the electromagnetic spectrum to bring out the best qualities of more common lidar and radar sensors.</description>
    </item>
    <item>
      <title>Fraimic is an E Ink display that turns your ideas into AI art</title>
      <link>https://www.engadget.com/home/smart-home/fraimic-is-an-e-ink-display-that-turns-your-ideas-into-ai-art-120000454.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">68f75b2a-2471-4279-8005-17020e320919</guid>
      <description>It's not the first of its kind, but a few key differences set Fraimic apart from other E Ink art displays. Aura, Switchbot and others have something similar. But unlike other versions, this one requires no subscription, lets you swap out the surrounding frame and doesn&#8217;t require an app to upload the art. Instead, a built-in mic picks up your idea, sends it to OpenAI and creates an image that pops up in a few moments on the screen. The on-board accelerometer even knows whether the device is in landscape or portrait orientation, and applies the correct format.
A purchase of the Fraimic comes wit...</description>
    </item>
    <item>
      <title>9 blockbuster buildings opening in 2026</title>
      <link>https://www.fastcompany.com/91462372/9-blockbuster-buildings-opening-in-2026</link>
      <pubDate>2026-01-05T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91462372/9-blockbuster-buildings-opening-in-2026</guid>
      <description>From the futuristic Lucas Museum to a rammed earth library in North Dakota, these are some of the most anticipated buildings of this year.  
2026 will be a year of architectural showstoppers. Major projects, from corporate headquarters to sports stadiums and museums, will wrap construction and open to the public in 2026, bringing bold, sometimes audacious buildings to cities around the world. Here are nine buildings opening in 2026 to watch for....</description>
    </item>
    <item>
      <title>12 CEOs share bold predictions for 2026</title>
      <link>https://www.fastcompany.com/91464891/12-ceos-share-bold-predictions-for-2026</link>
      <pubDate>2026-01-05T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464891/12-ceos-share-bold-predictions-for-2026</guid>
      <description>Market corrections, the rise of sovereign AI, and the first AI-driven attack are among the bold predictions for the coming year.
Hello and welcome to Modern CEO! I&#8217;m Stephanie Mehta, CEO and chief content officer of Mansueto Ventures. Each week this newsletter explores inclusive approaches to leadership drawn from conversations with executives and entrepreneurs, and from the pages of Inc. and Fast Company. If you received this newsletter from a friend, you can sign up to get it yourself every Monday morning....</description>
    </item>
    <item>
      <title>CES 2026 live updates: The latest news, surprises, strange tech, and more</title>
      <link>https://mashable.com/live/ces-2026-news-live-updates</link>
      <pubDate>Mon, 05 Jan 2026 11:57:27 +0000</pubDate>
      <guid isPermaLink="false">00HdPGMgSorg1E6HI6usOJ2</guid>
      <description>CES 2026 is here. See the latest news on bleeding-edge tech, EV advancements, and more.</description>
    </item>
    <item>
      <title>The Magic: The Gathering Commander Masters Set Booster Box is now over $50 below market value on Amazon</title>
      <link>https://mashable.com/article/jan-5-magic-the-gathering-commander-masters-set-booster-box-deal</link>
      <pubDate>Mon, 05 Jan 2026 11:52:37 +0000</pubDate>
      <guid isPermaLink="false">04p2YNNj6Dc7nRnz3JVDUuI</guid>
      <description>As of Jan. 5, Magic: The Gathering Commander Masters Set Booster Box is over $50 below market value at Amazon.</description>
    </item>
    <item>
      <title>I took on a 30-day toe-touching stretching challenge &#8211; here's how I got on</title>
      <link>https://www.techradar.com/health-fitness/can-i-stretch-to-touch-my-toes-in-a-month</link>
      <pubDate>Mon, 05 Jan 2026 11:49:37 +0000</pubDate>
      <guid isPermaLink="false">poWBZjLBZR9tM9znKhxVQT</guid>
      <description>After 31 days of 15 minutes' of stretching, would I succeed?</description>
    </item>
    <item>
      <title>Get $20 off the JBL Vibe Beam earbuds at Amazon</title>
      <link>https://mashable.com/article/jan-5-jbl-vibe-beam-deal</link>
      <pubDate>Mon, 05 Jan 2026 11:48:42 +0000</pubDate>
      <guid isPermaLink="false">00CSwp8Zw8gWkRELUFJIptp</guid>
      <description>As of Jan. 5, the JBL Vibe Beam earbuds in black and white are marked down to $29.95. This is 40% off their list price of $49.95.</description>
    </item>
  </channel>
</rss>
