<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 22 Dec 2025 12:52:43 GMT</lastBuildDate>
    <item>
      <title>Federal judge blocks Louisiana&#8217;s social media age verification law &#8211; here's why</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/federal-judge-blocks-louisianas-social-media-age-verification-law-heres-why</link>
      <pubDate>Mon, 22 Dec 2025 12:47:54 +0000</pubDate>
      <guid isPermaLink="false">DuVQ3aMJTjMU3QxsTbgfKB</guid>
      <description>Another state-level attempt to enforce age verification on social media has been blocked. A federal judge ruled Louisiana's Act 456 unconstitutional, citing major privacy and First Amendment concerns.</description>
    </item>
    <item>
      <title>ChatGPT 5.2 peut devenir plus chaleureux gr&#226;ce &#224; ce r&#233;glage</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2917711_chatgpt-5-2-peut-devenir-plus-chaleureux-grace-a-ce-reglage</link>
      <pubDate>Mon, 22 Dec 2025 12:38:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2917711_chatgpt-5-2-peut-devenir-plus-chaleureux-grace-a-ce-reglage</guid>
      <description>
OpenAI d&#233;voile un nouveau r&#233;glage permettant d'ajuster la personnalit&#233; de ChatGPT. De quoi ajouter un peu de chaleur dans un mod&#232;le robotique parfois insolent. 
</description>
    </item>
    <item>
      <title>NHS England tech provider reveals data breach - DXS International hit by ransomware</title>
      <link>https://www.techradar.com/pro/security/nhs-england-tech-provider-reveals-data-breach-dxs-international-hit-by-ransomware</link>
      <pubDate>Mon, 22 Dec 2025 12:20:00 +0000</pubDate>
      <guid isPermaLink="false">DwAuHBKsXWAoT5SXxDLdoZ</guid>
      <description>DXS International was hit by ransomware, but we don't know if any files were stolen.</description>
    </item>
    <item>
      <title>Juste avant No&#235;l, le Realme 12 Pro dot&#233; d&#8217;un &#233;cran OLED 120 Hz s&#8217;offre une r&#233;duction de 53 % sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2917775_juste-avant-noel-le-realme-12-pro-dote-dun-ecran-oled-120-hz-soffre-une-reduction-de-53-sur-amazon</link>
      <pubDate>Mon, 22 Dec 2025 12:17:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2917775_juste-avant-noel-le-realme-12-pro-dote-dun-ecran-oled-120-hz-soffre-une-reduction-de-53-sur-amazon</guid>
      <description>
Le Realme 12 Pro est un smartphone abordable qui dispose d'une autonomie tr&#232;s honn&#234;te, mais surtout d'un solide duo d'appareils photo &#224; l'arri&#232;re. Pour faire plaisir &#224; un proche en cette p&#233;riode de f&#234;tes, il perd 53 % de son prix chez Amazon.
</description>
    </item>
    <item>
      <title>'It's business as usual. The app is working, warranties will be honored' &#8212; iRobot CEO reassures Roomba owners following takeover</title>
      <link>https://www.techradar.com/home/robot-vacuums/its-business-as-usual-the-app-is-working-warranties-will-be-honored-irobot-ceo-reassures-roomba-owners-following-takeover</link>
      <pubDate>Mon, 22 Dec 2025 12:14:15 +0000</pubDate>
      <guid isPermaLink="false">m2p9gkQTj4PKw5Jo2JZacj</guid>
      <description>Your Roomba is not about to become an expensive doorstop, promises company boss.</description>
    </item>
    <item>
      <title>Nouvelle fuite chez Chronopost&#160;? Un pirate affirme avoir vol&#233; les donn&#233;es de 860&#160;000 Fran&#231;ais</title>
      <link>https://www.01net.com/actualites/nouvelle-fuite-chez-chronopost-pirate-affirme-avoir-vole-donnees-860-000-francais.html</link>
      <pubDate>Mon, 22 Dec 2025 12:11:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316574</guid>
      <description>Chronopost aurait subi une nouvelle fuite de donn&#233;es. Sur BreachForums, un pirate affirme avoir mis la main sur les donn&#233;es li&#233;es &#224; 860 000 colis exp&#233;di&#233;s en France. Les informations auraient &#233;t&#233; exfiltr&#233;es par le biais du r&#233;seau de points relais Pickup.</description>
    </item>
    <item>
      <title>The Best Japanese Planners (2026): Hobonichi Techo, Kokuyo Jibun Techo</title>
      <link>https://www.wired.com/story/japanese-planners-explained/</link>
      <pubDate>Mon, 22 Dec 2025 12:09:00 +0000</pubDate>
      <guid isPermaLink="false">6943153b817d759947370743</guid>
      <description>Are Japanese planners like the Hobonichi really better than American planners? Here&#8217;s where they differ and why you might want to switch.</description>
    </item>
    <item>
      <title>ChatGPT&#8217;s new personality settings let you pick the vibe &#8212; and it ranges from corporate calm to chaotic bestie</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/chatgpts-new-personality-settings-let-you-pick-the-vibe-and-it-ranges-from-corporate-calm-to-chaotic-bestie</link>
      <pubDate>Mon, 22 Dec 2025 12:06:00 +0000</pubDate>
      <guid isPermaLink="false">d2aCUt7pArPjh3RUfGUiyG</guid>
      <description>I tried ChatGPT&#8217;s personality settings &#8211; and it went from office small talk to full-on brunch BFF energy.</description>
    </item>
    <item>
      <title>AI Mate in Wondershare Filmora V15: a new era of intelligent video creation</title>
      <link>https://gizmodo.com/ai-mate-in-wondershare-filmora-v15-a-new-era-of-intelligent-video-creation-2000700107</link>
      <pubDate>Mon, 22 Dec 2025 12:05:47 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000700107</guid>
      <description>Faster, smarter workflows and more powerful tools&#8212;with AI integrated.</description>
    </item>
    <item>
      <title>Watch out &#8211; RAM rip-offs are now in vogue, so here's how to avoid falling for high-end memory scams</title>
      <link>https://www.techradar.com/computing/memory/watch-out-ram-rip-offs-are-now-in-vogue-so-heres-how-to-avoid-falling-for-high-end-memory-scams</link>
      <pubDate>Mon, 22 Dec 2025 12:04:52 +0000</pubDate>
      <guid isPermaLink="false">fCmrTiMzBTbPTfQJXKP6vQ</guid>
      <description>Forget 'rock in a box' GPUs, high-end RAM scams are now being reported &#8211; here's how to avoid getting stung.</description>
    </item>
    <item>
      <title>LG announces next-gen version of its best OLED TV tech &#8212; oh, and it&#8217;s changing the name</title>
      <link>https://www.techradar.com/televisions/lg-announces-next-gen-version-of-its-best-oled-tv-tech-oh-and-its-changing-the-name</link>
      <pubDate>Mon, 22 Dec 2025 12:03:50 +0000</pubDate>
      <guid isPermaLink="false">44skjnkSWxchGroGw2aD4W</guid>
      <description>LG sets the stage for the next G-series OLED TV and multiple gaming monitors</description>
    </item>
    <item>
      <title>La Chine affirme avoir son &#171;&#160;Nvidia killer&#160;&#187;, Moore Threads d&#233;voile Huagang avec de premiers chiffres</title>
      <link>https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2918269_la-chine-affirme-avoir-son-nvidia-killer-moore-threads-devoile-huagang-avec-de-premiers-chiffres</link>
      <pubDate>Mon, 22 Dec 2025 12:01:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2918269_la-chine-affirme-avoir-son-nvidia-killer-moore-threads-devoile-huagang-avec-de-premiers-chiffres</guid>
      <description>
Multiplier les performances par 15 d'une g&#233;n&#233;ration &#224; l'autre ? M&#234;me Nvidia n'ose pas promettre &#231;a. C'est pourtant ce que clame Moore Threads avec sa nouvelle puce "Lushan". Avec 64 Go de m&#233;moire et une compatibilit&#233; DirectX 12 Ultimate, le constructeur chinois veut prouver qu'il existe. Reste &#224; voir si les drivers suivront enfin le mat&#233;riel.
</description>
    </item>
    <item>
      <title>&#8216;Avatar: Fire and Ash&#8217; Gets Off To a Hot Theatrical Start</title>
      <link>https://gizmodo.com/avatar-fire-and-ash-gets-off-to-a-hot-theatrical-start-2000702376</link>
      <pubDate>Mon, 22 Dec 2025 12:00:24 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702376</guid>
      <description>Domestic audiences didn't fully turn up for 'Avatar: Fire and Ash,' but the international market may help it rake in end-of-year dough.</description>
    </item>
    <item>
      <title>I&#8217;ve driven Kia&#8217;s debut electric van and it&#8217;s one of the most convincing electric people-movers out there</title>
      <link>https://www.techradar.com/vehicle-tech/hybrid-electric-vehicles/ive-driven-kias-debut-electric-van-and-its-one-of-the-most-convincing-electric-people-movers-out-there</link>
      <pubDate>Mon, 22 Dec 2025 12:00:15 +0000</pubDate>
      <guid isPermaLink="false">RbbHSP42QNCAH7yGh3EMdF</guid>
      <description>Forget your big SUVs, Kia's debut electric van makes people carriers cool.</description>
    </item>
    <item>
      <title>The 4 key takeaways from business leaders in 2025</title>
      <link>https://www.fastcompany.com/91460518/the-4-key-takeaways-from-business-leaders-in-2025</link>
      <pubDate>2025-12-22T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91460518/the-4-key-takeaways-from-business-leaders-in-2025</guid>
      <description>Navigating uncertainty and managing AI were two of the year&#8217;s key lessons that leaders shared with Modern CEO.
Hello and welcome to Modern CEO! Each week this newsletter explores inclusive approaches to leadership drawn from conversations with executives and entrepreneurs, and from the pages of Inc. and Fast Company. If you received this newsletter from a friend, you can sign up to get it yourself every Monday morning....</description>
    </item>
    <item>
      <title>Intel pr&#233;pare un revival de ses puces de bureau &#171; Arrow Lake &#187; : voici ce que vous devez savoir</title>
      <link>https://www.frandroid.com/marques/intel/2918039_intel-prepare-un-revival-de-ses-puces-de-bureau-arrow-lake-voici-ce-que-vous-devez-savoir</link>
      <pubDate>Mon, 22 Dec 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/intel/2918039_intel-prepare-un-revival-de-ses-puces-de-bureau-arrow-lake-voici-ce-que-vous-devez-savoir</guid>
      <description>
En parall&#232;le du lancement de ses puces mobiles Panther Lake, Intel devrait profiter du CES 2026 pour lever le voile sur un refresh de ses processeurs de bureau Arrow Lake-S, lanc&#233;s initialement &#224; l'automne 2024. Voici ce qu'il faudrait en attendre.
</description>
    </item>
    <item>
      <title>Google Gemini is now heading to fridges &#8212; and it might actually be useful</title>
      <link>https://www.techradar.com/home/smart-home/google-gemini-is-now-heading-to-fridges-and-it-might-actually-be-useful</link>
      <pubDate>Mon, 22 Dec 2025 11:43:29 +0000</pubDate>
      <guid isPermaLink="false">uc3Jna6zPVAsGJL9LHFMWF</guid>
      <description>Ready for Gemini to take over your fridge? Based on Samsung's new announcement, you might want it.</description>
    </item>
    <item>
      <title>Forget job hunting. Gen Z is &#8216;growth hunting&#8217;</title>
      <link>https://www.fastcompany.com/91452297/the-rise-of-growth-hunting-why-gen-z-changes-jobs-so-oftengenz-job-hopping</link>
      <pubDate>2025-12-22T11:41:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91452297/the-rise-of-growth-hunting-why-gen-z-changes-jobs-so-oftengenz-job-hopping</guid>
      <description>They&#8217;re not chasing titles. They&#8217;re chasing momentum.
When I talk with business leaders about Gen Z, the same frustration often bubbles up: &#8220;They won&#8217;t stay.&#8221; It&#8217;s said with a kind of bewildered shrug, as if the younger generation has suddenly rewritten the rules out of thin air. I heard it again last week during a radio segment I did about generational dynamics at work. The host asked why Gen Z feels so comfortable moving on so quickly....</description>
    </item>
    <item>
      <title>Dreame veut devenir le nouveau Xiaomi, mais prend le probl&#232;me &#224; l&#8217;envers</title>
      <link>https://www.frandroid.com/marques/dreame/2918201_dreame-veut-devenir-le-nouveau-xiaomi-mais-prend-le-probleme-a-lenvers</link>
      <pubDate>Mon, 22 Dec 2025 11:39:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dreame/2918201_dreame-veut-devenir-le-nouveau-xiaomi-mais-prend-le-probleme-a-lenvers</guid>
      <description>
Vous connaissez Dreame pour ses aspirateurs robots. Mais oubliez la poussi&#232;re un instant. La marque chinoise pr&#233;pare un virage &#224; 180 degr&#233;s avec le Dreame E1, un smartphone qui doit devenir la t&#233;l&#233;commande de votre maison. 
</description>
    </item>
    <item>
      <title>Nano Banana s&#8217;offre un look professionnel dans Google Messages</title>
      <link>https://www.frandroid.com/marques/google/2917781_nano-banana-soffre-un-look-professionnel-dans-google-messages</link>
      <pubDate>Mon, 22 Dec 2025 11:38:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2917781_nano-banana-soffre-un-look-professionnel-dans-google-messages</guid>
      <description>
Le g&#233;n&#233;rateur d'images &#224; la sauce Gemini 3 de Google s'offre une nouvelle interface dans l'application Google Messages.&#160;
</description>
    </item>
    <item>
      <title>Clair Obscur: Expedition 33 perd son prix du jeu de l&#8217;ann&#233;e aux Indie Game Awards : le point sur la pol&#233;mique</title>
      <link>https://www.frandroid.com/produits-android/console/2917995_clair-obscur-expedition-33-perd-son-prix-du-jeu-de-lannee-aux-indie-game-awards-le-point-sur-la-polemique</link>
      <pubDate>Mon, 22 Dec 2025 11:30:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2917995_clair-obscur-expedition-33-perd-son-prix-du-jeu-de-lannee-aux-indie-game-awards-le-point-sur-la-polemique</guid>
      <description>
Le jeu prim&#233; Clair Obscur: Expedition 33 s'est vu retirer un prix apr&#232;s la c&#233;r&#233;monie des Indie Game Awards. En cause : l'utilisation d&#233;cri&#233;e de l'IA dans la production du jeu.
</description>
    </item>
    <item>
      <title>People Are Using Sora 2 to Make Disturbing Videos With AI-Generated Kids</title>
      <link>https://www.wired.com/story/people-are-using-sora-2-to-make-child-fetish-content/</link>
      <pubDate>Mon, 22 Dec 2025 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">691b5911c8deafdbb03653fc</guid>
      <description>Videos such as fake ads featuring AI children playing with vibrators or Jeffrey Epstein and Diddy-themed playsets are being made with Sora 2 and posted to TikTok.</description>
    </item>
    <item>
      <title>Data centers are the buildings of our era. Do they have to be so boring?</title>
      <link>https://www.fastcompany.com/91460902/data-centers-are-the-buildings-of-our-era-do-they-have-to-be-so-boring</link>
      <pubDate>2025-12-22T11:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91460902/data-centers-are-the-buildings-of-our-era-do-they-have-to-be-so-boring</guid>
      <description>The AI data center building boom is spreading large-scale facilities across the U.S., but few are being designed with even an iota of aesthetic distinction.
If a single type of building could define our present time, it would undoubtedly be the data center. Underpinning the increasingly online way we work, shop, and entertain ourselves, data centers provide the computing power and storage to handle all the Zoom calls, Amazon purchases, and Netflix streams a person can cram into their day. And now as compute-hungry artificial intelligence dominates the future of nearly every sector of the econo...</description>
    </item>
    <item>
      <title>Waymo vehicles are operating again in San Francisco following a power outage</title>
      <link>https://www.engadget.com/transportation/waymo-vehicles-are-operating-again-in-san-francisco-following-a-power-outage-112924838.html?src=rss</link>
      <pubDate>Mon, 22 Dec 2025 11:29:24 +0000</pubDate>
      <guid isPermaLink="false">32c52d31-f271-4291-81dd-468c60543476</guid>
      <description>Waymo has resumed its robo-taxi service in San Francisco after a power outage stranded vehicles around the city, CNBC reported. The blackout, caused by a Pacific Gas &amp; Electric (PG&amp;E) substation fire, caused traffic light disruptions that affected Waymo's automated driving systems.&#160;
"Yesterday&#8217;s power outage was a widespread event that caused gridlock across San Francisco, with non-functioning traffic signals and transit disruptions," a Waymo spokesperson told CNBC in a statement. "While the failure of the utility infrastructure was significant, we are committed to ensuring our technology adju...</description>
    </item>
    <item>
      <title>Cette barre de son Samsung en promo &#224; moins de 100 &#8364; va transformer le son de vos meilleurs films de No&#235;l</title>
      <link>https://www.frandroid.com/bons-plans/2917779_cette-barre-de-son-samsung-en-promo-a-moins-de-100-e-va-transformer-le-son-de-vos-meilleurs-films-de-noel</link>
      <pubDate>Mon, 22 Dec 2025 11:25:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2917779_cette-barre-de-son-samsung-en-promo-a-moins-de-100-e-va-transformer-le-son-de-vos-meilleurs-films-de-noel</guid>
      <description>
Associ&#233;e &#224; un caisson de basses, la Samsung HW-T420 est une tr&#232;s bonne barre de son 2.1 d'entr&#233;e de gamme qui a surtout l'avantage d'&#234;tre peu on&#233;reuse. Actuellement, Boulanger la propose &#224; 99 euros au lieu de 129 euros.
</description>
    </item>
    <item>
      <title>Log into GTA Online this week for free gifts as the Christmas update rolls on</title>
      <link>https://www.techradar.com/gaming/log-into-gta-online-this-week-for-free-gifts-as-the-christmas-update-rolls-on</link>
      <pubDate>Mon, 22 Dec 2025 11:21:37 +0000</pubDate>
      <guid isPermaLink="false">hGb3m3tvbjcyd7fcbtp8WJ</guid>
      <description>GTA Online's Holiday update is now underway. There's snowy modes, seasonal weapons and decorations, as well as a the return of the Yeti Hunt.</description>
    </item>
    <item>
      <title>The higher you climb, the lonelier it gets. Here&#8217;s how leaders can stay connected</title>
      <link>https://www.fastcompany.com/91451495/the-higher-you-climb-the-lonelier-it-gets-heres-how-top-leaders-stay-connected-leadership-loneliness-connection</link>
      <pubDate>2025-12-22T11:20:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91451495/the-higher-you-climb-the-lonelier-it-gets-heres-how-top-leaders-stay-connected-leadership-loneliness-connection</guid>
      <description>Business groups, leadership retreats, and mastermind groups can help.
A few weeks ago, I led a leadership workshop for a group of executive women leaders in Birmingham, Alabama. Before I begin leadership workshops, I ask the participants what they want out of our time together. This year, one answer has emerged consistently on top: connection.This isn&#8217;t surprising. As executives rise to higher levels of leadership, they often report increased feelings of loneliness.&#160;One Harvard Business Review survey found that 55% of CEOs acknowledge experiencing moderate but significant bouts of loneliness, ...</description>
    </item>
    <item>
      <title>YouPrice : apr&#232;s Orange et SFR, un troisi&#232;me r&#233;seau mobile est disponible, mais avec un gros handicap</title>
      <link>https://www.frandroid.com/services/operateurs-mobiles/2918027_youprice-apres-orange-et-sfr-un-troisieme-reseau-mobile-est-disponible-mais-avec-un-gros-handicap</link>
      <pubDate>Mon, 22 Dec 2025 11:19:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/operateurs-mobiles/2918027_youprice-apres-orange-et-sfr-un-troisieme-reseau-mobile-est-disponible-mais-avec-un-gros-handicap</guid>
      <description>
Il &#233;tait jusqu'alors l'un des seuls op&#233;rateurs virtuels &#224; avoir deux r&#233;seaux mobiles diff&#233;rents sur ses forfaits mobiles, il peut maintenant se vanter d'en proposer trois. Depuis peu, YouPrice a dans son catalogue des forfaits mobiles sur le r&#233;seau Bouygues Telecom.
</description>
    </item>
    <item>
      <title>Xiaomi castre le Redmi Note 15 Pro+ pour sa sortie europ&#233;enne</title>
      <link>https://www.frandroid.com/marques/xiaomi/2918109_xiaomi-castre-le-redmi-note-15-pro-pour-sa-sortie-europeenne</link>
      <pubDate>Mon, 22 Dec 2025 11:18:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2918109_xiaomi-castre-le-redmi-note-15-pro-pour-sa-sortie-europeenne</guid>
      <description>
C&#8217;est la saison des Redmi Note. Xiaomi vient d'officialiser le lancement international de sa nouvelle s&#233;rie Note 15. Si les batteries atteignent des capacit&#233;s impressionnantes d&#233;passant les 6 500 mAh, la version Pro+ subit un remaniement technique discutable par rapport &#224; son homologue chinois.
</description>
    </item>
    <item>
      <title>Renault contre Stellantis : pourquoi la nouvelle cat&#233;gorie de petites voitures &#233;lectriques en Europe ne pla&#238;t pas &#224; tout le monde</title>
      <link>https://www.frandroid.com/marques/renault/2917833_renault-contre-stellantis-pourquoi-la-nouvelle-categorie-de-petites-voitures-electriques-en-europe-ne-plait-pas-a-tout-le-monde</link>
      <pubDate>Mon, 22 Dec 2025 11:14:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2917833_renault-contre-stellantis-pourquoi-la-nouvelle-categorie-de-petites-voitures-electriques-en-europe-ne-plait-pas-a-tout-le-monde</guid>
      <description>
Les nouvelles r&#232;gles de l'Europe sur 2035 et le d&#233;veloppement des petites voitures &#233;lectriques abordables n'enchantent pas tous les constructeurs. Si Renault est ravi, Stellantis pourrait &#234;tre un grand perdant... m&#234;me si tout n'est pas fait.
</description>
    </item>
    <item>
      <title>Why the McKinsey layoffs are a warning signal for consulting in the AI age</title>
      <link>https://www.fastcompany.com/91463039/why-the-mckinsey-layoffs-are-a-warning-signal-for-consulting-in-the-ai-age-ai-layoffs-management-consulting</link>
      <pubDate>2025-12-22T11:13:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463039/why-the-mckinsey-layoffs-are-a-warning-signal-for-consulting-in-the-ai-age-ai-layoffs-management-consulting</guid>
      <description>This isn&#8217;t about one firm. It&#8217;s about the whole business model.
The recent announcement by McKinsey &amp; Company that it plans to cut roughly 10% of its workforce has sent ripples through the consulting world, reigniting debate about the future of the industry. This is not about one firm, one round of layoffs, or one business cycle. It signals an irreversible shift in how value is created in consulting....</description>
    </item>
    <item>
      <title>Android 16&#160;: Google pourrait enfin corriger ce changement ergonomique tr&#232;s critiqu&#233;</title>
      <link>https://www.01net.com/actualites/android-16-google-pourrait-enfin-corriger-ce-changement-ergonomique-tres-critique.html</link>
      <pubDate>Mon, 22 Dec 2025 11:12:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316497</guid>
      <description>En 2021, Android 12 fusionnait les boutons Wi-Fi et Donn&#233;es mobiles en une seule tuile &#171; Internet &#187;, compliquant la vie de nombreux utilisateurs. Quatre ans plus tard, Google semble enfin pr&#233;parer une forme de retour en arri&#232;re.</description>
    </item>
    <item>
      <title>Eurostar chatbot security flaws almost left customers exposed to possible security threats</title>
      <link>https://www.techradar.com/pro/security/eurostar-chatbot-security-flaws-almost-left-customers-exposed-to-data-theft-and-more</link>
      <pubDate>Mon, 22 Dec 2025 11:05:00 +0000</pubDate>
      <guid isPermaLink="false">p3eNdTL9DZG4AbZnHAAaG8</guid>
      <description>Security researchers found multiple vulnerabilities on Eurostar platform, including the ability to bypass guardrails.</description>
    </item>
    <item>
      <title>Tech Disrupted Friendship. It&#8217;s Time to Bring It Back</title>
      <link>https://www.wired.com/story/expired-tired-wired-ai-friends/</link>
      <pubDate>Mon, 22 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">691b9771f96913443cf40aef</guid>
      <description>Two decades ago social media promised to connect people with pals far and wide. Twenty years online has left us turning to AI for kinship. IRL companionship is the future.</description>
    </item>
    <item>
      <title>Brain Gear Is the Hot New Wearable</title>
      <link>https://www.wired.com/story/expired-tired-wired-wearables/</link>
      <pubDate>Mon, 22 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">691b9fde1f42154b669089c9</guid>
      <description>Smartwatches are cool and all, but have you considered wearable neurotech?</description>
    </item>
    <item>
      <title>How Elon Musk Won His No Good, Very Bad Year</title>
      <link>https://www.wired.com/story/expired-tired-wired-tesla/</link>
      <pubDate>Mon, 22 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">691b967cc05ad68f076f4071</guid>
      <description>The billionaire&#8217;s involvement with the Trump administration and DOGE had deep impacts on Tesla&#8217;s bottom line. But Elon Musk was still able to turn his attention to SpaceX.</description>
    </item>
    <item>
      <title>Politics Is Fandom; Fascism Is Fanfic</title>
      <link>https://www.wired.com/story/expired-tired-wired-political-influencers/</link>
      <pubDate>Mon, 22 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">691b9c87d150559deed51f48</guid>
      <description>From Zohran Mamdani&#8217;s campaign to the US government&#8217;s Halo memes, fandom has become the defining language of US politics.</description>
    </item>
    <item>
      <title>Does Gen Z need &#8216;resilience training&#8217;?</title>
      <link>https://www.fastcompany.com/91463226/does-gen-z-need-resilience-training</link>
      <pubDate>2025-12-22T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463226/does-gen-z-need-resilience-training</guid>
      <description>One consulting firm is starting to offer the service to its youngest workers.
Resilience is a much-needed skill in today&#8217;s tough job market. Despite the headlines lambasting young employees as &#8220;lazy&#8221; and &#8220;entitled&#8221;, a Big Four consulting firm is taking matters into its own hands and offering training for recent grads.&#160;</description>
    </item>
    <item>
      <title>Voici le meilleur t&#233;l&#233;viseur OLED de l&#8217;ann&#233;e &#8211; Frandroid Awards 2025</title>
      <link>https://www.frandroid.com/produits-android/2897259_voici-le-meilleur-televiseur-oled-de-lannee-frandroid-awards-2025</link>
      <pubDate>Mon, 22 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2897259_voici-le-meilleur-televiseur-oled-de-lannee-frandroid-awards-2025</guid>
      <description>
Le meilleur t&#233;l&#233;viseur OLED test&#233; par Frandroid est le Panasonic 55Z95B. D&#233;couvrez pourquoi ce produit a re&#231;u le Frandroid Awards avec Delos de sa cat&#233;gorie. 
</description>
    </item>
    <item>
      <title>La plus pratique des Tesla Model Y devient encore plus pratique avec cet accessoire officiel</title>
      <link>https://www.frandroid.com/marques/tesla/2917873_la-plus-pratique-des-tesla-model-y-devient-encore-plus-pratique-avec-cet-accessoire-officiel</link>
      <pubDate>Mon, 22 Dec 2025 10:55:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2917873_la-plus-pratique-des-tesla-model-y-devient-encore-plus-pratique-avec-cet-accessoire-officiel</guid>
      <description>
Le Tesla Model Y L dot&#233; de six places va devenir encore plus pratique avec l'int&#233;gration d'un nouvel accessoire dans le catalogue de la marque : un matelas pour permettre de se reposer confortablement et profiter de tout l'espace suppl&#233;mentaire offert par cette version qui devrait bient&#244;t arriver en Europe.
</description>
    </item>
  </channel>
</rss>
