<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 13 Dec 2025 17:21:21 GMT</lastBuildDate>
    <item>
      <title>Slab is the first MIDI controller built exclusively for Serato Studio</title>
      <link>https://www.theverge.com/tech/839732/serato-slab-midi-controller-studio</link>
      <pubDate>2025-12-13T12:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=839732</guid>
      <description>Native Instruments and Ableton have had incredible success with their custom MIDI controllers that integrate with their DAWs (digital audio workstations), Maschine and Live, respectively. Native Instruments' Maschine (yes, it's the name of the hardware and the software) and Ableton's Push are pretty much the gold standard for integration between music-making software and hardware. Serato [&#8230;]...</description>
    </item>
    <item>
      <title>The Bosch Tassimo Finesse Friendly is a super affordable coffee maker, but beware &#8211; there's a catch that means it could cost you in the long run</title>
      <link>https://www.techradar.com/home/coffee-machines/bosch-tassimo-finesse-friendly-review</link>
      <pubDate>Sat, 13 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">6NbbYbJgJ97fJe9U2aWBg8</guid>
      <description>Looking for a cheap and cheerful coffee maker? The Finesse Friendly could be the one for you, but mind how much you're spending on pods.</description>
    </item>
    <item>
      <title>Test du Shark StainForce : voici un d&#233;tacheur compact et sans-fil &#224; l&#8217;efficacit&#233; redoutable</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/2894315_test-du-shark-stainforce-voici-un-detacheur-compact-et-sans-fil-a-lefficacite-redoutable</link>
      <pubDate>Sat, 13 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/2894315_test-du-shark-stainforce-voici-un-detacheur-compact-et-sans-fil-a-lefficacite-redoutable</guid>
      <description>
Avec le StainForce, Shark propose un d&#233;tacheur bien plus compact que les mod&#232;les traditionnels, convenant particuli&#232;rement pour les usages occasionnels et les petits espaces. Nous l'avons test&#233; sur des taches difficiles, verdict dans ce test complet.
</description>
    </item>
    <item>
      <title>Cette option m&#233;connue de Windows 11 va vous changer la vie quand un programme plante</title>
      <link>https://www.frandroid.com/marques/microsoft/2908361_cette-option-meconnue-de-windows-11-va-vous-changer-la-vie-quand-un-programme-plante</link>
      <pubDate>Sat, 13 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2908361_cette-option-meconnue-de-windows-11-va-vous-changer-la-vie-quand-un-programme-plante</guid>
      <description>
On vous dit comment activer un raccourci tr&#232;s pratique pour forcer la fermeture des applications qui plantent sur Windows 11.
</description>
    </item>
    <item>
      <title>Voici le meilleur appareil photo compact de l&#8217;ann&#233;e &#8211; Frandroid Awards 2025</title>
      <link>https://www.frandroid.com/produits-android/2903509_voici-le-meilleur-appareil-photo-compact-de-lannee-frandroid-awards-2025</link>
      <pubDate>Sat, 13 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2903509_voici-le-meilleur-appareil-photo-compact-de-lannee-frandroid-awards-2025</guid>
      <description>
Le meilleur bo&#238;tier photo compact de l'ann&#233;e sur Frandroid est le Ricoh GR IV. D&#233;couvrez pourquoi ce produit a re&#231;u le Frandroid Awards avec Delos de sa cat&#233;gorie.
</description>
    </item>
    <item>
      <title>macOS Tahoe 26.2 has landed, with a helpful new upgrade for your video calls</title>
      <link>https://www.techradar.com/computing/mac-os/macos-tahoe-26-2-has-landed-with-a-helpful-new-upgrade-for-your-video-calls</link>
      <pubDate>Sat, 13 Dec 2025 16:30:00 +0000</pubDate>
      <guid isPermaLink="false">MRqU2NfSLpQSVM5QuCQVfM</guid>
      <description>Once you get the new macOS Tahoe 26.2 update, you can try out Edge Light if you've got an Apple Silicon Mac.</description>
    </item>
    <item>
      <title>Amazon brade d&#233;j&#224; &#224; moins de 20 &#8364; sa nouvelle cl&#233; HDMI &#233;quip&#233;e de la nouvelle interface Vega OS</title>
      <link>https://www.frandroid.com/bons-plans/2906771_amazon-brade-deja-a-moins-de-20-e-sa-nouvelle-cle-hdmi-equipee-de-la-nouvelle-interface-vega-os</link>
      <pubDate>Sat, 13 Dec 2025 16:20:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2906771_amazon-brade-deja-a-moins-de-20-e-sa-nouvelle-cle-hdmi-equipee-de-la-nouvelle-interface-vega-os</guid>
      <description>
Le g&#233;ant Amazon, d&#233;j&#224; bien install&#233; dans nos salons via sa boutique et nos programmes du soir, pousse encore plus loin son emprise en s&#8217;invitant directement dans le syst&#232;me qui fait tourner nos t&#233;l&#233;viseurs. Avec son nouvel OS Vega et sa cl&#233; HDMI remise au go&#251;t du jour, le Fire TV Stick 4K Select s&#8217;offre un tarif de fin d&#8217;ann&#233;e presque ind&#233;cent.
</description>
    </item>
    <item>
      <title>This $1,500 robot cooks dinner while I work</title>
      <link>https://www.theverge.com/tech/840599/posha-robot-chef-review</link>
      <pubDate>2025-12-13T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=840599</guid>
      <description>As I'm sitting in my office writing this review, delicious, cheesy, garlicky scents are wafting up the stairs. I can hear whizzing and whirring, and the occasional clunk, as a robot chef in my kitchen is making macaroni and cheese. Its app tells me there are three minutes left in the process, and based on [&#8230;]</description>
    </item>
    <item>
      <title>I&#8217;ve driven the new Tesla Model Y Performance &#8212; and despite it being a great car, it isn't anywhere near as exciting as it once was</title>
      <link>https://www.techradar.com/vehicle-tech/hybrid-electric-vehicles/ive-driven-the-new-tesla-model-y-performance-and-despite-it-being-a-great-car-it-isnt-anywhere-near-as-exciting-as-it-once-was</link>
      <pubDate>Sat, 13 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">pt7LhX49PTUZk3PTS5tg44</guid>
      <description>Tesla's Model Y is one of the best cars it has ever produced, but the Performance edition feels expensive and kind of pointless.</description>
    </item>
    <item>
      <title>Our First Look at &#8216;Avengers: Doomsday&#8217; Might Be Split Into Four Parts</title>
      <link>https://gizmodo.com/our-first-look-at-avengers-doomsday-might-be-split-into-four-parts-2000699272</link>
      <pubDate>Sat, 13 Dec 2025 15:30:33 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000699272</guid>
      <description>Want to know what to expect from 'Avengers: Doomsday'? You'll be waiting in the theater or from your home for a month-long rollout.</description>
    </item>
  </channel>
</rss>
