<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 28 Nov 2025 21:34:43 GMT</lastBuildDate>
    <item>
      <title>The 174 best Black Friday deals we&#8217;ve found so far &#8212; a ton of tech is over half off</title>
      <link>https://www.theverge.com/gadgets/824521/black-friday-2025-best-deals-tech-gadgets-gift-ideas</link>
      <pubDate>2025-11-28T16:34:31-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=824521</guid>
      <description>Now that the Thanksgiving dishes are put away and the last slice of pie is hidden in the back of the fridge, it&#8217;s time to turn your attention to the next major holiday: Black Friday. The biggest shopping day of the year has started, and as expected, there are tens of thousands of deals staring [&#8230;]</description>
    </item>
    <item>
      <title>L&#8217;iPhone 16 Pro Max est brad&#233; pour le Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2891693_liphone-16-pro-max-est-brade-pour-le-black-friday</link>
      <pubDate>Fri, 28 Nov 2025 21:32:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2891693_liphone-16-pro-max-est-brade-pour-le-black-friday</guid>
      <description>
C'est l'offre que personne n'attendait sur un produit sorti il y a un an. Le tout-puissant iPhone 16 Pro Max tombe &#224; 1 099 &#8364; chez Darty avec le code BF30. Ajoutez &#224; cela 90 &#8364; cr&#233;dit&#233;s sur votre compte fid&#233;lit&#233;, et vous tenez le deal Apple du Black Friday.
</description>
    </item>
    <item>
      <title>That's not very trendy of them - AI browsers can be hacked with a simple hashtag, experts warn</title>
      <link>https://www.techradar.com/pro/thats-not-very-trendy-of-them-ai-browsers-can-be-hacked-with-a-simple-hashtag-experts-warn</link>
      <pubDate>Fri, 28 Nov 2025 21:28:00 +0000</pubDate>
      <guid isPermaLink="false">NyT5CFLGwetmgWZSjfP2Rd</guid>
      <description>HashJack allows attackers to hide malicious commands in URL fragments, influencing AI browsers without detection and bypassing traditional security measures.</description>
    </item>
    <item>
      <title>Black Friday : suivez en direct les meilleures offres du week-end (Amazon, Fnac, Darty&#8230;)</title>
      <link>https://www.frandroid.com/bons-plans/2891621_black-friday-suivez-en-direct-les-meilleures-offres-du-week-end-amazon-fnac-darty</link>
      <pubDate>Fri, 28 Nov 2025 21:24:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2891621_black-friday-suivez-en-direct-les-meilleures-offres-du-week-end-amazon-fnac-darty</guid>
      <description>
Le vendredi est pass&#233;, la poussi&#232;re est retomb&#233;e. Mais le Black Friday ? Il est loin d'&#234;tre termin&#233;. Amazon, Fnac, Darty et les autres jouent les prolongations tout le week-end. On reprend le direct pour vous d&#233;nicher les derniers stocks et les offres oubli&#233;es.
</description>
    </item>
    <item>
      <title>9 pouces, 165 Hz, puce de PC de bureau : la fiche technique de la console-PC Ayaneo Next 2 est absurde</title>
      <link>https://www.frandroid.com/culture-tech/economie/2891673_9-pouces-165-hz-puce-de-pc-de-bureau-la-fiche-technique-de-la-console-pc-ayaneo-next-2-est-absurde</link>
      <pubDate>Fri, 28 Nov 2025 21:21:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/economie/2891673_9-pouces-165-hz-puce-de-pc-de-bureau-la-fiche-technique-de-la-console-pc-ayaneo-next-2-est-absurde</guid>
      <description>
La course &#224; la puissance ne s'arr&#234;te jamais. Alors que GPD et OneXPlayer misent sur des batteries externes pour alimenter la monstrueuse puce AMD Strix Halo, Ayaneo choisit une autre voie. Avec sa Next 2, la marque promet d'int&#233;grer cette puissance brute dans un ch&#226;ssis tout-en-un dot&#233; d'un &#233;cran 165 Hz. Le r&#233;sultat risque d'&#234;tre lourd. Tr&#232;s lourd.
...</description>
    </item>
    <item>
      <title>These 3 portable projector Black Friday deals at Amazon are too good to miss</title>
      <link>https://www.techradar.com/televisions/projectors/these-3-portable-projector-black-friday-deals-at-amazon-are-too-good-to-miss</link>
      <pubDate>Fri, 28 Nov 2025 21:16:06 +0000</pubDate>
      <guid isPermaLink="false">w6i8dqm43UWQFfK5Zq4bxT</guid>
      <description>Portable projectors are getting great deals in Amazon's Black Friday sale. Here are 3 models we've reviewed that are worth checking out.</description>
    </item>
    <item>
      <title>Twelve South&amp;#8217;s magnetic PowerBug charger is 20 percent off for Black Friday</title>
      <link>https://www.theverge.com/gadgets/832416/black-friday-twelve-south-powerbug-wireless-charger-deal-sale-2025</link>
      <pubDate>2025-11-28T16:09:11-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=832416</guid>
      <description>My favorite deals are often on gadgets that pull double duty &#8212; like the Twelve South PowerBug, which is currently on sale for the first time for Black Friday. The handy charging accessory, which can turn any wall outlet into a miniature MagSafe charging station, is available for just $39.99 ($10 off) from Amazon and [&#8230;]</description>
    </item>
    <item>
      <title>Apple, Google required to provide digital ID tools under Missouri age verification law &#8211; but are they ready?</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/apple-google-required-to-provide-digital-id-tools-under-missouri-age-verification-law-but-are-they-ready</link>
      <pubDate>Fri, 28 Nov 2025 21:08:41 +0000</pubDate>
      <guid isPermaLink="false">sQSAZ2MSDUnZtHwAjbHfqj</guid>
      <description>Missouri's law is set to further fuel the debate around age verification and privacy. Digital IDs could be good for security if well-implemented, but Big Tech giants aren't quite ready yet.</description>
    </item>
    <item>
      <title>Stocks limit&#233;s : les meilleures offres tech Cdiscount du Black Friday sont ici</title>
      <link>https://www.frandroid.com/bons-plans/2888359_black-friday-cdiscount-voici-les-meilleures-offres-encore-en-stock-ce-vendredi</link>
      <pubDate>Fri, 28 Nov 2025 21:05:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2888359_black-friday-cdiscount-voici-les-meilleures-offres-encore-en-stock-ce-vendredi</guid>
      <description>
Tout le monde regarde Amazon. C'est une erreur. En ce vendredi de Black Friday, Cdiscount est souvent plus agressif sur les TV 4K et les PC portables. On a &#233;pluch&#233; le site ce matin : beaucoup de bruit, beaucoup de "fausses promos", mais quelques vraies p&#233;pites incontournables.
</description>
    </item>
    <item>
      <title>Best T-Mobile Black Friday deals 2025: expert picks on the iPhone 17, Galaxy S25, Google Pixel 10, and more</title>
      <link>https://www.techradar.com/phones/t-mobile/best-t-mobile-black-friday-deals-2025-expert-picks-on-the-iphone-17-galaxy-s25-google-pixel-10-and-more</link>
      <pubDate>Fri, 28 Nov 2025 21:05:50 +0000</pubDate>
      <guid isPermaLink="false">HR9H2pVrdDnmj66RaBvohE</guid>
      <description>My expert picks for today's best T-Mobile Black Friday deals, including iPhones, Android, and even cheap internet plans.</description>
    </item>
    <item>
      <title>Ma Fabrique &#224; Histoires &#224; ce prix ? Amazon brade le cadeau sans &#233;cran n&#176;1 des enfants pour le Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2891667_ma-fabrique-a-histoires-a-ce-prix-amazon-brade-le-cadeau-sans-ecran-n1-des-enfants-pour-le-black-friday</link>
      <pubDate>Fri, 28 Nov 2025 21:05:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2891667_ma-fabrique-a-histoires-a-ce-prix-amazon-brade-le-cadeau-sans-ecran-n1-des-enfants-pour-le-black-friday</guid>
      <description>
C'est le cadeau qui sauve les trajets en voiture et les couchers difficiles. La c&#233;l&#232;bre Lunii "Ma Fabrique &#224; Histoires" passe sous la barre psychologique des 50 &#8364; gr&#226;ce &#224; un coupon Amazon. &#192; 47,90 &#8364; pour l'&#233;dition limit&#233;e Oc&#233;an, c'est le moment de stocker pour No&#235;l.
</description>
    </item>
    <item>
      <title>DJI ban: how the world&amp;#8217;s biggest dronemaker is getting shoved out of the US</title>
      <link>https://www.theverge.com/news/831241/dji-ban-us-trump-fcc-customs-import-ndaa</link>
      <pubDate>2025-11-28T15:56:45-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?post_type=vm_stream&amp;p=831241</guid>
      <description>December 23rd, 2025. That&#8217;s the day DJI will automatically be banned from the United States &#8212; unless Trump steps in. You&#8217;ll still be able to fly your existing DJI drones and film with existing Osmo cameras. But DJI will be barred from importing any new products into the US, and the FCC can retroactively ban [&#8230;]</description>
    </item>
    <item>
      <title>DualSense PS5 : le meilleur prix &#171;&#160;ever&#160;&#187; pour la meilleure manette du march&#233;</title>
      <link>https://www.frandroid.com/bons-plans/bons-plans-gaming/2891657_dualsense-ps5-le-meilleur-prix-ever-pour-la-meilleure-manette-du-marche</link>
      <pubDate>Fri, 28 Nov 2025 20:56:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/bons-plans-gaming/2891657_dualsense-ps5-le-meilleur-prix-ever-pour-la-meilleure-manette-du-marche</guid>
      <description>
La manette DualSense PS5, habituellement vendue 70 &#8364; ou 75 &#8364;, vient de toucher son prix plancher absolu chez E.Leclerc.
</description>
    </item>
    <item>
      <title>Le Black Friday d&#233;marre fort : voici le TOP 100 des meilleures offres ce vendredi 28 novembre 2025</title>
      <link>https://www.frandroid.com/bons-plans/2889393_le-veritable-black-friday-commence-enfin-voici-le-top-50-des-meilleures-offres-pour-le-jour-j</link>
      <pubDate>Fri, 28 Nov 2025 20:50:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2889393_le-veritable-black-friday-commence-enfin-voici-le-top-50-des-meilleures-offres-pour-le-jour-j</guid>
      <description>
Entre les offres en avant-premi&#232;re, les promos du 11.11 ou encore la Black Week, le mois de novembre a &#233;t&#233; assez mouvement&#233; en offres. Mais, ce n'est pas fini : le Black Friday d&#233;bute officiellement ce vendredi avec de nouvelles offres dans sa besace. Nous avons fait le tri des meilleures promotions Tech, faites vous plaisir !
</description>
    </item>
    <item>
      <title>Black Friday : voici les 10 offres tech qui ont surv&#233;cu &#224; la matin&#233;e et m&#233;ritent vraiment votre argent</title>
      <link>https://www.frandroid.com/bons-plans/2890361_black-friday-voici-les-10-offres-tech-qui-ont-survecu-a-la-matinee-et-meritent-vraiment-votre-argent</link>
      <pubDate>Fri, 28 Nov 2025 20:50:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2890361_black-friday-voici-les-10-offres-tech-qui-ont-survecu-a-la-matinee-et-meritent-vraiment-votre-argent</guid>
      <description>
Il est midi pass&#233;. Le premier rush du Black Friday est termin&#233;. Le bilan ? Beaucoup de ruptures, beaucoup de fausses promos, mais quelques r&#233;sistants h&#233;ro&#239;ques. On a refait le tour des marchands pour vous sortir le Top 10 ultime de la mi-journ&#233;e.
</description>
    </item>
    <item>
      <title>The Best Black Friday Beauty Deals, WIRED Approved (2025)</title>
      <link>https://www.wired.com/story/black-friday-beauty-deals-2025/</link>
      <pubDate>Fri, 28 Nov 2025 20:40:21 +0000</pubDate>
      <guid isPermaLink="false">691cf33d6dccde5821e6657d</guid>
      <description>Name a better time to stock up on beauty bargains&#8212;I'll wait.</description>
    </item>
    <item>
      <title>Will Amazon refund you if Black Friday prices drop further? Here&#8217;s the answer &#8211; and how other retailers compare</title>
      <link>https://www.techradar.com/tech/will-amazon-refund-you-if-black-friday-prices-drop-further-heres-the-answer-and-how-other-retailers-compare</link>
      <pubDate>Fri, 28 Nov 2025 20:38:20 +0000</pubDate>
      <guid isPermaLink="false">aMuiJo4p54FXWx5xppsWQJ</guid>
      <description>Some retailers in the US and the UK will give you money back if something you've bought then gets a further discount.</description>
    </item>
    <item>
      <title>The Best Black Friday Mattress and Bedding Deals (2025)</title>
      <link>https://www.wired.com/story/best-black-friday-mattress-deals-2025-3/</link>
      <pubDate>Fri, 28 Nov 2025 20:32:35 +0000</pubDate>
      <guid isPermaLink="false">691b76ae86e69565af2a4958</guid>
      <description>Some of the best sales of the year on mattresses, mattress toppers, and pillows are happening right now.</description>
    </item>
    <item>
      <title>This Google Pixel 9 Pro XL deal is my personal pick for the best Black Friday phone deal for most people</title>
      <link>https://www.techradar.com/seasonal-sales/this-google-pixel-9-pro-xl-deal-is-my-personal-pick-for-the-best-black-friday-phone-deal-for-most-people</link>
      <pubDate>Fri, 28 Nov 2025 20:24:17 +0000</pubDate>
      <guid isPermaLink="false">vpxV4FeoV6RVxLyinpFRc3</guid>
      <description>The Google Pixel 9 Pro XL is a terrific phone, and you can bag it for an extremely reasonable price this Black Friday</description>
    </item>
    <item>
      <title>Des milliers d&#8217;A320 clou&#233;s au sol pour une mise &#224; jour d&#8217;urgence</title>
      <link>https://www.01net.com/actualites/des-milliers-da320-cloues-au-sol-pour-une-mise-a-jour-durgence.html</link>
      <pubDate>Fri, 28 Nov 2025 20:24:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312281</guid>
      <description>Coup dur pour les nombreux voyageurs qui prendront l'avion pour les f&#234;tes de fin d'ann&#233;e. Airbus cloue sur le tarmac des milliers d'A320 en raison d'un probl&#232;me logiciel. Les op&#233;rateurs et les compagnies a&#233;riennes doivent proc&#233;der &#224; une mise &#224; jour en urgence&#160;; en attendant, les avions doivent rester au sol.</description>
    </item>
    <item>
      <title>130+ best Black Friday deals: We found record prices on Apple Watches, OLED TVs, Legos, and Kindles</title>
      <link>https://mashable.com/article/best-black-friday-deals-2025</link>
      <pubDate>Fri, 28 Nov 2025 20:15:06 +0000</pubDate>
      <guid isPermaLink="false">01ATEB6D6kZoJ9sAwyqdxU7</guid>
      <description>See the top Black Friday deals on Apple products, Dyson vacuums, Sony headphones, and Legos. Save $250 on MacBooks, 27% on Kindles, and 55% on Amazon devices.</description>
    </item>
    <item>
      <title>I&amp;#8217;m a laptop reviewer, and these are the Black Friday deals I&amp;#8217;d shop&#8212;many are over $400 off</title>
      <link>https://www.theverge.com/gadgets/828617/best-black-friday-laptop-deals-macbook-surface-gaming-notebooks-2025</link>
      <pubDate>2025-11-28T15:15:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=828617</guid>
      <description>Aside from TVs, Black Friday is the best opportunity to save on one of the biggest tech purchases we&#8217;re all likely to make: a new laptop. A new generation of laptops is always around the corner at CES in January, but they&#8217;re still months away from release. In the here and now, you can get [&#8230;]</description>
    </item>
    <item>
      <title>135 Best Black Friday Deals 2025: We've Tested Every Item and Tracked Every Price</title>
      <link>https://www.wired.com/story/black-friday-deals-2025-1/</link>
      <pubDate>Fri, 28 Nov 2025 20:09:46 +0000</pubDate>
      <guid isPermaLink="false">69271d9a58e4e06eb6f254cb</guid>
      <description>Our Reviews team has scoured the entire internet to find the best Black Friday deals on gear we've tested and approved.</description>
    </item>
    <item>
      <title>15 popular Christmas gifts you can buy on sale during Black Friday 2025</title>
      <link>https://mashable.com/article/black-friday-deal-2025-christmas-gifts-to-buy-on-sale</link>
      <pubDate>Fri, 28 Nov 2025 20:08:13 +0000</pubDate>
      <guid isPermaLink="false">07pnMv7Sw5nZplSrQiV9Adt</guid>
      <description>The best Christmas gifts on sale during Black Friday, and everything on this list is at least 30% off.</description>
    </item>
    <item>
      <title>Forget DJI &#8211; this beginner drone is better equipped and now costs less in the Black Friday sales</title>
      <link>https://www.techradar.com/cameras/drones/forget-dji-this-beginner-drone-is-better-equipped-and-now-costs-less-in-the-black-friday-sales</link>
      <pubDate>Fri, 28 Nov 2025 20:07:22 +0000</pubDate>
      <guid isPermaLink="false">MBHephRp6PPK7DfAkqLcnD</guid>
      <description>A price cut / coupon combo makes for a huge saving on the Ruko F11 drone &#8211; which looks like a handy alternative to the DJI Mini 4K, that now costs less</description>
    </item>
    <item>
      <title>La Nasa relance la mission martienne europ&#233;enne : le rover Rosalind Franklin conforte son d&#233;part pour 2028</title>
      <link>https://www.futura-sciences.com/sciences/actualites/espace-nasa-relance-mission-martienne-europeenne-rover-rosalind-franklin-conforte-son-depart-2028-128002/#xtor%3DRSS-8</link>
      <pubDate>Fri, 28 Nov 2025 21:02:47 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/espace-nasa-relance-mission-martienne-europeenne-rover-rosalind-franklin-conforte-son-depart-2028-128002/#xtor%3DRSS-8</guid>
      <description>On n&#8217;y croyait presque plus : le rover europ&#233;en Rosalind Franklin, con&#231;u pour chercher des traces de vie sur Mars, s&#8217;envolera enfin vers la Plan&#232;te rouge en 2028 gr&#226;ce au soutien confirm&#233; de la Nasa &#224; la mission ExoMars.</description>
    </item>
    <item>
      <title>I've always been a MacBook hater, but these Black Friday MacBook Air deals might get me to switch sides</title>
      <link>https://www.techradar.com/computing/macbooks/ive-always-been-a-macbook-hater-but-these-black-friday-macbook-air-deals-might-get-me-to-switch-sides</link>
      <pubDate>Fri, 28 Nov 2025 20:02:30 +0000</pubDate>
      <guid isPermaLink="false">7ezHoi5dVakXtX6kGQ4Cam</guid>
      <description>Black Friday MacBook Air deals are a great way to get one of the best laptops ever made for an even better price.</description>
    </item>
    <item>
      <title>10 Things We Liked About &#8216;Stranger Things&#8217; Season 5 Vol. 1, and 4 Things We Didn&#8217;t</title>
      <link>https://gizmodo.com/10-things-we-liked-about-stranger-things-season-5-vol-1-and-4-things-we-didnt-2000691127</link>
      <pubDate>Fri, 28 Nov 2025 20:00:09 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000691127</guid>
      <description>The beginning of the end for the Duffer Brothers' phenomenon is now streaming on Netflix.</description>
    </item>
    <item>
      <title>7 Best All-Clad Black Friday Deals (2025)</title>
      <link>https://www.wired.com/story/best-all-clad-black-friday-deals-2025/</link>
      <pubDate>Fri, 28 Nov 2025 20:00:03 +0000</pubDate>
      <guid isPermaLink="false">691cc0b8702012b0597563bf</guid>
      <description>All-Clad is the best, with a price tag to match. These Black Friday deals can help you save some cash.</description>
    </item>
    <item>
      <title>Test iRobot Roomba 105 Combo + Base AutoEmpty : un entr&#233;e de gamme que nous n&#8217;attendions plus</title>
      <link>https://www.frandroid.com/test/2755041_test-irobot-roomba-105-combo-base-autoempty-un-entree-de-gamme-que-nous-nattendions-plus</link>
      <pubDate>Fri, 28 Nov 2025 20:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/test/2755041_test-irobot-roomba-105-combo-base-autoempty-un-entree-de-gamme-que-nous-nattendions-plus</guid>
      <description>
iRobot semble bien d&#233;cid&#233; &#224; ne plus se laisser tailler des croupi&#232;res, et cela concerne &#233;galement le segment d'entr&#233;e de gamme. Avec le Roomba 105 Combo, l'Am&#233;ricain promet des prestations dignes de sa r&#233;putation, &#224; un prix bien plus ma&#238;tris&#233;, notamment gr&#226;ce au passage de la cam&#233;ra au t&#233;l&#233;m&#232;tre laser.
</description>
    </item>
    <item>
      <title>Save up to 20% on select gift cards for Black Friday: Apple, Fandango, Lowes, Applebees, and more</title>
      <link>https://mashable.com/article/black-friday-deal-2025-gift-cards-amazon</link>
      <pubDate>Fri, 28 Nov 2025 19:59:34 +0000</pubDate>
      <guid isPermaLink="false">01wvUbOC26p8GvSIoDDY4lv</guid>
      <description>Select gift cards are up to 20% off at Amazon for Black Friday, including Apple, Fandango, Lowe's, Applebees, and more.</description>
    </item>
    <item>
      <title>Malicious LLMs are letting even unskilled hackers to craft dangerous new malware</title>
      <link>https://www.techradar.com/pro/security/malicious-llms-are-letting-even-unskilled-hackers-to-craft-dangerous-new-malware</link>
      <pubDate>Fri, 28 Nov 2025 19:56:00 +0000</pubDate>
      <guid isPermaLink="false">4uz47hDNj6QzXivyF3JK4X</guid>
      <description>Two chatbots designed exclusively for cybercrime - and one is completely free to use.</description>
    </item>
    <item>
      <title>Black Friday iPad deals kind of suck this year. Here are 3 Id shop as a tech editor.</title>
      <link>https://mashable.com/article/black-friday-ipad-deals-2025-amazon</link>
      <pubDate>Fri, 28 Nov 2025 19:49:22 +0000</pubDate>
      <guid isPermaLink="false">07uDLU58WkjxK5veraIrLBk</guid>
      <description>The top Black Friday deals on iPads are pretty lackluster this year, TBH. See the deals we do recommend on the iPad Air, iPad, and new iPad Pro.</description>
    </item>
    <item>
      <title>160+ Amazon Black Friday deals: Find record-low prices on AirPods, Kindles, Lego, and LG TVs</title>
      <link>https://mashable.com/article/best-black-friday-amazon-deals-2025</link>
      <pubDate>Fri, 28 Nov 2025 19:45:27 +0000</pubDate>
      <guid isPermaLink="false">042Wd6WFQz6kO0BtF8VPiYi</guid>
      <description>Amazon Black Friday 2025 is officially here, and you can buy Fire TVs starting at $99. Shop record prices on Kindle, Bose, Lego, and Apple products.</description>
    </item>
    <item>
      <title>I've been writing about fitness for 10 years, and I've found 57 Black Friday fitness deals you need to browse right now</title>
      <link>https://www.techradar.com/health-fitness/ive-been-writing-about-fitness-for-10-years-and-ive-found-57-black-friday-fitness-deals-you-need-to-browse-right-now</link>
      <pubDate>Fri, 28 Nov 2025 19:44:22 +0000</pubDate>
      <guid isPermaLink="false">aAoeLaNZxc5mBYxzevW5U4</guid>
      <description>I've been in the fitness industry for a decade &#8211; these are my Black Friday fitness deal picks</description>
    </item>
    <item>
      <title>Tackling a sea of dog hair was a daily headache for me, until I bought this robot vacuum</title>
      <link>https://www.techradar.com/seasonal-sales/tackling-a-sea-of-dog-hair-was-a-daily-headache-for-me-until-i-bought-this-robot-vacuum</link>
      <pubDate>Fri, 28 Nov 2025 19:42:28 +0000</pubDate>
      <guid isPermaLink="false">bzBPnWUqTzernpr3EjdCsW</guid>
      <description>I wasn't convinced a robot vacuum was right for my home, but this one proved me wrong.</description>
    </item>
    <item>
      <title>Moon phase today: What the moon will look like on November 28</title>
      <link>https://mashable.com/article/moon-phase-today-nov-28</link>
      <pubDate>Fri, 28 Nov 2025 19:42:28 +0000</pubDate>
      <guid isPermaLink="false">02knULnTZpFEMfHAQ5xFaCa</guid>
      <description>See the moon phase expected for November 28, 2025 as well as when the next full moon is expected.</description>
    </item>
    <item>
      <title>How to watch Heated Rivalry online &#8211; watch in UK, US, Canada as the steamy hockey drama hits No.1</title>
      <link>https://www.techradar.com/how-to-watch/how-to-watch-heated-rivalry-online-watch-in-uk-us-canada-as-the-steamy-hockey-drama-hits-no-1</link>
      <pubDate>Fri, 28 Nov 2025 19:41:14 +0000</pubDate>
      <guid isPermaLink="false">96nvXr2KqYWNSB5A3bDMKB</guid>
      <description>How to watch Heated Rivalry online and in the UK, US, Canada</description>
    </item>
    <item>
      <title>High-risk, manipulated content can remain on Facebook, Meta Oversight Board rules</title>
      <link>https://mashable.com/article/meta-oversight-board-manipulated-content-labels</link>
      <pubDate>Fri, 28 Nov 2025 19:37:01 +0000</pubDate>
      <guid isPermaLink="false">078czEYKsEO5i54xzgLEdYH</guid>
      <description>Meta has trimmed down its fact-checking efforts and leaned into AI,</description>
    </item>
  </channel>
</rss>
