<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 23 Dec 2025 15:27:27 GMT</lastBuildDate>
    <item>
      <title>OpenAI&#8217;s Outlook on AI Browser Security Is Bleak, but Maybe a Little More AI Can Fix It</title>
      <link>https://gizmodo.com/openais-outlook-on-ai-browser-security-is-bleak-but-maybe-a-little-more-ai-can-fix-it-2000702902</link>
      <pubDate>Tue, 23 Dec 2025 15:25:15 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702902</guid>
      <description>The company behind ChatGPT says prompt injection vulnerabilities will likely never be fully &#8216;solved.&#8217;</description>
    </item>
    <item>
      <title>University of Phoenix data breach may have hit over 3.5 million victims - here's what we know</title>
      <link>https://www.techradar.com/pro/security/university-of-phoenix-data-breach-may-have-hit-over-3-5-million-victims-heres-what-we-know</link>
      <pubDate>Tue, 23 Dec 2025 15:25:00 +0000</pubDate>
      <guid isPermaLink="false">kzGGt4XVant4wUcdaG3v33</guid>
      <description>Cl0p claims another victim as University of Phoenix confirms losing data of around 3.5 million people.</description>
    </item>
    <item>
      <title>Are OLED TVs or LED TVs more reliable? A long-term test says burn-in isn&#8217;t the biggest concern</title>
      <link>https://www.techradar.com/televisions/are-oled-tvs-or-led-tvs-more-reliable-a-long-term-test-says-burn-in-isnt-the-biggest-concern</link>
      <pubDate>Tue, 23 Dec 2025 15:18:56 +0000</pubDate>
      <guid isPermaLink="false">BDSP3mVrc6acMTx77JTMvi</guid>
      <description>A new study confirms that burn-in isn't the TV bogeyman some people have been led to believe</description>
    </item>
    <item>
      <title>Inside Uzbekistan&#8217;s nationwide license plate surveillance system</title>
      <link>https://techcrunch.com/2025/12/23/inside-uzbekistans-nationwide-license-plate-surveillance-system/</link>
      <pubDate>Tue, 23 Dec 2025 15:05:49 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078495</guid>
      <description>The Uzbek government's national license plate scanning system was discovered exposed to the internet for anyone to access without a password.</description>
    </item>
    <item>
      <title>GeForce Now&#160;: &#224; partir de 2026, Nvidia limitera le temps de jeu</title>
      <link>https://www.01net.com/actualites/geforce-now-a-partir-de-2026-nvidia-limitera-le-temps-de-jeu.html</link>
      <pubDate>Tue, 23 Dec 2025 15:01:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316868</guid>
      <description>Chose promise, chose due. &#192; compter du 1er janvier 2026, Nvidia d&#233;comptera le temps pass&#233; sur GeForce Now. Au-del&#224; des 100 heures par mois, il faudra attendre le mois suivant pour continuer &#224; jouer dans les meilleures conditions&#8230; ou mettre la main &#224; la poche.</description>
    </item>
    <item>
      <title>&#8216;Starfleet Academy&#8217; Introduces the Next Generation of &#8216;Star Trek&#8217; Heroes</title>
      <link>https://gizmodo.com/star-trek-starfleet-academy-promos-teasers-2000702654</link>
      <pubDate>Tue, 23 Dec 2025 15:00:48 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702654</guid>
      <description>Plus, Simu Liu teases his wardrobe changes for 'Avengers: Doomsday'.</description>
    </item>
    <item>
      <title>How Last Samurai Standing adds kinetic action to the Battle Royale formula</title>
      <link>https://www.theverge.com/streaming/847992/last-samurai-standing-netflix-interview-junichi-okada</link>
      <pubDate>2025-12-23T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=847992</guid>
      <description>Last Samurai Standing begins with a familiar premise. Desperate samurai dispossessed by the restoration of the emperor enter into a deadly game for a life-changing cash prize - all for the entertainment of anonymous elites. Unlike its inspirations Battle Royale and Squid Game, however, Last Samurai Standing's violence is chaotic, fast-paced, and kinetic, though it [&#8230;]...</description>
    </item>
    <item>
      <title>Quordle hints and answers for Wednesday, December 24 (game #1430)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-24-december-2025</link>
      <pubDate>Tue, 23 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">hno6HmJcL3Avj48WV3g9t8</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Wednesday, December 24 (game #927)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-24-december-2025</link>
      <pubDate>Tue, 23 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">dgk7gHFBdHiXmv4RdBdtf7</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Wednesday, December 24 (game #661)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-24-december-2025</link>
      <pubDate>Tue, 23 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">zZkT85d2ofqTuoYmWNer96</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Moniteur Samsung Odyssey 2026 : nouvelle &#232;re entre 3D 6K et 1040 Hz au CES 2026</title>
      <link>https://www.frandroid.com/marques/2919713_moniteur-samsung-odyssey-2026-nouvelle-ere-entre-3d-6k-et-1040-hz-au-ces-2026</link>
      <pubDate>Tue, 23 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2919713_moniteur-samsung-odyssey-2026-nouvelle-ere-entre-3d-6k-et-1040-hz-au-ces-2026</guid>
      <description>
Samsung pr&#233;pare une offensive majeure sur le march&#233; des moniteurs gaming avec une gamme Odyssey 2026 qui mise &#224; la fois sur la 3D sans lunettes, des d&#233;finitions allant jusqu&#8217;&#224; la 6K et des fr&#233;quences de rafra&#238;chissement in&#233;dites. En voici tous les d&#233;tails.
</description>
    </item>
    <item>
      <title>Les &#201;tats-Unis interdisent DJI et tous les drones &#233;trangers : voici les cons&#233;quences directes</title>
      <link>https://www.frandroid.com/marques/dji/2919827_les-etats-unis-interdisent-dji-et-tous-les-drones-etrangers-voici-les-consequences-directes</link>
      <pubDate>Tue, 23 Dec 2025 14:53:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dji/2919827_les-etats-unis-interdisent-dji-et-tous-les-drones-etrangers-voici-les-consequences-directes</guid>
      <description>
La FCC vient de signer l'arr&#234;t de mort du march&#233; des drones aux &#201;tats-Unis tel qu'on le conna&#238;t. L'objectif ? Interdire la certification de tout drone fabriqu&#233; hors du sol am&#233;ricain d&#232;s d&#233;but 2026. R&#233;sultat imm&#233;diat : c'est la panique chez les revendeurs et les fans de DJI.
</description>
    </item>
    <item>
      <title>Pirate group Anna&#8217;s Archive says it has scraped 86 million songs from Spotify</title>
      <link>https://techcrunch.com/2025/12/23/pirate-group-annas-archive-says-it-has-scraped-86-million-songs-from-spotify/</link>
      <pubDate>Tue, 23 Dec 2025 14:51:40 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078499</guid>
      <description>Spotify says it has identified and disabled the user accounts involved in the scraping.</description>
    </item>
    <item>
      <title>Cette alternative &#224; Windows continue de faire un carton : voici les chiffres</title>
      <link>https://www.frandroid.com/os/gnu-linux/2919721_cette-alternative-a-windows-continue-de-faire-un-carton-voici-les-chiffres</link>
      <pubDate>Tue, 23 Dec 2025 14:48:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/gnu-linux/2919721_cette-alternative-a-windows-continue-de-faire-un-carton-voici-les-chiffres</guid>
      <description>
La distribution Bazzite continue de battre des records de popularit&#233;. Tous les chiffres sont au vert gr&#226;ce &#224; l'exode des utilisateurs Windows.
</description>
    </item>
    <item>
      <title>Ce tr&#232;s bon casque Bowers &amp; Wilkins avec Audio Lossless est &#224; moiti&#233; prix sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2864589_ce-tres-bon-casque-bowers-wilkins-avec-audio-lossless-est-a-moitie-prix-sur-amazon</link>
      <pubDate>Tue, 23 Dec 2025 14:47:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2864589_ce-tres-bon-casque-bowers-wilkins-avec-audio-lossless-est-a-moitie-prix-sur-amazon</guid>
      <description>
Pour le Px7 S2e, Bowers &amp; Wilkins a gard&#233; la fiche technique de la premi&#232;re it&#233;ration : 30 heures d&#8217;autonomie, r&#233;duction de bruit efficace, un confort de salon d&#8217;h&#244;tel&#8230; sauf que cette fois, un DSP retravaill&#233; vient affiner l&#8217;oreille. En ce moment, il s&#8217;affiche &#224; 219,99 euros au lieu de 429 euros sur Amazon.
</description>
    </item>
    <item>
      <title>1000 km d&#8217;autonomie gr&#226;ce aux batteries solides : une r&#233;alit&#233; d&#232;s 2026 pour cette nouvelle voiture &#233;lectrique</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2919617_1000-km-dautonomie-grace-aux-batteries-solides-une-realite-des-2026-pour-cette-nouvelle-voiture-electrique</link>
      <pubDate>Tue, 23 Dec 2025 14:45:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2919617_1000-km-dautonomie-grace-aux-batteries-solides-une-realite-des-2026-pour-cette-nouvelle-voiture-electrique</guid>
      <description>
La marque chinoise Exeed, membre du groupe Chery, a pr&#233;sent&#233; ses derni&#232;res avanc&#233;es technologiques. Parmi elles, l'Exeed ES8 : une nouvelle voiture &#233;lectrique qui b&#233;n&#233;ficiera, d&#232;s 2026, de batteries solides. L'id&#233;e &#233;tant de d&#233;passer les 1 000 km d'autonomie.
</description>
    </item>
    <item>
      <title>FDA approves Novo Nordisk weight-loss pill. Here&#8217;s what to know</title>
      <link>https://www.fastcompany.com/91465775/fda-approves-novo-nordisk-weight-loss-pill-heres-what-know</link>
      <pubDate>2025-12-23T14:39:38</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91465775/fda-approves-novo-nordisk-weight-loss-pill-heres-what-know</guid>
      <description>The pill, which will be sold under the brand name Wegovy, is 25 milligrams of semaglutide.
The U.S. Food and Drug Administration approved Novo Nordisk&#8217;s weight-loss pill on Monday, giving the Danish drugmaker a leg up in the race to market a potent oral medication for shedding pounds as it looks to regain lost ground from rival Eli Lilly.</description>
    </item>
    <item>
      <title>Christmas is saved! Here are 12 instant-delivery gift cards that you can use for a last-minute gift today</title>
      <link>https://www.techradar.com/seasonal-sales/christmas-is-saved-here-are-12-instant-delivery-gift-cards-that-you-can-use-for-a-last-minute-gift-today</link>
      <pubDate>Tue, 23 Dec 2025 14:36:43 +0000</pubDate>
      <guid isPermaLink="false">dHc7nDDkkoBRJSe22CTVjT</guid>
      <description>Fitness, gaming, DIY, and much more - these instant-delivery e-gift cards are perfect for a last-minute Christmas gift.</description>
    </item>
    <item>
      <title>The Vergecast RAM Holiday Spec-tacular</title>
      <link>https://www.theverge.com/podcast/849551/ram-explainer-holiday-spectacular-vergecast</link>
      <pubDate>2025-12-23T09:35:49-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=849551</guid>
      <description>Happy Holidays! As we like to do on The Vergecast, we take this time of year to see our families, relax and recharge, and go extremely deep into a specific technology that matters right now. This year, we picked the tiny chip in all your devices that is suddenly a precious and expensive commodity: RAM. [&#8230;]</description>
    </item>
    <item>
      <title>The best Minecraft Christmas ideas in 2025</title>
      <link>https://www.techradar.com/pro/the-best-minecraft-christmas-ideas-in-2025</link>
      <pubDate>Tue, 23 Dec 2025 14:34:46 +0000</pubDate>
      <guid isPermaLink="false">Wen38PvJhmq2Xfx8qi6yK</guid>
      <description>If you're playing Minecraft this Christmas, you need to check these out</description>
    </item>
    <item>
      <title>Il se fait pirater deux fois sa PS5 malgr&#233; une s&#233;curit&#233; renforc&#233;e : il y a une &#233;norme faille de s&#233;curit&#233; chez Sony</title>
      <link>https://www.frandroid.com/produits-android/console/console-de-jeux/2919731_il-se-fait-pirater-deux-fois-sa-ps5-malgre-une-securite-renforcee-il-y-a-une-enorme-faille-de-securite-chez-sony</link>
      <pubDate>Tue, 23 Dec 2025 14:32:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/console-de-jeux/2919731_il-se-fait-pirater-deux-fois-sa-ps5-malgre-une-securite-renforcee-il-y-a-une-enorme-faille-de-securite-chez-sony</guid>
      <description>
C'est l'histoire d'un fiasco s&#233;curitaire absolu. Alors que Sony nous vend les Passkeys (cl&#233; d'acc&#232;s) comme la protection ultime, un simple num&#233;ro de transaction permet de tout contourner. Un journaliste de Numerama s'est fait pirater deux fois son compte PlayStation de sa PS5 en vingt minutes. La raison ? Une politique de v&#233;rification d'identit&#233; tellement laxiste qu'elle en devient dangereuse pour vos donn&#233;es bancaires.
...</description>
    </item>
    <item>
      <title>Fin de l&#8217;offre Pure Fibre : ultime chance pour profiter du 8 Gb/s &#224; prix mini [Sponso]</title>
      <link>https://www.frandroid.com/telecom/forfait-internet/2914027_fin-de-loffre-pure-fibre-ultime-chance-pour-profiter-du-8-gb-s-a-prix-mini</link>
      <pubDate>Tue, 23 Dec 2025 14:26:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/forfait-internet/2914027_fin-de-loffre-pure-fibre-ultime-chance-pour-profiter-du-8-gb-s-a-prix-mini</guid>
      <description>
Fini de payer pour des services superflus. Avec son offre Pure Fibre, Bouygues Telecom revitalise le march&#233; des box internet en proposant une connexion tr&#232;s rapide et du WiFi 7 pour seulement 23,99 &#8364; par mois. Une formule sans engagement et sans TV qui vise juste, mais qui conna&#238;t ses derni&#232;res heures.
</description>
    </item>
    <item>
      <title>Les jeux vid&#233;o rajeunissent votre cerveau, mais &#231;a d&#233;pend de comment vous jouez</title>
      <link>https://www.01net.com/actualites/les-jeux-video-rajeunissent-votre-cerveau-mais-ca-depend-de-comment-vous-jouez.html</link>
      <pubDate>Tue, 23 Dec 2025 14:25:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316826</guid>
      <description>Jouer peut &#234;tre bon pour le cerveau, mais pas n&#8217;importe comment. Selon plusieurs &#233;tudes r&#233;centes, seuls certains jeux, pratiqu&#233;s avec mod&#233;ration, doperaient r&#233;ellement nos capacit&#233;s cognitives.</description>
    </item>
    <item>
      <title>Avengers: Doomsday's first trailer is now online, for those who haven't traveled back to Pandora</title>
      <link>https://www.techradar.com/streaming/entertainment/avengers-doomsdays-first-trailer-is-now-online-for-those-who-havent-traveled-back-to-pandora</link>
      <pubDate>Tue, 23 Dec 2025 14:19:39 +0000</pubDate>
      <guid isPermaLink="false">SrqYnAPDNSNoTgZxk9ajm</guid>
      <description>No need to see Avatar 3 for your first peek at the next Marvel extravaganza</description>
    </item>
    <item>
      <title>Le plan de Samsung pour 2026 : s&#8217;aligner sur les rumeurs de l&#8217;iPhone Fold, le smartphone qui n&#8217;a jamais &#233;t&#233; confirm&#233;</title>
      <link>https://www.frandroid.com/marques/samsung/2919669_le-plan-de-samsung-pour-2026-saligner-sur-les-rumeurs-de-liphone-fold-le-smartphone-qui-na-jamais-ete-confirme</link>
      <pubDate>Tue, 23 Dec 2025 14:16:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2919669_le-plan-de-samsung-pour-2026-saligner-sur-les-rumeurs-de-liphone-fold-le-smartphone-qui-na-jamais-ete-confirme</guid>
      <description>
Vous trouviez les Galaxy Z Fold trop gros ? Samsung vous a entendu, mais surtout, Samsung surveille Apple. Selon de nouvelles informations venues de Cor&#233;e, le g&#233;ant pr&#233;pare un mod&#232;le au format 4:3 pour 2026. 
</description>
    </item>
    <item>
      <title>Les navigateurs IA ne seront jamais s&#251;rs : l&#8217;aveu terrible d&#8217;OpenAI</title>
      <link>https://www.frandroid.com/marques/openai/2919303_les-navigateurs-ia-ne-seront-jamais-surs-laveu-terrible-dopenai</link>
      <pubDate>Tue, 23 Dec 2025 14:15:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/openai/2919303_les-navigateurs-ia-ne-seront-jamais-surs-laveu-terrible-dopenai</guid>
      <description>
Selon la firme &#224; l'origine de ChatGPT, les nouveaux navigateurs propuls&#233;s par IA seraient particuli&#232;rement sensibles &#224; un type d'attaque. 
</description>
    </item>
    <item>
      <title>The next Legend of Zelda game could be inspired by Hyrule Warriors: Age of Imprisonment, producer suggests</title>
      <link>https://www.techradar.com/gaming/the-next-legend-of-zelda-game-could-be-inspired-by-hyrule-warriors-age-of-imprisonment-producer-suggests</link>
      <pubDate>Tue, 23 Dec 2025 14:08:57 +0000</pubDate>
      <guid isPermaLink="false">3xncY2tuYPwqSE6RRFD2rP</guid>
      <description>The Legend of Zelda producer, Eiji Aonuma, has teased the next entry in the series, suggesting that the game will be inspired by Hyrule Warriors: Age of Imprisonment.</description>
    </item>
    <item>
      <title>Wall Street is quiet ahead of holiday closures as markets await new U.S. economic data</title>
      <link>https://www.fastcompany.com/91465769/wall-street-is-quiet-ahead-of-holiday-closures-as-markets-await-new-u-s-economic-data</link>
      <pubDate>2025-12-23T14:07:17</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91465769/wall-street-is-quiet-ahead-of-holiday-closures-as-markets-await-new-u-s-economic-data</guid>
      <description>U.S. markets will close early on Wednesday and remain closed on Thursday for the Christmas holiday. 
Markets are flat early Tuesday in holiday-thinned trading before head of the release of new data on how the U.S. economy fared in the third quarter.Futures for the S&amp;P 500, the Dow Jones Industrial Average and Nasdaq are all essentially unchanged before the opening bell.Shares of the Danish pharmaceutical company Novo Nordisk jumped more than 7% overnight after U.S. regulators approved a pill version of the blockbuster weight-loss drug Wegovy, the first daily oral medication to treat obesity. N...</description>
    </item>
    <item>
      <title>GameStop sells cheapest 1TB SSD you can buy right now &#8212; own brand PCIe SSD costs only $90, 40% less than rivals on Amazon and Newegg</title>
      <link>https://www.techradar.com/pro/gamestop-sells-cheapest-1tb-ssd-you-can-buy-right-now-own-brand-pcie-ssd-costs-only-usd90-40-percent-less-than-rivals-on-amazon-and-newegg</link>
      <pubDate>Tue, 23 Dec 2025 14:05:00 +0000</pubDate>
      <guid isPermaLink="false">kPoVvMEepgu9dpoG6V3M69</guid>
      <description>GameStop undercuts major storage brands with a $90 1TB Gen4 NVMe SSD that includes a heatsink.</description>
    </item>
    <item>
      <title>The First &#8216;Avengers: Doomsday&#8217; Teaser Is Finally Here</title>
      <link>https://gizmodo.com/avengers-doomsday-trailer-steve-rogers-chris-evans-marvel-2000697885</link>
      <pubDate>Tue, 23 Dec 2025 14:00:06 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000697885</guid>
      <description>Chris Evans is officially back for 'Avengers: Doomsday,' and the film's first cryptic teaser shows his reason for fighting again.</description>
    </item>
    <item>
      <title>The tooth fairy just got reimagined for the tech-savvy generation</title>
      <link>https://techcrunch.com/2025/12/23/the-tooth-fairy-just-got-reimagined-for-the-tech-savvy-generation/</link>
      <pubDate>Tue, 23 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3076927</guid>
      <description>Move over, Santa. Now there&#8217;s another magical character for kids to track: the Tooth Fairy. After making a personalized Tooth Fairy video for his nephew, Oliver Finel noticed a gap. While there are plenty of Santa trackers, nothing similar existed for the Tooth Fairy. Recognizing that Generation Alpha is growing up with interactive online experiences [&#8230;]...</description>
    </item>
    <item>
      <title>What is the release date for Stranger Things season 5 part 2 on Netflix?</title>
      <link>https://www.techradar.com/streaming/netflix/what-is-the-release-date-for-stranger-things-season-5-part-2-on-netflix</link>
      <pubDate>Tue, 23 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">xgNCnybG7nsEj9Lca8DjQm</guid>
      <description>Here's when you can watch Stranger Things season 5's next three episodes on Netflix.</description>
    </item>
    <item>
      <title>Nigeria vs Tanzania Free Streams: How to watch AFCON 2025 Group C clash, TV channels, preview</title>
      <link>https://www.techradar.com/how-to-watch/football/nigeria-vs-tanzania-afcon-2025-group-c-free</link>
      <pubDate>Tue, 23 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">rCiBSUscHcqGLRLVXSSBFV</guid>
      <description>We'll show you all the ways you can watch Nigeria vs Tanzania in the 2025 AFCON from anywhere in the world.</description>
    </item>
    <item>
      <title>This AI startup is extending an olive branch between humans and machines</title>
      <link>https://www.fastcompany.com/91464353/olive-is-bill-nguyen-voice-ai-education</link>
      <pubDate>2025-12-23T14:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464353/olive-is-bill-nguyen-voice-ai-education</guid>
      <description>Bill Nguyen, a 30-year Silicon Valley serial entrepreneur, has teamed up with five college students, including his son, to build Olive, an AI startup focused on teaching language models what we mean beyond the words we use.
In the fall of 2024, six college students joined forces to start an AI company together. Five of them had met while studying computer science, computer engineering, and electrical engineering at Georgia Tech in Atlanta. The sixth, its CEO, was pursuing a degree in childhood and adolescent development at Sacramento State, with an eye on becoming a grade-school teacher. That ...</description>
    </item>
    <item>
      <title>2026 will be the year marketers rediscover the basics</title>
      <link>https://www.fastcompany.com/91464721/2026-will-be-the-year-marketers-rediscover-the-basics</link>
      <pubDate>2025-12-23T14:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464721/2026-will-be-the-year-marketers-rediscover-the-basics</guid>
      <description>Those basics will be reinvented with AI.
In December 2024, our survey with Harris Poll asked B2B marketers to share their top areas for investment in 2025. Artificial intelligence tools were at the top of the list. It also wasn&#8217;t surprising to see the AI architects named Time magazine&#8217;s Person of the Year as the ripple effects of the technology continue across every sector. And in 2026, we will see B2B decision makers do something new: return to basics andembrace AI to reimagine what&#8217;s possible....</description>
    </item>
    <item>
      <title>Clim et pompes &#224; chaleur : comment les connecter et les piloter &#224; distance pour faire des &#233;conomies ? Guide et comparatif des modules</title>
      <link>https://www.frandroid.com/produits-android/2884019_thermostat-connecte-clim-pompe-a-chaleur-intelligent</link>
      <pubDate>Tue, 23 Dec 2025 13:52:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2884019_thermostat-connecte-clim-pompe-a-chaleur-intelligent</guid>
      <description>
Qu'il fasse chaud ou froid, interagir avec sa PAC de mani&#232;re intelligente et l'int&#233;grer dans un &#233;cosyst&#232;me domotique permet non seulement de gagner en confort, mais &#233;galement de faire des &#233;conomies. Contrairement aux id&#233;es re&#231;ues, l'immense majorit&#233; des clims r&#233;versibles sont faciles &#224; connecter au Wi-Fi, sans que cela ne vous co&#251;te une fortune. Voici comment faire.
...</description>
    </item>
    <item>
      <title>Tesla continue sa d&#233;gringolade, les marques chinoises progressent vite en Europe : voici les derniers chiffres sur la voiture &#233;lectrique</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2919483_tesla-continue-sa-degringolade-les-marques-chinoises-progressent-vite-en-europe-voici-les-derniers-chiffres-sur-la-voiture-electrique</link>
      <pubDate>Tue, 23 Dec 2025 13:44:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2919483_tesla-continue-sa-degringolade-les-marques-chinoises-progressent-vite-en-europe-voici-les-derniers-chiffres-sur-la-voiture-electrique</guid>
      <description>
Les onze premiers mois de 2025 confirment l'acc&#233;l&#233;ration du basculement vers l'&#233;lectrification en Europe. Avec une part de march&#233; de 16,9 % pour les voitures &#233;lectriques et un recul spectaculaire du thermique, le secteur automobile poursuit sa transformation, m&#234;me si le chemin vers la neutralit&#233; carbone reste encore long.
</description>
    </item>
    <item>
      <title>Xiaomi est de retour avec ses &#233;couteurs sans fil en promo &#224; moins de 10 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2352522_xiaomi-est-de-retour-avec-ses-ecouteurs-sans-fil-en-promo-a-moins-de-10-euros</link>
      <pubDate>Tue, 23 Dec 2025 13:37:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2352522_xiaomi-est-de-retour-avec-ses-ecouteurs-sans-fil-en-promo-a-moins-de-10-euros</guid>
      <description>
Xiaomi propose des produits audio de qualit&#233;, avec m&#234;me des r&#233;f&#233;rences &#224; petit prix, comme les Redmi Buds 6 Play. Un mod&#232;le sans pr&#233;tention qui offre tout de m&#234;me de bonnes performances et qui co&#251;te seulement 9,99 euros sur le site officiel de la marque. 
</description>
    </item>
    <item>
      <title>Enfin un bouclier anti-ondes qui marche sur les fr&#233;quences Wi-Fi et 5G &#224; 99,97 %</title>
      <link>https://www.frandroid.com/telecom/2919521_enfin-un-bouclier-anti-ondes-qui-marche-sur-les-frequences-wi-fi-et-5g-a-9997</link>
      <pubDate>Tue, 23 Dec 2025 13:32:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2919521_enfin-un-bouclier-anti-ondes-qui-marche-sur-les-frequences-wi-fi-et-5g-a-9997</guid>
      <description>
Vous voyez ces autocollants &#171; anti-ondes &#187; vendus une fortune sur Internet qui ne servent strictement &#224; rien ? C'est ironique, car la science vient de produire l'exact oppos&#233;. Des chercheurs ont mis au point un film transparent capable de bloquer 99,97 % des rayonnements. Sauf que lui, il repose sur de la vraie physique, pas sur de la magie quantique.
...</description>
    </item>
    <item>
      <title>Apple's iOS 26.3 will introduce proximity pairing to third-party devices in the EU</title>
      <link>https://www.engadget.com/mobile/apples-ios-263-will-introduce-proximity-pairing-to-third-party-devices-in-the-eu-133037696.html?src=rss</link>
      <pubDate>Tue, 23 Dec 2025 13:30:37 +0000</pubDate>
      <guid isPermaLink="false">2aae1a62-b390-4355-a79a-87e2749999c1</guid>
      <description>Apple is making it a little easier to use third-party devices with iPhones in order to comply with Europe's Digital Market Act (DMA), MacRumors reported. For iOS 26.3, Apple's devices will support third-party proximity pairing and notifications in Europe only, according to the latest beta notes. That will make it a bit easier to connect devices like Sony headphones or receive notifications from an iPhone on Wear OS smartwatches &#8212; provided manufacturers support the new feature.&#160;
"The DMA creates new opportunities for developers to bring to market innovative products and services in Europe," an ...</description>
    </item>
    <item>
      <title>How AI broke the smart home in 2025</title>
      <link>https://www.theverge.com/tech/845958/ai-smart-home-broken</link>
      <pubDate>2025-12-23T08:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=845958</guid>
      <description>This morning, I asked my Alexa-enabled Bosch coffee machine to make me a coffee. Instead of running my routine, it told me it couldn't do that. Ever since I upgraded to Alexa Plus, Amazon's generative-AI-powered voice assistant, it has failed to reliably run my coffee routine, coming up with a different excuse almost every time [&#8230;]</description>
    </item>
  </channel>
</rss>
