<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 11 Jan 2026 18:34:57 GMT</lastBuildDate>
    <item>
      <title>Cette &#233;l&#233;gante cam&#233;ra int&#233;rieure filme en 2K 130&#176; &#224; 30 FPS surveille votre logement avec une ristourne de 30&#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2935367_cette-elegante-camera-interieure-filme-en-2k-130-a-30-fps-surveille-votre-logement-avec-une-ristourne-de-30e</link>
      <pubDate>Sun, 11 Jan 2026 18:25:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2935367_cette-elegante-camera-interieure-filme-en-2k-130-a-30-fps-surveille-votre-logement-avec-une-ristourne-de-30e</guid>
      <description>
Avec la Netatmo Advance 2K, vous avez une cam&#233;ra compacte qui filme en 2K avec un angle de vue de 130&#176;. Elle a &#233;t&#233; lanc&#233;e il y a un an et elle baisse enfin son prix avec les soldes d&#8217;hiver 2026. Chez Boulanger, on la trouve avec 30 euros de remise.
</description>
    </item>
    <item>
      <title>Test de l&#8217;Asus ROG Azoth X : sa frappe m&#8217;a fait changer d&#8217;avis</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/peripheriques-pc/clavier/2938529_test-asus-rog-azoth-x</link>
      <pubDate>Sun, 11 Jan 2026 18:10:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/peripheriques-pc/clavier/2938529_test-asus-rog-azoth-x</guid>
      <description>
Asus prouve qu'il n'y a plus besoin de passer ses week-ends &#224; lubrifier des ressorts pour obtenir la frappe parfaite, il suffit juste d'avoir le courage de d&#233;penser 300 euros.
</description>
    </item>
    <item>
      <title>I tested the Insta360 Link 2 pan-and-track webcam - and it's helped me deliver far more engaging online training</title>
      <link>https://www.techradar.com/computing/insta360-link-2-webcam-review</link>
      <pubDate>Sun, 11 Jan 2026 18:10:00 +0000</pubDate>
      <guid isPermaLink="false">74RYUD9m6eetbk3sjNKW3X</guid>
      <description>The Insta360 Link 2 is essentially an evolved webcam, and features an AI-powered 4K camera with a physical gimbal and advanced modes such as DeskView, whiteboard mode, and gesture control that make it a perfect partner for anyone looking to livestream, hold online lectures, or engage in more advanced video conferencing.</description>
    </item>
    <item>
      <title>Wing's drone deliveries are coming to 150 more Walmarts</title>
      <link>https://www.engadget.com/transportation/wings-drone-deliveries-are-coming-to-150-more-walmarts-180708189.html?src=rss</link>
      <pubDate>Sun, 11 Jan 2026 18:07:09 +0000</pubDate>
      <guid isPermaLink="false">4685fe17-d2b9-4d33-93b9-ad36bbc72699</guid>
      <description>Don't be surprised if you see even more drones delivering groceries across the US since the Alphabet-owned Wing announced another service expansion with Walmart over the next year. The partnership said that drone delivery services will be available at 150 more Walmart locations in Los Angeles, St. Louis, Cincinnati, Miami and more metros that have yet to be announced.
According to Wing, its top 25 percent of customers have ordered its delivery drones up to three times a week. To meet growing demand, Wing and Walmart said it will serve up to 40 million US customers and build up a network of 270...</description>
    </item>
    <item>
      <title>Quel smartphone photo choisir en 2026 ? Nos tests et recommandations</title>
      <link>https://www.frandroid.com/guide-dachat/smartphones/367607_meilleurs-smartphones-photos</link>
      <pubDate>Sun, 11 Jan 2026 18:00:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/smartphones/367607_meilleurs-smartphones-photos</guid>
      <description>
L'appareil photo est souvent un point majeur lorsqu&#8217;il s&#8217;agit de choisir un nouveau t&#233;l&#233;phone. Lors de nos tests, c'est un domaine que nous scrutons pr&#233;cis&#233;ment. Voici notre s&#233;lection des meilleurs smartphones photo du march&#233;.
</description>
    </item>
    <item>
      <title>The Night Manager season 2: release schedule, trailer, cast, plot, and what else we know</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/the-night-manager-season-2-release-schedule-trailer-cast-plot-and-what-else-we-know</link>
      <pubDate>Sun, 11 Jan 2026 18:00:00 +0000</pubDate>
      <guid isPermaLink="false">uTHhTaCwKWmXgrvvEZHKDB</guid>
      <description>The Night Manager returns to our screens after nearly a decade. Here's what you need to know about season 2.</description>
    </item>
    <item>
      <title>Google removes AI Overviews for certain medical queries</title>
      <link>https://techcrunch.com/2026/01/11/google-removes-ai-overviews-for-certain-medical-queries/</link>
      <pubDate>Sun, 11 Jan 2026 17:56:41 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3081746</guid>
      <description>This follows an investigation by the Guardian that found Google AI Overviews offering misleading information in response to some health-related queries.</description>
    </item>
    <item>
      <title>Hypertrucages sexualis&#233;s | Le gouvernement f&#233;d&#233;ral n&#8217;envisage pas de bannir la plateforme X</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-01-11/hypertrucages-sexualises/le-gouvernement-federal-n-envisage-pas-de-bannir-la-plateforme-x.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Sun, 11 Jan 2026 12:46:57 -0500</pubDate>
      <guid isPermaLink="false">5bfbff9220c7315c862649379c716da8</guid>
      <description>Le gouvernement f&#233;d&#233;ral n&#8217;envisage pas de bannir la plateforme X, a indiqu&#233; le ministre de l&#8217;Intelligence artificielle et l&#8217;Innovation num&#233;rique, Evan Solomon.</description>
    </item>
    <item>
      <title>Test de l&#8217;Eureka FloorShine 880 : puissant, chaud, mais bavard</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/2925637_test-de-leureka-floorshine-880-puissant-chaud-mais-bavard</link>
      <pubDate>Sun, 11 Jan 2026 17:39:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/2925637_test-de-leureka-floorshine-880-puissant-chaud-mais-bavard</guid>
      <description>
Tineco et Dreame se partagent le g&#226;teau des balais laveurs, mais Eureka d&#233;barque avec les coudes sortis. Son arme ? Une fiche technique qui ne respecte rien : 24 000 Pa d'aspiration et une st&#233;rilisation thermique radicale.
</description>
    </item>
    <item>
      <title>Games Workshop&#8217;s Warhammer World Hits the U.S. Next Year</title>
      <link>https://gizmodo.com/games-workshops-warhammer-world-hits-the-u-s-next-year-2000708676</link>
      <pubDate>Sun, 11 Jan 2026 17:30:29 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000708676</guid>
      <description>North American fans of 'Warhammer' can rejoice at getting a Warhammer World of their own to visit sometime at the end of 2027.</description>
    </item>
    <item>
      <title>SpaceX just got approval to launch another 7,500 next-gen Starlink satellites into orbit</title>
      <link>https://www.techradar.com/computing/internet/spacex-just-got-approval-to-launch-another-7-500-next-gen-starlink-satellites-into-orbit</link>
      <pubDate>Sun, 11 Jan 2026 17:30:00 +0000</pubDate>
      <guid isPermaLink="false">shsSKVwbwueXkETR7kzqxB</guid>
      <description>Starlink will have 15,000 Gen2 satellites in space within the next five years, after a regulatory decision.</description>
    </item>
    <item>
      <title>Indonesia and Malaysia block Grok access, UK threatens ban as explicit deepfake problem grows</title>
      <link>https://mashable.com/article/grok-blocked-indonesia-elon-musk</link>
      <pubDate>Sun, 11 Jan 2026 17:27:15 +0000</pubDate>
      <guid isPermaLink="false">0451F4zT8Q561IEQk4z6Gir</guid>
      <description>Foreign governments are now limiting access to Elon Musk's Grok chatbot as concerns about non-consensual sexual deepfakes linger.</description>
    </item>
    <item>
      <title>Instagram says it fixed the issue that let someone send all those password reset emails</title>
      <link>https://www.theverge.com/news/860337/instagram-fixed-password-reset-emails</link>
      <pubDate>2026-01-11T12:26:38-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=860337</guid>
      <description>If you're one of the many, many people who received a password reset email from Instagram the other day, the company says it fixed the issue. What was the issue? Unclear. We reached out to Meta for clarification and have yet to receive a response. All we know is that an "external party" triggered the [&#8230;]</description>
    </item>
    <item>
      <title>Micron announces a QLC SSD just weeks after killing its beloved Crucial brand &#8212; the 3610 is a basic Gen5 SSD that's somehow faster than Gen4 TLC</title>
      <link>https://www.techradar.com/pro/micron-just-announced-a-qlc-ssd-just-weeks-after-killing-its-beloved-crucial-brand-the-3610-is-a-basic-gen5-ssd-thats-somehow-faster-than-gen4-tlc</link>
      <pubDate>Sun, 11 Jan 2026 17:20:00 +0000</pubDate>
      <guid isPermaLink="false">5e2ePRrgYqxnuKrKGU2h7j</guid>
      <description>Micron 3610 PCIe Gen5 NVMe SSD offers high-speed QLC storage, low latency, AI readiness, compact form, and strong endurance.</description>
    </item>
    <item>
      <title>Et si la mati&#232;re noire &#233;tait responsable de ces ph&#233;nom&#232;nes &#233;tranges au centre de notre galaxie ?</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-si-matiere-noire-etait-responsable-ces-phenomenes-etranges-centre-notre-galaxie-w2t8-129952/#xtor%3DRSS-8</link>
      <pubDate>Sun, 11 Jan 2026 18:00:00 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-si-matiere-noire-etait-responsable-ces-phenomenes-etranges-centre-notre-galaxie-w2t8-129952/#xtor%3DRSS-8</guid>
      <description>Les particules de mati&#232;re noire restent &#233;lusives. Mais, si elles existent vraiment, on a peut-&#234;tre une preuve de leur pr&#233;sence au c&#339;ur&#160;de la Voie lact&#233;e, en supposant qu'il s'agisse de particules plus l&#233;g&#232;res que celles&#160;g&#233;n&#233;ralement consid&#233;r&#233;es et que l'on appelle des Wimps. En se d&#233;sint&#233;grant,...</description>
    </item>
    <item>
      <title>OPPO Find X9 Pro vs Samsung Galaxy S25 Ultra&#160;: comment choisir le meilleur t&#233;l&#233;phone premium&#160;?</title>
      <link>https://www.frandroid.com/versus/2896771_oppo-find-x9-pro-vs-samsung-galaxy-s25-ultra-comment-choisir-le-meilleur-telephone-premium</link>
      <pubDate>Sun, 11 Jan 2026 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/versus/2896771_oppo-find-x9-pro-vs-samsung-galaxy-s25-ultra-comment-choisir-le-meilleur-telephone-premium</guid>
      <description>
Si OPPO a un peu perdu de son lustre au fil des ans, Samsung est toujours leader du march&#233;. Le r&#233;cent Find X9 Pro peut-il vraiment rivaliser avec le nec plus ultra de Samsung&#160;? R&#233;ponse dans ce nouveau comparatif&#160;!
</description>
    </item>
    <item>
      <title>GameStop is kicking off 2026 by shutting down over 400 stores in 42 states</title>
      <link>https://www.theverge.com/news/860329/gamestop-is-kicking-off-2026-by-shutting-down-over-400-stores-in-42-states</link>
      <pubDate>2026-01-11T11:57:50-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=860329</guid>
      <description>GameStop CEO Ryan Cohen is in line to potentially earn $35 billion in stock options, so long as the company hits a $100 billion market cap. One way to hit that target is by cutting costs, and one way of cutting costs is to close down a bunch of stores. The company closed 590 stores [&#8230;]</description>
    </item>
  </channel>
</rss>
