<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 05 Feb 2026 08:51:29 GMT</lastBuildDate>
    <item>
      <title>Google Home supporte enfin les boutons programmables</title>
      <link>https://www.frandroid.com/marques/google/2966901_google-home-supporte-enfin-les-boutons-programmables</link>
      <pubDate>Thu, 05 Feb 2026 08:45:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2966901_google-home-supporte-enfin-les-boutons-programmables</guid>
      <description>
Google d&#233;ploie une mise &#224; jour de son application Home qui introduit la prise en charge de boutons programmables comme d&#233;clencheurs d&#8217;automatisations.
</description>
    </item>
    <item>
      <title>Garmin d&#233;gaine un nouveau radar v&#233;lo avec un feu ultra puissant visible jusqu&#8217;&#224; 2 km</title>
      <link>https://www.frandroid.com/marques/garmin/2966871_garmin-degaine-un-nouveau-radar-velo-avec-un-feu-ultra-puissant-visible-jusqua-2-km</link>
      <pubDate>Thu, 05 Feb 2026 08:38:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/garmin/2966871_garmin-degaine-un-nouveau-radar-velo-avec-un-feu-ultra-puissant-visible-jusqua-2-km</guid>
      <description>
Garmin ajoute &#224; sa gamme d&#8217;accessoires pour cyclistes le Varia RearVue 820, un feu arri&#232;re radar plus pr&#233;cis et personnalisable.
</description>
    </item>
    <item>
      <title>Cyberattaque contre Apple Pay&#160;: m&#233;fiez-vous des mails envoy&#233;s par Apple, une campagne de phishing est en cours</title>
      <link>https://www.01net.com/actualites/cyberattaque-contre-apple-pay-mails-apple-phishing-cours.html</link>
      <pubDate>Thu, 05 Feb 2026 08:30:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324266</guid>
      <description>Une campagne phishing &#224; l'encontre des utilisateurs d'Apple Pay est en cours. Pour pi&#233;ger les usagers, les pirates envoient de fausses alertes &#233;voquant une transaction suspecte ou un paiement bloqu&#233;. Ces messages sont tr&#232;s convaincants. Ils comportent m&#234;me un num&#233;ro de dossier d'assistance.</description>
    </item>
    <item>
      <title>Yahoo Mail met fin au stockage quasi-illimit&#233; : les usagers passent de 1 To &#224; 15 Go</title>
      <link>https://www.frandroid.com/culture-tech/web/2966129_yahoo-mail-met-fin-au-stockage-quasi-illimite-les-usagers-passent-de-1-to-a-15-go</link>
      <pubDate>Thu, 05 Feb 2026 08:25:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/web/2966129_yahoo-mail-met-fin-au-stockage-quasi-illimite-les-usagers-passent-de-1-to-a-15-go</guid>
      <description>
Yahoo Mail, r&#233;put&#233; pour sa g&#233;n&#233;rosit&#233; en mati&#232;re de stockage, a d&#233;cid&#233; de drastiquement r&#233;duire l'espace offert gratuitement &#224; ses membres. Une d&#233;cision radicale qui r&#233;duit la fracture avec la  concurrence, mais qui risque surtout de bloquer de nombreuses bo&#238;tes de r&#233;ception.
</description>
    </item>
    <item>
      <title>La Chine veut des poign&#233;es de portes m&#233;caniques sur les voitures &#233;lectriques</title>
      <link>https://www.01net.com/actualites/la-chine-veut-des-poignees-de-portes-mecaniques-sur-les-voitures-electriques.html</link>
      <pubDate>Thu, 05 Feb 2026 08:01:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324235</guid>
      <description>&#192; compter du 1er janvier prochain, les nouvelles voitures &#233;lectriques et hybrides vendues en Chine devront &#234;tre &#233;quip&#233;es de poign&#233;es de portes m&#233;caniques. Une disposition qui, au vu de l'&#233;norme march&#233; chinois, pourrait bien s'appliquer de facto partout dans le monde.</description>
    </item>
    <item>
      <title>The best cameras for 2026</title>
      <link>https://www.engadget.com/cameras/best-cameras-151524327.html?src=rss</link>
      <pubDate>Thu, 05 Feb 2026 08:00:35 +0000</pubDate>
      <guid isPermaLink="false">3684c1ae-7145-4dc2-9d88-30dfdfedada2</guid>
      <description>Cameras had an interesting year in 2025, with the launch of some long-delayed models like Sony&#8217;s 61MP RX1III, wholly original cameras (the Fujifilm X Half and Sigma BF) and much anticipated updates like the Sony A7 V and Canon R6 III. All told, there were 27 new cameras launched last year that joined the 20 new models on the market from 2024.Those ranged from compacts to mirrorless to very high-end models, with every price range included. The question is, which one is right for the type of videography or photography you do? Whether you&#8217;re an aspiring action or wildlife photographer, an extreme...</description>
    </item>
    <item>
      <title>Google Gemini d&#233;passe les 750 millions d&#8217;utilisateurs mensuels</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2966823_google-gemini-depasse-les-750-millions-dutilisateurs-mensuels</link>
      <pubDate>Thu, 05 Feb 2026 07:41:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2966823_google-gemini-depasse-les-750-millions-dutilisateurs-mensuels</guid>
      <description>
Selon Alphabet, l&#8217;application Gemini a franchi le cap des 750 millions d&#8217;utilisateurs actifs mensuels, port&#233;e par le lancement du mod&#232;le Gemini 3 et par une nouvelle offre payante Google AI Plus destin&#233;e au grand public.
</description>
    </item>
    <item>
      <title>Spotify peut maintenant traduire vos chansons pr&#233;f&#233;r&#233;es</title>
      <link>https://www.01net.com/actualites/spotify-peut-maintenant-traduire-vos-chansons-preferees.html</link>
      <pubDate>Thu, 05 Feb 2026 07:38:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324260</guid>
      <description>La plate-forme de musique en streaming vient d&#8217;annoncer le d&#233;ploiement de trois nouveaut&#233;s pour sa fonction d&#8217;affichage des paroles. Tous les utilisateurs, gratuits et payants, vont pouvoir en profiter.</description>
    </item>
    <item>
      <title>Ce robot aspirateur-laveur Dreame, avec sa base 8-en-1 encastrable, est &#224; moiti&#233; prix</title>
      <link>https://www.frandroid.com/bons-plans/2966171_ce-robot-aspirateur-laveur-dreame-avec-sa-base-8-en-1-encastrable-est-a-moitie-prix</link>
      <pubDate>Thu, 05 Feb 2026 07:36:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2966171_ce-robot-aspirateur-laveur-dreame-avec-sa-base-8-en-1-encastrable-est-a-moitie-prix</guid>
      <description>
Le Dreame X50 Master est un concentr&#233; de puissance et de technologies qui lui permettent de faire le m&#233;nage sur tous les sols de la maison. Il est en plus livr&#233; avec une base ultra-polyvalente qui facilite clairement son entretien. Actuellement, vous trouverez le tout &#224; 849 euros au lieu de 1 699 euros chez plusieurs e-commer&#231;ants. 
</description>
    </item>
    <item>
      <title>Canal+ d&#233;voile une mise &#224; jour majeure de son application avec un guide TV unifi&#233;</title>
      <link>https://www.frandroid.com/android/applications/2966803_canal-devoile-une-mise-a-jour-majeure-de-son-application-avec-un-guide-tv-unifie</link>
      <pubDate>Thu, 05 Feb 2026 07:29:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/applications/2966803_canal-devoile-une-mise-a-jour-majeure-de-son-application-avec-un-guide-tv-unifie</guid>
      <description>
Canal+ s'appr&#234;te &#224; lancer mi-f&#233;vrier 2026 une nouvelle fonctionnalit&#233; pour son application : un programme TV centralis&#233; qui rassemble toutes les cha&#238;nes en direct dans un espace unifi&#233;.
</description>
    </item>
    <item>
      <title>Des satellites russes soup&#231;onn&#233;s d&#8217;espionner les r&#233;seaux spatiaux europ&#233;ens</title>
      <link>https://www.01net.com/actualites/des-satellites-russes-soupconnes-despionner-les-reseaux-spatiaux-europeens.html</link>
      <pubDate>Thu, 05 Feb 2026 07:29:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324237</guid>
      <description>La Russie a ajout&#233; une arme nouvelle et redoutable dans sa &#171; guerre hybride &#187; men&#233;e contre l'Europe : l'espionnage spatial. Deux satellites russes ont intercept&#233; les communications d'au moins une dizaine de satellites europ&#233;ens en orbite g&#233;ostationnaire ces derni&#232;res ann&#233;es. De quoi collecter des donn&#233;es pour provoquer, &#224; terme, des interf&#233;rences cibl&#233;es, des prises de contr&#244;le &#224; distance, voire la mise hors service d&#8217;infrastructures spatiales essentielles....</description>
    </item>
    <item>
      <title>NFC, ultra puissant et bien pratique : le nouveau longtail &#233;lectrique Tarran L1 a de quoi faire des &#233;mules</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2965835_nfc-ultra-puissant-et-bien-pratique-le-nouveau-longtail-electrique-tarran-l1-a-de-quoi-faire-des-emules</link>
      <pubDate>Thu, 05 Feb 2026 07:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2965835_nfc-ultra-puissant-et-bien-pratique-le-nouveau-longtail-electrique-tarran-l1-a-de-quoi-faire-des-emules</guid>
      <description>
Apr&#232;s un T1 Pro aussi technologique que cher, le Tarran L1 sera le second mod&#232;le plus abordable de la marque chinoise chez les v&#233;los longtails &#233;lectriques, et proposera des &#233;l&#233;ments in&#233;dits dans sa cat&#233;gorie.
</description>
    </item>
    <item>
      <title>YouTube&#160;: ces 2 nouveaut&#233;s vont enfin vous faire oublier les sous-titres</title>
      <link>https://www.01net.com/actualites/youtube-nouveautes-vont-enfin-faire-oublier-sous-titres.html</link>
      <pubDate>Thu, 05 Feb 2026 07:08:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324249</guid>
      <description>YouTube lance une &#233;norme mise &#224; jour de sa fonction de traduction automatique qui prend maintenant en charge encore plus de langues, la synchronisation des l&#232;vres, et une technologie capable de conserver le ton original du cr&#233;ateur de la vid&#233;o.</description>
    </item>
    <item>
      <title>Google Pixel 10a, c&#8217;est officiel&#160;: les pr&#233;commandes commencent d&#232;s le 18 f&#233;vrier</title>
      <link>https://www.frandroid.com/marques/google/2966779_google-pixel-10a-cest-officiel-les-precommandes-commencent-des-le-18-fevrier</link>
      <pubDate>Thu, 05 Feb 2026 07:03:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2966779_google-pixel-10a-cest-officiel-les-precommandes-commencent-des-le-18-fevrier</guid>
      <description>
Le g&#233;ant am&#233;ricain Google a officialis&#233; l'existence de son nouveau smartphone milieu de gamme, le Pixel 10a, et, par la m&#234;me occasion, a d&#233;voil&#233; le fait que les pr&#233;commandes d&#233;buteront le 18 f&#233;vrier.
</description>
    </item>
    <item>
      <title>Steam Machine&#160;: la date de lancement est officiellement report&#233;e, Valve ne donne toujours pas de prix</title>
      <link>https://www.01net.com/actualites/valve-reporte-le-lancement-de-la-steam-machine-et-ne-donne-toujours-pas-de-prix.html</link>
      <pubDate>Thu, 05 Feb 2026 07:01:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324243</guid>
      <description>En fin d'ann&#233;e derni&#232;re, Valve pr&#233;sentait la Steam Machine, une console de salon qui marche dans les pas du Steam Deck mais bien s&#251;r en version s&#233;dentaire. Depuis, tout le monde attendait avec impatience d'en savoir plus, &#224; commencer par le prix de la b&#234;te et la date de lancement. Le constructeur a fini par donner de plus amples informations&#8230; mais pas celles que les joueurs esp&#233;raient !...</description>
    </item>
  </channel>
</rss>
