<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 22 Dec 2025 08:36:08 GMT</lastBuildDate>
    <item>
      <title>Fin du Steam Deck LCD : la console ne sera plus produite, sans doute victime de la p&#233;nurie de RAM</title>
      <link>https://www.frandroid.com/marques/valve/2917715_fin-du-steam-deck-lcd-la-console-ne-sera-plus-produite-sans-doute-victime-de-la-penurie-de-ram</link>
      <pubDate>Mon, 22 Dec 2025 08:18:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/valve/2917715_fin-du-steam-deck-lcd-la-console-ne-sera-plus-produite-sans-doute-victime-de-la-penurie-de-ram</guid>
      <description>
Clap de fin pour le Steam Deck LCD, premi&#232;re version de la console de Valve. 
</description>
    </item>
    <item>
      <title>Spotify se fait voler 300 To musique d&#233;sormais t&#233;l&#233;chargeable en Torrent</title>
      <link>https://www.01net.com/actualites/spotify-voler-300-to-musique-telechargeable-torrent-archives-anna.html</link>
      <pubDate>Mon, 22 Dec 2025 08:00:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316455</guid>
      <description>Les titres les plus populaires de la biblioth&#232;que musicale de Spotify ont &#233;t&#233; extraits et peuvent &#234;tre t&#233;l&#233;charg&#233;s (ill&#233;galement) en torrent.</description>
    </item>
    <item>
      <title>Panique &#224; San Francisco&#160;: une panne d&#8217;&#233;lectricit&#233; fait planter les voitures autonomes</title>
      <link>https://www.01net.com/actualites/panique-a-san-francisco-une-panne-delectricite-fait-planter-les-voitures-autonomes.html</link>
      <pubDate>Mon, 22 Dec 2025 07:46:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316447</guid>
      <description>Des dizaines de voitures autonomes Waymo &#224; l&#8217;arr&#234;t. Des bouchons de plusieurs kilom&#232;tres et une panne d&#8217;&#233;lectricit&#233; qui montre les limites d&#8217;une technologie.</description>
    </item>
    <item>
      <title>Desktop power in a semi portable frame? I tested the Dell Pro Max 18 Plus and it's a tank you can take to a coffee shop</title>
      <link>https://www.techradar.com/pro/dell-pro-max-18-plus-mobile-workstation-review</link>
      <pubDate>Mon, 22 Dec 2025 07:45:00 +0000</pubDate>
      <guid isPermaLink="false">PQatNN9ZLeb373PvhNDhya</guid>
      <description>The Dell Pro Max 18 Plus is a massive 18-inch portable workstation with more power than most would even know what to do with. It&#8217;s the developer&#8217;s dream machine, the coder's crutch, and the engineer's engine</description>
    </item>
    <item>
      <title>&#171;&#160;Les Am&#233;ricains cr&#233;ent des univers, l&#8217;Europe vend des solutions&#160;&#187;, le patron du Campus Cyber a un plan pour la cybers&#233;curit&#233; fran&#231;aise</title>
      <link>https://www.01net.com/actualites/les-americains-creent-des-univers-leurope-vend-des-solutions-le-patron-du-campus-cyber-a-un-plan-pour-la-cybersecurite-francaise.html</link>
      <pubDate>Mon, 22 Dec 2025 07:31:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311720</guid>
      <description>Le pr&#233;sident du Campus Cyber revient pour 01net.com sur ses premiers mois au gouvernail du Campus Cyber, une structure qui regroupe les acteurs priv&#233;s et publics de la cybers&#233;curit&#233;.</description>
    </item>
    <item>
      <title>Pour No&#235;l, le Pixel 9a et la JBL Go 4 s&#8217;offrent 150 &#8364; de remise chez Carrefour</title>
      <link>https://www.frandroid.com/bons-plans/2917003_pour-noel-le-pixel-9a-et-la-jbl-go-4-soffrent-150-e-de-remise-chez-carrefour</link>
      <pubDate>Mon, 22 Dec 2025 07:29:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2917003_pour-noel-le-pixel-9a-et-la-jbl-go-4-soffrent-150-e-de-remise-chez-carrefour</guid>
      <description>
Entre un smartphone avec un superbe &#233;cran OLED et une petite enceinte connect&#233;e qui d&#233;livre un tr&#232;s bon son, ce pack compos&#233; du Pixel 9a et de la JBL Go 4 est une tr&#232;s bonne id&#233;e cadeau &#224; mettre au pied du sapin. Chez Carrefour, il est disponible &#224; 399,99 euros au lieu de 549,99 euros. 
</description>
    </item>
    <item>
      <title>LG Display fait la diff&#233;rence entre les TV et les moniteurs avec les appellations Tandem WOLED et Tandem OLED</title>
      <link>https://www.frandroid.com/marques/lg/2917695_lg-display-fait-la-difference-entre-les-tv-et-les-moniteurs-avec-les-appellations-tandem-woled-et-tandem-oled</link>
      <pubDate>Mon, 22 Dec 2025 07:27:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lg/2917695_lg-display-fait-la-difference-entre-les-tv-et-les-moniteurs-avec-les-appellations-tandem-woled-et-tandem-oled</guid>
      <description>
&#192; quelques semaines du CES 2026, LG Display annonce un changement important dans la d&#233;nomination de ses technologies d'&#233;crans OLED. En effet, pour plus de clart&#233;, le fabricant sud-cor&#233;en divise d&#233;sormais son offre en deux cat&#233;gories distinctes : Tandem WOLED pour les grands &#233;crans et Tandem OLED pour les formats plus compacts.
</description>
    </item>
    <item>
      <title>POCO F7 vs Samsung Galaxy A56 : comment choisir le meilleur smartphone&#160;milieu de gamme ?</title>
      <link>https://www.frandroid.com/versus/2755475_poco-f7-vs-samsung-galaxy-a56-comment-choisir-le-meilleur-smartphone-milieu-de-gamme</link>
      <pubDate>Mon, 22 Dec 2025 07:19:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/versus/2755475_poco-f7-vs-samsung-galaxy-a56-comment-choisir-le-meilleur-smartphone-milieu-de-gamme</guid>
      <description>
Les POCO sont des smartphones reconnus pour leur excellent rapport qualit&#233;-prix, et le F7 ici pr&#233;sent tire son &#233;pingle du jeu c&#244;t&#233; performances. Peut-il rivaliser avec le best-seller de Samsung&#160;?
</description>
    </item>
    <item>
      <title>Clair Obscur: Expedition 33 stripped of Indie Game Awards due to generative AI use</title>
      <link>https://mashable.com/article/clair-obscur-expedition-33-indie-game-awards-revoked-ai</link>
      <pubDate>Mon, 22 Dec 2025 07:18:54 +0000</pubDate>
      <guid isPermaLink="false">00virHjOR7VtypiA95ItE3Z</guid>
      <description>The Indie Game Awards has revoked 'Clair Obscur: Expedition 33's Game of the Year and Debut Game awards, citing its use of generative AI.</description>
    </item>
    <item>
      <title>Tech is not the sexy job it used to be</title>
      <link>https://www.fastcompany.com/91463012/tech-is-not-the-sexy-job-it-used-to-be</link>
      <pubDate>2025-12-22T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463012/tech-is-not-the-sexy-job-it-used-to-be</guid>
      <description>Annual layoffs, the AI threat, the disappearing entry-level position: The Big Tech jobs that were once hailed as stable&#8212;and desirable&#8212;may no longer be a sure bet for workers.
In November, Apple laid off dozens of sales employees in a rather unexpected move for the tech giant. Apple is the rare tech company that has steered clear of mass layoffs, particularly among its peers in the trillion-dollar club. The layoffs &#8220;came as a surprise&#8221; for those who lost their jobs, according to a Bloomberg report&#8212;and they impacted some employees who had been with the company for decades.&#160;...</description>
    </item>
    <item>
      <title>Voici les meilleurs &#233;couteurs sans fil de l&#8217;ann&#233;e &#8211; Frandroid Awards 2025</title>
      <link>https://www.frandroid.com/produits-android/audio/ecouteurs-true-wireless/2900313_voici-les-meilleurs-ecouteurs-sans-fil-de-lannee-frandroid-awards-2025</link>
      <pubDate>Mon, 22 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/audio/ecouteurs-true-wireless/2900313_voici-les-meilleurs-ecouteurs-sans-fil-de-lannee-frandroid-awards-2025</guid>
      <description>
Les meilleurs &#233;couteurs sans fil test&#233;s par Frandroid sont les AirPods Pro 3 d'Apple. D&#233;couvrez pourquoi ce produit a re&#231;u le Frandroid Awards avec Delos de sa cat&#233;gorie.
</description>
    </item>
    <item>
      <title>La date de lancement et le design du Xiaomi 17 Ultra d&#233;voil&#233;s</title>
      <link>https://www.frandroid.com/actualites-generales/2917679_la-date-de-lancement-et-le-design-du-xiaomi-17-ultra-devoiles</link>
      <pubDate>Mon, 22 Dec 2025 06:53:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2917679_la-date-de-lancement-et-le-design-du-xiaomi-17-ultra-devoiles</guid>
      <description>
Annonc&#233; depuis plusieurs semaines par la marque, le Xiaomi 17 Ultra a d&#233;sormais une date de pr&#233;sentation officielle en Chine : le smartphone sera d&#233;voil&#233; le 25 d&#233;cembre 2025, avec un bloc photo d&#233;velopp&#233; avec Leica et une nouvelle finition verte dite Starry Green.
</description>
    </item>
  </channel>
</rss>
