<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 18 Feb 2026 08:53:01 GMT</lastBuildDate>
    <item>
      <title>VanMoof : pourquoi la fin de la 2G pourrait impacter votre v&#233;lo &#233;lectrique</title>
      <link>https://www.frandroid.com/marques/vanmoof/2980529_vanmoof-pourquoi-la-fin-de-la-2g-pourrait-impacter-votre-velo-electrique</link>
      <pubDate>Wed, 18 Feb 2026 08:49:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/vanmoof/2980529_vanmoof-pourquoi-la-fin-de-la-2g-pourrait-impacter-votre-velo-electrique</guid>
      <description>
Reposant sur le r&#233;seau 2G, le suivi des vols des VanMoof S3 et X3 ne fonctionnera plus apr&#232;s la fin du r&#233;seau 2G. La marque propose une solution pour conserver cette fonction, mais ladite solution s'annonce payante.
</description>
    </item>
    <item>
      <title>Fresh &#8216;n Rebel Pearls, &#231;a ressemble &#224; des &#233;couteurs mais &#231;a n&#8217;en est pas</title>
      <link>https://www.frandroid.com/actualites-generales/2980997_fresh-n-rebel-pearls-ca-ressemble-a-des-ecouteurs-mais-ca-nen-est-pas</link>
      <pubDate>Wed, 18 Feb 2026 08:33:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2980997_fresh-n-rebel-pearls-ca-ressemble-a-des-ecouteurs-mais-ca-nen-est-pas</guid>
      <description>
La marque Fresh 'n Rebel vient d&#8217;annoncer la commercialisation d&#8217;un nouveau dispositif permettant de prot&#233;ger l'audition lors d'&#233;v&#233;nements musicaux. Baptis&#233;s Pearls, il s&#8217;agit de bouchons d'oreilles combinant optimisation acoustique et design distinctif.
</description>
    </item>
    <item>
      <title>Cette souris sans-fil et ultra-l&#233;g&#232;re de chez Logitech perd presque 40 % de son prix sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2980201_cette-souris-sans-fil-et-ultra-legere-de-chez-logitech-perd-presque-40-de-son-prix-sur-amazon</link>
      <pubDate>Wed, 18 Feb 2026 08:33:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2980201_cette-souris-sans-fil-et-ultra-legere-de-chez-logitech-perd-presque-40-de-son-prix-sur-amazon</guid>
      <description>
Avec la Logitech G Pro X Superlight 2, vous pourrez profiter d'une souris gamer qui m&#234;le l&#233;g&#232;ret&#233; et pr&#233;cision pour 104,99 euros au lieu de 169,99 euros sur Amazon.
</description>
    </item>
    <item>
      <title>Nouveaux emojis, barre des t&#226;ches am&#233;lior&#233;es, optimisation syst&#232;me&#160;: Windows&#160;11 pr&#233;pare quelques petites am&#233;liorations bienvenues</title>
      <link>https://www.frandroid.com/os/windows/2980991_nouveaux-emojis-barre-des-taches-ameliorees-optimisation-systeme-windows-11-prepare-quelques-petites-ameliorations-bienvenues</link>
      <pubDate>Wed, 18 Feb 2026 08:29:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/windows/2980991_nouveaux-emojis-barre-des-taches-ameliorees-optimisation-systeme-windows-11-prepare-quelques-petites-ameliorations-bienvenues</guid>
      <description>
Tenue par une politique d&#8217;&#171; innovation continuelle &#187;, Microsoft pr&#233;pare une grosse mise &#224; jour pour son dernier syst&#232;me d&#8217;exploitation star. Au programme, des tas d&#8217;optimisations sous le capot et quelques nouveaut&#233;s int&#233;ressantes pour le grand public.
</description>
    </item>
    <item>
      <title>Anthropic d&#233;voile Claude Sonnet 4.6, sa nouvelle IA de r&#233;f&#233;rence</title>
      <link>https://www.01net.com/actualites/anthropic-devoile-claude-sonnet-4-6-nouvelle-ia-reference.html</link>
      <pubDate>Wed, 18 Feb 2026 08:15:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326554</guid>
      <description>Anthropic d&#233;voile Claude Sonnet 4.6, une mise &#224; jour majeure de son mod&#232;le d&#8217;IA g&#233;n&#233;raliste. Plus rapide, plus fiable et presque aussi performant que les mod&#232;les de pointe, Sonnet 4.6 vise &#224; rendre l&#8217;automatisation intelligente accessible au plus grand nombre.</description>
    </item>
    <item>
      <title>The best drone for 2026</title>
      <link>https://www.engadget.com/cameras/best-drone-120046775.html?src=rss</link>
      <pubDate>Wed, 18 Feb 2026 08:01:26 +0000</pubDate>
      <guid isPermaLink="false">de298f39-1edd-4bb0-b825-fcc7f3710e12</guid>
      <description>Drones are no longer just niche toys for enthusiasts. Today&#8217;s models are compact, increasingly affordable and capable of capturing sharp aerial photos and video with minimal effort. Whether you&#8217;re curious about flying for the first time or looking to upgrade to a more advanced camera drone, the options available in 2026 are broader and more approachable than ever.Entry-level drones now offer features like GPS-assisted flight, return-to-home safety systems and automated shooting modes that take much of the stress out of learning to fly. Step up to more advanced models and you&#8217;ll find foldable d...</description>
    </item>
    <item>
      <title>Fuite de donn&#233;es embarrassantes chez un fabricant de sextoys</title>
      <link>https://www.01net.com/actualites/fuite-de-donnees-embarrassantes-chez-un-fabricant-de-sextoys.html</link>
      <pubDate>Wed, 18 Feb 2026 07:27:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326532</guid>
      <description>Personne n'est &#224; l'abri d'une fuite de donn&#233;es, mais celle-ci est particuli&#232;rement embarrassante. Le fabricant de sextoys Tenga a en effet inform&#233; ses clients que des informations confidentielles les concernant sont dans la nature.</description>
    </item>
    <item>
      <title>Lunettes, pendentif connect&#233; et AirPods&#160;nouvelle g&#233;n&#233;ration&#160;: l&#8217;avenir d&#8217;Apple d&#233;pend (trop ?) de Siri</title>
      <link>https://www.frandroid.com/marques/apple/2980887_lunettes-pendentif-connecte-et-airpods-nouvelle-generation-lavenir-dapple-depend-trop-de-siri</link>
      <pubDate>Wed, 18 Feb 2026 07:26:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2980887_lunettes-pendentif-connecte-et-airpods-nouvelle-generation-lavenir-dapple-depend-trop-de-siri</guid>
      <description>
Apr&#232;s le semi-&#233;chec du Vision Pro, Apple cherche d&#233;sesp&#233;r&#233;ment son nouveau relai de croissance et mise tout &#224; la fois sur des lunettes connect&#233;es, une broche fa&#231;on AI Pin et des AirPods bourr&#233;s de capteurs. Tous tr&#232;s d&#233;pendants des progr&#232;s de la firme sur l&#8217;IA.
</description>
    </item>
    <item>
      <title>Juste avant la probable sortie de l&#8217;iPhone 17e, ce smartphone Apple abordable revient &#224; prix bas</title>
      <link>https://www.frandroid.com/bons-plans/2980047_juste-avant-la-probable-sortie-de-liphone-17e-ce-smartphone-apple-abordable-revient-a-prix-bas</link>
      <pubDate>Wed, 18 Feb 2026 07:24:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2980047_juste-avant-la-probable-sortie-de-liphone-17e-ce-smartphone-apple-abordable-revient-a-prix-bas</guid>
      <description>
Alors que la sortie de l'iPhone 17e est attendue pour le premier trimestre 2026, le mod&#232;le actuel, l'abordable iPhone 16e, en profite pour baisser son prix. Aujourd'hui seulement, il s'affiche &#224; 504,99 euros au lieu de 719 euros chez Rakuten.  
</description>
    </item>
    <item>
      <title>Tesla casse le prix de son Model Y&#160;: le SUV perd 5&#160;000 euros et s&#8217;ach&#232;te moins de 30&#160;000 euros</title>
      <link>https://www.01net.com/actualites/tesla-casse-le-prix-de-son-model-y-le-suv-perd-5-000-euros-et-sachete-moins-de-30-000-euros.html</link>
      <pubDate>Wed, 18 Feb 2026 07:20:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326296</guid>
      <description>Un Tesla Model Y &#224; moins de 30 000 euros ? Le SUV &#233;lectrique de Tesla b&#233;n&#233;ficie d'une nouvelle baisse de prix qui permet d&#233;sormais de se l'offrir de 8 000 &#224; 10 000 euros de moins que son tarif affich&#233;.</description>
    </item>
    <item>
      <title>Google Home ajoute enfin ces nouveaut&#233;s tr&#232;s demand&#233;es dans la derni&#232;re mise &#224; jour</title>
      <link>https://www.01net.com/actualites/google-home-ajoute-nouveautes-tres-demandees-derniere-mise-a-jour.html</link>
      <pubDate>Wed, 18 Feb 2026 07:15:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326539</guid>
      <description>Google Home d&#233;ploie une mise &#224; jour importante qui permet de supprimer des routines pr&#233;d&#233;finies, d'ajouter des commandes vocales en un clic, ainsi qu'une nouveaut&#233; importante pour les vid&#233;os.</description>
    </item>
    <item>
      <title>Mozilla signe l&#8217;arr&#234;t de mort de Firefox sur Windows 7</title>
      <link>https://www.01net.com/actualites/mozilla-signe-larret-de-mort-de-firefox-sur-windows-7.html</link>
      <pubDate>Wed, 18 Feb 2026 07:11:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326546</guid>
      <description>Mozilla vient d&#8217;annoncer officiellement la fin du support de Firefox sur les anciennes versions de Windows. Firefox 115 ESR ne recevra plus aucune mise &#224; jour de s&#233;curit&#233; d&#8217;ici la fin f&#233;vrier.</description>
    </item>
    <item>
      <title>Google I/O 2026&#160;: Android 17 et Gemini en t&#234;te d&#8217;affiche les 19 et 20 mai</title>
      <link>https://www.01net.com/actualites/google-i-o-2026-android-17-et-gemini-en-tete-daffiche-les-19-et-20-mai.html</link>
      <pubDate>Wed, 18 Feb 2026 07:01:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326536</guid>
      <description>Sans trop de surprise puisque l'&#233;v&#233;nement a lieu tous les ans &#224; peu pr&#232;s aux m&#234;mes dates, Google I/O se tiendra cette ann&#233;e les 19 et 20 mai ! Au menu : beaucoup de nouveaut&#233;s logicielles pour Android 17, et aussi bien s&#251;r de l'IA &#224; gogo.</description>
    </item>
  </channel>
</rss>
