<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 05 Dec 2025 17:23:06 GMT</lastBuildDate>
    <item>
      <title>Mi-moniteur, mi-Smart TV, cet &#233;cran PC LG ultra-wide (21:9) de 34 pouces anim&#233; par webOS chute sous les 300 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2900945_mi-moniteur-mi-smart-tv-cet-ecran-pc-lg-ultra-wide-219-de-34-pouces-anime-par-webos-chute-sous-les-300-e</link>
      <pubDate>Fri, 05 Dec 2025 17:21:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2900945_mi-moniteur-mi-smart-tv-cet-ecran-pc-lg-ultra-wide-219-de-34-pouces-anime-par-webos-chute-sous-les-300-e</guid>
      <description>
Avec sa dalle ultra-large et son syst&#232;me webOS, l'&#233;cran PC LG Smart Monitor 34U601SA-W peut aussi bien &#234;tre utilis&#233; pour travailler que pour les moments de d&#233;tente. Actuellement, Amazon le propose &#224; 299,95 euros au lieu de 379,99 euros.
</description>
    </item>
    <item>
      <title>Netflix is buying Warner Bros Discovery: All of the latest updates</title>
      <link>https://www.theverge.com/news/839007/netflix-warner-acquisition</link>
      <pubDate>2025-12-05T12:18:24-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?post_type=vm_stream&amp;p=839007</guid>
      <description>After a bidding war that reportedly also involved Paramount, Comcast, Amazon, and Apple, on December 5th, Netflix struck a deal to buy Warner Bros. for $82.7 billion, buying the studio, HBO / HBO Max, Warner Games, and more. There are already questions and comments coming from politicians and regulators about the proposed acquisition, and you [&#8230;]</description>
    </item>
    <item>
      <title>La France abat 5 drones au-dessus d&#8217;une base nucl&#233;aire ultra-sensible</title>
      <link>https://www.01net.com/actualites/cinq-drones-ete-abattus-dessus-base-nucleaire-francaise-ultra-sensible.html</link>
      <pubDate>Fri, 05 Dec 2025 17:01:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314030</guid>
      <description>Un essaim de drones non identifi&#233;s a survol&#233; la base nucl&#233;aire de l&#8217;&#206;le Longue, pr&#232;s de Brest. La Marine a promptement r&#233;agi en abattant les cinq engins. Une enqu&#234;te a &#233;t&#233; ouverte.</description>
    </item>
    <item>
      <title>Was 2025 Marvel&#8217;s Comeback Year?</title>
      <link>https://gizmodo.com/marvel-2025-retrospective-fantastic-four-thunderbolts-daredevil-mcu-2000693102</link>
      <pubDate>Fri, 05 Dec 2025 17:00:46 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000693102</guid>
      <description>With 'Thunderbolts,' 'Daredevil,' and more spread throughout 2025, Marvel sure had a bigger year than before. But was it a better one?</description>
    </item>
    <item>
      <title>Wired Earbuds Are Making Phone Dongles a Good Thing</title>
      <link>https://gizmodo.com/wired-earbuds-are-making-phone-dongles-a-good-thing-2000696179</link>
      <pubDate>Fri, 05 Dec 2025 17:00:42 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000696179</guid>
      <description>If you're an audiophile, dongles might be your new best friend.</description>
    </item>
    <item>
      <title>OpenAI&#8217;s GPT-5.2 &#8216;code red&#8217; response to Google is coming next week</title>
      <link>https://www.theverge.com/report/838857/openai-gpt-5-2-release-date-code-red-google-response</link>
      <pubDate>2025-12-05T12:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=838857</guid>
      <description>OpenAI CEO Sam Altman declared a "code red" situation earlier this week, pushing staff to respond quickly to increased competition from Google and Anthropic. Sources familiar with OpenAI's plans tell me that the company is planning its first response to Gemini 3 with its upcoming GPT-5.2 update. I understand GPT-5.2 is ready to be released, [&#8230;]</description>
    </item>
    <item>
      <title>New streaming channel launches to give viewers a peek into city council meetings</title>
      <link>https://techcrunch.com/2025/12/05/new-streaming-channel-launches-to-give-viewers-a-peek-into-city-council-meetings/</link>
      <pubDate>Fri, 05 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3073247</guid>
      <description>Hamlet TV is a way to help keep citizens informed of what's happening inside local governments.</description>
    </item>
    <item>
      <title>Eternity's director says it 'doesn't matter' if you disagree with the new A24 film's ending, but I still can't stand it</title>
      <link>https://www.techradar.com/streaming/entertainment/eternitys-director-says-it-doesnt-matter-if-you-disagree-with-the-new-a24-films-ending-but-i-still-cant-stand-it</link>
      <pubDate>Fri, 05 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">6twXVwGFSeNtPHvvmhFYG4</guid>
      <description>New A24 movie Eternity is the ultimate afterlife love triangle &#8211; but if you don&#8217;t agree with the ending, it &#8216;doesn&#8217;t matter&#8217; to the director.</description>
    </item>
    <item>
      <title>US security agency urges Android and iPhone users to stop using personal VPNs</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/us-security-agency-urges-android-and-iphone-users-to-stop-using-personal-vpns</link>
      <pubDate>Fri, 05 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">3DWZBodjZDXs3PtYL78kH8</guid>
      <description>CISA warned that many commercial VPNs could be putting your data at greater risk. But that doesn't mean you should give up on privacy &#8211; here's what you need to know.</description>
    </item>
    <item>
      <title>Chat Control: EU Commissioner backs Parliament line on targeted monitoring</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/chat-control-eu-commissioner-backs-parliament-line-on-targeted-monitoring</link>
      <pubDate>Fri, 05 Dec 2025 16:56:33 +0000</pubDate>
      <guid isPermaLink="false">kdfSSfTsqcs2nd5HDY4wTD</guid>
      <description>As the trialogue negotiations are set to begin on Tuesday, December 9, the debate on the controversial Child Sexual Abuse Regulation (CSAR) flares up.</description>
    </item>
    <item>
      <title>Discord just dropped its first personalized year-in-review&#8212;and it looks a lot like Spotify Wrapped</title>
      <link>https://www.fastcompany.com/91455603/discord-wrapped-checkpoint-spotify-wrapped</link>
      <pubDate>2025-12-05T16:51:08</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91455603/discord-wrapped-checkpoint-spotify-wrapped</guid>
      <description>The long-requested feature shows your messages, emojis, voice minutes, top servers, and one of 10 personality-style Checkpoint cards.
The year is quickly coming to an end, and that means tech platforms are tripping over themselves to roll out their year-end recaps&#8212;all hoping to capture the virality that Spotify&#8217;s Wrapped year-in-review recap commands each year....</description>
    </item>
    <item>
      <title>I thought I was tired. Turns out, I was burnt out</title>
      <link>https://www.fastcompany.com/91451052/i-thought-i-was-tired-turns-out-i-was-burnt-out</link>
      <pubDate>2025-12-05T16:48:08</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91451052/i-thought-i-was-tired-turns-out-i-was-burnt-out</guid>
      <description>When your brain is cooked not even a vacation will get you right.
Being tired is practically a personality trait in corporate America &#8212; especially in 2025. Everybody is exhausted, it seems. Folks are doing fiftyleven jobs. You&#8217;re always juggling tasks, always late for the next meeting because the last one ran long. But when you&#8217;re one of the few Black employees at the gig, there&#8217;s a subconscious fear of looking like you&#8217;re in over your head, especially with the looming fear of layoffs. So you push through, even when you&#8217;re running on fumes. You go harder, telling yourself you&#8217;ll rest once you ...</description>
    </item>
    <item>
      <title>Wikipedia is getting in on the yearly wrapped game</title>
      <link>https://www.theverge.com/news/838989/wikipedia-year-in-review-2025-wrapped</link>
      <pubDate>2025-12-05T11:47:19-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=838989</guid>
      <description>Everyone is doing it, so why not Wikipedia? Everyone&#8217;s favorite free online encyclopedia has decided to launch its own customized Year in Review feature on its mobile app. Of course, you&#8217;ll need the app installed and have been using it for the feature to be of much use. But clearly, the Wikimedia Foundation hopes this [&#8230;]</description>
    </item>
    <item>
      <title>The PS5 Could Receive a Massive AI Upgrade for Games</title>
      <link>https://gizmodo.com/ps5-playstation-spectral-super-resolution-2-2000696189</link>
      <pubDate>Fri, 05 Dec 2025 16:44:34 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000696189</guid>
      <description>And it&#8217;s making us even more excited for the rumored PlayStation 6 handheld.</description>
    </item>
    <item>
      <title>Amazon has a huge holiday sale with Black Friday prices &#8211; AirPods, coffee makers, PS5 and more</title>
      <link>https://www.techradar.com/seasonal-sales/amazon-has-a-huge-holiday-sale-with-black-friday-prices-airpods-coffee-makers-ps5-and-more</link>
      <pubDate>Fri, 05 Dec 2025 16:40:02 +0000</pubDate>
      <guid isPermaLink="false">jnJNtP5Zic7hdq4RjFHEH</guid>
      <description>Amazon has a huge holiday sale with leftover Black Friday prices, and I'm rounding up the 31 best deals featuring AirPods, coffee makers, PS5, and more.</description>
    </item>
    <item>
      <title>The best Christmas gifts we love under $50</title>
      <link>https://www.theverge.com/gadgets/802969/best-gifts-under-50-2025</link>
      <pubDate>2025-12-05T11:33:41-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=802969</guid>
      <description>One of the easiest things to do during the holidays is spend too much money. It happens to many of us, even when we swear that things are going to be different this year. We want to help you stay true to your intentions to save money when possible, and we're doing that with a [&#8230;]</description>
    </item>
    <item>
      <title>The&#160;insurance coverage squeeze is reshaping healthcare</title>
      <link>https://www.fastcompany.com/91455583/the-insurance-coverage-squeeze-is-reshaping-healthcare</link>
      <pubDate>2025-12-05T16:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91455583/the-insurance-coverage-squeeze-is-reshaping-healthcare</guid>
      <description>A new era of out-of-pocket decision making is poised to reshape how and where Americans seek care.
Every year, open enrollment forces Americans to confront a familiar dilemma:&#160;Pay&#160;more for coverage that delivers less, or gamble on going without it. This year, that choice has&#160;become even&#160;starker.&#160;</description>
    </item>
    <item>
      <title>Hubble observe le visiteur interstellaire 3I/Atlas en pleine transformation</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-hubble-observe-visiteur-interstellaire-3i-atlas-pleine-transformation-128284/#xtor%3DRSS-8</link>
      <pubDate>Fri, 05 Dec 2025 17:27:40 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-hubble-observe-visiteur-interstellaire-3i-atlas-pleine-transformation-128284/#xtor%3DRSS-8</guid>
      <description>Scrut&#233;e par tous les t&#233;lescopes du monde depuis sa d&#233;couverte il y a &#224; peine six mois, la com&#232;te 3I/Atlas passe d&#233;sormais sous le viseur de deux engins spatiaux particuli&#232;rement perfectionn&#233;s, de quoi multiplier les donn&#233;es sur ce myst&#233;rieux visiteur venu d'un autre syst&#232;me solaire.</description>
    </item>
    <item>
      <title>Tesla casse les prix en France&#160;: pourquoi la Model 3 Standard assomme la concurrence</title>
      <link>https://www.01net.com/actualites/tesla-casse-les-prix-en-france-pourquoi-la-model-3-standard-assomme-la-concurrence.html</link>
      <pubDate>Fri, 05 Dec 2025 16:26:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314025</guid>
      <description>En affichant sa Model 3 Standard &#224; 36 990 euros, Tesla ne se contente pas de baisser ses prix : la marque rebat totalement les cartes. Comment les Renault M&#233;gane E-Tech, MG4 ou Peugeot e-308 peuvent-elles lutter face &#224; une berline familiale vendue au prix d'une citadine ? Analyse d'un hold-up annonc&#233;.</description>
    </item>
    <item>
      <title>Google Wallet va simplifier la gestion de vos vols (en avion hein)</title>
      <link>https://www.frandroid.com/marques/google/2900031_google-wallet-va-simplifier-la-gestion-de-vos-vols-en-avion-hein</link>
      <pubDate>Fri, 05 Dec 2025 16:25:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2900031_google-wallet-va-simplifier-la-gestion-de-vos-vols-en-avion-hein</guid>
      <description>
Google d&#233;ploie une fonctionnalit&#233; pour son portefeuille num&#233;rique permettant de recevoir des notifications de proximit&#233;. Pratique pour ne pas manquer son vol. 
</description>
    </item>
    <item>
      <title>&#8216;We Are Doing Harm&#8217;: RFK Jr.&#8217;s ACIP Guts Universal Hep B Vaccination at Birth</title>
      <link>https://gizmodo.com/we-are-doing-harm-rfk-jr-s-acip-guts-universal-hep-b-vaccination-at-birth-2000695747</link>
      <pubDate>Fri, 05 Dec 2025 16:25:04 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000695747</guid>
      <description>Outside experts and groups widely condemned the decision.</description>
    </item>
    <item>
      <title>Wi-Fi 6 et 6E : les meilleurs routeurs et cartes PC disponibles</title>
      <link>https://www.frandroid.com/guide-dachat/605291_wi-fi-6-802-11ax-quels-smartphones-pc-routeurs-et-materiels-pour-en-profiter</link>
      <pubDate>Fri, 05 Dec 2025 16:24:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/605291_wi-fi-6-802-11ax-quels-smartphones-pc-routeurs-et-materiels-pour-en-profiter</guid>
      <description>
Le Wi-Fi&#160;6 (802.11ax) est d&#233;sormais la norme sur la plupart des produits. Du routeur au t&#233;l&#233;phone en passant par votre PC, petit tour du propri&#233;taire des meilleurs routeurs Wi-Fi 6 et des cartes PC compatibles.
</description>
    </item>
    <item>
      <title>This RTX 5070 gaming laptop is on sale for an incredible price of $1,099 at Walmart - but not for long</title>
      <link>https://www.techradar.com/computing/gaming-laptops/this-rtx-5070-gaming-laptop-is-on-sale-for-an-incredible-price-of-usd1-099-at-walmart-but-not-for-long</link>
      <pubDate>Fri, 05 Dec 2025 16:23:23 +0000</pubDate>
      <guid isPermaLink="false">aAmcs8LQqg87ehFd34c5c5</guid>
      <description>Walmart's deals this week include a great Cyber Monday holdover in the form of this massive $400 price cut on the Asus TUF gaming laptop.</description>
    </item>
    <item>
      <title>Ce nouveau malware Android invisible contr&#244;le votre smartphone pour vider votre compte bancaire</title>
      <link>https://www.frandroid.com/android/2900517_ce-nouveau-malware-android-invisible-controle-votre-smartphone-pour-vider-votre-compte-bancaire</link>
      <pubDate>Fri, 05 Dec 2025 16:18:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/2900517_ce-nouveau-malware-android-invisible-controle-votre-smartphone-pour-vider-votre-compte-bancaire</guid>
      <description>
Des chercheurs en cybers&#233;curit&#233; ont d&#233;couvert un malware particuli&#232;rement vicieux ciblant les smartphones Android. Il en prend le contr&#244;le pour effectuer diverses op&#233;rations malveillantes en toute discr&#233;tion.
</description>
    </item>
    <item>
      <title>You don&#8217;t need Sam Altman or his big, beautiful LLM</title>
      <link>https://www.fastcompany.com/91454845/you-dont-need-sam-altman-big-beautiful-llm</link>
      <pubDate>2025-12-05T16:15:31</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91454845/you-dont-need-sam-altman-big-beautiful-llm</guid>
      <description>Just like we did with the early internet, we&#8217;re again missing out on the promise and power of local, decentralized technology.
We&#8217;ve been here before.</description>
    </item>
    <item>
      <title>Prix mini, utilit&#233; maxi : 8 gadgets tech &#224; saisir sur Amazon Haul &#224; moins de 10 &#8364; [Sponso]</title>
      <link>https://www.frandroid.com/marques/amazon/2884365_prix-mini-utilite-maxi-8-gadgets-tech-a-saisir-sur-amazon-haul-a-moins-de-10-e</link>
      <pubDate>Fri, 05 Dec 2025 16:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazon/2884365_prix-mini-utilite-maxi-8-gadgets-tech-a-saisir-sur-amazon-haul-a-moins-de-10-e</guid>
      <description>
M&#233;connus mais tr&#232;s pratiques, voici 8 gadgets tech &#224; moins de 10 euros sur Amazon Haul qui gagnent vraiment &#224; &#234;tre test&#233;s.
</description>
    </item>
    <item>
      <title>#FrandroidOffreMoi un smartphone Oppo Reno 14</title>
      <link>https://www.frandroid.com/marques/oppo/2900739_frandroidoffremoi-un-smartphone-oppo-reno-14</link>
      <pubDate>Fri, 05 Dec 2025 16:07:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/oppo/2900739_frandroidoffremoi-un-smartphone-oppo-reno-14</guid>
      <description>
Jour 5 du calendrier de l'Avent #FrandroidOffreMoi. Participez &#224; notre concours pour remporter un Oppo Reno 14.
</description>
    </item>
    <item>
      <title>La fiabilit&#233; des batteries &#233;lectriques de BYD pourrait s&#8217;am&#233;liorer gr&#226;ce &#224; cette annonce ambitieuse</title>
      <link>https://www.frandroid.com/marques/byd/2900157_la-fiabilite-des-batteries-electriques-de-byd-pourrait-sameliorer-grace-a-cette-annonce-ambitieuse</link>
      <pubDate>Fri, 05 Dec 2025 16:04:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2900157_la-fiabilite-des-batteries-electriques-de-byd-pourrait-sameliorer-grace-a-cette-annonce-ambitieuse</guid>
      <description>
BYD intensifie ses standards de production alors que sa fabrication de batteries atteint des sommets historiques. L'objectif ? Ne plus avoir aucun d&#233;faut sur les batteries que l'entreprise produit, aussi bien pour les voitures &#233;lectriques que pour les autres domaines d'application.
</description>
    </item>
    <item>
      <title>Proton lance Sheets, un tableur s&#233;curis&#233; pour rivaliser avec Excel et Google Sheets</title>
      <link>https://www.01net.com/actualites/proton-lance-sheets-un-tableur-securise-pour-rivaliser-avec-excel-et-google-sheets.html</link>
      <pubDate>Fri, 05 Dec 2025 16:04:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314049</guid>
      <description>Proton renforce son arsenal bureautique : apr&#232;s le traitement de texte Docs, le sp&#233;cialiste suisse de la confidentialit&#233; vient de lancer Sheets, un tableur qui veut concurrencer Excel et Google Sheets avec de s&#233;rieux arguments &#224; faire valoir.</description>
    </item>
    <item>
      <title>The New York Times is suing Perplexity for copyright infringement</title>
      <link>https://techcrunch.com/2025/12/05/the-new-york-times-is-suing-perplexity-for-copyright-infringement/</link>
      <pubDate>Fri, 05 Dec 2025 16:03:59 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3073296</guid>
      <description>The New York Times filed a copyright lawsuit against Perplexity, joining other publishers using legal action as leverage to force AI companies into licensing deals that compensate content creators.</description>
    </item>
    <item>
      <title>Ce chargeur Ugreen 65 W 3&#8209;en&#8209;1, parfait pour voyager, perd 39% de son prix sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2900371_ce-chargeur-ugreen-65-w-3%e2%80%91en%e2%80%911-parfait-pour-voyager-perd-39-de-son-prix-sur-amazon</link>
      <pubDate>Fri, 05 Dec 2025 16:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2900371_ce-chargeur-ugreen-65-w-3%e2%80%91en%e2%80%911-parfait-pour-voyager-perd-39-de-son-prix-sur-amazon</guid>
      <description>
Avec ses trois ports et sa charge d'une puissance maximale de 65 W, ce chargeur Ugreen pourra charger tous vos appareils en un rien de temps. Bonne nouvelle, il est disponible chez Amazon pour seulement 18,99 euros au lieu de 30,99 euros.
</description>
    </item>
    <item>
      <title>I had a big audio transcription problem &#8211; Gemini solved it, and ChatGPT didn&#8217;t</title>
      <link>https://www.techradar.com/ai-platforms-assistants/gemini/i-had-a-big-audio-transcription-problem-gemini-solved-it-and-chatgpt-didnt</link>
      <pubDate>Fri, 05 Dec 2025 16:00:12 +0000</pubDate>
      <guid isPermaLink="false">QXyd97jC5BXueN5pQsTa9Y</guid>
      <description>When I needed a transcription with speakers identified, Gemini 3 Pro proved its mettle.</description>
    </item>
    <item>
      <title>Netflix Says It Will Keep Warner Bros. Movies in Theaters&#8212;Just Maybe Not For as Long</title>
      <link>https://gizmodo.com/netflix-warner-bros-sale-theatrical-releases-2000696187</link>
      <pubDate>Fri, 05 Dec 2025 16:00:05 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000696187</guid>
      <description>Netflix co-CEO Ted Sarandos assures press and investors it will honor Warner Bros.' prior theatrical release agreements but to expect that to 'evolve' to be more 'consumer friendly.'</description>
    </item>
    <item>
      <title>Here&#8217;s What You Should Know About Launching an AI Startup</title>
      <link>https://www.wired.com/story/artificial-intelligence-startups-daydream-fashion-recommendations/</link>
      <pubDate>Fri, 05 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">692dd7b1fbb01f28f4e39191</guid>
      <description>AI startups say the promise of turning dazzling models into useful products is harder than anyone expected. Three founders discuss what it takes.</description>
    </item>
    <item>
      <title>The Apple AirPods 4 with ANC are at their lowest price</title>
      <link>https://www.theverge.com/gadgets/838493/apple-airpods-anc-lego-deal-sale</link>
      <pubDate>2025-12-05T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=838493</guid>
      <description>The Apple AirPods 4 with active noise cancellation are now at their lowest price of $99 ($80 off) at Amazon and Walmart. The AirPods 4 offer upgraded sound quality, wireless charging, and a built-in speaker in the case that rings if you can&#8217;t find it. The ANC, while not the best on the market, is [&#8230;]</description>
    </item>
    <item>
      <title>ChatGPT will decide what Americans buy this holiday</title>
      <link>https://www.fastcompany.com/91455573/chatgpt-will-decide-what-americans-buy-this-holiday</link>
      <pubDate>2025-12-05T16:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91455573/chatgpt-will-decide-what-americans-buy-this-holiday</guid>
      <description>Most brands won&#8217;t make the cut without trust, relevance, and extractability.
The way consumers search is changing faster than the industry expected. This holiday season, many shoppers&#160;are&#160;looking for gifts inside AI platforms,&#160;rather than retailer sites or traditional search. They&#160;are asking&#160;natural questions like:&#160;</description>
    </item>
    <item>
      <title>The 38 best gift ideas for mom this holiday season</title>
      <link>https://www.theverge.com/gadgets/802964/best-mom-gift-ideas</link>
      <pubDate>2025-12-05T10:56:18-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=802964</guid>
      <description>Your mom deserves the best, and we're going to help you get them something special. The right gift can make family or friend time more valuable, after all, or it can greatly enrich time spent alone. If your mom says that she has all that she needs, don't take her word for it and show [&#8230;]</description>
    </item>
    <item>
      <title>The New York Times sues Perplexity for producing &#8216;verbatim&#8217; copies of its work</title>
      <link>https://www.theverge.com/news/839006/new-york-times-perplexity-lawsuit-copyright</link>
      <pubDate>2025-12-05T10:42:56-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=839006</guid>
      <description>The New York Times has escalated its legal battle against the AI startup Perplexity, as it&#8217;s now suing the AI &#8220;answer engine&#8221; for allegedly producing and profiting from responses that are &#8220;verbatim or substantially similar copies&#8221; of the publication&#8217;s work. The lawsuit, filed in a New York federal court on Friday, claims Perplexity &#8220;unlawfully crawls, [&#8230;]...</description>
    </item>
    <item>
      <title>European Union slams Elon Musk&#8217;s X with a $140 million fine. Here&#8217;s why</title>
      <link>https://www.fastcompany.com/91455442/european-union-slams-elon-musks-x-with-140-million-fine-heres-why</link>
      <pubDate>2025-12-05T15:41:53</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91455442/european-union-slams-elon-musks-x-with-140-million-fine-heres-why</guid>
      <description>EU watchdogs fined X for breaching the Digital Services Act.
European Union regulators on Friday fined Elon Musk&#8217;s social media platform X 120 million euros ($140 million) for breaches of the bloc&#8217;s digital regulations that they said could leave users exposed to scams and manipulation.The European Commission issued its decision following an investigation it opened two years ago into X under the 27-nation bloc&#8217;s Digital Services Act, also known as the DSA.It&#8217;s the first time that the EU has issued a so-called non-compliance decision since rolling out the DSA. The sweeping rulebook requires plat...</description>
    </item>
    <item>
      <title>Apple perd de nouveau deux cadres dirigeants : une nouvelle &#232;re arrive</title>
      <link>https://www.frandroid.com/marques/apple/2900809_apple-perd-de-nouveau-deux-cadres-dirigeants-une-nouvelle-ere-arrive</link>
      <pubDate>Fri, 05 Dec 2025 15:38:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2900809_apple-perd-de-nouveau-deux-cadres-dirigeants-une-nouvelle-ere-arrive</guid>
      <description>
Apple est en pleine transformation. Deux nouveaux cadres sont sur le d&#233;part. En quelques jours, quatre membres de la direction ont quitt&#233; Apple pour des raisons diff&#233;rentes.
</description>
    </item>
    <item>
      <title>Get your game on with the Razer Kraken Kitty V3 X headset for just $35 at Woot</title>
      <link>https://mashable.com/article/dec-5-razer-kraken-kitty-v3-x-deal</link>
      <pubDate>Fri, 05 Dec 2025 15:37:59 +0000</pubDate>
      <guid isPermaLink="false">01aJEzNVfMqOjcRU4CGiclq</guid>
      <description>As of Dec. 5, get the Razer Kraken Kitty V3 X headset for just $35 at Woot.</description>
    </item>
    <item>
      <title>Elon Musk says Tesla drivers can text while driving, but they absolutely should not</title>
      <link>https://www.theverge.com/transportation/838901/elon-musk-tesla-fsd-text-while-drive</link>
      <pubDate>2025-12-05T10:32:08-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=838901</guid>
      <description>I can&#8217;t believe I have to say this, but Tesla drivers should not start texting while driving, despite what Elon Musk says. Do not listen to the billionaire CEO of the company that makes your car. He will not be liable if there&#8217;s a crash &#8212; you will. Musk took a break from posting racist [&#8230;]</description>
    </item>
    <item>
      <title>You can still buy Bose QuietComfort headphones for 49% off at Amazon</title>
      <link>https://mashable.com/article/dec-5-bose-quietcomfort-headphones-deal</link>
      <pubDate>Fri, 05 Dec 2025 15:28:52 +0000</pubDate>
      <guid isPermaLink="false">01PNrYM1BdLvfSJ6yfXdwyD</guid>
      <description>As of Dec. 5, you can get the Bose QuietComfort headphones (with ANC) for just $179, down from $349, at Amazon. That's a 49% discount.</description>
    </item>
    <item>
      <title>Why CEOs who understand software development have a head start in the AI race</title>
      <link>https://www.techradar.com/pro/why-ceos-who-understand-software-development-have-a-head-start-in-the-ai-race</link>
      <pubDate>Fri, 05 Dec 2025 15:28:42 +0000</pubDate>
      <guid isPermaLink="false">ZFvsy2jvFLpDoU6jYGwrEY</guid>
      <description>There is huge pressure on CEOs to empower their businesses to integrate AI successfully, but few have technical experience.</description>
    </item>
    <item>
      <title>Meta signs commercial AI data agreements with publishers to offer real-time news on Meta AI</title>
      <link>https://techcrunch.com/2025/12/05/meta-signs-commercial-ai-data-agreements-with-publishers-to-offer-real-time-news-on-meta-ai/</link>
      <pubDate>Fri, 05 Dec 2025 15:27:37 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3073271</guid>
      <description>Meta is partnering with CNN, Fox News, Fox Sports, Le Monde Group, the People Inc. portfolio of media brands, The Daily Caller, The Washington Examiner, and USA Today.</description>
    </item>
    <item>
      <title>Energy storage industry set aggressive goals for 2025 &#8212;&#160;and already crushed them</title>
      <link>https://techcrunch.com/2025/12/05/energy-storage-industry-set-aggressive-goals-for-2025-and-already-crushed-them/</link>
      <pubDate>Fri, 05 Dec 2025 15:25:28 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3073282</guid>
      <description>The battery storage industry in the U.S. has grown in leaps and bounds in recent years, surpassing its most aggressive targets to become one of the largest new sources of power on the grid.</description>
    </item>
    <item>
      <title>The ISS Is Out of Parking Spots for the First Time Ever. Here&#8217;s Why</title>
      <link>https://gizmodo.com/the-iss-is-out-of-parking-spots-for-the-first-time-ever-heres-why-2000696175</link>
      <pubDate>Fri, 05 Dec 2025 15:25:04 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000696175</guid>
      <description>All eight docking ports at the ISS are occupied. That's never happened before.</description>
    </item>
    <item>
      <title>Logitech CEO says AI devices are just "solutions looking for a problem"</title>
      <link>https://www.techradar.com/pro/security/logitech-ceo-says-ai-devices-are-just-solutions-looking-for-a-problem</link>
      <pubDate>Fri, 05 Dec 2025 15:25:00 +0000</pubDate>
      <guid isPermaLink="false">bnTm8ad2VrrU9J3tUx2vr8</guid>
      <description>Is AI-powered hardware pointless or have we not yet built a proper one?</description>
    </item>
    <item>
      <title>Avec Warner Bros, Netflix s&#8217;empare aussi des jeux Mortal Kombat, Batman Arkham, Hogwarts Legacy&#8230;</title>
      <link>https://www.01net.com/actualites/avec-warner-bros-netflix-sempare-aussi-des-jeux-mortal-kombat-batman-arkham-hogwarts-legacy.html</link>
      <pubDate>Fri, 05 Dec 2025 15:24:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314042</guid>
      <description>Netflix s'empare donc de Warner Bros Discovery, pour une somme qui d&#233;passe les 82 milliards de dollars. Une acquisition colossale qui redessine le paysage du divertissement&#8230; mais aussi du jeu vid&#233;o, car la plateforme de streaming glisse aussi dans sa besace plusieurs studios WB &#8212; dont les cr&#233;ateurs de Mortal Kombat et de la saga Batman: Arkham.</description>
    </item>
  </channel>
</rss>
