<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 25 Jan 2026 09:26:45 GMT</lastBuildDate>
    <item>
      <title>Vague d&#8217;arnaques au colis en France&#160;: tout savoir sur ces escroqueries 2.0 qui exploitent vos donn&#233;es</title>
      <link>https://www.01net.com/actualites/arnaques-colis-font-ravages-france-pirates-sont-plus-redoutables.html</link>
      <pubDate>Sun, 25 Jan 2026 09:01:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321876</guid>
      <description>Les arnaques aux colis explosent en France. Ces derni&#232;res semaines, des faux livreurs ont envoy&#233; &#233;norm&#233;ment de mails et de SMS tr&#232;s cr&#233;dibles, truff&#233;s de donn&#233;es personnelles. Ces escroqueries 2.0 sont devenues tr&#232;s redoutables et tr&#232;s difficiles &#224; rep&#233;rer. On fait le point sur la nouvelle vague d'arnaques qui d&#233;ferle sur la France.</description>
    </item>
    <item>
      <title>Xiaomi Tag : ce qu&#8217;on sait sur ce potentiel concurrent des Apple AirTags et Samsung Galaxy SmartTags</title>
      <link>https://www.frandroid.com/marques/xiaomi/2954303_xiaomi-tag-ce-quon-sait-sur-ce-potentiel-concurrent-des-apple-airtags-et-samsung-galaxy-smarttags</link>
      <pubDate>Sun, 25 Jan 2026 08:54:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2954303_xiaomi-tag-ce-quon-sait-sur-ce-potentiel-concurrent-des-apple-airtags-et-samsung-galaxy-smarttags</guid>
      <description>
Quelques informations circulent sur un potentiel traqueur Bluetooth Xiaomi Tag. Voici ce qu'il faut retenir du porte-cl&#233; connect&#233;.
</description>
    </item>
    <item>
      <title>Plus de la moiti&#233; des cryptos sont mortes en 2025, c&#8217;est un bain de sang</title>
      <link>https://www.01net.com/actualites/plus-moitie-cryptos-nees-depuis-2021-mortes.html</link>
      <pubDate>Sun, 25 Jan 2026 08:33:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320965</guid>
      <description>En 2025, une grande partie des cryptomonnaies cr&#233;es depuis 2021 ont disparu. Les turbulences du march&#233; crypto, et les diff&#233;rents krachs, ont provoqu&#233; la mort de millions de projets...surtout des initiatives sans le moindre int&#233;r&#234;t. En parall&#232;le, on se rend compte que beaucoup de cryptos ont perdu toute leur valeur.</description>
    </item>
    <item>
      <title>Le prix de ce TV OLED LG de 42&#8243; d&#233;gringole pendant les soldes, (mais &#231;a ne va pas durer)</title>
      <link>https://www.frandroid.com/bons-plans/2953503_le-prix-de-ce-tv-oled-lg-de-42-degringole-pendant-les-soldes-mais-ca-ne-va-pas-durer</link>
      <pubDate>Sun, 25 Jan 2026 08:33:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2953503_le-prix-de-ce-tv-oled-lg-de-42-degringole-pendant-les-soldes-mais-ca-ne-va-pas-durer</guid>
      <description>
Id&#233;al pour les amateurs de cin&#233;ma et de gaming, le TV LG OLED42C5 occupe la premi&#232;re place de notre top des meilleurs petits t&#233;l&#233;viseurs du moment. La bonne nouvelle, c'est que ce mod&#232;le est propos&#233; &#224; 699 euros au lieu de 999 euros chez Rakuten, pendant les soldes. Attention, la promo n'est valable que ce dimanche.
</description>
    </item>
    <item>
      <title>5 surprising benefits of cold plunges, according to research &#8211; and how to make the most out of them, whether you're out on a wild swim or at home doing a 'James Bond shower'</title>
      <link>https://www.techradar.com/health-fitness/fitness-trackers/5-surprising-benefits-of-cold-plunges-according-to-research-and-how-to-make-the-most-out-of-them</link>
      <pubDate>Sun, 25 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">22apFYkZN3Soa2EkdezbJ6</guid>
      <description>I deep dived the research with the professionals to get you the best tips on how to use cold plunges to improve your health in many ways.</description>
    </item>
    <item>
      <title>Arnaque LeBonCoin&#160;: ce faux mail de paiement peut vous co&#251;ter cher</title>
      <link>https://www.01net.com/actualites/arnaque-leboncoin-ce-faux-mail-de-paiement-peut-vous-couter-cher.html</link>
      <pubDate>Sun, 25 Jan 2026 07:51:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321513</guid>
      <description>Une nouvelle escroquerie vise les vendeurs sur LeBonCoin. Des cybercriminels se font passer pour des acheteurs et envoient de faux e-mails de confirmation de paiement &#224; leurs victimes. La gendarmerie pr&#233;vient les internautes de se montrer vigilants, et d'adopter les bons r&#233;flexes.</description>
    </item>
  </channel>
</rss>
