<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 05 Jan 2026 07:32:33 GMT</lastBuildDate>
    <item>
      <title>Windows 11&#160;: Microsoft va proposer une option pour voir un peu moins de pub sur votre PC</title>
      <link>https://www.01net.com/actualites/windows-11-microsoft-va-proposer-une-option-pour-voir-un-peu-moins-de-pub-sur-votre-pc.html</link>
      <pubDate>Mon, 05 Jan 2026 07:23:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318028</guid>
      <description>Une nouvelle option directement int&#233;gr&#233;e dans les param&#232;tres du partage de proximit&#233; de Windows 11 vous permettra bient&#244;t d&#8217;esquiver les suggestions de Microsoft.</description>
    </item>
    <item>
      <title>GeForce NOW sur Linux : il &#233;tait temps, Nvidia !</title>
      <link>https://www.frandroid.com/marques/nvidia/2927285_geforce-now-sur-linux-il-etait-temps-nvidia</link>
      <pubDate>Mon, 05 Jan 2026 07:14:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2927285_geforce-now-sur-linux-il-etait-temps-nvidia</guid>
      <description>
Les utilisateurs de Linux sont habitu&#233;s &#224; souffrir. Pour jouer en cloud, il fallait jusqu'ici passer par Chrome ou des wrappers non officiels douteux. C'est termin&#233;. Nvidia profite du CES 2026 pour confirmer l'arriv&#233;e du support natif de Linux pour GeForce NOW.
</description>
    </item>
    <item>
      <title>Samsung The Frame, version 2026, des TV tableaux qui passent au Glare Free</title>
      <link>https://www.frandroid.com/marques/samsung/2927207_samsung-the-frame-version-2026-des-tv-tableaux-qui-passent-au-glare-free</link>
      <pubDate>Mon, 05 Jan 2026 07:07:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2927207_samsung-the-frame-version-2026-des-tv-tableaux-qui-passent-au-glare-free</guid>
      <description>
Lors du CES 2026, Samsung a d&#233;voil&#233; les caract&#233;ristiques techniques de ses nouveaux t&#233;l&#233;viseurs The Frame. En voici tous les d&#233;tails.
</description>
    </item>
    <item>
      <title>L'Or&#233;al&#8217;s CES 2026 beauty devices include a skin-like flexible LED mask</title>
      <link>https://www.engadget.com/science/loreals-ces-2026-beauty-devices-include-a-skin-like-flexible-led-mask-070000576.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">1de2e20b-fb44-4e59-9b8a-8df6ecb90e86</guid>
      <description>Over the last ten or so years, L'Or&#233;al has brought a taste of beauty tech to the masses at CES 2026. This time, it has three devices to show off: the &#8220;Light Straight + Multi-styler&#8221; as well as the helpfully named LED Face Mask and LED Eye Mask.&#160;Don&#8217;t let the unassuming names mislead you. These three products actually harbor some unique traits. The Light Straight (and multi-styler, which I&#8217;m going to just call the Light Straight from here on), for instance, uses infrared light to help generate the heat required to style your hair. Meanwhile, the LED Face Mask is different from those made by com...</description>
    </item>
    <item>
      <title>Test du Sony A7 V : une d&#233;monstration de force en photo, un peu frustrante en vid&#233;o</title>
      <link>https://www.frandroid.com/marques/sony/2921007_test-du-sony-a7-v-une-demonstration-de-force-en-photo-un-peu-frustrante-en-video</link>
      <pubDate>Mon, 05 Jan 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2921007_test-du-sony-a7-v-une-demonstration-de-force-en-photo-un-peu-frustrante-en-video</guid>
      <description>
Avec son nouveau capteur plein format de 33 MP partiellement empil&#233;, sa stabilisation m&#233;canique &#224; 7,5 IL et son processeur BIONZ XR2 dop&#233; &#224; l'IA, le Sony A7 V apporte de nombreux atouts &#224; la gamme phare de Sony. Voici son test complet. 
</description>
    </item>
    <item>
      <title>3 euros&#160;: IKEA casse encore le prix des chargeurs</title>
      <link>https://www.01net.com/actualites/3-euros-ikea-casse-encore-prix-chargeurs.html</link>
      <pubDate>Mon, 05 Jan 2026 06:59:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318018</guid>
      <description>IKEA frappe encore un grand coup en proposant un chargeur 20W &#224; seulement 2,99 &#8364;. Une solution tr&#232;s &#233;conomique pour charger ses appareils.</description>
    </item>
    <item>
      <title>Belkin d&#233;voile sa coque batterie pour Switch 2 : 10 000 mAh et un &#233;cran LCD int&#233;gr&#233;</title>
      <link>https://www.frandroid.com/marques/nintendo/2927211_belkin-devoile-sa-coque-batterie-pour-switch-2-10-000-mah-et-un-ecran-lcd-integre</link>
      <pubDate>Mon, 05 Jan 2026 06:46:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nintendo/2927211_belkin-devoile-sa-coque-batterie-pour-switch-2-10-000-mah-et-un-ecran-lcd-integre</guid>
      <description>
Vous avez peur de tomber en rade de batterie avec votre Nintendo Switch 2 flambant neuve ? Belkin a la solution. La marque pr&#233;sente une coque de transport qui fait aussi station de charge rapide 30W. L'id&#233;e de g&#233;nie ? Un compartiment cach&#233; pour un AirTag.
</description>
    </item>
    <item>
      <title>Ces lunettes remplacent votre TV : XREAL d&#233;voile les 1S au CES 2026 qui int&#232;grent une compatibilit&#233; native avec la Switch 2</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/lunettes-intelligentes/2927175_ces-lunettes-remplacent-votre-tv-xreal-devoile-les-1s-au-ces-2026-qui-integrent-une-compatibilite-native-avec-la-switch-2</link>
      <pubDate>Mon, 05 Jan 2026 06:37:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/lunettes-intelligentes/2927175_ces-lunettes-remplacent-votre-tv-xreal-devoile-les-1s-au-ces-2026-qui-integrent-une-compatibilite-native-avec-la-switch-2</guid>
      <description>
C'est devenu une tradition au CES : XREAL sort une nouvelle paire de lunettes. Cette ann&#233;e, place aux XREAL 1S. Ne cherchez pas la r&#233;volution, c'est une &#233;volution chirurgicale : 1200p, plus de luminosit&#233; et une compatibilit&#233; native avec la Switch 2.
</description>
    </item>
    <item>
      <title>This robot companion is a cameraman for your pet</title>
      <link>https://www.theverge.com/tech/854457/frontierx-vex-aura-robots-companions-pets</link>
      <pubDate>2026-01-05T01:37:23-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=854457</guid>
      <description>For a long time, tech companies have pitched pet cameras as a way to find out what your furball is up to when you're not home. Vex, a new robot companion launched at CES this week, takes that a step further: it follows your pet around, filming as it goes, and uses AI smarts to [&#8230;]</description>
    </item>
    <item>
      <title>Samsung lance son t&#233;l&#233;viseur Micro RGB de 130 pouces au CES 2026</title>
      <link>https://www.frandroid.com/marques/samsung/2927121_samsung-lance-son-televiseur-micro-rgb-de-130-pouces-au-ces-2026</link>
      <pubDate>Mon, 05 Jan 2026 06:32:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2927121_samsung-lance-son-televiseur-micro-rgb-de-130-pouces-au-ces-2026</guid>
      <description>
Le g&#233;ant cor&#233;en pr&#233;sente le plus grand &#233;cran Micro RGB jamais con&#231;u m&#234;lant nouvelle technologie d&#8217;affichage et design inspir&#233; des galeries d'art.
</description>
    </item>
    <item>
      <title>01net morning&#160;: test du Poco F8 Pro, Starlink abaisse ses satellites, les 20 voitures &#233;lectriques de 2026</title>
      <link>https://www.01net.com/actualites/01net-morning-test-du-poco-f8-pro-starlink-abaisse-ses-satellites-les-20-voitures-electriques-de-2026.html</link>
      <pubDate>Mon, 05 Jan 2026 06:30:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318009</guid>
      <description>Bonjour &#224; tous, voici la matinale de 01net ! Qu&#8217;avez-vous manqu&#233; ce week-end ? Retrouvez toute l&#8217;actu &#224; connaitre pour d&#233;marrer la semaine du bon pied !</description>
    </item>
    <item>
      <title>LG W6 : le retour du &#171; Wallpaper &#187; OLED, une feuille de 9 mm qui cache une b&#234;te de course</title>
      <link>https://www.frandroid.com/marques/lg/2927107_lg-w6-le-retour-du-wallpaper-oled-une-feuille-de-9-mm-qui-cache-une-bete-de-course</link>
      <pubDate>Mon, 05 Jan 2026 06:26:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lg/2927107_lg-w6-le-retour-du-wallpaper-oled-une-feuille-de-9-mm-qui-cache-une-bete-de-course</guid>
      <description>
C'est probablement le t&#233;l&#233;viseur le plus impressionnant visuellement de ce CES 2026. La LG OLED evo W6 reprend le concept du "papier peint" abandonn&#233; en 2020. En gros, c'est un &#233;cran de 77 ou 83 pouces coll&#233; au mur, sans aucun c&#226;ble visible, pilot&#233; par un bo&#238;tier sans fil.
</description>
    </item>
    <item>
      <title>Philips 55OLED910 : ce TV 4K Ambilight not&#233; 9/10 s&#8217;affiche &#224; prix cass&#233; en 2026</title>
      <link>https://www.frandroid.com/bons-plans/2925293_philips-55oled910-ce-tv-4k-ambilight-note-9-10-saffiche-a-prix-casse-en-2026</link>
      <pubDate>Mon, 05 Jan 2026 06:23:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2925293_philips-55oled910-ce-tv-4k-ambilight-note-9-10-saffiche-a-prix-casse-en-2026</guid>
      <description>
Ambilight sur quatre c&#244;t&#233;s, dalle META OLED tr&#232;s lumineuse, exp&#233;rience gaming ultra-fluide... Il ne manque pas grand-chose au TV Philips 55OLED910, que nous avons test&#233; et valid&#233;. En ce d&#233;but d'ann&#233;e, on le trouve &#224; 1 485 euros au lieu de 1 900 euros chez Ubaldi.
</description>
    </item>
    <item>
      <title>Samsung&#8217;s Freestyle+ projector hands-on: Much brighter and impressively adaptable</title>
      <link>https://www.engadget.com/home/home-theater/samsung-freestyle-plus-projector-hands-on-ces-2026-060840386.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 06:08:41 +0000</pubDate>
      <guid isPermaLink="false">979e311b-246f-440c-9a13-0c53516fdd88</guid>
      <description>Samsung announced its newest portable projector ahead of its First Look showcase at CES 2026, but you might have been a little confused as to what&#8217;s changed. The company says the Freestyle+ is nearly twice as bright as the 2022 Freestyle projector, rated at 230 ISO lumens, which was pretty underwhelming. The new Freestyle+ can output at 430 ISO lumens. If this is the first you&#8217;re hearing of ISO Lumens, it&#8217;s an internationally standardized rating for projectors, intended to standardize manufacturers' claims of brightness.
It still looks very similar to its predecessors, with 160 degrees of rota...</description>
    </item>
    <item>
      <title>Samsung brought an absolute beast of a 130-inch Micro RGB TV to CES 2026</title>
      <link>https://www.engadget.com/home/home-theater/samsung-brought-an-absolute-beast-of-a-130-inch-micro-rgb-tv-to-ces-2026-060245387.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 06:02:45 +0000</pubDate>
      <guid isPermaLink="false">ac9765a6-341f-4ffe-ab44-e8351f40962b</guid>
      <description>Amid endless AI hype and a guest visit from the CEO of Hartford Steam Boiler (?!), Samsung had a big surprise for us tonight at CES 2026: A massive 130-inch Micro RGB TV. It&#8217;s so large, it&#8217;s suspended by a large metal stand that surrounds the entire screen,  which also lets you tilt the screen just a bit. (For the Samsung diehards, it&#8217;s basically a reinvention of its &#8220;timeless gallery&#8221; stand from 2013.)  I imagine bringing this TV home would be like Bart Simpson adopting his beloved elephant Stampy: Your pets would be terrified, and your family would probably be annoyed at this television domi...</description>
    </item>
    <item>
      <title>These laws will change how you work in 2026</title>
      <link>https://www.fastcompany.com/91464809/these-laws-will-change-how-you-work-in-2026</link>
      <pubDate>2026-01-05T06:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464809/these-laws-will-change-how-you-work-in-2026</guid>
      <description>President Trump&#8217;s second term has already taken a toll on workers. But state legislation on paid leave, AI in hiring, and the minimum wage continues to help bolster workers&#8217; rights. 
With President Trump back in the White House, this year has brought a barrage of executive orders and edicts that target workers. Trump reduced the minimum wage for federal contractors, made major cuts to the Occupational Safety and Health Administration&#8212;whose express mission is to keep people safe in the workplace&#8212;and attempted to undermine collective bargaining rights for federal workers. He has also, of course,...</description>
    </item>
  </channel>
</rss>
