<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 31 Jan 2026 17:27:36 GMT</lastBuildDate>
    <item>
      <title>The Original &#8216;Saw&#8217; Team Is Leading the Franchise&#8217;s Return</title>
      <link>https://gizmodo.com/the-original-saw-team-is-leading-the-franchises-return-2000716238</link>
      <pubDate>Sat, 31 Jan 2026 17:25:38 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000716238</guid>
      <description>James Wan and Leigh Whannell are reuniting to revitalize 'Saw' and make it scary franchise again.</description>
    </item>
    <item>
      <title>RayNeo Air 3s Pro review: Getting my mind to adjust to the 201-inch screen simulation took a while - but once it did, these display glasses proved impressive</title>
      <link>https://www.techradar.com/pro/rayneo-air-3s-pro-smart-glasses-review</link>
      <pubDate>Sat, 31 Jan 2026 17:20:00 +0000</pubDate>
      <guid isPermaLink="false">iKjcgpezcCue4vwwAAfD8K</guid>
      <description>Are you missing the cinematic experience, huddling over a small screen on your daily commute? Then the Neo Air 3S Pro wearable display glasses are the solution. Simply plug them into your phone and suddenly you have access to a simulated 201-inch projection screen, all in a device no larger than a standard pair of spectacles.</description>
    </item>
    <item>
      <title>Heated Rivalry lived up to the hype &#8212; here are 9 other movies and shows I wish I&#8217;d watched sooner</title>
      <link>https://www.techradar.com/streaming/heated-rivalry-lived-up-to-the-hype-here-are-9-other-movies-and-shows-i-wish-id-watched-sooner</link>
      <pubDate>Sat, 31 Jan 2026 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">6d2fd3y2ZwoecgxPykqb</guid>
      <description>Heated Rivalry was just one of the many movies and shows that left a mark on me this month, alongside The Lord of the Rings and a heart-breaking romantic drama.</description>
    </item>
    <item>
      <title>Un oc&#233;an disparu refait surface : cette d&#233;couverte sur Mars bouleverse les scientifiques</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-ocean-disparu-refait-surface-cette-decouverte-mars-bouleverse-scientifiques-w2t8-130549/#xtor%3DRSS-8</link>
      <pubDate>Sat, 31 Jan 2026 18:00:00 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-ocean-disparu-refait-surface-cette-decouverte-mars-bouleverse-scientifiques-w2t8-130549/#xtor%3DRSS-8</guid>
      <description>En analysant les donn&#233;es sismiques collect&#233;es par les instruments de&#160;l'atterrisseur Insight de la Nasa&#160;il y a plusieurs ann&#233;es, des g&#233;ophysiciens pensent avoir trouv&#233; des preuves de l'existence d'un grand r&#233;servoir souterrain d'eau liquide dans la cro&#251;te de Mars, suffisamment pour remplir les...</description>
    </item>
    <item>
      <title>Test du Canon EOS R6 Mark III : la mise &#224; jour tant attendue d&#8217;un best-seller polyvalent</title>
      <link>https://www.frandroid.com/marques/canon/2955611_test-du-canon-eos-r6-mark-iii-la-mise-a-jour-tant-attendue-dun-best-seller-polyvalent</link>
      <pubDate>Sat, 31 Jan 2026 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/canon/2955611_test-du-canon-eos-r6-mark-iii-la-mise-a-jour-tant-attendue-dun-best-seller-polyvalent</guid>
      <description>
Cinq ans apr&#232;s la sortie du tr&#232;s appr&#233;ci&#233; EOS R6 Mark II, Canon est revenu fin 2025 avec l'un des bo&#238;tiers les plus attendus de l'ann&#233;e. Proposant une mise &#224; jour pens&#233;e comme un peaufinage plut&#244;t qu'une r&#233;volution, la marque affiche d&#233;sormais un nouvel &#233;tendard de polyvalence face &#224; la concurrence.
</description>
    </item>
    <item>
      <title>Outages, cable cuts, power failures, and more - 2025 was a rough year for the internet; these were its toughest moments</title>
      <link>https://www.techradar.com/pro/outages-cable-cuts-power-failures-and-more-2025-was-a-rough-year-for-the-internet-here-were-its-toughest-moments</link>
      <pubDate>Sat, 31 Jan 2026 16:35:00 +0000</pubDate>
      <guid isPermaLink="false">d77WTCUKotnuRWbxMAC7UL</guid>
      <description>Internet outages in 2025 were driven by power failures, weather damage, cable cuts, and routine technical faults across diverse regions.</description>
    </item>
    <item>
      <title>Fin des soldes : foncez sur cet aspirateur robot laveur Roborock &#224; -45 % con&#231;u pour les petits espaces</title>
      <link>https://www.frandroid.com/bons-plans/2961881_fin-des-soldes-foncez-sur-cet-aspirateur-robot-laveur-roborock-a-45-concu-pour-les-petits-espaces</link>
      <pubDate>Sat, 31 Jan 2026 16:32:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2961881_fin-des-soldes-foncez-sur-cet-aspirateur-robot-laveur-roborock-a-45-concu-pour-les-petits-espaces</guid>
      <description>
Roborock n'a plus rien &#224; prouver en mati&#232;re d'aspirateurs robots, qu'ils soient laveurs ou non. Surtout que ce mod&#232;le Qrevo Edge S5A not&#233; 8/10 s'affiche &#224; 549,99 euros au lieu de 999,99 euros sur Amazon.
</description>
    </item>
    <item>
      <title>HomeBoost&#8217;s app will show you where to save on your utility bills</title>
      <link>https://techcrunch.com/2026/01/31/homeboosts-app-will-show-you-where-to-save-on-your-utility-bills/</link>
      <pubDate>Sat, 31 Jan 2026 16:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3087940</guid>
      <description>The startup is partnering with utilities to help homeowners determine the best upgrades to cut their energy use.</description>
    </item>
    <item>
      <title>The AirPods 4 and Google&#8217;s 4K streamer are just two of this week&#8217;s best deals</title>
      <link>https://www.theverge.com/gadgets/871092/airpods-4-anc-google-tv-streamer-4k-deal-sale</link>
      <pubDate>2026-01-31T10:56:27-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=871092</guid>
      <description>Happy Saturday, folks! After a few weeks of middling deals, we&#8217;re starting see things pick up. Some of our favorite deals of the holiday season have returned in some fashion, making now a great time to pick up deal stalwarts like the AirPods 4 with ANC or Google&#8217;s TV Streamer (4K). We also stumbled upon [&#8230;]</description>
    </item>
    <item>
      <title>Hollywood Mourns the Surprise Death of Catherine O&#8217;Hara</title>
      <link>https://gizmodo.com/hollywood-mourns-the-sudden-death-of-catherine-ohara-2000716203</link>
      <pubDate>Sat, 31 Jan 2026 15:30:06 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000716203</guid>
      <description>Actors and directors remember Catherine O'Hara as one of the greats and gone too soon.</description>
    </item>
    <item>
      <title>Fitbit users have been given more time to migrate their accounts over to Google</title>
      <link>https://www.techradar.com/health-fitness/fitness-apps/fitbit-users-have-been-given-more-time-to-migrate-their-accounts-over-to-google</link>
      <pubDate>Sat, 31 Jan 2026 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">yHg67oL86VW55EuKgu9gtT</guid>
      <description>Fitbit logins were originally set to expire in 2025, but now you've got even more time to take care of the job.</description>
    </item>
  </channel>
</rss>
