<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 06 Jan 2026 09:31:39 GMT</lastBuildDate>
    <item>
      <title>LEGO Smart Play : explications techniques sur le fonctionnement des briques connect&#233;es</title>
      <link>https://www.frandroid.com/events/2930409_lego-smart-play-explications-techniques-sur-le-fonctionnement-des-briques-connectees</link>
      <pubDate>Tue, 06 Jan 2026 09:30:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/events/2930409_lego-smart-play-explications-techniques-sur-le-fonctionnement-des-briques-connectees</guid>
      <description>
On a vu les jolis vaisseaux Star Wars. Mais le vrai sujet n'est pas l&#224;. Le vrai sujet, c'est comment LEGO a r&#233;ussi &#224; faire entrer un ASIC, des capteurs et une batterie dans une brique standard de 2x4 tenons. Pas d'&#233;cran, pas de smartphone : c'est la technologie Smart Play.
</description>
    </item>
    <item>
      <title>10 ans de mises &#224; jour : Google et Qualcomm tapent fort pour prolonger la vie des &#233;crans des voitures</title>
      <link>https://www.frandroid.com/marques/google/2930189_10-ans-de-mises-a-jour-google-et-qualcomm-tapent-fort-pour-prolonger-la-vie-des-ecrans-des-voitures</link>
      <pubDate>Tue, 06 Jan 2026 09:26:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2930189_10-ans-de-mises-a-jour-google-et-qualcomm-tapent-fort-pour-prolonger-la-vie-des-ecrans-des-voitures</guid>
      <description>
De nombreux automobilistes craignent aujourd&#8217;hui d&#8217;acheter une voiture neuve, de peur que celle-ci devienne rapidement obsol&#232;te. Mais cela ne devrait plus arriver gr&#226;ce &#224; Google et Qualcomm, qui se sont associ&#233;s pour augmenter la dur&#233;e de vie de la partie logicielle de nos autos.
</description>
    </item>
    <item>
      <title>Is this the folding iPhone&amp;#8217;s creaseless display?</title>
      <link>https://www.theverge.com/news/856141/samsung-display-creaseless-panel-foldable-iphone-ces</link>
      <pubDate>2026-01-06T04:25:15-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=856141</guid>
      <description>Samsung Display showcased a new foldable OLED panel at CES that doesn't have a visible crease - something that currently blights every foldable phone on the market. This could be our first look at the panel used in the next generation of Samsung's Galaxy foldables and even the folding iPhone, given that Samsung Display is [&#8230;]</description>
    </item>
    <item>
      <title>On a pris en main les Dell XPS 14 et 16 (2026) : les anti-MacBook avec 43h d&#8217;autonomie et de l&#8217;OLED Tandem</title>
      <link>https://www.frandroid.com/marques/dell/2926213_prise-en-main-dell-xps-14-et-16-2026-lanti-macbook-est-enfin-de-retour-avec-43h-dautonomie-et-de-loled-tandem</link>
      <pubDate>Tue, 06 Jan 2026 09:20:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dell/2926213_prise-en-main-dell-xps-14-et-16-2026-lanti-macbook-est-enfin-de-retour-avec-43h-dautonomie-et-de-loled-tandem</guid>
      <description>
L'anti-MacBook est de retour, et il est &#233;nerv&#233;. Avec ses nouveaux XPS 14 et 16, Dell corrige les erreurs du pass&#233; (les touches tactiles ont disparu). Ils int&#232;grent aussi une dalle Tandem OLED in&#233;dite et promettent jusqu'&#224; 40 heures d'autonomie en vid&#233;o. J'ai pass&#233; un moment avec la version noire matte &#224; New York. 
</description>
    </item>
    <item>
      <title>Elementor just made it easier to improve website accessibility</title>
      <link>https://www.techradar.com/pro/website-building/elementor-just-made-it-easier-to-improve-website-accessibility</link>
      <pubDate>Tue, 06 Jan 2026 09:12:22 +0000</pubDate>
      <guid isPermaLink="false">PuZProarPyLkXz3GVpVUFQ</guid>
      <description>Just type in your website URL and get suggestions on how to have a more accessible website.</description>
    </item>
    <item>
      <title>Plus de place sur votre bureau&#160;? HP loge un PC complet dans un clavier</title>
      <link>https://www.01net.com/actualites/plus-place-sur-bureau-hp-pc-complet-dans-clavier.html</link>
      <pubDate>Tue, 06 Jan 2026 09:08:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318299</guid>
      <description>HP a con&#231;u un prototype d'ordinateur de bureau int&#233;gralement log&#233; dans le ch&#226;ssis d'un clavier m&#233;canique sans fil.</description>
    </item>
    <item>
      <title>Trois duplex en direct de Las Vegas et une tripot&#233;e de produits atypiques : rendez-vous ce soir pour un Unlock Talk</title>
      <link>https://www.frandroid.com/humanoid/emissions/2930261_trois-duplex-en-direct-de-las-vegas-et-une-tripotee-de-produits-atypiques-rendez-vous-ce-soir-pour-un-unlock-talk</link>
      <pubDate>Tue, 06 Jan 2026 09:06:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/emissions/2930261_trois-duplex-en-direct-de-las-vegas-et-une-tripotee-de-produits-atypiques-rendez-vous-ce-soir-pour-un-unlock-talk</guid>
      <description>
Direction Las Vegas et le Consumer Electronics Show (CES) pour la nouvelle ann&#233;e 2026. Comme &#224; l'accoutum&#233;e, Unlock Talk couvre le salon am&#233;ricain depuis Paris et la Ville du Vice, avec une &#233;mission Twitch sp&#233;cialement d&#233;di&#233;e o&#249; auront lieu pas moins de trois Duplex en direct.
</description>
    </item>
    <item>
      <title>Xpeng lance d&#233;j&#224; la fabrication en Europe de sa nouvelle voiture &#233;lectrique qui se recharge en 12 minutes : la P7+</title>
      <link>https://www.frandroid.com/marques/xpeng/2930165_xpeng-lance-deja-la-fabrication-en-europe-de-sa-nouvelle-voiture-electrique-qui-se-recharge-en-12-minutes-la-p7</link>
      <pubDate>Tue, 06 Jan 2026 09:04:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2930165_xpeng-lance-deja-la-fabrication-en-europe-de-sa-nouvelle-voiture-electrique-qui-se-recharge-en-12-minutes-la-p7</guid>
      <description>
D&#233;voil&#233;e en d&#233;cembre 2025, la nouvelle Xpeng P7+ vient de d&#233;marrer avec succ&#232;s sa production en Europe. La voiture &#233;lectrique chinoise d&#233;marre &#224; partir de 45 990 euros.
</description>
    </item>
    <item>
      <title>Non, NordVPN n&#8217;a pas &#233;t&#233; pirat&#233;</title>
      <link>https://www.01net.com/actualites/non-nordvpn-na-pas-ete-pirate.html</link>
      <pubDate>Tue, 06 Jan 2026 09:01:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318292</guid>
      <description>Un pirate pr&#233;tend avoir pirat&#233; NordVPN et vol&#233; des donn&#233;es confidentielles sur un serveur mal s&#233;curis&#233;. Le VPN lituanien d&#233;ment fermement toute cyberattaque. En v&#233;rit&#233;, le cybercriminel est tomb&#233; sur des donn&#233;es factices.</description>
    </item>
    <item>
      <title>AI could transform education . . . if universities stop responding like medieval guilds</title>
      <link>https://www.fastcompany.com/91464016/ai-transform-education-universities</link>
      <pubDate>2026-01-06T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464016/ai-transform-education-universities</guid>
      <description>Instead of asking how AI could improve education, institutions have obsessed over how to preserve surveillance.
When ChatGPT burst onto the scene, much of academia reacted not with curiosity but with fear. Not fear of what artificial intelligence might enable students to learn, but fear of losing control over how learning has traditionally been policed. Almost immediately, professors declared generative AI &#8220;poison,&#8221; warned that it would destroy critical thinking, and demanded outright bans across campuses, a reaction widely documented by Inside Higher Ed. Others rushed to revive oral exams and...</description>
    </item>
    <item>
      <title>Alexa+ launches on the web for everyone: Amazon takes on ChatGPT &#8212; here&#8217;s how to sign up</title>
      <link>https://www.techradar.com/ai-platforms-assistants/alexa-launches-on-the-web-for-everyone-amazon-takes-on-chatgpt-heres-how-to-sign-up</link>
      <pubDate>Tue, 06 Jan 2026 08:59:33 +0000</pubDate>
      <guid isPermaLink="false">3W3cS3zYHCxdP8pbyxfKeb</guid>
      <description>Amazon&#8217;s Alexa+ has arrived on the web, offering a full-featured AI assistant focused on organizing daily life and competing with tools like ChatGPT.</description>
    </item>
    <item>
      <title>This free feature helps make stolen Bosch e-bikes unsellable</title>
      <link>https://www.theverge.com/tech/856120/this-free-feature-helps-make-stolen-bosch-e-bikes-unsellable</link>
      <pubDate>2026-01-06T03:57:59-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=856120</guid>
      <description>Stolen electric bikes built around Bosch motors will be harder to sell, service, and ride at the end of January. That's when Bosch is rolling a new digital theft feature that lets owners mark the bike as stolen in the Bosch Flow app - no subscription required. Bosch rolled out a similar feature for expensive [&#8230;]</description>
    </item>
    <item>
      <title>Avec ses nouveaux processeurs, AMD annonce des performances qui d&#233;passent Intel sur Windows 11</title>
      <link>https://www.frandroid.com/marques/amd/2928843_ryzen-ai-400-tout-savoir-sur-les-nouvelles-puces-amd-qui-vont-booster-vos-prochains-pc-portables</link>
      <pubDate>Tue, 06 Jan 2026 08:57:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amd/2928843_ryzen-ai-400-tout-savoir-sur-les-nouvelles-puces-amd-qui-vont-booster-vos-prochains-pc-portables</guid>
      <description>
AMD d&#233;voile au CES une nouvelle gamme de processeurs pour PC portables avec les puces Ryzen AI 400. Une &#233;volution &#224; petits pas de l'architecture actuelle avant l'arriv&#233;e de Zen 6.
</description>
    </item>
    <item>
      <title>Microsoft Edge ou Copilot ? Le navigateur change de look et vous allez avoir du mal &#224; faire la diff&#233;rence</title>
      <link>https://www.frandroid.com/marques/microsoft/2930173_microsoft-edge-ou-copilot-le-navigateur-change-de-look-et-vous-allez-avoir-du-mal-a-faire-la-difference</link>
      <pubDate>Tue, 06 Jan 2026 08:48:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2930173_microsoft-edge-ou-copilot-le-navigateur-change-de-look-et-vous-allez-avoir-du-mal-a-faire-la-difference</guid>
      <description>
Le navigateur internet de Microsoft adopte une interface calqu&#233;e sur l'application Microsoft Copilot. 
</description>
    </item>
    <item>
      <title>Ce nouveau clavier HP cache en r&#233;alit&#233; un PC complet</title>
      <link>https://www.frandroid.com/marques/2922585_ce-nouveau-clavier-hp-cache-en-realite-un-pc-complet</link>
      <pubDate>Tue, 06 Jan 2026 08:41:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2922585_ce-nouveau-clavier-hp-cache-en-realite-un-pc-complet</guid>
      <description>
HP frappe un grand coup en d&#233;voilant l&#8217;EliteBoard G1a. Sous ses airs de simple clavier fin, cette machine cache en r&#233;alit&#233; un v&#233;ritable PC Copilot+ &#224; la fiche technique semblables aux ultra portables du march&#233;.
</description>
    </item>
    <item>
      <title>Amazon brade &#224; -30 % cette batterie externe Anker 20 000 mAh qui peut recharger 4 fois un iPhone 17</title>
      <link>https://www.frandroid.com/bons-plans/2929249_amazon-brade-a-30-cette-batterie-externe-anker-20-000-mah-qui-peut-recharger-4-fois-un-iphone-17</link>
      <pubDate>Tue, 06 Jan 2026 08:33:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2929249_amazon-brade-a-30-cette-batterie-externe-anker-20-000-mah-qui-peut-recharger-4-fois-un-iphone-17</guid>
      <description>
La batterie externe Anker Zolo de 20&#8239;000&#8239;mAh profite d&#8217;une belle promotion &#224; 33&#8239;euros au lieu de 45&#8239;euros sur Amazon. Un accessoire compact, mais puissant, capable de redonner vie &#224; plusieurs appareils gr&#226;ce &#224; ses 4 ports.
</description>
    </item>
    <item>
      <title>Amazon lance Alexa+ sur le Web pour d&#233;fier ChatGPT, Gemini et consorts</title>
      <link>https://www.01net.com/actualites/amazon-lance-alexa-web-defier-chatgpt-gemini-consorts.html</link>
      <pubDate>Tue, 06 Jan 2026 08:31:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318285</guid>
      <description>Avec Alexa.com, Amazon lance finalement Alexa+ sur le Web. Avec ce nouveau service accessible depuis un navigateur, le g&#233;ant am&#233;ricain cherche &#224; concurrencer les cadors de l'IA, comme  ChatGPT et Gemini.</description>
    </item>
    <item>
      <title>OpenAI's rumored acquisition plans for Pinterest provoke fury among some users</title>
      <link>https://www.techradar.com/ai-platforms-assistants/openais-rumored-acquisition-plans-for-pinterest-provoke-fury-among-some-users</link>
      <pubDate>Tue, 06 Jan 2026 08:19:56 +0000</pubDate>
      <guid isPermaLink="false">3VNhPs7VefExHSPJFtHeS4</guid>
      <description>A speculative report suggesting OpenAI might acquire Pinterest ignited a consumer backlash among Pinterest users.</description>
    </item>
    <item>
      <title>Google a tu&#233; une des fonctionnalit&#233;s les plus pratiques et les moins connues de Gmail</title>
      <link>https://www.frandroid.com/marques/google/2930199_google-a-tue-une-des-fonctionnalites-les-plus-pratiques-et-les-moins-connues-de-gmail</link>
      <pubDate>Tue, 06 Jan 2026 08:18:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2930199_google-a-tue-une-des-fonctionnalites-les-plus-pratiques-et-les-moins-connues-de-gmail</guid>
      <description>
Depuis le d&#233;but du mois de janvier 2026, Google a d&#233;sactiv&#233; la prise en charge du protocole&#160;POP3 sur Gmail. De quoi r&#233;duire la capacit&#233; du service &#224; r&#233;cup&#233;rer les courriers venant d&#8217;autres adresses mail.
</description>
    </item>
    <item>
      <title>Asus surprend tout le monde avec un PC dessin&#233; par le cr&#233;ateur de Metal Gear Solid &#224; un prix ind&#233;cent</title>
      <link>https://www.frandroid.com/marques/asus/2924825_asus-surprend-tout-le-monde-avec-un-pc-dessine-par-le-createur-de-metal-gear-solid</link>
      <pubDate>Tue, 06 Jan 2026 08:16:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/asus/2924825_asus-surprend-tout-le-monde-avec-un-pc-dessine-par-le-createur-de-metal-gear-solid</guid>
      <description>
Asus d&#233;voile une collaboration inattendue avec le cr&#233;ateur de jeux vid&#233;o embl&#233;matique Hideo Kojima et son studio Kojima Productions. R&#233;sultat : un PC en &#233;dition limit&#233;e con&#231;u par le designer de Metal Gear Solid.
</description>
    </item>
    <item>
      <title>AMD d&#233;voile le rempla&#231;ant du tr&#232;s populaire 9800X3D</title>
      <link>https://www.frandroid.com/marques/amd/2929153_amd-officialise-le-ryzen-7-9850x3d-ce-qui-change-vraiment-sur-ce-nouveau-processeur-de-jeu</link>
      <pubDate>Tue, 06 Jan 2026 08:15:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amd/2929153_amd-officialise-le-ryzen-7-9850x3d-ce-qui-change-vraiment-sur-ce-nouveau-processeur-de-jeu</guid>
      <description>
Le Ryzen 7 9850X3D est officiel, mais le nouveau processeur de bureau d'AMD n'apporte finalement que tr&#232;s peu de choses par rapport au 9800X3D.
</description>
    </item>
    <item>
      <title>Pourquoi les Mac et iPad r&#233;cents peuvent maintenant aller plus vite en Wi-Fi</title>
      <link>https://www.01net.com/actualites/pourquoi-les-mac-et-ipad-recents-peuvent-maintenant-aller-plus-vite-en-wi-fi.html</link>
      <pubDate>Tue, 06 Jan 2026 08:01:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318277</guid>
      <description>Gr&#226;ce &#224; une mise &#224; jour logicielle distribu&#233;e dans iPadOS 26.2 et macOS 26.2, les utilisateurs d'iPad et de Mac r&#233;cents b&#233;n&#233;ficient depuis peu d'une connexion Wi-Fi plus rapide, dans les conditions optimales.</description>
    </item>
    <item>
      <title>I&#8217;ve worn the all-new Shokz open earbuds for 4 days and the &#8216;noise reduction&#8217; is so good, I forget they&#8217;re open-ear</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/ive-worn-the-all-new-shokz-open-earbuds-for-4-days-and-the-noise-reduction-is-so-good-i-forget-theyre-open-ear</link>
      <pubDate>Tue, 06 Jan 2026 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">KZVw3djRKPuTbAwTsyq8QH</guid>
      <description>Head-tracked spatial audio and ANC in open earbuds? Yes, you can, with the latest flagship offering from Shokz</description>
    </item>
    <item>
      <title>OpenFit Pro : les &#233;couteurs &#224; oreilles libres qui veulent r&#233;inventer la r&#233;duction de bruit et l&#8217;autonomie pour un usage non-stop</title>
      <link>https://www.frandroid.com/marques/shokz/2926421_openfit-pro-le-casque-a-oreilles-libres-qui-veut-reinventer-la-reduction-de-bruit-et-lautonomie-pour-un-usage-non-stop</link>
      <pubDate>Tue, 06 Jan 2026 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/shokz/2926421_openfit-pro-le-casque-a-oreilles-libres-qui-veut-reinventer-la-reduction-de-bruit-et-lautonomie-pour-un-usage-non-stop</guid>
      <description>
La marque Shokz profite du salon du CES 2026 pour annoncer la commercialisation d&#8217;un nouveau casque. Baptis&#233; OpenFit Pro, il a pour ambition d&#8217;apporter un son plus riche, une r&#233;duction de bruit active in&#233;dite pour ce format et une grande autonomie, tout en restant confortable sur de longues journ&#233;es d&#8217;&#233;coute.
</description>
    </item>
    <item>
      <title>Mammotion d&#233;voile son nouveau robot tondeuse truff&#233; de technologie au CES 2026</title>
      <link>https://www.01net.com/actualites/mammotion-devoile-son-nouveau-robot-tondeuse-truffe-de-technologie-au-ces-2026.html</link>
      <pubDate>Tue, 06 Jan 2026 08:00:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317965</guid>
      <description>Mammotion d&#233;voile au CES 2026 le Luba 3 AWD, un robot-tondeuse haut de gamme qui veut bousculer le march&#233; avec son syst&#232;me de navigation Tri-Fusion m&#234;lant LiDAR, IA et guidage satellite. Capable de g&#233;rer jusqu&#8217;&#224; 10 000 m&#178; selon les versions, il s&#8217;accompagne de deux mod&#232;les plus abordables, les Luba Mini 2 AWD et Yuka Mini 2, pour couvrir tous les types de jardins....</description>
    </item>
    <item>
      <title>CES Live Blog, Day 2: More of the Coolest Tech From Las Vegas</title>
      <link>https://www.wired.com/live/ces-2026-live-blog/</link>
      <pubDate>Tue, 06 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">6957fd7ea2ad6e107579ae74</guid>
      <description>Read our live updates from CES 2026 to see the latest consumer gadgetry in all of its chatbot-enabled, sensor-packed, AI-infused glory.</description>
    </item>
    <item>
      <title>These open-ear buds actually have decent noise reduction</title>
      <link>https://www.theverge.com/tech/853290/shokz-open-fit-pro-hands-on-ces-2026-headphones-wearables</link>
      <pubDate>2026-01-06T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=853290</guid>
      <description>My biggest gripe about open-ear buds is that they're rotten for loud city commutes. Cue a pedantic audiophile pointing out that the whole premise of open-ear buds is to not block out sound. Yes, yes. But the unfortunate truth is that often means if you want open-ear buds for one situation, you'll have to buy [&#8230;]</description>
    </item>
    <item>
      <title>CES 2026: Shokz' new earbuds effectively reduce noise while keeping your ears open</title>
      <link>https://www.engadget.com/audio/headphones/ces-2026-shokz-new-earbuds-effectively-reduce-noise-while-keeping-your-ears-open-080000996.html?src=rss</link>
      <pubDate>Tue, 06 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">c7276387-942e-43c9-bbe7-15cc23735bfb</guid>
      <description>Shokz may have made its name with bone-conduction headsets, but the company has also built open-style earbuds in recent years. At CES 2026, the company is debuting its most recent model, the OpenFit Pro, which combines effective noise reduction with Dolby Atmos support in a premium set of wireless buds. As the name suggests, these sit outside of your ears, secured by an over-the-ear hook, so that you can stay in tune with your surroundings at all times. 
To me, the main appeal of the OpenFit Pro is the new Noise Reduction Mode that acts as a bit of active noise cancellation (ANC) for the open ...</description>
    </item>
    <item>
      <title>Mova muscle son jeu avec deux tondeuses robots 4&#215;4 et une toute nouvelle gamme moins cher</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/robots-tondeuses/2926989_mova-muscle-son-jeu-avec-deux-tondeuses-robots-4x4-et-une-toute-nouvelle-gamme-moins-cher</link>
      <pubDate>Tue, 06 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/robots-tondeuses/2926989_mova-muscle-son-jeu-avec-deux-tondeuses-robots-4x4-et-une-toute-nouvelle-gamme-moins-cher</guid>
      <description>
Mova profite du CES 2026 pour lever le voile sur deux nouveaux robots tondeuses tout-terrain, tout en officialisant les tarifs et la disponibilit&#233; des gammes LiDAX Ultra et ViAX d&#233;j&#224; aper&#231;ues &#224; l'IFA.
</description>
    </item>
    <item>
      <title>Mammotion renouvelle sa gamme et s&#8217;occupe enfin de couper les bordures &#224; votre place</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/robots-tondeuses/2926353_mammotion-renouvelle-sa-gamme-et-soccupe-enfin-de-couper-les-bordures-a-votre-place</link>
      <pubDate>Tue, 06 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/robots-tondeuses/2926353_mammotion-renouvelle-sa-gamme-et-soccupe-enfin-de-couper-les-bordures-a-votre-place</guid>
      <description>
Le trublion des robots tondeuses renouvelle sa gamme embl&#233;matique avec l'annonce de trois nouveaux mod&#232;les. Bien que ceux-ci soient des &#233;volutions de la gamme existante, ils apportent un lot d'am&#233;liorations, &#224; la fois en termes de navigation, mais &#233;galement au niveau des performances de tonte.
</description>
    </item>
    <item>
      <title>This desktop charger turns your iPhone into a robotic AI assistant</title>
      <link>https://www.theverge.com/tech/856077/yoona-deskmate-iphone-robot-companion-ai-assistant</link>
      <pubDate>2026-01-06T02:59:19-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=856077</guid>
      <description>CES is packed with AI companions and assistant robots this year, but the DeskMate from Loona is a clever take on the idea: it's a desktop charging hub, with three USB-C ports, one USB-A, and a MagSafe pad, that automatically activates an AI companion app when you attach your iPhone to the wireless charger. What's [&#8230;]</description>
    </item>
    <item>
      <title>Un PC gaming puissant et pas cher&#160;: Alienware veut changer la fa&#231;on dont on joue sur laptop</title>
      <link>https://www.01net.com/actualites/un-pc-gaming-puissant-et-pas-cher-alienware-veut-changer-la-facon-dont-on-joue-sur-laptop.html</link>
      <pubDate>Tue, 06 Jan 2026 07:55:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317955</guid>
      <description>Comment toucher plus de gamers ? En rendant les PC de jeu plus accessibles. C&#8217;est ce que voudrait faire Alienware avec un premier laptop gaming abordable, d&#232;s cette ann&#233;e.</description>
    </item>
    <item>
      <title>Garmin veut surveiller votre nutrition avec son appli</title>
      <link>https://www.01net.com/actualites/garmin-veut-maintenant-surveiller-votre-nutrition-avec-son-appli.html</link>
      <pubDate>Tue, 06 Jan 2026 07:39:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318294</guid>
      <description>L&#8217;application Garmin Connect int&#232;gre &#224; pr&#233;sent un syst&#232;me de suivi nutritionnel pour vous aider &#224; enregistrer vos repas et compter vos calories. L&#8217;option n&#8217;est toutefois accessible qu&#8217;avec un abonnement Garmin Connect Plus.</description>
    </item>
  </channel>
</rss>
