<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 14 Dec 2025 20:26:46 GMT</lastBuildDate>
    <item>
      <title>&#8216;Fate of the Republic&#8217; Will (Probably?) Be Out Before Decade&#8217;s End</title>
      <link>https://gizmodo.com/fate-of-the-republic-will-probably-be-out-before-decades-end-2000699519</link>
      <pubDate>Sun, 14 Dec 2025 19:50:42 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000699519</guid>
      <description>If Arcanauts has its way, it won't be too long of a wait for 'Fate of the Old Republic'...but you're gonna do some waiting regardless.</description>
    </item>
    <item>
      <title>Toshiba wants to launch a 55TB hard drive by 2030, 40TB model set to appear in 2026, new slides show</title>
      <link>https://www.techradar.com/pro/toshiba-wants-to-launch-a-55tb-hard-drive-by-2030-40tb-model-set-to-appear-in-2026-new-slides-show</link>
      <pubDate>Sun, 14 Dec 2025 19:15:00 +0000</pubDate>
      <guid isPermaLink="false">Ln33SjvzwRd5n55bF98MRa</guid>
      <description>Toshiba&#8217;s new roadmap shows a 40TB hard drive arriving in 2026 and a push toward 55TB models by 2030 as it advances platter stacking technologies.</description>
    </item>
    <item>
      <title>Kindle deals are back at Amazon and arrive before Christmas - shop deals form $89.99</title>
      <link>https://www.techradar.com/seasonal-sales/kindle-deals-are-back-at-amazon-and-arrive-before-christmas-shop-deals-form-usd89-99</link>
      <pubDate>Sun, 14 Dec 2025 19:13:08 +0000</pubDate>
      <guid isPermaLink="false">XdaWgoM9fyyFqG4ZXan4hN</guid>
      <description>Kindle e-reader deals are back at Amazon and arrive before Christmas &#8212; here are the best deals, with up to 20% in savings and prices starting at just $89.99.</description>
    </item>
    <item>
      <title>Kindle's in-book AI assistant can answer all your questions without spoilers</title>
      <link>https://www.engadget.com/ai/kindles-in-book-ai-assistant-can-answer-all-your-questions-without-spoilers-190609961.html?src=rss</link>
      <pubDate>Sun, 14 Dec 2025 19:06:09 +0000</pubDate>
      <guid isPermaLink="false">84343680-4f8d-4c70-b4a6-bd6ebcfb5a88</guid>
      <description>If you're several chapters into a novel and forgot who a character was, Amazon is hoping its new Kindle feature will jog your memory without ever having to put the e-reader down. This feature, called Ask this Book, was announced during Amazon's hardware event in September, but is finally available for US users on the Kindle iOS app.
According to Amazon, the feature can currently be found on thousands of English best-selling Kindle titles and "only reveals information up to your current reading position" for spoiler-free responses. To use it, you can highlight a passage in any book you've bough...</description>
    </item>
    <item>
      <title>Voici Ramses : une mission historique pour &#233;tudier l&#8217;ast&#233;ro&#239;de qui va fr&#244;ler la Terre &#224; seulement 32 000 km en 2029 (interview)</title>
      <link>https://www.futura-sciences.com/sciences/actualites/asteroide-voici-ramses-mission-historique-etudier-asteroide-va-froler-terre-seulement-32-000-km-2029-interview-128501/#xtor%3DRSS-8</link>
      <pubDate>Sun, 14 Dec 2025 20:03:50 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/asteroide-voici-ramses-mission-historique-etudier-asteroide-va-froler-terre-seulement-32-000-km-2029-interview-128501/#xtor%3DRSS-8</guid>
      <description>Pr&#233;parez-vous &#224; une aventure spatiale incroyable avec la mission Ramses, fruit d'une collaboration entre l'ESA&#160;et la Jaxa. Lanc&#233;e en 2028, cette mission se penchera sur l'ast&#233;ro&#239;de Apophis, visible &#224; l&#8217;&#339;il nu depuis l&#8217;Europe et l&#8217;Afrique, qui nous offrira un spectacle inoubliable lors de son...</description>
    </item>
    <item>
      <title>Test Lexman Cam&#233;ra solaire sans fil de Leroy Merlin : difficile de faire plus complet &#224; moins de 80 euros</title>
      <link>https://www.frandroid.com/produits-android/2837739_test-lexman-camera-solaire-sans-fil-de-leroy-merlin-difficile-de-faire-plus-complet-a-moins-de-80-euros</link>
      <pubDate>Sun, 14 Dec 2025 19:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2837739_test-lexman-camera-solaire-sans-fil-de-leroy-merlin-difficile-de-faire-plus-complet-a-moins-de-80-euros</guid>
      <description>
Leroy Merlin renforce sa gamme de produits connect&#233;s. L'occasion pour nous de proposer un test complet de la Lexman Cam&#233;ra solaire de vid&#233;osurveillance sans fil int/ext.
</description>
    </item>
    <item>
      <title>Absynth is back and weirder than ever after 16 years</title>
      <link>https://www.theverge.com/entertainment/844432/native-instruments-absynth-6-mpe-brian-eno</link>
      <pubDate>2025-12-14T14:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=844432</guid>
      <description>Absynth is something of a cult classic in the soft synth world. It was originally released in 2000, and quickly found an audience among the growing cadre of people making music on computers. But its last major update, Absynth 5, was released in 2009, and Native Instruments officially discontinued the instrument in 2022, citing a [&#8230;]</description>
    </item>
    <item>
      <title>You've gotta see the festive app guaranteed to inject hilarity into your Christmas</title>
      <link>https://www.techradar.com/computing/websites-apps/elfyourself</link>
      <pubDate>Sun, 14 Dec 2025 19:00:00 +0000</pubDate>
      <guid isPermaLink="false">iadqk6vEw5RKyNMEgk8vWo</guid>
      <description>Homescreen Heroes: ElfYourself lets you star in up to 27 elf-themed dance videos</description>
    </item>
    <item>
      <title>Build vs buy is dead &#8212; AI just killed it</title>
      <link>https://venturebeat.com/ai/build-vs-buy-is-dead-ai-just-killed-it</link>
      <pubDate>Sun, 14 Dec 2025 19:00:00 GMT</pubDate>
      <guid isPermaLink="false">ZHrScZBXGLImHCsMnLvbR</guid>
      <description>Picture this: You're sitting in a conference room, halfway through a vendor pitch. The demo looks solid, and pricing fits nicely under budget. The timeline seems reasonable too. Everyone&#8217;s nodding along.You&#8217;re literally minutes away from saying yes.Then someone from your finance team walks in. They see the deck and frown. A few minutes later, they shoot you a message on Slack: &#8220;Actually, I threw together a version of this last week. Took me 2 hours in Cursor. Wanna take a look?&#8221;Wait&#8230; what?This person doesn't code. You know for a fact they've never written a line of JavaScript in their entire l...</description>
    </item>
    <item>
      <title>Grok Is Glitching and Spewing Misinformation About The Bondi Beach Shooting</title>
      <link>https://gizmodo.com/grok-is-glitching-and-spewing-misinformation-about-the-bondi-beach-shooting-2000699533</link>
      <pubDate>Sun, 14 Dec 2025 18:45:32 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000699533</guid>
      <description>Grok has lost it. Again.</description>
    </item>
    <item>
      <title>La nouvelle cam&#233;ra Ring Indoor Plus d&#8217;Amazon qui filme en 2K perd d&#233;j&#224; 33 % de son prix</title>
      <link>https://www.frandroid.com/bons-plans/2904773_la-nouvelle-camera-ring-indoor-plus-damazon-qui-filme-en-2k-perd-deja-33-de-son-prix</link>
      <pubDate>Sun, 14 Dec 2025 18:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2904773_la-nouvelle-camera-ring-indoor-plus-damazon-qui-filme-en-2k-perd-deja-33-de-son-prix</guid>
      <description>
Amazon renouvelle sa cam&#233;ra Ring con&#231;ue pour filmer en int&#233;rieur : un mod&#232;le am&#233;lior&#233; pour obtenir un meilleur rendu et dont le prix est actuellement plus accessible gr&#226;ce &#224; cette remise de 33 %.  
</description>
    </item>
    <item>
      <title>#FrandroidOffreMoi un vid&#233;oprojecteur Xgimi MoGo 4</title>
      <link>https://www.frandroid.com/marques/xgimi/2906495_frandroidoffremoi-un-videoprojecteur-xgimi-mogo-4</link>
      <pubDate>Sun, 14 Dec 2025 18:40:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xgimi/2906495_frandroidoffremoi-un-videoprojecteur-xgimi-mogo-4</guid>
      <description>
Vous pouvez gagner un vid&#233;oprojecteur Xgimi MoGo 4 (LED) &#224; l'occasion de notre calendrier de l'Avent et concours #FrandroidOffreMoi. Voici le 14e lot !
</description>
    </item>
  </channel>
</rss>
