<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 20 Jan 2026 13:00:40 GMT</lastBuildDate>
    <item>
      <title>Welcome to the &#8216;AI slop&#8217; security crisis &#8211; these 198 iOS apps were found leaking private chats and user locations</title>
      <link>https://www.techradar.com/computing/cyber-security/welcome-to-the-ai-slop-security-crisis-these-198-ios-apps-were-found-leaking-private-chats-and-user-locations</link>
      <pubDate>Tue, 20 Jan 2026 12:56:40 +0000</pubDate>
      <guid isPermaLink="false">jufdkJb29sW2TppiYZmrMS</guid>
      <description>Apps with over 20 million users have exposed 380 million private chat messages into the wild, research shows.</description>
    </item>
    <item>
      <title>The DJI 4K Mini is 'the best budget drone for beginners' &#8212; and right now it's on sale for a record-low price at Amazon</title>
      <link>https://www.techradar.com/cameras/drones/the-dji-4k-mini-is-the-best-budget-drone-for-beginners-and-right-now-its-on-sale-for-a-record-low-price-at-amazon</link>
      <pubDate>Tue, 20 Jan 2026 12:32:29 +0000</pubDate>
      <guid isPermaLink="false">iBmrDq8vANSyzYyAaucmdc</guid>
      <description>DJI's 4K Mini is our favorite budget drone for beginners and experienced pilots alike &#8211; here's why today's record-low deal at Amazon is so good.</description>
    </item>
    <item>
      <title>Ingram Micro reveals ransomware attack hit 42,000 people - here's how to find out more</title>
      <link>https://www.techradar.com/pro/security/ingram-micro-reveals-ransomware-attack-hit-42-000-people-heres-how-to-find-out-more</link>
      <pubDate>Tue, 20 Jan 2026 12:30:00 +0000</pubDate>
      <guid isPermaLink="false">fFPHM9HmHzENKiVxN8Xq4V</guid>
      <description>SafePay is claiming responsibility for July 2025 attack which forced Ingram Micro to shut down parts of its IT network.</description>
    </item>
    <item>
      <title>Netflix revises Warner Bros. bid to an all-cash offer</title>
      <link>https://www.theverge.com/news/863318/netflix-warner-bros-discovery-merger-revision-cash-deal</link>
      <pubDate>2026-01-20T07:26:10-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=863318</guid>
      <description>Netflix has updated the acquisition terms for its Warner Bros. Discovery offer to an all-cash deal, replacing its initial $82.7 billion cash and stock agreement. The changes are designed to expedite the sale of WBD studios and streaming businesses, following repeated attempts by rival bidder Paramount to pressure shareholders into accepting its own $108 billion [&#8230;]...</description>
    </item>
    <item>
      <title>An impressive Spotify audiobook upgrade could be on the way, and as a non-reader, I&#8217;m dying to give it a go</title>
      <link>https://www.techradar.com/audio/spotify/an-impressive-spotify-audiobook-upgrade-could-be-on-the-way-and-as-a-non-reader-im-dying-to-give-it-a-go</link>
      <pubDate>Tue, 20 Jan 2026 12:24:22 +0000</pubDate>
      <guid isPermaLink="false">3E2ktRqJTzPPoa5q9365ve</guid>
      <description>Do you switch between physical and digital books a lot? This new Spotify audiobook feature could be a lifesaver</description>
    </item>
    <item>
      <title>Cette borne d&#8217;arcade Street Fighter baisse son prix de 30 % pendant les soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2948725_cette-borne-darcade-street-fighter-baisse-son-prix-de-30-pendant-les-soldes-dhiver</link>
      <pubDate>Tue, 20 Jan 2026 12:17:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2948725_cette-borne-darcade-street-fighter-baisse-son-prix-de-30-pendant-les-soldes-dhiver</guid>
      <description>
Ador&#233;es par les nostalgiques et adeptes du r&#233;trogaming, les bornes d'arcade de la marque am&#233;ricaine Arcade 1 Up ont le vent en poupe. La plus int&#233;ressante du moment, c'est celle &#224; l'effigie des combattants de Street Fighter, avec 14 jeux int&#233;gr&#233;s, que l'on trouve &#224; 419,99 euros au lieu de 599,99 euros sur Amazon pendant les soldes d'hiver.
</description>
    </item>
    <item>
      <title>The Morning After: Elon Musk wants a $134 billion payout from OpenAI and Microsoft</title>
      <link>https://www.engadget.com/general/the-morning-after-engadget-newsletter-121509123.html?src=rss</link>
      <pubDate>Tue, 20 Jan 2026 12:15:09 +0000</pubDate>
      <guid isPermaLink="false">02dd179d-7ad8-497e-acda-c06919c85308</guid>
      <description>Part of a lawsuit accusing OpenAI of abandoning its non-profit status claims Musk is owed anywhere from $79 billion to $134 billion in damages for the &#8220;wrongful gains&#8221; of OpenAI and Microsoft.
Musk claims in the filing that he&#8217;s entitled to a chunk of the company&#8217;s recent $500 billion valuation, after contributing $38 million in &#8220;seed funding&#8221; during the AI company&#8217;s early years. It wasn&#8217;t just money &#8212; according to the filing, Musk helped advise on key employee recruitment, introductions with business contacts and startup advice.
If this sounds familiar, it&#8217;s because the lawsuit dates back to ...</description>
    </item>
    <item>
      <title>Droits de douane : une &#233;tude r&#233;v&#232;le que les Am&#233;ricains paient 96 % de la facture</title>
      <link>https://www.frandroid.com/culture-tech/politique/2948955_droits-de-douane-une-etude-revele-que-les-americains-paient-96-de-la-facture</link>
      <pubDate>Tue, 20 Jan 2026 12:12:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/politique/2948955_droits-de-douane-une-etude-revele-que-les-americains-paient-96-de-la-facture</guid>
      <description>
Faire payer les nations &#233;trang&#232;res pour acc&#233;der au march&#233; am&#233;ricain. Une nouvelle &#233;tude de l'Institut de Kiel vient de tomber, et les chiffres sont sans appel. Sur les 200 milliards de dollars de recettes douani&#232;res, ce sont les consommateurs am&#233;ricains qui r&#232;glent 96 % de la note.
</description>
    </item>
    <item>
      <title>Sony is handing control of its Bravia TV business to China's TCL</title>
      <link>https://www.engadget.com/home/home-theater/sony-is-handing-control-of-its-bravia-tv-business-to-chinas-tcl-120957252.html?src=rss</link>
      <pubDate>Tue, 20 Jan 2026 12:10:04 +0000</pubDate>
      <guid isPermaLink="false">41a362d6-d1bd-41a8-9337-2b4c1d5991e2</guid>
      <description>Sony is ceding control of its Bravia TV brand to China's TCL as part of a new "strategic partnership," the companies announced in a joint press release. The Japanese electronics giant plans to sell a majority 51 percent stake in its home entertainment arm to TCL, while retaining a 49 percent share. The joint venture is set to start operations in April 2027, pending regulatory and other approvals.&#160;
The new combined business will sell TVs carrying Sony and Bravia branding while using TCL's display technology. The partnership will also leverage Sony's picture and audio expertise, supply chain man...</description>
    </item>
    <item>
      <title>Cette batterie externe confirme la meilleure nouveaut&#233; des Samsung Galaxy S26</title>
      <link>https://www.frandroid.com/marques/samsung/2948941_cette-batterie-externe-confirme-la-meilleure-nouveaute-des-samsung-galaxy-s26</link>
      <pubDate>Tue, 20 Jan 2026 12:03:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2948941_cette-batterie-externe-confirme-la-meilleure-nouveaute-des-samsung-galaxy-s26</guid>
      <description>
Le Galaxy S26 aura bien le Qi2 (le MagSafe d'Android). La preuve ? Cette nouvelle batterie externe officielle Samsung qui vient de fuiter.
</description>
    </item>
    <item>
      <title>I&#8217;ve disabled this iOS 26 Apple Intelligence feature, and you probably should too</title>
      <link>https://www.techradar.com/phones/iphone/ive-disabled-this-ios-26-apple-intelligence-feature-and-you-probably-should-too</link>
      <pubDate>Tue, 20 Jan 2026 11:59:22 +0000</pubDate>
      <guid isPermaLink="false">CWrvM8RY2ipFqTwFM6qSUd</guid>
      <description>Even in iOS 26, notification summaries still get things wrong and miss important details, so here's how to turn them off.</description>
    </item>
    <item>
      <title>Sony unveils a limited-edition Marathon DualSense controller and Pulse Elite headset ahead of the game's March release</title>
      <link>https://www.techradar.com/gaming/sony-unveils-a-limited-edition-marathon-dualsense-controller-and-pulse-elite-headset-ahead-of-the-games-march-release</link>
      <pubDate>Tue, 20 Jan 2026 11:51:42 +0000</pubDate>
      <guid isPermaLink="false">B9M9LTQZ93YXjmCe8UphVB</guid>
      <description>Sony has revealed a limited-edition DualSense wireless controller and Pulse Elite wireless headset inspired by Marathon, and they'll launch the same day as the game.</description>
    </item>
    <item>
      <title>I tested Blink&#8217;s new Mini 2K+ camera, and was stunned by its high-resolution picture quality and ultra-compact design</title>
      <link>https://www.techradar.com/home/home-security/blink-mini-2k-plus-review</link>
      <pubDate>Tue, 20 Jan 2026 11:50:40 +0000</pubDate>
      <guid isPermaLink="false">aqp9GBfaKuJSYHZ9rFhXbQ</guid>
      <description>Boasting 2K video resolution, the tiny Blink Mini 2K+ also offers improved night vision over its predecessor thanks to the inclusion of a strong spotlight.</description>
    </item>
    <item>
      <title>HDMI VRR et Latence r&#233;duite : le combo gagnant arrive sur Linux pour les cartes AMD</title>
      <link>https://www.frandroid.com/marques/amd/2948609_hdmi-vrr-et-latence-reduite-le-combo-gagnant-arrive-sur-linux-pour-les-cartes-amd</link>
      <pubDate>Tue, 20 Jan 2026 11:42:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amd/2948609_hdmi-vrr-et-latence-reduite-le-combo-gagnant-arrive-sur-linux-pour-les-cartes-amd</guid>
      <description>
Un contributeur ext&#233;rieur &#224; AMD vient de publier un patch vou&#233; &#224; combler certaines des lacunes des derniers pilotes graphiques de la firme, destin&#233;s aux joueurs Linux. Une bonne nouvelle pour ceux qui attendaient du VRR via une connexion HDMI, mais pas seulement.
</description>
    </item>
    <item>
      <title>Forget daily charging &#8211; this upcoming phone's 10,001mAh battery helps it last a week, but it's still lighter than an iPhone 17 Pro Max</title>
      <link>https://www.techradar.com/phones/realme-phones/forget-daily-charging-this-upcoming-phones-10-001mah-battery-helps-it-last-a-week-but-its-still-lighter-than-an-iphone-17-pro-max</link>
      <pubDate>Tue, 20 Jan 2026 11:41:16 +0000</pubDate>
      <guid isPermaLink="false">mc8Qir9UfxXdyoraTttBhm</guid>
      <description>The Realme P4 Power has one of the highest-capacity batteries we've yet seen in a phone, and its other specs sound promising too.</description>
    </item>
    <item>
      <title>Processor ARM race heats up as Nvidia could soon challenge Intel, AMD and Apple with its N1X laptop CPU</title>
      <link>https://www.techradar.com/computing/cpu/processor-arm-race-heats-up-as-nvidia-could-soon-challenge-intel-amd-and-apple-with-its-n1x-laptop-cpu</link>
      <pubDate>Tue, 20 Jan 2026 11:36:54 +0000</pubDate>
      <guid isPermaLink="false">8yJAMtNBFsezPRwZXw7WND</guid>
      <description>Nvidia's N1X chip could debut in laptops within the next couple of months, with next-gen N2 CPUs rumored to follow later in 2027.</description>
    </item>
    <item>
      <title>Ryanair ne veut pas du Wi-Fi Starlink : pour son patron, Elon Musk est &#171; un idiot, tr&#232;s riche, certes, mais un idiot &#187;</title>
      <link>https://www.frandroid.com/telecom/2948917_ryanair-ne-veut-pas-du-wi-fi-starlink-pour-son-patron-elon-musk-est-un-idiot-tres-riche-certes-mais-un-idiot</link>
      <pubDate>Tue, 20 Jan 2026 11:30:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2948917_ryanair-ne-veut-pas-du-wi-fi-starlink-pour-son-patron-elon-musk-est-un-idiot-tres-riche-certes-mais-un-idiot</guid>
      <description>
Elon Musk veut mettre Starlink partout. Michael O'Leary veut &#233;conomiser chaque centime chez Ryanair. Le r&#233;sultat ? Un clash violent.
</description>
    </item>
    <item>
      <title>Gemini Live pr&#233;pare une &#233;norme mise &#224; jour avec ces deux nouveaut&#233;s</title>
      <link>https://www.01net.com/actualites/gemini-live-prepare-enorme-mise-a-jour-deux-nouveautes.html</link>
      <pubDate>Tue, 20 Jan 2026 11:30:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321201</guid>
      <description>Gemini Live s'appr&#234;te &#224; muscler ses capacit&#233;s de raisonnement pour corriger le manque de profondeur de ses r&#233;ponses actuelles, mais pas seulement.</description>
    </item>
    <item>
      <title>Jimmy Wales Will Never Edit Donald Trump&#8217;s Wikipedia Page: He &#8216;Makes Me Insane&#8217;</title>
      <link>https://www.wired.com/story/the-big-interview-podcast-jimmy-wales/</link>
      <pubDate>Tue, 20 Jan 2026 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">696555b5bf96e65096dda914</guid>
      <description>On this week&#8217;s episode of The Big Interview podcast, Wikipedia founder Jimmy Wales talks about maintaining neutrality in an online ecosystem increasingly hostile to facts.</description>
    </item>
    <item>
      <title>Google Clock just made it harder to sleep through your alarms</title>
      <link>https://www.techradar.com/phones/android/google-clock-just-made-it-harder-to-sleep-through-your-alarms</link>
      <pubDate>Tue, 20 Jan 2026 11:29:51 +0000</pubDate>
      <guid isPermaLink="false">NDYUUbuu4ytvzz6qUH4Kgf</guid>
      <description>The latest version of Google Clock lets you turn off alarms with a swipe rather than a tap.</description>
    </item>
    <item>
      <title>La nouvelle Renault Twingo &#233;lectrique d&#233;j&#224; surprise dans la rue : elle ne passe pas inaper&#231;ue</title>
      <link>https://www.frandroid.com/marques/renault/2948785_la-nouvelle-renault-twingo-electrique-deja-surprise-dans-la-rue-elle-ne-passe-pas-inapercue</link>
      <pubDate>Tue, 20 Jan 2026 11:29:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2948785_la-nouvelle-renault-twingo-electrique-deja-surprise-dans-la-rue-elle-ne-passe-pas-inapercue</guid>
      <description>
La Renault Twingo E-Tech arrive bient&#244;t en concessions, et les premiers exemplaires sont d&#233;j&#224; en libert&#233;. De quoi constater que la petite voiture &#233;lectrique abordable sort de la m&#234;l&#233;e.
</description>
    </item>
    <item>
      <title>Philips Hue is pushing out an upgrade for Bridge and Bridge Pro devices, ready to make smart-light automations easier</title>
      <link>https://www.techradar.com/home/smart-lights/philips-hue-is-pushing-out-an-upgrade-for-bridge-and-bridge-pro-devices-ready-to-make-smart-light-automations-easier</link>
      <pubDate>Tue, 20 Jan 2026 11:28:55 +0000</pubDate>
      <guid isPermaLink="false">xoGcphxhmfNjMgyJuPKEXg</guid>
      <description>A new update for the Philips Hue hubs means better automation management &#8211; though we're still waiting for SpatialAware.</description>
    </item>
    <item>
      <title>C&#8217;est le grand d&#233;stockage c&#244;t&#233; TV 4K et vid&#233;oprojecteurs lors des soldes : les 18 offres &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2933417_cest-le-grand-destockage-cote-tv-4k-et-videoprojecteurs-lors-des-soldes-les-18-offres-a-saisir</link>
      <pubDate>Tue, 20 Jan 2026 11:23:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933417_cest-le-grand-destockage-cote-tv-4k-et-videoprojecteurs-lors-des-soldes-les-18-offres-a-saisir</guid>
      <description>
&#192; la veille de la troisi&#232;me d&#233;marque des soldes d&#8217;hiver, les offres sur les t&#233;l&#233;viseurs 4K se multiplient chez les e-commer&#231;ants. Certains mod&#232;les haut de gamme voient m&#234;me leur prix fortement chuter. Pour vous aider &#224; faire le bon choix avant la prochaine vague de promotions, voici notre s&#233;lection des meilleures affaires du moment sur les TV 4K et les vid&#233;oprojecteurs.
...</description>
    </item>
    <item>
      <title>How to watch the 2026 Australian Open online for free</title>
      <link>https://mashable.com/article/australian-open-2026-live-stream-for-free</link>
      <pubDate>Tue, 20 Jan 2026 11:23:02 +0000</pubDate>
      <guid isPermaLink="false">06hnZZzq0fNliATl5lNc9N4</guid>
      <description>How to watch Australian Open for free. Live stream the 2026 Australian Open for free from anywhere in the world.</description>
    </item>
    <item>
      <title>La manette Nacon Revolution 5 Pro pour jouer fa&#231;on Xbox sur PS5 est sold&#233;e &#224; moiti&#233; prix</title>
      <link>https://www.frandroid.com/bons-plans/2473222_la-manette-nacon-revolution-5-pro-pour-jouer-facon-xbox-sur-ps5-est-soldee-a-moitie-prix</link>
      <pubDate>Tue, 20 Jan 2026 11:22:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2473222_la-manette-nacon-revolution-5-pro-pour-jouer-facon-xbox-sur-ps5-est-soldee-a-moitie-prix</guid>
      <description>
La Nacon Revolution 5 Pro est une manette premium certifi&#233;e par Sony qui offre de grandes possibilit&#233;s de personnalisation et une ergonomie pris&#233;e par les gamers pro, que vous retrouvez &#224; 110,39 euros au lieu de 230,99 euros pendant les soldes.
</description>
    </item>
    <item>
      <title>Spotify is testing a feature that syncs audiobooks with paper editions</title>
      <link>https://www.theverge.com/news/864296/spotify-page-match-audiobook-testing-feature</link>
      <pubDate>2026-01-20T06:20:49-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864296</guid>
      <description>Spotify appears to be working on a novel feature that will allow audiobook listeners to pick up where they left off in the physical book. Android Authority reports that version 9.1.18.282 of the Spotify app includes code references to a Page Match beta feature that can quickly sync audiobooks on the platform with their paper [&#8230;]</description>
    </item>
    <item>
      <title>Key Apple, Nvidia, and Tesla supplier sees confidential files allegedly exposed in major breach - here's what we know so far</title>
      <link>https://www.techradar.com/pro/security/key-apple-nvidia-and-tesla-supplier-sees-confidential-files-allegedly-exposed-in-major-breach-heres-what-we-know-so-far</link>
      <pubDate>Tue, 20 Jan 2026 11:20:27 +0000</pubDate>
      <guid isPermaLink="false">S7GLzZbjQoKN4tfTSQmfNE</guid>
      <description>One of the key suppliers for Apple, Tesla, and Nvidia has seemingly suffered a ransomware attack.</description>
    </item>
    <item>
      <title>Realmes 10,001mAh battery phone is real, and its remarkably light</title>
      <link>https://mashable.com/article/realme-10001-mah-battery-phone</link>
      <pubDate>Tue, 20 Jan 2026 11:06:35 +0000</pubDate>
      <guid isPermaLink="false">06Jk86N3X0U8dqNflfqbQ0d</guid>
      <description>China's RealMe has a phone with a 10.001mAh battery, promising extraordinarily long battery life.</description>
    </item>
    <item>
      <title>Chrome n&#8217;arr&#234;te pas de planter&#160;? Une extension malveillante est peut-&#234;tre en train de vous pirater</title>
      <link>https://www.01net.com/actualites/chrome-arrete-pas-planter-extension-malveillante-peut-etre-train-pirater.html</link>
      <pubDate>Tue, 20 Jan 2026 11:04:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321179</guid>
      <description>Si votre navigateur Chrome n'arr&#234;te pas de planter, il est possible qu'une extension malveillante soit parvenue &#224; s'immiscer sur celui-ci. En ce moment, une fausse extension cens&#233;e bloquer les publicit&#233;s se propage sur Internet. Une fois install&#233;e, elle va tout faire pour faire crasher Chrome. C'est la premi&#232;re &#233;tape d'une cyberattaque qui aboutit &#224; l'installation d'un redoutable virus....</description>
    </item>
    <item>
      <title>The best Disney+ deals and bundles in January 2026</title>
      <link>https://mashable.com/article/best-disney-plus-deals-january-2026</link>
      <pubDate>Tue, 20 Jan 2026 11:03:20 +0000</pubDate>
      <guid isPermaLink="false">07bedklRaYAL2B2edye1iaY</guid>
      <description>In January 2026, Disney+ is offering a few bundle deals so you can stream its library at a discounted price.</description>
    </item>
  </channel>
</rss>
