<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 19 Nov 2025 11:31:24 GMT</lastBuildDate>
    <item>
      <title>Cloudflare s&#8217;exprime sur la panne mondiale qui a fait planter une partie d&#8217;Internet</title>
      <link>https://www.01net.com/actualites/cloudflare-exprime-panne-mondiale-fait-planter-partie-dinternet.html</link>
      <pubDate>Wed, 19 Nov 2025 11:30:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309269</guid>
      <description>Une panne majeure chez Cloudflare a fait d&#233;railler une partie d'Internet. Le leader am&#233;ricain a d'abord cru &#224; une cyberattaque de type DDoS avant de d&#233;couvrir qu'il s'agissait d'une simple erreur humaine.</description>
    </item>
    <item>
      <title>Galaxy S24 : l&#8217;ancienne gloire de Samsung n&#8217;est qu&#8217;&#224; 369 &#8364; pendant le pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2875381_galaxy-s24-lancienne-gloire-de-samsung-nest-qua-369-e-pendant-le-pre-black-friday</link>
      <pubDate>Wed, 19 Nov 2025 11:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2875381_galaxy-s24-lancienne-gloire-de-samsung-nest-qua-369-e-pendant-le-pre-black-friday</guid>
      <description>
Le Samsung Galaxy S24 a beau avoir &#233;t&#233; d&#233;pass&#233; par le Galaxy S25 de cette ann&#233;e, l'ancien fleuron de la marque a encore de beaux jours devant lui. Il pourrait en plus convenir &#224; celles et ceux qui ont un budget trop restreint pour les flagships r&#233;cents, puisqu'il est affich&#233;, en ce pr&#233;-Black Friday, &#224; 369 euros au lieu de 899 euros chez Bouygues T&#233;l&#233;com.
...</description>
    </item>
    <item>
      <title>My favourite Ninja coffee machine just got its first ever price cut for Black Friday &#8211; and it's sold out at Amazon</title>
      <link>https://www.techradar.com/seasonal-sales/my-favourite-ninja-coffee-machine-just-got-its-first-ever-price-cut-for-black-friday-and-its-sold-out-at-amazon</link>
      <pubDate>Wed, 19 Nov 2025 11:15:34 +0000</pubDate>
      <guid isPermaLink="false">EQky2oBFfvbug5R3VoPeAo</guid>
      <description>The Ninja Prestige DualBrew Pro is a two-in-one espresso and drip coffee maker that only launched a few months ago, and is your best friend at breakfast.</description>
    </item>
    <item>
      <title>Amazon's Black Friday Kindle deals are live &#8211; save up to 30% on the Paperwhite, Colorsoft, and Scribe</title>
      <link>https://www.techradar.com/tablets/ereaders/amazons-black-friday-kindle-deals-are-live-save-up-to-30-percent-on-the-paperwhite-colorsoft-and-scribe</link>
      <pubDate>Wed, 19 Nov 2025 11:14:56 +0000</pubDate>
      <guid isPermaLink="false">8XJrkc76UAfj7fGGf3z2hb</guid>
      <description>Amazon's Kindle lineup is the perfect gift for the book lover in your life and the popular ereaders are now reduced in these early Black Friday deals.</description>
    </item>
    <item>
      <title>Boulanger propose de v&#233;ritables p&#233;pites la veille du v&#233;ritable Black Friday : le TOP 25 des offres</title>
      <link>https://www.frandroid.com/bons-plans/2859523_boulanger-multiplie-deja-les-promotions-au-pre-black-friday-les-16-deals-a-retenir</link>
      <pubDate>Wed, 19 Nov 2025 11:14:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2859523_boulanger-multiplie-deja-les-promotions-au-pre-black-friday-les-16-deals-a-retenir</guid>
      <description>
Le Black Friday approche, Boulanger met donc en avant une nouvelle s&#233;rie de promotions sur une large s&#233;lection de produits. De nombreux appareils b&#233;n&#233;ficient actuellement de r&#233;ductions significatives, valables jusqu&#8217;&#224; la fin de l&#8217;&#233;v&#233;nement.
</description>
    </item>
    <item>
      <title>You&#8217;re not bad at typing &#8211; iOS 26&#8217;s autocorrect is broken and there&#8217;s still no fix in iOS 26.2</title>
      <link>https://www.techradar.com/phones/ios/youre-not-bad-at-typing-ios-26s-autocorrect-is-broken-and-theres-still-no-fix-in-ios-26-2</link>
      <pubDate>Wed, 19 Nov 2025 11:13:11 +0000</pubDate>
      <guid isPermaLink="false">PZbnZt2mJGPLr9SEuYamDM</guid>
      <description>iPhone users are still experiencing autocorrect issues despite iOS 26.2's latest beta adding many new features.</description>
    </item>
    <item>
      <title>NordVPN takes on phone scammers with new call protection feature for the UK and Canada</title>
      <link>https://www.techradar.com/vpn/vpn-services/nordvpn-takes-on-phone-scammers-with-new-call-protection-feature-for-the-uk-and-canada</link>
      <pubDate>Wed, 19 Nov 2025 11:12:31 +0000</pubDate>
      <guid isPermaLink="false">27RCgHfJv6rcjxHmWUBMyV</guid>
      <description>After the US, NordVPN's call protection feature lands on Android in the UK and Canada, too, to help users dodge dangerous phone scams.</description>
    </item>
    <item>
      <title>Fresh Avengers: Doomsday leak reveals two more Marvel heroes will join the fight to stop Robert Downey Jr's Doctor Doom</title>
      <link>https://www.techradar.com/streaming/entertainment/fresh-avengers-doomsday-leak-reveals-two-more-marvel-heroes-will-join-the-fight-to-stop-robert-downey-jrs-doctor-doom</link>
      <pubDate>Wed, 19 Nov 2025 11:11:53 +0000</pubDate>
      <guid isPermaLink="false">m4tHFVci3cfqEegTun9LtP</guid>
      <description>Avengers: Doomsday's ensemble appears to have grown by two after numerous leaked promotional images surfaced online.</description>
    </item>
    <item>
      <title>Le Galaxy A57 pourrait &#234;tre meilleur que le Galaxy S26 sur ce point, et &#231;a n&#8217;a aucun sens</title>
      <link>https://www.01net.com/actualites/galaxy-a57-pourrait-etre-meilleur-galaxy-s26-sur-ce-point-aucun-sens.html</link>
      <pubDate>Wed, 19 Nov 2025 11:09:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309273</guid>
      <description>Le Galaxy A57 profiterait d'une caract&#233;ristique qui placerait le smartphone milieu de gamme de Samsung devant le futur Galaxy S26, et c&#8217;est difficile &#224; expliquer.</description>
    </item>
    <item>
      <title>That Zoox Robotaxi Ride You&#8217;ve Been Clamoring for Is Now Available in San Francisco</title>
      <link>https://gizmodo.com/zoox-robotaxi-san-francisco-2000687897</link>
      <pubDate>Wed, 19 Nov 2025 11:00:08 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687897</guid>
      <description>You know Zoox. It's Amazon's robotaxi division. The one where the taxi is not a car.</description>
    </item>
    <item>
      <title>Kirby Air Riders is one of the most chaotic Nintendo Switch 2 games I&#8217;ve played, but that&#8217;s really not a bad thing &#8211; here&#8217;s my final verdict</title>
      <link>https://www.techradar.com/gaming/kirby-air-riders-review</link>
      <pubDate>Wed, 19 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">DNsk73YvGc4pcH9kBmw8rX</guid>
      <description>I glided through the chaos of Kirby Air Riders on Nintendo Switch 2, and its frenetic gameplay won me over, in spite of a few flaws.</description>
    </item>
    <item>
      <title>10 easy tips to help you get better results from ChatGPT every time you use it</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/here-are-10-easy-tips-to-help-you-get-better-results-from-chatgpt-every-time-you-use-it</link>
      <pubDate>Wed, 19 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">UGLwjue2muL6NUEJhRNRvB</guid>
      <description>From better prompts to smarter follow-ups, here are 10 tips to get the most out of ChatGPT</description>
    </item>
    <item>
      <title>Brace yourself: Xiaomi warns of a &#8216;sizeable rise&#8217; in smartphone prices next year</title>
      <link>https://www.techradar.com/phones/brace-yourself-xiaomi-warns-of-a-sizeable-rise-in-smartphone-prices-next-year</link>
      <pubDate>Wed, 19 Nov 2025 10:57:22 +0000</pubDate>
      <guid isPermaLink="false">fBmb4Vqj2KKMusphZncmq7</guid>
      <description>Xiaomi claims that rising memory prices could lead to increased pricing for phones, and AI is to blame.</description>
    </item>
    <item>
      <title>Bose SoundLink Micro 2e gen : cette r&#233;cente mini-enceinte Bluetooth chute d&#233;j&#224; sous les 100 &#8364; en ce pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2875135_bose-soundlink-micro-2e-gen-cette-recente-mini-enceinte-bluetooth-chute-deja-sous-les-100-e-en-ce-pre-black-friday</link>
      <pubDate>Wed, 19 Nov 2025 10:53:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2875135_bose-soundlink-micro-2e-gen-cette-recente-mini-enceinte-bluetooth-chute-deja-sous-les-100-e-en-ce-pre-black-friday</guid>
      <description>
La deuxi&#232;me g&#233;n&#233;ration de la mini-enceinte portable Bose SoundLink Micro est enfin arriv&#233;e sur le march&#233;, et avec elle, quelques am&#233;liorations bien sympathiques, notamment c&#244;t&#233; autonomie et audio. En plein pr&#233;-Black Friday, elle s'affiche d&#233;j&#224; en promotion &#224; 99,95 euros au lieu de 129,99 euros sur Amazon. 
</description>
    </item>
    <item>
      <title>VMware confirms its spec guidance on storage servers was rather inaccurate</title>
      <link>https://www.techradar.com/pro/vmware-confirms-its-spec-guidance-on-storage-servers-was-rather-inaccurate</link>
      <pubDate>Wed, 19 Nov 2025 10:52:29 +0000</pubDate>
      <guid isPermaLink="false">7KaLh8PFQRxyihAyrFoVkK</guid>
      <description>Synthetic data meant VMware&#8217;s guidance was totally off the mark &#8211; new telemetry changes all of that.</description>
    </item>
    <item>
      <title>Les offres du pr&#233; Black Friday font chuter les prix des smartwatches : Apple, Samsung, Garmin en promo</title>
      <link>https://www.frandroid.com/bons-plans/2854639_top-offres-black-friday-montres-bracelets-connectes</link>
      <pubDate>Wed, 19 Nov 2025 10:51:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2854639_top-offres-black-friday-montres-bracelets-connectes</guid>
      <description>
Nous ne sommes que mi-novembre, mais les promotions d&#233;barquent avant l&#8217;heure. Ce pr&#233;-Black Friday met &#224; l&#8217;honneur les montres connect&#233;es et les bracelets, orient&#233;s sport ou lifestyle. Tour d&#8217;horizon des meilleures offres d&#233;j&#224; propos&#233;es par les e-commer&#231;ants pour s'offrir une smartwach &#224; prix cass&#233;.
</description>
    </item>
    <item>
      <title>Vie num&#233;rique | La fin de la radio FM (en auto)</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-11-19/vie-numerique/la-fin-de-la-radio-fm-en-auto.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 19 Nov 2025 05:45:00 -0500</pubDate>
      <guid isPermaLink="false">223816e433083b13bedc986d2411e618</guid>
      <description>Les v&#233;hicules Tesla mill&#233;sim&#233;s&#160;2026 ont une nouveaut&#233; &#224; bord. Ou plut&#244;t, il leur manque un composant qu&#8217;on pensait ind&#233;logeable&#160;: une antenne FM. Est-ce la fin de la radio hertzienne&#160;? En tout cas, ce n&#8217;est pas la fin de la radio tout court. Loin de l&#224;.</description>
    </item>
    <item>
      <title>Ignore the hype &#8211; I tested Gemini 3 and ChatGPT 5.1 head-to-head on what really matters: ease of use</title>
      <link>https://www.techradar.com/ai-platforms-assistants/gemini/ignore-the-hype-i-tested-gemini-3-and-chatgpt-5-1-head-to-head-on-what-really-matters-ease-of-use</link>
      <pubDate>Wed, 19 Nov 2025 10:44:34 +0000</pubDate>
      <guid isPermaLink="false">UVfJUzQT3UuDat796oD7Ah</guid>
      <description>Testing Gemini 3 against ChatGPT-5.1 showcases how natural the AI models can be in their responses.</description>
    </item>
    <item>
      <title>The Thrustmaster Heart Xbox controller has shot down to a price I can actually recommend it at</title>
      <link>https://www.techradar.com/gaming/the-thrustmaster-heart-xbox-controller-has-shot-down-to-a-price-i-can-actually-recommend-it-at</link>
      <pubDate>Wed, 19 Nov 2025 10:44:15 +0000</pubDate>
      <guid isPermaLink="false">YybXYjEnmY53haZPXzGmzm</guid>
      <description>Thrustmaster put its own excellent anti-drift tech into this Xbox controller, and now it's on sale ahead of Black Friday.</description>
    </item>
    <item>
      <title>Amazon lance ses dr&#244;les de voitures &#233;lectriques autonomes dans plusieurs villes : voici Zoox</title>
      <link>https://www.frandroid.com/marques/amazon/2875285_amazon-lance-ses-droles-de-voitures-electriques-autonomes-dans-plusieurs-villes-voici-zoox</link>
      <pubDate>Wed, 19 Nov 2025 10:41:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazon/2875285_amazon-lance-ses-droles-de-voitures-electriques-autonomes-dans-plusieurs-villes-voici-zoox</guid>
      <description>
Les taxis autonomes ont le vent en poupe. Suivant l'exemple de Tesla et de Google avec Waymo, Amazon lance Zoox &#224; San Francisco, quelques semaines apr&#232;s Las Vegas. Son arme ? D'&#233;tonnantes voitures &#233;lectriques sans volant ni chauffeur.
</description>
    </item>
    <item>
      <title>Mourir pour une mise &#224; jour : le sc&#233;nario catastrophe est arriv&#233; sur ce smartphone</title>
      <link>https://www.frandroid.com/culture-tech/2875585_mourir-pour-une-mise-a-jour-le-scenario-catastrophe-est-arrive-sur-ce-smartphone</link>
      <pubDate>Wed, 19 Nov 2025 10:36:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/2875585_mourir-pour-une-mise-a-jour-le-scenario-catastrophe-est-arrive-sur-ce-smartphone</guid>
      <description>
C'est le sc&#233;nario catastrophe que l'on redoutait tous avec la fin de la 3G. Un homme est mort &#224; Sydney. Pas parce qu'il n'avait pas de r&#233;seau, mais parce que son smartphone Samsung a refus&#233; de passer l'appel d'urgence. La cause ? Une simple mise &#224; jour logicielle non effectu&#233;e.
</description>
    </item>
    <item>
      <title>The next Zenless Zone Zero update adds a chakram-wielding panda girl</title>
      <link>https://www.techradar.com/gaming/mobile-gaming/the-next-zenless-zone-zero-update-adds-a-chakram-wielding-panda-girl</link>
      <pubDate>Wed, 19 Nov 2025 10:33:39 +0000</pubDate>
      <guid isPermaLink="false">k54VuZSgF4XvUmGLFbeAam</guid>
      <description>Zenless Zone Zero Verison 2.4 arrives next week, with two new characters to try.</description>
    </item>
    <item>
      <title>&#171;&#160;Vous ne vous attendiez pas &#224; me voir ici&#160;&#187; : Epic Games annonce un partenariat surprise pour Fortnite avec le moteur Unity</title>
      <link>https://www.frandroid.com/produits-android/console/2875449_vous-ne-vous-attendiez-pas-a-me-voir-ici-epic-games-annonce-un-partenariat-surprise-pour-fortnite-avec-le-moteur-unity</link>
      <pubDate>Wed, 19 Nov 2025 10:33:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2875449_vous-ne-vous-attendiez-pas-a-me-voir-ici-epic-games-annonce-un-partenariat-surprise-pour-fortnite-avec-le-moteur-unity</guid>
      <description>
Unity accueillit le fondateur d'Epic Games, Tim Sweeney, sur la sc&#232;ne de sa propre conf&#233;rence pour annoncer la collaboration. Les d&#233;veloppeurs Unity pourront bient&#244;t porter leur jeu dans Fortnite.
</description>
    </item>
    <item>
      <title>Les v&#233;lo &#233;lectriques et m&#233;caniques toujours dans la tourmente selon les chiffres inqui&#233;tants de ce nouvel indicateur</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2875429_les-velo-electriques-et-mecaniques-toujours-dans-la-tourmente-selon-les-chiffres-inquietants-de-ce-nouvel-indicateur</link>
      <pubDate>Wed, 19 Nov 2025 10:33:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2875429_les-velo-electriques-et-mecaniques-toujours-dans-la-tourmente-selon-les-chiffres-inquietants-de-ce-nouvel-indicateur</guid>
      <description>
L&#8217;indice Global Bicycle Purchasing Index est en baisse en novembre 2025, signe d&#8217;une chute des commandes chez de nombreuses marques et fabricants de l&#8217;industrie du v&#233;lo.
</description>
    </item>
    <item>
      <title>Derni&#232;re chance pour profiter du Singles Day : les ultimes offres &#224; saisir pour la fin du Black Friday chinois</title>
      <link>https://www.frandroid.com/bons-plans/2868103_derniere-chance-pour-profiter-du-singles-day-les-ultimes-offres-a-saisir-pour-la-fin-du-black-friday-chinois</link>
      <pubDate>Wed, 19 Nov 2025 10:31:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2868103_derniere-chance-pour-profiter-du-singles-day-les-ultimes-offres-a-saisir-pour-la-fin-du-black-friday-chinois</guid>
      <description>
Il ne reste plus que quelques heures pour profiter des derni&#232;res promotions du Singles Day.&#160;Les meilleures r&#233;f&#233;rences du moment sont &#224; prix cass&#233;, et pour vous y retrouver parmi la multitude d&#8217;offres, nous avons s&#233;lectionn&#233; pour vous les ultimes &#224; saisir du Black Friday chinois. 
</description>
    </item>
    <item>
      <title>AI browsers need the open web. So why are they trying to kill it?</title>
      <link>https://www.fastcompany.com/91442335/ai-browsers-open-web-amazon-perplexity</link>
      <pubDate>2025-11-19T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91442335/ai-browsers-open-web-amazon-perplexity</guid>
      <description>OpenAI, Perplexity, and anyone else pursuing a future of AI agents have one big problem: Their vision requires destroying the ecosystem of websites they purport to help. 
For those of us who earn a living publishing content on the open internet, Amazon&#8217;s lawsuit against AI startup Perplexity can seem darkly amusing.</description>
    </item>
    <item>
      <title>Retailers are quietly changing their return policies. Here&#8217;s what to know</title>
      <link>https://www.fastcompany.com/91443395/retail-return-policies-changing</link>
      <pubDate>2025-11-19T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91443395/retail-return-policies-changing</guid>
      <description>As we head into the busiest shopping season of the year, it&#8217;s worth pausing before you click &#8216;purchase.&#8217;
&#8217;Tis the season for giving&#8212;and that means &#8217;tis the season for shopping. Maybe you&#8217;ll splurge on a Black Friday or Cyber Monday deal, thinking, &#8220;I&#8217;ll just return it if they don&#8217;t like it.&#8221; But before you click &#8220;purchase,&#8221; it&#8217;s worth knowing that many retailers have quietly tightened their return policies in recent years....</description>
    </item>
    <item>
      <title>Tesla Diner Chef and Co-Operator Quits to Open a Jewish Deli</title>
      <link>https://gizmodo.com/tesla-diner-chef-and-co-operator-quits-to-open-a-jewish-deli-2000687365</link>
      <pubDate>Wed, 19 Nov 2025 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687365</guid>
      <description>Chef Eric Greenspan says the project requires "sharpness of focus and attention."</description>
    </item>
    <item>
      <title>Cloudflare outlines what caused major outage - but says a hack wasn't to blame</title>
      <link>https://www.techradar.com/pro/cloudflare-outlines-what-caused-major-outage-but-says-a-hack-wasnt-to-blame</link>
      <pubDate>Wed, 19 Nov 2025 10:27:28 +0000</pubDate>
      <guid isPermaLink="false">FGUkEtLzXGj6C6SwwTWipb</guid>
      <description>Cloudflare says its November 2025 outage was caused by a system error.</description>
    </item>
    <item>
      <title>Samsung Galaxy A et M : cette application syst&#232;me est inqui&#233;tante et impossible &#224; supprimer</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2875503_samsung-galaxy-a-et-m-cette-application-systeme-est-inquietante-et-impossible-a-supprimer</link>
      <pubDate>Wed, 19 Nov 2025 10:24:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2875503_samsung-galaxy-a-et-m-cette-application-systeme-est-inquietante-et-impossible-a-supprimer</guid>
      <description>
C'est l'histoire d'une petite &#233;conomie de bout de chandelle qui se transforme en cauchemar de relations publiques. Samsung installe d'office le logiciel AppCloud sur ses Galaxy A et M. Jusque-l&#224;, rien de nouveau. Sauf que derri&#232;re ce nom g&#233;n&#233;rique se cache ironSource, une entreprise connue pour ses pratiques... disons, agressives.
</description>
    </item>
    <item>
      <title>Pr&#233; Black Friday sur les v&#233;los &#233;lectriques, tous &#224; bicyclette avant le jour J : les meilleurs deals</title>
      <link>https://www.frandroid.com/bons-plans/2860283_pre-black-friday-2025-top-deals-et-promos-velos-electriques</link>
      <pubDate>Wed, 19 Nov 2025 10:22:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860283_pre-black-friday-2025-top-deals-et-promos-velos-electriques</guid>
      <description>
Les premi&#232;res offres du Black Friday sont tomb&#233;es en avance cette ann&#233;e et sur tous les domaines. Les v&#233;los &#233;lectriques b&#233;n&#233;ficient eux aussi de promotions et c'est ce que nous vous d&#233;voilons dans notre s&#233;lection des meilleures promos sur les VAE. 
</description>
    </item>
    <item>
      <title>WhatsApp va d&#233;ployer la fonction multicompte sur iPhone</title>
      <link>https://www.frandroid.com/marques/meta/2875157_whatsapp-va-deployer-la-fonction-multicompte-sur-iphone</link>
      <pubDate>Wed, 19 Nov 2025 10:13:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2875157_whatsapp-va-deployer-la-fonction-multicompte-sur-iphone</guid>
      <description>
Une nouvelle version b&#234;ta de l'application iPhone donne plus de d&#233;tails sur la fonction multicompte de WhatsApp. 
</description>
    </item>
    <item>
      <title>Black Friday anticip&#233; : les meilleures tablettes &#224; prix choc, m&#234;me les iPad et Galaxy Tab</title>
      <link>https://www.frandroid.com/bons-plans/2850637_pre-black-friday-tablettes-ipad-galaxy-tab-les-meilleures-offres-avant-derniere-ligne-droite</link>
      <pubDate>Wed, 19 Nov 2025 10:09:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850637_pre-black-friday-tablettes-ipad-galaxy-tab-les-meilleures-offres-avant-derniere-ligne-droite</guid>
      <description>
Certes,les tablettes tactiles ont un poil perdu de leur popularit&#233;. Mais elles restent n&#233;anmoins utiles pour certains usages de loisirs ou bien professionnels. Elles peuvent &#234;tre des outils polyvalents et appr&#233;ci&#233;s, surtout pour le dessin num&#233;rique. &#192; l&#8217;occasion du pr&#233;-Black Friday, qui se prolonge encore un peu, plusieurs mod&#232;les de grandes marques b&#233;n&#233;ficient de remises importantes.
...</description>
    </item>
    <item>
      <title>Mettez &#224; jour cette tondeuse robot : elle coupe l&#8217;herbe mais aussi vos connexions</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/robots-tondeuses/2875379_mettez-a-jour-cette-tondeuse-robot-elle-coupe-lherbe-mais-aussi-vos-connexions</link>
      <pubDate>Wed, 19 Nov 2025 10:01:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/robots-tondeuses/2875379_mettez-a-jour-cette-tondeuse-robot-elle-coupe-lherbe-mais-aussi-vos-connexions</guid>
      <description>
Vous avez investi dans une LUBA 2 AWD pour avoir une pelouse impeccable ? Mauvaise nouvelle : votre robot causait peut-&#234;tre des maux de t&#234;te &#224; votre r&#233;seau domotique.
</description>
    </item>
    <item>
      <title>RFK Jr. Announces $2 Million Prize for Anyone Who Can Help Him Cram AI Into the U.S. Healthcare System</title>
      <link>https://gizmodo.com/rfk-2-million-prize-ai-healthcare-2000687874</link>
      <pubDate>Wed, 19 Nov 2025 10:00:18 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687874</guid>
      <description>How can AI help American healthcare? We don't know, and neither does the government.</description>
    </item>
    <item>
      <title>Vaping Is &#8216;Everywhere&#8217; in Schools&#8212;Sparking a Bathroom Surveillance Boom</title>
      <link>https://www.wired.com/story/vaping-surveillance-school-bathrooms/</link>
      <pubDate>Wed, 19 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">69121b3715c8049371b3b558</guid>
      <description>Schools in the US are installing vape-detection tech in bathrooms to thwart student nicotine and cannabis use. A new investigation reveals the impact of using spying to solve a problem.</description>
    </item>
    <item>
      <title>ByteSIM review</title>
      <link>https://www.techradar.com/pro/bytesim-review</link>
      <pubDate>Wed, 19 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">n9CvJyPDAf3c6bBryfdLaA</guid>
      <description>A detailed review of ByteSIM: What it offers, its pricing, pros, cons, and other important factors to know about this eSIM provider.</description>
    </item>
    <item>
      <title>Want someone to change their behavior? Psychology says nagging doesn&#8217;t work, but this mind trick does</title>
      <link>https://www.fastcompany.com/91442460/change-behavior-psychology-nagging-gratitude</link>
      <pubDate>2025-11-19T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91442460/change-behavior-psychology-nagging-gratitude</guid>
      <description>Making people feel positive about themselves gets better results than negativity.
Here&#8217;s a common pattern in my house. See if it seems familiar to you. After my husband showers, he often forgets to put his dirty clothes in the hamper. This drives me batty, so I remind him to please pick them up. Again and again and again.&#160;</description>
    </item>
    <item>
      <title>This startup is growing mini-livers to keep patients alive</title>
      <link>https://www.fastcompany.com/91443519/this-startup-is-growing-mini-livers-to-keep-patients-alive</link>
      <pubDate>2025-11-19T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91443519/this-startup-is-growing-mini-livers-to-keep-patients-alive</guid>
      <description>Dimension Bio wants to grow a simplified liver from cells to sustain patients long enough for a damaged liver to recover&#8212;or until a transplant arrives.
Caralynn Nowinski Collens, Ramille Shah, and Adam Jakus spent years developing an innovative technology to regenerate injured bone. The results, they thought, were .&#160;.&#160;. okay. The company they founded, Dimension Bio, received clearance from the Food and Drug Administration for its approach: providing a 3D-printed lattice or &#8220;scaffold&#8221; for new bone to grow in. However, it didn&#8217;t form new bone fast enough to compete with established treatment met...</description>
    </item>
    <item>
      <title>Un troisi&#232;me Xiaomi Store est d&#233;j&#224; pr&#233;vu en France et on sait o&#249; il va ouvrir (et &#224; peu pr&#232;s quand)</title>
      <link>https://www.frandroid.com/marques/xiaomi/2873153_un-troisieme-xiaomi-store-est-deja-prevu-en-france-et-on-sait-ou-il-va-ouvrir-et-a-peu-pres-quand</link>
      <pubDate>Wed, 19 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2873153_un-troisieme-xiaomi-store-est-deja-prevu-en-france-et-on-sait-ou-il-va-ouvrir-et-a-peu-pres-quand</guid>
      <description>
Voici o&#249; va ouvrir le troisi&#232;me Xiaomi Store de France pr&#233;vu pour le d&#233;but de l'ann&#233;e 2026. Ce nouveau magasin sera &#233;galement situ&#233; en &#206;le-de-France comme les deux premiers.
</description>
    </item>
    <item>
      <title>Des traces chimiques vieilles de plusieurs milliards d&#8217;ann&#233;es r&#233;v&#232;lent les premiers murmures de la vie sur Terre !</title>
      <link>https://www.futura-sciences.com/sciences/actualites/origine-vie-traces-chimiques-vieilles-plusieurs-milliards-annees-revelent-premiers-murmures-vie-terre-127641/#xtor%3DRSS-8</link>
      <pubDate>Wed, 19 Nov 2025 10:57:46 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/origine-vie-traces-chimiques-vieilles-plusieurs-milliards-annees-revelent-premiers-murmures-vie-terre-127641/#xtor%3DRSS-8</guid>
      <description>Et si l&#8217;intelligence artificielle permettait enfin de remonter aux toutes premi&#232;res lueurs du vivant ? En d&#233;codant des fragments mol&#233;culaires vieux de plusieurs milliards d&#8217;ann&#233;es, une IA parvient &#224; distinguer le biologique de l&#8217;abiotique avec une pr&#233;cision in&#233;dite. &#192; la cl&#233; : des preuves d&#8217;une...</description>
    </item>
    <item>
      <title>Google d&#233;voile ses meilleurs jeux et applications de 2025, et il y a des surprises</title>
      <link>https://www.01net.com/actualites/google-devoile-meilleurs-jeux-applications-2025-surprises.html</link>
      <pubDate>Wed, 19 Nov 2025 09:56:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309239</guid>
      <description>Google d&#233;voile son palmar&#232;s des meilleures applications et jeux du Play Store pour 2025. On y retrouve certains noms connus, mais aussi quelques surprises.</description>
    </item>
    <item>
      <title>AI voice fraud is exploiting contact centers</title>
      <link>https://www.techradar.com/pro/ai-voice-fraud-is-exploiting-contact-centers</link>
      <pubDate>Wed, 19 Nov 2025 09:56:03 +0000</pubDate>
      <guid isPermaLink="false">SFeLYLYQ9PX8vGMn8TTRUi</guid>
      <description>(Deep) faking it: contact centers are the wild west for AI-generated voice fraud.</description>
    </item>
    <item>
      <title>The new iPad Pro M5 is down to its best-ever price ahead of Black Friday &#8212; save over $70 at Amazon</title>
      <link>https://mashable.com/article/nov-19-ipad-pro-deal</link>
      <pubDate>Wed, 19 Nov 2025 09:51:32 +0000</pubDate>
      <guid isPermaLink="false">0127vCcKEv4wZCXAQULtsrX</guid>
      <description>Find the best iPad deal over Black Friday. Save over $70 on the iPad Pro M5 at Amazon.</description>
    </item>
    <item>
      <title>AI, my unexpected daily travel companion</title>
      <link>https://www.theverge.com/report/823725/vanlife-ai-travel-planner-google-zero</link>
      <pubDate>2025-11-19T04:48:59-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=823725</guid>
      <description>I was starting to doubt it would ever happen, but I finally found a regular, helpful use for AI: vanlife travel planner. I'm not a student and I don't code. I am, however, on day 48 of my van tour through Europe with my wife and dog. We travel without a specific itinerary, chasing the [&#8230;]</description>
    </item>
    <item>
      <title>The Samsung 40-inch Odyssey G7 is at its lowest-ever price &#8212; save $370 ahead of Black Friday</title>
      <link>https://mashable.com/article/nov-19-samsung-odyssey-g7-deal</link>
      <pubDate>Wed, 19 Nov 2025 09:33:40 +0000</pubDate>
      <guid isPermaLink="false">037ySsFVzBPReWvWsTQmI5K</guid>
      <description>Get the best gaming deal ahead of Black Friday. Save 38% on the Samsung 40-inch Odyssey G7 at Amazon.</description>
    </item>
    <item>
      <title>The Anker Solix EverFrost 2 electric cooler is a sweet upgrade from a standard cooler. Plus, it can recharge your phone.</title>
      <link>https://mashable.com/review/anker-solix-everfrost-2</link>
      <pubDate>Wed, 19 Nov 2025 09:32:00 +0000</pubDate>
      <guid isPermaLink="false">04YgFBknsXRCfHE567QDdZE</guid>
      <description>The Anker Solix EverFrost 2 electric cooler stays chilled for days and it works as a portable power station.</description>
    </item>
  </channel>
</rss>
