<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 26 Jan 2026 12:58:44 GMT</lastBuildDate>
    <item>
      <title>Tempted by the IKEA donut lamp? The upgraded Philips Hue Flourish might be an even better smart home buy</title>
      <link>https://www.techradar.com/home/smart-lights/tempted-by-the-ikea-donut-lamp-the-upgraded-philips-hue-flourish-might-be-an-even-better-smart-home-buy</link>
      <pubDate>Mon, 26 Jan 2026 12:53:22 +0000</pubDate>
      <guid isPermaLink="false">8jFjVf5tCZzBBqMeoyyN4A</guid>
      <description>In the market for a new smart lamp for your table? Philips Hue is updating one of its models.</description>
    </item>
    <item>
      <title>YouTube Music just got a big queue upgrade that users have wanted for years &#8211; and now Apple Music fans are demanding the same</title>
      <link>https://www.techradar.com/audio/audio-streaming/youtube-music-just-got-a-big-queue-upgrade-that-users-have-wanted-for-years-and-now-apple-music-fans-are-demanding-the-same</link>
      <pubDate>Mon, 26 Jan 2026 12:26:00 +0000</pubDate>
      <guid isPermaLink="false">ktyLqmhpgzVfeLKyywskki</guid>
      <description>YouTube Music users can now pick up where they left off across Android and iOS devices, but Apple Music has yet to do the same.</description>
    </item>
    <item>
      <title>Good leaders don&#8217;t shut down when employees push back&#8212;they do this instead</title>
      <link>https://www.fastcompany.com/91468687/why-listening-to-pushback-builds-both-insight-and-trust-and-how-that-changes-everything-listening-insight-pushback-trust</link>
      <pubDate>2026-01-26T12:25:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91468687/why-listening-to-pushback-builds-both-insight-and-trust-and-how-that-changes-everything-listening-insight-pushback-trust</guid>
      <description>Your resistance problem is actually an intelligence problem.
Twenty years ago, as the top digital and innovation executive for Citi&#8217;s credit card business, I led the team that spent months building what looked like a brilliant partnership. We&#8217;d found a startup with a disruptive payments platform&#8212;one that became the forerunner of what has become a new payment type used by millions of consumers today. The deal: strategic investment in exchange for access to the startup&#8217;s codebase as a sandbox for innovation pilots. No more waiting in the legacy systems queue. Just rapid prototyping with leading-...</description>
    </item>
    <item>
      <title>Les prix des SSD NVMe explosent, mais ce Samsung 4 To avec dissipateur reste &#224; un prix normal pour le moment</title>
      <link>https://www.frandroid.com/bons-plans/2954913_les-prix-des-ssd-nvme-explosent-mais-ce-samsung-4-to-avec-dissipateur-reste-a-un-prix-normal-pour-le-moment</link>
      <pubDate>Mon, 26 Jan 2026 12:23:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2954913_les-prix-des-ssd-nvme-explosent-mais-ce-samsung-4-to-avec-dissipateur-reste-a-un-prix-normal-pour-le-moment</guid>
      <description>
Avec la hausse des prix du stockage, certaines offres m&#233;ritent qu&#8217;on s&#8217;y attarde. Le SSD NVMe Samsung 990 Pro, dans sa version 4 To avec dissipateur thermique int&#233;gr&#233;, est actuellement affich&#233; &#224; 369 euros. Un tarif correct pour un mod&#232;le haut de gamme qui devient une bonne affaire &#224; saisir avant une &#233;ventuelle remont&#233;e des prix.
</description>
    </item>
    <item>
      <title>Super&#233;thanol-E85&#160;: E.Leclerc veut d&#233;mocratiser la conversion avec une offre &#224; prix cass&#233;</title>
      <link>https://www.01net.com/actualites/superethanol-e85-e-leclerc-veut-democratiser-la-conversion-avec-une-offre-a-prix-casse.html</link>
      <pubDate>Mon, 26 Jan 2026 12:21:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322434</guid>
      <description>E.Leclerc d&#233;voile ce 26 janvier une offre de conversion au Super&#233;thanol-E85 dans ses centres auto. Avec un tarif comp&#233;titif et une installation rapide, l'enseigne promet plus de 700 euros d'&#233;conomies par an.</description>
    </item>
    <item>
      <title>1Password &#224; une solution simple pour se prot&#233;ger des faux sites</title>
      <link>https://www.frandroid.com/culture-tech/securite-applications/2954989_1password-a-une-solution-simple-pour-se-proteger-des-faux-sites</link>
      <pubDate>Mon, 26 Jan 2026 12:16:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/securite-applications/2954989_1password-a-une-solution-simple-pour-se-proteger-des-faux-sites</guid>
      <description>
Le gestionnaire de mot de passe a trouv&#233; une solution simple pour aider ses utilisateurs &#224; ne pas se faire avoir par une strat&#233;gie basique des arnaques en ligne.
</description>
    </item>
    <item>
      <title>Microsoft&#8217;s first Windows 11 update of 2026 has been a mess</title>
      <link>https://www.theverge.com/news/867647/microsoft-windows-11-january-2026-update-bugs-issues</link>
      <pubDate>2026-01-26T07:04:08-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=867647</guid>
      <description>Microsoft's first update for Windows 11 in 2026 has been a buggy mess, to say the least. After reports of shutdown issues on some machines, Microsoft issued an emergency update to fix its January 2026 Windows 11 update last weekend. Now, exactly a week later, the software maker has been forced to issue a second [&#8230;]</description>
    </item>
    <item>
      <title>Scandale sur Windows&#160;: Microsoft a permis au FBI de d&#233;verrouiller des PC chiffr&#233;s avec BitLocker</title>
      <link>https://www.01net.com/actualites/scandale-windows-microsoft-permis-fbi-deverrouiller-pc-chiffres-bitlocker.html</link>
      <pubDate>Mon, 26 Jan 2026 12:01:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322420</guid>
      <description>BitLocker a un talon d&#8217;Achille, et c'est Microsoft. L'&#233;diteur a accept&#233; de remettre au FBI des cl&#233;s de r&#233;cup&#233;ration stock&#233;es dans son cloud. Avec ces cl&#233;s, les agents f&#233;d&#233;raux ont pu d&#233;chiffrer les donn&#233;es de trois ordinateurs. Cette affaire montre que Microsoft est en mesure de communiquer vos cl&#233;s si la justice le demande.</description>
    </item>
    <item>
      <title>Microsoft admits Windows 11 update is nuking system drives, albeit there's a 'limited number of reports' of these disasters</title>
      <link>https://www.techradar.com/computing/windows/microsoft-admits-windows-11-update-is-nuking-system-drives-albeit-theres-a-limited-number-of-reports-of-these-disasters</link>
      <pubDate>Mon, 26 Jan 2026 12:00:33 +0000</pubDate>
      <guid isPermaLink="false">C4hv8CSPXxX6La2BVt3yY</guid>
      <description>Windows 11 runs into another disastrous bug with its latest update &#8212; Microsoft admits an 'issue in which devices are failing to boot', worryingly.</description>
    </item>
    <item>
      <title>We Strapped on Exoskeletons and Raced. There&#8217;s One Clear Winner</title>
      <link>https://www.wired.com/story/story/we-raced-exoskeletons-and-theres-one-clear-winner/</link>
      <pubDate>Mon, 26 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">696f6317590fc20efaaa15e3</guid>
      <description>WIRED put the latest consumer exoskeletons from Dnsys and Hypershell in a head-to-head test on a pro athletic track. On your marks &#8230;</description>
    </item>
    <item>
      <title>What is &#8216;situational retirement&#8217;&#8212;and should you give it a try?</title>
      <link>https://www.fastcompany.com/91477180/if-you-hate-the-word-retire-try-situational-retirement-on-for-size</link>
      <pubDate>2026-01-26T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91477180/if-you-hate-the-word-retire-try-situational-retirement-on-for-size</guid>
      <description>Whether not quite fully retired or merely under-employed, this is how to live while waiting for the phone to ring.
As an operative researcher for luxury retail companies, I spent my career grabbing onto one corporate contract after the next, like a tree-swinging retainer monkey. But in a tariff-distressed industry, those contract &#8220;branches&#8221; grew further and further apart until I was left hanging. Then a colleague experiencing a similar work gap said, &#8220;Well, I guess we&#8217;re retired.&#8221;...</description>
    </item>
    <item>
      <title>Davos reveals mixed messages on CEO confidence&#8212;and new narratives on AI</title>
      <link>https://www.fastcompany.com/91479712/davos-reveals-mixed-messages-on-ceo-confidence-and-new-narratives-on-ai</link>
      <pubDate>2026-01-26T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91479712/davos-reveals-mixed-messages-on-ceo-confidence-and-new-narratives-on-ai</guid>
      <description>&#8216;Modern CEO&#8217; goes to the World Economic Forum Annual Meeting in Davos. Here&#8217;s what leaders here are saying.
Hello and welcome to Modern CEO! I&#8217;m Stephanie Mehta, CEO and chief content officer of Mansueto Ventures. Each week this newsletter explores inclusive approaches to leadership drawn from conversations with executives and entrepreneurs, and from the pages of Inc. and Fast Company. If you received this newsletter from a friend, you can sign up to get it yourself every Monday morning....</description>
    </item>
    <item>
      <title>Strava's finally given Apple Watch users a WorkOutdoors-style feature they've been missing in the Workout app for years</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/stravas-finally-given-apple-watch-users-a-workoutdoors-style-feature-theyve-been-missing-in-the-workout-app-for-years</link>
      <pubDate>Mon, 26 Jan 2026 11:59:11 +0000</pubDate>
      <guid isPermaLink="false">tzk8jBMfExn2qc85Q94qs</guid>
      <description>Strava users on Apple Watch can now follow pre-generated routes while recording a workout, just like the native Garmin feature.</description>
    </item>
    <item>
      <title>Of all the new 2026 robot lawn mowers, these are the 3 I'm most excited to try out</title>
      <link>https://www.techradar.com/home/smart-home/of-all-the-new-2026-robot-lawn-mowers-these-are-the-3-im-most-excited-to-try-out</link>
      <pubDate>Mon, 26 Jan 2026 11:54:14 +0000</pubDate>
      <guid isPermaLink="false">beA9q5dzeS5XLmQv4iSFRa</guid>
      <description>There are plenty of excellent lawbots heading our way in 2026, but these 3 stand out from the crowd.</description>
    </item>
    <item>
      <title>Les plateformes SVoD pr&#233;f&#233;r&#233;es des fran&#231;ais : Apple TV cr&#233;e la surprise et d&#233;tr&#244;ne un Canal+ en chute libre</title>
      <link>https://www.frandroid.com/services/svod/2954955_les-plateformes-svod-preferees-des-francais-apple-tv-cree-la-surprise-et-detrone-un-canal-en-chute-libre</link>
      <pubDate>Mon, 26 Jan 2026 11:52:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2954955_les-plateformes-svod-preferees-des-francais-apple-tv-cree-la-surprise-et-detrone-un-canal-en-chute-libre</guid>
      <description>
Sp&#233;cialiste de l'actualit&#233; cin&#233;/s&#233;rie et du march&#233; de la VoD, le site JustWatch vient de d&#233;voiler son dernier rapport sur les parts de march&#233; en France. Bien que le classement reste quasiment immobile, on pourrait assister &#224; une redistribution des cartes avec quelques surprises.
</description>
    </item>
    <item>
      <title>Le milliardaire tch&#232;que David Kretinsky veut prendre le contr&#244;le de Fnac Darty</title>
      <link>https://www.01net.com/actualites/le-milliardaire-tcheque-david-kretinsky-veut-prendre-le-controle-de-fnac-darty.html</link>
      <pubDate>Mon, 26 Jan 2026 11:52:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322433</guid>
      <description>Du mouvement &#224; venir chez Fnac Darty ? Le milliardaire tch&#232;que veut devenir actionnaire majoritaire de l'enseigne culturelle la plus connue des Fran&#231;ais.</description>
    </item>
    <item>
      <title>Make stealing time a crime: How to protect your most valuable resource</title>
      <link>https://www.fastcompany.com/91465220/make-stealing-time-a-crime-how-to-protect-your-most-valuable-resource-time-management</link>
      <pubDate>2026-01-26T11:52:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91465220/make-stealing-time-a-crime-how-to-protect-your-most-valuable-resource-time-management</guid>
      <description>Time has become the ultimate luxury. Here&#8217;s how to guard it.
I&#8217;m always amazed at how easily we give our time to others without thinking, and then are mad later when it was wasted. What exactly did we think was going to happen? That everyone was going to be prepared, productive, and appreciative?&#160;</description>
    </item>
    <item>
      <title>In defence of awful laptops: how trash hardware can actually improve your life</title>
      <link>https://www.techradar.com/computing/laptops/in-defence-of-awful-laptops-how-trash-hardware-can-actually-improve-your-life</link>
      <pubDate>Mon, 26 Jan 2026 11:49:56 +0000</pubDate>
      <guid isPermaLink="false">pzDfcaEKk8T44SF4Sjt5V3</guid>
      <description>The memory sucks, the Wi-Fi drops, it&#8217;s ridiculously uncomfortable &#8212; and I&#8217;ve never been more productive.</description>
    </item>
    <item>
      <title>A big British audio brand just launched Bluetooth speakers that give off major JBL vibes &#8212; but for way cheaper</title>
      <link>https://www.techradar.com/audio/wireless-bluetooth-speakers/a-big-british-audio-brand-just-launched-bluetooth-speakers-that-give-off-major-jbl-vibes-but-for-way-cheaper</link>
      <pubDate>Mon, 26 Jan 2026 11:47:31 +0000</pubDate>
      <guid isPermaLink="false">YbSKU5JHgoxgJBx86whyjS</guid>
      <description>Majority launches four new portable speakers with rugged good looks</description>
    </item>
    <item>
      <title>Most workplace AI projects are stuck at the concept stage - so what can be done to improve this?</title>
      <link>https://www.techradar.com/pro/most-workplace-ai-projects-are-stuck-at-the-concept-stage-so-what-can-be-done-to-improve-this</link>
      <pubDate>Mon, 26 Jan 2026 11:41:11 +0000</pubDate>
      <guid isPermaLink="false">wZGut4DxNU8NxkLPRetxgR</guid>
      <description>Many companies are struggling to shift from early pilot stages to successful ROI when it comes to agentic AI.</description>
    </item>
    <item>
      <title>Les soldes frappent Intersport et ce v&#233;lo &#233;lectrique E-Gravel avec 100 km d&#8217;autonomie et une r&#233;duction de 400 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2954899_les-soldes-frappent-intersport-et-ce-velo-electrique-e-gravel-avec-100-km-dautonomie-et-une-reduction-de-400-e</link>
      <pubDate>Mon, 26 Jan 2026 11:37:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2954899_les-soldes-frappent-intersport-et-ce-velo-electrique-e-gravel-avec-100-km-dautonomie-et-une-reduction-de-400-e</guid>
      <description>
Le Nakamura E-Gravel est un VAE &#224; usage polyvalent pour faciliter tous vos d&#233;placements, &#224; retrouver pour 1699,99 euros au lieu de 2099,99 euros sur Intersport.
</description>
    </item>
    <item>
      <title>The Blink Mini 2 plummets to an even lower price than Black Friday</title>
      <link>https://www.techradar.com/home/home-security/the-blink-mini-2-plummets-to-an-even-lower-price-than-black-friday</link>
      <pubDate>Mon, 26 Jan 2026 11:30:15 +0000</pubDate>
      <guid isPermaLink="false">J2DyCD29JTggwA3rJFFxxJ</guid>
      <description>The Blink Mini 2 is now even cheaper than Black Friday thanks to a 53% discount at Amazon</description>
    </item>
    <item>
      <title>Google Photos pourrait ressembler &#224; TikTok avec cet ajout</title>
      <link>https://www.frandroid.com/marques/google/2954893_google-photos-pourrait-ressembler-a-tiktok-avec-cet-ajout</link>
      <pubDate>Mon, 26 Jan 2026 11:27:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2954893_google-photos-pourrait-ressembler-a-tiktok-avec-cet-ajout</guid>
      <description>
Google a une solution pour vous faire scroller dans vos souvenirs en utilisant Google Gemini.
</description>
    </item>
    <item>
      <title>Amazon multiplie les offres &#224; l&#8217;approche de la derni&#232;re d&#233;marque : les 17 meilleurs deals &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2933045_amazon-multiplie-les-offres-a-lapproche-de-la-derniere-demarque-les-17-meilleurs-deals-a-saisir</link>
      <pubDate>Mon, 26 Jan 2026 11:21:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933045_amazon-multiplie-les-offres-a-lapproche-de-la-derniere-demarque-les-17-meilleurs-deals-a-saisir</guid>
      <description>
On attaque une nouvelle semaine de soldes d&#8217;hiver et, &#224; quelques jours de la derni&#232;re d&#233;marque, Amazon met les bouch&#233;es doubles avec des offres tr&#232;s attractives sur de nombreux produits tech, notamment des smartphones pliants, des vid&#233;oprojecteurs &#224; prix cass&#233;.
</description>
    </item>
    <item>
      <title>Researchers say Russian government hackers were behind attempted Poland power outage</title>
      <link>https://www.techradar.com/pro/security/researchers-say-russian-government-hackers-were-behind-attempted-poland-power-outage</link>
      <pubDate>Mon, 26 Jan 2026 11:20:00 +0000</pubDate>
      <guid isPermaLink="false">siHSs2p6gbiSG8BDrcWCY</guid>
      <description>ESET says Sandworm used a piece of malware called DynoWiper to carry out attack on Polish systems.</description>
    </item>
    <item>
      <title>Gemini Live sur Android r&#232;gle enfin le plus gros d&#233;faut de son interface</title>
      <link>https://www.01net.com/actualites/gemini-live-android-regle-plus-gros-defaut-interface.html</link>
      <pubDate>Mon, 26 Jan 2026 11:19:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322418</guid>
      <description>La version Android de Gemini Live va devenir bien plus simple &#224; utiliser gr&#226;ce &#224; un nouveau bouton d'action flottant.</description>
    </item>
    <item>
      <title>Cette technologie issue de SpaceX pourrait sauver les data centers de la surchauffe (et sans une goutte d&#8217;eau)</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2954993_cette-technologie-issue-de-spacex-pourrait-sauver-les-data-centers-de-la-surchauffe-et-sans-une-goutte-deau</link>
      <pubDate>Mon, 26 Jan 2026 11:10:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2954993_cette-technologie-issue-de-spacex-pourrait-sauver-les-data-centers-de-la-surchauffe-et-sans-une-goutte-deau</guid>
      <description>
La start-up am&#233;ricaine Karman Industries travaille sur une nouvelle technologie de refroidissement pour les data centers, n&#233;cessitant beaucoup moins d'espace,&#160;d'&#233;lectricit&#233;&#160;et, surtout, aucune eau.
</description>
    </item>
    <item>
      <title>ARM pour un gamer ? Lenovo pr&#233;parerait une pluie de mod&#232;les sous Nvidia N1</title>
      <link>https://www.frandroid.com/marques/lenovo/2954661_arm-pour-un-gamer-lenovo-preparerait-une-pluie-de-modeles-sous-nvidia-n1</link>
      <pubDate>Mon, 26 Jan 2026 11:04:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lenovo/2954661_arm-pour-un-gamer-lenovo-preparerait-une-pluie-de-modeles-sous-nvidia-n1</guid>
      <description>
Lenovo a laiss&#233; filer les r&#233;f&#233;rences de 7 nouveaux mod&#232;les de PC portables, dont un nouveau gamer Legion 7, &#233;quip&#233;s de puces Nvidia N1 et N1X. Une solution ARM attendue de longue date, et dont la commercialisation interviendrait dans le courant d'ann&#233;e 2026.
</description>
    </item>
    <item>
      <title>People Are Protesting Data Centers&#8212;but Embracing the Factories That Supply Them</title>
      <link>https://www.wired.com/story/data-center-criticism-factories-supply-us/</link>
      <pubDate>Mon, 26 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">69711b3cec79c86b7151d776</guid>
      <description>As the data center backlash grows, support is growing for server factories and the hundreds of jobs they&#8217;re expected to bring.</description>
    </item>
    <item>
      <title>The decline of Food52, Goop, Hodinkee&#8212;and the internet&#8217;s dream of content-to-commerce</title>
      <link>https://www.fastcompany.com/91469284/the-decline-of-food52-goop-hodinkee-and-the-internets-dream-of-content-to-commerce</link>
      <pubDate>2026-01-26T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91469284/the-decline-of-food52-goop-hodinkee-and-the-internets-dream-of-content-to-commerce</guid>
      <description>Content-driven commerce, once billed as the digital salvation for both publishing and retail, is no longer a viable business for either industry.
Remember how much fun it was to shop on the internet a decade ago? </description>
    </item>
    <item>
      <title>A play with no actors on stage? That&#8217;s the bet behind the world&#8217;s first play in mixed reality</title>
      <link>https://www.fastcompany.com/91476051/a-play-with-no-actors-on-stage-thats-the-bet-behind-an-ark</link>
      <pubDate>2026-01-26T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91476051/a-play-with-no-actors-on-stage-thats-the-bet-behind-an-ark</guid>
      <description>&#8216;An Ark&#8217; stars an ever-so-shrewd Ian McKellen, who isn&#8217;t really there.
When a stranger smiles at you, you smile back. That is why, when Sir Ian McKellen (The Lord of the Rings, X-Men, Amadeus) walked on the stage in front of me, looked me straight in the eye, and smiled at me, I smiled back. It was the polite thing to do. It was also completely unnecessary, because McKellen was not actually on the stage in front of me. He smiled at me through a pair of special glasses....</description>
    </item>
    <item>
      <title>Quitting your job might not solve your burnout. Here&#8217;s why</title>
      <link>https://www.fastcompany.com/91477528/quitting-your-job-might-not-solve-your-burnout-heres-why</link>
      <pubDate>2026-01-26T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91477528/quitting-your-job-might-not-solve-your-burnout-heres-why</guid>
      <description>Before handing in your resignation notice, pay attention to the way you work.
A lot of people chase bigger paychecks and fancier titles, convinced that their next role will&#160;finally&#160;make them happy. I know I did.</description>
    </item>
    <item>
      <title>These clever anti-ICE signs are taking over Minneapolis</title>
      <link>https://www.fastcompany.com/91480108/these-clever-anti-ice-signs-are-taking-over-minneapolis</link>
      <pubDate>2026-01-26T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480108/these-clever-anti-ice-signs-are-taking-over-minneapolis</guid>
      <description>Meet Burlesque, the local design team behind the municipal iconography-riffing  signage popping up on yard signs in and storefront windows.
Federal immigration agents stationed in Minneapolis need not read polls or confront protesters to know how the city feels about their presence. Walking around just about any neighborhood in the area lately should provide a glimpse into the vast sprawl of graffiti and homemade yard signs expressing residents&#8217; bone-deep aversion to ICE. One poster in particular, though, has been increasingly decorating the storefront windows of local restaurants, coffee shop...</description>
    </item>
    <item>
      <title>How Apple&#8217;s late AI adoption could transform from a weakness to a strength</title>
      <link>https://www.fastcompany.com/91480180/how-apples-late-ai-adoption-could-transform-from-a-weakness-to-a-strength</link>
      <pubDate>2026-01-26T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480180/how-apples-late-ai-adoption-could-transform-from-a-weakness-to-a-strength</guid>
      <description>Apple&#8217;s road to putting AI magic in its products has been a bruising one, but the company has precendent for turning being late into a strategic advantange.
Apple will turn its Siri assistant into a full-fledged chatbot by next year. The company is working on a personal AI device to compete with the one OpenAI is building with Jony Ive. And Apple is putting control over its AI strategy into new hands within the company. So say a flurry of new reports, all advancing the larger story that Apple is doing what it can to get itself back in the AI race.&#160;...</description>
    </item>
    <item>
      <title>Une question de n&#233;gociation, pourquoi Forza Horizon 6 n&#8217;aura pas de version fran&#231;aise</title>
      <link>https://www.frandroid.com/actualites-generales/2954877_une-question-de-negociation-pourquoi-forza-horizon-6-naura-pas-de-version-francaise</link>
      <pubDate>Mon, 26 Jan 2026 10:59:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2954877_une-question-de-negociation-pourquoi-forza-horizon-6-naura-pas-de-version-francaise</guid>
      <description>
Le jeu Forza Horizon 6 a eu droit &#224; une pr&#233;sentation tr&#232;s compl&#232;te. Elle cachait une mauvaise nouvelle pour les joueurs fran&#231;ais : l'absence de VF pour le jeu, une premi&#232;re dans la s&#233;rie.
</description>
    </item>
  </channel>
</rss>
