<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 19 Jan 2026 15:31:34 GMT</lastBuildDate>
    <item>
      <title>Les 10 smartphones les plus populaires de la semaine sur Frandroid : les nouveaux smartphones Android continuent de surfer sur leur succ&#232;s</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2491986_les-10-smartphones-les-plus-populaires-de-la-semaine-sur-frandroid-les-nouveaux-smartphones-android-continuent-de-surfer-sur-leur-succes</link>
      <pubDate>Mon, 19 Jan 2026 15:31:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2491986_les-10-smartphones-les-plus-populaires-de-la-semaine-sur-frandroid-les-nouveaux-smartphones-android-continuent-de-surfer-sur-leur-succes</guid>
      <description>
Pour notre top 10 des smartphones les plus populaires de la semaine sur Frandroid, les nouveaux appareils sous Android font leur apparition. Parmi eux : le Redmi Note 15 et le Magic 8 Lite.
</description>
    </item>
    <item>
      <title>E.Leclerc se fait plaisir et casse le prix de nombreux produits Tech &#224; la 2e d&#233;marque des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2945683_e-leclerc-se-fait-plaisir-et-casse-le-prix-de-nombreux-produits-tech-a-la-2e-demarque-des-soldes</link>
      <pubDate>Mon, 19 Jan 2026 15:27:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2945683_e-leclerc-se-fait-plaisir-et-casse-le-prix-de-nombreux-produits-tech-a-la-2e-demarque-des-soldes</guid>
      <description>
Les soldes d&#8217;hiver 2026 entament leur 2e d&#233;marque et E.Leclerc casse les prix des produits Tech. Smartphones, TV OLED, montres connect&#233;es, tablettes&#8230; On a retenu uniquement les offres vraiment int&#233;ressantes.
</description>
    </item>
    <item>
      <title>RAM price crisis gets worse (again) as DDR5 hits a new painful high &#8211; and a worrying trend is creeping in</title>
      <link>https://www.techradar.com/computing/memory/ram-price-crisis-gets-worse-again-as-ddr5-hits-a-new-painful-high-and-a-worrying-trend-is-creeping-in</link>
      <pubDate>Mon, 19 Jan 2026 15:25:46 +0000</pubDate>
      <guid isPermaLink="false">tBcoRs5rB3L32PREA9NJdX</guid>
      <description>RAM crisis just intensified as a report shows DDR5 is now 4.4x pricier than half a year ago.</description>
    </item>
    <item>
      <title>Why agentic AI pilots stall &#8211; and how to fix them</title>
      <link>https://www.techradar.com/pro/why-agentic-ai-pilots-stall-and-how-to-fix-them</link>
      <pubDate>Mon, 19 Jan 2026 15:23:11 +0000</pubDate>
      <guid isPermaLink="false">Mpjic87QprpUhuWnQnhXg8</guid>
      <description>Unlike generative AI tools, agentic AI act as autonomous agents that can reason, make decisions, and act across workflows to achieve goals.</description>
    </item>
    <item>
      <title>Ces montres de sport font le plein de nouveaut&#233;s : 20 nouvelles applis pour booster vos entra&#238;nements et votre sant&#233;</title>
      <link>https://www.frandroid.com/marques/amazfit/2947831_ces-montres-de-sport-font-le-plein-de-nouveautes-20-nouvelles-applis-pour-booster-vos-entrainements-et-votre-sante</link>
      <pubDate>Mon, 19 Jan 2026 15:23:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazfit/2947831_ces-montres-de-sport-font-le-plein-de-nouveautes-20-nouvelles-applis-pour-booster-vos-entrainements-et-votre-sante</guid>
      <description>
La marque de montres connect&#233;es Amazfit a annonc&#233; ce lundi l'arriv&#233;e de vingt applications suppl&#233;mentaires pour ses montres de sport. 
</description>
    </item>
    <item>
      <title>iPhone Air, MacBook Pro M5, AirPods Pro 3&#8230; Les 9 deals Apple &#224; ne pas rater durant les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2942985_iphone-air-macbook-pro-m5-airpods-pro-3-les-9-deals-apple-a-ne-pas-rater-durant-les-soldes</link>
      <pubDate>Mon, 19 Jan 2026 15:20:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2942985_iphone-air-macbook-pro-m5-airpods-pro-3-les-9-deals-apple-a-ne-pas-rater-durant-les-soldes</guid>
      <description>
Avec l'arriv&#233;e de la troisi&#232;me d&#233;marque, on continue de voir de belles offres, notamment sur les produits Apple : iPhone derni&#232;re g&#233;n&#233;ration, AirPods Max ou Pro 3, Apple Watch Series 11, voici toutes les offres &#224; saisir de la marque &#224; la pomme durant les soldes.
</description>
    </item>
    <item>
      <title>Nvidia accus&#233; d&#8217;avoir entra&#238;n&#233; ses IA sur des livres pirat&#233;s</title>
      <link>https://www.01net.com/actualites/nvidia-accuse-davoir-entraine-ses-ia-sur-des-livres-pirates.html</link>
      <pubDate>Mon, 19 Jan 2026 15:14:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320998</guid>
      <description>Le recours au &#171; fair use &#187; pour entra&#238;ner des mod&#232;les d&#8217;IA est de plus en plus contest&#233; par les ayants droit. Une plainte d&#233;pos&#233;e contre Nvidia aux &#201;tats-Unis accuse le groupe d&#8217;avoir exploit&#233; des livres pirat&#233;s sans autorisation, ce qui relance une fois encore le d&#233;bat sur les limites de cette exception juridique.</description>
    </item>
    <item>
      <title>AirTag deal: Get four of the Bluetooth trackers for $65</title>
      <link>https://www.engadget.com/deals/airtag-deal-get-four-of-the-bluetooth-trackers-for-65-202333107.html?src=rss</link>
      <pubDate>Mon, 19 Jan 2026 15:10:13 +0000</pubDate>
      <guid isPermaLink="false">24b60c33-f851-4bee-9d8b-9c00c8cc034a</guid>
      <description>Apple keeps most of its product pricing on a tight leash, but we do see the company's AirTags go on sale pretty frequently. Another cost cut has come around for this item just in time for the holidays. Amazon is currently selling a four-pack of AirTags for $65. At a third off the regular cost, that price is pretty close to the record low discount of $63 we've seen for these Bluetooth trackers.


AirTags can be useful for people who travel frequently, helping you to keep track of essentials like your passport as well as a way to keep tabs on luggage while you're on the go. If you do purchase so...</description>
    </item>
    <item>
      <title>Rendez votre cl&#233; HDMI Fire TV Stick plus rapide gr&#226;ce &#224; ces 5 &#233;tapes</title>
      <link>https://www.frandroid.com/marques/amazon/2947583_rendez-votre-cle-hdmi-fire-tv-stick-plus-rapide-grace-a-ces-5-etapes</link>
      <pubDate>Mon, 19 Jan 2026 15:01:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazon/2947583_rendez-votre-cle-hdmi-fire-tv-stick-plus-rapide-grace-a-ces-5-etapes</guid>
      <description>
Le Fire TV Stick d&#8217;Amazon est l&#8217;un des appareils de streaming les plus r&#233;pandus, notamment gr&#226;ce &#224; un co&#251;t d&#8217;acc&#232;s relativement bas et &#224; un large catalogue d&#8217;applications. Pourtant, m&#234;me les mod&#232;les r&#233;cents comme le Fire TV Stick 4K Max peuvent parfois ralentir, avec des menus qui deviennent moins fluides et des applications qui mettent davantage de temps &#224; s&#8217;ouvrir. Voici comment optimiser votre cl&#233;.
...</description>
    </item>
    <item>
      <title>&#8216;A Knight of the Seven Kingdoms&#8217; Kicks Off Its Delightful New &#8216;Game of Thrones&#8217; Adventure</title>
      <link>https://gizmodo.com/a-knight-of-the-seven-kingdoms-kicks-off-its-delightful-new-game-of-thrones-adventure-2000710409</link>
      <pubDate>Mon, 19 Jan 2026 15:00:13 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000710409</guid>
      <description>Peter Claffey and Dexter Sol Ansell star as George R.R. Martin's misfit heroes Dunk and Egg in the HBO series.</description>
    </item>
    <item>
      <title>Gamers love AI in game dev &#8212; they just don&amp;#8217;t know it yet, says Razer&amp;#8217;s CEO</title>
      <link>https://www.theverge.com/podcast/863361/razer-ceo-min-liang-tan-ces-2026-ai-gaming-project-ava-interview</link>
      <pubDate>2026-01-19T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=863361</guid>
      <description>We&#8217;re back to start the year off with a very special live interview with Razer CEO Min-Liang Tan, which we taped in front of a terrific audience at Brooklyn Bowl in Las Vegas during CES.&#160; Razer is obviously best known for making mice, keyboards, and gaming PCs in its signature black and bright green, with [&#8230;]</description>
    </item>
    <item>
      <title>Looking ahead to 2026: What&#8217;s next for Startup Battlefield 200</title>
      <link>https://techcrunch.com/2026/01/19/looking-ahead-to-2026-whats-next-for-startup-battlefield-200/</link>
      <pubDate>Mon, 19 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083590</guid>
      <description>See what to expect for Startup Battlefield 200 in 2026, the ultimate startup pitch competition on the global stage at TechCrunch Disrupt. Join the mailing list to be the first to know when applications drop.</description>
    </item>
    <item>
      <title>Biotics AI, Battlefield 2023, gains FDA approval for its AI-powered fetal ultrasound product</title>
      <link>https://techcrunch.com/2026/01/19/biotics-ai-battlefield-2023-gains-fda-approval-for-its-ai-powered-fetal-ultrasound-product/</link>
      <pubDate>Mon, 19 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083656</guid>
      <description>TechCrunch Disrupt Battlefield 2023 winner, Biotics AI, announced on Monday that it has received FDA clearance for its AI software that helps detect fetal abnormalities in ultrasound images.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Tuesday, January 20 (game #688)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-20-january-2026</link>
      <pubDate>Mon, 19 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">Kf3TVFxLe5G5obAnJHbNnL</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Tuesday, January 20 (game #1457)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-20-january-2026</link>
      <pubDate>Mon, 19 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">aqWVW5wYhnoehccmjUEfKJ</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Tuesday, January 20 (game #954)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-20-january-2026</link>
      <pubDate>Mon, 19 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">Yrw5QsF7e6k7wEgNdC3N8Q</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>Une temp&#234;te solaire majeure fonce vers la Terre : un sc&#233;nario rare est d&#233;sormais envisag&#233; d&#232;s cette nuit !</title>
      <link>https://www.futura-sciences.com/sciences/actualites/soleil-tempete-solaire-majeure-fonce-vers-terre-scenario-rare-desormais-envisage-cette-nuit-130311/#xtor%3DRSS-8</link>
      <pubDate>Mon, 19 Jan 2026 15:59:39 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/soleil-tempete-solaire-majeure-fonce-vers-terre-scenario-rare-desormais-envisage-cette-nuit-130311/#xtor%3DRSS-8</guid>
      <description>Une &#233;ruption solaire exceptionnelle. De la masse coronale &#233;ject&#233;e &#224; grande vitesse en direction de la Terre. Il n&#8217;en faut pas plus pour que les sp&#233;cialistes de la m&#233;t&#233;orologie spatiale lancent l&#8217;alerte. La temp&#234;te g&#233;omagn&#233;tique qui se pr&#233;pare pourrait &#234;tre m&#233;morable.</description>
    </item>
    <item>
      <title>Brochette de Matinale Tech&#8217; : notre programme Twitch de la semaine vous donne rendez-vous presque tous les jours</title>
      <link>https://www.frandroid.com/humanoid/emissions/2632585_brochette-de-matinale-tech-notre-programme-twitch-de-la-semaine-vous-donne-rendez-vous-presque-tous-les-jours</link>
      <pubDate>Mon, 19 Jan 2026 14:54:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/emissions/2632585_brochette-de-matinale-tech-notre-programme-twitch-de-la-semaine-vous-donne-rendez-vous-presque-tous-les-jours</guid>
      <description>
Notre programme Twitch de la semaine du lundi 19 janvier 2026, c&#8217;est juste ici : nous vous donnons rendez-vous mardi, mercredi, jeudi et vendredi sur notre cha&#238;ne Frandroidlive, pour quatre Matinales Tech' successives. Rien que &#231;a.
</description>
    </item>
    <item>
      <title>Threads has more global daily users than X on mobile for the first time</title>
      <link>https://www.engadget.com/social-media/threads-has-more-global-daily-users-than-x-on-mobile-for-the-first-time-144936831.html?src=rss</link>
      <pubDate>Mon, 19 Jan 2026 14:49:36 +0000</pubDate>
      <guid isPermaLink="false">581f775b-7a33-4948-b336-b3f600766894</guid>
      <description>Meta&#8217;s Threads is pulling further ahead of Elon Musk&#8217;s X on mobile, based on recent estimates from analytics firm Similarweb, Forbes reports. In the first stretch of January, Threads averaged roughly 143 million daily active users worldwide on mobile devices, compared with about 126 million for X.
Similarweb&#8217;s year-over-year snapshot shows Threads growing sharply, up 37.8 percent year-over-year, while X&#8217;s daily mobile audience fell 11.9 percent across the same period. The picture is more mixed in the US, where X still holds a narrow edge on mobile. Similarweb data puts X at about 21.2 million ...</description>
    </item>
    <item>
      <title>Si vous avez un Pixel 10, cette future mise &#224; jour va vous simplifier la vie</title>
      <link>https://www.frandroid.com/marques/google/2947687_si-vous-avez-un-pixel-10-cette-future-mise-a-jour-va-vous-simplifier-la-vie</link>
      <pubDate>Mon, 19 Jan 2026 14:48:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2947687_si-vous-avez-un-pixel-10-cette-future-mise-a-jour-va-vous-simplifier-la-vie</guid>
      <description>
Magic Cue &#233;tait d&#233;j&#224; l&#8217;une des fonctionnalit&#233;s les plus malines du Pixel 10, mais Google s&#8217;appr&#234;te visiblement &#224; le rendre nettement plus pratique au quotidien. Si vous vivez entre mails, billets d&#8217;avion num&#233;riques et listes de t&#226;ches, ce qui arrive risque de vous parler.
</description>
    </item>
    <item>
      <title>Il y a de belles affaires chez Carrefour lors des soldes: les 12 offres qui valent le coup</title>
      <link>https://www.frandroid.com/bons-plans/2941339_il-y-a-de-belles-affaires-chez-carrefour-lors-des-soldes-les-12-offres-qui-valent-le-coup</link>
      <pubDate>Mon, 19 Jan 2026 14:48:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2941339_il-y-a-de-belles-affaires-chez-carrefour-lors-des-soldes-les-12-offres-qui-valent-le-coup</guid>
      <description>
Une nouvelle semaine de promotions d&#233;marre chez Carrefour, et &#224; l&#8217;approche de la 3&#7497; d&#233;marque des soldes d&#8217;hiver, l&#8217;enseigne frappe fort avec de tr&#232;s belles offres sur une large s&#233;lection de produits Tech. T&#233;l&#233;viseurs, smartphones, PC portables&#8230; il y en a pour tous les go&#251;ts &#8201;!
</description>
    </item>
    <item>
      <title>This 5-foot lamp is a supersized tribute to the world&#8217;s most iconic pen</title>
      <link>https://www.theverge.com/tech/864127/seletti-bic-ballpoint-pen-pendant-lamp-maison-objet</link>
      <pubDate>2026-01-19T09:47:48-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864127</guid>
      <description>Seletti, an Italian design brand known for everything from furniture to tableware, has debuted an unusual tribute to an icon of design: the Bic Cristal pen. To celebrate its 75th anniversary, Seletti has supersized the pen and replaced its ink cartridge with a long LED-filled tube to illuminate your living room, office, or that closet [&#8230;]</description>
    </item>
    <item>
      <title>Tesla submerg&#233; par des milliers d&#8217;infractions potentielles de son syst&#232;me de conduite autonome FSD</title>
      <link>https://www.frandroid.com/marques/tesla/2947693_tesla-submerge-par-des-milliers-dinfractions-potentielles-de-son-systeme-de-conduite-autonome-fsd</link>
      <pubDate>Mon, 19 Jan 2026 14:42:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2947693_tesla-submerge-par-des-milliers-dinfractions-potentielles-de-son-systeme-de-conduite-autonome-fsd</guid>
      <description>
Alors qu'Elon Musk ne cesse de vanter les prouesses technologiques du syst&#232;me Full Self-Driving de Tesla, l'administration am&#233;ricaine de la s&#233;curit&#233; routi&#232;re serre la vis. Le constructeur vient d'obtenir cinq semaines suppl&#233;mentaires pour analyser plus de 8 000 signalements d'infractions commises par ses voitures &#233;lectriques en mode autonome.
</description>
    </item>
    <item>
      <title>Sold&#233;e &#224; -43 %, l&#8217;enceinte Bluetooth Sony 150 W avec effets lumineux, modes festif et karaok&#233; ambiance vos soir&#233;es</title>
      <link>https://www.frandroid.com/bons-plans/2947623_soldee-a-43-lenceinte-bluetooth-sony-150-w-avec-effets-lumineux-modes-festif-et-karaoke-ambiance-vos-soirees</link>
      <pubDate>Mon, 19 Jan 2026 14:34:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2947623_soldee-a-43-lenceinte-bluetooth-sony-150-w-avec-effets-lumineux-modes-festif-et-karaoke-ambiance-vos-soirees</guid>
      <description>
La Sony MHC-V13 est une enceinte Bluetooth avec de nombreuses fonctionnalit&#233;s festives sold&#233;e chez E.Leclerc pour 197,40 euros au lieu de 349,99 euros.
</description>
    </item>
    <item>
      <title>A Knight of the Seven Kingdoms gets a new 'in the weeks ahead' trailer &#8212; and HBO Max deserves a clout around the ear for how much it spoils</title>
      <link>https://www.techradar.com/streaming/hbo-max/a-knight-of-the-seven-kingdoms-gets-a-new-in-the-weeks-ahead-trailer-and-hbo-max-deserves-a-clout-around-the-ear-for-how-much-it-spoils</link>
      <pubDate>Mon, 19 Jan 2026 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">zH3fKLPCEkiHiyp2qcmmN8</guid>
      <description>A Knight of the Seven Kingdoms' new teaser bizarrely ruins many of its biggest surprises.</description>
    </item>
    <item>
      <title>Proton VPN kills off legacy OpenVPN configs in push for better security</title>
      <link>https://www.techradar.com/vpn/vpn-services/proton-vpn-kills-off-legacy-openvpn-configs-in-push-for-better-security</link>
      <pubDate>Mon, 19 Jan 2026 14:29:27 +0000</pubDate>
      <guid isPermaLink="false">RVdngjWBwFxpzedznWKAdV</guid>
      <description>If you manually configure your VPN on a router or legacy device, you have just weeks to update your credentials. Proton VPN is retiring older manual OpenVPN configs to enforce stronger encryption standards, though it promises to keep the protocol alive across its servers.</description>
    </item>
    <item>
      <title>3 ways to fall asleep faster, backed by decades of research</title>
      <link>https://www.fastcompany.com/91477290/3-ways-fall-asleep-faster-backed-decades-research</link>
      <pubDate>2026-01-19T14:17:32</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91477290/3-ways-fall-asleep-faster-backed-decades-research</guid>
      <description>Want to fall asleep faster? Here are three science-backed ways.
Struggling to&#160;fall asleep&#160;is irritating. Struggling to get enough sleep is&#160;at least partially debilitating.</description>
    </item>
    <item>
      <title>La 5G 2,1 GHz arrive enfin chez Free, voici ce que &#231;a va changer pour vous</title>
      <link>https://www.frandroid.com/marques/free/2947653_la-5g-21-ghz-arrive-enfin-chez-free-voici-ce-que-ca-va-changer-pour-vous</link>
      <pubDate>Mon, 19 Jan 2026 14:13:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2947653_la-5g-21-ghz-arrive-enfin-chez-free-voici-ce-que-ca-va-changer-pour-vous</guid>
      <description>
Free pr&#233;pare l'arriv&#233;e de la 5G 2,1 GHz, une bande de fr&#233;quence entre la 700 MHz et la 3,5 GHz. Concr&#232;tement, &#231;a change quoi ?
</description>
    </item>
    <item>
      <title>Why Trump&#8217;s Greenland standoff is sending gold soaring and crypto tumbling</title>
      <link>https://www.fastcompany.com/91477246/why-trumps-greenland-standoff-is-sending-gold-soaring-and-crypto-tumbling</link>
      <pubDate>2026-01-19T14:11:30</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91477246/why-trumps-greenland-standoff-is-sending-gold-soaring-and-crypto-tumbling</guid>
      <description>President Donald Trump&#8217;s latest tariff threats against Europe are pushing investors toward safe-haven assets and away from riskier bets like Bitcoin.
Chances are good that many investors are happy today is a holiday, and thus the stock markets are closed. That&#8217;s because over the weekend, President Donald Trump announced the threat of new tariffs levied against America&#8217;s most prominent European allies.&#160;...</description>
    </item>
    <item>
      <title>Asus may have made its last phone</title>
      <link>https://www.theverge.com/news/864116/asus-may-have-made-its-last-phone</link>
      <pubDate>2026-01-19T09:10:38-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864116</guid>
      <description>Asus chairman Jonney Shih told Taiwan's Inside that the company is done making phones for now, marking the end of its Zenfone and ROG Phone lines. "Asus will no longer add new mobile phone models in the future," Shih reportedly said (translated with Google Translate). He didn't entirely rule out a return though, instead saying [&#8230;]</description>
    </item>
    <item>
      <title>Cleaning up "AI workslop" is costing businesses hundreds of hours a week</title>
      <link>https://www.techradar.com/pro/cleaning-up-ai-workslop-is-costing-businesses-hundreds-of-hours-a-week</link>
      <pubDate>Mon, 19 Jan 2026 14:05:00 +0000</pubDate>
      <guid isPermaLink="false">7hbLwrmhJS7xwazbEnN469</guid>
      <description>Most workers agree AI boosts productivity, but it could be even better if these things were fixed.</description>
    </item>
    <item>
      <title>Animal Crossing: New Horizons added just enough to suck me back in</title>
      <link>https://www.theverge.com/games/863747/animal-crossing-new-horizons-update-3-0-switch-2-quality-of-life</link>
      <pubDate>2026-01-19T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=863747</guid>
      <description>Animal Crossing has always been anti-instant gratification. By design, you have to take your time, wait for days to pass in real time, and complete a seemingly endless list of chores to build a meaningful life with your animal friends. The slowness is part of its appeal. But with New Horizons, some of that slowness [&#8230;]</description>
    </item>
    <item>
      <title>What is the release date for Fallout season 2 episode 6 on Prime Video?</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/what-is-the-release-date-for-fallout-season-2-episode-6-on-prime-video</link>
      <pubDate>Mon, 19 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">rNoXg5AE7EMzx9khwCsGAQ</guid>
      <description>There are only three more episodes of Fallout season 2 left &#8211; here's when the next one will drop where you live.</description>
    </item>
    <item>
      <title>Images folles : regardez le v&#233;hicule le plus lourd jamais construit sur Terre transporter la m&#233;ga-fus&#233;e de la Nasa</title>
      <link>https://www.futura-sciences.com/sciences/actualites/artemis-ii-images-folles-regardez-vehicule-plus-lourd-jamais-construit-terre-transporter-mega-fusee-nasa-130306/#xtor%3DRSS-8</link>
      <pubDate>Mon, 19 Jan 2026 14:55:40 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/artemis-ii-images-folles-regardez-vehicule-plus-lourd-jamais-construit-terre-transporter-mega-fusee-nasa-130306/#xtor%3DRSS-8</guid>
      <description>C&#8217;est un &#233;v&#233;nement&#160;: le lanceur de la mission Artemis II tr&#244;ne d&#233;sormais sur le pas de tir du Kennedy Space Center, marquant en quelque sorte le d&#233;but du compte &#224; rebours pour le lancement de cette mission &#224; destination de la Lune. Un transfert qui aura dur&#233; 12 heures, effectu&#233; par un engin tout...</description>
    </item>
    <item>
      <title>Mais que pr&#233;pare donc Bouygues Telecom ? L&#8217;op&#233;rateur s&#8217;appr&#234;te &#224; faire une grosse annonce le 20 janvier</title>
      <link>https://www.frandroid.com/marques/bouygues-telecom/2947549_mais-que-prepare-donc-bouygues-telecom-loperateur-sapprete-a-faire-une-grosse-annonce-le-20-janvier</link>
      <pubDate>Mon, 19 Jan 2026 13:53:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bouygues-telecom/2947549_mais-que-prepare-donc-bouygues-telecom-loperateur-sapprete-a-faire-une-grosse-annonce-le-20-janvier</guid>
      <description>
2026 est un cap particulier pour Bouygues Telecom puisque l'op&#233;rateur f&#234;te ses 30 ans cette ann&#233;e. Et histoire de marquer le coup, la presse sp&#233;cialis&#233;e, dont Frandroid, est convi&#233;e &#224; une conf&#233;rence de presse d&#233;di&#233;e &#224; la pr&#233;sentation d'une nouveaut&#233;.
</description>
    </item>
    <item>
      <title>Gift the Lego Botanicals Bouquet of Roses this Valentines Day &#8212; save over $10 at Amazon</title>
      <link>https://mashable.com/article/jan-19-lego-botanicals-bouquet-of-roses-deal</link>
      <pubDate>Mon, 19 Jan 2026 13:52:19 +0000</pubDate>
      <guid isPermaLink="false">05DNuoeDT21ZjrsnSAiaC3M</guid>
      <description>As of Jan. 19, the Lego Botanicals Bouquet of Roses is on sale at its best price at Amazon of $47.95. Usually it's listed for $59.99, so this saves you 20%.</description>
    </item>
    <item>
      <title>Xiaomi met le paquet &#224; l&#8217;approche de la 3e d&#233;marque : les 12 offres &#224; prix imbattable pour les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2936033_xiaomi-met-le-paquet-a-lapproche-de-la-3e-demarque-les-12-offres-a-prix-imbattable-pour-les-soldes</link>
      <pubDate>Mon, 19 Jan 2026 13:51:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2936033_xiaomi-met-le-paquet-a-lapproche-de-la-3e-demarque-les-12-offres-a-prix-imbattable-pour-les-soldes</guid>
      <description>
Xiaomi est habitu&#233; &#224; casser les prix tout au long de l&#8217;ann&#233;e, mais c&#8217;est encore plus le cas pendant les soldes d'hiver. &#192; l'approche de la 3e d&#233;marque, les offres se multiplient, mais voici celles qui valent r&#233;ellement le coup. 
</description>
    </item>
    <item>
      <title>Microsoft expands Windows backup to include restore at first sign-in</title>
      <link>https://www.techradar.com/pro/microsoft-expands-windows-backup-to-include-restore-at-first-sign-in</link>
      <pubDate>Mon, 19 Jan 2026 13:48:55 +0000</pubDate>
      <guid isPermaLink="false">8D3rbCoMmgcgfREu9Ff4Cb</guid>
      <description>Windows 11 users will be able to restore settings to the very first sign-in.</description>
    </item>
    <item>
      <title>How Martin Luther King Jr. was a trailblazer in pushing for universal basic&#160;income</title>
      <link>https://www.fastcompany.com/91474138/how-martin-luther-king-jr-was-trailblazer-pushing-universal-basic-income</link>
      <pubDate>2026-01-19T13:41:44</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91474138/how-martin-luther-king-jr-was-trailblazer-pushing-universal-basic-income</guid>
      <description>King, an early advocate for universal basic income, was concerned about how automation might displace workers.
Each year on the holiday that bears his name, Martin Luther King Jr. is remembered for his immense contributions to the struggle for racial equality. What is less often remembered but equally important is that King saw the fight for racial equality as deeply intertwined with economic justice....</description>
    </item>
  </channel>
</rss>
