<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 22 Dec 2025 13:37:01 GMT</lastBuildDate>
    <item>
      <title>Le OnePlus 15R est un smartphone  facilement r&#233;parable</title>
      <link>https://www.frandroid.com/marques/oneplus/2917947_le-oneplus-15r-est-un-smartphone-facilement-reparable</link>
      <pubDate>Mon, 22 Dec 2025 13:31:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/oneplus/2917947_le-oneplus-15r-est-un-smartphone-facilement-reparable</guid>
      <description>
Le nouveau smartphone de OnePlus obtient un score de r&#233;parabilit&#233; de 8,5 sur 10. Une note qui pourrait s&#233;duire les acheteurs en qu&#234;te d'un appareil premium et durable.
</description>
    </item>
    <item>
      <title>La Banque Postale est en panne : c&#8217;est confirm&#233; une cyberattaque touche tous les services de la Poste</title>
      <link>https://www.frandroid.com/services/banque-en-ligne/2917771_la-banque-postale-est-en-panne-cest-confirme-une-cyberattaque-touche-tous-les-services-de-la-poste</link>
      <pubDate>Mon, 22 Dec 2025 13:30:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/banque-en-ligne/2917771_la-banque-postale-est-en-panne-cest-confirme-une-cyberattaque-touche-tous-les-services-de-la-poste</guid>
      <description>
Apr&#232;s une premi&#232;re panne d'envergure samedi, la Banque Postale est &#224; nouveau en panne ce lundi matin du 22 d&#233;cembre. La banque en ligne n'est pas la seule touch&#233;e, les autres services de La Poste subissent de plein fouet une panne informatique.
</description>
    </item>
    <item>
      <title>It&#8217;s finally time to retire the word &#8216;podcast&#8217;</title>
      <link>https://www.theverge.com/entertainment/842457/podcast-show-name-change</link>
      <pubDate>2025-12-22T08:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=842457</guid>
      <description>According to YouTube's 2025 Recap feature, the podcast I consumed the most on its platform was Seth Meyers' recurring segment "A Closer Look" on his show Late Night. Last year, I would have argued that this is not a podcast. That it is, in fact, a clip of a TV show. But in 2025, with [&#8230;]</description>
    </item>
    <item>
      <title>Asus Rog Xbox Ally : d&#233;j&#224; 120 &#8364; de remise pour cette console portable&#160;qui renferme un vrai PC</title>
      <link>https://www.frandroid.com/bons-plans/2890465_asus-rog-xbox-ally-deja-120-euros-de-remise-pour-cette-console-portable-qui-renferme-un-vrai-pc</link>
      <pubDate>Mon, 22 Dec 2025 13:21:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2890465_asus-rog-xbox-ally-deja-120-euros-de-remise-pour-cette-console-portable-qui-renferme-un-vrai-pc</guid>
      <description>
Bonne nouvelle pour ceux qui esp&#233;raient une baisse de prix sur la derni&#232;re console d&#8217;Asus, la ROG Xbox Ally : elle est d&#233;sormais propos&#233;e &#224; 479 euros au lieu de 599 euros.
</description>
    </item>
    <item>
      <title>Test de la Sharp HT-SBW320 : la finesse extr&#234;me au prix de l&#8217;immersion</title>
      <link>https://www.frandroid.com/marques/sharp/2892055_test-de-la-sharp-ht-sbw320-la-finesse-extreme-au-prix-de-limmersion</link>
      <pubDate>Mon, 22 Dec 2025 13:17:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sharp/2892055_test-de-la-sharp-ht-sbw320-la-finesse-extreme-au-prix-de-limmersion</guid>
      <description>
Une barre de son 2.1 ultra-compacte, compatible Dolby Atmos et DTS:X, qui mesure moins de 4 cm de hauteur. Sharp promet ici une int&#233;gration facile dans les espaces r&#233;duits. Mais la physique a ses lois immuables : peut-on vraiment concilier un format aussi fin avec un son cin&#233;ma digne de ce nom ?
</description>
    </item>
    <item>
      <title>&#171;&#160;Derniers jours &#224; ce prix&#160;&#187; : on conna&#238;t le nouveau prix du forfait B&amp;YOU Pure Fibre en janvier 2026</title>
      <link>https://www.frandroid.com/marques/bouygues-telecom/2917841_derniers-jours-a-ce-prix-le-forfait-byou-pure-fibre-pourrait-voir-son-prix-grimper-en-janvier-2026</link>
      <pubDate>Mon, 22 Dec 2025 13:13:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bouygues-telecom/2917841_derniers-jours-a-ce-prix-le-forfait-byou-pure-fibre-pourrait-voir-son-prix-grimper-en-janvier-2026</guid>
      <description>
La Pure Fibre de B&amp;YOU est de loin l'offre internet la plus int&#233;ressante du moment. Sans d&#233;codeur TV, sans t&#233;l&#233;phonie, sans chichis, juste le meilleur de la fibre et du Wi-Fi. Ce forfait s'appr&#234;te pourtant &#224; conna&#238;tre un changement majeur et on doute que ce soit en bien.
</description>
    </item>
    <item>
      <title>'We put the most pressure on ourselves' &#8212; Tomb Raider studio head on remaking one of the most iconic games of all time</title>
      <link>https://www.techradar.com/gaming/we-put-the-most-pressure-on-ourselves-tomb-raider-studio-head-on-remaking-one-of-the-most-iconic-games-of-all-time</link>
      <pubDate>Mon, 22 Dec 2025 13:12:25 +0000</pubDate>
      <guid isPermaLink="false">LcqGs3C584Z8wMM9hrux5G</guid>
      <description>A Tomb Raider: Legacy of Atlantis developer has talked about the upcoming remake. TechRadar attended the Q&amp;A session.</description>
    </item>
    <item>
      <title>Intel Nova Lake : la piste de puces monstrueuses se confirme pour lutter contre les Ryzen X3D d&#8217;AMD</title>
      <link>https://www.frandroid.com/marques/intel/2917667_intel-nova-lake-la-piste-de-puces-monstrueuses-se-confirme-pour-lutter-contre-les-ryzen-x3d-damd</link>
      <pubDate>Mon, 22 Dec 2025 13:08:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/intel/2917667_intel-nova-lake-la-piste-de-puces-monstrueuses-se-confirme-pour-lutter-contre-les-ryzen-x3d-damd</guid>
      <description>
Des informations relatives aux futures solutions Nova Lake, celles &#224; m&#233;moire cache bLLC, nous renseignent avec plus de certitude sur ce que pr&#233;pare Intel sur ce terrain. Et en l'occurrence, la firme sortirait les grands moyens pour concurrencer correctement les puissantes puces Ryzen 3D V-Cache d'AMD.
</description>
    </item>
    <item>
      <title>Google and Apple employees on US visas apparently told to avoid international travel</title>
      <link>https://www.techradar.com/pro/google-and-apple-employees-on-us-visas-apparently-told-to-avoid-international-travel</link>
      <pubDate>Mon, 22 Dec 2025 13:05:00 +0000</pubDate>
      <guid isPermaLink="false">Biu2gDYrEztb3ec7tEJ8Qc</guid>
      <description>Big Tech lawyers are warning employees not to leave the US, or they could face major delays re-entering.</description>
    </item>
    <item>
      <title>The best board games to gift and play with the family for the 2025 holiday season</title>
      <link>https://www.engadget.com/the-best-board-games-to-gift-and-play-with-the-family-for-the-2025-holiday-season-125529223.html?src=rss</link>
      <pubDate>Mon, 22 Dec 2025 13:01:27 +0000</pubDate>
      <guid isPermaLink="false">8b67d713-c1e1-4ea2-a3a8-ab47cde9ad9f</guid>
      <description>Once upon a time, a "board game" meant Monopoly or Risk. Then several brave souls dared to ask the question: "What if this was fun?" Thirty years later, we're blessed with tabletop games that challenge our minds, immerse us in other worlds and conjure good times with those we love &#8212; sometimes all three at once. For your gift-buying needs, we've put together a list of new favorites and returning classics that run the gamuts of genre and weight. If you're ready to push beyond Pictionary, read on.
Best board games to gift (and play) this holiday season




























Check out the re...</description>
    </item>
    <item>
      <title>J&#8217;ai conduit la Nio Firefly &#233;lectrique &#224; moins de 30 000 &#8364; : un comportement routier bluffant, mais deux points noirs pour l&#8217;Europe</title>
      <link>https://www.frandroid.com/marques/nio/2897897_jai-conduit-la-nio-firefly-electrique-a-moins-de-30-000-e-un-comportement-routier-bluffant-mais-deux-points-noirs-pour-leurope</link>
      <pubDate>Mon, 22 Dec 2025 13:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nio/2897897_jai-conduit-la-nio-firefly-electrique-a-moins-de-30-000-e-un-comportement-routier-bluffant-mais-deux-points-noirs-pour-leurope</guid>
      <description>
J'ai eu l'occasion de tester la Nio Firefly &#233;lectrique disponible en Europe &#224; moins de 30 000 &#8364; lors de trois &#233;v&#233;nements en Chine. La voiture a fait un certain buzz dans les r&#233;seaux sociaux avec sa version rallie. Nous avons pu conduire la version classique. Voici notre avis.
</description>
    </item>
    <item>
      <title>Readers&#8217; Choice Awards 2025: Your Favorite Phones, Laptops, Gaming Gear, and More</title>
      <link>https://gizmodo.com/gizmodo-best-tech-of-2025-readers-choice-awards-winners-2000701264</link>
      <pubDate>Mon, 22 Dec 2025 13:00:41 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000701264</guid>
      <description>You guys voted, and now we've got the winners for your favorite tech in 18 product categories.</description>
    </item>
    <item>
      <title>Grado Signature S750 Review: Insane Sound, Old-School Fit</title>
      <link>https://www.wired.com/review/grado-signature-s750/</link>
      <pubDate>Mon, 22 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">694585809a2366d9ce4b4437</guid>
      <description>These open-back headphones sound insane, but they aren't that comfortable.</description>
    </item>
    <item>
      <title>The best books we read in 2025</title>
      <link>https://www.theverge.com/entertainment/837661/books-favorites-2025</link>
      <pubDate>2025-12-22T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=837661</guid>
      <description>These days when you want to engage with some media, you can choose from podcasts, videos, games, live performances - or books, one of the oldest and most popular ways to learn something new or escape (at least temporarily) from today's troubled world. We polled the staff of The Verge to find out what books [&#8230;]</description>
    </item>
    <item>
      <title>How to pair controllers with the Nintendo Switch 2</title>
      <link>https://www.engadget.com/gaming/nintendo/how-to-pair-controllers-with-the-nintendo-switch-2-130000126.html?src=rss</link>
      <pubDate>Mon, 22 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">4facda1c-4b95-416f-85fa-fdfcd762b75e</guid>
      <description>The Nintendo Switch 2 supports a wide range of controllers, from Nintendo&#8217;s own Pro Controller to many Bluetooth gamepads you might already have. Whether you&#8217;re setting up your new console for the first time or adding extra controllers for multiplayer games, pairing them is simple as long as you know where to look. Here&#8217;s how to connect the Switch 2 Pro Controller, how to sync additional Bluetooth controllers and what to do if something doesn&#8217;t pair correctly.Before you start: What you&#8217;ll needTo pair any controller with the Switch 2 you&#8217;ll need the console powered on and updated to the latest ...</description>
    </item>
    <item>
      <title>Foldable phone makers have solved every issue except one</title>
      <link>https://www.engadget.com/mobile/smartphones/foldable-phone-makers-have-solved-every-issue-except-one-130000891.html?src=rss</link>
      <pubDate>Mon, 22 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">ccf4de1d-2c8f-47c2-a17b-d16f9bc33d9e</guid>
      <description>It might be hard to believe, but foldable phones have already been around for the better part of a decade. Granted, the first one I saw back in 2019 &#8212; which actually predates Samsung's Galaxy Fold &#8212; was a cobbled-together mess. But since then, phone makers have been steadily iterating and tweaking their designs, and this year,&#160; manufacturers have finally addressed all the major issues about foldable phones except one: price.Let&#8217;s go back to the OG Fold. Even though it was chunky and heavy, had a tiny exterior display and suffered from a hinge that let too much detritus inside (which is probabl...</description>
    </item>
    <item>
      <title>Oppo Find X9 Ultra&#160;: son id&#233;e audacieuse pour d&#233;passer Samsung en photo</title>
      <link>https://www.01net.com/actualites/oppo-find-x9-ultra-son-idee-audacieuse-pour-depasser-samsung-en-photo.html</link>
      <pubDate>Mon, 22 Dec 2025 12:56:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316573</guid>
      <description>Le prochain Oppo&#8239;Find&#8239;X9&#8239;Ultra pourrait bien red&#233;finir la photographie mobile, avec deux capteurs de 200&#8239;Mpx et un double t&#233;l&#233;objectif dont l&#8217;un atteindrait un zoom optique &#233;quivalent&#8239;X10. S&#8217;il voyait le jour, il offrirait une port&#233;e th&#233;orique allant jusqu&#8217;&#224; 460&#8239;mm et pourrait m&#234;me inaugurer le tout premier capteur 200&#8239;Mpx sign&#233;&#8239;Sony.</description>
    </item>
    <item>
      <title>Federal judge blocks Louisiana&#8217;s social media age verification law &#8211; here's why</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/federal-judge-blocks-louisianas-social-media-age-verification-law-heres-why</link>
      <pubDate>Mon, 22 Dec 2025 12:47:54 +0000</pubDate>
      <guid isPermaLink="false">DuVQ3aMJTjMU3QxsTbgfKB</guid>
      <description>Another state-level attempt to enforce age verification on social media has been blocked. A federal judge ruled Louisiana's Act 456 unconstitutional, citing major privacy and First Amendment concerns.</description>
    </item>
    <item>
      <title>ChatGPT 5.2 peut devenir plus chaleureux gr&#226;ce &#224; ce r&#233;glage</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2917711_chatgpt-5-2-peut-devenir-plus-chaleureux-grace-a-ce-reglage</link>
      <pubDate>Mon, 22 Dec 2025 12:38:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2917711_chatgpt-5-2-peut-devenir-plus-chaleureux-grace-a-ce-reglage</guid>
      <description>
OpenAI d&#233;voile un nouveau r&#233;glage permettant d'ajuster la personnalit&#233; de ChatGPT. De quoi ajouter un peu de chaleur dans un mod&#232;le robotique parfois insolent. 
</description>
    </item>
    <item>
      <title>Quels sont les meilleurs aspirateurs balais laveurs en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/2845805_notre-selection-des-meilleurs-balais-laveurs</link>
      <pubDate>Mon, 22 Dec 2025 12:30:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2845805_notre-selection-des-meilleurs-balais-laveurs</guid>
      <description>
Les aspirateurs balai laveurs combinent l'aspiration des sols avec un lavage &#224; l'eau propre, qui peut m&#234;me &#234;tre combin&#233; avec de la vapeur ou du d&#233;tergent. Voici notre s&#233;lection des meilleurs mod&#232;les d'aspirateurs balais laveurs.
</description>
    </item>
    <item>
      <title>NHS England tech provider reveals data breach - DXS International hit by ransomware</title>
      <link>https://www.techradar.com/pro/security/nhs-england-tech-provider-reveals-data-breach-dxs-international-hit-by-ransomware</link>
      <pubDate>Mon, 22 Dec 2025 12:20:00 +0000</pubDate>
      <guid isPermaLink="false">DwAuHBKsXWAoT5SXxDLdoZ</guid>
      <description>DXS International was hit by ransomware, but we don't know if any files were stolen.</description>
    </item>
    <item>
      <title>Juste avant No&#235;l, le Realme 12 Pro dot&#233; d&#8217;un &#233;cran OLED 120 Hz s&#8217;offre une r&#233;duction de 53 % sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2917775_juste-avant-noel-le-realme-12-pro-dote-dun-ecran-oled-120-hz-soffre-une-reduction-de-53-sur-amazon</link>
      <pubDate>Mon, 22 Dec 2025 12:17:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2917775_juste-avant-noel-le-realme-12-pro-dote-dun-ecran-oled-120-hz-soffre-une-reduction-de-53-sur-amazon</guid>
      <description>
Le Realme 12 Pro est un smartphone abordable qui dispose d'une autonomie tr&#232;s honn&#234;te, mais surtout d'un solide duo d'appareils photo &#224; l'arri&#232;re. Pour faire plaisir &#224; un proche en cette p&#233;riode de f&#234;tes, il perd 53 % de son prix chez Amazon.
</description>
    </item>
    <item>
      <title>'It's business as usual. The app is working, warranties will be honored' &#8212; iRobot CEO reassures Roomba owners following takeover</title>
      <link>https://www.techradar.com/home/robot-vacuums/its-business-as-usual-the-app-is-working-warranties-will-be-honored-irobot-ceo-reassures-roomba-owners-following-takeover</link>
      <pubDate>Mon, 22 Dec 2025 12:14:15 +0000</pubDate>
      <guid isPermaLink="false">m2p9gkQTj4PKw5Jo2JZacj</guid>
      <description>Your Roomba is not about to become an expensive doorstop, promises company boss.</description>
    </item>
    <item>
      <title>Nouvelle fuite chez Chronopost&#160;? Un pirate affirme avoir vol&#233; les donn&#233;es de 860&#160;000 Fran&#231;ais</title>
      <link>https://www.01net.com/actualites/nouvelle-fuite-chez-chronopost-pirate-affirme-avoir-vole-donnees-860-000-francais.html</link>
      <pubDate>Mon, 22 Dec 2025 12:11:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316574</guid>
      <description>Chronopost aurait subi une nouvelle fuite de donn&#233;es. Sur BreachForums, un pirate affirme avoir mis la main sur les donn&#233;es li&#233;es &#224; 860 000 colis exp&#233;di&#233;s en France. Les informations auraient &#233;t&#233; exfiltr&#233;es par le biais du r&#233;seau de points relais Pickup.</description>
    </item>
    <item>
      <title>The Best Japanese Planners (2026): Hobonichi Techo, Kokuyo Jibun Techo</title>
      <link>https://www.wired.com/story/japanese-planners-explained/</link>
      <pubDate>Mon, 22 Dec 2025 12:09:00 +0000</pubDate>
      <guid isPermaLink="false">6943153b817d759947370743</guid>
      <description>Are Japanese planners like the Hobonichi really better than American planners? Here&#8217;s where they differ and why you might want to switch.</description>
    </item>
    <item>
      <title>ChatGPT&#8217;s new personality settings let you pick the vibe &#8212; and it ranges from corporate calm to chaotic bestie</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/chatgpts-new-personality-settings-let-you-pick-the-vibe-and-it-ranges-from-corporate-calm-to-chaotic-bestie</link>
      <pubDate>Mon, 22 Dec 2025 12:06:00 +0000</pubDate>
      <guid isPermaLink="false">d2aCUt7pArPjh3RUfGUiyG</guid>
      <description>I tried ChatGPT&#8217;s personality settings &#8211; and it went from office small talk to full-on brunch BFF energy.</description>
    </item>
    <item>
      <title>AI Mate in Wondershare Filmora V15: a new era of intelligent video creation</title>
      <link>https://gizmodo.com/ai-mate-in-wondershare-filmora-v15-a-new-era-of-intelligent-video-creation-2000700107</link>
      <pubDate>Mon, 22 Dec 2025 12:05:47 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000700107</guid>
      <description>Faster, smarter workflows and more powerful tools&#8212;with AI integrated.</description>
    </item>
    <item>
      <title>Watch out &#8211; RAM rip-offs are now in vogue, so here's how to avoid falling for high-end memory scams</title>
      <link>https://www.techradar.com/computing/memory/watch-out-ram-rip-offs-are-now-in-vogue-so-heres-how-to-avoid-falling-for-high-end-memory-scams</link>
      <pubDate>Mon, 22 Dec 2025 12:04:52 +0000</pubDate>
      <guid isPermaLink="false">fCmrTiMzBTbPTfQJXKP6vQ</guid>
      <description>Forget 'rock in a box' GPUs, high-end RAM scams are now being reported &#8211; here's how to avoid getting stung.</description>
    </item>
    <item>
      <title>LG announces next-gen version of its best OLED TV tech &#8212; oh, and it&#8217;s changing the name</title>
      <link>https://www.techradar.com/televisions/lg-announces-next-gen-version-of-its-best-oled-tv-tech-oh-and-its-changing-the-name</link>
      <pubDate>Mon, 22 Dec 2025 12:03:50 +0000</pubDate>
      <guid isPermaLink="false">44skjnkSWxchGroGw2aD4W</guid>
      <description>LG sets the stage for the next G-series OLED TV and multiple gaming monitors</description>
    </item>
    <item>
      <title>La Chine affirme avoir son &#171;&#160;Nvidia killer&#160;&#187;, Moore Threads d&#233;voile Huagang avec de premiers chiffres</title>
      <link>https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2918269_la-chine-affirme-avoir-son-nvidia-killer-moore-threads-devoile-huagang-avec-de-premiers-chiffres</link>
      <pubDate>Mon, 22 Dec 2025 12:01:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2918269_la-chine-affirme-avoir-son-nvidia-killer-moore-threads-devoile-huagang-avec-de-premiers-chiffres</guid>
      <description>
Multiplier les performances par 15 d'une g&#233;n&#233;ration &#224; l'autre ? M&#234;me Nvidia n'ose pas promettre &#231;a. C'est pourtant ce que clame Moore Threads avec sa nouvelle puce "Lushan". Avec 64 Go de m&#233;moire et une compatibilit&#233; DirectX 12 Ultimate, le constructeur chinois veut prouver qu'il existe. Reste &#224; voir si les drivers suivront enfin le mat&#233;riel.
</description>
    </item>
    <item>
      <title>&#8216;Avatar: Fire and Ash&#8217; Gets Off To a Hot Theatrical Start</title>
      <link>https://gizmodo.com/avatar-fire-and-ash-gets-off-to-a-hot-theatrical-start-2000702376</link>
      <pubDate>Mon, 22 Dec 2025 12:00:24 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702376</guid>
      <description>Domestic audiences didn't fully turn up for 'Avatar: Fire and Ash,' but the international market may help it rake in end-of-year dough.</description>
    </item>
    <item>
      <title>I&#8217;ve driven Kia&#8217;s debut electric van and it&#8217;s one of the most convincing electric people-movers out there</title>
      <link>https://www.techradar.com/vehicle-tech/hybrid-electric-vehicles/ive-driven-kias-debut-electric-van-and-its-one-of-the-most-convincing-electric-people-movers-out-there</link>
      <pubDate>Mon, 22 Dec 2025 12:00:15 +0000</pubDate>
      <guid isPermaLink="false">RbbHSP42QNCAH7yGh3EMdF</guid>
      <description>Forget your big SUVs, Kia's debut electric van makes people carriers cool.</description>
    </item>
    <item>
      <title>The 4 key takeaways from business leaders in 2025</title>
      <link>https://www.fastcompany.com/91460518/the-4-key-takeaways-from-business-leaders-in-2025</link>
      <pubDate>2025-12-22T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91460518/the-4-key-takeaways-from-business-leaders-in-2025</guid>
      <description>Navigating uncertainty and managing AI were two of the year&#8217;s key lessons that leaders shared with Modern CEO.
Hello and welcome to Modern CEO! Each week this newsletter explores inclusive approaches to leadership drawn from conversations with executives and entrepreneurs, and from the pages of Inc. and Fast Company. If you received this newsletter from a friend, you can sign up to get it yourself every Monday morning....</description>
    </item>
    <item>
      <title>Intel pr&#233;pare un revival de ses puces de bureau &#171; Arrow Lake &#187; : voici ce que vous devez savoir</title>
      <link>https://www.frandroid.com/marques/intel/2918039_intel-prepare-un-revival-de-ses-puces-de-bureau-arrow-lake-voici-ce-que-vous-devez-savoir</link>
      <pubDate>Mon, 22 Dec 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/intel/2918039_intel-prepare-un-revival-de-ses-puces-de-bureau-arrow-lake-voici-ce-que-vous-devez-savoir</guid>
      <description>
En parall&#232;le du lancement de ses puces mobiles Panther Lake, Intel devrait profiter du CES 2026 pour lever le voile sur un refresh de ses processeurs de bureau Arrow Lake-S, lanc&#233;s initialement &#224; l'automne 2024. Voici ce qu'il faudrait en attendre.
</description>
    </item>
    <item>
      <title>Google Gemini is now heading to fridges &#8212; and it might actually be useful</title>
      <link>https://www.techradar.com/home/smart-home/google-gemini-is-now-heading-to-fridges-and-it-might-actually-be-useful</link>
      <pubDate>Mon, 22 Dec 2025 11:43:29 +0000</pubDate>
      <guid isPermaLink="false">uc3Jna6zPVAsGJL9LHFMWF</guid>
      <description>Ready for Gemini to take over your fridge? Based on Samsung's new announcement, you might want it.</description>
    </item>
    <item>
      <title>Forget job hunting. Gen Z is &#8216;growth hunting&#8217;</title>
      <link>https://www.fastcompany.com/91452297/the-rise-of-growth-hunting-why-gen-z-changes-jobs-so-oftengenz-job-hopping</link>
      <pubDate>2025-12-22T11:41:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91452297/the-rise-of-growth-hunting-why-gen-z-changes-jobs-so-oftengenz-job-hopping</guid>
      <description>They&#8217;re not chasing titles. They&#8217;re chasing momentum.
When I talk with business leaders about Gen Z, the same frustration often bubbles up: &#8220;They won&#8217;t stay.&#8221; It&#8217;s said with a kind of bewildered shrug, as if the younger generation has suddenly rewritten the rules out of thin air. I heard it again last week during a radio segment I did about generational dynamics at work. The host asked why Gen Z feels so comfortable moving on so quickly....</description>
    </item>
    <item>
      <title>Dreame veut devenir le nouveau Xiaomi, mais prend le probl&#232;me &#224; l&#8217;envers</title>
      <link>https://www.frandroid.com/marques/dreame/2918201_dreame-veut-devenir-le-nouveau-xiaomi-mais-prend-le-probleme-a-lenvers</link>
      <pubDate>Mon, 22 Dec 2025 11:39:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dreame/2918201_dreame-veut-devenir-le-nouveau-xiaomi-mais-prend-le-probleme-a-lenvers</guid>
      <description>
Vous connaissez Dreame pour ses aspirateurs robots. Mais oubliez la poussi&#232;re un instant. La marque chinoise pr&#233;pare un virage &#224; 180 degr&#233;s avec le Dreame E1, un smartphone qui doit devenir la t&#233;l&#233;commande de votre maison. 
</description>
    </item>
    <item>
      <title>Nano Banana s&#8217;offre un look professionnel dans Google Messages</title>
      <link>https://www.frandroid.com/marques/google/2917781_nano-banana-soffre-un-look-professionnel-dans-google-messages</link>
      <pubDate>Mon, 22 Dec 2025 11:38:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2917781_nano-banana-soffre-un-look-professionnel-dans-google-messages</guid>
      <description>
Le g&#233;n&#233;rateur d'images &#224; la sauce Gemini 3 de Google s'offre une nouvelle interface dans l'application Google Messages.&#160;
</description>
    </item>
  </channel>
</rss>
