<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 24 Nov 2025 07:35:12 GMT</lastBuildDate>
    <item>
      <title>Galaxy S26 Ultra : Samsung sortirait enfin de sa l&#233;thargie sur la batterie et la vitesse de charge, il &#233;tait temps</title>
      <link>https://www.frandroid.com/marques/samsung/2882375_galaxy-s26-ultra-samsung-sortirait-enfin-de-sa-lethargie-sur-la-batterie-et-la-vitesse-de-charge-il-etait-temps</link>
      <pubDate>Mon, 24 Nov 2025 07:28:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2882375_galaxy-s26-ultra-samsung-sortirait-enfin-de-sa-lethargie-sur-la-batterie-et-la-vitesse-de-charge-il-etait-temps</guid>
      <description>
C'est peut-&#234;tre la fin d'une &#232;re frustrante. Depuis le Galaxy S20 Ultra, Samsung nous sert la m&#234;me recette : 5000 mAh et une charge qui plafonne. Mais selon les derni&#232;res informations, le S26 Ultra adopterait une capacit&#233; de 5200 mAh et du Qi2 magn&#233;tique, sans oublier une vitesse de charge bien plus rapide. Il &#233;tait temps.
</description>
    </item>
    <item>
      <title>Face &#224; Google Gemini 3, Sam Altman tire la sonnette d&#8217;alarme en interne</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2882363_face-a-google-gemini-3-sam-altman-tire-la-sonnette-dalarme-en-interne</link>
      <pubDate>Mon, 24 Nov 2025 07:17:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2882363_face-a-google-gemini-3-sam-altman-tire-la-sonnette-dalarme-en-interne</guid>
      <description>
Apr&#232;s des mois &#224; parader comme le ma&#238;tre incontest&#233; de l'IA, le masque tombe chez OpenAI. Une note interne de Sam Altman, r&#233;v&#233;l&#233;e par The Information, dresse un constat brutal : l'ambiance est morose, Google est revenu dans la course, et la croissance risque de caler.
</description>
    </item>
    <item>
      <title>Xiaomi&#160;: ce smartphone tr&#232;s populaire ne recevra plus de mise &#224; jour majeure</title>
      <link>https://www.01net.com/actualites/xiaomi-smartphone-tres-populaire-recevra-plus-mise-a-jour.html</link>
      <pubDate>Mon, 24 Nov 2025 07:01:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310524</guid>
      <description>Xiaomi met &#224; jour sa liste des appareils compatibles avec sa nouvelle interface HyperOS 3. Certains mod&#232;les pourtant tr&#232;s proches ne profitent malheureusement pas tous du m&#234;me traitement.</description>
    </item>
    <item>
      <title>Europe Is Bending the Knee to the US on Tech Policy</title>
      <link>https://www.wired.com/story/europe-bends-us-digital-policies-eu-ai-act/</link>
      <pubDate>Mon, 24 Nov 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">691ce993426eddd4340b7d49</guid>
      <description>The Trump administration's pressure on European regulators is having an impact, with fewer restrictions on Big Tech and canceled measures.</description>
    </item>
    <item>
      <title>Closing the wealth gap: The solution is hiding in plain sight</title>
      <link>https://www.fastcompany.com/91446200/closing-the-wealth-gap-the-solution-hiding-in-plain-sight</link>
      <pubDate>2025-11-24T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91446200/closing-the-wealth-gap-the-solution-hiding-in-plain-sight</guid>
      <description>And the timing to make lasting change could not be better.
When an X user recently pointed out the eye-popping increase in billionaires&#8217; wealth since 2015, entrepreneur Mark Cuban, a billionaire himself, responded with his opinion on why, but he urged followers to consider a different question:</description>
    </item>
    <item>
      <title>Test du Hasselblad X2D II 100C : la photo, rien que la photo, mais en grand</title>
      <link>https://www.frandroid.com/produits-android/photo/appareil-photo/2873711_test-du-hasselblad-x2d-ii-100c-la-photo-rien-que-la-photo-mais-en-grand</link>
      <pubDate>Mon, 24 Nov 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/photo/appareil-photo/2873711_test-du-hasselblad-x2d-ii-100c-la-photo-rien-que-la-photo-mais-en-grand</guid>
      <description>
Le Hasselblad X2D II 100C aligne un immense capteur moyen format de 100 m&#233;gapixels, une stabilisation nettement renforc&#233;e et un HDR tr&#232;s inspir&#233; du smartphone, tout en restant un bo&#238;tier radicalement photo, sans vid&#233;o ni compromis. Son tarif demeure &#233;litiste, malgr&#233; une baisse d&#8217;environ 1 000 &#8364; par rapport au X2D, mais il promet une qualit&#233; d&#8217;image qui interroge : jusqu&#8217;o&#249; peut-on vraiment pousser le moyen format en usage &#8220;terrain&#8221; ?
...</description>
    </item>
    <item>
      <title>Clearview&#160;: cette soci&#233;t&#233; US continue de scanner vos visages malgr&#233; les amendes en Europe, r&#233;cit d&#8217;un incroyable imbroglio</title>
      <link>https://www.01net.com/actualites/clearview-cette-societe-us-continue-de-scanner-vos-visages-malgre-les-amendes-en-europe-recit-dun-incroyable-imbroglio.html</link>
      <pubDate>Mon, 24 Nov 2025 06:55:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1303518</guid>
      <description>Clearview AI, c'est l'histoire d'une soci&#233;t&#233; am&#233;ricaine qui ignore les d&#233;cisions administratives et les amendes &#233;dict&#233;es par l'Europe &#171;&#160;gr&#226;ce &#224; &#187; un vide juridique et une absence de coop&#233;ration diplomatique de Washington. On vous explique cet incroyable imbroglio dont nous sommes les grands perdants.</description>
    </item>
    <item>
      <title>Le t&#233;l&#233;viseur TCL Mini LED &#171; qui&#160;fait sensation&#160;&#187; est &#224; un prix imbattable pour le Black Friday [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/tv-connectee-produits/2875395_le-televiseur-tcl-mini-led-qui-fait-sensation-est-a-un-prix-imbattable-pour-le-black-friday</link>
      <pubDate>Mon, 24 Nov 2025 06:41:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/tv-connectee-produits/2875395_le-televiseur-tcl-mini-led-qui-fait-sensation-est-a-un-prix-imbattable-pour-le-black-friday</guid>
      <description>
En affichant le t&#233;l&#233;viseur TCL 65C89K sous la barre des 1 000 euros, Boulanger nous offre ici l'une des meilleures offres du Black Friday. 
</description>
    </item>
    <item>
      <title>Vous aussi, vous voulez le nouvel AirDrop des Pixel&#160;10&#8201;? Qualcomm a une bonne nouvelle pour vous</title>
      <link>https://www.frandroid.com/marques/qualcomm/2882351_vous-aussi-vous-voulez-le-nouvel-airdrop-des-pixel-10-qualcomm-a-une-bonne-nouvelle-pour-vous</link>
      <pubDate>Mon, 24 Nov 2025 06:31:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/qualcomm/2882351_vous-aussi-vous-voulez-le-nouvel-airdrop-des-pixel-10-qualcomm-a-une-bonne-nouvelle-pour-vous</guid>
      <description>
Peu de temps apr&#232;s l&#8217;annonce surprise de Google indiquant qu&#8217;il &#233;tait d&#233;sormais possible de partager des fichiers en AirDrop depuis Android, le fabricant de puces Qualcomm a embray&#233; derri&#232;re le g&#233;ant de la recherche.
</description>
    </item>
    <item>
      <title>01net morning&#160;: pourquoi la bulle de l&#8217;IA n&#8217;a pas (encore) &#233;clat&#233;, on parle au pirate d&#8217;une arnaque, la v&#233;rit&#233; sur la recharge rapide de l&#8217;iPhone 17</title>
      <link>https://www.01net.com/actualites/01net-morning-pourquoi-la-bulle-de-lia-na-pas-encore-eclate-on-parle-au-pirate-dune-arnaque-la-verite-sur-la-recharge-rapide-de-liphone-17.html</link>
      <pubDate>Mon, 24 Nov 2025 06:30:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310468</guid>
      <description>Bonjour &#224; tous, voici la matinale de 01net ! Qu&#8217;avez-vous manqu&#233; ce week-end ? Retrouvez toute l&#8217;actu &#224; connaitre pour d&#233;marrer la semaine du bon pied !</description>
    </item>
    <item>
      <title>Shadow casse ses prix pendant la Black Friday Week : votre PC gaming dans le cloud avec jusqu&#8217;&#224; 32 % de remise</title>
      <link>https://www.frandroid.com/bons-plans/2881113_shadow-casse-ses-prix-pendant-la-black-friday-week-votre-pc-gaming-dans-le-cloud-avec-jusqua-32-de-remise</link>
      <pubDate>Mon, 24 Nov 2025 06:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2881113_shadow-casse-ses-prix-pendant-la-black-friday-week-votre-pc-gaming-dans-le-cloud-avec-jusqua-32-de-remise</guid>
      <description>
Shadow la licorne fran&#231;aise lance une double salve pour la Black Friday Week une promo imm&#233;diate avec r&#233;duction suppl&#233;mentaire pour un engagement de 6 mois. Ce qui permet de parvenir jusqu&#8217;&#224; -32 % sur les offres de PC virtuels Neo et Power.
</description>
    </item>
  </channel>
</rss>
