<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 05 Jan 2026 19:24:18 GMT</lastBuildDate>
    <item>
      <title>More Than 40 Million People Use ChatGPT Daily for Healthcare Advice, OpenAI Claims</title>
      <link>https://gizmodo.com/more-than-40-million-people-use-chatgpt-daily-for-healthcare-advice-openai-claims-2000705509</link>
      <pubDate>Mon, 05 Jan 2026 19:20:40 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705509</guid>
      <description>OpenAI wants ChatGPT to be a bigger player in healthcare. First, they need regulators to play ball.</description>
    </item>
    <item>
      <title>Pourquoi le nouveau chargeur Anker Nano risque de devenir votre indispensable</title>
      <link>https://www.frandroid.com/marques/anker/2929669_pourquoi-le-nouveau-chargeur-anker-nano-risque-de-devenir-votre-indispensable</link>
      <pubDate>Mon, 05 Jan 2026 19:19:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/anker/2929669_pourquoi-le-nouveau-chargeur-anker-nano-risque-de-devenir-votre-indispensable</guid>
      <description>
Anker ne s'est pas calm&#233; pour ce CES 2026. La marque vient de l&#226;cher une avalanche d'accessoires, du chargeur minuscule capable d'alimenter un MacBook Air &#224; la station d'accueil qui se transforme en hub nomade.
</description>
    </item>
    <item>
      <title>Transporter de l&#8217;&#233;lectricit&#233; gr&#226;ce &#224; la lumi&#232;re : c&#8217;est possible avec cette technologie int&#233;gr&#233;e &#224; une serrure connect&#233;e</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/securite-connectee/serrures-connectees/2929619_transporter-de-lelectricite-grace-a-la-lumiere-cest-possible-avec-cette-technologie-integree-a-une-serrure-connectee</link>
      <pubDate>Mon, 05 Jan 2026 19:17:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/securite-connectee/serrures-connectees/2929619_transporter-de-lelectricite-grace-a-la-lumiere-cest-possible-avec-cette-technologie-integree-a-une-serrure-connectee</guid>
      <description>
La recharge sans fil, par voie optique, sans aucun c&#226;ble, devient une r&#233;alit&#233; avec cette serrure connect&#233;e qu'on a pu voir dans les all&#233;es du CES. L'id&#233;e : pouvoir recharger une batterie &#224; 4 m&#232;tres de distance, uniquement avec de la lumi&#232;re. &#199;a fonctionne vraiment, et c'est bient&#244;t disponible.
</description>
    </item>
    <item>
      <title>CES 2026 day 1: the 11 best gadgets we've seen so far, from smart lights to LG's new OLEDs</title>
      <link>https://www.techradar.com/tech-events/the-best-of-ces-2026-day-one</link>
      <pubDate>Mon, 05 Jan 2026 19:14:56 +0000</pubDate>
      <guid isPermaLink="false">Ed54sk2YV2TJ6i4yBgpqbb</guid>
      <description>CES 2026 has kicked off in style, and we've been busy finding the highlights from the show floor in Las Vegas.</description>
    </item>
    <item>
      <title>Samsung CEO Says What We Already Know About the Memory Shortage</title>
      <link>https://gizmodo.com/samsung-ceo-says-what-we-already-know-about-the-memory-shortage-2000705543</link>
      <pubDate>Mon, 05 Jan 2026 19:10:58 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705543</guid>
      <description>It's a new year. Start pinching those pennies!</description>
    </item>
    <item>
      <title>These On-Ear Beats Headphones Are Marked Down by $70</title>
      <link>https://www.wired.com/story/beats-solo-4-deal-126/</link>
      <pubDate>Mon, 05 Jan 2026 19:10:55 +0000</pubDate>
      <guid isPermaLink="false">695bf1ae363a90f378f47670</guid>
      <description>What these headphones lack in active noise-canceling, they make up for with big, bold sound.</description>
    </item>
    <item>
      <title>The biggest TV announcements at CES 2026</title>
      <link>https://www.engadget.com/home/home-theater/the-biggest-tv-announcements-at-ces-2026-190929976.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 19:09:29 +0000</pubDate>
      <guid isPermaLink="false">ecf435a5-d2a0-4321-9064-dcce9611c48e</guid>
      <description>CES is once again where TV manufacturers lay out their plans for the year ahead, and CES 2026 is shaping up to be a showcase of both familiar rivalries and genuinely new display tech. While OLED and Mini LED remain central to most lineups, Micro RGB has emerged as one of the most talked-about developments at the show so far, especially at the higher end of the market.
Below are the TV announcements that stood out most from the pre-show events and early press conferences, with more expected as CES continues.
Samsung Micro RGB TVs



  Samsung's flagship Micro RGB TV
 

  Engadget
 

Samsung&#8217;s M...</description>
    </item>
    <item>
      <title>Cette vieille carte graphique fait son retour en 2026 : Nvidia change ses plans</title>
      <link>https://www.frandroid.com/marques/nvidia/2929603_cette-vieille-carte-graphique-fait-son-retour-en-2026-nvidia-change-ses-plans</link>
      <pubDate>Mon, 05 Jan 2026 19:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2929603_cette-vieille-carte-graphique-fait-son-retour-en-2026-nvidia-change-ses-plans</guid>
      <description>
On pensait l'avoir enterr&#233;e fin 2024. C'&#233;tait mal conna&#238;tre Nvidia. Face &#224; une crise de la m&#233;moire vive qui fait exploser les co&#251;ts, le g&#233;ant vert s'appr&#234;te &#224; ressortir sa GeForce RTX 3060 du placard. 
</description>
    </item>
    <item>
      <title>This Health Band Is Like if Whoop Went Wild With Voice Assistants</title>
      <link>https://gizmodo.com/this-health-band-is-like-if-whoop-went-wild-with-voice-assistants-2000705329</link>
      <pubDate>Mon, 05 Jan 2026 19:00:57 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705329</guid>
      <description>The Luna Band is all about yelling at your wrist.</description>
    </item>
    <item>
      <title>The Duffer Brothers Have No Idea Why They Tried to Answer So Many &#8216;Stranger Things&#8217; Questions Last Week</title>
      <link>https://gizmodo.com/stranger-things-finale-duffer-brothers-backlash-2000705567</link>
      <pubDate>Mon, 05 Jan 2026 19:00:23 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705567</guid>
      <description>'I'm, like, fried,' Matt Duffer explained in the wake of the Netflix hit's big finale, which we can certainly understand.</description>
    </item>
    <item>
      <title>Lego&#8217;s Smart Brick Gives the Iconic Analog Toy a New Digital Brain</title>
      <link>https://www.wired.com/story/lego-smart-brick-new-digital-brain/</link>
      <pubDate>Mon, 05 Jan 2026 19:00:00 +0000</pubDate>
      <guid isPermaLink="false">6958076061289fcb0d09c3c1</guid>
      <description>The new sensor-packed Smart Play Brick will land this spring as part of a special Star Wars collection. The update adds interactive lights and sound to the Lego experience&#8212;including the Minifigs.</description>
    </item>
    <item>
      <title>Lego announces Smart Brick, the &amp;#8216;most significant evolution&amp;#8217; in 50 years</title>
      <link>https://www.theverge.com/tech/854556/lego-announces-smart-brick-the-most-significant-evolution-in-50-years</link>
      <pubDate>2026-01-05T14:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=854556</guid>
      <description>On March 1st, 2026, The Lego Group will begin selling the most ambitious brick it's ever made: a tiny computer that fits entirely inside a classic 2&#215;4 Lego brick. When it detects NFC-equipped smart tags nearby, embedded inside new Lego tiles and new Lego minifigures, or when it sees other Smart Bricks, the company claims [&#8230;]</description>
    </item>
    <item>
      <title>Lego unveils a technology-packed Smart Brick at CES 2026</title>
      <link>https://www.engadget.com/entertainment/lego-unveils-a-technology-packed-smart-brick-at-ces-2026-190000511.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 19:00:00 +0000</pubDate>
      <guid isPermaLink="false">6354879d-871a-4410-855d-b4db770893fe</guid>
      <description>Lego bricks come in a ridiculously vast array of sizes and shapes, but the company is unveiling an entirely new take on its classic shape at CES 2026. Meet the Lego Smart Brick, a standard-sized 2 x 4 brick that&#8217;s packed with modern technology to enable sets that can respond to how they&#8217;re played with or the sets you build. It&#8217;s part of a new initiative called Smart Play, which encompasses the Smart Brick as well as Smart Minifigures and Smart Tags. While we obviously don&#8217;t know yet how Lego fans will take to this new system, it&#8217;s still fair to say it&#8217;s the biggest move Lego has every made to ...</description>
    </item>
    <item>
      <title>Elon Musk promet un voyage vers Mars en 2026&#8230; mais son Starship est-il vraiment pr&#234;t ?</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronautique-elon-musk-promet-voyage-vers-mars-2026-mais-son-starship-il-vraiment-pret-129787/#xtor%3DRSS-8</link>
      <pubDate>Mon, 05 Jan 2026 19:59:40 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronautique-elon-musk-promet-voyage-vers-mars-2026-mais-son-starship-il-vraiment-pret-129787/#xtor%3DRSS-8</guid>
      <description>Apr&#232;s une ann&#233;e 2025 marqu&#233;e par plusieurs d&#233;convenues pour SpaceX, l'entreprise d'Elon Musk attend beaucoup de son Starship pour 2026. Mais peut-elle r&#233;aliser l'impossible et faire face aux nombreux d&#233;fis techniques qui attendent son lanceur lourd ?</description>
    </item>
    <item>
      <title>Hacktivist deletes white supremacist websites live on stage during hacker conference</title>
      <link>https://techcrunch.com/2026/01/05/hacktivist-deletes-white-supremacist-websites-live-on-stage-during-hacker-conference/</link>
      <pubDate>Mon, 05 Jan 2026 18:57:31 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3079707</guid>
      <description>A hacker known as Martha Root broke in and deleted three white supremacists websites at the end of a talk during the annual hacker conference Chaos Communication Congress in Germany.</description>
    </item>
    <item>
      <title>The Lego brick just got its biggest upgrade yet with Smart Play &#8212; and it's coming to Star Wars sets first</title>
      <link>https://www.techradar.com/streaming/entertainment/the-lego-brick-just-got-its-biggest-upgrade-yet-with-smart-play-and-its-coming-to-star-wars-sets-first</link>
      <pubDate>Mon, 05 Jan 2026 18:48:38 +0000</pubDate>
      <guid isPermaLink="false">Tkg3VrTHxx6kVi7DxVjfLF</guid>
      <description>Similar looks, but supercharged internals</description>
    </item>
    <item>
      <title>Verge announces world-first motorcycle with solid-state batteries for a 370-mile range and 10-minute charge times</title>
      <link>https://www.techradar.com/vehicle-tech/hybrid-electric-vehicles/verge-announces-world-first-motorcycle-with-solid-state-batteries-for-a-370-mile-range-and-10-minute-charge-times</link>
      <pubDate>Mon, 05 Jan 2026 18:48:10 +0000</pubDate>
      <guid isPermaLink="false">Lh8XgM9JuNSwyLBA53end5</guid>
      <description>Verge Motorcycles unlocks ten-minute charge times with world-first all solid-sate battery in a bike.</description>
    </item>
    <item>
      <title>Ce mini PC modulaire r&#233;alise un vieux fantasme et c&#8217;est malin</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/2929569_ce-mini-pc-modulaire-realise-un-vieux-fantasme-et-cest-malin</link>
      <pubDate>Mon, 05 Jan 2026 18:47:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/2929569_ce-mini-pc-modulaire-realise-un-vieux-fantasme-et-cest-malin</guid>
      <description>
La qu&#234;te de l'anneau unique est un vieux fantasme de la tech. Au CES 2026, la marque Khadas en propose un aboutissement gr&#226;ce &#224; Intel Panther Lake.
</description>
    </item>
    <item>
      <title>That viral Reddit post about food delivery apps was an AI scam</title>
      <link>https://www.theverge.com/news/855328/viral-reddit-delivery-app-ai-scam</link>
      <pubDate>2026-01-05T13:43:02-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=855328</guid>
      <description>A viral Reddit confessional about a "major food delivery app" posted January 2nd is most likely AI-generated. The original post by user Trowaway_whistleblow alleged that an unnamed food delivery company regularly delays customer orders, calls couriers "human assets," and exploits their "desperation" for cash, among other indefensible actions. Nearly 90,000 upvotes and four days later, [&#8230;]...</description>
    </item>
    <item>
      <title>J&#8217;ai vu le Honor Robot Phone avec sa cam&#233;ra articul&#233;e et j&#8217;en suis ressorti avec plus de questions que de r&#233;ponses</title>
      <link>https://www.01net.com/actualites/jai-vu-le-honor-robot-phone-avec-sa-camera-articulee-et-jen-suis-ressorti-avec-plus-de-questions-que-de-reponses.html</link>
      <pubDate>Mon, 05 Jan 2026 18:42:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318246</guid>
      <description>Au CES 2026, Honor d&#233;voile le Robot Phone, un &#233;tonnant smartphone &#224; cam&#233;ra articul&#233;e. Simple concept ou v&#233;ritable r&#233;volution mobile&#8239;? Cette premi&#232;re prise en main soul&#232;ve de nombreuses questions sur les ambitions de la marque chinoise.</description>
    </item>
    <item>
      <title>You Can Play Chess in Hyperbolic Space Now, and It Sucks</title>
      <link>https://gizmodo.com/you-can-play-chess-in-hyperbolic-space-now-and-it-sucks-2000705568</link>
      <pubDate>Mon, 05 Jan 2026 18:36:28 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705568</guid>
      <description>It may not be particularly fun yet, but it's weird!</description>
    </item>
    <item>
      <title>Hisense unveils 3 new TV innovations at CES 2026 &#8212; and they&#8217;re all about mind-blowing color</title>
      <link>https://www.techradar.com/televisions/hisense-unveils-3-new-tv-innovations-at-ces-2026-and-theyre-all-about-mind-blowing-color</link>
      <pubDate>Mon, 05 Jan 2026 18:30:00 +0000</pubDate>
      <guid isPermaLink="false">wRRKZHFzWLMLcaCDppUsWZ</guid>
      <description>After revealing RGB mini-LED at CES 2025, Hisense is back with even more RGB TV innovations, including smaller screen sizes.</description>
    </item>
    <item>
      <title>Wegovy pill: Where to find Novo Nordisk&#8217;s new GLP-1 for weight loss&#8212;and how much it costs</title>
      <link>https://www.fastcompany.com/91469193/wegovy-pill-cost-pricing-retailers-for-new-novo-nordisk-weight-loss-glp1</link>
      <pubDate>2026-01-05T18:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91469193/wegovy-pill-cost-pricing-retailers-for-new-novo-nordisk-weight-loss-glp1</guid>
      <description>The first-ever oral GLP-1 just hit the market. Here&#8217;s what you need to know.
For years, pharmaceutical companies have been racing to develop a market-ready GLP-1 weight-loss pill to join the ranks of popular injectables. Today, Novo Nordisk&#8217;s oral version of Wegovy is officially available for purchase.</description>
    </item>
    <item>
      <title>Boulanger casse le prix de cet &#233;cran PC Samsung OLED 34&#8243; incurv&#233; &#224; 175 Hz : une affaire en or &#224; saisir pour les gamers</title>
      <link>https://www.frandroid.com/bons-plans/2928731_boulanger-casse-le-prix-de-cet-ecran-pc-samsung-oled-34-incurve-a-175-hz-une-affaire-en-or-a-saisir-pour-les-gamers</link>
      <pubDate>Mon, 05 Jan 2026 18:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2928731_boulanger-casse-le-prix-de-cet-ecran-pc-samsung-oled-34-incurve-a-175-hz-une-affaire-en-or-a-saisir-pour-les-gamers</guid>
      <description>
Le Samsung Odyssey OLED G85SDdevient bien plus accessible avec cette promo &#224; 742 euros au lieu de 1 099 euros chez Boulanger, alors qu&#8217;il offre une dalle OLED ultra&#8209;wide, un affichage tr&#232;s fluide et un temps de r&#233;ponse id&#233;al pour le jeu comp&#233;titif. Une belle opportunit&#233; pour s&#8217;offrir un &#233;cran gaming premium sans payer le prix fort.
</description>
    </item>
    <item>
      <title>What are Micro RGB TVs and why are they everywhere at CES 2026?</title>
      <link>https://www.engadget.com/home/home-theater/what-are-micro-rgb-tvs-and-why-are-they-everywhere-at-ces-2026-182441543.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 18:24:42 +0000</pubDate>
      <guid isPermaLink="false">91b8cbcb-66aa-4a89-8cd3-0d9cd5003a6d</guid>
      <description>Micro RGB TVs first arrived last year with little fanfare and a confusing name, so you may have mistaken it for other panel tech or not even noticed. That is not likely to be the case this year, though &#8212; it&#8217;s the hot new &#8220;luxury&#8221; display technology and is all over the place at CES 2026. So why do we even need these new TVs and how are they different from OLED, Micro LED and Mini LED models? Here&#8217;s how it works and how it compares.
A brief history of flat panel display tech
To better understand Micro RGB, it helps to see how flat panel display technology has evolved over the last 20 years. The ...</description>
    </item>
    <item>
      <title>Anker's new 45W charger from CES is already $10 off</title>
      <link>https://www.engadget.com/deals/ankers-new-45w-charger-from-ces-is-already-10-off-160707324.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 18:23:23 +0000</pubDate>
      <guid isPermaLink="false">e5fce599-c299-44cd-983e-1c46fb9819b8</guid>
      <description>Anker rolled out a bunch of new chargers and other gear at CES 2026, including a cute one that's already on sale. The new 45W Nano charger with smart display, which is an upgrade to the existing Nano charger in Anker's lineup, is on sale for $30 right now while you can pre-order it. That's $10 off the regular MSRP, and shipments will start going out on January 20.
The 45W charger includes a smart display that shows real-time data like power flow, temperature and charging status. It also features "fun animations to keep things cheerful." Anker says it can recognize what's being charged and auto...</description>
    </item>
    <item>
      <title>Images sexuelles cr&#233;&#233;es par Grok | Le r&#233;gulateur britannique demande &#224; X des explications</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-01-05/images-sexuelles-creees-par-grok/le-regulateur-britannique-demande-a-x-des-explications.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Mon, 05 Jan 2026 13:22:52 -0500</pubDate>
      <guid isPermaLink="false">9e02b7ecb7e03eecbcd8109fbf528933</guid>
      <description>Le r&#233;gulateur britannique des m&#233;dias a demand&#233; lundi au r&#233;seau social X d&#8217;expliquer comment il prot&#232;ge ses utilisateurs contre les fausses images de mineurs &#224; caract&#232;re sexuel g&#233;n&#233;r&#233;es par Grok, l&#8217;assistant d&#8217;intelligence artificielle associ&#233; au r&#233;seau.</description>
    </item>
    <item>
      <title>Offshore wind developers sue Trump administration for halting $25B in projects</title>
      <link>https://techcrunch.com/2026/01/05/offshore-wind-developers-sue-trump-administration-for-halting-25b-in-projects/</link>
      <pubDate>Mon, 05 Jan 2026 18:20:23 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3079751</guid>
      <description>The lawsuits seek to reverse the Department of the Interior's stop-work order, which affected five offshore wind projects off the Eastern Seaboard.</description>
    </item>
    <item>
      <title>Crypto thief released early thanks to Trump's First Step Act</title>
      <link>https://www.techradar.com/pro/security/crypto-thief-released-early-thanks-to-trumps-first-step-act</link>
      <pubDate>Mon, 05 Jan 2026 18:20:00 +0000</pubDate>
      <guid isPermaLink="false">fCADXsNFjMVjA6SiAGrDP</guid>
      <description>Ilya Lichtenstein is coming home after serving time for the Bitfinex hack.</description>
    </item>
    <item>
      <title>This AI-Powered Drink Machine Slops You Up Some Generative Booze</title>
      <link>https://gizmodo.com/this-ai-powered-drink-machine-slops-you-up-some-generative-booze-2000705379</link>
      <pubDate>Mon, 05 Jan 2026 18:15:13 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705379</guid>
      <description>I could use a stiff serving of AI slop right about now.</description>
    </item>
    <item>
      <title>Elon Musk Boasts of Dinner With Jeffrey Epstein&#8217;s &#8216;Best Friend&#8217;</title>
      <link>https://gizmodo.com/elon-musk-boasts-of-dinner-with-jeffrey-epsteins-best-friend-2000705534</link>
      <pubDate>Mon, 05 Jan 2026 18:10:52 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705534</guid>
      <description>"2026 is going to be amazing!" tweeted Musk.</description>
    </item>
    <item>
      <title>GE Appliances' new Smart Refrigerator automates grocery shopping with a barcode scanner and Instacart</title>
      <link>https://www.engadget.com/home/kitchen-tech/ge-appliances-new-smart-refrigerator-automates-grocery-shopping-with-a-barcode-scanner-and-instacart-194326073.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 18:09:25 +0000</pubDate>
      <guid isPermaLink="false">fde0a3bb-d76b-45b7-8d70-0ac9df5a8db1</guid>
      <description>Smart fridges are a dime a dozen at CES, and LG and Samsung have thoroughly explored what's possible when you connect your fridge to the internet or slap a touchscreen on the front. The new GE Profile Smart Refrigerator with Kitchen Assistant GE Appliances is announcing ahead of CES 2026 doesn't reinvent the wheel in that regard, but it does include a first: a built-in barcode scanner for adding items to your shopping list.GE Appliances&#8217; "Scan-to-List" feature uses the barcode scanner to quickly (and precisely) add items to a shareable shopping list in the company&#8217;s SmartHQ app. You can refer ...</description>
    </item>
    <item>
      <title>Crude prices and oil company stocks rise after U.S. raid on Venezuela</title>
      <link>https://www.fastcompany.com/91469256/crude-prices-oil-company-stocks-rise-venezuela</link>
      <pubDate>2026-01-05T18:09:20</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91469256/crude-prices-oil-company-stocks-rise-venezuela</guid>
      <description>The price of U.S. crude jumped 1.4% to $58.13 per barrel. 
Stocks rose in morning trading on Wall Street Monday to kick off the first full week of the new year, led by energy and technology companies.</description>
    </item>
    <item>
      <title>LG&amp;#8217;s CLOiD robot can load the washer for you, slowly</title>
      <link>https://www.theverge.com/tech/855233/lg-cloid-robot-laundry-ces-2026-keynote</link>
      <pubDate>2026-01-05T13:08:58-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=855233</guid>
      <description>LG's CLOiD robot took the stage at CES 2026 on Monday, offering our first look at the bot in action. During LG's keynote, the company showed how CLOiD can load your washer or dryer - albeit slowly - as part of its goal of creating a "zero labor home." CLOiD waved both of its five-finger [&#8230;]</description>
    </item>
    <item>
      <title>LG launches yet another lighter-than-light 17-inch laptop with an RTX 5050 GPU &#8212; and I am so confused</title>
      <link>https://www.techradar.com/pro/lg-launches-yet-another-lighter-than-light-17-inch-laptop-with-an-rtx-5050-gpu-and-i-am-so-confused</link>
      <pubDate>Mon, 05 Jan 2026 18:05:00 +0000</pubDate>
      <guid isPermaLink="false">6Jr3oBV4PEqYQJvfL68Nq7</guid>
      <description>The latest LG Gram Pro 17 pairs "Aerominum" construction with Nvidia RTX graphics, but with few clear differences from the 2025 model.</description>
    </item>
    <item>
      <title>The Final &#8216;Greenland 2: Migration&#8217; Trailer Promises Gerard Butler Will Save You</title>
      <link>https://gizmodo.com/greenland-2-final-trailer-gerard-butler-morena-baccarin-2000705552</link>
      <pubDate>Mon, 05 Jan 2026 18:00:55 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705552</guid>
      <description>Technically, it's his character saving his family (again), but who better to guide survivors through the post-apocalypse?</description>
    </item>
    <item>
      <title>At $50 off, the Shokz OpenRun Pro helps you stick to your new year&#8217;s goals</title>
      <link>https://www.theverge.com/tech/855202/shokz-openrun-pro-bone-conduction-headphones-deal-sale</link>
      <pubDate>2026-01-05T13:00:17-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=855202</guid>
      <description>Getting fit is one of the most popular New Year&#8217;s resolutions, and if we&#8217;re being honest, it&#8217;s also one of the easiest to quit by week two. But with the right support, it doesn&#8217;t have to be that way this year. Earbuds like the last-gen Shokz OpenRun Pro can help keep you motivated, while their [&#8230;]</description>
    </item>
    <item>
      <title>Les meilleurs casques audio Bluetooth en janvier 2026 &#8211; La s&#233;lection Frandroid</title>
      <link>https://www.frandroid.com/guide-dachat/guide-audio/457173_guide-dachat-les-meilleurs-casques-bluetooth-sans-fil-de-2017</link>
      <pubDate>Mon, 05 Jan 2026 18:00:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-audio/457173_guide-dachat-les-meilleurs-casques-bluetooth-sans-fil-de-2017</guid>
      <description>
Vous ne savez pas quel casque Bluetooth choisir dans cet oc&#233;an de r&#233;f&#233;rences ? Nous avons r&#233;alis&#233; une s&#233;lection des meilleurs casques audio Bluetooth parmi tous ceux que nous avons pu tester.
</description>
    </item>
    <item>
      <title>China&#8217;s Hesai will double production as lidar sensor industry shakes out</title>
      <link>https://techcrunch.com/2026/01/05/chinas-hesai-will-double-production-as-lidar-sensor-industry-shakes-out/</link>
      <pubDate>Mon, 05 Jan 2026 18:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3079550</guid>
      <description>Hesai said it now plans to build as many as 4 million lidar sensors in 2026, up from 2 million, as it tries to corner a market with one fewer player after Luminar's bankruptcy.</description>
    </item>
    <item>
      <title>Asus&#8217; new OLED gaming monitors will have sharper text and more accurate colors</title>
      <link>https://www.theverge.com/tech/855247/asus-oled-gaming-monitors-rgb-stripe-ces-2026</link>
      <pubDate>2026-01-05T12:57:48-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=855247</guid>
      <description>Asus is announcing three new OLED gaming monitors at CES with "RGB stripe" technology that the company says will bring improvements to "texture clarity and color rendering consistency." With RGB stripes, which Samsung Display and LG Display (the two companies that usually provide the panels for gaming monitors) are also making a big deal about [&#8230;]</description>
    </item>
    <item>
      <title>A Stranger Things making-of documentary hits Netflix next week</title>
      <link>https://www.engadget.com/entertainment/tv-movies/a-stranger-things-making-of-documentary-hits-netflix-next-week-175539720.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 17:55:39 +0000</pubDate>
      <guid isPermaLink="false">ed8b1ca5-e18f-44a6-a064-6d16f8479f21</guid>
      <description>Netflix just announced the pending release of a Stranger Things documentary, hot on the heels of the series finale. It premieres on January 12. One Last Adventure focuses on the making of season five, so it's not a full series retrospective. This seems similar to what Disney+ does a few weeks after a popular Star Wars or Marvel show drops.
Still, it's a documentary about the very last season of the show, so there's likely to be some tearful goodbyes and all of that jazz. As a matter of fact, the trailer shows plenty of hugs along with sit-down interviews.

It'll shine a light on how some of th...</description>
    </item>
    <item>
      <title>How to watch the Hisense CES 2026 press conference live</title>
      <link>https://www.engadget.com/home/how-to-watch-the-hisense-ces-2026-press-conference-live-190040504.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 17:55:28 +0000</pubDate>
      <guid isPermaLink="false">9486b306-eae4-49da-a805-9b5cf78d2fb9</guid>
      <description>Xinhua News Agency via Getty Images
Hisense is typically best known for its affordable electronics and home appliances, from TVs to refrigerators. But at CES 2025, the China-based company showed off its premium side with a massive 136-inch micro LED TV &#8212; now available for a jaw-dropping $100,000. So what's in store for this year's show? New leadership, for starters.
The company has two new hires, including Chief Marketing Officer Sarah Larsen and Chief Commercial Officer James Fishler. In a press release, Hisense said Fishler's experience in home entertainment, appliances and HVAC is important...</description>
    </item>
    <item>
      <title>J&#8217;ai vu &#171; la tablette la plus fine du monde &#187; : c&#8217;est une feuille de papier</title>
      <link>https://www.frandroid.com/produits-android/tablette/2929279_jai-vu-la-tablette-la-plus-fine-du-monde-cest-une-feuille-de-papier</link>
      <pubDate>Mon, 05 Jan 2026 17:54:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/tablette/2929279_jai-vu-la-tablette-la-plus-fine-du-monde-cest-une-feuille-de-papier</guid>
      <description>
J'ai pris en main une tablette qui pr&#233;tend &#234;tre la plus fine du monde. L'objet attire beaucoup de regards au CES 2026, mais je ne suis pas s&#251;r de son aspect pratique.
</description>
    </item>
    <item>
      <title>It looks like the end is coming for the Apple Vision Pro &#8212; I&#8217;m not even surprised</title>
      <link>https://www.techradar.com/computing/virtual-reality-augmented-reality/it-looks-like-the-end-is-coming-for-the-apple-vision-pro-im-not-even-surprised</link>
      <pubDate>Mon, 05 Jan 2026 17:51:16 +0000</pubDate>
      <guid isPermaLink="false">3QWt3vQQC4S6satgLoZtTb</guid>
      <description>Apple is reportedly dialling back on Vision Pro production and marketing.</description>
    </item>
    <item>
      <title>2026 is the perfect year for OnePlus to release another folding phone &#8212; here's why</title>
      <link>https://www.techradar.com/phones/oneplus-phones/2026-is-the-perfect-year-for-oneplus-to-release-another-folding-phone-heres-why</link>
      <pubDate>Mon, 05 Jan 2026 17:49:20 +0000</pubDate>
      <guid isPermaLink="false">ZpoRsfdBmRwcjLsguYvHHa</guid>
      <description>It&#8217;s going to be an interesting year for folding phones &#8211; here&#8217;s why OnePlus should return to the phone industry&#8217;s most exciting market.</description>
    </item>
    <item>
      <title>Avec les Snapdragon X2 Plus, Qualcomm &#233;largit l&#8217;horizon de Windows ARM</title>
      <link>https://www.01net.com/actualites/avec-les-snapdragon-x2-plus-qualcomm-elargit-lhorizon-de-windows-arm.html</link>
      <pubDate>Mon, 05 Jan 2026 17:47:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318241</guid>
      <description>Qualcomm veut mettre des puces Snapdragon dans un maximum de PC. Jusqu'&#224; pr&#233;sent, le g&#233;ant am&#233;ricain ne proposait aux constructeurs que des mod&#232;les haut de gamme&#160;; mais la nouvelle famille Snapdragon X2 Plus va permettre de d&#233;mocratiser un peu plus Windows ARM.</description>
    </item>
    <item>
      <title>Fini le chaos des c&#226;bles ? 19 associations exigent un chargeur universel pour tous les v&#233;los &#233;lectriques</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2928451_fini-le-chaos-des-cables-19-associations-exigent-un-chargeur-universel-pour-tous-les-velos-electriques</link>
      <pubDate>Mon, 05 Jan 2026 17:44:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2928451_fini-le-chaos-des-cables-19-associations-exigent-un-chargeur-universel-pour-tous-les-velos-electriques</guid>
      <description>
Une vingtaine d'associations ont adress&#233; une lettre &#224; l&#8217;Union europ&#233;enne afin d&#8217;adopter un chargeur universel pour v&#233;los &#233;lectriques. Les raisons invoqu&#233;es : des probl&#232;mes de s&#233;curit&#233;, d&#8217;environnement et de gestion de flottes.
</description>
    </item>
    <item>
      <title>Hundreds of Earthquakes Are Rocking One of Earth&#8217;s Most Dangerous Glaciers</title>
      <link>https://gizmodo.com/hundreds-of-earthquakes-are-rocking-one-of-earths-most-dangerous-glaciers-2000705493</link>
      <pubDate>Mon, 05 Jan 2026 17:30:22 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705493</guid>
      <description>Scientists uncover new evidence of undocumented glacial earthquakes in Antarctica.</description>
    </item>
    <item>
      <title>CES 2026 live updates: The latest news, surprises, strange tech, and more</title>
      <link>https://mashable.com/live/ces-2026-news-live-updates</link>
      <pubDate>Mon, 05 Jan 2026 17:27:29 +0000</pubDate>
      <guid isPermaLink="false">00HdPGMgSorg1E6HI6usOJ2</guid>
      <description>CES 2026 is here. See the latest news on bleeding-edge tech, EV advancements, and more.</description>
    </item>
    <item>
      <title>Anker Nano Power Strip : cette multiprise &#224; pince veut faire dispara&#238;tre vos c&#226;bles sous le bureau</title>
      <link>https://www.frandroid.com/marques/anker/2929169_anker-nano-power-strip-cette-multiprise-a-pince-veut-faire-disparaitre-vos-cables-sous-le-bureau</link>
      <pubDate>Mon, 05 Jan 2026 17:25:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/anker/2929169_anker-nano-power-strip-cette-multiprise-a-pince-veut-faire-disparaitre-vos-cables-sous-le-bureau</guid>
      <description>
Anker profite du CES 2026 pour d&#233;voiler une solution de charge originale : la Nano Power Strip. &#201;quip&#233;e d'un syst&#232;me de fixation &#224; pince, elle d&#233;porte une partie de ses prises sous le plateau pour lib&#233;rer l'espace de travail.
</description>
    </item>
    <item>
      <title>Amazon just dropped the Jackery HomePower 3600 Plus to a record-low price</title>
      <link>https://mashable.com/article/jan-5-jackery-homepower-deal</link>
      <pubDate>Mon, 05 Jan 2026 17:24:55 +0000</pubDate>
      <guid isPermaLink="false">01cQoEuVCeLOwhYLRhhBhFi</guid>
      <description>Get the Jackery HomePower 3600 Plus Solar Generator bundle for just $1,998.99 (46% off) at Amazon. Includes two 200W solar panels.</description>
    </item>
  </channel>
</rss>
