<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 23 Jan 2026 09:35:38 GMT</lastBuildDate>
    <item>
      <title>Fnac et Darty font le plein d&#8217;offres pour le week-end des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-font-le-plein-doffres-pour-le-week-end-des-soldes</link>
      <pubDate>Fri, 23 Jan 2026 09:29:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-font-le-plein-doffres-pour-le-week-end-des-soldes</guid>
      <description>
Le week-end approche, et les bonnes affaires continuent&#8239;! La 3&#7497; d&#233;marque des soldes d&#8217;hiver bat son plein chez Fnac et Darty, avec toujours plus d&#8217;offres Tech &#224; ne pas manquer. Smartphones, tablettes, ordinateurs&#8230; les r&#233;ductions se multiplient. 
</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : la 3&#232;me d&#233;marque continue avec de belles p&#233;pites juste avant le week-end</title>
      <link>https://www.frandroid.com/bons-plans/2949895_soldes-dhiver-2026-la-3eme-demarque-continue-avec-de-belles-pepites-juste-avant-le-week-end</link>
      <pubDate>Fri, 23 Jan 2026 09:29:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2949895_soldes-dhiver-2026-la-3eme-demarque-continue-avec-de-belles-pepites-juste-avant-le-week-end</guid>
      <description>
Cela fait d&#233;j&#224; plus de deux semaines que les soldes d'hiver ont commenc&#233; en France et que les e-commer&#231;ants tels qu'Amazon, Fnac, Darty, Boulanger ou encore Cdiscount partagent des offres. C'est maintenant l'heure de la 3e d&#233;marque et voici les meilleures offres Tech &#224; saisir. 
</description>
    </item>
    <item>
      <title>Smartphones Xiaomi&#160;: connaissez-vous cette astuce pour acc&#233;l&#233;rer votre connexion &#224; internet&#160;?</title>
      <link>https://www.01net.com/actualites/smartphones-xiaomi-connaissez-vous-cette-astuce-pour-accelerer-votre-connexion-a-internet.html</link>
      <pubDate>Fri, 23 Jan 2026 09:26:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313944</guid>
      <description>Xiaomi propose gr&#226;ce &#224; son syst&#232;me d&#8217;exploitation HyperOS 2, une &#171;&#160;acc&#233;l&#233;ration du r&#233;seau&#160;&#187;, ce syst&#232;me combine donn&#233;es mobiles et Wi-Fi afin d&#8217;augmenter votre vitesse de connexion.</description>
    </item>
    <item>
      <title>Enfin des &#233;couteurs de traduction instantan&#233;e pens&#233;s pour les pros et les voyageurs</title>
      <link>https://www.frandroid.com/produits-android/audio/ecouteurs-true-wireless/2952895_enfin-des-ecouteurs-de-traduction-instantanee-penses-pour-les-pros-et-les-voyageurs</link>
      <pubDate>Fri, 23 Jan 2026 09:25:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/audio/ecouteurs-true-wireless/2952895_enfin-des-ecouteurs-de-traduction-instantanee-penses-pour-les-pros-et-les-voyageurs</guid>
      <description>
Une conversation (presque) naturelle avec un interlocuteur qui ne parle pas votre langue, c&#8217;est la promesse des &#233;couteurs Timekettle W4 AI Interpreter Earbuds.
</description>
    </item>
    <item>
      <title>Gemini now offers full-length SAT practice tests &#8212; for free</title>
      <link>https://www.techradar.com/ai-platforms-assistants/gemini/gemini-now-offers-full-length-sat-practice-tests-for-free</link>
      <pubDate>Fri, 23 Jan 2026 09:17:53 +0000</pubDate>
      <guid isPermaLink="false">MoHER5RXFWddenZ22dv3pg</guid>
      <description>Google Gemini now offers students free expert-backed SAT practice tests and tailored study guidance</description>
    </item>
    <item>
      <title>iPhone Air : une modification ajoute le slot SIM manquant</title>
      <link>https://www.frandroid.com/marques/apple/2952803_iphone-air-une-modification-ajoute-le-slot-sim-manquant</link>
      <pubDate>Fri, 23 Jan 2026 09:04:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2952803_iphone-air-une-modification-ajoute-le-slot-sim-manquant</guid>
      <description>
Vous pensiez que l'eSIM avait gagn&#233; ? C'est mal conna&#238;tre le march&#233; gris chinois. Des ing&#233;nieurs de Shenzhen ont r&#233;ussi &#224; greffer un slot SIM physique dans un iPhone Air. La modification fonctionne, le r&#233;seau passe, mais votre smartphone &#224; plus de 1000 &#8364; ne sera plus jamais le m&#234;me. Regardez le carnage.
</description>
    </item>
    <item>
      <title>How our mattering instinct builds and divides our relationships</title>
      <link>https://www.fastcompany.com/91478663/how-our-mattering-instrict-builds-and-divides-our-relationships</link>
      <pubDate>2026-01-23T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91478663/how-our-mattering-instrict-builds-and-divides-our-relationships</guid>
      <description>We judge how well our lives are going by how well our mattering projects are going.
Below, Rebecca Newberger Goldstein shares five key insights from her new book,&#160;The Mattering Instinct: How Our Deepest Longing Drives Us and Divides Us.</description>
    </item>
    <item>
      <title>When leading teams, the obvious isn&#8217;t as obvious as you think</title>
      <link>https://www.fastcompany.com/91478671/when-leading-teams-the-obvious-isnt-as-obvious-as-you-think</link>
      <pubDate>2026-01-23T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91478671/when-leading-teams-the-obvious-isnt-as-obvious-as-you-think</guid>
      <description>Why organizational culture requires getting back to the basics.
My daughter, Ivy, recently joined a swim club. As a former competitive swimmer, it&#8217;s been a delight to witness. Every time I take her to practice, I feel a wave of nostalgia that reminds me of all the many years I spent in the pool and all the many teammates I collected along the way. It excites me to think that she, too, will have her own experiences and life lessons, just as swimming taught me. But something peculiar struck me as I watched her practice: 45 minutes of their one-hour training was spent on the basics. Kick drills. ...</description>
    </item>
    <item>
      <title>6 families are suing TikTok after kids die doing the &#8216;blackout challenge&#8217;</title>
      <link>https://www.fastcompany.com/91479418/6-families-are-suing-tiktok-after-kids-die-doing-the-blackout-challenge</link>
      <pubDate>2026-01-23T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91479418/6-families-are-suing-tiktok-after-kids-die-doing-the-blackout-challenge</guid>
      <description>A Delaware judge is currently deciding if the lawsuit can proceed.
Six families are suing TikTok after their children died emulating the so-called &#8220;blackout challenge&#8221; they had seen on the social media platform.&#160;</description>
    </item>
    <item>
      <title>Amsterdam dit stop aux fatbikes &#233;lectriques et veut les bannir de certaines zones</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2952759_amsterdam-dit-stop-aux-fatbikes-electriques-et-veut-les-bannir-de-certaines-zones</link>
      <pubDate>Fri, 23 Jan 2026 08:59:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2952759_amsterdam-dit-stop-aux-fatbikes-electriques-et-veut-les-bannir-de-certaines-zones</guid>
      <description>
Amsterdam envisage d&#8217;interdire la circulation des fatbikes &#233;lectriques dans le Vondelpark, l&#8217;un de ses parcs les plus fr&#233;quent&#233;s. Cette d&#233;cision s&#8217;inscrit dans un contexte national marqu&#233; par une multiplication des mesures visant ce type de v&#233;lo aux Pays-Bas.
</description>
    </item>
    <item>
      <title>Pixel Watch 3 : Amazon fait une tr&#232;s belle offre sur la montre de Google lors des soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2647565_pixel-watch-3-amazon-fait-une-tres-belle-offre-sur-la-montre-de-google-lors-des-soldes-dhiver</link>
      <pubDate>Fri, 23 Jan 2026 08:58:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2647565_pixel-watch-3-amazon-fait-une-tres-belle-offre-sur-la-montre-de-google-lors-des-soldes-dhiver</guid>
      <description>
Si la Google Pixel Watch 4 est encore trop on&#233;reuse pour vous, il peut &#234;tre int&#233;ressant de se tourner pendant les soldes vers l'ancien mod&#232;le, la Pixel Watch 3, qui tombe &#224; 199 euros contre 399 euros au d&#233;part. 
</description>
    </item>
    <item>
      <title>&#171; La demande d&#233;passe largement nos pr&#233;visions &#187; : BMW et Mercedes cartonnent avec leurs nouvelles voitures &#233;lectriques</title>
      <link>https://www.frandroid.com/marques/bmw/2952653_la-demande-depasse-largement-nos-previsions-bmw-et-mercedes-cartonnent-avec-leurs-nouvelles-voitures-electriques</link>
      <pubDate>Fri, 23 Jan 2026 08:57:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bmw/2952653_la-demande-depasse-largement-nos-previsions-bmw-et-mercedes-cartonnent-avec-leurs-nouvelles-voitures-electriques</guid>
      <description>
R&#233;cemment lanc&#233;s, les nouveaux BMW iX3 et Mercedes GLC s&#233;duisent d&#233;j&#224; beaucoup les clients. Les deux voitures &#233;lectriques d&#233;passent les attentes et les carnets de commandes sont d&#233;j&#224; pleins.
</description>
    </item>
    <item>
      <title>Samsung Galaxy S26&#160;: pr&#233;commandes et sortie, tout le calendrier aurait fuit&#233;</title>
      <link>https://www.01net.com/actualites/samsung-galaxy-s26-precommandes-et-sortie-tout-le-calendrier-aurait-fuite.html</link>
      <pubDate>Fri, 23 Jan 2026 08:52:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322046</guid>
      <description>Les rumeurs s'intensifient autour des Galaxy S26. Une nouvelle fuite cr&#233;dible confirme un lancement tardif et une commercialisation repouss&#233;e au mois de mars.</description>
    </item>
    <item>
      <title>Ce nouveau raccourci tr&#232;s pratique du clavier Gboard va vous faire gagner un temps pr&#233;cieux</title>
      <link>https://www.frandroid.com/marques/google/2952709_ce-nouveau-raccourci-tres-pratique-du-clavier-gboard-va-vous-faire-gagner-un-temps-precieux</link>
      <pubDate>Fri, 23 Jan 2026 08:47:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2952709_ce-nouveau-raccourci-tres-pratique-du-clavier-gboard-va-vous-faire-gagner-un-temps-precieux</guid>
      <description>
Avec ce raccourci bien pratique, Gboard va acc&#233;l&#233;rer la saisie de texte sur Android.
</description>
    </item>
    <item>
      <title>The untapped business case for male contraception</title>
      <link>https://www.fastcompany.com/91463179/the-untapped-business-case-for-male-contraception-male-contraception-business</link>
      <pubDate>2026-01-23T08:45:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463179/the-untapped-business-case-for-male-contraception-male-contraception-business</guid>
      <description>For the first time, multiple male contraceptives are in clinical trials.
For more than 60 years, contraception has been almost exclusively a women&#8217;s responsibility. Today, women have more than 14 modern contraceptive options, while men have just two: condoms and vasectomies. That imbalance has pushed women to shoulder physical side effects, financial burden, medical risks, and the career impact of family planning&#8212;costs that have been accepted as the &#8220;status quo&#8221; for far too long....</description>
    </item>
    <item>
      <title>JBL BandBox Solo et Trio, enfin l&#8217;IA sert &#224; quelque chose pour ses deux enceintes-amplificateurs</title>
      <link>https://www.frandroid.com/marques/jbl/2952713_jbl-bandbox-solo-et-trio-enfin-lia-sert-a-quelque-chose-pour-ses-deux-enceintes-amplificateurs</link>
      <pubDate>Fri, 23 Jan 2026 08:44:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/jbl/2952713_jbl-bandbox-solo-et-trio-enfin-lia-sert-a-quelque-chose-pour-ses-deux-enceintes-amplificateurs</guid>
      <description>
Le fabricant audio JBL vient d&#8217;annoncer les BandBox Solo et Trio, deux enceintes-amplificateurs capables de s&#233;parer les instruments d'une chanson en temps r&#233;el gr&#226;ce &#224; l'IA.
</description>
    </item>
    <item>
      <title>Google Photos veut transformer vos photos en &#171;&#160;m&#232;mes&#160;&#187;</title>
      <link>https://www.01net.com/actualites/google-photos-me-meme.html</link>
      <pubDate>Fri, 23 Jan 2026 08:36:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322055</guid>
      <description>Google introduit une nouvelle fonction &#171; Me Meme &#187; dans son application Photos pour vous transformer en &#171; m&#232;me &#187; internet. Mais tout le monde n'y a pas encore acc&#232;s.</description>
    </item>
    <item>
      <title>Les donn&#233;es d&#8217;un million de chasseurs fran&#231;ais ont &#233;t&#233; pirat&#233;es</title>
      <link>https://www.01net.com/actualites/donnees-million-chasseurs-francais-piratees.html</link>
      <pubDate>Fri, 23 Jan 2026 08:22:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322043</guid>
      <description>La F&#233;d&#233;ration nationale des chasseurs vient de rejoindre la longue liste des f&#233;d&#233;rations fran&#231;aises victimes d'une cyberattaque. Au cours d'un incident r&#233;cent, ce sont les donn&#233;es d'un million de chasseurs qui ont &#233;t&#233; compromises. Les informations compromises sont d'ores et d&#233;j&#224; sur le dark web.</description>
    </item>
    <item>
      <title>Elon Musk a encore sorti sa boule de cristal : les robots humano&#239;des de Tesla ont une date de sortie</title>
      <link>https://www.frandroid.com/produits-android/robots/2952699_elon-musk-a-encore-sorti-sa-boule-de-cristal-les-robots-humanoides-de-tesla-ont-une-date-de-sortie</link>
      <pubDate>Fri, 23 Jan 2026 08:19:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/robots/2952699_elon-musk-a-encore-sorti-sa-boule-de-cristal-les-robots-humanoides-de-tesla-ont-une-date-de-sortie</guid>
      <description>
Elon Musk a encore sorti sa boule de cristal &#224; Davos. Le patron de Tesla promet d&#233;sormais que son robot humano&#239;de, Optimus, sera disponible pour les particuliers d'ici fin 2027. Une annonce qui intervient alors que le programme robotique de la marque a perdu sa t&#234;te pensante il y a six mois. On y croit ?
</description>
    </item>
    <item>
      <title>La Cnil inflige une lourde amende pour publicit&#233; cibl&#233;e ill&#233;gale</title>
      <link>https://www.01net.com/actualites/la-cnil-inflige-une-lourde-amende-pour-publicite-ciblee-illegale.html</link>
      <pubDate>Fri, 23 Jan 2026 08:00:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322023</guid>
      <description>La Cnil a lourdement sanctionn&#233; une entreprise qui a transmis pendant des ann&#233;es des donn&#233;es personnelles des membres de son programme de fid&#233;lit&#233; &#224; un r&#233;seau social. Plus de 10 millions d'utilisateurs europ&#233;ens sont concern&#233;s.</description>
    </item>
    <item>
      <title>TikTok deal adds new U.S. owners. Heres what this means for users.</title>
      <link>https://mashable.com/article/tiktok-us-sale-new-owners-who-for-you-feed-algorithm</link>
      <pubDate>Fri, 23 Jan 2026 07:55:08 +0000</pubDate>
      <guid isPermaLink="false">00QzuuiEAmRmmMfgeZncCGe</guid>
      <description>TikTok in the U.S. will now be run by a majority U.S.-owned company established for this purpose, which will make changes to the app's content algorithm.</description>
    </item>
    <item>
      <title>Google propose de fouiller dans vos photos et vos mails pour am&#233;liorer ses r&#233;sultats de recherche</title>
      <link>https://www.frandroid.com/marques/google/2952685_google-propose-de-fouiller-dans-vos-photos-et-vos-mails-pour-ameliorer-ses-resultats-de-recherche</link>
      <pubDate>Fri, 23 Jan 2026 07:43:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2952685_google-propose-de-fouiller-dans-vos-photos-et-vos-mails-pour-ameliorer-ses-resultats-de-recherche</guid>
      <description>
Aur&#233;ol&#233; de son nouveau statut de roi de l&#8217;IA, Google d&#233;ploie une nouvelle fonctionnalit&#233; au sein de son moteur de recherche. Vos r&#233;sultats seront d&#233;sormais personnalis&#233;s gr&#226;ce au contenu de vos mails et de vos photos.
</description>
    </item>
    <item>
      <title>Google Photos int&#232;gre enfin la fonctionnalit&#233; parfaite pour cr&#233;er des m&#232;mes</title>
      <link>https://www.frandroid.com/android/applications/google-apps/2952683_google-photos-integre-enfin-la-fonctionnalite-parfaite-pour-creer-des-memes</link>
      <pubDate>Fri, 23 Jan 2026 07:38:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/applications/google-apps/2952683_google-photos-integre-enfin-la-fonctionnalite-parfaite-pour-creer-des-memes</guid>
      <description>
Transformez vos photos en m&#232;mes sur Google Photos gr&#226;ce &#224; cette nouvelle fonctionnalit&#233;, r&#233;serv&#233;e pour l'instant aux &#201;tats-Unis.
</description>
    </item>
  </channel>
</rss>
