<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 21 Feb 2026 20:30:41 GMT</lastBuildDate>
    <item>
      <title>Wikipedia blacklists Archive.today after alleged DDoS attack</title>
      <link>https://techcrunch.com/2026/02/21/wikipedia-blacklists-archive-today-after-alleged-ddos-attack/</link>
      <pubDate>Sat, 21 Feb 2026 20:20:15 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3095336</guid>
      <description>Wikipedia editors have decided to remove all links to Archive.today, a web archiving service that they said has been linked to more than 695,000 times across the online encyclopedia.</description>
    </item>
    <item>
      <title>The Legend That Defined the Music of &#8216;Final Fantasy&#8217; Is Getting the Biography He Deserves</title>
      <link>https://gizmodo.com/nobuo-uematsu-final-fantasy-biography-2000724768</link>
      <pubDate>Sat, 21 Feb 2026 19:50:00 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000724768</guid>
      <description>Read the story of longtime 'Final Fantasy' composer Nobuo Uematsu when his 'On the Record' biography hit stores this fall.</description>
    </item>
    <item>
      <title>'No one deploys AI at Meta&#8217;s scale': Meta signs up Nvidia to power its next big AI projects &#8212; so what exactly do Mark Zuckerberg and Jensen Huang have planned?</title>
      <link>https://www.techradar.com/pro/no-one-deploys-ai-at-metas-scale-meta-signs-up-nvidia-to-power-its-next-big-ai-projects-so-what-exactly-do-mark-zuckerberg-and-jensen-huang-have-planned</link>
      <pubDate>Sat, 21 Feb 2026 19:35:00 +0000</pubDate>
      <guid isPermaLink="false">7H9WcxjYMAn4e9L3zMhqMF</guid>
      <description>Meta partners with Nvidia to deploy millions of GPUs and CPUs, building scalable, privacy-focused AI infrastructure for global applications.</description>
    </item>
    <item>
      <title>The US will send Tech Corps members to foreign countries in its latest push for AI dominance</title>
      <link>https://www.engadget.com/ai/the-us-will-send-tech-corps-members-to-foreign-countries-in-its-latest-push-for-ai-dominance-191916940.html?src=rss</link>
      <pubDate>Sat, 21 Feb 2026 19:19:16 +0000</pubDate>
      <guid isPermaLink="false">02331e47-b9df-46ca-88a8-577ea1fb9f3a</guid>
      <description>The government agency that sends its corps members abroad to volunteer in foreign countries launched its latest initiative called Tech Corps. The Peace Corps' latest proposal will recruit STEM graduates or those with professional experience in the artificial intelligence sector and send them to participating host countries.
According to the press release, volunteers will be placed in Peace Corps countries that are part of the American AI Exports Program, which was created last year from an executive order from President Trump as a way to bolster the US' grip on the AI market abroad. Tech Corps...</description>
    </item>
    <item>
      <title>Obedient Traders Respond to Claude Code Cybersecurity Plugin by Selling Cybersecurity Stocks</title>
      <link>https://gizmodo.com/obedient-traders-respond-to-claude-code-cybersecurity-plugin-by-selling-cybersecurity-stocks-2000723240</link>
      <pubDate>Sat, 21 Feb 2026 19:11:21 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000723240</guid>
      <description>The SaaSpocalypse is not real, but it can hurt you.</description>
    </item>
    <item>
      <title>Le miracle de P&#233;kin, le retour du diesel chez Stellantis et on a test&#233; la Xiaomi SU7 &#233;lectrique &#8211; Le r&#233;cap Survolt&#233;s</title>
      <link>https://www.frandroid.com/survoltes/2985195_le-miracle-de-pekin-le-retour-du-diesel-chez-stellantis-et-on-a-teste-la-xiaomi-su7-electrique-le-recap-survoltes</link>
      <pubDate>Sat, 21 Feb 2026 19:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2985195_le-miracle-de-pekin-le-retour-du-diesel-chez-stellantis-et-on-a-teste-la-xiaomi-su7-electrique-le-recap-survoltes</guid>
      <description>
L&#8217;actualit&#233; Survolt&#233;s a &#233;t&#233; dense cette semaine, entre essais de nouveaux mod&#232;les &#233;lectriques, bons plans et analyses sur l&#8217;industrie et l&#8217;&#233;nergie. Voici le r&#233;capitulatif des articles les plus consult&#233;s sur Frandroid.
</description>
    </item>
    <item>
      <title>Optoma Photon Life PH31 : ce vid&#233;oprojecteur tr&#232;s lumineux chute &#224; 399 euros</title>
      <link>https://www.frandroid.com/bons-plans/2983159_optoma-photon-life-ph31-ce-videoprojecteur-tres-lumineux-chute-a-399-euros</link>
      <pubDate>Sat, 21 Feb 2026 18:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2983159_optoma-photon-life-ph31-ce-videoprojecteur-tres-lumineux-chute-a-399-euros</guid>
      <description>
Parmi les trois vid&#233;oprojecteurs Photon Life d'Optoma, le PH31 est le plus abordable et il passe de 499 euros &#224; 399 euros chez Amazon. Une superbe occasion pour obtenir un vid&#233;oprojecteur compact en Full HD.
</description>
    </item>
  </channel>
</rss>
