<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 23 Dec 2025 18:37:16 GMT</lastBuildDate>
    <item>
      <title>OpenAI says it's had to protect its Atlas AI browser against some serious security threats</title>
      <link>https://www.techradar.com/pro/security/openai-says-its-had-to-protect-its-atlas-ai-browser-against-some-serious-security-threats</link>
      <pubDate>Tue, 23 Dec 2025 18:35:00 +0000</pubDate>
      <guid isPermaLink="false">xoM7DxnumKquNAj3gXt5C3</guid>
      <description>Prompt injection might never go away, OpenAI says, as it compares it to phishing.</description>
    </item>
    <item>
      <title>Microsoft hails "storage revolution" as it adds native NVMe support to Windows Server 2025</title>
      <link>https://www.techradar.com/pro/microsoft-hails-storage-revolution-as-it-adds-native-nvme-support-to-windows-server-2025</link>
      <pubDate>Tue, 23 Dec 2025 18:30:00 +0000</pubDate>
      <guid isPermaLink="false">rEu2xUcpaX5i38Fwv2oEgd</guid>
      <description>Windows Server 2025 introduces native NVMe support, boosting storage performance, lowering latency, and improving efficiency for enterprise workloads and servers.</description>
    </item>
    <item>
      <title>The Final Episode of &#8216;Strange New Worlds&#8217; Has Found Its Sulu and Bones</title>
      <link>https://gizmodo.com/strange-new-worlds-bones-sulu-casting-star-trek-2000703025</link>
      <pubDate>Tue, 23 Dec 2025 18:21:39 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703025</guid>
      <description>Kai Murakami and Thomas Jane will play 'Star Trek' legends Hikaru Sulu and Leonard McCoy in the final episode of 'Strange New Worlds'.</description>
    </item>
    <item>
      <title>Judge blocks Texas app store age verification law</title>
      <link>https://www.theverge.com/news/849752/texas-app-store-accountability-act-age-verification-injunction</link>
      <pubDate>2025-12-23T13:15:49-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=849752</guid>
      <description>A federal judge blocked a Texas law requiring mobile app stores to verify users' ages from taking effect on January 1st. In an order granting a preliminary injunction on the Texas App Store Accountability Act (SB 2420), Judge Robert Pitman wrote that the statute "is akin to a law that would require every bookstore to [&#8230;]</description>
    </item>
    <item>
      <title>Cet &#233;cran PC gamer LG bien dot&#233; (24&#8243;, 120 Hz, FreeSync) co&#251;te moins de 80 &#8364; gr&#226;ce &#224; cette offre</title>
      <link>https://www.frandroid.com/bons-plans/2919351_cet-ecran-pc-gamer-lg-bien-dote-24-120-hz-freesync-coute-moins-de-80-e-grace-a-cette-offre</link>
      <pubDate>Tue, 23 Dec 2025 18:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2919351_cet-ecran-pc-gamer-lg-bien-dote-24-120-hz-freesync-coute-moins-de-80-e-grace-a-cette-offre</guid>
      <description>
Avis aux gamers exigeants, mais fauch&#233;s en cette fin d'ann&#233;e. Le moniteur gaming LG UltraGear 24G411A-B pr&#233;sente une fiche technique tr&#232;s compl&#232;te, tout en affichant un prix peu &#233;lev&#233; : en ce moment, PC Componentes le propose &#224; 78,35 euros au lieu de 109,99 euros.
</description>
    </item>
    <item>
      <title>Data Holds the Key in Slowing Age-Related Illnesses</title>
      <link>https://www.wired.com/story/data-holds-the-key-in-slowing-age-related-illnesses/</link>
      <pubDate>Tue, 23 Dec 2025 18:11:52 +0000</pubDate>
      <guid isPermaLink="false">694039fc045ef43972865817</guid>
      <description>More accurate and individualized health predictions will allow for preventative factors to be implemented well in advance.</description>
    </item>
    <item>
      <title>Engadget Podcast: Why is the Nex Playground 'AI console' such a hit?</title>
      <link>https://www.engadget.com/social-media/engadget-podcast-why-is-the-nex-playground-ai-console-such-a-hit-181151201.html?src=rss</link>
      <pubDate>Tue, 23 Dec 2025 18:11:51 +0000</pubDate>
      <guid isPermaLink="false">11152d10-819c-405c-8fea-5dd572e3319b</guid>
      <description>Over the past two years, the Nex Playground has carved out a niche for itself with kids and parents alike. It's a small box that sits in front of your TV and uses a camera, along with computer vision AI processing, to track your movement for interactive games. Think of it like a simplified version of Microsoft's Kinect (RIP), with a bit of the local multiplayer we see from the original Wii. In this bonus episode, we chat with David Lee, Nex's CEO and co-founder, about how he went from building a basketball tracking app to one of the most intriguing gaming console alternatives on the market. (T...</description>
    </item>
    <item>
      <title>Why Waymo went down in San Francisco</title>
      <link>https://www.fastcompany.com/91465377/waymo-san-francisco-outage-robotaxi</link>
      <pubDate>2025-12-23T18:07:09</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91465377/waymo-san-francisco-outage-robotaxi</guid>
      <description>For self-driving cars, the human in the loop can&#8217;t always answer the phone. 
Last weekend, a gnarly power outage in San Francisco took out a number of traffic lights, which, in turn, sent a number of self-driving Waymo robotaxis into a sort of fugue state. Instead of driving, some of the Waymos responded to these now-analog intersections by turning on their hazard lights, blocking traffic, and, well, not doing much of anything. There were multiple instances of Waymo cars clogging up roads, turning futuristic technology into glorified bollards. The city quickly asked the company to turn off the...</description>
    </item>
    <item>
      <title>The &#8216;Avatar: The Last Airbender&#8217; Movie Is Skipping Theaters</title>
      <link>https://gizmodo.com/avatar-aang-movie-streaming-paramount-2000702993</link>
      <pubDate>Tue, 23 Dec 2025 18:00:47 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702993</guid>
      <description>'Legend of Aang' will now debut on streaming, hitting Paramount+ in fall 2026.</description>
    </item>
    <item>
      <title>These great digital gifts will arrive just in time for Christmas</title>
      <link>https://www.theverge.com/gadgets/848999/best-digital-gift-ideas-online-cards-subscriptions-2025</link>
      <pubDate>2025-12-23T13:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/848999/here-are-40-last-minute-gifts-you-can-still-nab-before-christmas</guid>
      <description>And just like that, Christmas is less than two days away, which is too soon for most items bought online to arrive in time. That said, you aren&#8217;t alone if you waited too long to start buying gifts this year, and you definitely aren&#8217;t alone in feeling guilty for considering digital gifts instead of something [&#8230;]</description>
    </item>
    <item>
      <title>I've reviewed over a dozen coffee makers this year, and these are my 3 favorites from 2025</title>
      <link>https://www.techradar.com/home/coffee-machines/ive-reviewed-over-a-dozen-coffee-makers-this-year-and-these-are-my-3-favorites-from-2025</link>
      <pubDate>Tue, 23 Dec 2025 18:00:00 +0000</pubDate>
      <guid isPermaLink="false">VSQAYiLcwiFZmvCfjAV8ym</guid>
      <description>Three outstanding options to help you through the daily grind</description>
    </item>
    <item>
      <title>RAM buyers beware &#8212; expensive high-end memory kit from Corsair was reportedly swapped for dummy RGB lighting modules</title>
      <link>https://www.techradar.com/computing/memory/ram-buyers-beware-expensive-high-end-memory-kit-from-corsair-was-reportedly-swapped-for-dummy-rgb-lighting-modules</link>
      <pubDate>Tue, 23 Dec 2025 18:00:00 +0000</pubDate>
      <guid isPermaLink="false">Svi6EHxCUiKn2vZCacy23J</guid>
      <description>A buyer returned their 96GB memory kit worth $999 only to receive a replacement that consisted of $35 worth of dummy RGB lighting modules.</description>
    </item>
    <item>
      <title>Level up your listening with $39 off the Apple AirPods Pro 3</title>
      <link>https://mashable.com/article/dec-23-apple-airpods-pro-3-deal</link>
      <pubDate>Tue, 23 Dec 2025 17:56:16 +0000</pubDate>
      <guid isPermaLink="false">06J0Ch2JbI8kWFXfnm5rYnW</guid>
      <description>As of Dec. 23, get $39 off a pair of Apple AirPods Pro 3 earbuds.</description>
    </item>
    <item>
      <title>The U.S. Has Officially Banned New, Foreign-Made Drone Models</title>
      <link>https://gizmodo.com/the-u-s-has-officially-banned-new-foreign-made-drone-models-2000702978</link>
      <pubDate>Tue, 23 Dec 2025 17:40:12 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702978</guid>
      <description>Merry Christmas, drone enthusiasts!</description>
    </item>
    <item>
      <title>How to watch The Smashing Machine: Dwayne Johnsons Mark Kerr biopic is now streaming</title>
      <link>https://mashable.com/article/how-to-watch-the-smashing-machine</link>
      <pubDate>Tue, 23 Dec 2025 17:35:44 +0000</pubDate>
      <guid isPermaLink="false">00rX6wNJUbfMvCtZ9yUgCki</guid>
      <description>Is "The Smashing Machine" streaming yet? Find out how to watch Dwayne Johnson's Mark Kerr biopic.</description>
    </item>
    <item>
      <title>How to get your grocery costs down</title>
      <link>https://mashable.com/article/how-to-find-cheaper-groceries</link>
      <pubDate>Tue, 23 Dec 2025 17:34:49 +0000</pubDate>
      <guid isPermaLink="false">00mEB7d0SJkkcUNTgA0qMIg</guid>
      <description>Grocery costs are up, so shoppers need to get more savvy.</description>
    </item>
    <item>
      <title>NYPD Sued Over Possible Records Collected Through Muslim Spying Program</title>
      <link>https://www.wired.com/story/nypd-sued-over-possible-records-collected-through-muslim-spying-program/</link>
      <pubDate>Tue, 23 Dec 2025 17:33:26 +0000</pubDate>
      <guid isPermaLink="false">6944294ad6fcf13e94fd61ab</guid>
      <description>The New York Police Department's &#8220;mosque-raking&#8221; program targeted Muslim communities across NYC. Now, as the city's first Muslim mayor takes office, one man is fighting&#8212;again&#8212;to fully expose it.</description>
    </item>
    <item>
      <title>These are the 6 best Christmas films of all-time according to you, the TechRadar audience</title>
      <link>https://www.techradar.com/streaming/entertainment/these-are-the-6-best-christmas-films-of-all-time-according-to-you-the-techradar-audience</link>
      <pubDate>Tue, 23 Dec 2025 17:33:23 +0000</pubDate>
      <guid isPermaLink="false">dHko3b3ZevYKB7BKVhGYNL</guid>
      <description>You voted for your favorite Christmas movies, here are six of the Christmas classics you love to watch.</description>
    </item>
    <item>
      <title>Marvel Rivals studio teases a big year ahead for the game &#8212; 'We're not going to slow down'</title>
      <link>https://www.techradar.com/gaming/marvel-rivals-studio-teases-a-big-year-ahead-for-the-game-were-not-going-to-slow-down</link>
      <pubDate>Tue, 23 Dec 2025 17:29:54 +0000</pubDate>
      <guid isPermaLink="false">htGaEmpSY8SsiomcDmoM2i</guid>
      <description>NetEase Games has confirmed that it has "bigger plans" ahead for Marvel Rivals in 2026 after a successful first year of release, with executive producer Danny Koo teasing new content planned "more than a year ahead".</description>
    </item>
    <item>
      <title>Test du SwitchBot AI Art Frame : le cadre photo num&#233;rique n&#8217;est pas mort, bien au contraire</title>
      <link>https://www.frandroid.com/test/2911751_test-du-switchbot-ai-art-frame-le-cadre-photo-numerique-nest-pas-mort-bien-au-contraire</link>
      <pubDate>Tue, 23 Dec 2025 17:26:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/test/2911751_test-du-switchbot-ai-art-frame-le-cadre-photo-numerique-nest-pas-mort-bien-au-contraire</guid>
      <description>
On se noie sous les &#233;crans. Du r&#233;veil au coucher, c'est une avalanche de r&#233;tro&#233;clairage, de notifications&#8230; qui nous grille la r&#233;tine. SwitchBot, d'habitude connu pour ses petits robots qui appuient sur des interrupteurs &#224; notre place, prend un virage &#224; 180 degr&#233;s. Leur promesse avec l'AI Art Frame ? Un &#233;cran qui ne ressemble pas &#224; un &#233;cran. Pas de fil, pas de lumi&#232;re, juste de l'encre &#233;lectronique couleur pour transformer votre mur en galerie d'art dynamique. On l'a test&#233; !
...</description>
    </item>
    <item>
      <title>#FrandroidOffreMoi un pack Samsung (PC + &#233;couteurs) : Galaxy Book 5 Pro et Galaxy Buds 3 Pro</title>
      <link>https://www.frandroid.com/marques/samsung/2917341_frandroidoffremoi-un-pack-samsung-pc-ecouteurs-galaxy-book-5-pro-et-galaxy-buds-3-pro</link>
      <pubDate>Tue, 23 Dec 2025 17:25:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2917341_frandroidoffremoi-un-pack-samsung-pc-ecouteurs-galaxy-book-5-pro-et-galaxy-buds-3-pro</guid>
      <description>
Avant-dernier jour du concours et calendrier de l'Avent #FrandroidOffreMoi. Aujourd'hui, c'est Samsung qui est &#224; l'honneur avec un pack PC + &#233;couteurs sans fil.
</description>
    </item>
    <item>
      <title>Nvidia is reportedly reshuffling its cloud efforts to better combat growing competition</title>
      <link>https://www.techradar.com/pro/nvidia-is-reportedly-reshuffling-its-cloud-efforts-to-help-deal-with-growing-competition</link>
      <pubDate>Tue, 23 Dec 2025 17:20:00 +0000</pubDate>
      <guid isPermaLink="false">brFqgQR3sFPWTiQwnR2oSZ</guid>
      <description>Nvidia had reportedly scaled back its cloud businesses so as not to take on AWS, Azure and Google Cloud.</description>
    </item>
    <item>
      <title>The powerful M5 iPad Pro 11-inch is $100 off at Amazon and it arrives before Christmas</title>
      <link>https://mashable.com/article/dec-23-ipad-pro-m5-deal</link>
      <pubDate>Tue, 23 Dec 2025 17:17:20 +0000</pubDate>
      <guid isPermaLink="false">06SnLwLeQ9pgfc4mUzVMsKH</guid>
      <description>The 11-inch M5 iPad Pro is on sale at Amazon for $899, down from the list price of $999. That's a 10% discount.</description>
    </item>
    <item>
      <title>Safety Panel Calls Out NASA for Downplaying the Boeing Starliner Mess</title>
      <link>https://gizmodo.com/safety-panel-calls-nasa-out-for-downplaying-the-boeing-starliner-mess-2000702881</link>
      <pubDate>Tue, 23 Dec 2025 17:15:50 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702881</guid>
      <description>The space agency failed to declare the spacecraft's thruster glitch as a mishap, creating confusion and uncertainty.</description>
    </item>
    <item>
      <title>US insurance giant Aflac says hackers stole personal and health data of 22.6 million</title>
      <link>https://techcrunch.com/2025/12/23/us-insurance-giant-aflac-says-hackers-stole-personal-data-of-22-6-million/</link>
      <pubDate>Tue, 23 Dec 2025 17:14:04 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078570</guid>
      <description>Aflac, one of the largest insurance companies in the U.S., confirmed hackers stole reams of personal data, including Social Security numbers, identity documents, and health information.</description>
    </item>
    <item>
      <title>What time do stores close on Christmas eve: Shopping hours for Walmart, Target, more</title>
      <link>https://mashable.com/article/christmas-eve-store-hours-walmart-target-more</link>
      <pubDate>Tue, 23 Dec 2025 17:07:04 +0000</pubDate>
      <guid isPermaLink="false">06jVXGUrnnuhyxmRrelUmp3</guid>
      <description>Trying to squeeze in some last minute holiday shopping? Shop until the very last minute on Christmas Eve. Check out the store hours for Target, Walmart, and more.</description>
    </item>
    <item>
      <title>L&#8217;excellent Samsung Galaxy A56 accompagn&#233; de son &#233;clatante dalle Amoled perd 42 % de son prix</title>
      <link>https://www.frandroid.com/bons-plans/2919741_lexcellent-samsung-galaxy-a56-accompagne-de-son-eclatante-dalle-amoled-perd-42-de-son-prix</link>
      <pubDate>Tue, 23 Dec 2025 17:06:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2919741_lexcellent-samsung-galaxy-a56-accompagne-de-son-eclatante-dalle-amoled-perd-42-de-son-prix</guid>
      <description>
Le Samsung A56 est un super smartphone de milieu de gamme, notamment gr&#226;ce &#224; une superbe dalle Amoled. Chez Amazon, il tombe &#224; 289 euros et s'approche des t&#233;l&#233;phones les plus abordables du march&#233;.
</description>
    </item>
    <item>
      <title>Forfaits Sosh : ce qu&#8217;il faut savoir sur les offres internet et mobiles de l&#8217;op&#233;rateur low-cost d&#8217;Orange</title>
      <link>https://www.frandroid.com/services/operateurs-mobiles/1629865_sosh-notre-avis-sur-loperateur-low-cost-dorange-en-2023</link>
      <pubDate>Tue, 23 Dec 2025 17:02:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/operateurs-mobiles/1629865_sosh-notre-avis-sur-loperateur-low-cost-dorange-en-2023</guid>
      <description>
Sosh est la filiale low-cost d'Orange, elle permet de profiter du r&#233;seau de l'op&#233;rateur historique &#224; un prix plus accessible et sans engagement. Cette ann&#233;e, Sosh a consid&#233;rablement modernis&#233; son offre avec notamment l'arriv&#233;e d'une box Wi-Fi 7 &#224; bas co&#251;t comme ce que fait B&amp;YOU, mais le reste est-il &#224; la hauteur ?
</description>
    </item>
    <item>
      <title>Droit d&#8217;auteur&#160;: une nouvelle plainte vise six g&#233;ants de l&#8217;IA aux &#201;tats-Unis</title>
      <link>https://www.01net.com/actualites/droit-dauteur-une-nouvelle-plainte-vise-six-geants-de-lia-aux-etats-unis.html</link>
      <pubDate>Tue, 23 Dec 2025 17:01:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316866</guid>
      <description>Des auteurs ont d&#233;cid&#233;, outre Atlantique, de porter plainte contre les principales soci&#233;t&#233;s de l'IA. Comme dans d'autres proc&#233;dures, les &#233;crivains accusent les g&#233;ants du secteur d'avoir utilis&#233; des biblioth&#232;ques illicites, dans lesquelles se trouvent leurs oeuvres, pour entra&#238;ner leurs syst&#232;mes. Ce sans autorisation et en violation de leur droit d'auteur, selon ces derniers....</description>
    </item>
    <item>
      <title>Les astronomes stup&#233;faits : la temp&#234;te g&#233;ante de Jupiter oscille comme un bol de g&#233;latine</title>
      <link>https://www.futura-sciences.com/sciences/actualites/systeme-solaire-astronomes-stupefaits-tempete-geante-jupiter-oscille-comme-bol-gelatine-c7g3-128692/#xtor%3DRSS-8</link>
      <pubDate>Tue, 23 Dec 2025 18:01:03 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/systeme-solaire-astronomes-stupefaits-tempete-geante-jupiter-oscille-comme-bol-gelatine-c7g3-128692/#xtor%3DRSS-8</guid>
      <description>La Grande tache rouge de Jupiter est observ&#233;e par les astronomes depuis au moins 150&#160;ans.&#160;Ils&#160;ont r&#233;cemment d&#233;couvert&#160;un comportement tout &#224; fait inattendu gr&#226;ce au t&#233;lescope spatial Hubble.</description>
    </item>
    <item>
      <title>&#8216;Anaconda&#8217; Slithers on That Line of So Bad, It&#8217;s Good</title>
      <link>https://gizmodo.com/anaconda-movie-review-jack-black-paul-rudd-2000702059</link>
      <pubDate>Tue, 23 Dec 2025 17:00:46 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702059</guid>
      <description>Jack Black, Paul Rudd, Steve Zahn, and Thandiwe Newton star in the meta comedy remake, out Christmas Day.</description>
    </item>
    <item>
      <title>The Cyber Monday Kindle Unlimited deal is back: get 3 months for 99 cents</title>
      <link>https://mashable.com/article/dec-23-kindle-unlimited-deal</link>
      <pubDate>Tue, 23 Dec 2025 17:00:44 +0000</pubDate>
      <guid isPermaLink="false">07l5A6UJuC1gdNKMq52j3bs</guid>
      <description>Get three months of Kindle Unlimited for only 99 cents and save nearly $35 on loads of books.</description>
    </item>
    <item>
      <title>This founder just landed funding for a second go at the same problem: Affordable custom home design</title>
      <link>https://techcrunch.com/2025/12/23/this-founder-just-landed-backing-for-a-second-go-at-the-same-problem-affordable-custom-home-design/</link>
      <pubDate>Tue, 23 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078462</guid>
      <description>Drafted is now nearly five months old, and it's everything Atmos wasn't.</description>
    </item>
    <item>
      <title>Here are the best live service games to spend the Holiday season in, from Fortnite&#8217;s cozy Winterfest to the snow-covered hills of Arc Raiders</title>
      <link>https://www.techradar.com/gaming/here-are-the-best-live-service-games-to-spend-the-holiday-season-in-from-fortnites-cozy-winterfest-to-the-snow-covered-hills-of-arc-raiders</link>
      <pubDate>Tue, 23 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">jNCn96y93nYL6PxeRvWpff</guid>
      <description>It's time to settle into the various Holiday events currently running in live service games. Here's my picks for the 6 best that are worth your time over Christmas.</description>
    </item>
    <item>
      <title>Prime members can claim loads of free games in latest Amazon giveaway including one of the best PC strategy games ever</title>
      <link>https://www.techradar.com/gaming/prime-members-can-claim-loads-of-free-games-in-latest-amazon-giveaway-including-one-of-the-best-pc-strategy-games-ever</link>
      <pubDate>Tue, 23 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">RPxAxko4iVhhzQwf4aeRsZ</guid>
      <description>Amazon Prime members shouldn't miss the current deluge of free games available with Luna.</description>
    </item>
    <item>
      <title>Consuming news from AI shifts our opinions and reality. Here&#8217;s how</title>
      <link>https://www.fastcompany.com/91463857/ai-news-shifts-opinions-reality</link>
      <pubDate>2025-12-23T17:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463857/ai-news-shifts-opinions-reality</guid>
      <description>Proponents of AI regulation often cite neutral AI as a goal, but true neutrality is often unattainable.
Meta&#8217;s decision to end its professional fact-checking program sparked a wave of criticism in the tech and media world. Critics warned that dropping expert oversight could erode trust and reliability in the digital information landscape, especially when profit-driven platforms are mostly left to police themselves....</description>
    </item>
    <item>
      <title>Anaconda review: Jack Black and Paul Rudd deliver a surprising comedy &#8212; but its a bad surprise</title>
      <link>https://mashable.com/article/anaconda-paul-rudd-jack-black-review</link>
      <pubDate>Tue, 23 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">031x474c1rp7GpqlPEoZ05P</guid>
      <description>Paul Rudd and Jack Black star in Kevin Etten and Tom Gormican's remake of "Anaconda." Review.</description>
    </item>
    <item>
      <title>Cuffing season is here! The best dating apps for serious relationships, reviewed.</title>
      <link>https://mashable.com/roundup/best-dating-apps-for-serious-relationships</link>
      <pubDate>Tue, 23 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">06f3wnwEe7A3tER37poRDdo</guid>
      <description>The best dating apps for people looking for a long-term relationship.</description>
    </item>
    <item>
      <title>Voici le meilleur smartphone de l&#8217;ann&#233;e &#8211; Frandroid Awards 2025</title>
      <link>https://www.frandroid.com/marques/samsung/2896283_voici-le-meilleur-smartphone-de-lannee-frandroid-awards-2025</link>
      <pubDate>Tue, 23 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2896283_voici-le-meilleur-smartphone-de-lannee-frandroid-awards-2025</guid>
      <description>
Parmi les mod&#232;les test&#233;s par Frandroid, le Samsung Galaxy S25 Ultra se distingue en recevant le prix du meilleur smartphone de 2025 lors des Frandroid Awards avec Delos. Voici pourquoi.
</description>
    </item>
    <item>
      <title>Marissa Mayer&#8217;s new startup Dazzle raises $8M led by Forerunner&#8217;s Kirsten Green</title>
      <link>https://techcrunch.com/2025/12/23/marissa-mayers-new-startup-dazzle-raises-8m-led-by-forerunners-kirsten-green/</link>
      <pubDate>Tue, 23 Dec 2025 16:48:45 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078478</guid>
      <description>Mayer launched Dazzle after shuttering her photo and contact management startup Sunshine. Green&#8217;s investment suggests Dazzle is poised for the coming wave of new AI-infused consumer businesses.</description>
    </item>
    <item>
      <title>Cyberattaque La Poste&#160;: des hackers prorusses revendiquent la paralysie des services</title>
      <link>https://www.01net.com/actualites/cyberattaque-la-poste-des-hackers-prorusses-revendiquent-la-paralysie-des-services.html</link>
      <pubDate>Tue, 23 Dec 2025 16:47:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316924</guid>
      <description>Alors que les services en ligne de La Poste reviennent p&#233;niblement &#224; la normale ce mardi, une piste se dessine sur l'identit&#233; des assaillants. Le groupe de cybercriminels prorusses &#171; NoName057(16) &#187; a revendiqu&#233; l'attaque sur les r&#233;seaux sociaux. Une information &#224; prendre avec pr&#233;caution, qui n'a pas &#233;t&#233; confirm&#233;e par l'entreprise publique.</description>
    </item>
    <item>
      <title>Last-minute gifts on sale thatll arrive before Christmas: DoorDash gift cards, Fire Sticks, the Shark Glossi, more</title>
      <link>https://mashable.com/article/dec-23-last-minute-christmas-gift-deals-amazon</link>
      <pubDate>Tue, 23 Dec 2025 16:46:55 +0000</pubDate>
      <guid isPermaLink="false">041BEUgGQwIIM27pWecREfE</guid>
      <description>Scrambling for a gift that'll arrive by Dec. 25? We found Amazon deals from Keurig, Apple, Shark, and more with same-day delivery.</description>
    </item>
    <item>
      <title>Trump&#8217;s War on Offshore Wind Is a Gut Punch to the AI Boom</title>
      <link>https://gizmodo.com/trumps-war-on-offshore-wind-is-a-gut-punch-to-the-ai-boom-2000702936</link>
      <pubDate>Tue, 23 Dec 2025 16:45:44 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702936</guid>
      <description>U.S. electricity consumption is growing for the first time in a decade l due to AI, so why are we stunting renewable energy development?</description>
    </item>
    <item>
      <title>FCC bans foreign drones, including DJI. What happens next.</title>
      <link>https://mashable.com/article/fcc-bans-foreign-drones-including-dji-what-happens-next</link>
      <pubDate>Tue, 23 Dec 2025 16:41:04 +0000</pubDate>
      <guid isPermaLink="false">04KrvGrof8dnxfxnqSRaoRV</guid>
      <description>The U.S. just banned foreign drone makers like DJI. What happens to your DJI drone now?</description>
    </item>
  </channel>
</rss>
