<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 30 Jan 2026 08:47:00 GMT</lastBuildDate>
    <item>
      <title>Galaxy S26 et Buds 4 : on conna&#238;t (enfin) la date de l&#8217;Unpacked</title>
      <link>https://www.frandroid.com/marques/samsung/2960885_galaxy-s26-et-buds-4-on-connait-enfin-la-date-de-lunpacked</link>
      <pubDate>Fri, 30 Jan 2026 08:36:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2960885_galaxy-s26-et-buds-4-on-connait-enfin-la-date-de-lunpacked</guid>
      <description>
L'incontournable Evan Blass vient de partager ce qui semble &#234;tre l'invitation officielle pour le prochain Galaxy Unpacked. Le 25 f&#233;vrier 2026, Samsung pr&#233;sentera ses Galaxy S26 et les Galaxy Buds 4.
</description>
    </item>
    <item>
      <title>Un bug touche 4 banques fran&#231;aises et Vinted&#160;: votre compte a peut-&#234;tre &#233;t&#233; d&#233;bit&#233; par erreur</title>
      <link>https://www.01net.com/actualites/bug-banques-francaises-vinted-compte-debite-erreur.html</link>
      <pubDate>Fri, 30 Jan 2026 08:15:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323402</guid>
      <description>De nombreux clients de Boursorama, Banque Populaire, Caisse d&#8217;&#201;pargne ou encore Cr&#233;dit Coop&#233;ratif ont &#233;t&#233; d&#233;bit&#233;s par erreur ces derniers jours. D'anciennes transactions, notamment en provenance de Vinted, ont &#233;t&#233; trait&#233;es une deuxi&#232;me fois. Il ne s'agit pas d'une fraude, mais d'un incident chez un prestataire de paiement.</description>
    </item>
    <item>
      <title>Xbox au bord du gouffre, les d&#233;veloppeurs d&#233;laissent en masse les consoles de Microsoft</title>
      <link>https://www.frandroid.com/marques/microsoft/2960837_xbox-au-bord-du-gouffre-les-developpeurs-delaissent-en-masse-les-consoles-de-microsoft</link>
      <pubDate>Fri, 30 Jan 2026 08:06:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2960837_xbox-au-bord-du-gouffre-les-developpeurs-delaissent-en-masse-les-consoles-de-microsoft</guid>
      <description>
Le dernier rapport de la GDC vient de tomber et les chiffres sont sans appel : la Xbox Series X|S perd son attrait aupr&#232;s des d&#233;veloppeurs. D&#233;sormais, m&#234;me le Steam Deck semble plus s&#233;duisant pour lancer un jeu.
</description>
    </item>
    <item>
      <title>Windows 11 prend l&#8217;eau, Microsoft promet de colmater les br&#232;ches</title>
      <link>https://www.01net.com/actualites/windows-11-prend-leau-microsoft-promet-de-colmater-les-breches.html</link>
      <pubDate>Fri, 30 Jan 2026 08:01:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323389</guid>
      <description>Windows 11, c'est compliqu&#233; en ce moment. Entre les bugs, les probl&#232;mes de stabilit&#233; et l'injection massive d'IA parfois &#224; tort et &#224; travers, on ne peut pas dire que le syst&#232;me d'exploitation fasse la joie de ses utilisateurs. Microsoft promet de faire mieux cette ann&#233;e.</description>
    </item>
    <item>
      <title>The best budgeting apps for 2026</title>
      <link>https://www.engadget.com/apps/best-budgeting-apps-120036303.html?src=rss</link>
      <pubDate>Fri, 30 Jan 2026 08:00:36 +0000</pubDate>
      <guid isPermaLink="false">1bf1c17b-7ece-4b18-b17b-dc7b5e70f411</guid>
      <description>Managing your finances doesn&#8217;t have to be a headache &#8212; especially with the right budgeting app at your fingertips. Whether you&#8217;re trying to track everyday spending, save for a big purchase or just keep a closer eye on your subscriptions, there&#8217;s an app that can help. With Mint shutting down, plenty of users have been looking for the best budget apps to replace it, and luckily there are plenty of solid alternatives.From AI-powered spending trackers to apps that break down your expenses into easy-to-follow categories, the best budgeting tools help you take control of your money without the hassl...</description>
    </item>
    <item>
      <title>Belkin is pulling the plug on its Wemo smart home range tomorrow &#8211; here&#8217;s the full list and what to do</title>
      <link>https://www.techradar.com/home/smart-home/belkin-is-pulling-the-plug-on-its-wemo-smart-home-range-tomorrow-heres-the-full-list-and-what-to-do</link>
      <pubDate>Fri, 30 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">ngoFDspV5DX7PWffWqBuHS</guid>
      <description>As of January 31, Belkin is shutting down a large number of Wemo smart home devices, including wiping its app and cloud features.</description>
    </item>
    <item>
      <title>Google Maps&#160;: Gemini peut d&#233;sormais vous servir de guide touristique personnel</title>
      <link>https://www.01net.com/actualites/google-maps-gemini-peut-desormais-servir-guide-touristique-personnel.html</link>
      <pubDate>Fri, 30 Jan 2026 07:58:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323404</guid>
      <description>Google Maps et Gemini peuvent maintenant vous aider &#224; d&#233;couvrir votre environnement lors de vos trajets &#224; pied et &#224; v&#233;lo.</description>
    </item>
    <item>
      <title>La derni&#232;re IA de Google vous permet de cr&#233;er des copies de Zelda Breath of the Wild en plus moche, mais le potentiel est l&#224;</title>
      <link>https://www.frandroid.com/marques/google/2960841_la-derniere-ia-de-google-vous-permet-de-creer-des-copies-de-zelda-breath-of-the-wild-en-plus-moche-mais-le-potentiel-est-la</link>
      <pubDate>Fri, 30 Jan 2026 07:43:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2960841_la-derniere-ia-de-google-vous-permet-de-creer-des-copies-de-zelda-breath-of-the-wild-en-plus-moche-mais-le-potentiel-est-la</guid>
      <description>
D&#233;voil&#233;e l&#8217;ann&#233;e derni&#232;re, l&#8217;intelligence artificielle g&#233;n&#233;rative Genie de Google va &#234;tre mise &#224; disposition du grand public. Pour le moment, l&#8217;outil manque d&#8217;imagination et d&#8217;optimisation, mais les promesses techniques sont l&#224;.
</description>
    </item>
    <item>
      <title>Mini enceinte, mini prix : la JBL Go 4 chute sous les 40 &#8364; pendant les soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2960457_mini-enceinte-mini-prix-la-jbl-go-4-chute-sous-les-40-e-pendant-les-soldes-dhiver</link>
      <pubDate>Fri, 30 Jan 2026 07:36:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2960457_mini-enceinte-mini-prix-la-jbl-go-4-chute-sous-les-40-e-pendant-les-soldes-dhiver</guid>
      <description>
Compacte, solide, &#233;tanche et suffisamment performante, la JBL Go 4 est une enceinte Bluetooth id&#233;ale &#224; emporter partout. En cette fin de soldes d'hiver, Amazon et Boulanger la proposent &#224; 38 euros au lieu de 49,99 euros.
</description>
    </item>
    <item>
      <title>Anthropic, le g&#233;ant de l&#8217;IA vis&#233; par une nouvelle plainte &#224; 3 milliards</title>
      <link>https://www.01net.com/actualites/anthropic-vise-par-une-nouvelle-plainte-a-3-milliards-de-dollars-pour-violation-du-droit-dauteur.html</link>
      <pubDate>Fri, 30 Jan 2026 07:26:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323384</guid>
      <description>&#192; chaque jour (ou presque) sa plainte contre une entreprise de l'IA. Une coalition d'&#233;diteurs de musique poursuit Anthropic pour violation du droit d'auteur. Les plaignants r&#233;clament plus de 3 milliards de dollars de dommages pour l'exploitation sans autorisation de 20&#160;000 chansons.</description>
    </item>
    <item>
      <title>Votre Pixel Tablet vient de prendre de la valeur aujourd&#8217;hui, on vous explique pourquoi</title>
      <link>https://www.frandroid.com/marques/google/2960813_votre-pixel-tablet-vient-de-prendre-de-la-valeur-aujourdhui-on-vous-explique-pourquoi</link>
      <pubDate>Fri, 30 Jan 2026 07:19:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2960813_votre-pixel-tablet-vient-de-prendre-de-la-valeur-aujourdhui-on-vous-explique-pourquoi</guid>
      <description>
C'est une annonce que l'on n'attendait pas. Google a d&#233;cid&#233; de revoir sa politique de mise &#224; jour pour sa Pixel Tablet. L'appareil b&#233;n&#233;ficiera finalement d'un support &#233;tendu jusqu'en juin 2028.
</description>
    </item>
    <item>
      <title>&#171; Saisir et d&#233;truire les v&#233;los et kits de conversion non conformes &#187; : un important projet de loi autour des v&#233;los &#233;lectriques examin&#233; au Royaume-Uni</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2960809_saisir-et-detruire-les-velos-et-kits-de-conversion-non-conformes-un-important-projet-de-loi-autour-des-velos-electriques-examine-au-royaume-uni</link>
      <pubDate>Fri, 30 Jan 2026 07:10:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2960809_saisir-et-detruire-les-velos-et-kits-de-conversion-non-conformes-un-important-projet-de-loi-autour-des-velos-electriques-examine-au-royaume-uni</guid>
      <description>
D&#233;pos&#233; le 27 janvier 2026 au Parlement britannique, un projet de loi port&#233; par la d&#233;put&#233;e travailliste Julie Minns entend renforcer la lutte contre les v&#233;los &#233;lectriques ill&#233;gaux et les kits de conversion non conformes.
</description>
    </item>
    <item>
      <title>Apple et Samsung seuls au monde&#160;: ces 10 smartphones sont les plus vendus dans le monde en 2025</title>
      <link>https://www.01net.com/actualites/apple-et-samsung-seuls-au-monde-ces-10-smartphones-sont-les-plus-vendus-dans-le-monde-en-2025.html</link>
      <pubDate>Fri, 30 Jan 2026 07:00:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323379</guid>
      <description>On prend les m&#234;mes et on recommence. Apple et Samsung se sont partag&#233; le top 10 des plus fortes ventes de smartphones l'an dernier. Le constructeur am&#233;ricain s'est arrog&#233; la part du lion.</description>
    </item>
    <item>
      <title>UCI Cyclocross World Championships 2026 Free Streams: How to watch online from anywhere in the world</title>
      <link>https://www.techradar.com/how-to-watch/cycling/uci-cyclocross-world-championships-2026-free-streams-anywhere</link>
      <pubDate>Fri, 30 Jan 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">5dAwhLpXEh8u9CxJAQncff</guid>
      <description>With the Cyclocross World cup finished it's time for the main event, the World Championships which this year come to us from Hulst in the Netherlands.</description>
    </item>
    <item>
      <title>These three toxic power moves kill meetings</title>
      <link>https://www.fastcompany.com/91476500/these-three-toxic-power-moves-kill-meetings</link>
      <pubDate>2026-01-30T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91476500/these-three-toxic-power-moves-kill-meetings</guid>
      <description>In a new book, organizational behavior expert Rebecca Hinds lays out what they are and what you can do about them.
Meetings are breeding grounds for three highly toxic power moves:</description>
    </item>
    <item>
      <title>The surprising reason why women are using AI less often than men</title>
      <link>https://www.fastcompany.com/91482896/the-surprising-reason-women-are-snubbing-ai</link>
      <pubDate>2026-01-30T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91482896/the-surprising-reason-women-are-snubbing-ai</guid>
      <description>A growing body of research shows that women&#8217;s feelings about AI are more likely to affect their behavior than men&#8217;s, with one concern standing out in particular.
A decade ago, when Claire Burgi moved to New York City, she decided to cut meat out of her diet. The 33-year-old actor and audiobook narrator, who lives in Queens, grew up in California, where she&#8217;d seen the effects of climate change firsthand. She knew that meat consumption was a major driver of greenhouse gas emissions and that vegetarianism was a way to help conserve resources and reduce pollution....</description>
    </item>
  </channel>
</rss>
