<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 08 Dec 2025 14:27:30 GMT</lastBuildDate>
    <item>
      <title>Netflix is buying Warner Bros: All of the latest updates</title>
      <link>https://www.theverge.com/news/839007/netflix-warner-acquisition</link>
      <pubDate>2025-12-08T09:27:21-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?post_type=vm_stream&amp;p=839007</guid>
      <description>After a bidding war that reportedly also involved Paramount, Comcast, Amazon, and Apple, on December 5th, Netflix struck a deal to buy Warner Bros. for $82.7 billion, buying the studio, HBO / HBO Max, Warner Games, and more, while leaving cable and sports assets, including CNN, TNT Sports, and the Discovery channels out. A few [&#8230;]</description>
    </item>
    <item>
      <title>Coup de th&#233;&#226;tre, Paramount annonce son projet de rachat de Warner Bros, contre Netflix</title>
      <link>https://www.frandroid.com/services/svod/2902159_paramount-annonce-son-projet-de-rachat-de-warner-bros</link>
      <pubDate>Mon, 08 Dec 2025 14:21:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2902159_paramount-annonce-son-projet-de-rachat-de-warner-bros</guid>
      <description>
C'est officiel, Paramount veut aussi racheter Warner Bros et faire capoter le plan de Netflix. 
</description>
    </item>
    <item>
      <title>The Google Pixel Watch 4 is cheaper than ever right now</title>
      <link>https://www.engadget.com/wearables/the-google-pixel-watch-4-is-cheaper-than-ever-right-now-141715083.html?src=rss</link>
      <pubDate>Mon, 08 Dec 2025 14:17:15 +0000</pubDate>
      <guid isPermaLink="false">1b949628-f2d3-445a-9a6f-a5034c100faa</guid>
      <description>Cyber Monday has come and gone, but you can still get a great deal on a smartwatch with the Google Pixel Watch 4 marked down to $300 from $350. At almost 15 percent off, this is the lowest we've ever seen it.


The Pixel Watch 4 was just released in October and is our smartwatch of choice for users with Pixel phones. In our hands-on review we scored it 86 out of 100, taking note of its fast recharge time, health and fitness tracking, repairable design and gorgeous display. 
The curved display sits under a domed glass cover and sports an impressive 3,000 nits of peak brightness, well beyond the...</description>
    </item>
    <item>
      <title>OpenAI walks back ad-like app suggestions in ChatGPT, saying it "fell short" and will improve controls</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/openai-walks-back-ad-like-app-suggestions-in-chatgpt-saying-it-fell-short-and-will-improve-controls</link>
      <pubDate>Mon, 08 Dec 2025 14:07:42 +0000</pubDate>
      <guid isPermaLink="false">i6dpZ5JpRVwevGJhPDnT98</guid>
      <description>OpenAI quietly disables ad-like app suggestions in ChatGPT after backlash over unclear promotion.</description>
    </item>
    <item>
      <title>01net Awards&#160;: la meilleure voiture &#233;lectrique de l&#8217;ann&#233;e est&#8230;</title>
      <link>https://www.01net.com/actualites/01net-awards-la-meilleure-voiture-electrique-de-lannee-est.html</link>
      <pubDate>Mon, 08 Dec 2025 14:00:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314265</guid>
      <description>La r&#233;daction de 01net.com d&#233;signe les meilleurs produits de l&#8217;ann&#233;e. D&#233;couvrez tous les jours les vainqueurs de chaque cat&#233;gorie jusqu&#8217;&#224; la remise des prix le 10 d&#233;cembre, en live s&#8217;il vous plait !</description>
    </item>
    <item>
      <title>&#8216;Andor&#8217; Snubbed For Best Drama in Tight Genre Golden Globes Race</title>
      <link>https://gizmodo.com/golden-globes-2025-nominations-andor-sinners-2000696675</link>
      <pubDate>Mon, 08 Dec 2025 14:00:02 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000696675</guid>
      <description>'Severance' and 'Pluribus' did get Best Drama nominations, as did 'Sinners' and 'Frankenstein'.</description>
    </item>
    <item>
      <title>Segway&#8217;s new Myon e-bike will straddle past and future</title>
      <link>https://www.theverge.com/news/839169/segway-myon-ebike-teaser-ces-radar</link>
      <pubDate>2025-12-08T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=839169</guid>
      <description>Segway&#8217;s modest e-bike lineup is about to gain a new entrant. The Ninebot-owned brand, once known for its pioneering self-balancing scooters, currently only sells two e-bikes: the moto-styled Xyber and the low-step Xafari. Now it&#8217;s getting a third, Myon, which it plans on officially debuting at the Consumer Electronics Show in Las Vegas next year. [&#8230;]...</description>
    </item>
    <item>
      <title>What is the release date for The Mighty Nein episode 6 on Prime Video?</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/what-is-the-release-date-for-the-mighty-nein-episode-6-on-prime-video</link>
      <pubDate>Mon, 08 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">yXHyRcGQcq9Sy97Dx5VSNK</guid>
      <description>Here's when The Mighty Nein episode 6 will make its bow on Prime Video.</description>
    </item>
    <item>
      <title>Adobe Rolls Out Free Generative AI for Creative Cloud Pro Users as a Limited-Time Bonus</title>
      <link>https://gizmodo.com/adobe-rolls-out-free-generative-ai-for-creative-cloud-pro-users-as-a-limited-time-bonus-2000696575</link>
      <pubDate>Mon, 08 Dec 2025 13:55:43 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000696575</guid>
      <description>Over 20 AI-enhanced apps and tools, including unlimited Firefly and 3rd-party image generations, make Adobe the industry leader.</description>
    </item>
    <item>
      <title>La Xbox se vend si mal qu&#8217;elle se fait battre par une console que vous ne connaissez pas</title>
      <link>https://www.frandroid.com/produits-android/console/console-de-jeux/2902019_la-xbox-se-vend-si-mal-quelle-se-fait-battre-par-une-console-que-vous-ne-connaissez-pas</link>
      <pubDate>Mon, 08 Dec 2025 13:53:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/console-de-jeux/2902019_la-xbox-se-vend-si-mal-quelle-se-fait-battre-par-une-console-que-vous-ne-connaissez-pas</guid>
      <description>
Connaissez-vous la console&#160;NEX Playground ? Nous non plus. Lors du Black Friday, elle s'est mieux vendue que les Xbox de Microsoft.
</description>
    </item>
    <item>
      <title>Boulanger met enfin en promo l&#8217;Apple Watch Series 11, juste &#224; temps pour finir sous le sapin</title>
      <link>https://www.frandroid.com/bons-plans/2848741_boulanger-met-enfin-en-promo-lapple-watch-series-11-juste-a-temps-pour-finir-sous-le-sapin</link>
      <pubDate>Mon, 08 Dec 2025 13:49:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848741_boulanger-met-enfin-en-promo-lapple-watch-series-11-juste-a-temps-pour-finir-sous-le-sapin</guid>
      <description>
Pour les personnes &#224; la recherche d'une premi&#232;re Apple Watch &#224; la pointe sur le suivi de sant&#233;, l'Apple Watch Series 11 est la r&#233;f&#233;rence ! Et pour cette fin d'ann&#233;e, elle se n&#233;gocie en promotion &#224; 419 euros contre 449 euros &#224; son lancement.
</description>
    </item>
    <item>
      <title>Adobe launches content creation hub in Premiere mobile for YouTube Shorts creators</title>
      <link>https://techcrunch.com/2025/12/08/adobe-launches-content-creation-hub-in-premiere-mobile-for-youtube-shorts-creators/</link>
      <pubDate>Mon, 08 Dec 2025 13:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3073049</guid>
      <description>The company says the space is designed to give creators everything they need to produce viral videos, grow their audience, and tap into trends, whether it's creating day-in-the-life vlogs, travel videos, or behind-the-scenes clips.</description>
    </item>
    <item>
      <title>React2Shell RCE flaw exploited by Chinese hackers hours after disclosure</title>
      <link>https://www.techradar.com/pro/security/react2shell-rce-flaw-exploited-by-chinese-hackers-hours-after-disclosure</link>
      <pubDate>Mon, 08 Dec 2025 13:45:00 +0000</pubDate>
      <guid isPermaLink="false">mgSvWwD9dyQwELNRKsVgaB</guid>
      <description>Chinese hackers are taking advantage of the 10/10 bug reported late last week.</description>
    </item>
    <item>
      <title>&#171;&#160;Un taux de panne extr&#234;mement &#233;lev&#233; et une dur&#233;e de vie plus courte&#160;&#187; : ces batteries Tesla produites en Chine point&#233;es du doigt</title>
      <link>https://www.frandroid.com/marques/tesla/2896327_un-taux-de-panne-extremement-eleve-et-une-duree-de-vie-plus-courte-ces-batteries-tesla-produites-en-chine-pointees-du-doigt</link>
      <pubDate>Mon, 08 Dec 2025 13:35:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2896327_un-taux-de-panne-extremement-eleve-et-une-duree-de-vie-plus-courte-ces-batteries-tesla-produites-en-chine-pointees-du-doigt</guid>
      <description>
Tesla &#233;quipe certaines de ses voitures &#233;lectriques vendues en Europe de batteries fournies par LG. Probl&#232;me, ces derni&#232;res affichent une fiabilit&#233; tr&#232;s moyenne, avec un taux de d&#233;gradation particuli&#232;rement &#233;lev&#233;.
</description>
    </item>
    <item>
      <title>Trump says the big Netflix-Warner Bros merger &#8216;could be a problem&#8217; &#8211; here&#8217;s why</title>
      <link>https://www.techradar.com/streaming/netflix/trump-says-the-big-netflix-warner-bros-merger-could-be-a-problem-heres-why</link>
      <pubDate>Mon, 08 Dec 2025 13:34:14 +0000</pubDate>
      <guid isPermaLink="false">rG9qeErgWiQ5LRQNxAv9dQ</guid>
      <description>&#8216;Could be a problem&#8217;: Trump wants to personally help decide the Netflix-Warner Bros. Deal &#8211; and he&#8217;s already highlighted a big reason to block it.</description>
    </item>
    <item>
      <title>Rachat de Warner Bros&#160;: Donald Trump met en garde Netflix</title>
      <link>https://www.01net.com/actualites/rachat-warner-bros-donald-trump-met-garde-netflix.html</link>
      <pubDate>Mon, 08 Dec 2025 13:29:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314217</guid>
      <description>Donald Trump a l'intention de jouer un r&#244;le dans le rachat de Warner Bros par Netflix. Le pr&#233;sident a estim&#233; que la fusion &#171; pourrait &#234;tre un probl&#232;me apr&#232;s avoir re&#231;u Ted Sarandos, l'un des PDG de Netflix, &#224; la Maison Blanche. C'est un signal clair que le rachat s'annonce sem&#233; d'emb&#251;ches&#8230;</description>
    </item>
    <item>
      <title>Landman season 2 episode 4 proves why Monty had to die &#8211; even though Demi Moore &#8216;missed&#8217; Jon Hamm while filming</title>
      <link>https://www.techradar.com/streaming/paramount-plus/landman-season-2-episode-4-proves-why-monty-had-to-die-even-though-demi-moore-missed-jon-hamm-while-filming</link>
      <pubDate>Mon, 08 Dec 2025 13:26:45 +0000</pubDate>
      <guid isPermaLink="false">wKiKLkPNGj5gsYzcXBjGVD</guid>
      <description>Landman season 1 ended with the shock of Monty's death, but season 2 episode 4 proves why it needed to happen.</description>
    </item>
    <item>
      <title>Voici la meilleure fa&#231;on d&#8217;utiliser Google Agenda sur Windows 11</title>
      <link>https://www.frandroid.com/marques/microsoft/2901795_voici-la-meilleure-facon-dutiliser-google-agenda-sur-windows-11</link>
      <pubDate>Mon, 08 Dec 2025 13:15:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2901795_voici-la-meilleure-facon-dutiliser-google-agenda-sur-windows-11</guid>
      <description>
Astral permet aux utilisateurs sur Windows d'avoir acc&#232;s &#224; une application native pour g&#233;rer leur Google Agenda. Avec sa nouvelle version, l'application prend en charge le multicomptes et d&#233;voile des options de visioconf&#233;rences.   
</description>
    </item>
    <item>
      <title>PC gaming is in big trouble &#8211; Dell and Lenovo&#8217;s hardware will reportedly get some major price hikes soon</title>
      <link>https://www.techradar.com/computing/desktop-pcs/pc-gaming-is-in-big-trouble-dell-and-lenovos-hardware-will-reportedly-get-some-major-price-hikes-soon</link>
      <pubDate>Mon, 08 Dec 2025 13:05:35 +0000</pubDate>
      <guid isPermaLink="false">SeKi7iHhSSmUCeHo42ASgA</guid>
      <description>Both casual PC users and gamers should be concerned, as Dell and Lenovo may be the next manufacturers to raise prices for PC hardware.</description>
    </item>
    <item>
      <title>Sebastian Stan Teases That Not Everyone Will Make It Out of &#8216;Avengers: Doomsday&#8217;</title>
      <link>https://gizmodo.com/sebastian-stan-avengers-doomsday-deaths-marvel-mcu-2000696550</link>
      <pubDate>Mon, 08 Dec 2025 13:00:29 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000696550</guid>
      <description>Plus, Gillian Anderson denies any involvement in the upcoming 'X-Files' reboot.</description>
    </item>
    <item>
      <title>Apple Watch Series 11 drops $100 to an all-time low price</title>
      <link>https://www.engadget.com/deals/apple-watch-series-11-drops-100-to-an-all-time-low-price-130006591.html?src=rss</link>
      <pubDate>Mon, 08 Dec 2025 13:00:06 +0000</pubDate>
      <guid isPermaLink="false">ce953114-3275-46bd-9a3a-b5ee77775bd0</guid>
      <description>Sure, Black Friday and Cyber Monday have come and gone, but you can still find a last-minute deal on the best tech gifts. Take the Apple Watch Series 11, which has dropped to an all-time low of $299, from $399. The 25 percent discount is an even better deal than we saw on either of those sale holidays.&#160;
We gave the Apple Watch Series 11 a score of 90 when it came out in September. That's thanks, in part, to an upgraded 24 hours of battery life &#8212; which lasted closer to a day and a half &#8212; compared to the 18 hours promised by the Series 10. It also features a thin, light design and a wrist flick ...</description>
    </item>
    <item>
      <title>How the creator economy destroyed the internet</title>
      <link>https://www.theverge.com/cs/features/810002/influencers-creator-economy-special-series</link>
      <pubDate>2025-12-08T08:00:05-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?post_type=vm_custom_story&amp;p=810002</guid>
      <description>Jimmy Donaldson, better known as MrBeast, has the most popular YouTube account with over 450 million subscribers, or a little over 1 in 16 people in the world. His success with high-production, high-output stunt videos have made him the aspirational model for independent content creators everywhere: the actualization of the promise that, thanks to the [&#8230;]...</description>
    </item>
    <item>
      <title>Hinge&#8217;s new AI feature helps daters move beyond boring small talk</title>
      <link>https://techcrunch.com/2025/12/08/hinges-new-ai-feature-helps-daters-start-better-convos-moving-beyond-boring-small-talk/</link>
      <pubDate>Mon, 08 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3073298</guid>
      <description>Hinge launched &#8220;Convo Starters,&#8221; a feature powered by AI that provides personalized tips for initiating meaningful conversations.</description>
    </item>
    <item>
      <title>You can still get AirPods Pro 3 for their lowest-ever Black Friday price &#8211;no, I'm not joking</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/you-can-still-get-airpods-pro-3-for-their-lowest-ever-black-friday-price-no-im-not-joking</link>
      <pubDate>Mon, 08 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">hY2yvP4mXfVhPenGiDutUk</guid>
      <description>It's the Black Friday deal that keeps on going: save $30 on Apple's AirPods Pro 3</description>
    </item>
    <item>
      <title>N&#8217;utilisez plus ce v&#233;lo &#233;lectrique vendu par Decathlon et Nature &amp; D&#233;couvertes : un d&#233;faut le rend dangereux, un rappel est en cours</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2902011_nutilisez-plus-ce-velo-electrique-vendu-par-decathlon-et-nature-decouvertes-un-defaut-le-rend-dangereux-un-rappel-est-en-cours</link>
      <pubDate>Mon, 08 Dec 2025 12:54:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2902011_nutilisez-plus-ce-velo-electrique-vendu-par-decathlon-et-nature-decouvertes-un-defaut-le-rend-dangereux-un-rappel-est-en-cours</guid>
      <description>
AddBike lance une campagne de rappel visant l&#8217;ensemble des v&#233;los cargo U-Cargo &#233;quip&#233;s d&#8217;une fourche rigide, commercialis&#233;s en France depuis 2020. Cette proc&#233;dure fait suite &#224; la d&#233;tection d&#8217;un possible d&#233;faut de fabrication au niveau du cintrage des fourreaux de fourche, susceptible d&#8217;entra&#238;ner un risque de blessure pour l&#8217;utilisateur.
</description>
    </item>
    <item>
      <title>These quintuple-driver wired earbuds just landed for only $80 &#8211; and I want to know how</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/these-quintuple-driver-wired-earbuds-just-landed-for-only-usd80-and-i-want-to-know-how</link>
      <pubDate>Mon, 08 Dec 2025 12:50:29 +0000</pubDate>
      <guid isPermaLink="false">crQ5MJsLyL5AAqfa2pWNL8</guid>
      <description>Who says audiophile-grade listening gear is too expensive? Astell &amp; Kern&#8217;s affordable Activo arm just launched five-driver IEMs for $80</description>
    </item>
    <item>
      <title>Your next job interview could be with an AI. Here&#8217;s how to nail it</title>
      <link>https://www.fastcompany.com/91445069/your-next-job-interview-could-be-with-an-ai-heres-how-to-nail-it-ai-interviews-advice</link>
      <pubDate>2025-12-08T12:43:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91445069/your-next-job-interview-could-be-with-an-ai-heres-how-to-nail-it-ai-interviews-advice</guid>
      <description>An expert shares the secrets to success.
Five years ago, an algorithm decided whether your r&#233;sum&#233; ever reached a recruiter. Now, it might be the one asking you the questions.</description>
    </item>
    <item>
      <title>This popular Anker rival has just recalled a power bank due to a fire hazard &#8211; here&#8217;s what to do</title>
      <link>https://www.techradar.com/phones/this-popular-anker-rival-has-just-recalled-a-power-bank-due-to-a-fire-hazard-heres-what-to-do</link>
      <pubDate>Mon, 08 Dec 2025 12:41:07 +0000</pubDate>
      <guid isPermaLink="false">FhRDcYymXMwP9zCtyX65N8</guid>
      <description>Iniu has recalled some versions of its 10,000mAh power bank over reports of overheating and even fires.</description>
    </item>
    <item>
      <title>&#171;&#160;Abolir&#160;&#187; l&#8217;UE et comparaison nazie&#160;: la riposte cinglante d&#8217;Elon Musk &#224; l&#8217;amende de l&#8217;Europe</title>
      <link>https://www.01net.com/actualites/abolir-lue-et-comparaison-nazie-la-riposte-cinglante-delon-musk-a-lamende-de-leurope.html</link>
      <pubDate>Mon, 08 Dec 2025 12:38:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314219</guid>
      <description>Riposte imm&#233;diate ? Au lendemain d'une amende de 120 millions d'euros pour non-respect du DSA, X a coup&#233; le compte publicitaire de la Commission europ&#233;enne. En parall&#232;le, Elon Musk multiplie les insultes, comparant l'UE au r&#233;gime nazi. La rupture est totale.</description>
    </item>
  </channel>
</rss>
