<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 16 Dec 2025 17:27:41 GMT</lastBuildDate>
    <item>
      <title>Whole Foods to install smart food waste bins from Mill starting in 2027</title>
      <link>https://techcrunch.com/2025/12/16/whole-foods-to-install-smart-food-waste-bins-from-mill-starting-in-2027/</link>
      <pubDate>Tue, 16 Dec 2025 17:22:25 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3076420</guid>
      <description>The food waste startup founded by Nest alumnus Matt Rogers also received an investment from Amazon's Climate Pledge Fund.</description>
    </item>
    <item>
      <title>Amazon says Russian hackers behind major cyber campaign to target Western energy sector</title>
      <link>https://www.techradar.com/pro/security/amazon-says-russian-hackers-behind-major-cyber-campaign-to-target-western-energy-sector</link>
      <pubDate>Tue, 16 Dec 2025 17:20:00 +0000</pubDate>
      <guid isPermaLink="false">XYx3pKr8d98Hr3xqForhgY</guid>
      <description>For years, the GRU was snooping in critical infrastructure firms by abusing misconfigurations and zero-days, Amazon says.</description>
    </item>
    <item>
      <title>Baldur's Gate 3 director says the game's cinematics and how choices were portrayed is one of the 'biggest lessons' Larian is bringing to Divinity &#8212; 'I think that was probably my biggest takeaway from everything'</title>
      <link>https://www.techradar.com/gaming/baldurs-gate-3-director-says-the-games-cinematics-and-how-choices-were-portrayed-is-one-of-the-biggest-lessons-larian-is-bringing-to-divinity-i-think-that-was-probably-my-biggest-takeaway-from-everything</link>
      <pubDate>Tue, 16 Dec 2025 17:18:51 +0000</pubDate>
      <guid isPermaLink="false">55itAsvLGEBPfkLHAAwhDH</guid>
      <description>Larian Studios founder and Baldur's Gate 3 director, Swen Vincke, has said Divinity will feature cinematics unlike previous iterations in the series.</description>
    </item>
    <item>
      <title>New Head of Trump's Cancer Panel Questioned Links Between Vaccines and Cancer</title>
      <link>https://www.wired.com/story/risch-trump-panel-vaccines-turbo-cancer-ivermectin-hcq/</link>
      <pubDate>Tue, 16 Dec 2025 17:17:07 +0000</pubDate>
      <guid isPermaLink="false">693c29df258315d2bea281cd</guid>
      <description>Yale epidemiologist Harvey Risch, who has speculated about a connection between Covid vaccines and &#8220;turbo cancer&#8221; and promoted ivermectin, says he'll chair the President's Cancer Panel.</description>
    </item>
    <item>
      <title>Netflix doubles down on video podcasts with iHeartMedia deal</title>
      <link>https://techcrunch.com/2025/12/16/netflix-doubles-down-on-video-podcasts-with-iheartmedia-deal/</link>
      <pubDate>Tue, 16 Dec 2025 17:13:24 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3076457</guid>
      <description>Netflix's has its second big foray into video podcasts with its new partnership with iHeartMedia.</description>
    </item>
    <item>
      <title>C&#8217;est officiel&#160;: l&#8217;Europe capitule et enterre le 100&#160;% &#233;lectrique pour 2035</title>
      <link>https://www.01net.com/actualites/cest-officiel-leurope-capitule-et-enterre-le-100-electrique-pour-2035.html</link>
      <pubDate>Tue, 16 Dec 2025 17:13:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315726</guid>
      <description>Le couperet est tomb&#233;, mais il est moins tranchant que pr&#233;vu. Apr&#232;s des jours de tensions intenses, Bruxelles a c&#233;d&#233; face &#224; la r&#233;alit&#233; industrielle : l'obligation du tout-&#233;lectrique est lev&#233;e, offrant un sursis inesp&#233;r&#233; aux moteurs hybrides.</description>
    </item>
    <item>
      <title>Cloudflare report reveals global internet internet traffic grew 19% in 2025 - but a lot of it was just bots</title>
      <link>https://www.techradar.com/pro/security/cloudflare-report-reveals-global-internet-internet-traffic-grew-19-percent-in-2025-but-a-lot-of-it-was-just-bots</link>
      <pubDate>Tue, 16 Dec 2025 17:10:00 +0000</pubDate>
      <guid isPermaLink="false">M7bMNEQKodjkpiuEYTWuXd</guid>
      <description>&#8216;Volatile crawling activity&#8217; is an ongoing struggle for internet sites, but website owners are fighting back.</description>
    </item>
    <item>
      <title>Disclosure Day&#8217;s first trailer teases close encounters of a different kind</title>
      <link>https://www.theverge.com/entertainment/845459/disclosure-day-spielberg-trailer-release-date</link>
      <pubDate>2025-12-16T12:06:57-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=845459</guid>
      <description>The first trailer for Steven Spielberg's upcoming film Disclosure Day is here, and it will leave you with more questions than answers about what exactly is going on. There is no denying that something strange is happening to a Kansas City newscaster (Emily Blunt) who goes into a strange trance on-air in Disclosure Day's new [&#8230;]</description>
    </item>
    <item>
      <title>Renault Twingo &#233;lectrique : quelle est cette option indispensable &#224; choisir et pourtant peu connue du grand public</title>
      <link>https://www.frandroid.com/marques/renault/2912125_renault-twingo-electrique-quelle-est-cette-option-indispensable-a-choisir-et-pourtant-peu-connue-du-grand-public</link>
      <pubDate>Tue, 16 Dec 2025 17:06:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2912125_renault-twingo-electrique-quelle-est-cette-option-indispensable-a-choisir-et-pourtant-peu-connue-du-grand-public</guid>
      <description>
Renault a officialis&#233; les tarifs de sa Twingo E-Tech, confirmant que la petite voiture &#233;lectrique d&#233;butait sous les 20 000 euros hors bonus &#233;cologique&#8230; et que la charge rapide n'est pas de s&#233;rie. Voil&#224; pourquoi ne pas cocher cette option serait une erreur.
</description>
    </item>
    <item>
      <title>Go Shopping With the Mighty Nein in This Magical Clip (Exclusive)</title>
      <link>https://gizmodo.com/mighty-nein-episode-7-clip-pumat-sol-2000694107</link>
      <pubDate>Tue, 16 Dec 2025 17:00:16 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000694107</guid>
      <description>Get a look at what's coming in this week's 'Mighty Nein' episode 'Belonging,' and the animated debut of a beloved character.</description>
    </item>
    <item>
      <title>How to watch Fallout season 2 online from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/fallout-season-2</link>
      <pubDate>Tue, 16 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">SbqSJVnzjDh9UTpRUT5WL4</guid>
      <description>Lucy (Ella Purnell) and the Ghoul (Walton Goggins) explore Mojave and the delightful local factions. Here's how to watch Fallout season 2 from anywhere.</description>
    </item>
    <item>
      <title>The Housemaid review: this violent pantomime turns the book into a grotesque nightmare</title>
      <link>https://www.techradar.com/streaming/entertainment/the-housemaid-review</link>
      <pubDate>Tue, 16 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">ozpjzywj6U4CKkhz49KujM</guid>
      <description>If you like your movies far-fetched, foolish and completely frivolous, look no further than The Housemaid. But good, it is not.</description>
    </item>
    <item>
      <title>China lowers anti-dumping tariffs on pork imports from the EU</title>
      <link>https://www.fastcompany.com/91461207/china-eu-pork-dumping-tariffs</link>
      <pubDate>2025-12-16T17:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91461207/china-eu-pork-dumping-tariffs</guid>
      <description>The final tariff rates of 4.9%&#8211;19.8% are due to take effect beginning Wednesday and last for five years.
China will impose tariffs of up to 19.8% on pork imports from the European Union, a drastic drop from preliminary tariffs of up to 62.4%, its Commerce Ministry said Tuesday.</description>
    </item>
    <item>
      <title>Voici la meilleure cam&#233;ra 360 degr&#233;s de l&#8217;ann&#233;e &#8211; Frandroid Awards 2025</title>
      <link>https://www.frandroid.com/produits-android/photo/action-cam/2906623_voici-la-meilleure-camera-360-degres-de-lannee-frandroid-awards-2025</link>
      <pubDate>Tue, 16 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/photo/action-cam/2906623_voici-la-meilleure-camera-360-degres-de-lannee-frandroid-awards-2025</guid>
      <description>
Dans un march&#233; des cam&#233;ras &#224; 360 degr&#233;s, Insta360 conserve son avance avec sa Insta360 X5 particuli&#232;rement aboutie et simple d'utilisation, malgr&#233; les perc&#233;es de GoPro et, surtout, de DJI. 
</description>
    </item>
    <item>
      <title>L&#8217;Europe veut autoriser la vente des voitures thermiques neuves en 2035 : voici les moteurs qui seraient sauv&#233;s</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2912367_leurope-veut-autoriser-la-vente-des-voitures-thermiques-neuves-en-2035-voici-les-moteurs-qui-seraient-sauves</link>
      <pubDate>Tue, 16 Dec 2025 16:59:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2912367_leurope-veut-autoriser-la-vente-des-voitures-thermiques-neuves-en-2035-voici-les-moteurs-qui-seraient-sauves</guid>
      <description>
La Commission europ&#233;enne vient de pr&#233;senter son projet pour permettre de continuer &#224; vendre des voitures thermiques apr&#232;s 2035. La liste des moteurs concern&#233;s est finalement assez longue. Mais attention, tout n'est pas rose pour les conducteurs, et surtout, tout est encore en suspens.
</description>
    </item>
    <item>
      <title>Les Tesla Model Y vont enfin b&#233;n&#233;ficier des batteries &#171;&#160;maison&#160;&#187; en Europe : pourquoi tout n&#8217;est pas rose pour autant</title>
      <link>https://www.frandroid.com/marques/tesla/2911793_les-tesla-model-y-vont-enfin-beneficier-des-batteries-maison-en-europe-pourquoi-tout-nest-pas-rose-pour-autant</link>
      <pubDate>Tue, 16 Dec 2025 16:55:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2911793_les-tesla-model-y-vont-enfin-beneficier-des-batteries-maison-en-europe-pourquoi-tout-nest-pas-rose-pour-autant</guid>
      <description>
Apr&#232;s une interruption pour modernisation, l'usine allemande de Tesla recommence &#224; assembler des batteries. Mais les promesses initiales d'Elon Musk d'y construire la plus grande usine de batteries au monde semblent d&#233;finitivement enterr&#233;es. Et l'avenir du site se joue d&#233;sormais sur fond de tension sociale, le patron conditionnant les investissements futurs au r&#233;sultat des &#233;lections syndicales de mars prochain.
...</description>
    </item>
    <item>
      <title>UK MPs target VPNs in latest Online Safety Act debate</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/uk-mps-target-vpns-in-latest-online-safety-act-debate</link>
      <pubDate>Tue, 16 Dec 2025 16:52:42 +0000</pubDate>
      <guid isPermaLink="false">9eMGJJwB27dhvfh4wcbNJK</guid>
      <description>The debate around age verification and VPNs heats up as MPs confirm their commitment to review the role these providers should have in preventing their service from being misused to evade the law.</description>
    </item>
    <item>
      <title>Dans quelles situations changer le sens d&#8217;un c&#226;ble USB-C peut &#234;tre utile ?</title>
      <link>https://www.frandroid.com/comment-faire/comment-fonctionne-la-technologie/2912171_dans-quelles-situations-changer-le-sens-dun-cable-usb-c-peut-etre-utile</link>
      <pubDate>Tue, 16 Dec 2025 16:52:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/comment-faire/comment-fonctionne-la-technologie/2912171_dans-quelles-situations-changer-le-sens-dun-cable-usb-c-peut-etre-utile</guid>
      <description>
L'une des grandes innovations du connecteur USB-C, c'est sa sym&#233;trie : vous pouvez le brancher dans n'importe quel sens pour qu'il fonctionne. Mais parfois, il peut quand m&#234;me &#234;tre n&#233;cessaire de tester un autre sens.
</description>
    </item>
    <item>
      <title>Science says super-achievers don&#8217;t set avoidance goals. Here&#8217;s why successful people set approach goals</title>
      <link>https://www.fastcompany.com/91461427/science-says-super-achievers-dont-set-avoidance-goals-heres-why-successful-people-set-approach-goals</link>
      <pubDate>2025-12-16T16:51:16</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91461427/science-says-super-achievers-dont-set-avoidance-goals-heres-why-successful-people-set-approach-goals</guid>
      <description>Research shows the words you use to describe a goal can make a dramatic difference in success or failure.
We all have goals, but at least some of the difference in&#160;achieving those goals&#160;comes down to how you frame them.</description>
    </item>
    <item>
      <title>AirPods Might Get a Big Dose of AI</title>
      <link>https://gizmodo.com/airpods-might-get-a-big-dose-of-ai-2000700184</link>
      <pubDate>Tue, 16 Dec 2025 16:50:27 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000700184</guid>
      <description>A leaked iPhone prototype is giving some insight into future feature AirPods features.</description>
    </item>
    <item>
      <title>Le Google Pixel 10 est une superbe affaire de No&#235;l dans ce pack &#224; -33 % chez Fnac et Darty</title>
      <link>https://www.frandroid.com/bons-plans/2912095_le-google-pixel-10-est-une-superbe-affaire-de-noel-dans-ce-pack-a-33-chez-fnac-et-darty</link>
      <pubDate>Tue, 16 Dec 2025 16:45:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2912095_le-google-pixel-10-est-une-superbe-affaire-de-noel-dans-ce-pack-a-33-chez-fnac-et-darty</guid>
      <description>
Envie d&#8217;un beau cadeau Tech &#224; glisser sous le sapin&#8239;? Fnac et Darty proposent un pack qui r&#233;unit le r&#233;cent Google Pixel 10 et les Buds 2a, le tout &#224; 699&#8239;euros au lieu de 1&#8239;048&#8239;euros. Les deux font la paire puisque vous pourrez profiter du savoir-faire de la firme Mountain View &#224; un prix plus doux.
</description>
    </item>
    <item>
      <title>An iconic joystick from the Commodore 64 era is returning</title>
      <link>https://www.theverge.com/news/845447/retro-games-the-quickshot-ii-joystick-controller-commodore-64</link>
      <pubDate>2025-12-16T11:45:04-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=845447</guid>
      <description>Retro Games, a company known for its upgraded revivals of iconic '80s and '90s era computers, including the Commodore 64 and Amiga, has announced that it's bringing back another accessory from the same era. If you grew up gaming before the NES hit the US, you were probably using (or drooling over) the Quickshot II. [&#8230;]</description>
    </item>
    <item>
      <title>What happened to iRobot can happen to anyone</title>
      <link>https://www.engadget.com/home/what-happened-to-irobot-can-happen-to-anyone-164500625.html?src=rss</link>
      <pubDate>Tue, 16 Dec 2025 16:45:00 +0000</pubDate>
      <guid isPermaLink="false">4c0d6e71-97f9-4187-b49a-7214de83fef8</guid>
      <description>The company which popularized robot vacuum cleaners around the world has filed for Chapter 11 bankruptcy. iRobot, makers of the Roomba, has been synonymous with the category since its inception, but its star had dulled in recent years. The company plans to sell its assets to its primary supplier, China&#8217;s Picea Robotics, in the hope of maintaining its business.Everyone&#8217;s got a strident opinion as to why iRobot fell from grace. The rugged individualists blame limp regulators on both sides of the pond (and their hatred for big tech) for blocking Amazon&#8217;s attempted purchase in 2023. Those on the h...</description>
    </item>
    <item>
      <title>La s&#233;lection des meilleurs smartphones &#224; grand &#233;cran en 2025</title>
      <link>https://www.frandroid.com/guide-dachat/382644_6-alternatives-samsung-galaxy-note-7</link>
      <pubDate>Tue, 16 Dec 2025 16:42:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/382644_6-alternatives-samsung-galaxy-note-7</guid>
      <description>
D'ann&#233;e en ann&#233;e, les smartphones ne cessent de grandir. Vous &#234;tes adeptes des grands &#233;crans ? Que ce soit pour jouer, regarder des vid&#233;os ou juste pour un plus grand confort, nous avons s&#233;lectionn&#233; pour vous les meilleurs t&#233;l&#233;phones avec un grand &#233;cran -- au minimum 6,7 pouces.
</description>
    </item>
    <item>
      <title>Some of the best Epson projectors are up to $1,000 off at Best Buy today</title>
      <link>https://www.techradar.com/televisions/projectors/some-of-the-best-epson-projectors-are-up-to-usd1-000-off-at-best-buy-today</link>
      <pubDate>Tue, 16 Dec 2025 16:40:50 +0000</pubDate>
      <guid isPermaLink="false">mqtbMmj3kaSEJPuXGwV7Lh</guid>
      <description>Thinking about getting a projector? Best Buy has huge last-minute price cuts on models that we've reviewed (and loved) here at TechRadar.</description>
    </item>
    <item>
      <title>The Worst Thing About the RAM Shortage That Nobody&#8217;s Talking About</title>
      <link>https://gizmodo.com/the-worst-thing-about-the-ram-shortage-that-nobodys-talking-about-2000700185</link>
      <pubDate>Tue, 16 Dec 2025 16:40:49 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000700185</guid>
      <description>No matter what, consumers are going to lose.</description>
    </item>
    <item>
      <title>You can still get a discounted PS5 Pro right now &#8212; and it'll arrive before Christmas</title>
      <link>https://www.techradar.com/gaming/you-can-still-get-a-discounted-ps5-pro-right-now-and-itll-arrive-before-christmas</link>
      <pubDate>Tue, 16 Dec 2025 16:38:12 +0000</pubDate>
      <guid isPermaLink="false">755Nq77jkk9f2JAxjY6HMN</guid>
      <description>This PS5 Pro deal takes the premium console down to its lowest price in months.</description>
    </item>
    <item>
      <title>End-of-year clearance sale on OLED TVs &#8212; record-low prices from Samsung, Sony and LG</title>
      <link>https://www.techradar.com/seasonal-sales/end-of-year-clearance-deals-on-oled-tvs-record-low-prices-from-samsung-sony-and-lg</link>
      <pubDate>Tue, 16 Dec 2025 16:36:18 +0000</pubDate>
      <guid isPermaLink="false">UJh8tskDJjGFXLWwucmYo8</guid>
      <description>Retailers are offering significant price cuts on this year's best-selling OLED TVs, and I'm rounding up today's best deals from Samsung, Sony, and LG.</description>
    </item>
    <item>
      <title>Too many doorbell or camera notifications? Ring is using AI to condense alerts so you're not bombarded</title>
      <link>https://www.techradar.com/home/smart-home/too-many-doorbell-or-camera-notifications-ring-is-using-ai-to-condense-alerts-so-youre-not-bombarded</link>
      <pubDate>Tue, 16 Dec 2025 16:33:22 +0000</pubDate>
      <guid isPermaLink="false">qWgvbXtaR3yRspDzTR4bCV</guid>
      <description>Ring has launched AI Single Event Alert, which combines related notifications to cut down noise.</description>
    </item>
    <item>
      <title>How to watch The Ashes 2025-26 Test 3 for *FREE* &#8212; Stream on 7Plus</title>
      <link>https://www.techradar.com/how-to-watch/cricket/how-to-watch-the-ashes-2025-26-test-3-for-free-stream-on-7plus</link>
      <pubDate>Tue, 16 Dec 2025 16:32:04 +0000</pubDate>
      <guid isPermaLink="false">5V4FkF8EcuSit6F85g6aWR</guid>
      <description>Here's our guide on how to watch The Ashes 2025-26 Test 3 for free on 7Plus from anywhere in the world.</description>
    </item>
    <item>
      <title>iPhone 17 Pro : boutons &#171; mous &#187; ou &#171; collants &#187;, la mauvaise surprise qui agace de plus en plus d&#8217;utilisateurs</title>
      <link>https://www.frandroid.com/actualites-generales/2911813_iphone-17-pro-boutons-mous-ou-collants-la-mauvaise-surprise-qui-agace-de-plus-en-plus-dutilisateurs</link>
      <pubDate>Tue, 16 Dec 2025 16:30:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2911813_iphone-17-pro-boutons-mous-ou-collants-la-mauvaise-surprise-qui-agace-de-plus-en-plus-dutilisateurs</guid>
      <description>
De plus en plus d'utilisateurs signalent une sensation &#233;trange au niveau des boutons de leur iPhone 17 Pro et Pro Max. Entre clics absents, sensation de flottement et refus de prise en charge en Apple Store, ce d&#233;faut de jeunesse commence &#224; faire du bruit
</description>
    </item>
    <item>
      <title>One of the Most Complete Human Ancestors Ever Found Isn&#8217;t Who We Thought It Was</title>
      <link>https://gizmodo.com/one-of-the-most-complete-human-ancestors-ever-found-isnt-who-we-thought-it-was-2000700181</link>
      <pubDate>Tue, 16 Dec 2025 16:30:05 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000700181</guid>
      <description>New research challenges the previous identification of a famous fossil dubbed "Little Foot."</description>
    </item>
    <item>
      <title>Microsoft&#8217;s latest desperate attempt to stop people using Edge to download Google Chrome focuses on internet safety</title>
      <link>https://www.techradar.com/computing/edge/microsofts-latest-desperate-attempt-to-stop-people-using-edge-to-download-google-chrome-focuses-on-internet-safety</link>
      <pubDate>Tue, 16 Dec 2025 16:29:37 +0000</pubDate>
      <guid isPermaLink="false">aVBUXAgJmMWSuJSBifa4AJ</guid>
      <description>Microsoft is getting desperate in its attempts to stop people using Google Chrome instead of Edge &#8211; but it risks annoying even more people.</description>
    </item>
    <item>
      <title>Everything is gambling now</title>
      <link>https://www.theverge.com/podcast/845198/prediction-markets-mcp-vergecast</link>
      <pubDate>2025-12-16T11:29:32-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=845198</guid>
      <description>Here's a list of things you can bet on, right this second. This year's Super Bowl winner, sure. The winner of Survivor season 49, okay. But the number of gifts Santa will deliver this year? The number of tweets Elon Musk will send in the next 7 days? How much money Avatar: Fire and Ash [&#8230;]</description>
    </item>
    <item>
      <title>This Google Chrome extension has been silently stealing every AI prompt its users enter</title>
      <link>https://www.techradar.com/pro/security/this-google-chrome-extension-has-been-silently-stealing-every-ai-prompt-its-users-enter</link>
      <pubDate>Tue, 16 Dec 2025 16:28:00 +0000</pubDate>
      <guid isPermaLink="false">cxiMZKNSTRPnAoYQbupfGk</guid>
      <description>Malicious Chrome extension has also been stealing AI responses and sharing the data with other companies.</description>
    </item>
    <item>
      <title>Dead Island 3 is in development and will reportedly come out in 2028</title>
      <link>https://www.engadget.com/gaming/dead-island-3-is-in-development-and-will-reportedly-come-out-in-2028-162522680.html?src=rss</link>
      <pubDate>Tue, 16 Dec 2025 16:25:23 +0000</pubDate>
      <guid isPermaLink="false">e6eec06e-b5cc-4f1b-953a-24a5823b31c2</guid>
      <description>The zombie-decapitating sim Dead Island 3 is still being developed, according to financial documents from Dambuster Studios that were published on X and reported on by Video Games Chronicle. These documents suggest a 2028 release date, so that's something to look forward to.
Dambuster Studios' financial statements are out (as of March 2025)The company employed 194 employeesDead Island 3 is in developmentThe current predicted release window for the project is Q1/2 2028 pic.twitter.com/FOHOitH3nD&#8212; Timur222 (@bogorad222) December 16, 2025

The paperwork says the development is "moving at pace" an...</description>
    </item>
    <item>
      <title>La fin du &#8220;Made in Germany&#8221; ? Pourquoi Mercedes a mis un moteur essence chinois dans sa&#160; nouvelle CLA hybride</title>
      <link>https://www.frandroid.com/marques/mercedes-benz/2911651_la-fin-du-made-in-germany-pourquoi-mercedes-a-mis-un-moteur-essence-chinois-dans-sa-nouvelle-cla-hybride</link>
      <pubDate>Tue, 16 Dec 2025 16:23:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/mercedes-benz/2911651_la-fin-du-made-in-germany-pourquoi-mercedes-a-mis-un-moteur-essence-chinois-dans-sa-nouvelle-cla-hybride</guid>
      <description>
L'industrie automobile traverse une mutation profonde, et les nouvelles Mercedes CLA et GLB en deviennent l'un des symboles les plus marquants. Pour la premi&#232;re fois, le moteur essence (hybride) d'une Mercedes-Benz vendu en Europe n'est plus assembl&#233; en Allemagne, mais en Chine.
</description>
    </item>
    <item>
      <title>Ces PC gamer RTX 50 avec 32 Go de RAM sont en promotion (mais &#231;a ne va pas durer) [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/2903607_ces-pc-gamer-rtx-50-avec-32-go-de-ram-sont-en-promotion-mais-ca-ne-va-pas-durer</link>
      <pubDate>Tue, 16 Dec 2025 16:22:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/2903607_ces-pc-gamer-rtx-50-avec-32-go-de-ram-sont-en-promotion-mais-ca-ne-va-pas-durer</guid>
      <description>
Et si c&#8217;&#233;tait le bon moment pour acheter un PC ? C&#8217;est ce que semble penser Materiel.net avec son catalogue rempli de machines d&#233;di&#233;es &#224; tous les usages. Jeu, cr&#233;ation ou IA, il y a forc&#233;ment une tour faite pour vous. 
</description>
    </item>
    <item>
      <title>A nasty &#8216;superflu&#8217; virus is spreading in the U.S. right now: What to know about the subclade K flu variant</title>
      <link>https://www.fastcompany.com/91461367/flu-season-2025-subclade-k-variant-spreads-nasty-symptoms</link>
      <pubDate>2025-12-16T16:21:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91461367/flu-season-2025-subclade-k-variant-spreads-nasty-symptoms</guid>
      <description>The variant is part of the H3N2 strain, but it&#8217;s distinct enough to make it materially different. It comes as peak influenza season is getting underway.
For many people, the winter holiday period is their favorite time of the year. It&#8217;s weeks full of family, friends, gifts, and cozy indoor get-togethers. </description>
    </item>
    <item>
      <title>Canadian peer-to-peer clothing rental company Rax is expanding to the U.S.</title>
      <link>https://techcrunch.com/2025/12/16/canadian-peer-to-peer-clothing-rental-company-rax-is-expanding-to-the-u-s/</link>
      <pubDate>Tue, 16 Dec 2025 16:11:16 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3076414</guid>
      <description>Rax is a peer-to-peer clothing rental company that won top consumer pitch at Disrupt this year.</description>
    </item>
    <item>
      <title>Why Trump just launched a $10 billion defamation lawsuit against the BBC</title>
      <link>https://www.fastcompany.com/91461195/why-trump-just-launched-10-billion-defamation-lawsuit-against-bbc</link>
      <pubDate>2025-12-16T16:08:44</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91461195/why-trump-just-launched-10-billion-defamation-lawsuit-against-bbc</guid>
      <description>President Trump&#8217;s 33-page lawsuit accuses the BBC of deceptive editing of his speech on January 6, 2021.
President Donald Trump filed a lawsuit Monday seeking $10 billion in damages from the BBC, accusing the British broadcaster of defamation as well as deceptive and unfair trade practices.The 33-page lawsuit accuses the BBC of broadcasting a &#8220;false, defamatory, deceptive, disparaging, inflammatory, and malicious depiction of President Trump,&#8221; calling it &#8220;a brazen attempt to interfere in and influence&#8221; the 2024 U.S. presidential election.It accused the BBC of &#8220;splicing together two entirely se...</description>
    </item>
    <item>
      <title>#FrandroidOffreMoi un aspirateur robot Xiaomi trop pratique</title>
      <link>https://www.frandroid.com/marques/xiaomi/2912075_frandroidoffremoi-un-aspirateur-robot-xiaomi-trop-pratique</link>
      <pubDate>Tue, 16 Dec 2025 16:06:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2912075_frandroidoffremoi-un-aspirateur-robot-xiaomi-trop-pratique</guid>
      <description>
Le calendrier de l&#8217;Avent #FrandroidOffreMoi reste sur sa belle lanc&#233;e ! Aujourd'hui, pour la 16e case, on s'attaque &#224; la corv&#233;e de m&#233;nage avec un alli&#233; de taille pour garder votre int&#233;rieur impeccable sans lever le petit doigt. J'ai nomm&#233; le Xiaomi Robot Vacuum S20+.
</description>
    </item>
    <item>
      <title>Une sonde de la Nasa vient de cartographier pour la premi&#232;re fois la fronti&#232;re du Soleil que l&#8217;on n&#8217;avait jamais vu</title>
      <link>https://www.futura-sciences.com/sciences/actualites/soleil-sonde-nasa-vient-cartographier-premiere-fois-frontiere-soleil-on-navait-jamais-vu-128669/#xtor%3DRSS-8</link>
      <pubDate>Tue, 16 Dec 2025 17:03:42 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/soleil-sonde-nasa-vient-cartographier-premiere-fois-frontiere-soleil-on-navait-jamais-vu-128669/#xtor%3DRSS-8</guid>
      <description>Les &#233;toiles sont des objets gouvern&#233;s par une physique que les astronomes ne comprennent pas encore tout &#224; fait. Le Soleil ne fait pas exception. Mais d&#233;sormais, les chercheurs pourront compter sur une carte in&#233;dite pour se faire une id&#233;e plus pr&#233;cise de ce qui se passe r&#233;ellement autour de...</description>
    </item>
    <item>
      <title>The First Trailer for Steven Spielberg&#8217;s Mystery UFO Movie Is Finally Here</title>
      <link>https://gizmodo.com/steven-spielberg-ufo-movie-trailer-disclosure-day-2000700220</link>
      <pubDate>Tue, 16 Dec 2025 16:00:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000700220</guid>
      <description>'Disclosure Day' stars Emily Blunt, Josh O'Connor, and Colin Firth as they prepare the world for the truth that's out there.</description>
    </item>
    <item>
      <title>The best board games to gift and play with the family for the 2025 holiday season</title>
      <link>https://www.engadget.com/the-best-board-games-to-gift-and-play-with-the-family-for-the-2025-holiday-season-125529223.html?src=rss</link>
      <pubDate>Tue, 16 Dec 2025 16:00:37 +0000</pubDate>
      <guid isPermaLink="false">8b67d713-c1e1-4ea2-a3a8-ab47cde9ad9f</guid>
      <description>Once upon a time, a "board game" meant Monopoly or Risk. Then several brave souls dared to ask the question: "What if this was fun?" Thirty years later, we're blessed with tabletop games that challenge our minds, immerse us in other worlds and conjure good times with those we love &#8212; sometimes all three at once. For your gift-buying needs, we've put together a list of new favorites and returning classics that run the gamuts of genre and weight. If you're ready to push beyond Pictionary, read on.
Best board games to gift (and play) this holiday season




























Check out the re...</description>
    </item>
    <item>
      <title>NASA&#8217;s MAVEN Spacecraft May Actually Be Lost in Space</title>
      <link>https://gizmodo.com/nasas-maven-spacecraft-may-actually-be-lost-in-space-2000700204</link>
      <pubDate>Tue, 16 Dec 2025 16:00:21 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000700204</guid>
      <description>This could be the end of the orbiter that studies the Red Planet&#8217;s atmosphere and relays communications between NASA and its Mars rovers.</description>
    </item>
    <item>
      <title>Instagram launches a Fire TV app for Reels</title>
      <link>https://www.engadget.com/social-media/instagram-launches-a-fire-tv-app-for-reels-160003710.html?src=rss</link>
      <pubDate>Tue, 16 Dec 2025 16:00:03 +0000</pubDate>
      <guid isPermaLink="false">c15f0278-2db9-4161-a5fb-2b1393804ef1</guid>
      <description>Have you ever just wished you could watch Instagram Reels right on a TV? Maybe? Well, if so, you're in luck. Meta has launched an Instagram app exclusively on Fire TV. It will be solely for "short-form video content," so Reels. TikTok launched an app on Fire TV in 2020 before rolling it out to other platforms.&#160;
Instagram and Fire TV users can download the former through Amazon's App Store. It can either link to an existing account or have a separate account just for TV. The app can hold up to five different Instagram accounts &#8212; and time spent factors into any limits on teen accounts.&#160;
"Our mis...</description>
    </item>
    <item>
      <title>Instagram is putting Reels on your TV</title>
      <link>https://www.theverge.com/news/845124/instagram-reels-tv-app</link>
      <pubDate>2025-12-16T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=845124</guid>
      <description>Meta is starting to test a new Instagram app for TVs that lets you watch Reels on a big screen. The app will be available first as a pilot for Amazon Fire TV devices in the US starting Tuesday. The homescreen of the Reels-focused app will show personalized, horizontal collections of videos to browse through. [&#8230;]</description>
    </item>
    <item>
      <title>My Favorite Murder and The Breakfast Club podcasts are ditching YouTube for Netflix</title>
      <link>https://www.theverge.com/news/845307/netflix-iheartmedia-video-podcasts</link>
      <pubDate>2025-12-16T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=845307</guid>
      <description>Netflix is plowing ahead with plans to build out a library of video podcasts as it aims to keep viewers locked into the service even when they may not be watching what's on their screens. On Tuesday, Netflix announced that it's teaming up with radio giant iHeartMedia to add more than 15 video podcasts to [&#8230;]</description>
    </item>
    <item>
      <title>Instagram brings Reels to the big screen, starting with Amazon Fire TV</title>
      <link>https://techcrunch.com/2025/12/16/instagram-brings-reels-to-the-big-screen-starting-with-amazon-fire-tv/</link>
      <pubDate>Tue, 16 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3076382</guid>
      <description>By bringing Reels to TVs, Instagram can better compete with YouTube, which largely dominates the TV space.</description>
    </item>
    <item>
      <title>How to watch Cardiff vs Chelsea: live stream Carabao Cup 2025/26 quarter-final, TV channels, preview</title>
      <link>https://www.techradar.com/how-to-watch/football/cardiff-city-vs-chelsea-carabao-cup-2025-26-quarter-final-live</link>
      <pubDate>Tue, 16 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">Cd4apVA4qqNusp9sBof3wL</guid>
      <description>The Cardiff vs Chelsea live stream will decipher who reaches the Carabao Cup semi-finals. Here's how you can watch from anywhere in the world.</description>
    </item>
    <item>
      <title>Redwood Materials just designed a smarter battery recycling bin</title>
      <link>https://www.fastcompany.com/91460952/redwood-materials-just-designed-a-smarter-battery-recycling-bin</link>
      <pubDate>2025-12-16T16:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91460952/redwood-materials-just-designed-a-smarter-battery-recycling-bin</guid>
      <description>Everyone wants to recycle their batteries, but drop-off locations are hard to find. A new fire-safe bin could make the process easier.
If you want to recycle an old electric toothbrush or pair of headphones with a lithium battery embedded inside, it can be hard to find a place to do it&#8212;and many existing battery collection boxes are fire risks. That&#8217;s why Redwood Materials, the battery recycling and energy storage company founded by ex-Tesla engineer J. B. Straubel, just redesigned the collection bin....</description>
    </item>
    <item>
      <title>The Foldable iPhone Might Be &#8216;Small&#8217;</title>
      <link>https://gizmodo.com/foldable-iphone-might-be-small-2000700170</link>
      <pubDate>Tue, 16 Dec 2025 15:54:33 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000700170</guid>
      <description>A new leak claims Apple's book-style foldable iPhone slated for 2026 could be smaller than an iPhone 17 Pro when closed.</description>
    </item>
    <item>
      <title>Ubisoft has acquired free-to-play MOBA game March of Giants with Rainbow Six Siege creative director at the helm &#8212; 'This game has enormous potential, and I know Ubisoft can help us take it to the next level'</title>
      <link>https://www.techradar.com/gaming/gaming-industry/ubisoft-has-acquired-free-to-play-moba-game-march-of-giants-with-rainbow-six-siege-creative-director-at-the-helm-this-game-has-enormous-potential-and-i-know-ubisoft-can-help-us-take-it-to-the-next-level</link>
      <pubDate>Tue, 16 Dec 2025 15:52:40 +0000</pubDate>
      <guid isPermaLink="false">9KXSjyZ2NtiMLwqjrcz6fP</guid>
      <description>Ubisoft has today announced that it has acquired the rights to Amazon's free-to-play multiplayer online battle arena (MOBA), March of Giants.</description>
    </item>
    <item>
      <title>Avant Clair Obscur, il y avait ce GOTY et il est &#224; son plus bas prix pour ce No&#235;l 2025 sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2911987_avant-clair-obscur-il-y-avait-ce-goty-et-il-est-a-son-plus-bas-prix-pour-ce-noel-2025-sur-amazon</link>
      <pubDate>Tue, 16 Dec 2025 15:51:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2911987_avant-clair-obscur-il-y-avait-ce-goty-et-il-est-a-son-plus-bas-prix-pour-ce-noel-2025-sur-amazon</guid>
      <description>
Astro Bot est le Game of the Year qui a pr&#233;c&#233;d&#233; Clair Obscur Expedition 33, donc en 2024. Il est possible de le commander pour 41,12 euros au lieu de 69,99 euros sur Amazon.
</description>
    </item>
    <item>
      <title>Le navigateur dop&#233; &#224; l&#8217;IA Opera Neon est disponible en version test, &#224; une condition</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2911993_le-navigateur-dope-a-lia-opera-neon-est-disponible-en-version-test-a-une-condition</link>
      <pubDate>Tue, 16 Dec 2025 15:47:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2911993_le-navigateur-dope-a-lia-opera-neon-est-disponible-en-version-test-a-une-condition</guid>
      <description>
Plus besoin d'invitation pour tester Opera Neon, le navigateur agentique qui veut r&#233;volutionner Internet. Mais tout le monde ne se jettera pas dessus.
</description>
    </item>
    <item>
      <title>Apple TV adds support for Google Cast even as Netflix ditches the feature</title>
      <link>https://techcrunch.com/2025/12/16/apple-tv-adds-support-for-google-cast-even-as-netflix-ditches-the-feature/</link>
      <pubDate>Tue, 16 Dec 2025 15:45:54 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3076389</guid>
      <description>The tech giant's adoption of Google Cast signals its interest in making Apple TV a more competitive streaming service at a time when the market is seeing increased consolidation.</description>
    </item>
    <item>
      <title>Cette marque a d&#233;gomm&#233; notre Top 5 des smartphones &#224; la plus grosse autonomie, et elle risque de recommencer en 2026</title>
      <link>https://www.01net.com/actualites/cette-marque-a-degomme-notre-top-5-des-smartphones-a-la-plus-grosse-autonomie-et-elle-risque-de-recommencer-en-2026.html</link>
      <pubDate>Tue, 16 Dec 2025 15:43:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315643</guid>
      <description>Apr&#232;s avoir r&#233;gn&#233; presque un an sur notre classement d&#8217;autonomie, le OnePlus&#8239;13 a &#233;t&#233; d&#233;pass&#233; par le OnePlus&#8239;15. Mais la firme chinoise pr&#233;pare d&#233;j&#224; son prochain champion, baptis&#233; OnePlus&#8239;Turbo, promis comme un monstre d&#8217;endurance. Avec une batterie de 9000&#8239;mAh &#8212; soit 23&#8239;% de plus que celle du OnePlus&#8239;15 &#8212; le constructeur chinois semble bien d&#233;cid&#233; &#224; repousser encore les limites de la technologie silicium&#8239;carbone....</description>
    </item>
    <item>
      <title>As RAM panic grips the PC-building community, I'm putting my feet up and relaxing - here's why</title>
      <link>https://www.techradar.com/computing/computing-components/as-ram-panic-grips-the-pc-building-community-im-putting-my-feet-up-and-relaxing-heres-why</link>
      <pubDate>Tue, 16 Dec 2025 15:43:23 +0000</pubDate>
      <guid isPermaLink="false">pN5goSadU2BcLYTEaUwfsK</guid>
      <description>Yes, RAM prices are terrible right now - but as a veteran PC-builder, I'm not that concerned.</description>
    </item>
    <item>
      <title>Hacking group says it&#8217;s extorting Pornhub after stealing users&#8217; viewing data</title>
      <link>https://techcrunch.com/2025/12/16/hacking-group-says-its-extorting-pornhub-after-stealing-users-viewing-data/</link>
      <pubDate>Tue, 16 Dec 2025 15:41:13 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3076390</guid>
      <description>The Scattered Lapsus$ Hunters hacking collective stole Pornhub premium users&#8217; data, including email addresses and viewing history.</description>
    </item>
    <item>
      <title>Amazon is set to lay off 370 workers at its European HQ</title>
      <link>https://www.engadget.com/big-tech/amazon-is-set-to-lay-off-370-workers-at-its-european-hq-154037845.html?src=rss</link>
      <pubDate>Tue, 16 Dec 2025 15:40:37 +0000</pubDate>
      <guid isPermaLink="false">aaa2844f-3b32-4c0d-ae80-db40491afeb6</guid>
      <description>Amazon is set to fire 370 people at its European headquarters in Luxembourg in the coming weeks, as Bloomberg reports. That accounts for about 8.5 percent of the workforce. Amazon initially planned to reduce its headcount there by 470, but under European Union law, companies have to negotiate layoffs with employee reps and, in some cases, governments.Amazon reportedly told employees at the European HQ in a memo the layoffs are "adjustments that reflect business needs and local strategies." The company claims to be going "well beyond industry benchmarks" in Luxembourg with regards to the severa...</description>
    </item>
    <item>
      <title>Texas is suing all of the big TV makers for spying on what you watch</title>
      <link>https://www.theverge.com/news/845400/texas-tv-makers-lawsuit-samsung-sony-lg-hisense-tcl-spying</link>
      <pubDate>2025-12-16T10:38:15-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=845400</guid>
      <description>Texas is suing five of the biggest TV makers, accusing them of "secretly recording what consumers watch in their own homes." In separate lawsuits filed on Tuesday, Texas Attorney General Ken Paxton claims the TVs made by Sony, Samsung, LG, Hisense, and TCL are part of a "mass surveillance system" that uses Automatic Content Recognition [&#8230;]</description>
    </item>
    <item>
      <title>Trump White House says ballroom construction must continue for national security reasons</title>
      <link>https://www.fastcompany.com/91461220/trump-white-house-says-ballroom-construction-must-continue-national-security-reasons</link>
      <pubDate>2025-12-16T15:35:14</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91461220/trump-white-house-says-ballroom-construction-must-continue-national-security-reasons</guid>
      <description>The administration cited the reason in a court filing responding to a lawsuit by the National Trust for Historic Preservation.
The Trump administration said in a court filing Monday that the president&#8217;s White House ballroom construction project must continue for unexplained national security reasons and because a preservationists&#8217; organization that wants it stopped has no standing to sue.The filing was in response to a lawsuit filed last Friday by the National Trust for Historic Preservation asking a federal judge to halt President Donald Trump&#8217;s project until it goes through multiple independ...</description>
    </item>
    <item>
      <title>The ChatGPT app just got a big upgrade on iOS and Android to stop your chats spiraling out of control</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/the-chatgpt-app-just-got-a-big-upgrade-on-ios-and-android-to-stop-your-chats-spiraling-out-of-control</link>
      <pubDate>Tue, 16 Dec 2025 15:34:23 +0000</pubDate>
      <guid isPermaLink="false">rm3AHxfk3h2fqDaqQtzmec</guid>
      <description>iPhone and Android users just got access to this excellent ChatGPT feature, albeit three months late.</description>
    </item>
    <item>
      <title>Eggs recalled after Salmonella sickens 63 people in California: See the list of products and stores impacted</title>
      <link>https://www.fastcompany.com/91461185/egg-recall-dec-2025-salmonella-outbreak-illnesses-list-stores-products</link>
      <pubDate>2025-12-16T15:32:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91461185/egg-recall-dec-2025-salmonella-outbreak-illnesses-list-stores-products</guid>
      <description>The California outbreak, linked to Vega Farms eggs, follows a wave Salmonella outbreaks linked to eggs this year. Here&#8217;s the latest.
Vega Farms, a California-based food producer, has voluntarily recalled Vega Farms-branded in-shell eggs due to a Salmonella outbreak that has sickened more than 60 people and led to more than a dozen hospitalizations. ...</description>
    </item>
    <item>
      <title>The power and potential of agentic AI in cybersecurity</title>
      <link>https://www.techradar.com/pro/the-power-and-potential-of-agentic-ai-in-cybersecurity</link>
      <pubDate>Tue, 16 Dec 2025 15:30:21 +0000</pubDate>
      <guid isPermaLink="false">hEoxqZTMCTzZEmXh4v8R9j</guid>
      <description>Why it will become essential for organizations to have dedicated security measures for agentic AI-based tools.</description>
    </item>
    <item>
      <title>Did novelty camera maker Lomography just get serious? I held the MC-A &#8212; and it&#8217;s finally a proper 35mm film camera</title>
      <link>https://www.techradar.com/cameras/compact-cameras/did-novelty-camera-maker-lomography-just-get-serious-i-held-the-mc-a-and-its-finally-a-proper-35mm-film-camera</link>
      <pubDate>Tue, 16 Dec 2025 15:27:54 +0000</pubDate>
      <guid isPermaLink="false">gSmkKp8JhayNXJFtzP2bdQ</guid>
      <description>Lomography unveiled the Lomo MC-A in October 2025 &#8212; it's a proper 35mm film camera with glass 35mm f/2.8 lens, metal body, autofocus and exposure control.</description>
    </item>
  </channel>
</rss>
