<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 30 Dec 2025 07:26:48 GMT</lastBuildDate>
    <item>
      <title>Amazon retire 30 % &#224; la nouvelle Bose SoundLink Plus, une enceinte puissante not&#233;e 8/10 par nos soins</title>
      <link>https://www.frandroid.com/bons-plans/2921989_amazon-retire-30-a-la-nouvelle-bose-soundlink-plus-une-enceinte-puissante-notee-8-10-par-nos-soins</link>
      <pubDate>Tue, 30 Dec 2025 07:24:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2921989_amazon-retire-30-a-la-nouvelle-bose-soundlink-plus-une-enceinte-puissante-notee-8-10-par-nos-soins</guid>
      <description>
La Bose SoundLink Plus constitue un excellent choix pour animer vos soir&#233;es : elle offre une exp&#233;rience sonore puissante, une autonomie remarquable et une qualit&#233; de fabrication irr&#233;prochable. Bonne nouvelle, la voil&#224; en promotion &#224; 199 euros au lieu de 279 euros &#224; sa sortie.
</description>
    </item>
    <item>
      <title>J&#8217;ai couru un trail de nuit avec les 2 meilleures montres de sport du moment&#160;: qui est le meilleur, Garmin ou Suunto&#160;?</title>
      <link>https://www.01net.com/actualites/test-comparatif-garmin-fenix8-pro-suunto-vertical-2-avis.html</link>
      <pubDate>Tue, 30 Dec 2025 07:15:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317535</guid>
      <description>Garmin ou Suunto ? Quelle montre de sport choisir que ce soit pour le trail, pour les sports outdoor, la montagne ou la mer ? Pour vous aider &#224; vous faire votre avis on a test&#233; les deux meilleurs mod&#232;les du moment lors d&#8217;un trail nocturne. Voici le test en conditions r&#233;elles.</description>
    </item>
    <item>
      <title>WhatsApp Web travaille toujours sur ce qui lui manque</title>
      <link>https://www.01net.com/actualites/whatsapp-web-travaille-toujours-sur-ce-qui-lui-manque.html</link>
      <pubDate>Tue, 30 Dec 2025 07:04:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317573</guid>
      <description>La version Web de WhatsApp continue d'avancer sur les appels vocaux et vid&#233;o, qui seront accompagn&#233;s de r&#233;glages suppl&#233;mentaires pour mieux g&#233;rer les notifications.</description>
    </item>
    <item>
      <title>La Chine pose les bases de la r&#233;gulation la plus stricte au monde contre les d&#233;rives des &#171;&#160;compagnons&#160;&#187; IA</title>
      <link>https://www.01net.com/actualites/la-chine-pose-les-bases-de-la-regulation-la-plus-stricte-au-monde-contre-les-derives-des-compagnons-ia.html</link>
      <pubDate>Tue, 30 Dec 2025 07:00:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317543</guid>
      <description>La Chine prend &#224; bras le corps la probl&#233;matique de la sant&#233; mentale avec les chatbots IA. Les autorit&#233;s ont propos&#233; une s&#233;rie de r&#232;gles tr&#232;s contraignantes qui pourraient fortement limiter les capacit&#233;s de ChatGPT et des autres bots.</description>
    </item>
    <item>
      <title>Vous n&#8217;aurez plus besoin de sonde colorim&#233;trique pour ce nouvel &#233;cran professionnel</title>
      <link>https://www.01net.com/actualites/vous-naurez-plus-besoin-de-sonde-colorimetrique-pour-ce-nouvel-ecran-professionnel.html</link>
      <pubDate>Tue, 30 Dec 2025 06:58:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315649</guid>
      <description>L&#8217;entreprise ta&#239;wanaise BenQ pr&#233;sente le moniteur 4K de 27 pouces pour les professionnels de l&#8217;image. Outre une performance promise de haute vol&#233;e, l&#8217;&#233;cran b&#233;n&#233;ficie d&#8217;une sonde colorim&#233;trique int&#233;gr&#233;e, mais aussi de nombreuses fonctions et accessoires comme une t&#233;l&#233;commande de contr&#244;le d&#233;di&#233;e.</description>
    </item>
    <item>
      <title>Pas besoin de se ruiner avec ce TV QLED Philips de 55&#8243; avec Ambilight en promo &#224; moins de 500 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2922419_pas-besoin-de-se-ruiner-avec-ce-tv-qled-philips-de-55%e2%80%b3-avec-ambilight-en-promo-a-moins-de-500-e</link>
      <pubDate>Tue, 30 Dec 2025 06:33:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2922419_pas-besoin-de-se-ruiner-avec-ce-tv-qled-philips-de-55%e2%80%b3-avec-ambilight-en-promo-a-moins-de-500-e</guid>
      <description>
Le&#160;Philips 55PUS8600/12&#160;s&#8217;offre une belle r&#233;duction en cette fin d&#8217;ann&#233;e&#8239;: ce t&#233;l&#233;viseur 4K QLED de 55 pouces passe de&#160;649&#8239;&#8364; &#224; seulement 472&#8239;&#8364;&#160;chez Ubaldi. Un bon plan pour ceux qui veulent profiter d&#8217;une belle qualit&#233; d'image et de l&#8217;Ambilight, sans exploser leur budget.
</description>
    </item>
    <item>
      <title>01net morning&#160;: les flops tech de 2025, des radars pour scanner les voitures, la fin des tickets en carton dans les transports parisiens</title>
      <link>https://www.01net.com/actualites/01net-morning-les-flops-tech-de-2025-des-radars-pour-scanner-les-voitures-la-fin-des-tickets-en-carton-dans-les-transports-parisiens.html</link>
      <pubDate>Tue, 30 Dec 2025 06:30:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317549</guid>
      <description>Bonjour &#224; tous, voici la matinale de 01net ! Qu&#8217;avez-vous manqu&#233; ce week-end ? Retrouvez toute l&#8217;actu &#224; connaitre pour d&#233;marrer la semaine du bon pied !</description>
    </item>
    <item>
      <title>3 Garmin watches I want to see in 2026 &#8212; and top of the list is a true Forerunner 55 sequel</title>
      <link>https://www.techradar.com/health-fitness/3-garmin-watches-i-want-to-see-in-2026-and-top-of-the-list-is-a-true-forerunner-55-sequel</link>
      <pubDate>Tue, 30 Dec 2025 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">iSp8neWkJzEaSniQqRKKFf</guid>
      <description>Garmin's cheapest watch is in dire need of an upgrade, as well as others in the range.</description>
    </item>
    <item>
      <title>Meta just bought Manus, an AI startup everyone has been talking about</title>
      <link>https://techcrunch.com/2025/12/29/meta-just-bought-manus-an-ai-startup-everyone-has-been-talking-about/</link>
      <pubDate>Tue, 30 Dec 2025 05:39:08 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3079280</guid>
      <description>Meta says it'll keep Manus running independently while weaving its agents into Facebook, Instagram, and WhatsApp, where Meta's own chatbot, Meta AI, is already available to users.</description>
    </item>
  </channel>
</rss>
