<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 19 Feb 2026 08:52:39 GMT</lastBuildDate>
    <item>
      <title>Le grand projet d&#8217;archivage du web est menac&#233; par l&#8217;IA</title>
      <link>https://www.01net.com/actualites/le-grand-projet-darchivage-du-web-est-menace-par-lia.html</link>
      <pubDate>Thu, 19 Feb 2026 08:42:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326795</guid>
      <description>Le directeur de la Wayback Machine, un service rattach&#233; &#224; Internet Archive et qui permet de sauvegarder les pages Web du monde entier, s&#8217;inqui&#232;te. Des &#233;diteurs bloquent la sauvegarde de leur site par la Wayback Machine par crainte d&#8217;une utilisation pour entra&#238;ner l&#8217;IA.</description>
    </item>
    <item>
      <title>What exactly is the Dyson PencilWash, and should I buy one?</title>
      <link>https://www.techradar.com/home/vacuums/what-exactly-is-the-dyson-pencilwash-and-should-i-buy-one</link>
      <pubDate>Thu, 19 Feb 2026 08:39:26 +0000</pubDate>
      <guid isPermaLink="false">epJkMHKBCN9zhkt3QynVhF</guid>
      <description>Dyson just launched an impossible-looking hard floor cleaner &#8212; here's what you need to know about the ultra-compact Dyson PencilWash.</description>
    </item>
    <item>
      <title>&#192; quel point les v&#233;los &#233;lectriques sont-ils fabriqu&#233;s en France ? Trois nouvelles marques re&#231;oivent les labels Indice France V&#233;lo et Cyclescore</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2981595_a-quel-point-les-velos-electriques-sont-ils-fabriques-en-france-trois-nouvelles-marques-recoivent-les-labels-indice-france-velo-et-cyclescore</link>
      <pubDate>Thu, 19 Feb 2026 08:33:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2981595_a-quel-point-les-velos-electriques-sont-ils-fabriques-en-france-trois-nouvelles-marques-recoivent-les-labels-indice-france-velo-et-cyclescore</guid>
      <description>
De nouveaux v&#233;los &#233;lectriques gonflent la liste des labels Cyclescore, qui note l&#8217;aspect environnemental et soci&#233;tal, ainsi que l&#8217;Indice France V&#233;lo, focalis&#233; sur le niveau de fabrication locale.
</description>
    </item>
    <item>
      <title>Les donn&#233;es de 1,2 million de comptes bancaires fran&#231;ais ont &#233;t&#233; pirat&#233;es</title>
      <link>https://www.01net.com/actualites/fichier-national-comptes-bancaires-pirate-12-million-de-comptes-sont-touches.html</link>
      <pubDate>Thu, 19 Feb 2026 08:31:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326743</guid>
      <description>Le fichier national des comptes bancaires (FICOBA), qui recense tous les comptes ouverts en France, a subi une fuite de donn&#233;es.Depuis fin janvier 2026, un pirate a consult&#233; les donn&#233;es de 1,2 million de comptes, dont le RIB et l'IBAN. L'attaquant a profit&#233; des identifiants vol&#233;s d'un fonctionnaire et de l'absence d'authentification &#224; deux facteurs pour arriver &#224; ses fins......</description>
    </item>
    <item>
      <title>L&#8217;alternative europ&#233;enne &#224; PayPal, Apple Pay et Google Pay arrive : voici les commer&#231;ants qui l&#8217;accepteront en 2026</title>
      <link>https://www.frandroid.com/services/banque-en-ligne/2982421_lalternative-europeenne-a-paypal-apple-pay-et-google-pay-arrive-voici-les-commercants-qui-laccepteront-en-2026</link>
      <pubDate>Thu, 19 Feb 2026 08:28:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/banque-en-ligne/2982421_lalternative-europeenne-a-paypal-apple-pay-et-google-pay-arrive-voici-les-commercants-qui-laccepteront-en-2026</guid>
      <description>
Le service Wero est n&#233; comme un syst&#232;me de transfert d'argent entre particuliers, fa&#231;on Lydia et Paylib. Mais l'ambition de ce projet europ&#233;en va bien plus loin : s'attaquer au paiement en boutique et sur Internet. Plusieurs grandes enseignes ont d&#233;j&#224; annonc&#233; leur compatibilit&#233; avec Wero pour 2026. Un pari os&#233; face aux g&#233;ants am&#233;ricains.
</description>
    </item>
    <item>
      <title>Malgr&#233; l&#8217;abandon du projet en 2022, Meta pourrait finalement lancer une montre connect&#233;e</title>
      <link>https://www.01net.com/actualites/malgre-labandon-du-projet-en-2022-meta-pourrait-finalement-lancer-une-montre-connectee.html</link>
      <pubDate>Thu, 19 Feb 2026 08:00:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326752</guid>
      <description>Meta aurait relanc&#233; son projet de montre connect&#233;e, apr&#232;s l'avoir abandonn&#233; en 2022. Ce nouveau mod&#232;le, qui mettrait &#233;videmment l'accent sur l'assistant Meta AI, pourrait m&#234;me sortir d&#232;s cette ann&#233;e !</description>
    </item>
    <item>
      <title>Google Maps bride son acc&#232;s aux personnes ne disposant pas de compte Google</title>
      <link>https://www.frandroid.com/marques/google/2982391_google-maps-bride-son-acces-aux-personnes-ne-disposant-pas-de-compte-google</link>
      <pubDate>Thu, 19 Feb 2026 07:41:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2982391_google-maps-bride-son-acces-aux-personnes-ne-disposant-pas-de-compte-google</guid>
      <description>
L&#8217;acc&#232;s &#224; Google Maps sur le web est largement brid&#233; depuis peu pour les internautes qui ne n&#8217;utilisent pas de compte Google. Plusieurs fonctionnalit&#233;s, dont les photos et les avis, sont inaccessibles dans cette configuration.
</description>
    </item>
    <item>
      <title>Amazon fait perdre 400 &#8364; &#224; ce puissant laptop Lenovo, avec &#233;cran OLED et Ryzen&#160;7</title>
      <link>https://www.frandroid.com/bons-plans/2981693_amazon-fait-perdre-400-e-a-ce-puissant-laptop-lenovo-avec-ecran-oled-et-ryzen-7</link>
      <pubDate>Thu, 19 Feb 2026 07:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2981693_amazon-fait-perdre-400-e-a-ce-puissant-laptop-lenovo-avec-ecran-oled-et-ryzen-7</guid>
      <description>
La crise de la RAM et du stockage a aussi des cons&#233;quences sur le prix des PC portables... mais on vous a trouv&#233; un bon deal : ce laptop Lenovo avec un &#233;cran OLED et anim&#233; par une puce Ryzen 7 voit son prix chuter &#224; 699 euros au lieu de 1 099 euros au d&#233;part. 
</description>
    </item>
    <item>
      <title>CarPlay s&#8217;ouvre enfin aux chatbots&#160;: ChatGPT bient&#244;t en voiture&#160;!</title>
      <link>https://www.01net.com/actualites/carplay-souvre-enfin-aux-chatbots-chatgpt-bientot-en-voiture.html</link>
      <pubDate>Thu, 19 Feb 2026 07:30:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326750</guid>
      <description>Apple pr&#233;pare le terrain aux chatbots dans CarPlay. Le constructeur a en effet cr&#233;&#233; une nouvelle section d'applications iOS pouvant pr&#233;tendre &#224; un affichage sur les &#233;crans des voitures : les apps de conversation vocale. On pourra bient&#244;t discuter avec ChatGPT ou Gemini en conduisant, sans bidouille.</description>
    </item>
    <item>
      <title>Google lance un appareil photo Snapseed pour l&#8217;iPhone</title>
      <link>https://www.01net.com/actualites/google-lance-un-appareil-photo-snapseed-pour-liphone.html</link>
      <pubDate>Thu, 19 Feb 2026 07:16:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326768</guid>
      <description>L&#8217;application de retouche photo qui &#233;tait tomb&#233;e aux oubliettes fait un retour en force. En plus de vous laisser retoucher vos photos, Snapseed peut d&#233;sormais les prendre en y appliquant des filtres en direct.</description>
    </item>
    <item>
      <title>Google Maps&#160;: pourquoi les avis et les photos disparaissent soudainement pour certains utilisateurs&#160;?</title>
      <link>https://www.01net.com/actualites/google-maps-pourquoi-avis-photos-disparaissent-soudainement-certains-utilisateurs.html</link>
      <pubDate>Thu, 19 Feb 2026 07:11:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326756</guid>
      <description>Google Maps restreint d&#233;sormais drastiquement l'acc&#232;s aux avis et aux photos pour les utilisateurs non connect&#233;s &#224; un compte Google.</description>
    </item>
    <item>
      <title>Apr&#232;s les images et la vid&#233;o, Gemini compose d&#233;sormais des chansons</title>
      <link>https://www.01net.com/actualites/apres-les-images-et-la-video-gemini-compose-desormais-des-chansons.html</link>
      <pubDate>Thu, 19 Feb 2026 07:02:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326747</guid>
      <description>Apr&#232;s la g&#233;n&#233;ration d'images et de vid&#233;os, pourquoi ne pas s'attaquer maintenant &#224; la musique ? L'app Gemini et sa version web peuvent d&#233;sormais &#171;&#160;cr&#233;er&#160;&#187;&#160;des chansons de 30 secondes &#224; partir d'une simple requ&#234;te texte. Y compris en fran&#231;ais.</description>
    </item>
    <item>
      <title>Brendan Fraser on resilience at work in your 50s: &#8216;The silences in a career can be deafening&#8217;</title>
      <link>https://www.fastcompany.com/91488606/brendan-fraser-on-resilience-at-work-in-your-50s-the-silences-in-a-career-can-be-deafening</link>
      <pubDate>2026-02-19T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91488606/brendan-fraser-on-resilience-at-work-in-your-50s-the-silences-in-a-career-can-be-deafening</guid>
      <description>The Oscar winner talked to AARP The Magazine about depression and career dry spells&#8212;and how huge achievements can come later in life.
&#8220;Before&#160;The Whale, I had everything to prove. And now, to be honest, not so much,&#8221; Oscar winner Brendan Fraser, 57, told&#160;AARP The Magazine&#160;in an interview last month.&#160;</description>
    </item>
  </channel>
</rss>
