<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 26 Nov 2025 13:48:16 GMT</lastBuildDate>
    <item>
      <title>A weekend &#8216;vibe code&#8217; hack by Andrej Karpathy quietly sketches the missing layer of enterprise AI orchestration</title>
      <link>https://venturebeat.com/ai/a-weekend-vibe-code-hack-by-andrej-karpathy-quietly-sketches-the-missing</link>
      <pubDate>Wed, 26 Nov 2025 14:00:00 GMT</pubDate>
      <guid isPermaLink="false">2dWUbFWIX3NBSiYfhZ33KX</guid>
      <description>This weekend, Andrej Karpathy, the former director of AI at Tesla and a founding member of OpenAI, decided he wanted to read a book. But he did not want to read it alone. He wanted to read it accompanied by a committee of artificial intelligences, each offering its own perspective, critiquing the others, and eventually synthesizing a final answer under the guidance of a "Chairman."To make this happen, Karpathy wrote what he called a "vibe code project" &#8212; a piece of software written quickly, largely by AI assistants, intended for fun rather than function. He posted the result, a repository call...</description>
    </item>
    <item>
      <title>Jusqu&#8217;&#224; 50% de performance en moins : les derni&#232;res mises &#224; jour de Windows 11 sont catastrophiques pour le jeu vid&#233;o</title>
      <link>https://www.frandroid.com/produits-android/console/2886389_jusqua-50-de-performance-en-moins-les-dernieres-mises-a-jour-de-windows-11-sont-catastrophiques-pour-le-jeu-video</link>
      <pubDate>Wed, 26 Nov 2025 13:46:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2886389_jusqua-50-de-performance-en-moins-les-dernieres-mises-a-jour-de-windows-11-sont-catastrophiques-pour-le-jeu-video</guid>
      <description>
Les derni&#232;res mises &#224; jour de Windows 11 ont loin d'avoir &#233;t&#233; b&#233;n&#233;fiques pour les performances des jeux sur PC et nous avons maintenant un exemple probant.
</description>
    </item>
    <item>
      <title>Apple va chiper &#224; Samsung la couronne de champion des smartphones en 2025, une premi&#232;re en plus de dix ans</title>
      <link>https://www.01net.com/actualites/apple-va-chiper-a-samsung-la-couronne-de-champion-des-smartphones-en-2025-une-premiere-en-plus-de-dix-ans.html</link>
      <pubDate>Wed, 26 Nov 2025 13:42:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311431</guid>
      <description>Et &#224; la fin, c'est Apple qui gagne. Le lancement des iPhone 17 en septembre a dop&#233; les ventes de smartphones de la firme &#224; la pomme cette ann&#233;e ce qui va lui permettre de repasser en t&#234;te du classement mondial des constructeurs, devant Samsung. Une premi&#232;re en quatorze ans.</description>
    </item>
    <item>
      <title>Voici la meilleure offre du Black Friday sur l&#8217;excellent Google Pixel 10</title>
      <link>https://www.frandroid.com/bons-plans/2848533_voici-la-meilleure-offre-du-black-friday-sur-lexcellent-google-pixel-10</link>
      <pubDate>Wed, 26 Nov 2025 13:42:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848533_voici-la-meilleure-offre-du-black-friday-sur-lexcellent-google-pixel-10</guid>
      <description>
Le Google Pixel 10 &#224; de belles choses &#224; offrir : un zoom optique x5, un Tensor G5 optimis&#233;, une meilleure batterie et la promesse de 7 ans de mises &#224; jour. Int&#233;ress&#233; ? Il peut vous revenir &#224; seulement 535 euros gr&#226;ce &#224; cette offre du Black Friday sur Amazon. 
</description>
    </item>
    <item>
      <title>11 of my favorite Black Friday deals on USB4 and Thunderbolt SSDs have arrived - these are the ones I recommend based on my benchmarks and tests</title>
      <link>https://www.techradar.com/pro/11-of-my-favorite-black-friday-deals-on-usb4-and-thunderbolt-ssds-have-arrived-these-are-the-ones-i-recommend-based-on-my-benchmarks-and-tests</link>
      <pubDate>Wed, 26 Nov 2025 13:39:21 +0000</pubDate>
      <guid isPermaLink="false">2nMdTcdFUvXgH4sVoLGXEc</guid>
      <description>I've tested and benchmarked SSDs for years, and these are my top picks for picking up a fast USB4 or Thunderbolt SSD for cheap this Black Friday.</description>
    </item>
    <item>
      <title>Good news 4K Blu-ray fans - Black Friday sales are live with tons of great offers and I've found the best ones</title>
      <link>https://www.techradar.com/televisions/blu-ray/good-news-4k-blu-ray-fans-black-friday-sales-are-live-with-tons-of-great-offers-and-ive-found-the-best-ones</link>
      <pubDate>Wed, 26 Nov 2025 13:33:56 +0000</pubDate>
      <guid isPermaLink="false">9nWWdPDF86wRQnMghToZmX</guid>
      <description>Black Friday is the perfect time to bulk up your 4K Blu-ray collection and I've found the best sales that you should check out.</description>
    </item>
    <item>
      <title>Quelles sont les meilleures manettes de jeu &#224; choisir pour iPhone en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-gaming/1811389_notre-selection-des-meilleures-manettes-de-jeu-pour-iphone-en-2023</link>
      <pubDate>Wed, 26 Nov 2025 13:30:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-gaming/1811389_notre-selection-des-meilleures-manettes-de-jeu-pour-iphone-en-2023</guid>
      <description>
Envie de jouer plus confortablement sur votre iPhone ? Le mieux est d'utiliser une manette compatible. Celle-ci pourra &#234;tre connect&#233;e via un c&#226;ble, le Bluetooth ou encore se pr&#233;senter sous forme de pad extensible. Voici notre s&#233;lection des meilleures manettes pour iPhone en 2025.
</description>
    </item>
    <item>
      <title>T-Mobile Black Friday deals 2025: free iPhone 17 Pro, iPad, Galaxy S25, plus our expert buying tips today</title>
      <link>https://www.techradar.com/phones/t-mobile/t-mobile-black-friday-deals-2025-free-iphone-17-pro-max-ipad-galaxy-s25-plus-our-expert-buying-tips-today</link>
      <pubDate>Wed, 26 Nov 2025 13:24:55 +0000</pubDate>
      <guid isPermaLink="false">pAPZX7mygU7doWuCCcqoyf</guid>
      <description>My expert picks for today's best T-Mobile Black Friday deals, including iPhones, Android, and even cheap internet plans.</description>
    </item>
    <item>
      <title>Android sur une Game Boy de luxe : pourquoi la Pocket Vert est un d&#233;lire technique</title>
      <link>https://www.frandroid.com/android/2886825_android-sur-une-game-boy-de-luxe-pourquoi-la-pocket-vert-est-un-delire-technique</link>
      <pubDate>Wed, 26 Nov 2025 13:22:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/2886825_android-sur-une-game-boy-de-luxe-pourquoi-la-pocket-vert-est-un-delire-technique</guid>
      <description>
La nostalgie a un prix, et souvent, elle a aussi des d&#233;fauts techniques. Ayaneo tente de corriger le tir avec la Pocket Vert. Imaginez une Game Boy, mais construite comme un smartphone moderne : ch&#226;ssis m&#233;tallique, fa&#231;ade en verre int&#233;gra et une d&#233;finition d'&#233;cran d&#233;lirante de 1600 x 1440 pixels.
</description>
    </item>
    <item>
      <title>Echo Dot Max review: Amazon&#8217;s best mid-range speaker, but not by much</title>
      <link>https://www.techradar.com/home/smart-home-hubs/echo-dot-max-review-amazons-best-mid-range-speaker-but-not-by-much</link>
      <pubDate>Wed, 26 Nov 2025 13:20:49 +0000</pubDate>
      <guid isPermaLink="false">uK8jAMeAyQZ5SR8vHXsAHU</guid>
      <description>Amazon&#8217;s newest lineup of smart speakers includes the Echo Dot Max, which sits between the standard Echo and Echo Studio as a solid-sounding, well-rounded smart speaker &#8211; but it doesn&#8217;t quite do enough to justify its price.</description>
    </item>
    <item>
      <title>SitusAMC hack may have exposed data at major financial heavyweights</title>
      <link>https://www.techradar.com/pro/security/situsamc-hack-may-have-exposed-data-at-major-financial-heavyweights</link>
      <pubDate>Wed, 26 Nov 2025 13:17:00 +0000</pubDate>
      <guid isPermaLink="false">NXx343TLj4rvhNANti5rU</guid>
      <description>A company providing the backend for finance giants was breached, with the damage still being assessed.</description>
    </item>
    <item>
      <title>How to watch Sidelined 2: Intercepted on Tubi (it's free)</title>
      <link>https://www.techradar.com/how-to-watch/american-football/watch-sidelined-2-intercepted-on-tubi-its-free</link>
      <pubDate>Wed, 26 Nov 2025 13:10:58 +0000</pubDate>
      <guid isPermaLink="false">YqHh5YXHJb8zPzAb6Lja5J</guid>
      <description>Gen Z teen romance sequel debuts on Thanksgiving&#8211; here's where to watch it free, plus all the release date, streaming info, trailer and a breakdown of the buzz around Tubi's teen romance.</description>
    </item>
    <item>
      <title>Fini de jongler entre les menus : Windows 11 veut centraliser vos mises &#224; jour syst&#232;me et applications</title>
      <link>https://www.frandroid.com/marques/microsoft/2886571_fini-de-jongler-entre-les-menus-windows-11-veut-centraliser-vos-mises-a-jour-systeme-et-applications</link>
      <pubDate>Wed, 26 Nov 2025 13:04:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2886571_fini-de-jongler-entre-les-menus-windows-11-veut-centraliser-vos-mises-a-jour-systeme-et-applications</guid>
      <description>
Microsoft travaille sur une fonctionnalit&#233; permettant de retrouver au m&#234;me endroit les mises &#224; jour de Windows et des applications install&#233;es sur le PC.  
</description>
    </item>
    <item>
      <title>ChatGPT and Copilot are being booted out of WhatsApp</title>
      <link>https://www.theverge.com/news/829808/chatgpt-copilot-ai-llm-leaving-whatsapp-meta</link>
      <pubDate>2025-11-26T08:00:55-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=829808</guid>
      <description>OpenAI&#8217;s ChatGPT and Microsoft&#8217;s Copilot are both leaving WhatsApp thanks to upcoming changes to the messaging app&#8217;s terms of service that will prohibit using it to distribute AI chatbots not made by Meta. OpenAI announced its planned departure a few weeks ago, with Microsoft following it this week. Both companies attributed the departures to Meta&#8217;s [&#8230;]...</description>
    </item>
    <item>
      <title>12 Best Computer Monitors (2025): Budget, OLED, 4K, and More</title>
      <link>https://www.wired.com/gallery/best-computer-monitors/</link>
      <pubDate>Wed, 26 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">62ec197954d910713ee4f16f</guid>
      <description>The Gear team spends countless hours in front of displays while writing for you. So we reviewed those too (including a portable screen).</description>
    </item>
    <item>
      <title>This VPN is offering a lifetime of VPN coverage and premium password management for only $30! Here's how to pick up your deal</title>
      <link>https://www.techradar.com/vpn/vpn-services/this-vpn-is-offering-a-lifetime-of-vpn-coverage-and-premium-password-management-for-only-usd30-heres-how-to-pick-up-your-deal</link>
      <pubDate>Wed, 26 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">nVQiMLaL9XTsuDkTqa2vWA</guid>
      <description>FastestVPN has your back &#8211; for life</description>
    </item>
    <item>
      <title>Thanksgiving flight today? This map shows which airports have the most delays and cancellations</title>
      <link>https://www.fastcompany.com/91449947/thanksgiving-flight-today-this-map-shows-which-airports-have-the-most-delays-and-cancellations</link>
      <pubDate>2025-11-26T13:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91449947/thanksgiving-flight-today-this-map-shows-which-airports-have-the-most-delays-and-cancellations</guid>
      <description>Millions of Americans will be taking to the skies to reach their holiday destinations. These tools and trackers can help with your trip.
The Thanksgiving travel period is in full swing. Today is the last day before Thanksgiving, which means millions of Americans will be taking to the skies to reach their holiday destinations. And myriad more will also be traveling to airports to pick up their incoming loved ones....</description>
    </item>
    <item>
      <title>Bo&#238;te de r&#233;ception | T&#233;moins superflus, courriels douteux et mots de passe ing&#233;nieux</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-11-26/boite-de-reception/temoins-superflus-courriels-douteux-et-mots-de-passe-ingenieux.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 26 Nov 2025 08:00:00 -0500</pubDate>
      <guid isPermaLink="false">d1d8160dc1153761aeb8c9502cb711f0</guid>
      <description>Chaque mercredi, notre journaliste r&#233;pond &#224; vos questions en lien avec le num&#233;rique et les nouvelles technologies. Cette semaine, on se demande s&#8217;il faut accepter (ou pas) les t&#233;moins des sites web, on d&#233;joue les fraudeurs par courriel et on se penche sur la s&#233;curit&#233; des mots de passe.</description>
    </item>
    <item>
      <title>I&#8217;m a dash cams expert &#8211; here are my 20 Black Friday deal picks from Garmin, Nextbase, Vantrue, 70mai and more</title>
      <link>https://www.techradar.com/vehicle-tech/dash-cams/im-a-dash-cams-expert-here-are-my-20-black-friday-deal-picks-from-garmin-nextbase-vantrue-70mai-and-more</link>
      <pubDate>Wed, 26 Nov 2025 12:57:23 +0000</pubDate>
      <guid isPermaLink="false">itgP2T4KXZw3dTghiY9B3i</guid>
      <description>From Garmin's budget Dash Cam Mini 3 to Vantrue's complex four channel Nexus 5S, I roundup the best Black Friday dash cam deals for 2025.</description>
    </item>
    <item>
      <title>Voici le Ryzen 5 9600X &#224; prix cass&#233; pour le Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/bons-plans-hardware/2884211_oubliez-aliexpress-voici-le-ryzen-5-9600x-a-prix-casse-sur-deux-sites-fiables</link>
      <pubDate>Wed, 26 Nov 2025 12:49:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/bons-plans-hardware/2884211_oubliez-aliexpress-voici-le-ryzen-5-9600x-a-prix-casse-sur-deux-sites-fiables</guid>
      <description>
Vous h&#233;sitiez &#224; commander votre CPU en Chine pour gratter quelques euros au risque de tout perdre ? Laissez tomber. Amazon s'aligne presque sur les prix gris avec un Ryzen 5 9600X qui devient enfin une affaire incontournable et s&#233;curis&#233;e.
</description>
    </item>
    <item>
      <title>ChatGPT&#8217;s new voice integration feels like the missing piece in AI chat &#8211; I&#8217;ve tried it, and it's almost perfect</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/chatgpts-new-voice-integration-feels-like-the-missing-piece-in-ai-chat-ive-tried-it-and-its-almost-perfect</link>
      <pubDate>Wed, 26 Nov 2025 12:46:11 +0000</pubDate>
      <guid isPermaLink="false">ms2kZN7ky45tQ345Fq6wbP</guid>
      <description>ChatGPT&#8217;s new integrated Voice Mode quietly transforms the app into a seamless, always-on AI assistant you can talk to anytime.</description>
    </item>
    <item>
      <title>Psst... Hey gamers! These Asus V16 gaming laptop Black Friday deals are a no-brainer, at almost 20% off</title>
      <link>https://www.techradar.com/seasonal-sales/psst-hey-gamers-these-asus-v16-gaming-laptop-black-friday-deals-are-a-no-brainer-at-almost-20-percent-off</link>
      <pubDate>Wed, 26 Nov 2025 12:42:42 +0000</pubDate>
      <guid isPermaLink="false">T5hMhkfnCWAumTutMpGk5</guid>
      <description>Here's an easy way to beat the high RAM prices: these Asus V16 gaming laptop Black Friday deals can save you up to 18% off.</description>
    </item>
    <item>
      <title>Here are the 8 best Black Friday gaming headset deals for under $100</title>
      <link>https://www.techradar.com/gaming/here-are-the-8-best-black-friday-gaming-headset-deals-for-under-usd100</link>
      <pubDate>Wed, 26 Nov 2025 12:42:27 +0000</pubDate>
      <guid isPermaLink="false">isw7hC87G36yiiqQuhbKJ5</guid>
      <description>These best gaming headset deals offer huge Black Friday discounts for under $100. These include the excellent HyperX Cloud Alpha, and the Xbox Wireless Headset.</description>
    </item>
    <item>
      <title>Are you an air fryer fanatic? You can save $180 on one of Ninja's best models in Amazon's Black Friday sale</title>
      <link>https://www.techradar.com/seasonal-sales/are-you-an-air-fryer-fanatic-you-can-save-usd180-on-one-of-ninjas-best-models-in-amazons-black-friday-sale</link>
      <pubDate>Wed, 26 Nov 2025 12:39:32 +0000</pubDate>
      <guid isPermaLink="false">qMp4AAPYqyHzqkvGCH8V44</guid>
      <description>One of Ninja's most expensive air fryers has had a huge $180 price cut in Amazon's Black Friday sale.</description>
    </item>
    <item>
      <title>Sonos Era 300 is 20% off this Black Friday, but I'd opt for two Sonos Era 100 instead</title>
      <link>https://www.techradar.com/audio/wireless-bluetooth-speakers/sonos-era-300-is-20-percent-off-this-black-friday-but-id-opt-for-two-sonos-era-100-instead</link>
      <pubDate>Wed, 26 Nov 2025 12:35:32 +0000</pubDate>
      <guid isPermaLink="false">QjwWfwewUFW3u3VsFGztxQ</guid>
      <description>There are excellent deals on Sonos' Era line of speakers, but be sure to avoid buying the wrong one this Black Friday.</description>
    </item>
    <item>
      <title>T&#8209;Mobiles Apple bundle is an incredible Black Friday treat &#8212; get an iPhone, iPad, and Apple Watch for free</title>
      <link>https://mashable.com/article/black-friday-deal-2025-tmobile-apple-bundle</link>
      <pubDate>Wed, 26 Nov 2025 12:33:24 +0000</pubDate>
      <guid isPermaLink="false">04NX9UkpFCgeLBGGUNw7bjx</guid>
      <description>T-Mobile has dropped an Apple bundle that's offering new and existing customers, including businesses, the chance to get the iPhone 17 Pro, iPad (A16), and Apple Watch SE 3 for free.</description>
    </item>
    <item>
      <title>NordVPN Prime vs Proton Unlimited &#8211; which is the best premium VPN deal this Black Friday?</title>
      <link>https://www.techradar.com/vpn/vpn-services/nordvpn-prime-vs-proton-unlimited-which-is-the-best-premium-vpn-deal-this-black-friday</link>
      <pubDate>Wed, 26 Nov 2025 12:32:39 +0000</pubDate>
      <guid isPermaLink="false">zTkM7j4na8Fv4YEsgyARYb</guid>
      <description>If you want to spend big on your security, you must choose wisely</description>
    </item>
    <item>
      <title>ChatGPT&#8217;s voice mode just got a major upgrade &#8211; here are 5 things you need to know</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/chatgpts-voice-mode-just-got-a-major-upgrade-here-are-5-things-you-need-to-know</link>
      <pubDate>Wed, 26 Nov 2025 12:31:32 +0000</pubDate>
      <guid isPermaLink="false">emw9zRWszDtPxjKTqUiPFf</guid>
      <description>ChatGPT&#8217;s voice mode has been updated with some impressive new features &#8211; here's what's changed.</description>
    </item>
    <item>
      <title>Tired of Apple and Samsung phones? This Black Friday deal saves you &#163;100 on a fantastic Android alternative</title>
      <link>https://www.techradar.com/phones/oppo-phones/tired-of-apple-and-samsung-phones-this-black-friday-deal-saves-you-gbp100-on-a-fantastic-android-alternative</link>
      <pubDate>Wed, 26 Nov 2025 12:31:17 +0000</pubDate>
      <guid isPermaLink="false">PAKzHCzEh9NRqWNpfTFvDj</guid>
      <description>This fantastic iPhone alternative is barely a month old, but you can already save &#163;100 this Black Friday.</description>
    </item>
    <item>
      <title>14 Best Tablets (2025), Tested and Reviewed</title>
      <link>https://www.wired.com/gallery/the-best-tablets/</link>
      <pubDate>Wed, 26 Nov 2025 12:30:00 +0000</pubDate>
      <guid isPermaLink="false">5af4622ff2b84f222a2e5fc8</guid>
      <description>We&#8217;ve tested all the top slates, from Apple&#8217;s iPads to Android and Windows devices, and rounded up our favorites.</description>
    </item>
    <item>
      <title>Vous venez d&#8217;acheter un nouveau TV ? Voici comment avoir un meilleur rendu d&#8217;image</title>
      <link>https://www.frandroid.com/produits-android/2886709_vous-venez-dacheter-un-nouveau-tv-voici-comment-avoir-un-meilleur-rendu-dimage</link>
      <pubDate>Wed, 26 Nov 2025 12:28:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2886709_vous-venez-dacheter-un-nouveau-tv-voici-comment-avoir-un-meilleur-rendu-dimage</guid>
      <description>
Lorsqu&#8217;un t&#233;l&#233;viseur est allum&#233; pour la premi&#232;re fois, il est g&#233;n&#233;ralement configur&#233; sur un mode d&#8217;image comme Standard ou Dynamique, destin&#233; &#224; attirer l&#8217;&#339;il en magasin avec une luminosit&#233; tr&#232;s &#233;lev&#233;e, des couleurs satur&#233;es et un contraste forc&#233;. Mais c&#8217;est loin d&#8217;&#234;tre les meilleurs modes. Explications. &#160;
</description>
    </item>
    <item>
      <title>The best Black Friday controller deals under $50 &#8211; save big on Xbox, 8BitDo, and more</title>
      <link>https://www.techradar.com/gaming/the-best-black-friday-controller-deals-under-usd50-save-big-on-xbox-8bitdo-and-more</link>
      <pubDate>Wed, 26 Nov 2025 12:27:05 +0000</pubDate>
      <guid isPermaLink="false">4RBEGPNUZEVCoK9nejhHk</guid>
      <description>All the best Black Friday controllers deals I've spotted that you can buy for under $50.</description>
    </item>
    <item>
      <title>The Roomba Plus 505 Combo is down to its best-ever price for Black Friday &#8212; save over $400 at Amazon</title>
      <link>https://mashable.com/article/black-friday-deal-2025-irobot-roomba-plus-505</link>
      <pubDate>Wed, 26 Nov 2025 12:26:32 +0000</pubDate>
      <guid isPermaLink="false">05Agf58acHSFHlZbUANdndL</guid>
      <description>Get the best robot vacuum deal in Black Friday 2025. The Roomba Plus 505 is on sale for $549 in the Amazon Black Friday sale.</description>
    </item>
    <item>
      <title>Paul Mescal and Jessie Buckley reveal the real surprise in Hamnet</title>
      <link>https://mashable.com/video/hamnet-jessie-buckley-paul-mescal</link>
      <pubDate>Wed, 26 Nov 2025 12:26:11 +0000</pubDate>
      <guid isPermaLink="false">048VGn28Y3lWk52o4Z6YMde</guid>
      <description>Can you guess which scene from Chlo&#233; Zhao's heralded drama 
"Hamnet," starring Jessie Buckley and Paul Mescal, has some sharp reality to it?</description>
    </item>
    <item>
      <title>Ce vid&#233;oprojecteur triple laser aux contrastes saisissants perd 700 &#8364; chez Amazon pour la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2886153_ce-videoprojecteur-triple-laser-aux-contrastes-saisissants-perd-700-e-chez-amazon-pour-la-black-friday-week</link>
      <pubDate>Wed, 26 Nov 2025 12:24:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2886153_ce-videoprojecteur-triple-laser-aux-contrastes-saisissants-perd-700-e-chez-amazon-pour-la-black-friday-week</guid>
      <description>
Entre sa compatibilit&#233; avec le HDR, son triple laser, son mode jeu et son absence ou presque de bruit, le Valerion VisionMaster Pro est un projecteur haut de gamme, mais pour le rendre plus accessible, Amazon baisse son prix de 2 899 euros &#224; 2 299 euros. 
</description>
    </item>
    <item>
      <title>Skip the Black Friday sales and grab one of these refurbished Sage coffee makers instead</title>
      <link>https://www.techradar.com/home/coffee-machines/skip-the-black-friday-sales-and-grab-one-of-these-refurbished-sage-coffee-makers-instead</link>
      <pubDate>Wed, 26 Nov 2025 12:23:13 +0000</pubDate>
      <guid isPermaLink="false">2KGLrbxNnneRE2HsX6GC7F</guid>
      <description>Who needs Black Friday when you can get a premium espresso machine in nearly-new condition for hundreds of pounds less?</description>
    </item>
    <item>
      <title>Windows 11's Notepad gets support for tables and bolstered AI powers &#8211; and not everyone's happy</title>
      <link>https://www.techradar.com/computing/windows/windows-11s-notepad-gets-support-for-tables-and-bolstered-ai-powers-and-not-everyones-happy</link>
      <pubDate>Wed, 26 Nov 2025 12:22:13 +0000</pubDate>
      <guid isPermaLink="false">ejrccyc8o4A6xxwfEK2Xab</guid>
      <description>Microsoft continues to turn Windows 11's Notepad into WordPad after scrapping the latter app last year.</description>
    </item>
    <item>
      <title>The best dash cam 2025: we've tested the finest car cameras for every budget</title>
      <link>https://www.techradar.com/vehicle-tech/dash-cams/the-best-dash-cams</link>
      <pubDate>Wed, 26 Nov 2025 12:11:02 +0000</pubDate>
      <guid isPermaLink="false">DLLbYcBtHHgo3i9N7Dd6k8</guid>
      <description>Searching for the best dash cam for your car? We've rounded up the finest 4K, front-and-rear and budget choices around.</description>
    </item>
    <item>
      <title>Black Ops 7 is so cheap for right now, I think it's a mistake &#8211; act fast to grab this ridiculous discount</title>
      <link>https://www.techradar.com/seasonal-sales/black-ops-7-is-so-cheap-for-right-now-i-think-its-a-mistake-act-fast-to-grab-this-ridiculous-discount</link>
      <pubDate>Wed, 26 Nov 2025 12:08:53 +0000</pubDate>
      <guid isPermaLink="false">JTyxgxw9msMDdNFAAMTxMf</guid>
      <description>This Amazon lightning deal takes Black Ops 7 down to an incredibly low price, so grab it before it's gone.</description>
    </item>
    <item>
      <title>Best Black Friday iPhone deals 2025: I've hand-picked the biggest price cuts from Apple, Verizon, T-Mobile, and others</title>
      <link>https://www.techradar.com/phones/iphone/best-black-friday-iphone-deals-2025-ive-hand-picked-the-biggest-price-cuts-from-apple-verizon-t-mobile-and-others</link>
      <pubDate>Wed, 26 Nov 2025 12:07:06 +0000</pubDate>
      <guid isPermaLink="false">xvkY4zhxct8yvdzSiuvDB9</guid>
      <description>Looking to upgrade? Here's everything you need to know</description>
    </item>
    <item>
      <title>What&#8217;s the Deal With Hallorann&#8217;s Terrifying Box on &#8216;It: Welcome to Derry&#8217;?</title>
      <link>https://gizmodo.com/whats-the-deal-with-halloranns-terrifying-box-on-it-welcome-to-derry-2000691801</link>
      <pubDate>Wed, 26 Nov 2025 12:05:34 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000691801</guid>
      <description>The HBO show's star and co-creator shed some light on that eerie but enigmatic episode five plot point, as does 'Doctor Sleep,' the sequel to 'The Shining.'</description>
    </item>
    <item>
      <title>Save on PS Plus with these Black Friday PlayStation gift card deals</title>
      <link>https://www.techradar.com/gaming/save-on-ps-plus-with-these-black-friday-playstation-gift-card-deals</link>
      <pubDate>Wed, 26 Nov 2025 12:04:00 +0000</pubDate>
      <guid isPermaLink="false">uYGhFgYr9FDiBJk9BiRiqj</guid>
      <description>PlayStation gift cards are discounted at ShopTo for Black Friday, letting you pick up a PS Plus membership or games for less.</description>
    </item>
    <item>
      <title>Norton has cut antivirus prices this Black Friday by up to 80% - Great discounts for mobile, family, and small business protection available now</title>
      <link>https://www.techradar.com/pro/norton-has-cut-antivirus-prices-this-black-friday-by-up-to-80-percent-great-discounts-for-mobile-family-and-small-business-protection-available-now</link>
      <pubDate>Wed, 26 Nov 2025 12:03:00 +0000</pubDate>
      <guid isPermaLink="false">bX97D2jQE6aqGjPcXR6Mt4</guid>
      <description>Norton has slashed its prices this Black Friday, so snap up a great deal now.</description>
    </item>
    <item>
      <title>11 bargain printers with big Black Friday savings - these are the ones I reviewed and rated highest</title>
      <link>https://www.techradar.com/pro/11-bargain-printers-with-big-black-friday-savings-these-are-the-ones-i-reviewed-and-rated-highest</link>
      <pubDate>Wed, 26 Nov 2025 12:02:00 +0000</pubDate>
      <guid isPermaLink="false">4zjwgesAug4zUSZtQaEry7</guid>
      <description>I tested some great printers and multifunction devices this year, and I've found 11 of my favourites being heavily discounted  discounts for Black Friday.</description>
    </item>
    <item>
      <title>85+ Black Friday deals: We found record-low prices on AirPods, MacBooks, Samsung TVs, and Kindles</title>
      <link>https://mashable.com/article/best-black-friday-deals-macbooks-airpods-kindles-ninja-2025</link>
      <pubDate>Wed, 26 Nov 2025 12:00:37 +0000</pubDate>
      <guid isPermaLink="false">00MdR0iXrpNF9I9WIbxRfGz</guid>
      <description>Get the latest Black Friday deals on Apple products, vacuums, headphones, power stations, and Legos. Save $250 on a new Apple laptop and 27% on a new Kindle.</description>
    </item>
    <item>
      <title>Gizmodo Consumer Tech Reporter Kyle Barr&#8217;s 9 Favorite Board Games for People Who Need a Break From Tech</title>
      <link>https://gizmodo.com/gizmodo-staff-writer-kyle-barr-favorite-gifts-of-2025-2000691473</link>
      <pubDate>Wed, 26 Nov 2025 12:00:33 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000691473</guid>
      <description>There is no better time to get into the growing indie RPG and board game space.</description>
    </item>
    <item>
      <title>The Trump Administration&#8217;s Data Center Push Could Open the Door for New Forever Chemicals</title>
      <link>https://www.wired.com/story/the-trump-administrations-data-center-push-could-open-the-door-for-new-forever-chemicals/</link>
      <pubDate>Wed, 26 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">68f0f26d576040ebb4dfbc44</guid>
      <description>The EPA is prioritizing review of new chemicals to be used in data centers. Experts say this could lead to the fast approval of new types of forever chemicals&#8212;with limited oversight.</description>
    </item>
    <item>
      <title>First there was nothing, then there was Hoto and Fanttik</title>
      <link>https://www.theverge.com/report/829265/hoto-fanttik-profile-origins-xiaomi-aukey-tiktok</link>
      <pubDate>2025-11-26T07:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=829265</guid>
      <description>Hoto exists because someone got bored. CEO Lidan Liu, the company's founder and a notable industrial designer, tells The Verge she was tired of advising from her consultancy Designaffairs China. I have to build something on my own, she thought. And back then, she was spending a lot of time in her workshop surrounded by [&#8230;]</description>
    </item>
    <item>
      <title>Onton raises $7.5M to expand its AI-powered shopping site beyond furniture</title>
      <link>https://techcrunch.com/2025/11/26/onton-raises-7-5m-to-expand-its-ai-powered-shopping-site-beyond-furniture/</link>
      <pubDate>Wed, 26 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3070538</guid>
      <description>Onton, which change its name from Deft, is giving users an infinite canvas with AI-powered image generation to nudge them towards making quicker purchase decisions</description>
    </item>
    <item>
      <title>Vie num&#233;rique | Pour un Vendredi fou pas mal moins fou</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-11-26/vie-numerique/pour-un-vendredi-fou-pas-mal-moins-fou.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 26 Nov 2025 07:00:00 -0500</pubDate>
      <guid isPermaLink="false">7b89426ba21339068ce8998b523da971</guid>
      <description>Le Vendredi fou approche&#160;! La mar&#233;e de courriels promotionnels dans votre bo&#238;te de r&#233;ception en t&#233;moigne sans doute. Pourtant, la meilleure affaire technologique de l&#8217;ann&#233;e consiste probablement &#224; ne rien acheter ou &#224; acheter tr&#232;s peu. Voici comment am&#233;liorer votre vie num&#233;rique sans menacer votre dossier de cr&#233;dit.</description>
    </item>
    <item>
      <title>Ces smartphones nord-cor&#233;ens r&#233;v&#232;lent jusqu&#8217;o&#249; un r&#233;gime peut surveiller votre vie num&#233;rique</title>
      <link>https://www.01net.com/actualites/smartphones-nord-coreens-revelent-regime-peut-surveiller-vie-numerique.html</link>
      <pubDate>Wed, 26 Nov 2025 11:57:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311370</guid>
      <description>Un youtubeur a r&#233;ussi &#224; mettre la main sur deux smartphones nord-cor&#233;ens. Ce qu&#8217;il y a d&#233;couvert d&#233;passe largement la simple absence de Google ou de r&#233;seaux sociaux, et montre jusqu&#8217;o&#249; un r&#233;gime autoritaire peut aller pour contr&#244;ler tout ce que fait l'utilisateur.</description>
    </item>
    <item>
      <title>Fresh Meta Quest 4 rumors hint at specs, pricing, a more lightweight design &#8211; and even a new name</title>
      <link>https://www.techradar.com/computing/virtual-reality-augmented-reality/fresh-meta-quest-4-rumors-hint-at-specs-pricing-a-more-lightweight-design-and-even-a-new-name</link>
      <pubDate>Wed, 26 Nov 2025 11:55:44 +0000</pubDate>
      <guid isPermaLink="false">wbPApCon2Kj3JWepNexr5</guid>
      <description>Meta is planning on releasing a successor to the Meta Quest 3, and it sounds like we'll see some changes.</description>
    </item>
    <item>
      <title>Black Friday 2025: Live updates on the latest deals from Amazon, Target, Walmart, and more</title>
      <link>https://mashable.com/live/black-friday-live-deals-updates-amazon-target-walmart-2025</link>
      <pubDate>Wed, 26 Nov 2025 11:53:19 +0000</pubDate>
      <guid isPermaLink="false">07K5cH98cfqENnWlTb2iTIP</guid>
      <description>Get live updates on Black Friday sales. We found savings of $150 on Dyson Supersonic hair dryers, $300 off Samsung TVs, and record prices on AirPods.</description>
    </item>
  </channel>
</rss>
