<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 28 Jan 2026 11:27:11 GMT</lastBuildDate>
    <item>
      <title>Carrefour est g&#233;n&#233;reux pour la fin des soldes, mais voici les 11 deals qui valent le coup &#224; la derni&#232;re d&#233;marque</title>
      <link>https://www.frandroid.com/bons-plans/2941339_carrefour-est-genereux-pour-la-fin-des-soldes-mais-voici-les-11-deals-qui-valent-le-coup-a-la-derniere-demarque</link>
      <pubDate>Wed, 28 Jan 2026 11:23:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2941339_carrefour-est-genereux-pour-la-fin-des-soldes-mais-voici-les-11-deals-qui-valent-le-coup-a-la-derniere-demarque</guid>
      <description>
La derni&#232;re d&#233;marque est lanc&#233;e et Carrefour n'a pas dit son dernier mot pour brader un tas de produits Tech ! Que vous ayez envie d'une tablette, d'un nouveau TV ou d'un t&#233;l&#233;phone abordable, il y a de quoi vous faire plaisir ! 
</description>
    </item>
    <item>
      <title>Plus d&#8217;autonomie pour le m&#234;me prix : BMW am&#233;liore ses 2 voitures &#233;lectriques les plus accessibles</title>
      <link>https://www.frandroid.com/marques/bmw/2957917_plus-dautonomie-pour-le-meme-prix-bmw-ameliore-ses-2-voitures-electriques-les-plus-accessibles</link>
      <pubDate>Wed, 28 Jan 2026 11:22:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bmw/2957917_plus-dautonomie-pour-le-meme-prix-bmw-ameliore-ses-2-voitures-electriques-les-plus-accessibles</guid>
      <description>
BMW vient d'apporter quelques am&#233;liorations techniques &#224; ses voitures &#233;lectriques les plus vendues : l'iX1 et l'iX2, sa d&#233;clinaison coup&#233;. Les deux SUV d&#233;passent les 500 km d'autonomie gr&#226;ce &#224; une consommation en baisse... mais leurs concurrents font souvent mieux.
</description>
    </item>
    <item>
      <title>Alumium OS&#160;: Google d&#233;voile par erreur l&#8217;interface de son &#171;&#160;Android pour PC&#160;&#187;</title>
      <link>https://www.01net.com/actualites/alumium-os-google-devoile-par-erreur-linterface-de-son-android-pour-pc.html</link>
      <pubDate>Wed, 28 Jan 2026 11:19:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322944</guid>
      <description>Les premi&#232;res images de l&#8217;interface du rempla&#231;ant de Chrome OS ont fuit&#233; en ligne. Voici &#224; quoi ressemblera le futur syst&#232;me d&#8217;exploitation pour PC de Google.</description>
    </item>
    <item>
      <title>Utiliser votre Galaxy S26 m&#234;me sans r&#233;seau mobile ? Ce sera possible, mais pas pour tout le monde</title>
      <link>https://www.frandroid.com/marques/samsung/2957889_utiliser-votre-galaxy-s26-meme-sans-reseau-mobile-ce-sera-possible-mais-pas-pour-tout-le-monde</link>
      <pubDate>Wed, 28 Jan 2026 11:19:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2957889_utiliser-votre-galaxy-s26-meme-sans-reseau-mobile-ce-sera-possible-mais-pas-pour-tout-le-monde</guid>
      <description>
&#192; quelques semaines de leur pr&#233;sentation officielle, les futurs Samsung Galaxy S26 ont d&#233;j&#224; &#233;t&#233; certifi&#233;s aux &#201;tats-Unis. L'occasion d'en d&#233;couvrir davantage sur leur connectivit&#233; compatible avec le satellite. 
</description>
    </item>
    <item>
      <title>Windows 11&amp;#8217;s ability to resume Android apps on your PC is getting closer</title>
      <link>https://www.theverge.com/news/869161/microsoft-windows-11-android-app-resume-feature-release-preview</link>
      <pubDate>2026-01-28T06:18:36-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=869161</guid>
      <description>Microsoft is getting ready to improve Windows 11's ability to resume Android apps on a PC. The software giant first introduced its cross-device resume last year, letting Windows 11 users resume OneDrive sessions from their Android device on a PC. Now, it's expanding this to Spotify playback, browsing sessions, and more. The improved cross-device resume [&#8230;]...</description>
    </item>
    <item>
      <title>Astronomers used AI to find 1,400 &#8216;anomalous objects&#8217; from Hubble archives</title>
      <link>https://www.theverge.com/news/869182/astronomers-ai-discover-cosmic-anomalies-hubble-archives</link>
      <pubDate>2026-01-28T06:15:37-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=869182</guid>
      <description>A pair of astronomers at the European Space Agency (ESA) discovered more than 800 previously undocumented "astrophysical anomalies" hiding in Hubble's archives. To do so, researchers David O'Ryan and Pablo G&#243;mez trained an AI model to comb through Hubble's 35-year dataset, hunting for strange objects and flagging them for manual review. It's "a treasure trove [&#8230;]...</description>
    </item>
    <item>
      <title>L&#8217;IA rafle tout : ce g&#233;ant de la m&#233;moire a d&#233;j&#224; vendu toute sa production pour 2026</title>
      <link>https://www.frandroid.com/produits-android/hardware/memoire/2957545_lia-rafle-tout-ce-geant-de-la-memoire-a-deja-vendu-toute-sa-production-pour-2026</link>
      <pubDate>Wed, 28 Jan 2026 11:09:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/memoire/2957545_lia-rafle-tout-ce-geant-de-la-memoire-a-deja-vendu-toute-sa-production-pour-2026</guid>
      <description>
SK Hynix, l'un des principaux fournisseurs de m&#233;moire du monde, d&#233;voile des r&#233;sultats records pour l'ann&#233;e 2025. Et au vu de la situation actuelle du march&#233;, cela ne fait que commencer. 
</description>
    </item>
    <item>
      <title>Google lance l&#8217;alerte : si vous avez WinRAR, supprimez-le vite</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/2957921_google-lance-lalerte-si-vous-avez-winrar-supprimez-le-vite</link>
      <pubDate>Wed, 28 Jan 2026 11:04:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/2957921_google-lance-lalerte-si-vous-avez-winrar-supprimez-le-vite</guid>
      <description>
Google a d&#233;couvert une faille de s&#233;curit&#233; dans WinRAR activement utilis&#233;e. Il est temps de changer de logiciel.
</description>
    </item>
    <item>
      <title>Google ajoute de nouveaux antivols pour les smartphones Android</title>
      <link>https://www.frandroid.com/marques/google/2957607_google-ajoute-de-nouveaux-antivols-pour-les-smartphones-android</link>
      <pubDate>Wed, 28 Jan 2026 11:03:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2957607_google-ajoute-de-nouveaux-antivols-pour-les-smartphones-android</guid>
      <description>
Les &#233;quipes de Google travaillent sur de nouvelles solutions de s&#233;curit&#233; pour &#233;viter la r&#233;cup&#233;ration de donn&#233;es sensibles lors du vol d&#8217;un smartphone.
</description>
    </item>
    <item>
      <title>C&#8217;est officiel&#160;: le Galaxy S26 Ultra aura une fonction unique qu&#8217;aucun autre smartphone ne poss&#232;de</title>
      <link>https://www.01net.com/actualites/cest-officiel-le-galaxy-s26-ultra-aura-une-fonction-unique-quaucun-autre-smartphone-ne-possede.html</link>
      <pubDate>Wed, 28 Jan 2026 11:02:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322930</guid>
      <description>Samsung confirme enfin l'atout ma&#238;tre du Galaxy S26 Ultra. Gr&#226;ce &#224; une technologie d'&#233;cran in&#233;dite, votre smartphone deviendra illisible pour vos voisins de m&#233;tro, sans avoir besoin d'ajouter un filtre adh&#233;sif.</description>
    </item>
    <item>
      <title>Razer : pourquoi vous allez (enfin) pouvoir d&#233;sinstaller le logiciel Synapse de votre PC</title>
      <link>https://www.frandroid.com/marques/razer/2957919_razer-pourquoi-vous-allez-enfin-pouvoir-desinstaller-le-logiciel-synapse-de-votre-pc</link>
      <pubDate>Wed, 28 Jan 2026 11:00:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/razer/2957919_razer-pourquoi-vous-allez-enfin-pouvoir-desinstaller-le-logiciel-synapse-de-votre-pc</guid>
      <description>
Razer vient d'annoncer une version web pour son logiciel Synapse, afin de param&#233;trer votre souris, clavier ou casque directement depuis votre navigateur.
</description>
    </item>
    <item>
      <title>A North Atlantic Right Whale Baby Boom Is On&#8212;but the Species Remains at Risk</title>
      <link>https://www.wired.com/story/a-north-atlantic-right-whale-baby-boom-is-on-but-the-species-remains-at-risk/</link>
      <pubDate>Wed, 28 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">69779710f3f038d7e9fc98cd</guid>
      <description>Researchers have documented the births of nearly two dozen North Atlantic right whale calves this season. It&#8217;s an encouraging sign for a species whose population is estimated to be below 400.</description>
    </item>
    <item>
      <title>Self-driving truck startup Waabi is teaming up with Uber on robotaxis</title>
      <link>https://www.theverge.com/news/868535/waabi-robotaxi-uber-fundraising-self-driving-truck</link>
      <pubDate>2026-01-28T06:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=868535</guid>
      <description>Waabi, the Toronto-based autonomous trucking startup, is expanding its portfolio to include robotaxis. And it's bringing Uber along for the ride. Raquel Urtasun, the former chief scientist at Uber's now defunct Advanced Technologies Group, founded Waabi in 2021 to be a more "AI-centric approach" to autonomous vehicles. That approach initially focused on trucking, with Waabi [&#8230;]...</description>
    </item>
    <item>
      <title>Waabi raises $1B and expands into robotaxis with Uber</title>
      <link>https://techcrunch.com/2026/01/28/waabi-raises-1b-and-expands-into-robotaxis-with-uber/</link>
      <pubDate>Wed, 28 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3087051</guid>
      <description>Waabi has secured a $750 million Series C round to accelerate autonomous trucking, and another roughly $250 million commitment from Uber to deploy 25,000 robotaxis exclusively on its platform.</description>
    </item>
    <item>
      <title>Le PDG d&#8217;Anthropic rejoint le club des experts que l&#8217;IA angoisse</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-01-28/le-pdg-d-anthropic-rejoint-le-club-des-experts-que-l-ia-angoisse.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 28 Jan 2026 06:00:00 -0500</pubDate>
      <guid isPermaLink="false">0907b3e5c3223f87a4f90ec0a97b1410</guid>
      <description>&#171;&#160;Nous sommes bien plus pr&#232;s du danger en 2026 qu&#8217;en 2023.&#160;&#187; C&#8217;est ce qu&#8217;affirme dans un long billet de blogue le PDG d&#8217;Anthropic, Dario Amodei, un des dirigeants les plus influents du secteur mondial de l&#8217;intelligence artificielle. Il s&#8217;inqui&#232;te que les mod&#232;les actuels d&#8217;IA deviendront bient&#244;t si puissants que l&#8217;humanit&#233; pourrait en perdre la ma&#238;trise....</description>
    </item>
    <item>
      <title>Sennheiser's cheap new USB-C headphones and earbuds mean you have no excuse for not listening in glorious Hi-Res Audio everywhere</title>
      <link>https://www.techradar.com/audio/headphones/sennheisers-cheap-new-usb-c-headphones-and-earbuds-mean-you-have-no-excuse-for-not-listening-in-glorious-hi-res-audio-everywhere</link>
      <pubDate>Wed, 28 Jan 2026 10:54:47 +0000</pubDate>
      <guid isPermaLink="false">Bj6dxYVYdR4HheiSwEWYU8</guid>
      <description>Sennheiser gives its affordable in- and over-ears a USB-C boost</description>
    </item>
    <item>
      <title>Tim Cook had &#8216;a good conversation&#8217; with Trump about deescalation</title>
      <link>https://www.theverge.com/news/869155/apple-tim-cook-president-trump-deescalate-minneapolis</link>
      <pubDate>2026-01-28T05:52:14-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=869155</guid>
      <description>Apple CEO Tim Cook has spoken out about "the events in Minneapolis" after federal agents shot and killed another protester over the weekend, telling employees that he has shared his feelings with President Trump. In an internal memo reported by Bloomberg, Cook said that "this is a time for deescalation," and that he had "a [&#8230;]</description>
    </item>
    <item>
      <title>Amazon casse les prix &#224; la derni&#232;re d&#233;marque : voici les promos &#224; ne pas louper avant la fin des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2933045_amazon-casse-les-prix-a-la-derniere-demarque-voici-les-promos-a-ne-pas-louper-avant-la-fin-des-soldes</link>
      <pubDate>Wed, 28 Jan 2026 10:48:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933045_amazon-casse-les-prix-a-la-derniere-demarque-voici-les-promos-a-ne-pas-louper-avant-la-fin-des-soldes</guid>
      <description>
Les soldes d&#8217;hiver prennent fin dans une semaine et pour cette derni&#232;re d&#233;marque, Amazon fait encore de belles offres. Pour vous faciliter la t&#226;che, nous avons d&#233;nich&#233; les meilleures offres Tech &#224; saisir avant la fin de l&#8217;&#233;v&#232;nement.
</description>
    </item>
    <item>
      <title>Focal Azurys : cet &#233;l&#233;gant casque Hi-Fi made in France passe &#224; moiti&#233; prix pour la derni&#232;re d&#233;marque des soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2868043_focal-azurys-cet-elegant-casque-hi-fi-made-in-france-passe-a-moitie-prix-pour-la-derniere-demarque-des-soldes-dhiver</link>
      <pubDate>Wed, 28 Jan 2026 10:44:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2868043_focal-azurys-cet-elegant-casque-hi-fi-made-in-france-passe-a-moitie-prix-pour-la-derniere-demarque-des-soldes-dhiver</guid>
      <description>
Un casque hi-fi ferm&#233;, fabriqu&#233; en France, qui m&#234;le savoir-faire artisanal et transducteurs maison, c&#8217;est l&#8217;Azurys : une &#233;l&#233;gance sign&#233;e Focal. Et pour cette fin des soldes d'hiver 2026, il se permet une coupe en deux dans son tarif, passant de 549 euros &#224; 279 euros gr&#226;ce &#224; un code promo. 
</description>
    </item>
    <item>
      <title>How secure is your business really? New survey claims 90% of enterprise AI systems could be breached within 90 minutes</title>
      <link>https://www.techradar.com/pro/security/how-secure-is-your-business-really-new-survey-claims-90-percent-of-enterprise-ai-systems-could-be-breached-within-90-minutes</link>
      <pubDate>Wed, 28 Jan 2026 10:39:43 +0000</pubDate>
      <guid isPermaLink="false">9mmoKUBgP7NCctBqo4qWUf</guid>
      <description>Businesses are rushing to introduce AI, leaving the back doors wide open for cybercriminals and nation-state actors.</description>
    </item>
    <item>
      <title>What is the release date for Bridgerton season 4 part 1 on Netflix?</title>
      <link>https://www.techradar.com/streaming/netflix/bridgerton-season-4-part-1-release-date-time</link>
      <pubDate>Wed, 28 Jan 2026 10:35:38 +0000</pubDate>
      <guid isPermaLink="false">yRBkFzg4UAfVewXjyGpZLn</guid>
      <description>It's almost time for Benedict to try and find love in new episodes of Netflix's biggest period drama, but when is Bridgerton season 4 part 1 going to arrive?</description>
    </item>
    <item>
      <title>The Daily Show mocks Newsmax for reaction to deadly ICE shooting</title>
      <link>https://mashable.com/video/daily-show-newsmax-ice-shooting-alex-pretti</link>
      <pubDate>Wed, 28 Jan 2026 10:34:28 +0000</pubDate>
      <guid isPermaLink="false">05JXqhfpaSzqpoeDqUzrHut</guid>
      <description>"The Daily Show" host Desi Lydic has mocked Newsmax presenter Greg Kelly for his response to ICE's deadly shooting of Alex Pretti.</description>
    </item>
    <item>
      <title>Windows 11&#160;: Microsoft pourrait bien &#234;tre oblig&#233; de revoir son nouveau menu D&#233;marrer</title>
      <link>https://www.01net.com/actualites/windows-11-microsoft-pourrait-bien-etre-oblige-de-revoir-son-nouveau-menu-demarrer.html</link>
      <pubDate>Wed, 28 Jan 2026 10:33:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322919</guid>
      <description>Le nouveau menu D&#233;marrer de Windows 11 ne fait pas l&#8217;unanimit&#233;. Interpell&#233; par les utilisateurs quant &#224; l&#8217;impossibilit&#233; d&#8217;organiser manuellement les cat&#233;gories, Microsoft indique &#234;tre &#224; l&#8217;&#233;coute des critiques.</description>
    </item>
    <item>
      <title>Ted Lasso season 4 gets big release-window update from Apple &#8212; and we don't have long to wait until we can believe in the hit Apple TV show again</title>
      <link>https://www.techradar.com/streaming/apple-tv-plus/ted-lasso-season-4-gets-big-release-window-update-from-apple-and-we-dont-have-long-to-wait-until-we-can-believe-in-the-hit-apple-tv-show-again</link>
      <pubDate>Wed, 28 Jan 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">cSR9YTmhJWzm69Fm6zN7qR</guid>
      <description>Apple has tentatively confirmed when Ted Lasso season 4 will be released &#8212; and revealed a first look at his new assistant coach.</description>
    </item>
    <item>
      <title>Les meilleures offres tombent pour la derni&#232;re d&#233;marque des soldes d&#8217;hiver : voici le TOP 25</title>
      <link>https://www.frandroid.com/bons-plans/2957561_les-meilleures-offres-tombent-pour-la-derniere-demarque-des-soldes-dhiver-voici-le-top-25</link>
      <pubDate>Wed, 28 Jan 2026 10:29:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2957561_les-meilleures-offres-tombent-pour-la-derniere-demarque-des-soldes-dhiver-voici-le-top-25</guid>
      <description>
Il ne faut pas se le cacher, la derni&#232;re d&#233;marque des soldes est souvent le moment o&#249; l'on trouve les meilleures offres, car les e-commer&#231;ants comme Amazon, Fnac, Darty ou encore Boulanger veulent &#233;couler les derniers stocks. Avec cet article, vous serez s&#251;rs de ne manquer aucun deal Tech int&#233;ressant. 
</description>
    </item>
    <item>
      <title>Voici le plan de Lucid pour concurrencer le Tesla Model Y, le Rivian R2&#8230; et sauver sa peau</title>
      <link>https://www.frandroid.com/marques/2957855_voici-le-plan-de-lucid-pour-concurrencer-le-tesla-model-y-le-rivian-r2-et-sauver-sa-peau</link>
      <pubDate>Wed, 28 Jan 2026 10:26:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2957855_voici-le-plan-de-lucid-pour-concurrencer-le-tesla-model-y-le-rivian-r2-et-sauver-sa-peau</guid>
      <description>
Lucid fabrique parmi les meilleures voitures &#233;lectriques du monde, mais perd une fortune sur chaque exemplaire vendu. Le salut passera par un SUV compact &#224; 50 000 euros capable de tenir t&#234;te &#224; Tesla.
</description>
    </item>
    <item>
      <title>Tout un symbole : en 2025, la Xiaomi SU7 a d&#233;tr&#244;n&#233; la Tesla Model 3 en Chine</title>
      <link>https://www.frandroid.com/marques/xiaomi/2957589_tout-un-symbole-en-2025-la-xiaomi-su7-a-detrone-la-tesla-model-3-en-chine</link>
      <pubDate>Wed, 28 Jan 2026 10:25:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2957589_tout-un-symbole-en-2025-la-xiaomi-su7-a-detrone-la-tesla-model-3-en-chine</guid>
      <description>
Avec plus de 258 000 exemplaires vendus en 2025, la Xiaomi SU7 a battu la Tesla Model 3 en Chine. La voiture &#233;lectrique asiatique confirme son leadership sur son march&#233; natal, alors que la firme d&#8217;Elon Musk voit ses immatriculations chuter.
</description>
    </item>
    <item>
      <title>&#171;&#160;Linux est notre prochaine grande fronti&#232;re&#160;&#187; : GOG pr&#233;pare enfin une nouvelle version de son application</title>
      <link>https://www.frandroid.com/produits-android/console/2957741_linux-est-notre-prochaine-grande-frontiere-gog-prepare-enfin-une-nouvelle-version-de-son-application</link>
      <pubDate>Wed, 28 Jan 2026 10:20:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2957741_linux-est-notre-prochaine-grande-frontiere-gog-prepare-enfin-une-nouvelle-version-de-son-application</guid>
      <description>
La plateforme de jeu r&#233;tro et ind&#233;pendante GOG va elle aussi miser sur Linux en 2026 alors qu'une version native est visiblement en projet.
</description>
    </item>
    <item>
      <title>How to monetize your brand with print-on-demand</title>
      <link>https://www.techradar.com/pro/software-services/how-to-monetize-your-brand-with-print-on-demand</link>
      <pubDate>Wed, 28 Jan 2026 10:15:18 +0000</pubDate>
      <guid isPermaLink="false">RMUxiEWFAPDvmBbhC2BVKD</guid>
      <description>Print-on-demand services let you sell custom merchandise without inventory costs. Here's how to set it up with integrated website builder features.</description>
    </item>
    <item>
      <title>Boulanger met le paquet pour la derni&#232;re d&#233;marque des soldes avec de belles promotions</title>
      <link>https://www.frandroid.com/bons-plans/2931541_boulanger-met-le-paquet-pour-la-derniere-demarque-des-soldes-avec-de-belles-promotions</link>
      <pubDate>Wed, 28 Jan 2026 10:14:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931541_boulanger-met-le-paquet-pour-la-derniere-demarque-des-soldes-avec-de-belles-promotions</guid>
      <description>
Les soldes d'hiver touchent bient&#244;t &#224; leur fin ! Pour la derni&#232;re d&#233;marque, Boulanger ne l&#233;sine pas sur les offres : enceinte bluetooth, &#233;cran gaming g&#233;ant de 40", nouveau Redmi Note 15 en promo... Il y a de quoi se faire plaisir, mais plus pour longtemps. 
</description>
    </item>
    <item>
      <title>Oops &#8212; Walmart may just have leaked a couple of banger GameCube games for Nintendo Switch Online</title>
      <link>https://www.techradar.com/gaming/oops-walmart-may-just-have-leaked-a-couple-of-banger-gamecube-games-for-nintendo-switch-online</link>
      <pubDate>Wed, 28 Jan 2026 10:14:30 +0000</pubDate>
      <guid isPermaLink="false">pjtnLmXwhcjnq5rPvt8g8o</guid>
      <description>Two upcoming GameCube titles for Nintendo Switch Online may just have leaked courtesy of Walmart &#8212; and they're among the console's very best.</description>
    </item>
    <item>
      <title>HBO Max en f&#233;vrier 2026 : l&#8217;hiver va &#234;tre chaud avec ce catalogue ! Voici les films et s&#233;ries &#224; ne pas manquer</title>
      <link>https://www.frandroid.com/services/svod/2957555_hbo-max-en-fevrier-2026-lhiver-va-etre-chaud-avec-ce-catalogue-voici-les-films-et-series-a-ne-pas-manquer</link>
      <pubDate>Wed, 28 Jan 2026 10:11:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2957555_hbo-max-en-fevrier-2026-lhiver-va-etre-chaud-avec-ce-catalogue-voici-les-films-et-series-a-ne-pas-manquer</guid>
      <description>
HBO Max vient de d&#233;voiler son catalogue de f&#233;vrier et &#231;a ne manque pas de piquant entre la s&#233;rie-&#233;v&#233;nement Heated Rivalry et le retour de la s&#233;rie produite par Salma Hayek, Chocolat amer. Voici tout ce qu'il ne faut pas manquer ce mois-ci.
</description>
    </item>
    <item>
      <title>6 milliards d&#8217;identifiants et de mots de passe pirat&#233;s&#160;: une base massive de donn&#233;es est apparue sur le dark web</title>
      <link>https://www.01net.com/actualites/6-milliards-identifiants-mots-passe-pirates-base-massive-donnees-apparue-dark-web.html</link>
      <pubDate>Wed, 28 Jan 2026 10:11:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322910</guid>
      <description>Une gigantesque base de donn&#233;es vol&#233;es a &#233;t&#233; d&#233;couverte sur le dark web. Le r&#233;pertoire est compos&#233; de six milliards d'identifiants, dont de nombreux mots de passe recycl&#233;s par les internautes. On y trouve notamment des donn&#233;es appartenant &#224; des comptes de Fran&#231;ais, dont des comptes li&#233;s au gouvernement&#8230;</description>
    </item>
    <item>
      <title>The 55-inch Sony Bravia 3 TV is on sale at Amazon &#8212; save over $100 ahead of the Winter Olympics</title>
      <link>https://mashable.com/article/jan-28-sony-bravia-3-deal</link>
      <pubDate>Wed, 28 Jan 2026 10:07:22 +0000</pubDate>
      <guid isPermaLink="false">01AJHMvKFBs7ItTc8AydvwI</guid>
      <description>Find the best TV deal at Amazon. Save 22% on the Sony 55-inch Bravia 3 TV at Amazon.</description>
    </item>
    <item>
      <title>TCL QM6K mini LED review: An impressive TV between the super cheap and super expensive</title>
      <link>https://mashable.com/review/tcl-qm6k-tv-review</link>
      <pubDate>Wed, 28 Jan 2026 10:05:00 +0000</pubDate>
      <guid isPermaLink="false">00etQWFU7LJL9WjRBNw7Xiy</guid>
      <description>The TCL QM6K is frequently dubbed the best budget QLED TV. I tested it at home for months, replacing my old 2019 LED TV.</description>
    </item>
    <item>
      <title>The best robot vacuums on a budget for 2026</title>
      <link>https://www.engadget.com/home/smart-home/best-budget-robot-vacuums-133030847.html?src=rss</link>
      <pubDate>Wed, 28 Jan 2026 10:01:28 +0000</pubDate>
      <guid isPermaLink="false">2efe7003-0f06-49dd-bf75-650fb81c222c</guid>
      <description>If vacuuming is your least favorite chore, employing a robot vacuum can save you time and stress while also making sure your home stays clean. While once most robo-vacs landed on the higher end of the price spectrum, that&#8217;s not the case anymore. Sure, you could pick up a $1,000 cleaning behemoth with mopping features, but it would be incorrect to assume that you need to spend that much money to get a good machine.Now, you can get an autonomous dirt-sucker with serious cleaning chops for $500 &#8212; sometimes even $300 or less. But you get what you pay for in this space; don&#8217;t expect affordable robo...</description>
    </item>
    <item>
      <title>The UK government gets it spectacularly wrong on AI &#8211; just 3% of the public agree with its stance on copyright law changes</title>
      <link>https://www.techradar.com/ai-platforms-assistants/the-uk-government-gets-it-spectacularly-wrong-on-ai-just-3-percent-of-the-public-agree-with-its-stance-on-copyright-law-changes</link>
      <pubDate>Wed, 28 Jan 2026 10:00:47 +0000</pubDate>
      <guid isPermaLink="false">tm6JyQNvVE6ij8sDxBrK5V</guid>
      <description>A major public consultation revealed overwhelming opposition to the UK government's AI copyright proposal</description>
    </item>
    <item>
      <title>Google pitches Gemini to students studying for India&#8217;s most competitive college entrance exam</title>
      <link>https://techcrunch.com/2026/01/28/google-turns-gemini-toward-indias-most-competitive-entrance-exam/</link>
      <pubDate>Wed, 28 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3087102</guid>
      <description>Google's launch of practice tests for JEE follows its recent move to offer full-length SAT practice tests in Gemini.</description>
    </item>
    <item>
      <title>Why Yann LeCun left Meta, and what it means for AI&#8217;s next frontier</title>
      <link>https://www.fastcompany.com/91480216/why-yann-lecun-left-meta-and-what-it-means-for-ais-next-frontier</link>
      <pubDate>2026-01-28T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480216/why-yann-lecun-left-meta-and-what-it-means-for-ais-next-frontier</guid>
      <description>The move underscores a deep intellectual rift about the future of AI: Should we pursue systems that understand the world or merely echo it?
When one of the founders of modern AI walks away from one of the world&#8217;s most powerful tech companies to start something new, the industry should pay attention.</description>
    </item>
    <item>
      <title>TikTok is tracking you now. Here&#8217;s how to protect yourself</title>
      <link>https://www.fastcompany.com/91480996/tiktok-privacy-data-collection-policy-track-target-advertising-ai-location-protect-yourself</link>
      <pubDate>2026-01-28T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480996/tiktok-privacy-data-collection-policy-track-target-advertising-ai-location-protect-yourself</guid>
      <description>TikTok, under new ownership, is monitoring your physical location, internet activity, and anything you upload into its AI. It&#8217;s time to put some shields up.
TikTok&#8217;s U.S. operations are now managed by a new American joint venture, ending a long-standing debate over whether the app would be permanently banned in the United States. The good news for TikTok users is that this deal guarantees that the app will continue to operate within America&#8217;s borders....</description>
    </item>
    <item>
      <title>EVs just outsold gas cars in Europe for the first time</title>
      <link>https://www.fastcompany.com/91481868/evs-just-outsold-gas-cars-in-europe-for-the-first-time</link>
      <pubDate>2026-01-28T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91481868/evs-just-outsold-gas-cars-in-europe-for-the-first-time</guid>
      <description>Last month, EV registrations in Europe overtook gas cars&#8212;even as Tesla quickly lost market share.
EVs hit a new milestone: In December, buyers in Europe registered more electric cars than gas cars for the first time.</description>
    </item>
    <item>
      <title>Samsung Galaxy XR review: A great Vision Pro alternative, but for whom?</title>
      <link>https://mashable.com/review/galaxy-xr-headset</link>
      <pubDate>Wed, 28 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">0389mXKlmCxHWqHBV6n1trM</guid>
      <description>Samsung teased the Galaxy XR for years, and it offers many of the same features as the Apple Vision Pro for half the price. But it's still too expensive.</description>
    </item>
    <item>
      <title>The DJI Mini 5 Pro Fly More Combo is down to its best-ever price at Amazon &#8212; save $500 right now</title>
      <link>https://mashable.com/article/jan-28-dji-mini-5-pro-combo-deal</link>
      <pubDate>Wed, 28 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">06F9j5kwIC8Kt1vARaui8xg</guid>
      <description>The DJI Mini 5 Pro Fly More Combo is on sale at Amazon for $1,099, down from the normal price of $1,599. That's a 31% discount.</description>
    </item>
    <item>
      <title>Clawdbot users are snapping up the Mac Mini &#8212; buy now for under $500 at Amazon</title>
      <link>https://mashable.com/article/jan-28-apple-mac-mini-deal</link>
      <pubDate>Wed, 28 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">06uSgcPuSkch3GbcvSpHI0K</guid>
      <description>The M4 Mac Mini is on sale at Amazon for $499, down from the normal price of $599. That's a 17% discount.</description>
    </item>
    <item>
      <title>Artemis 2 mission timeline: An itinerary for the historic 10-day flight</title>
      <link>https://mashable.com/article/artemis-2-mission-timeline-itinerary</link>
      <pubDate>Wed, 28 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">006DA1QuwK4tFpQIwmibhL7</guid>
      <description>NASA plans to launch four astronauts on Artemis 2, a 10-day flight around the moon and back. These will be their day-to-day activities.</description>
    </item>
    <item>
      <title>Everything Taskmaster Live taught us about the show</title>
      <link>https://mashable.com/article/taskmaster-us-tour-2026</link>
      <pubDate>Wed, 28 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">03ODr8DRg4L6uvElzvkYobJ</guid>
      <description>Greg Davies and Alex Horne reveals secrets, controversies, and some saucy hot pants.</description>
    </item>
    <item>
      <title>Introduce screen time gently with this Montessori-inspired kids app</title>
      <link>https://mashable.com/article/jan-28-pok-pok-lifetime-subscription</link>
      <pubDate>Wed, 28 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00cA5gwbeUO3Cy4zQYQl0XA</guid>
      <description>Introduce your kids to screen time safely with this lifetime subscription to Pok Pok, on sale for just $44.97 with code PLAY through Feb. 15.</description>
    </item>
    <item>
      <title>Lego has dropped more Star Wars Smart Play sets, including a Millennium Falcon: Where to buy</title>
      <link>https://mashable.com/article/lego-star-wars-smart-play-sets-millennium-falcon-preorder</link>
      <pubDate>Wed, 28 Jan 2026 09:50:52 +0000</pubDate>
      <guid isPermaLink="false">019YpeXPJtpU7twHklbVN6e</guid>
      <description>Lego has unveiled five new Star Wars Smart Play compatible sets. They're now available for preorder starting at $40.</description>
    </item>
    <item>
      <title>The Anker Solix C1000 power station is on sale for $429 at Amazon &#8212; save over $300</title>
      <link>https://mashable.com/article/jan-28-anker-solix-power-station-deal</link>
      <pubDate>Wed, 28 Jan 2026 09:49:58 +0000</pubDate>
      <guid isPermaLink="false">00fhI0TKgICWNH7oUxZv0ee</guid>
      <description>Find the best power station deal at Amazon. Save 46% on the Anker Solix C1000 at Amazon.</description>
    </item>
    <item>
      <title>The EcoFlow Delta 2 power station has dropped to its lowest-ever price at Amazon &#8212; save over $90</title>
      <link>https://mashable.com/article/jan-28-ecoflow-delta-max-2-power-station-deal</link>
      <pubDate>Wed, 28 Jan 2026 09:47:33 +0000</pubDate>
      <guid isPermaLink="false">04eIj52UFIs4jJICX5M8Kb4</guid>
      <description>Get the best portable power station deal. Save 19% on the EcoFlow Delta 2 at Amazon.</description>
    </item>
    <item>
      <title>Payer pour incliner son si&#232;ge&#160;? Face au toll&#233;, cette compagnie a&#233;rienne fait machine arri&#232;re</title>
      <link>https://www.01net.com/actualites/payer-pour-incliner-siege-face-tolle-compagnie-aerienne-fait-machine-arriere.html</link>
      <pubDate>Wed, 28 Jan 2026 09:45:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322913</guid>
      <description>Face &#224; la fronde massive des voyageurs sur les r&#233;seaux sociaux, la compagnie low cost WestJet renonce finalement &#224; ses si&#232;ges non inclinables.</description>
    </item>
    <item>
      <title>How to watch Shelton vs. Sinner online for free</title>
      <link>https://mashable.com/article/shelton-sinner-australian-open-2026-live-stream-for-free</link>
      <pubDate>Wed, 28 Jan 2026 09:45:02 +0000</pubDate>
      <guid isPermaLink="false">00h70en5Pw1tyBQtNjXuxbr</guid>
      <description>Watch Australian Open for free. Live stream Shelton vs. Sinner in the 2026 Australian Open online for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Grado's S750 open-back wired headphones offer crystal clarity and a wide soundstage, but the fit isn't a hit</title>
      <link>https://www.techradar.com/audio/headphones/grado-signature/s750/review</link>
      <pubDate>Wed, 28 Jan 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">Yjpst956BfUpQPwCJ2z5MF</guid>
      <description>Grado's new B cushion brings you closer to the music for a superb soundtrack</description>
    </item>
    <item>
      <title>How K-12 schools are left on their&#160;own to develop AI policies</title>
      <link>https://www.fastcompany.com/91479517/k-12-schools-are-left-on-their-own-to-develop-ai-policies</link>
      <pubDate>2026-01-28T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91479517/k-12-schools-are-left-on-their-own-to-develop-ai-policies</guid>
      <description>Education policymakers have raised ethical concerns about AI, including student safety, data privacy, and negative impacts on student learning.
Generative artificial intelligence technology is rapidly reshaping education in unprecedented ways. With its potential benefits and risks, K-12 schools are actively trying to adapt teaching and learning.</description>
    </item>
  </channel>
</rss>
