<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 05 Jan 2026 08:40:02 GMT</lastBuildDate>
    <item>
      <title>Prix des smartphones Samsung : une hausse &#171;&#160;in&#233;vitable&#160;&#187; confirm&#233;e par le patron</title>
      <link>https://www.frandroid.com/marques/samsung/2927417_prix-des-smartphones-samsung-une-hausse-inevitable-confirmee-par-le-patron</link>
      <pubDate>Mon, 05 Jan 2026 08:32:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2927417_prix-des-smartphones-samsung-une-hausse-inevitable-confirmee-par-le-patron</guid>
      <description>
Samsung a perdu sa couronne face &#224; Apple en 2025, et &#231;a ne leur pla&#238;t pas. La r&#233;ponse ? Une alliance massive avec Google pour propulser Gemini sur 800 millions d'appareils. Mais attendez avant de sortir la carte bleue. TM Roh pr&#233;vient : avec la p&#233;nurie de m&#233;moire qui frappe l'industrie, une hausse des prix est d&#233;sormais "in&#233;vitable".
</description>
    </item>
    <item>
      <title>Boulanger met en promo ce pack Arlo complet pour l&#8217;ext&#233;rieur (2 cam&#233;ras 2K + floodlight avec projecteur puissant)</title>
      <link>https://www.frandroid.com/bons-plans/2925383_boulanger-met-en-promo-ce-pack-arlo-complet-pour-lexterieur-2-cameras-2k-floodlight-avec-projecteur-puissant</link>
      <pubDate>Mon, 05 Jan 2026 08:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2925383_boulanger-met-en-promo-ce-pack-arlo-complet-pour-lexterieur-2-cameras-2k-floodlight-avec-projecteur-puissant</guid>
      <description>
Dans la gamme de cam&#233;ras de surveillance d'Arlo, on trouve notamment la Floodlight et l'Essential 3, deux mod&#232;les 2K &#233;quip&#233;s de projecteurs puissants. Actuellement, on les trouve dans un pack &#224; 319,99 euros au lieu de 399,99 euros chez Boulanger.
</description>
    </item>
    <item>
      <title>Test du Hisense M2 Pro : le projecteur lifestyle Ultra HD Dolby Vision qui en met plein les yeux</title>
      <link>https://www.frandroid.com/marques/hisense/2923347_test-du-hisense-m2-pro-le-projecteur-lifestyle-ultra-hd-dolby-vision-qui-en-met-plein-les-yeux</link>
      <pubDate>Mon, 05 Jan 2026 08:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/hisense/2923347_test-du-hisense-m2-pro-le-projecteur-lifestyle-ultra-hd-dolby-vision-qui-en-met-plein-les-yeux</guid>
      <description>
Le Hisense M2 Pro est un vid&#233;oprojecteur au format compact embarquant des technologies de pointe pour offrir une exp&#233;rience home cin&#233;ma des plus abouties jusqu&#8217;&#224; 200 pouces en diagonale. Nous avons tout pass&#233; en revue dans ce test aussi complet que possible pour vous permettre de vous faire votre propre avis.
</description>
    </item>
    <item>
      <title>Belkin a &#171; pli&#233; le game &#187; du MagSafe : une batterie sur laquelle on colle d&#8217;autres accessoires MagSafe</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2927393_belkin-a-plie-le-game-du-magsafe-une-batterie-sur-laquelle-on-colle-dautres-accessoires-magsafe</link>
      <pubDate>Mon, 05 Jan 2026 08:24:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2927393_belkin-a-plie-le-game-du-magsafe-une-batterie-sur-laquelle-on-colle-dautres-accessoires-magsafe</guid>
      <description>
Il fallait y penser. Belkin profite du CES 2026 pour pr&#233;senter une batterie externe MagSafe qui poss&#232;de... ses propres aimants MagSafe au dos. Le but ? Empiler votre porte-cartes ou votre support par-dessus la batterie pendant qu'elle charge votre iPhone. C'est de l'Inception d'accessoires. Et &#224; 100 dollars, c'est aussi un petit luxe.
</description>
    </item>
    <item>
      <title>Govee d&#233;voile 3 nouvelles lampes Matter au CES 2026, dont un &#171;&#160;puit de lumi&#232;re&#160;&#187; artificiel</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/2927355_govee-devoile-3-nouvelles-lampes-matter-au-ces-2026-dont-un-puit-de-lumiere-artificiel</link>
      <pubDate>Mon, 05 Jan 2026 08:18:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/2927355_govee-devoile-3-nouvelles-lampes-matter-au-ces-2026-dont-un-puit-de-lumiere-artificiel</guid>
      <description>
Vous trouviez qu'il manquait de l'intelligence artificielle dans votre plafonnier ? Non ? Govee l'a fait quand m&#234;me. Le fabricant chinois profite du CES pour d&#233;voiler sa nouvelle gamme, dont la Floor Lamp 3 et ses promesses colorim&#233;triques absurdes. Mais le produit qui nous pla&#238;t, c'est peut-&#234;tre ce faux puit de lumi&#232;re ultra-lumineux.
</description>
    </item>
    <item>
      <title>Clicks Power Keyboard : ce clavier MagSafe transforme n&#8217;importe quel smartphone en BlackBerry</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2927327_clicks-power-keyboard-ce-clavier-magsafe-transforme-nimporte-quel-smartphone-en-blackberry</link>
      <pubDate>Mon, 05 Jan 2026 08:09:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2927327_clicks-power-keyboard-ce-clavier-magsafe-transforme-nimporte-quel-smartphone-en-blackberry</guid>
      <description>
Il y a deux ans, Clicks nous faisait sourire avec ses coques-claviers immenses. Aujourd'hui, la marque fond&#233;e par le youtubeur MrMobile passe aux choses s&#233;rieuses. Voici le Power Keyboard : un clavier physique r&#233;tro&#233;clair&#233; cach&#233; dans une batterie MagSafe. Compatible iPhone et Android.
</description>
    </item>
    <item>
      <title>Samsung &#233;toffe ses gammes de TV OLED avec les s&#233;ries S99H, S95H, S90H et S85H</title>
      <link>https://www.frandroid.com/marques/samsung/2927301_samsung-etoffe-ses-gammes-de-tv-oled-avec-les-series-s99h-s95h-s90h-et-s85h</link>
      <pubDate>Mon, 05 Jan 2026 08:03:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2927301_samsung-etoffe-ses-gammes-de-tv-oled-avec-les-series-s99h-s95h-s90h-et-s85h</guid>
      <description>
Lors de son &#233;v&#232;nement First Look au CES 2026 &#224; Las Vegas, Samsung a enfin officialis&#233; les principales caract&#233;ristiques des nouvelles s&#233;ries de TV OLED et oh surprise, il y en a 4 dont une ayant pour vocation d&#8217;&#234;tre accroch&#233;e au mur.
</description>
    </item>
    <item>
      <title>Les v&#233;los &#233;lectriques vol&#233;s resteront marqu&#233;s &#224; jamais&#160;: la promesse du nouveau syst&#232;me antivol de Bosch</title>
      <link>https://www.01net.com/actualites/les-velos-electriques-voles-resteront-marques-a-jamais-la-promesse-du-nouveau-systeme-antivol-de-bosch.html</link>
      <pubDate>Mon, 05 Jan 2026 08:00:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317960</guid>
      <description>Un marquage ind&#233;l&#233;bile qui signale un v&#233;lo vol&#233; ? Voici la derni&#232;re bonne id&#233;e de Bosch pour renforcer la s&#233;curit&#233; des v&#233;los &#233;lectriques r&#233;duire leurs vols.</description>
    </item>
    <item>
      <title>Bosch r&#233;volutionne toujours plus la s&#233;curit&#233; des v&#233;los &#233;lectriques avec un nouveau syst&#232;me contre le vol : et c&#8217;est m&#234;me 100 % gratuit</title>
      <link>https://www.frandroid.com/marques/bosch/2919245_bosch-revolutionne-toujours-plus-la-securite-des-velos-electriques-avec-un-nouveau-systeme-contre-le-vol-et-cest-meme-100-gratuit</link>
      <pubDate>Mon, 05 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bosch/2919245_bosch-revolutionne-toujours-plus-la-securite-des-velos-electriques-avec-un-nouveau-systeme-contre-le-vol-et-cest-meme-100-gratuit</guid>
      <description>
Pr&#233;sent&#233;e &#224; l&#8217;occasion du CES 2026 de Las Vegas, une nouvelle fonctionnalit&#233; de Bosch eBike Systems vient consid&#233;rablement renforcer la protection des v&#233;los &#233;lectriques et de leurs batteries face au vol.
</description>
    </item>
    <item>
      <title>40 000 Pa, station sans sac et design ultra-fin : Mova frappe fort pour ses nouveaux robots aspirateurs</title>
      <link>https://www.frandroid.com/marques/mova/2926623_40-000-pa-station-sans-sac-et-design-ultra-fin-mova-frappe-fort-pour-ses-nouveaux-robots-aspirateurs</link>
      <pubDate>Mon, 05 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/mova/2926623_40-000-pa-station-sans-sac-et-design-ultra-fin-mova-frappe-fort-pour-ses-nouveaux-robots-aspirateurs</guid>
      <description>
Mova, la marque satellite du g&#233;ant Dreame, poursuit l'extension de son catalogue. Plus de deux ans apr&#232;s son lancement, elle profite du CES 2026 pour annoncer trois nouveaux mod&#232;les aux caract&#233;ristiques diff&#233;renciantes.
</description>
    </item>
    <item>
      <title>La Coros Pace Pro, meilleure montre connect&#233;e de sport en 2024, chute enfin &#224; un bon prix</title>
      <link>https://www.frandroid.com/bons-plans/2925749_la-coros-pace-pro-meilleure-montre-connectee-de-sport-en-2024-chute-enfin-a-un-bon-prix</link>
      <pubDate>Mon, 05 Jan 2026 07:34:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2925749_la-coros-pace-pro-meilleure-montre-connectee-de-sport-en-2024-chute-enfin-a-un-bon-prix</guid>
      <description>
Lors des Frandroid Awards de 2024, la Coros Pace Pro a re&#231;u le troph&#233;e de la meilleure montre connect&#233;e pour le sport. Un mod&#232;le bourr&#233; de fonctionnalit&#233;s pour les athl&#232;tes, et qui reste plus accessible que bien des concurrents. En ce moment, on la trouve m&#234;me en promotion &#224; 334,99 euros au lieu de 399 euros chez Alltricks.
</description>
    </item>
    <item>
      <title>Fuite de donn&#233;es Doctolib&#160;? Les informations de milliers de Fran&#231;ais compromises</title>
      <link>https://www.01net.com/actualites/fuite-donnees-doctolib-informations-milliers-francais-compromises.html</link>
      <pubDate>Mon, 05 Jan 2026 07:33:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318023</guid>
      <description>Doctolib se retrouve au c&#339;ur d'une nouvelle fuite de donn&#233;es. Plus de 150 000 fiches patients issues de l&#8217;H&#244;pital priv&#233; de la Miotte et d&#8217;un cabinet d&#8217;ophtalmologie de Sallanches circulent sur le dark web. Les deux &#233;tablissements passent par Doctolib pour permettre aux patients de prendre rendez-vous.</description>
    </item>
    <item>
      <title>Windows 11&#160;: Microsoft va proposer une option pour voir un peu moins de pub sur votre PC</title>
      <link>https://www.01net.com/actualites/windows-11-microsoft-va-proposer-une-option-pour-voir-un-peu-moins-de-pub-sur-votre-pc.html</link>
      <pubDate>Mon, 05 Jan 2026 07:23:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318028</guid>
      <description>Une nouvelle option directement int&#233;gr&#233;e dans les param&#232;tres du partage de proximit&#233; de Windows 11 vous permettra bient&#244;t d&#8217;esquiver les suggestions de Microsoft.</description>
    </item>
    <item>
      <title>GeForce NOW sur Linux : il &#233;tait temps, Nvidia !</title>
      <link>https://www.frandroid.com/marques/nvidia/2927285_geforce-now-sur-linux-il-etait-temps-nvidia</link>
      <pubDate>Mon, 05 Jan 2026 07:14:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2927285_geforce-now-sur-linux-il-etait-temps-nvidia</guid>
      <description>
Les utilisateurs de Linux sont habitu&#233;s &#224; souffrir. Pour jouer en cloud, il fallait jusqu'ici passer par Chrome ou des wrappers non officiels douteux. C'est termin&#233;. Nvidia profite du CES 2026 pour confirmer l'arriv&#233;e du support natif de Linux pour GeForce NOW.
</description>
    </item>
    <item>
      <title>Samsung The Frame, version 2026, des TV tableaux qui passent au Glare Free</title>
      <link>https://www.frandroid.com/marques/samsung/2927207_samsung-the-frame-version-2026-des-tv-tableaux-qui-passent-au-glare-free</link>
      <pubDate>Mon, 05 Jan 2026 07:07:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2927207_samsung-the-frame-version-2026-des-tv-tableaux-qui-passent-au-glare-free</guid>
      <description>
Lors du CES 2026, Samsung a d&#233;voil&#233; les caract&#233;ristiques techniques de ses nouveaux t&#233;l&#233;viseurs The Frame. En voici tous les d&#233;tails.
</description>
    </item>
    <item>
      <title>L'Or&#233;al&#8217;s CES 2026 beauty devices include a skin-like flexible LED mask</title>
      <link>https://www.engadget.com/science/loreals-ces-2026-beauty-devices-include-a-skin-like-flexible-led-mask-070000576.html?src=rss</link>
      <pubDate>Mon, 05 Jan 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">1de2e20b-fb44-4e59-9b8a-8df6ecb90e86</guid>
      <description>Over the last ten or so years, L'Or&#233;al has brought a taste of beauty tech to the masses at CES 2026. This time, it has three devices to show off: the &#8220;Light Straight + Multi-styler&#8221; as well as the helpfully named LED Face Mask and LED Eye Mask.&#160;Don&#8217;t let the unassuming names mislead you. These three products actually harbor some unique traits. The Light Straight (and multi-styler, which I&#8217;m going to just call the Light Straight from here on), for instance, uses infrared light to help generate the heat required to style your hair. Meanwhile, the LED Face Mask is different from those made by com...</description>
    </item>
    <item>
      <title>Test du Sony A7 V : une d&#233;monstration de force en photo, un peu frustrante en vid&#233;o</title>
      <link>https://www.frandroid.com/marques/sony/2921007_test-du-sony-a7-v-une-demonstration-de-force-en-photo-un-peu-frustrante-en-video</link>
      <pubDate>Mon, 05 Jan 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2921007_test-du-sony-a7-v-une-demonstration-de-force-en-photo-un-peu-frustrante-en-video</guid>
      <description>
Avec son nouveau capteur plein format de 33 MP partiellement empil&#233;, sa stabilisation m&#233;canique &#224; 7,5 IL et son processeur BIONZ XR2 dop&#233; &#224; l'IA, le Sony A7 V apporte de nombreux atouts &#224; la gamme phare de Sony. Voici son test complet. 
</description>
    </item>
    <item>
      <title>3 euros&#160;: IKEA casse encore le prix des chargeurs</title>
      <link>https://www.01net.com/actualites/3-euros-ikea-casse-encore-prix-chargeurs.html</link>
      <pubDate>Mon, 05 Jan 2026 06:59:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318018</guid>
      <description>IKEA frappe encore un grand coup en proposant un chargeur 20W &#224; seulement 2,99 &#8364;. Une solution tr&#232;s &#233;conomique pour charger ses appareils.</description>
    </item>
    <item>
      <title>Belkin d&#233;voile sa coque batterie pour Switch 2 : 10 000 mAh et un &#233;cran LCD int&#233;gr&#233;</title>
      <link>https://www.frandroid.com/marques/nintendo/2927211_belkin-devoile-sa-coque-batterie-pour-switch-2-10-000-mah-et-un-ecran-lcd-integre</link>
      <pubDate>Mon, 05 Jan 2026 06:46:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nintendo/2927211_belkin-devoile-sa-coque-batterie-pour-switch-2-10-000-mah-et-un-ecran-lcd-integre</guid>
      <description>
Vous avez peur de tomber en rade de batterie avec votre Nintendo Switch 2 flambant neuve ? Belkin a la solution. La marque pr&#233;sente une coque de transport qui fait aussi station de charge rapide 30W. L'id&#233;e de g&#233;nie ? Un compartiment cach&#233; pour un AirTag.
</description>
    </item>
    <item>
      <title>CES 2026: Do AI companions need jobs? Ludens AIs Cocomo and INU dont think so.</title>
      <link>https://mashable.com/article/ludens-ai-cocomo-and-inu-desktop-alien-dog-ces-2026</link>
      <pubDate>Mon, 05 Jan 2026 06:45:17 +0000</pubDate>
      <guid isPermaLink="false">07JbZg96xIMsUPmNnuFvI5u</guid>
      <description>Ludens AI showed off its AI companions Cocomo and INU at CES 2026, designing them to be a cute presence rather than be productive.</description>
    </item>
  </channel>
</rss>
