<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 04 Feb 2026 07:50:13 GMT</lastBuildDate>
    <item>
      <title>En attendant l&#8217;arriv&#233;e d&#8217;Android sur PC, Google acte la future mort de Chrome OS</title>
      <link>https://www.frandroid.com/marques/google/2965521_en-attendant-larrivee-dandroid-sur-pc-google-acte-la-future-mort-de-chrome-os</link>
      <pubDate>Wed, 04 Feb 2026 07:47:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2965521_en-attendant-larrivee-dandroid-sur-pc-google-acte-la-future-mort-de-chrome-os</guid>
      <description>
L&#8217;emprise d&#8217;Android va bient&#244;t s&#8217;&#233;tendre au monde du PC, mais, en attendant, Google va continuer &#224; prendre en charge ChromeOS jusqu&#8217;en 2034, r&#233;v&#232;lent des documents juridiques.
</description>
    </item>
    <item>
      <title>Comment Google a gagn&#233; 86 milliards de dollars gr&#226;ce &#224; Elon Musk</title>
      <link>https://www.frandroid.com/marques/google/2965509_comment-google-a-gagne-86-milliards-de-dollars-grace-a-elon-musk</link>
      <pubDate>Wed, 04 Feb 2026 07:41:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2965509_comment-google-a-gagne-86-milliards-de-dollars-grace-a-elon-musk</guid>
      <description>
La fusion inattendue de SpaceX et de xAI fait aussi le jeu de Google. La firme s'en tire avec une plus-value de 86 milliards de dollars dans l'op&#233;ration.
</description>
    </item>
    <item>
      <title>Ce laptop gaming Lenovo ultra-puissant (Ultra 9 + RTX 5090) perd plus de 1 000 &#8364; et devient une affaire en or</title>
      <link>https://www.frandroid.com/bons-plans/2964823_ce-laptop-gaming-lenovo-ultra-puissant-ultra-9-rtx-5090-perd-plus-de-1-000-e-et-devient-une-affaire-en-or</link>
      <pubDate>Wed, 04 Feb 2026 07:34:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2964823_ce-laptop-gaming-lenovo-ultra-puissant-ultra-9-rtx-5090-perd-plus-de-1-000-e-et-devient-une-affaire-en-or</guid>
      <description>
Avec sa configuration hautement solide, le Lenovo Legion Pro 7 devrait ravir les joueurs tr&#232;s exigeants qui ont besoin d&#8217;une machine performante pour lancer les jeux AAA&#160;avec les graphismes au max. Un mod&#232;le qui n&#8217;est pas donn&#233;, mais qui devient moins cher : 3 884 euros contre 4 999 euros de base.
</description>
    </item>
    <item>
      <title>Adobe a voulu d&#233;brancher Animate, ultime h&#233;ritier de Flash&#8230; mais est finalement revenu sur ses pas</title>
      <link>https://www.01net.com/actualites/adobe-debranche-animate-ultime-heritier-de-flash-utilise-par-de-nombreux-createurs.html</link>
      <pubDate>Wed, 04 Feb 2026 07:30:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324012</guid>
      <description>Le logiciel Adobe Animate n'&#233;veillera peut-&#234;tre aucun souvenir aupr&#232;s du grand public, mais il est l'h&#233;ritier d'une grande lign&#233;e, celle de la technologie Flash dont les animations et les jeux ont prosp&#233;r&#233; sur le web dans les ann&#233;es 2000. L'&#233;diteur a voulu d&#233;brancher compl&#232;tement le logiciel&#8230; mais le conserve finalement sous perfusion suite &#224; la grogne des utilisateurs....</description>
    </item>
    <item>
      <title>Guerre des prix et concurrence : les ventes de BYD chutent en ce d&#233;but d&#8217;ann&#233;e, mais la marque prend d&#233;j&#224; les devants</title>
      <link>https://www.frandroid.com/marques/byd/2965343_guerre-des-prix-et-concurrence-les-ventes-de-byd-chutent-en-ce-debut-dannee-mais-la-marque-prend-deja-les-devants</link>
      <pubDate>Wed, 04 Feb 2026 07:27:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2965343_guerre-des-prix-et-concurrence-les-ventes-de-byd-chutent-en-ce-debut-dannee-mais-la-marque-prend-deja-les-devants</guid>
      <description>
Le leader chinois de la voiture &#233;lectrique traverse un d&#233;but d&#8217;ann&#233;e d&#233;licat. En janvier 2026, BYD enregistre une chute de ses ventes sur son march&#233; domestique, sympt&#244;me d&#8217;un secteur sous tension apr&#232;s des mois de guerre des prix. Pour retrouver de l&#8217;&#233;lan, le constructeur regarde d&#233;sormais au-del&#224; de ses fronti&#232;res&#8230; et explore de nouvelles pistes &#224; domicile.
...</description>
    </item>
    <item>
      <title>AMD est pr&#234;t pour lancement de la Xbox nouvelle g&#233;n&#233;ration en 2027</title>
      <link>https://www.frandroid.com/marques/microsoft/2965463_amd-evoque-le-possible-lancement-dune-nouvelle-xbox-en-2027</link>
      <pubDate>Wed, 04 Feb 2026 07:17:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2965463_amd-evoque-le-possible-lancement-dune-nouvelle-xbox-en-2027</guid>
      <description>
Apr&#232;s avoir nou&#233; un partenariat pluriannuel avec Microsoft en 2025, voil&#224; qu'AMD g&#226;che la surprise en &#233;voquant le potentiel lancement d&#8217;une nouvelle console Xbox en 2027.
</description>
    </item>
    <item>
      <title>Xiaomi n&#8217;arrive plus &#224; vendre sa SU7 &#233;lectrique ultra performante et prend une d&#233;cision r&#233;v&#233;latrice</title>
      <link>https://www.frandroid.com/marques/xiaomi/2965475_xiaomi-narrive-plus-a-vendre-sa-su7-electrique-ultra-performante-et-prend-une-decision-revelatrice</link>
      <pubDate>Wed, 04 Feb 2026 07:12:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2965475_xiaomi-narrive-plus-a-vendre-sa-su7-electrique-ultra-performante-et-prend-une-decision-revelatrice</guid>
      <description>
Lanc&#233;e en fanfare et pouvant se targuer d&#8217;avoir battu Porsche sur le circuit allemand du N&#252;rburgring, les ventes de la Xiaomi SU7 Ultra se sont effondr&#233;es ces derniers mois. Fin d&#8217;une fr&#233;n&#233;sie pour cette voiture &#233;lectrique ultra performante ou simple accalmie ?
</description>
    </item>
    <item>
      <title>Plus besoin de parler anglais&#160;? L&#8217;outil le plus bluffant de Google Meet arriverait enfin sur smartphone</title>
      <link>https://www.01net.com/actualites/plus-besoin-parler-anglais-outil-bluffant-google-meet-arriverait-smartphone.html</link>
      <pubDate>Wed, 04 Feb 2026 07:12:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324046</guid>
      <description>Google Meet pourrait bient&#244;t ajouter la traduction vocale en temps r&#233;el sur la version mobile de l'application. Mais il faudra probablement remplir une condition pour en profiter.</description>
    </item>
    <item>
      <title>&#171; Dettes croissantes, tarifs douaniers, surstockage &#187; : Trek, le n&#176;1 du v&#233;lo am&#233;ricain, serait en tr&#232;s grandes difficult&#233;s</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2963985_dettes-croissantes-tarifs-douaniers-surstockage-trek-le-n1-du-velo-americain-serait-en-tres-grandes-difficultes</link>
      <pubDate>Wed, 04 Feb 2026 07:12:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2963985_dettes-croissantes-tarifs-douaniers-surstockage-trek-le-n1-du-velo-americain-serait-en-tres-grandes-difficultes</guid>
      <description>
Selon Escape Collective, le groupe am&#233;ricain Trek subit plus que d&#8217;autres le contrecoup du boom du Covid, d&#251; &#224; une strat&#233;gie trop agressive, avec des pertes colossales et un plan de licenciements.
</description>
    </item>
    <item>
      <title>Mauvaise nouvelle si vous &#234;tes chez Orange : le prix de certains forfaits augmente</title>
      <link>https://www.frandroid.com/marques/orange/2965481_mauvaise-nouvelle-si-vous-etes-chez-orange-le-prix-de-certains-forfaits-augmente</link>
      <pubDate>Wed, 04 Feb 2026 07:11:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/orange/2965481_mauvaise-nouvelle-si-vous-etes-chez-orange-le-prix-de-certains-forfaits-augmente</guid>
      <description>
L'op&#233;rateur historique en France proc&#232;de &#224; une petite augmentation de certains forfaits. Vous avez peut-&#234;tre re&#231;u la mauvaise nouvelle dans vos emails.
</description>
    </item>
    <item>
      <title>Les futurs &#233;couteurs de Sony sont en fuite, nouveau design en vue pour les WF-1000XM6</title>
      <link>https://www.01net.com/actualites/les-futurs-ecouteurs-de-sony-sont-en-fuite-nouveau-design-en-vue-pour-les-wf-1000xm6.html</link>
      <pubDate>Wed, 04 Feb 2026 07:01:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323998</guid>
      <description>Sony entend bien creuser le sillon sonore form&#233; par les &#233;couteurs WF-1000XM4 qui ont fait sensation en 2021. Deux ans plus tard, le constructeur lan&#231;ait les mod&#232;les WF-1000XM5 qui capitalisaient sur la r&#233;ussite de la pr&#233;c&#233;dente g&#233;n&#233;ration. De nouveaux &#233;couteurs sont visiblement dans les tuyaux, avec un changement de design &#224; la cl&#233;.</description>
    </item>
    <item>
      <title>01net morning&#160;: 1G en Porsche Cayenne &#233;lectrique, les apps m&#233;t&#233;o ont du mal avec la neige, perquisition chez X en France</title>
      <link>https://www.01net.com/actualites/01net-morning-1g-en-porsche-cayenne-electrique-les-apps-meteo-ont-du-mal-avec-la-neige-perquisition-chez-x-en-france.html</link>
      <pubDate>Wed, 04 Feb 2026 06:30:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323993</guid>
      <description>Bonjour &#224; tous, voici la matinale de 01net ! Qu&#8217;avez-vous manqu&#233; hier ? Retrouvez toute l&#8217;actu &#224; connaitre pour d&#233;marrer la journ&#233;e du bon pied !</description>
    </item>
    <item>
      <title>Ce forfait 5G est l&#8217;un des rares &#224; ne pas r&#233;duire votre data une fois la fronti&#232;re pass&#233;e</title>
      <link>https://www.frandroid.com/bons-plans/2964241_ce-forfait-5g-est-lun-des-rares-a-ne-pas-reduire-votre-data-une-fois-la-frontiere-passee</link>
      <pubDate>Wed, 04 Feb 2026 06:25:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2964241_ce-forfait-5g-est-lun-des-rares-a-ne-pas-reduire-votre-data-une-fois-la-frontiere-passee</guid>
      <description>
SFR revoit &#224; la hausse son forfait interm&#233;diaire en ajoutant 50 % de data suppl&#233;mentaire sans toucher au prix. L'offre devient incontournable pour les frontaliers et les abonn&#233;s box qui b&#233;n&#233;ficient d'un tarif pr&#233;f&#233;rentiel imbattable.
</description>
    </item>
    <item>
      <title>On a vu la Tesla Model Y L : la preuve que Tesla ma&#238;trise encore son sujet</title>
      <link>https://www.frandroid.com/marques/tesla/2965389_on-a-vu-la-tesla-model-y-l-la-preuve-que-tesla-maitrise-encore-son-sujet</link>
      <pubDate>Wed, 04 Feb 2026 06:20:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2965389_on-a-vu-la-tesla-model-y-l-la-preuve-que-tesla-maitrise-encore-son-sujet</guid>
      <description>
Vous trouvez le Model Y trop juste pour vos trois enfants ? Regardez ce qui arrive. La Model Y L d&#233;barque avec 20 cm de plus et une configuration int&#233;rieure royale. On a pu la voir en Chine.
</description>
    </item>
    <item>
      <title>Companies replaced entry-level workers with AI.&#160;Now they are paying the price</title>
      <link>https://www.fastcompany.com/91483431/companies-replaced-entry-level-workers-with-ai</link>
      <pubDate>2026-02-04T06:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91483431/companies-replaced-entry-level-workers-with-ai</guid>
      <description>Recent graduates are clearly not okay&#8212;but neither are the companies that decided they could do without them.
Isaac, 33, has been a mid-level software development engineer at a Big Tech firm for four years, and noticed entry-level job postings dropping at his workplace at the start of 2025. The work, however, didn&#8217;t vanish with them. Tasks once handled by junior engineers&#8212;like writing and testing code, fixing bugs, and contributing to development projects&#8212;were absorbed by senior staff, often with the assumption that AI would make up the difference.And while AI has sped up the velocity of shippi...</description>
    </item>
  </channel>
</rss>
