<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 23 Jan 2026 11:25:46 GMT</lastBuildDate>
    <item>
      <title>Gboard&#160;: le clavier Google ajoute un petit changement qui fait une &#233;norme diff&#233;rence</title>
      <link>https://www.01net.com/actualites/gboard-clavier-google-ajoute-petit-changement-enorme-difference.html</link>
      <pubDate>Fri, 23 Jan 2026 11:23:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322111</guid>
      <description>Google vient d'ajouter &#224; Gboard un raccourci qui pourrait faire gagner un temps fou &#224; tous les utilisateurs du clavier, aussi bien sur Android que sur iOS.</description>
    </item>
    <item>
      <title>Fable director explains what makes the RPG a fairytale rather than a straight fantasy like The Witcher &#8212; 'Fairytales are intimate, they&#8217;re small stories about regular people... I think that is a brilliant description of what Fable really is'</title>
      <link>https://www.techradar.com/gaming/fable-director-explains-what-makes-the-rpg-a-fairytale-rather-than-a-straight-fantasy-like-the-witcher-fairytales-are-intimate-theyre-small-stories-about-regular-people-i-think-that-is-a-brilliant-description-of-what-fable-really-is</link>
      <pubDate>Fri, 23 Jan 2026 11:13:54 +0000</pubDate>
      <guid isPermaLink="false">d7jyrJhqPkxfiU79xWoygH</guid>
      <description>According to Fable game director Ralph Fulton, the upcoming game will be an open-world fairytale, rather than a "grand and sweeping" fantasy story like The Witcher or Skyrim.</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : la 3&#232;me d&#233;marque continue avec de belles p&#233;pites juste avant le week-end</title>
      <link>https://www.frandroid.com/bons-plans/2949895_soldes-dhiver-2026-la-3eme-demarque-continue-avec-de-belles-pepites-juste-avant-le-week-end</link>
      <pubDate>Fri, 23 Jan 2026 11:10:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2949895_soldes-dhiver-2026-la-3eme-demarque-continue-avec-de-belles-pepites-juste-avant-le-week-end</guid>
      <description>
Cela fait d&#233;j&#224; plus de deux semaines que les soldes d'hiver ont commenc&#233; en France et que les e-commer&#231;ants tels qu'Amazon, Fnac, Darty, Boulanger ou encore Cdiscount partagent des offres. C'est maintenant l'heure de la 3e d&#233;marque et voici les meilleures offres Tech &#224; saisir. 
</description>
    </item>
    <item>
      <title>Microsoft Paint can now make AI coloring books</title>
      <link>https://www.theverge.com/news/866524/microsoft-paint-notepad-ai-coloring-book</link>
      <pubDate>2026-01-23T06:06:39-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=866524</guid>
      <description>Microsoft is giving its Paint and Notepad apps on Windows new AI capabilities for editing text and making digital illustrations. The updates are currently rolling out to Windows Insiders in the Windows 11 Canary and Dev channels, and include features that feel oddly niche or advanced for such simplified apps, such as AI text improvements [&#8230;]</description>
    </item>
    <item>
      <title>EU issued over &#8364;1.2bn in GDPR fines in 2025 as multiple data breaches bite</title>
      <link>https://www.techradar.com/pro/eu-issued-over-eur1-2bn-in-gdpr-fines-in-2025-as-multiple-data-breaches-bite</link>
      <pubDate>Fri, 23 Jan 2026 11:05:00 +0000</pubDate>
      <guid isPermaLink="false">FyGAMgfuLDmP9nkWCd4Y9L</guid>
      <description>Although the GDPR fine value was slightly higher in 2025, the number of personal data breach reports rose even more.</description>
    </item>
    <item>
      <title>Cyberattaque en cours sur Facebook&#160;: des hackers cherchent &#224; pirater votre compte</title>
      <link>https://www.01net.com/actualites/cyberattaque-cours-contre-facebook-hackers-cherchent-pirater-compte.html</link>
      <pubDate>Fri, 23 Jan 2026 11:03:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322086</guid>
      <description>Une cyberattaque d'envergure vise Facebook. En promettant un faux badge bleu, les cybercriminels cherchent &#224; s'emparer de votre compte. Pour arriver &#224; leurs fins sans se faire rep&#233;rer, ils r&#233;clament d'abord vos cookies de session.</description>
    </item>
    <item>
      <title>C&#8217;est fini pour l&#8217;ID.4 : Volkswagen confirme son changement radical de strat&#233;gie pour ses voitures &#233;lectriques</title>
      <link>https://www.frandroid.com/marques/volkswagen/2953119_cest-fini-pour-lid-4-volkswagen-confirme-son-changement-radical-de-strategie-pour-ses-voitures-electriques</link>
      <pubDate>Fri, 23 Jan 2026 11:02:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2953119_cest-fini-pour-lid-4-volkswagen-confirme-son-changement-radical-de-strategie-pour-ses-voitures-electriques</guid>
      <description>
Les rumeurs bruissaient, c'est d&#233;sormais confirm&#233; : le Volkswagen ID.4 va se renommer en ID. Tiguan &#224; l'occasion d'un profond restylage courant 2026. Une confirmation de la nouvelle nomenclature des voitures &#233;lectriques de la marque, apr&#232;s l'ID. Polo.
</description>
    </item>
    <item>
      <title>Amazon just made a massive change to Kindle ebooks that lets you read them anywhere, but there's a catch</title>
      <link>https://www.techradar.com/tablets/ereaders/amazon-just-made-a-massive-change-to-kindle-ebooks-that-lets-you-read-them-anywhere-but-theres-a-catch</link>
      <pubDate>Fri, 23 Jan 2026 11:01:14 +0000</pubDate>
      <guid isPermaLink="false">qYdYNH7RpU3gYjL2sZiCf4</guid>
      <description>Amazon has just added a DRM-free option to Kindle ebooks, letting you read them anywhere. But publishers need to opt in first.</description>
    </item>
    <item>
      <title>149 Million Usernames and Passwords Exposed by Unsecured Database</title>
      <link>https://www.wired.com/story/149-million-stolen-usernames-passwords/</link>
      <pubDate>Fri, 23 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">69725d75ba821e8a818a8aa1</guid>
      <description>This &#8220;dream wish list for criminals&#8221; includes millions of Gmail, Facebook, banking logins, and more. The researcher who discovered it suspects they were collected using infostealing malware.</description>
    </item>
    <item>
      <title>En 5 ans seulement, Apple a rattrap&#233; ce v&#233;t&#233;ran des ordinateurs portables</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2952815_en-5-ans-seulement-apple-a-rattrape-ce-veteran-des-ordinateurs-portables</link>
      <pubDate>Fri, 23 Jan 2026 10:57:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2952815_en-5-ans-seulement-apple-a-rattrape-ce-veteran-des-ordinateurs-portables</guid>
      <description>
Apple s'est taill&#233; une tr&#232;s belle part du march&#233; des ordinateurs portables depuis le lancement, fin 2020, de ses premiers MacBook ARM. Les derni&#232;res donn&#233;es de Mercury Research attestent de la place importante d&#233;sormais occup&#233;e par la firme sur ce terrain... et de sa jolie performance commerciale face aux mod&#232;les motoris&#233;s par AMD.
</description>
    </item>
    <item>
      <title>Amazon solde un tas de produits Tech pour le week-end de la 3e d&#233;marque : les 18 meilleures offres</title>
      <link>https://www.frandroid.com/bons-plans/2933045_amazon-solde-un-tas-de-produits-tech-pour-le-week-end-de-la-3e-demarque-les-18-meilleures-offres</link>
      <pubDate>Fri, 23 Jan 2026 10:55:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933045_amazon-solde-un-tas-de-produits-tech-pour-le-week-end-de-la-3e-demarque-les-18-meilleures-offres</guid>
      <description>
Le coup d&#8217;envoi du week-end marque l&#8217;arriv&#233;e de nouvelles offres pour la 3&#7497; d&#233;marque des soldes d&#8217;hiver ! Amazon continue de casser les prix sur de nombreux produits Tech. Parmi les meilleures affaires du moment, on retrouve notamment la Pixel Watch 3, propos&#233;e &#224; prix cass&#233;.
</description>
    </item>
    <item>
      <title>Ce lot de quatre barres lumineuses Philips Hue Play est enfin &#224; moiti&#233; prix pour les soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2852833_ce-lot-de-quatre-barres-lumineuses-philips-hue-play-est-enfin-a-moitie-prix-pour-les-soldes-dhiver</link>
      <pubDate>Fri, 23 Jan 2026 10:49:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2852833_ce-lot-de-quatre-barres-lumineuses-philips-hue-play-est-enfin-a-moitie-prix-pour-les-soldes-dhiver</guid>
      <description>
Les Philips Hue Play sont des barres lumineuses id&#233;ales pour apporter une petite touche color&#233;e &#224; une pi&#232;ce ou &#224; un setup gaming. Pour les soldes d'hiver 2026, on trouve le pack de quatre &#224; 139,99 euros au lieu de 279,99 euros.
</description>
    </item>
    <item>
      <title>Free : vous pouvez d&#233;sormais gagner de l&#8217;argent avec votre vieille montre connect&#233;e (m&#234;me si vous n&#8217;&#234;tes pas abonn&#233;)</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2953065_free-vous-pouvez-desormais-gagner-de-largent-avec-votre-vieille-montre-connectee-meme-si-vous-netes-pas-abonne</link>
      <pubDate>Fri, 23 Jan 2026 10:47:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2953065_free-vous-pouvez-desormais-gagner-de-largent-avec-votre-vieille-montre-connectee-meme-si-vous-netes-pas-abonne</guid>
      <description>
Apr&#232;s les smartphones, Free propose d&#233;sormais des offres de reprise pour les montres connect&#233;es, en partenariat avec ReCommerce. 
</description>
    </item>
    <item>
      <title>'We don&#8217;t have any plans to do ads at the moment' &#8212; DeepMind CEO Demis Hassabis says Gemini will stay ad&#8209;free as ChatGPT begins inserting ads into conversations</title>
      <link>https://www.techradar.com/ai-platforms-assistants/gemini/we-dont-have-any-plans-to-do-ads-at-the-moment-deepmind-ceo-demis-hassabis-says-gemini-will-stay-ad-free-as-chatgpt-begins-inserting-ads-into-conversations</link>
      <pubDate>Fri, 23 Jan 2026 10:43:25 +0000</pubDate>
      <guid isPermaLink="false">A6MVSQ8dpVq3eQs8XBxZ4Q</guid>
      <description>Google is distancing Gemini from ChatGPT&#8217;s ad strategy by promising an ad-free experience for now</description>
    </item>
    <item>
      <title>C&#8217;est la fin d&#8217;une &#233;poque chez Intel : ces processeurs embl&#233;matiques vont bient&#244;t dispara&#238;tre</title>
      <link>https://www.frandroid.com/marques/intel/2953101_cest-la-fin-dune-epoque-chez-intel-ces-processeurs-emblematiques-vont-bientot-disparaitre</link>
      <pubDate>Fri, 23 Jan 2026 10:39:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/intel/2953101_cest-la-fin-dune-epoque-chez-intel-ces-processeurs-emblematiques-vont-bientot-disparaitre</guid>
      <description>
Intel met au placard ses processeurs Alder Lake en 2026, signant la fin des puces qui ont d&#233;fini toute l'offre processeur grand public du constructeur depuis 2021.
</description>
    </item>
    <item>
      <title>Enregistrez vos stickers personnalis&#233;s dans Collections de Google Photos mais il y a un hic</title>
      <link>https://www.frandroid.com/android/applications/google-apps/2953097_enregistrez-vos-stickers-personnalises-dans-collections-de-google-photos-mais-il-y-a-un-hic</link>
      <pubDate>Fri, 23 Jan 2026 10:18:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/applications/google-apps/2953097_enregistrez-vos-stickers-personnalises-dans-collections-de-google-photos-mais-il-y-a-un-hic</guid>
      <description>
Google Photos propose d&#233;sormais un dossier de stickers personnalis&#233;s dans l&#8217;onglet Collections, mais uniquement sur iOS. Selon Google, Android y aura droit plus tard.
</description>
    </item>
    <item>
      <title>Google Home ajoute une nouvelle mani&#232;re d&#8217;installer vos appareils</title>
      <link>https://www.01net.com/actualites/google-home-fini-galere-pour-installer-nouveaux-appareils.html</link>
      <pubDate>Fri, 23 Jan 2026 10:10:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322064</guid>
      <description>Google Home veut simplifier l'ajout de nouveaux appareils en proposant une troisi&#232;me m&#233;thode, au cas o&#249; les deux premi&#232;res ne fonctionneraient pas.</description>
    </item>
    <item>
      <title>Plus g&#234;nant qu&#8217;un probl&#232;me de toilettes : demander &#224; brancher sa voiture &#233;lectrique chez ses amis, selon cette &#233;tude</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2952755_plus-genant-quun-probleme-de-toilettes-demander-a-brancher-sa-voiture-electrique-chez-ses-amis-selon-cette-etude</link>
      <pubDate>Fri, 23 Jan 2026 10:10:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2952755_plus-genant-quun-probleme-de-toilettes-demander-a-brancher-sa-voiture-electrique-chez-ses-amis-selon-cette-etude</guid>
      <description>
Selon une &#233;tude men&#233;e par Ford, la voiture &#233;lectrique est la cause de nombreux moments de g&#234;ne chez les Fran&#231;ais. Mais elle peut aussi leur sauver la mise&#160;!
</description>
    </item>
    <item>
      <title>Boulanger lance une grande braderie avec des prix au plus bas pour le week-end des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2931541_boulanger-lance-une-grande-braderie-avec-des-prix-au-plus-bas-pour-le-week-end-des-soldes</link>
      <pubDate>Fri, 23 Jan 2026 10:08:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931541_boulanger-lance-une-grande-braderie-avec-des-prix-au-plus-bas-pour-le-week-end-des-soldes</guid>
      <description>
Le week-end pointe le bout de son nez, et Boulanger en profite pour g&#226;ter les amateurs de bons plans&#8239;! &#192; l&#8217;occasion de la 3&#7497; d&#233;marque des soldes d&#8217;hiver, l&#8217;enseigne d&#233;voile de nouvelles r&#233;ductions encore plus attractives sur une large s&#233;lection de produits Tech. 
</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver : les t&#233;l&#233;viseurs et vid&#233;oprojecteurs sont &#224; prix encore plus cass&#233;s pour la 3e d&#233;marque</title>
      <link>https://www.frandroid.com/bons-plans/2933417_soldes-dhiver-les-televiseurs-et-videoprojecteurs-sont-a-prix-encore-plus-casses-pour-la-3e-demarque</link>
      <pubDate>Fri, 23 Jan 2026 10:06:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933417_soldes-dhiver-les-televiseurs-et-videoprojecteurs-sont-a-prix-encore-plus-casses-pour-la-3e-demarque</guid>
      <description>
Les soldes d'hiver sont entr&#233;s dans leur troisi&#232;me d&#233;marque, ce qui veut dire que nous venons de passer la moiti&#233; de cette p&#233;riode, mais aussi que les promotions vont devenir encore plus int&#233;ressantes &#224; compter de maintenant. Les TV n'y &#233;chappent pas bien entendu, il n'y a qu'&#224; regarder cette s&#233;lection d'offres.
</description>
    </item>
    <item>
      <title>Google T&#233;l&#233;phone&#160;: un bug effrayant fait fuiter l&#8217;audio &#224; l&#8217;insu de l&#8217;utilisateur sur les Pixel</title>
      <link>https://www.01net.com/actualites/google-telephone-un-bug-effrayant-fait-fuiter-laudio-a-linsu-de-lutilisateur-sur-les-pixel.html</link>
      <pubDate>Fri, 23 Jan 2026 10:03:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322082</guid>
      <description>La fonction &#171; Prendre un message &#187; disponible dans certains pays sur l&#8217;application Google T&#233;l&#233;phone est touch&#233;e par un bug aussi &#233;trange que probl&#233;matique. Les appelants peuvent entendre leur interlocuteur &#224; leur insu pendant qu&#8217;ils laissent un message vocal.</description>
    </item>
    <item>
      <title>The best GPS running watches for 2026</title>
      <link>https://www.engadget.com/wearables/best-gps-running-watch-141513957.html?src=rss</link>
      <pubDate>Fri, 23 Jan 2026 10:00:37 +0000</pubDate>
      <guid isPermaLink="false">5daa500c-3147-3dc9-8f5e-d508fa140873</guid>
      <description>Having the right GPS watch on your wrist whether you&#8217;re going for your first ever run or your umpteenth run can make all the difference. The best GPS running watches not only keep track of how far you&#8217;ve run, but they track pace and other real-time metrics, advanced training features to help you hit your goals and, of course, precise distance measurements. Some models even provide offline maps for navigation, sleep tracking, recovery insights, and smart features that &#8220;regular&#8221; smartwatches do.For those who need extra durability and lasting battery life, higher-end sport watches &#8212; like some of ...</description>
    </item>
    <item>
      <title>America has a looming highway budget crisis</title>
      <link>https://www.fastcompany.com/91469982/america-has-a-looming-highway-budget-crisis</link>
      <pubDate>2026-01-23T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91469982/america-has-a-looming-highway-budget-crisis</guid>
      <description>We can&#8217;t afford the upkeep on what&#8217;s already been built, let alone fund new projects.
We can&#8217;t afford to maintain the roads we have, so why do we keep building more?</description>
    </item>
    <item>
      <title>The &#8216;big bazooka&#8217;: How Europe could hit the U.S. tech industry if the Greenland trade war blows up</title>
      <link>https://www.fastcompany.com/91479422/the-big-bazooka-how-europe-could-hit-the-us-tech-industry-if-the-greenland-trade-war-blows-up</link>
      <pubDate>2026-01-23T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91479422/the-big-bazooka-how-europe-could-hit-the-us-tech-industry-if-the-greenland-trade-war-blows-up</guid>
      <description>Europe&#8217;s plan to retaliate against U.S. tech companies in response to Trump&#8217;s Greenland aggression &#8216;would unfold more like a slow, grinding campaign: legal, relentlessly procedural, and very expensive for American firms.&#8217;
While it seems that some agreement has been reached to placate Donald Trump&#8217;s obsession with taking over Greenland, details are still being revealed. So the possibility that the nascent trade war over the issue that was heating up before the announcement of an agreement could restart....</description>
    </item>
    <item>
      <title>Walker Scobell says Percy Jackson and the Olympians Season 3 is even better than I imagined</title>
      <link>https://mashable.com/video/percy-jackson-and-the-olympians-season-3-walker-scobell-interview</link>
      <pubDate>Fri, 23 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">074P39fMPsNojDSUKllT6A9</guid>
      <description>"Percy Jackson and the Olympians" star Walker Scobell dishes on adapting "The Titan's Curse" and all those "dam" jokes.</description>
    </item>
    <item>
      <title>NASA&#8217;s Artemis 2 astronauts could head to the moon in a matter of weeks</title>
      <link>https://mashable.com/article/artemis-1-vs-artemis-2-moon-mission</link>
      <pubDate>Fri, 23 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">03xyo46ja4A0By3K8Vxj1x9</guid>
      <description>NASA's Artemis II is a crucial trial that turns the success of the uncrewed Artemis I flight into a human mission around the moon.</description>
    </item>
    <item>
      <title>Why the algorithm serves you wedding content when you just got divorced</title>
      <link>https://mashable.com/article/why-the-algorithm-serves-you-wedding-content-after-divorce</link>
      <pubDate>Fri, 23 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">05mgq9ge1M3cXP5gXMrJnRb</guid>
      <description>Social media algorithms, like those on TikTok, may contradict the reality you're living in. Experts tell Mashable why.</description>
    </item>
    <item>
      <title>How to watch Pacers vs. Thunder online for free</title>
      <link>https://mashable.com/article/pacers-thunder-nba-2026-live-stream-for-free</link>
      <pubDate>Fri, 23 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02OpPRFP96nb6Dcek62xaTD</guid>
      <description>How to watch NBA for free. Watch Indiana Pacers vs. Oklahoma City Thunder in the NBA for free from anywhere in the world.</description>
    </item>
    <item>
      <title>How to watch Rockets vs. Pistons online for free</title>
      <link>https://mashable.com/article/rockets-pistons-nba-2026-live-stream-for-free</link>
      <pubDate>Fri, 23 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">06SGuyWm1dkY2PGYndqEhJQ</guid>
      <description>How to watch NBA for free. Watch Houston Rockets vs. Detroit Pistons in the NBA for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Arco review: If you love animation, you need to see this gorgeous climate change fable</title>
      <link>https://mashable.com/article/arco-review</link>
      <pubDate>Fri, 23 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01mPYWZ7w8OJMgdJFK3KqOB</guid>
      <description>Ugo Bienvenu's "Arco," about a lost time traveler, is one of the best animated films of the year.</description>
    </item>
    <item>
      <title>The Testament of Ann Lee review: Amanda Seyfried astounds in stirring, religious biopic</title>
      <link>https://mashable.com/article/the-testament-of-ann-lee-review</link>
      <pubDate>Fri, 23 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02VDSf2K0l0mmW1CO93Fec9</guid>
      <description>From the creators behind "The Brutalist" comes the moving musical epic "The Testament of Ann Lee," starring Amanda Seyfried. Review.</description>
    </item>
    <item>
      <title>The Smashing Machine review: Dwayne Johnson delivers a career-changing performance, but theres one big problem</title>
      <link>https://mashable.com/article/the-smashing-machine-review</link>
      <pubDate>Fri, 23 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">050iqUzlgR4Uyg0m1MmaoYE</guid>
      <description>Dwayne Johnson delivers a career-changing performance in "The Smashing Machine," but there's one big problem. Review.</description>
    </item>
    <item>
      <title>AI isn't delivering the gains it asked for just yet - but most bosses don't mind</title>
      <link>https://www.techradar.com/pro/ai-isnt-delivering-the-gains-it-asked-for-just-yet-but-most-bosses-dont-mind</link>
      <pubDate>Fri, 23 Jan 2026 09:59:38 +0000</pubDate>
      <guid isPermaLink="false">Dur4w5P9AnrXaGC6gE5DHh</guid>
      <description>Although businesses aren't seeing returns from AI, many are moving from pilots to real-world deployments, so they must be confident.</description>
    </item>
    <item>
      <title>The Pok&#233;mon TCG Unova Heavy Hitters Premium Collection is $25 off at Amazon</title>
      <link>https://mashable.com/article/jan-23-pokemon-tcg-unova-heavy-hitters-premium-collection-deal</link>
      <pubDate>Fri, 23 Jan 2026 09:59:04 +0000</pubDate>
      <guid isPermaLink="false">01auaLcUKZjiWZtGWSy8iFb</guid>
      <description>The Pok&#233;mon TCG Unova Heavy Hitters Premium Collection is now $25 off at Amazon, with 12 boosters and five promo cards.</description>
    </item>
    <item>
      <title>Seulement 366 &#8364; pour ce vid&#233;oprojecteur Full HD de chez Samsung, c&#8217;est l&#8217;offre des soldes &#224; ne pas rater sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2802533_seulement-366-euros-pour-ce-videoprojecteur-full-hd-de-chez-samsung-cest-loffre-des-soldes-a-ne-pas-rater-sur-amazon</link>
      <pubDate>Fri, 23 Jan 2026 09:56:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2802533_seulement-366-euros-pour-ce-videoprojecteur-full-hd-de-chez-samsung-cest-loffre-des-soldes-a-ne-pas-rater-sur-amazon</guid>
      <description>
Orientable, compact et m&#234;me id&#233;al pour les gamers, le Samsung The FreeStyle 2 est un petit vid&#233;oprojecteur complet qui devrait vous faire passer l'envie d'avoir un TV. Actuellement, Amazon le propose d'ailleurs &#224; un excellent prix : seulement 366,51 euros. Il en valait 999 euros &#224; son lancement en 2023.
</description>
    </item>
    <item>
      <title>Gemini va bient&#244;t vous &#234;tre d&#8217;une grande aide dans vos r&#233;unions Google Meet</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2952991_gemini-va-bientot-vous-etre-dune-grande-aide-dans-vos-reunions-google-meet</link>
      <pubDate>Fri, 23 Jan 2026 09:46:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2952991_gemini-va-bientot-vous-etre-dune-grande-aide-dans-vos-reunions-google-meet</guid>
      <description>
Google &#233;tend l&#8217;assistant Ask Gemini dans Google Meet aux clients Workspace Business Standard, aux utilisateurs mobiles et &#224; de nouvelles langues, et c&#8217;est une bonne nouvelle.
</description>
    </item>
    <item>
      <title>Amazon s&#8217;appr&#234;te &#224; licencier 14&#160;000 employ&#233;s de plus</title>
      <link>https://www.01net.com/actualites/amazon-licencier-14-000-employes-plus.html</link>
      <pubDate>Fri, 23 Jan 2026 09:44:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322050</guid>
      <description>Amazon s&#8217;appr&#234;te &#224; lancer une deuxi&#232;me vague de licenciements. Le g&#233;ant de la vente en ligne voudrait supprimer environ 14 000 postes administratifs suppl&#233;mentaires pour atteindre son objectif de 30 000 employ&#233;s en moins.</description>
    </item>
    <item>
      <title>Galaxy Watch : Samsung reconna&#238;t un bug qui peut vous emp&#234;cher de dormir</title>
      <link>https://www.frandroid.com/marques/samsung/2952821_galaxy-watch-samsung-reconnait-un-bug-qui-peut-vous-empecher-de-dormir</link>
      <pubDate>Fri, 23 Jan 2026 09:44:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2952821_galaxy-watch-samsung-reconnait-un-bug-qui-peut-vous-empecher-de-dormir</guid>
      <description>
La mise &#224; jour des smartphones Samsung vers One UI 8 pose probl&#232;me aux possesseurs de montres Galaxy Watch avec un mode &#171; Ne pas d&#233;ranger &#187; qui se d&#233;sactive automatiquement.
</description>
    </item>
    <item>
      <title>G&#233;n&#233;rateur d&#8217;oxyg&#232;ne, airbags futuristes et 1 250 km d&#8217;autonomie : Huawei et Chery s&#8217;attaquent &#224; Mercedes avec leur nouvelle voiture &#233;lectrique</title>
      <link>https://www.frandroid.com/marques/luxeed/2952871_generateur-doxygene-airbags-futuristes-et-1-250-km-dautonomie-huawei-et-chery-sattaquent-a-mercedes-avec-leur-nouvelle-voiture-electrique</link>
      <pubDate>Fri, 23 Jan 2026 09:43:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/luxeed/2952871_generateur-doxygene-airbags-futuristes-et-1-250-km-dautonomie-huawei-et-chery-sattaquent-a-mercedes-avec-leur-nouvelle-voiture-electrique</guid>
      <description>
Luxeed, une marque cofond&#233;e par Huawei et Chery, vient de d&#233;voiler son V9, une voiture &#233;lectrique &#224; prolongateur qui ne se refuse rien. Le van embarquerait un g&#233;n&#233;rateur d'oxyg&#232;ne et des airbags encore in&#233;dits, tout en promettant jusqu'&#224; 1 250 km d'autonomie.
</description>
    </item>
    <item>
      <title>The Apple Pencil Pro is back on sale at Amazon &#8212; save over $30 right now</title>
      <link>https://mashable.com/article/jan-23-apple-pencil-pro-deal</link>
      <pubDate>Fri, 23 Jan 2026 09:39:37 +0000</pubDate>
      <guid isPermaLink="false">01zxyoDYH0iY2ZqqzYXx1Ti</guid>
      <description>Find the perfect deal on an iPad accessory. Save 26% on the Apple Pencil Pro at Amazon.</description>
    </item>
    <item>
      <title>Stuff Your Kindle Day is live &#8212; download free sports fiction ebooks until Jan. 24</title>
      <link>https://mashable.com/article/stuff-your-kindle-day-free-sports-fiction</link>
      <pubDate>Fri, 23 Jan 2026 09:37:28 +0000</pubDate>
      <guid isPermaLink="false">060lMZNflaHww7BJZnIRJHG</guid>
      <description>Don&#8217;t miss the latest Stuff Your Kindle Day. Download free sports fiction ebooks for your Kindle before the giveaway ends on Jan. 24.</description>
    </item>
    <item>
      <title>Smartphones Xiaomi&#160;: connaissez-vous cette astuce pour acc&#233;l&#233;rer votre connexion &#224; internet&#160;?</title>
      <link>https://www.01net.com/actualites/smartphones-xiaomi-connaissez-vous-cette-astuce-pour-accelerer-votre-connexion-a-internet.html</link>
      <pubDate>Fri, 23 Jan 2026 09:26:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313944</guid>
      <description>Xiaomi propose gr&#226;ce &#224; son syst&#232;me d&#8217;exploitation HyperOS 2, une &#171;&#160;acc&#233;l&#233;ration du r&#233;seau&#160;&#187;, ce syst&#232;me combine donn&#233;es mobiles et Wi-Fi afin d&#8217;augmenter votre vitesse de connexion.</description>
    </item>
  </channel>
</rss>
