<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 26 Jan 2026 11:25:28 GMT</lastBuildDate>
    <item>
      <title>Amazon multiplie les offres &#224; l&#8217;approche de la derni&#232;re d&#233;marque : les 17 meilleurs deals &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2933045_amazon-multiplie-les-offres-a-lapproche-de-la-derniere-demarque-les-17-meilleurs-deals-a-saisir</link>
      <pubDate>Mon, 26 Jan 2026 11:21:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933045_amazon-multiplie-les-offres-a-lapproche-de-la-derniere-demarque-les-17-meilleurs-deals-a-saisir</guid>
      <description>
On attaque une nouvelle semaine de soldes d&#8217;hiver et, &#224; quelques jours de la derni&#232;re d&#233;marque, Amazon met les bouch&#233;es doubles avec des offres tr&#232;s attractives sur de nombreux produits tech, notamment des smartphones pliants, des vid&#233;oprojecteurs &#224; prix cass&#233;.
</description>
    </item>
    <item>
      <title>Researchers say Russian government hackers were behind attempted Poland power outage</title>
      <link>https://www.techradar.com/pro/security/researchers-say-russian-government-hackers-were-behind-attempted-poland-power-outage</link>
      <pubDate>Mon, 26 Jan 2026 11:20:00 +0000</pubDate>
      <guid isPermaLink="false">siHSs2p6gbiSG8BDrcWCY</guid>
      <description>ESET says Sandworm used a piece of malware called DynoWiper to carry out attack on Polish systems.</description>
    </item>
    <item>
      <title>Gemini Live sur Android r&#232;gle enfin le plus gros d&#233;faut de son interface</title>
      <link>https://www.01net.com/actualites/gemini-live-android-regle-plus-gros-defaut-interface.html</link>
      <pubDate>Mon, 26 Jan 2026 11:19:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322418</guid>
      <description>La version Android de Gemini Live va devenir bien plus simple &#224; utiliser gr&#226;ce &#224; un nouveau bouton d'action flottant.</description>
    </item>
    <item>
      <title>Cette technologie issue de SpaceX pourrait sauver les data centers de la surchauffe (et sans une goutte d&#8217;eau)</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2954993_cette-technologie-issue-de-spacex-pourrait-sauver-les-data-centers-de-la-surchauffe-et-sans-une-goutte-deau</link>
      <pubDate>Mon, 26 Jan 2026 11:10:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2954993_cette-technologie-issue-de-spacex-pourrait-sauver-les-data-centers-de-la-surchauffe-et-sans-une-goutte-deau</guid>
      <description>
La start-up am&#233;ricaine Karman Industries travaille sur une nouvelle technologie de refroidissement pour les data centers, n&#233;cessitant beaucoup moins d'espace,&#160;d'&#233;lectricit&#233;&#160;et, surtout, aucune eau.
</description>
    </item>
    <item>
      <title>ARM pour un gamer ? Lenovo pr&#233;parerait une pluie de mod&#232;les sous Nvidia N1</title>
      <link>https://www.frandroid.com/marques/lenovo/2954661_arm-pour-un-gamer-lenovo-preparerait-une-pluie-de-modeles-sous-nvidia-n1</link>
      <pubDate>Mon, 26 Jan 2026 11:04:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lenovo/2954661_arm-pour-un-gamer-lenovo-preparerait-une-pluie-de-modeles-sous-nvidia-n1</guid>
      <description>
Lenovo a laiss&#233; filer les r&#233;f&#233;rences de 7 nouveaux mod&#232;les de PC portables, dont un nouveau gamer Legion 7, &#233;quip&#233;s de puces Nvidia N1 et N1X. Une solution ARM attendue de longue date, et dont la commercialisation interviendrait dans le courant d'ann&#233;e 2026.
</description>
    </item>
    <item>
      <title>People Are Protesting Data Centers&#8212;but Embracing the Factories That Supply Them</title>
      <link>https://www.wired.com/story/data-center-criticism-factories-supply-us/</link>
      <pubDate>Mon, 26 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">69711b3cec79c86b7151d776</guid>
      <description>As the data center backlash grows, support is growing for server factories and the hundreds of jobs they&#8217;re expected to bring.</description>
    </item>
    <item>
      <title>Une question de n&#233;gociation, pourquoi Forza Horizon 6 n&#8217;aura pas de version fran&#231;aise</title>
      <link>https://www.frandroid.com/actualites-generales/2954877_une-question-de-negociation-pourquoi-forza-horizon-6-naura-pas-de-version-francaise</link>
      <pubDate>Mon, 26 Jan 2026 10:59:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2954877_une-question-de-negociation-pourquoi-forza-horizon-6-naura-pas-de-version-francaise</guid>
      <description>
Le jeu Forza Horizon 6 a eu droit &#224; une pr&#233;sentation tr&#232;s compl&#232;te. Elle cachait une mauvaise nouvelle pour les joueurs fran&#231;ais : l'absence de VF pour le jeu, une premi&#232;re dans la s&#233;rie.
</description>
    </item>
    <item>
      <title>Getting your work apps up to speed with AI can really pay off</title>
      <link>https://www.techradar.com/pro/getting-your-work-apps-up-to-speed-with-ai-can-really-pay-off</link>
      <pubDate>Mon, 26 Jan 2026 10:57:38 +0000</pubDate>
      <guid isPermaLink="false">mZCJDUHpZcf3pv7Awgqkt</guid>
      <description>Cloudflare is warning of a "technical glass ceiling" where artificial intelligence is being held back by legacy tools and infrastructure.</description>
    </item>
    <item>
      <title>iOS 26&#160;: le nouveau Siri arriverait d&#232;s ce mois de f&#233;vrier sur l&#8217;iPhone</title>
      <link>https://www.01net.com/actualites/ios-26-le-nouveau-siri-arriverait-des-ce-mois-de-fevrier-sur-liphone.html</link>
      <pubDate>Mon, 26 Jan 2026 10:52:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322422</guid>
      <description>Le nouveau Siri aliment&#233; par Gemini pourrait faire ses premiers pas d&#232;s la mi-f&#233;vrier avec le d&#233;ploiement de la premi&#232;re b&#234;ta d&#8217;iOS 26.4.</description>
    </item>
    <item>
      <title>L&#8217;aspirateur qui passe (enfin) sous tous vos meubles est en promotion&#160;:&#160;d&#233;couvrez les p&#233;pites Dreame en soldes [Sponso]</title>
      <link>https://www.frandroid.com/marques/dreame/2944177_laspirateur-qui-passe-enfin-sous-tous-vos-meubles-est-en-promotion-decouvrez-les-pepites-dreame-en-soldes</link>
      <pubDate>Mon, 26 Jan 2026 10:50:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dreame/2944177_laspirateur-qui-passe-enfin-sous-tous-vos-meubles-est-en-promotion-decouvrez-les-pepites-dreame-en-soldes</guid>
      <description>
Pendant encore quelques jours, le sp&#233;cialiste des robots m&#233;nagers Dreame casse le prix de ses meilleurs aspirateurs et robots-tondeuses. De quoi prendre soin de sa maison sans effort et surtout sans se ruiner.
</description>
    </item>
    <item>
      <title>The DJI Mini 4K is 'the best budget drone for beginners' &#8212; and today's deal at Amazon beats the record-low from Black Friday</title>
      <link>https://www.techradar.com/cameras/drones/the-dji-4k-mini-is-the-best-budget-drone-for-beginners-and-right-now-its-on-sale-for-a-record-low-price-at-amazon</link>
      <pubDate>Mon, 26 Jan 2026 10:48:42 +0000</pubDate>
      <guid isPermaLink="false">iBmrDq8vANSyzYyAaucmdc</guid>
      <description>DJI's 4K Mini is our favorite budget drone for beginners and experienced pilots alike &#8211; here's why today's record-low deal at Amazon is so good.</description>
    </item>
    <item>
      <title>La manette Xbox Elite Series 2 au prix d&#8217;une manette classique : voici comment les soldes 2026 rendent &#231;a possible</title>
      <link>https://www.frandroid.com/bons-plans/2954583_la-manette-xbox-elite-series-2-au-prix-dune-manette-classique-voici-comment-les-soldes-2026-rendent-ca-possible</link>
      <pubDate>Mon, 26 Jan 2026 10:44:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2954583_la-manette-xbox-elite-series-2-au-prix-dune-manette-classique-voici-comment-les-soldes-2026-rendent-ca-possible</guid>
      <description>
Si vous souhaitez jouer avec du mat&#233;riel de pro, la manette haut de gamme Microsoft Xbox Elite Series 2 reconditionn&#233;e est sold&#233;e &#224; 77,99 euros au lieu de 109,90 euros.
</description>
    </item>
    <item>
      <title>&#171; L&#232;che-bottes des fascistes &#187; : Tim Cook est attaqu&#233; sur les r&#233;seaux apr&#232;s s&#8217;&#234;tre affich&#233; &#224; la Maison Blanche</title>
      <link>https://www.frandroid.com/culture-tech/politique/2954641_pourquoi-tim-cook-et-apple-sont-au-centre-dune-polemique-aux-etats-unis</link>
      <pubDate>Mon, 26 Jan 2026 10:43:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/politique/2954641_pourquoi-tim-cook-et-apple-sont-au-centre-dune-polemique-aux-etats-unis</guid>
      <description>
&#171; On te voit &#187;, &#171; l&#232;che-bottes des fascistes &#187;, Tim Cook, le patron d'Apple, fait l'objet de violentes attaques sur les r&#233;seaux sociaux. En cause, une projection de film &#224; la Maison-Blanche.
</description>
    </item>
    <item>
      <title>Waze : ces 5 nouvelles fonctions vont vous faciliter la vie au quotidien</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2954751_waze-ces-5-nouvelles-fonctions-vont-vous-faciliter-la-vie-au-quotidien</link>
      <pubDate>Mon, 26 Jan 2026 10:42:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2954751_waze-ces-5-nouvelles-fonctions-vont-vous-faciliter-la-vie-au-quotidien</guid>
      <description>
Bonne nouvelle si vous utilisez r&#233;guli&#232;rement Waze. L&#8217;application de navigation annonce l&#8217;arriv&#233;e de plusieurs nouvelles fonctionnalit&#233;s tr&#232;s pratiques. Et elles seront disponibles pour tous les utilisateurs.
</description>
    </item>
    <item>
      <title>The head of Xbox Game Studios says 'we're going to try and be more consistent' with its PS5 game release strategy</title>
      <link>https://www.techradar.com/gaming/the-head-of-xbox-game-studios-says-were-going-to-try-and-be-more-consistent-with-its-ps5-game-release-strategy</link>
      <pubDate>Mon, 26 Jan 2026 10:26:52 +0000</pubDate>
      <guid isPermaLink="false">DQXpfLhGAjWrEDQhpWSKCR</guid>
      <description>Xbox Game Studios boss Craig Duncan says its PS5 strategy is working, but admits it has been "inconsistent" in regards to certain titles.</description>
    </item>
    <item>
      <title>149 millions de mots de passe Gmail, Apple, Facebook, Netflix, TikTok et Binance ont &#233;t&#233; pirat&#233;s et expos&#233;s sur Internet</title>
      <link>https://www.01net.com/actualites/149-millions-mots-passe-gmail-apple-facebook-netflix-tiktok-binance-exposes-internet.html</link>
      <pubDate>Mon, 26 Jan 2026 10:22:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322375</guid>
      <description>Pr&#232;s de 150 millions d&#8217;identifiants et de mots de passe ont &#233;t&#233; pirat&#233;s par des malwares. Laiss&#233;s en libre-service sur Internet, ils permettent d'acc&#233;der &#224; des comptes Gmail, Facebook, Apple, Netflix ou encore Binance. Des coordonn&#233;es bancaires sont &#233;galement concern&#233;es.</description>
    </item>
    <item>
      <title>How to watch Wonder Man online from anywhere &#8212; stream Marvel's new hero</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/wonder-man-marvel-online</link>
      <pubDate>Mon, 26 Jan 2026 10:15:26 +0000</pubDate>
      <guid isPermaLink="false">Nu9KFCfUUU9BHqMaZk9MbT</guid>
      <description>Marvel Phase 6 welcomes a new superhero to the scene. Here&#8217;s how you can watch Wonder Man online and from anywhere.</description>
    </item>
    <item>
      <title>TikTok broke in its first weekend with US ownership</title>
      <link>https://www.theverge.com/news/867625/tiktok-down-weekend-broke-fyp-video-uploads-review</link>
      <pubDate>2026-01-26T05:10:13-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=867625</guid>
      <description>TikTok has suffered from extensive problems on its first weekend after completing the sale of its US arm, though some issues appear to have spread globally. TikTok has yet to confirm any issues a day after troubles began, making it difficult to surmise the extent of the problems. Nevertheless, Tiktokkers - including some Verge writers [&#8230;]</description>
    </item>
    <item>
      <title>Gmail issues saw it go a little haywire and start accusing user inboxes of being spam - here's what we know</title>
      <link>https://www.techradar.com/pro/gmail-issues-saw-it-go-a-little-haywire-and-start-accusing-user-inboxes-of-being-spam-heres-what-we-know</link>
      <pubDate>Mon, 26 Jan 2026 10:04:15 +0000</pubDate>
      <guid isPermaLink="false">2rtSyUx7df9fgvwGPgyNuR</guid>
      <description>Google Workspace users' Gmail inboxes were being flooded with emails after categorization and spam filtering went haywire.</description>
    </item>
    <item>
      <title>Apr&#232;s la riposte de Spotify, les 300 To de musique vol&#233;s par les Archives d&#8217;Anna en partie inaccessibles</title>
      <link>https://www.01net.com/actualites/apres-la-riposte-de-spotify-les-300-to-de-musique-voles-par-les-archives-danna-en-partie-inaccessibles.html</link>
      <pubDate>Mon, 26 Jan 2026 10:01:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321762</guid>
      <description>Spotify et les maisons de disque ont cherch&#233;, en toute discr&#233;tion, &#224; rendre inaccessibles les 300 t&#233;raoctets de musique r&#233;cup&#233;r&#233;s ill&#233;galement par la biblioth&#232;que pirate : une tentative en partie r&#233;ussie.</description>
    </item>
    <item>
      <title>The best kitchen gadgets for 2026</title>
      <link>https://www.engadget.com/home/kitchen-tech/best-kitchen-tech-gadgets-small-appliances-124515179.html?src=rss</link>
      <pubDate>Mon, 26 Jan 2026 10:00:36 +0000</pubDate>
      <guid isPermaLink="false">8426cf6e-f934-4619-897c-80069288696c</guid>
      <description>Whether you love cooking already or you want to try to cook more at home to spend less money on takeout, there are tons of gadgets that can make your time in the kitchen even more enjoyable. As food lovers and tech reviewers, the Engadget team has tried out pizza ovens, sous vide machines, air fryers, ice cream makers and more. Here, we gathered all of the best gear we&#8217;ve tested, reviewed and used in our own kitchens for when you&#8217;re looking to spice things up in yours. We&#8217;ve also linked to our reviews and buying guides so you can dive deeper into our recommendations for the best kitchen gadget...</description>
    </item>
    <item>
      <title>Despair-Inducing Analysis Shows AI Eroding the Reliability of Science Publishing</title>
      <link>https://gizmodo.com/despair-inducing-analysis-shows-ai-eroding-the-reliability-of-science-publishing-2000713786</link>
      <pubDate>Mon, 26 Jan 2026 10:00:19 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000713786</guid>
      <description>A flood of slop has arrived in science, and everyone has to get less lazy. But does 2026 feel like a time when anyone, anywhere, is getting less lazy?</description>
    </item>
    <item>
      <title>Combining the Artemis mission and AI will fuel a new surge of moon landing deniers</title>
      <link>https://www.fastcompany.com/91480178/combining-the-artemis-mission-and-ai-will-fuel-a-new-surge-of-moon-landing-deniers</link>
      <pubDate>2026-01-26T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480178/combining-the-artemis-mission-and-ai-will-fuel-a-new-surge-of-moon-landing-deniers</guid>
      <description>NASA will be launching its moon return effort in a period of major distrust in American scientific and government institutions, and, amid the proliferation of generative AI. Will people accept reality?
On my phone, there are already videos of the next moon landing. In one, an astronaut springs off the rung of a ladder, strung out from the lander, before slowly plopping to the surface. He is, alas, still getting accustomed to the weaker gravity. ...</description>
    </item>
    <item>
      <title>L&#8217;&#233;quipage d&#8217;Artemis II a &#233;t&#233; mis en quarantaine : on vous explique pourquoi</title>
      <link>https://www.futura-sciences.com/sciences/actualites/exploration-equipage-artemis-ii-ete-mis-quarantaine-on-vous-explique-130535/#xtor%3DRSS-8</link>
      <pubDate>Mon, 26 Jan 2026 10:59:44 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/exploration-equipage-artemis-ii-ete-mis-quarantaine-on-vous-explique-130535/#xtor%3DRSS-8</guid>
      <description>&#192; l&#8217;approche du d&#233;part d&#8217;Artemis II pour un p&#233;riple autour de la Lune, l&#8217;&#233;quipage est actuellement en p&#233;riode de quarantaine. C'est l'occasion de vous expliquer bri&#232;vement pourquoi ce confinement est essentiel. Dans une vid&#233;o r&#233;cemment publi&#233;e par l&#8217;Agence spatiale canadienne, le Dr Raffi...</description>
    </item>
    <item>
      <title>Amazon retire 160 &#8364; sur le pack DJI Mini 5 Pro, le nouveau roi des drones ultra compact not&#233; 9/10</title>
      <link>https://www.frandroid.com/bons-plans/2954645_amazon-retire-160-e-sur-le-pack-dji-mini-5-pro-le-nouveau-roi-des-drones-ultra-compact-note-9-10</link>
      <pubDate>Mon, 26 Jan 2026 09:58:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2954645_amazon-retire-160-e-sur-le-pack-dji-mini-5-pro-le-nouveau-roi-des-drones-ultra-compact-note-9-10</guid>
      <description>
Le DJI Mini 5 Pro s'impose comme la nouvelle r&#233;f&#233;rence des drones ultra-compacts. Not&#233; 9/10 par nos soins, c'est un appareil que l'on recommande chaudement. Il est d'ailleurs propos&#233; dans un pack complet &#224; 839 euros, contre 999 euros de base.&#160;
</description>
    </item>
    <item>
      <title>14 voitures &#233;lectriques test&#233;es par grand froid : voici celle qui s&#8217;en sort le mieux</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2954617_14-voitures-electriques-testees-par-grand-froid-voici-celle-qui-sen-sort-le-mieux</link>
      <pubDate>Mon, 26 Jan 2026 09:57:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2954617_14-voitures-electriques-testees-par-grand-froid-voici-celle-qui-sen-sort-le-mieux</guid>
      <description>
Peut-on envisager de partir en vacances d&#8217;hiver en voiture &#233;lectrique&#160;? L&#8217;ADAC a test&#233; 14 voitures &#233;lectriques par 0&#176;C sur autoroute, et les r&#233;sultats sont contrast&#233;s. Si l'Audi A6 et la Tesla Model Y tirent leur &#233;pingle du jeu avec une efficience remarquable, d'autres mod&#232;les voient leur consommation s'envoler de plus de 40 %.
</description>
    </item>
    <item>
      <title>Le &#171;&#160;Whoop killer&#160;&#187; de Garmin en approche ? Ce qu&#8217;on sait sur le myst&#233;rieux bracelet Cirqa</title>
      <link>https://www.frandroid.com/marques/garmin/2954673_le-whoop-killer-de-garmin-en-approche-ce-quon-sait-sur-le-mysterieux-bracelet-cirqa</link>
      <pubDate>Mon, 26 Jan 2026 09:57:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/garmin/2954673_le-whoop-killer-de-garmin-en-approche-ce-quon-sait-sur-le-mysterieux-bracelet-cirqa</guid>
      <description>
Garmin a publi&#233; sur son site Internet plusieurs pages au sujet de son bracelet connect&#233; &#171; Cirqa &#187; avant de les supprimer. 
</description>
    </item>
    <item>
      <title>On conna&#238;t les box internet pr&#233;f&#233;r&#233;es des fran&#231;ais en 2025, et c&#8217;est une Freebox qui occupe le bas du classement</title>
      <link>https://www.frandroid.com/telecom/box-internet/2954631_on-connait-les-box-internet-preferees-des-francais-en-2025-et-cest-une-freebox-qui-occupe-le-bas-du-classement</link>
      <pubDate>Mon, 26 Jan 2026 09:54:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/box-internet/2954631_on-connait-les-box-internet-preferees-des-francais-en-2025-et-cest-une-freebox-qui-occupe-le-bas-du-classement</guid>
      <description>
Chaque ann&#233;e, le comparateur Zone ADSL&amp;Fibre son barom&#232;tre de la satisfaction client sur le march&#233; des t&#233;l&#233;coms. On y d&#233;couvre notamment un classement des box pr&#233;f&#233;r&#233;es (et mal-aim&#233;es) des fran&#231;ais. Quant &#224; l'offre qui remporte une m&#233;daille d'or, ce n'est pas une grande surprise.
</description>
    </item>
    <item>
      <title>L&#8217;interdiction des r&#233;seaux sociaux aux moins de 15&#160;ans pourrait entrer en vigueur d&#232;s la rentr&#233;e prochaine</title>
      <link>https://www.frandroid.com/culture-tech/politique/2954633_linterdiction-des-reseaux-sociaux-aux-moins-de-15-ans-pourrait-entrer-en-vigueur-des-la-rentree-prochaine</link>
      <pubDate>Mon, 26 Jan 2026 09:50:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/politique/2954633_linterdiction-des-reseaux-sociaux-aux-moins-de-15-ans-pourrait-entrer-en-vigueur-des-la-rentree-prochaine</guid>
      <description>
Alors que le texte a &#233;t&#233; lourdement retoqu&#233; par le Conseil d&#8217;&#201;tat, Emmanuel Macron veut encore y croire et vient de demander &#224; ce que l&#8217;interdiction des r&#233;seaux sociaux aux mineurs de moins de 15&#160;ans soit effective d&#232;s la rentr&#233;e prochaine.
</description>
    </item>
    <item>
      <title>Fnac Darty mise sur un QR code pour bousculer l&#8217;&#233;lectrom&#233;nager d&#8217;occasion</title>
      <link>https://www.01net.com/actualites/fnac-darty-mise-sur-un-qr-code-pour-bousculer-lelectromenager-doccasion.html</link>
      <pubDate>Mon, 26 Jan 2026 09:43:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322363</guid>
      <description>D&#232;s 2026, Fnac Darty &#233;quipera plus d'un million d'appareils de gros &#233;lectrom&#233;nager d'un Passeport Produit. Ce QR code, v&#233;ritable carnet de sant&#233; num&#233;rique, vise &#224; s&#233;curiser le march&#233; de la seconde main.</description>
    </item>
    <item>
      <title>ChatGPT cite Grokipedia comme source&#160;: pourquoi il faut faire attention&#160;?</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2954639_chatgpt-cite-grokipedia-comme-source-pourquoi-il-faut-faire-attention</link>
      <pubDate>Mon, 26 Jan 2026 09:41:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2954639_chatgpt-cite-grokipedia-comme-source-pourquoi-il-faut-faire-attention</guid>
      <description>
Grokip&#233;dia, l&#8217;encyclop&#233;die collaborative d&#8217;Elon Musk, commence &#224; appara&#238;tre dans les sources de r&#233;ponses de ChatGPT. Une arriv&#233;e qui suscite la m&#233;fiance, l&#8217;encyclop&#233;die ayant &#233;t&#233; point&#233;e du doigt &#224; de multiples reprises pour ses propos mensongers et son r&#233;visionnisme historique. &#160;
</description>
    </item>
    <item>
      <title>Bient&#244;t des smartphones &#224; 6 GHz ? Qualcomm voudrait transformer nos mobiles en monstres de puissance avec le Snapdragon 8 Elite Gen 6 Pro</title>
      <link>https://www.frandroid.com/marques/qualcomm/2954715_bientot-des-smartphones-a-6-ghz-qualcomm-voudrait-transformer-nos-mobiles-en-monstres-de-puissance-avec-le-snapdragon-8-elite-gen-6-pro</link>
      <pubDate>Mon, 26 Jan 2026 09:36:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/qualcomm/2954715_bientot-des-smartphones-a-6-ghz-qualcomm-voudrait-transformer-nos-mobiles-en-monstres-de-puissance-avec-le-snapdragon-8-elite-gen-6-pro</guid>
      <description>
Qualcomm pourrait lancer deux versions de son futur Snapdragon 8 Elite Gen 6, dont une variante &#171; Pro &#187; capable d'atteindre une tr&#232;s haute fr&#233;quence d'horloge gr&#226;ce &#224; une gravure en 2 nm.
</description>
    </item>
    <item>
      <title>OpenAI is chasing advertising dollars. Can publishers cash in, too?</title>
      <link>https://www.fastcompany.com/91478679/openai-is-chasing-ad-dollars-can-publishers-cash-in-too</link>
      <pubDate>2026-01-26T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91478679/openai-is-chasing-ad-dollars-can-publishers-cash-in-too</guid>
      <description>ChatGPT launching ads could squeeze publishers further&#8212;or finally give them the leverage they&#8217;ve been waiting for.
It looks like OpenAI is taking the &#8220;new year, new you&#8221; approach when it comes to its business strategy. To kick off 2026, the company announced it would soon introduce ads into ChatGPT&#8212;which was a bit of a surprise, considering CEO Sam Altman had previously said ads would be a &#8220;last resort&#8221; as a business model....</description>
    </item>
    <item>
      <title>Galaxy S26&#160;: Samsung abandonnerait enfin cette configuration devenue obsol&#232;te</title>
      <link>https://www.01net.com/actualites/galaxy-s26-samsung-abandonnerait-configuration-devenue-obsolete.html</link>
      <pubDate>Mon, 26 Jan 2026 09:26:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322359</guid>
      <description>Bonne nouvelle si vous attendez le Galaxy S26, Samsung pourrait enfin se d&#233;barrasser d'une configuration qui a fait son temps.</description>
    </item>
  </channel>
</rss>
