<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 14 Jan 2026 11:25:51 GMT</lastBuildDate>
    <item>
      <title>Boulanger fait le plein d&#8217;offres pour le lancement de la 2e d&#233;marque des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2931541_boulanger-fait-le-plein-doffres-pour-le-lancement-de-la-2e-demarque-des-soldes</link>
      <pubDate>Wed, 14 Jan 2026 11:17:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931541_boulanger-fait-le-plein-doffres-pour-le-lancement-de-la-2e-demarque-des-soldes</guid>
      <description>
Ce mercredi 14 janvier sonne la 2e d&#233;marque des soldes d'hiver. Si vous n'avez pas encore eu l'occasion de jeter un oeil au catalogue de Boulanger, c'est le moment : l'enseigne d&#233;gaine de nouvelles offres attractives sur des smartphones haut de gamme, comme l'ancien flagship de Google. 
</description>
    </item>
    <item>
      <title>&#171; Les voitures &#233;lectriques sont-elles s&#251;res ? &#187; : voici la r&#233;ponse cinglante d&#8217;une ann&#233;e de crash-tests</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2942189_les-voitures-electriques-sont-elles-sures-voici-la-reponse-cinglante-dune-annee-de-crash-tests</link>
      <pubDate>Wed, 14 Jan 2026 11:16:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2942189_les-voitures-electriques-sont-elles-sures-voici-la-reponse-cinglante-dune-annee-de-crash-tests</guid>
      <description>
L'organisme Euro NCAP vient d'annoncer ses meilleurs r&#233;sultats de crash-tests en 2025. La bascule est concr&#232;te : les six vainqueurs sont toutes des voitures &#233;lectriques, dont deux Tesla.
</description>
    </item>
    <item>
      <title>I hate to agree with Nvidia about an AI thing, but come on, PC gamers &#8212; it's time to stop whining about 'fake frames' and take the free performance boosts</title>
      <link>https://www.techradar.com/computing/gpu/i-hate-to-agree-with-nvidia-about-an-ai-thing-but-come-on-pc-gamers-its-time-to-stop-whining-about-fake-frames-and-take-the-free-performance-boosts</link>
      <pubDate>Wed, 14 Jan 2026 11:14:09 +0000</pubDate>
      <guid isPermaLink="false">9F3YYfxHHKBsL5T8uhPUzn</guid>
      <description>"Computing has been fundamentally reshaped" &#8212; Nvidia wants you to stop complaining about 'fake frames' in games, and for once I actually kind of agree with Team Green.</description>
    </item>
    <item>
      <title>La Chine et les Pays-Bas se battent pour contr&#244;ler un fabricant de semi-conducteurs, aujourd&#8217;hui l&#8217;affaire peut basculer</title>
      <link>https://www.01net.com/actualites/la-chine-et-les-pays-bas-se-battent-pour-controler-un-fabricant-de-semi-conducteurs-aujourdhui-laffaire-peut-basculer.html</link>
      <pubDate>Wed, 14 Jan 2026 11:09:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304952</guid>
      <description>Dernier &#233;pisode en date dans l'affaire Nexperia, cette entreprise de puces &#233;lectroniques n&#233;erlandaise propri&#233;t&#233; d'un g&#233;ant chinois. Depuis trois mois, la soci&#233;t&#233; est la cible d'un conflit entre la Chine et l'Europe. Les Pays-Bas ont d&#233;cid&#233; de prendre le contr&#244;le de la soci&#233;t&#233; en septembre dernier, invoquant la &#171; s&#233;curit&#233; &#233;conomique de l'Europe &#187;, au grand dam de P&#233;kin. Une audience d&#233;cisive a lieu ce mercredi 14 janvier, qui pourrait impacter les industries de l'automobile europ&#233;ennes....</description>
    </item>
    <item>
      <title>Signal&#8217;s founder is taking on ChatGPT &#8212; here&#8217;s why the &#8216;truly private AI&#8217; can&#8217;t leak your chats</title>
      <link>https://www.techradar.com/ai-platforms-assistants/signals-founder-is-taking-on-chatgpt-heres-why-the-truly-private-ai-cant-leak-your-chats</link>
      <pubDate>Wed, 14 Jan 2026 11:05:27 +0000</pubDate>
      <guid isPermaLink="false">236iD5vV4g8jAtY6nkXA7M</guid>
      <description>Signal creator Moxie Marlinspike has launched Confer, a privacy-first AI assistant designed to ensure your conversations can&#8217;t be read, stored, or leaked.</description>
    </item>
    <item>
      <title>Sega ditches Nintendo's controversial Game-Key Cards for Sonic Racing: CrossWorlds' physical Switch 2 release</title>
      <link>https://www.techradar.com/gaming/sega-ditches-nintendos-controversial-game-key-cards-for-sonic-racing-crossworlds-physical-switch-2-release</link>
      <pubDate>Wed, 14 Jan 2026 11:04:24 +0000</pubDate>
      <guid isPermaLink="false">c7gjeuJYZeevYG488VGYqD</guid>
      <description>Sonic Racing: CrossWorlds' physical Nintendo Switch 2 release will be on the cartridge and not a Game-Key Card, Sega has confirmed.</description>
    </item>
    <item>
      <title>Cyberattaque contre le minist&#232;re de l&#8217;Int&#233;rieur&#160;: une incroyable n&#233;gligence est &#224; l&#8217;origine de l&#8217;intrusion</title>
      <link>https://www.01net.com/actualites/cyberattaque-contre-ministere-interieur-incroyable-negligence-origine-intrusion.html</link>
      <pubDate>Wed, 14 Jan 2026 11:02:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319952</guid>
      <description>Une incroyable n&#233;gligence a ouvert les portes du minist&#232;re de l&#8217;Int&#233;rieur. L'absence de double authentification a permis &#224; un jeune pirate de p&#233;n&#233;trer dans des applications de police sensibles. Le ministre Laurent Nu&#241;ez parle d'&#171;&#8239;un d&#233;faut d&#8217;hygi&#232;ne num&#233;rique&#8239;&#187; et assure que la double authentification est en cours de d&#233;ploiement.</description>
    </item>
    <item>
      <title>Split Fiction director Josef Fares praises Nintendo, Rockstar and Naughty Dog for 'pushing the envelope of innovation with a AAA budget'</title>
      <link>https://www.techradar.com/gaming/split-fiction-director-josef-fares-praises-nintendo-rockstar-and-naughty-dog-for-pushing-the-envelope-of-innovation-with-a-aaa-budget</link>
      <pubDate>Wed, 14 Jan 2026 11:01:48 +0000</pubDate>
      <guid isPermaLink="false">kuoL7jHh9fn86bpsuYtCfB</guid>
      <description>Split Fiction and It Takes Two director Josef Fares has commented on other AAA developers, saying that big-budget experiences can still be used to push innovation forward.</description>
    </item>
    <item>
      <title>P&#233;nurie de RAM : les constructeurs de PC portable ont un an de stock pour emp&#234;cher vos factures de grimper</title>
      <link>https://www.frandroid.com/marques/intel/2942193_penurie-de-ram-les-constructeurs-de-pc-portable-ont-un-an-de-stock-pour-empecher-vos-factures-de-grimper</link>
      <pubDate>Wed, 14 Jan 2026 11:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/intel/2942193_penurie-de-ram-les-constructeurs-de-pc-portable-ont-un-an-de-stock-pour-empecher-vos-factures-de-grimper</guid>
      <description>
La p&#233;nurie de RAM est l&#224;, mais votre portefeuille ne la sent pas encore. Alors que les prix de la m&#233;moire vive explosent, Intel r&#233;v&#232;le que les fabricants de PC portables dorment sur un tas d'or : pr&#232;s d'un an de stock de RAM. De quoi stabiliser les prix des laptops, le temps que Windows et les nouveaux processeurs apprennent &#224; &#234;tre plus sobres.
</description>
    </item>
    <item>
      <title>UK scraps digital ID requirement for workers</title>
      <link>https://www.engadget.com/cybersecurity/uk-scraps-digital-id-requirement-for-workers-105740207.html?src=rss</link>
      <pubDate>Wed, 14 Jan 2026 10:57:40 +0000</pubDate>
      <guid isPermaLink="false">8f5c38c4-eb5b-44bf-8951-02726a11c22c</guid>
      <description>The UK government has backtracked on a plan to require all workers to have a digital ID following a backlash. It will no longer be mandatory to register with the digital ID program to prove one has the right to work in the country, as the BBC reports.The government announced the now-scrapped digital ID requirement in September. "You will not be able to work in the United Kingdom if you do not have digital ID," Prime Minister Sir Keir Starmer said at the time. "It's as simple as that."&#160;The government still plans to fully transition to digital right-to-work checks by 2029, using the likes of bio...</description>
    </item>
    <item>
      <title>The Google Pixel 10a could launch early and at a surprise low price</title>
      <link>https://www.techradar.com/phones/google-pixel-phones/the-google-pixel-10a-could-launch-early-and-at-a-surprise-low-price</link>
      <pubDate>Wed, 14 Jan 2026 10:57:12 +0000</pubDate>
      <guid isPermaLink="false">2B3TiuLyLsLqVCEJUiCr2i</guid>
      <description>The Google Pixel 10a might land on February 17 and its possible colors, storage, and price have also leaked.</description>
    </item>
    <item>
      <title>Claude's latest upgrade is the AI breakthrough I've been waiting for &#8212; 5 ways Cowork could be the biggest AI innovation of 2026</title>
      <link>https://www.techradar.com/ai-platforms-assistants/claudes-latest-upgrade-is-the-ai-breakthrough-ive-been-waiting-for-5-ways-cowork-could-be-the-biggest-ai-innovation-of-2026</link>
      <pubDate>Wed, 14 Jan 2026 10:57:09 +0000</pubDate>
      <guid isPermaLink="false">bTjZJJ9JtNgt2Px2hB6HMY</guid>
      <description>Claude Cowork offers a glimpse of a near future where AI stops just responding to prompts and starts acting as a careful, capable digital coworker.</description>
    </item>
    <item>
      <title>Free augmente le prix de la Freebox Pop S, mais pas pour tout le monde</title>
      <link>https://www.frandroid.com/marques/free/2942225_free-augmente-le-prix-de-la-freebox-pop-s-mais-pas-pour-tous-le-monde</link>
      <pubDate>Wed, 14 Jan 2026 10:54:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2942225_free-augmente-le-prix-de-la-freebox-pop-s-mais-pas-pour-tous-le-monde</guid>
      <description>
Free annonce discr&#232;tement une hausse de prix de plusieurs abonnements Freebox. Heureusement, les anciens abonn&#233;s sont &#233;pargn&#233;s.
</description>
    </item>
    <item>
      <title>Pour les soldes d&#8217;hiver, ce puissant laptop gaming &#233;quip&#233; de la RTX 5080 perd plus de 1 000 euros &#224; la Fnac</title>
      <link>https://www.frandroid.com/bons-plans/2941891_pour-les-soldes-dhiver-ce-puissant-laptop-gaming-equipe-de-la-rtx-5080-perd-plus-de-1-000-euros-a-la-fnac</link>
      <pubDate>Wed, 14 Jan 2026 10:50:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2941891_pour-les-soldes-dhiver-ce-puissant-laptop-gaming-equipe-de-la-rtx-5080-perd-plus-de-1-000-euros-a-la-fnac</guid>
      <description>
Ce MSI Vector 17 HX AI est un puissant laptop gaming gr&#226;ce &#224; sa RTX 5080 et il est &#233;quip&#233; de la technologie Cooler Boost 5 pour &#233;viter qu'il ne chauffe. Pour les soldes d'hiver, la Fnac retire 1 200 euros de son prix et le fait tomber &#224; 2 799,99 euros.
</description>
    </item>
    <item>
      <title>Windscribe is building an ecosystem of privacy-first apps &#8211; but it doesn't want to own them</title>
      <link>https://www.techradar.com/vpn/vpn-services/windscribe-is-building-an-ecosystem-of-privacy-first-apps-but-it-doesnt-want-to-own-them</link>
      <pubDate>Wed, 14 Jan 2026 10:45:38 +0000</pubDate>
      <guid isPermaLink="false">2Lorc6wU83NvtTy3u5qnfB</guid>
      <description>Windscribe has just teamed up with a host of other companies to create an alliance of tools focused on user privacy and data protection. Pro users can redeem exclusive discounts.</description>
    </item>
    <item>
      <title>Pour se prot&#233;ger de l&#8217;IA, Matthew McConaughey brev&#232;te sa voix et son visage</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2941931_pour-se-proteger-de-lia-matthew-mcconaughey-brevete-sa-voix-et-son-visage</link>
      <pubDate>Wed, 14 Jan 2026 10:42:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2941931_pour-se-proteger-de-lia-matthew-mcconaughey-brevete-sa-voix-et-son-visage</guid>
      <description>
L&#8217;acteur principal d&#8217;Interstellar va faire de sa voix et de son image une marque pour lutter contre les d&#233;rives de l&#8217;intelligence artificielle.
</description>
    </item>
    <item>
      <title>On a compar&#233; les prix : Samsung lance son programme &#171; Reconditionn&#233; Premium &#187; pour les Galaxy S25 en France</title>
      <link>https://www.frandroid.com/marques/samsung/2942223_on-a-compare-les-prix-samsung-lance-son-programme-reconditionne-premium-pour-les-galaxy-s25-en-france</link>
      <pubDate>Wed, 14 Jan 2026 10:35:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2942223_on-a-compare-les-prix-samsung-lance-son-programme-reconditionne-premium-pour-les-galaxy-s25-en-france</guid>
      <description>
Vous voulez un Galaxy S25 Ultra sans payer le prix fort, mais le reconditionn&#233; vous fait peur ? Samsung arrive avec sa solution Certified Re-newed. C'est propre, c'est garanti deux ans, mais probl&#232;me : c'est surtout plus cher que le neuf dans bien des cas.
</description>
    </item>
    <item>
      <title>Google Photos : vos sauvegardes ne vont plus vider votre batterie gr&#226;ce &#224; cette option</title>
      <link>https://www.frandroid.com/marques/google/2941929_google-photos-vos-sauvegardes-ne-vont-enfin-plus-vider-votre-batterie-grace-a-cette-option</link>
      <pubDate>Wed, 14 Jan 2026 10:33:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2941929_google-photos-vos-sauvegardes-ne-vont-enfin-plus-vider-votre-batterie-grace-a-cette-option</guid>
      <description>
La sauvegarde sur Google Photos pourrait bient&#244;t vous prendre moins de batterie avec cette nouvelle option.
</description>
    </item>
    <item>
      <title>Best Bone Conduction Headphones (2026): Shokz, Suunto, Mojawa</title>
      <link>https://www.wired.com/gallery/best-bone-conduction-headphones/</link>
      <pubDate>Wed, 14 Jan 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">69614bd12527f40e71d0e9f3</guid>
      <description>Everyone needs a safe way to listen to music on outdoor runs. We&#8217;ve found the bone conduction headphones to grab on your way out the door.</description>
    </item>
    <item>
      <title>Fujifilm&#8217;s new camera has a &#8216;Gen Dial&#8217; so Gen Z can get the perfect retro shot</title>
      <link>https://www.fastcompany.com/91471514/fujifilm-instax-mini-evo-cinema</link>
      <pubDate>2026-01-14T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91471514/fujifilm-instax-mini-evo-cinema</guid>
      <description>Taking aesthetic, vintage-inspired photos and videos has never been easier.
Fujifilm&#8217;s newest camera model, the Instax Mini Evo Cinema, is a gadget that&#8217;s designed for the retro camera craze.</description>
    </item>
    <item>
      <title>AI hyperscalers need to restore trust&#8212;here&#8217;s how</title>
      <link>https://www.fastcompany.com/91472029/hyperscalers-ai-alphabet-meta-microsoft-amazon-oracle</link>
      <pubDate>2026-01-14T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91472029/hyperscalers-ai-alphabet-meta-microsoft-amazon-oracle</guid>
      <description>Those who build, deploy, and work with these systems must have a say in their future.
It&#8217;s hard to avoid the conclusion that the market for artificial intelligence and its associated industries are over inflated. In 2025, just five hyperscalers&#8212;Alphabet, Meta, Microsoft, Amazon, and Oracle&#8212;accounted for a capital investment of $399 billion, which will rise to over $600 billion annually in coming years. For the first nine months of last year, real GDP growth rate in the U.S. was 2.1%, but would have been 1.5% without the contribution of AI investment....</description>
    </item>
    <item>
      <title>There's a sneaky way to watch YouTube ad-free without a Premium subscription</title>
      <link>https://www.techradar.com/how-to-watch/theres-a-sneaky-way-to-watch-youtube-ad-free</link>
      <pubDate>Wed, 14 Jan 2026 10:25:20 +0000</pubDate>
      <guid isPermaLink="false">6FJX4hEkVkPYdSw3Z6t5jT</guid>
      <description>Here's how to watch YouTube ad-free from anywhere in the world, without coughing up for a Premium subscription.</description>
    </item>
    <item>
      <title>Businesses are losing control of AI - and bosses are starting to despair</title>
      <link>https://www.techradar.com/pro/businesses-are-losing-control-of-ai-and-bosses-are-starting-to-despair</link>
      <pubDate>Wed, 14 Jan 2026 10:25:00 +0000</pubDate>
      <guid isPermaLink="false">w3e6rimTBCLm7b883v8EXW</guid>
      <description>Employees are taking the AI laws into their own hands at work - and that's bad news for bosses everywhere.</description>
    </item>
    <item>
      <title>Des Galaxy S25 moins chers et quasi neufs&#160;: Samsung lance son programme &#171;&#160;Reconditionn&#233; Premium&#160;&#187; en France</title>
      <link>https://www.01net.com/actualites/galaxy-s25-moins-chers-quasi-neufs-samsung-lance-programme-reconditionne-premium-france.html</link>
      <pubDate>Wed, 14 Jan 2026 10:20:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319917</guid>
      <description>Samsung lance officiellement son programme de smartphones reconditionn&#233;s en France, d&#8217;abord pour les Galaxy S25. De quoi profiter de smartphones &#171; premium &#187; moins chers, tout en b&#233;n&#233;ficiant de composants d'origine et d'une garantie constructeur compl&#232;te. Mais les prix sont-ils vraiment int&#233;ressants ?</description>
    </item>
    <item>
      <title>Fnac et Darty se montrent tr&#232;s g&#233;n&#233;reux &#224; la 2e d&#233;marque des soldes : les 15 deals &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-vendent-au-rabais-de-nombreux-produits-tech-lors-des-soldes-dhiver-2026</link>
      <pubDate>Wed, 14 Jan 2026 10:13:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-vendent-au-rabais-de-nombreux-produits-tech-lors-des-soldes-dhiver-2026</guid>
      <description>
La 2e d&#233;marque des soldes d'hiver est lanc&#233;e ! Pour l'occasion, Fnac et Darty d&#233;gainent de nouvelles offres, &#224; commencer par un laptop gaming propuls&#233; par une RTX 5080 &#224; -30%, le Samsung Galaxy Edge &#224; prix cass&#233; ou encore un TV Samsung OLED en promo. Il y a de quoi se faire plaisir...
</description>
    </item>
    <item>
      <title>PSStream : l&#8217;application qui fait ce que Sony refuse de proposer sur PC avec les jeux PS5</title>
      <link>https://www.frandroid.com/produits-android/console/console-de-jeux/2942111_psstream-lapplication-qui-fait-ce-que-sony-refuse-de-proposer-sur-pc-avec-les-jeux-ps5</link>
      <pubDate>Wed, 14 Jan 2026 10:12:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/console-de-jeux/2942111_psstream-lapplication-qui-fait-ce-que-sony-refuse-de-proposer-sur-pc-avec-les-jeux-ps5</guid>
      <description>
Vous r&#234;viez de transformer votre Steam Deck en v&#233;ritable console PlayStation ? C'est d&#233;sormais possible. Une application nomm&#233;e PSStream vient de d&#233;barquer sur la plateforme de Valve pour moins de 4 &#8364;. Elle promet de faire ce que Sony r&#233;serve jalousement &#224; son PlayStation Portal : le streaming cloud des jeux PS5.
</description>
    </item>
    <item>
      <title>N3 Ultimate : JMGO muscle sa s&#233;rie N3 pour de tr&#232;s grandes images dans le salon</title>
      <link>https://www.frandroid.com/marques/jmgo/2942131_n3-ultimate-jmgo-muscle-sa-serie-n3-pour-de-tres-grandes-images-dans-le-salon</link>
      <pubDate>Wed, 14 Jan 2026 10:10:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/jmgo/2942131_n3-ultimate-jmgo-muscle-sa-serie-n3-pour-de-tres-grandes-images-dans-le-salon</guid>
      <description>
Pr&#233;sent&#233; en avant&#8209;premi&#232;re au CES 2026, le JMGO N3 Ultimate annonce un projecteur laser 4K tr&#232;s lumineux, taill&#233; pour des images jusqu&#8217;&#224; 300 pouces et un lancement pr&#233;vu au deuxi&#232;me trimestre 2026.
</description>
    </item>
    <item>
      <title>Elon Musk: Tesla FSD will soon become subscription-only</title>
      <link>https://mashable.com/article/tesla-fsd-subscription-only</link>
      <pubDate>Wed, 14 Jan 2026 10:08:22 +0000</pubDate>
      <guid isPermaLink="false">07rK6m6SY5wVXR5oT2MOOX0</guid>
      <description>Tesla will make its Full Self-Driving package subscription only soon, CEO Elon Musk tweeted.</description>
    </item>
    <item>
      <title>Cette montre aux airs d&#8217;Apple Watch Ultra promet deux semaines d&#8217;autonomie pour un prix vraiment accessible</title>
      <link>https://www.frandroid.com/marques/realme/2810415_cette-montre-connectee-a-des-allure-dapple-watch-ultra-mais-avec-deux-semaines-dautonomie-et-un-prix-bien-plus-accessible</link>
      <pubDate>Wed, 14 Jan 2026 10:05:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/realme/2810415_cette-montre-connectee-a-des-allure-dapple-watch-ultra-mais-avec-deux-semaines-dautonomie-et-un-prix-bien-plus-accessible</guid>
      <description>
Realme a lev&#233; le voile cette semaine sur sa nouvelle montre connect&#233;e, la Realme Watch 5, une montre au look d'Apple Watch Ultra pour dix fois moins cher
</description>
    </item>
    <item>
      <title>Samsung muscle son Galaxy A07 5G avec 6 ans de mises &#224; jour et une batterie g&#233;ante pour un prix d&#233;risoire</title>
      <link>https://www.frandroid.com/marques/samsung/2941909_samsung-muscle-son-galaxy-a07-5g-avec-6-ans-de-mises-a-jour-et-une-batterie-geante-pour-un-prix-derisoire</link>
      <pubDate>Wed, 14 Jan 2026 10:01:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2941909_samsung-muscle-son-galaxy-a07-5g-avec-6-ans-de-mises-a-jour-et-une-batterie-geante-pour-un-prix-derisoire</guid>
      <description>
Le futur Samsung Galaxy A07 5G ne semble plus avoir beaucoup de secrets. Android Authority a mis la main sur son support marketing. Au programme : une long&#233;vit&#233; logicielle record de 6 ans et des caract&#233;ristiques techniques en nette hausse.
</description>
    </item>
    <item>
      <title>NYT Mini crossword answers, hints for January 14, 2026</title>
      <link>https://mashable.com/article/nyt-mini-crossword-answers-hints-january-14-2026</link>
      <pubDate>Wed, 14 Jan 2026 10:01:31 +0000</pubDate>
      <guid isPermaLink="false">03nH2bjhHq9EktCyjhxrUfH</guid>
      <description>Answers to each clue for the January 14, 2026 edition of NYT's The Mini crossword puzzle.</description>
    </item>
    <item>
      <title>The best USB-C hub for 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-usb-c-hub-120051833.html?src=rss</link>
      <pubDate>Wed, 14 Jan 2026 10:01:25 +0000</pubDate>
      <guid isPermaLink="false">5611e47c-9ecd-44d1-bf4d-bb3708b5554e</guid>
      <description>Having fewer ports makes laptops and tablets lighter and more affordable &#8212; but that also cuts down on your connectivity options. If you&#8217;ve got a MacBook Air, a slim Chromebook or a tablet you&#8217;d like to get more utility out of, a USB-C hub can help. Using just a single port on your device, these multiport adapters will let you hook up screens, tap into Ethernet cables, connect mice and keyboards, and transfer data to drives and memory cards. Most also give you a way to power your device through the hub to maximize port availability. We tested over a dozen models to come up with picks for every ...</description>
    </item>
    <item>
      <title>Piratage des IBAN : Free &#233;cope d&#8217;une amende de 42 millions d&#8217;euros</title>
      <link>https://www.frandroid.com/marques/free/2941993_piratage-des-iban-free-ecope-dune-amende-de-42-millions-deuros</link>
      <pubDate>Wed, 14 Jan 2026 10:01:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2941993_piratage-des-iban-free-ecope-dune-amende-de-42-millions-deuros</guid>
      <description>
Apr&#232;s le piratage massif de 2024, et pour avoir mal s&#233;curis&#233; les donn&#233;es de ses clients, Free &#233;cope d'une amende record de 42 millions d'euros.
</description>
    </item>
    <item>
      <title>&#171; La course aux caract&#233;ristiques techniques est finie &#187; : Carl Pei, co-fondateur de Nothing, alerte sur la situation du march&#233; des smartphones</title>
      <link>https://www.frandroid.com/marques/2941773_la-course-aux-caracteristiques-techniques-est-finie-dapres-le-patron-de-nothing-les-prix-des-smartphones-vont-exploser-de-30-en-2026</link>
      <pubDate>Wed, 14 Jan 2026 10:00:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2941773_la-course-aux-caracteristiques-techniques-est-finie-dapres-le-patron-de-nothing-les-prix-des-smartphones-vont-exploser-de-30-en-2026</guid>
      <description>
Carl Pei, le patron de Nothing, a &#233;galement pris la parole concernant la p&#233;nurie de m&#233;moire vive : 2026 sera l'ann&#233;e o&#249; les smartphones cesseront d'&#234;tre "abordables". La cause ? Une explosion des co&#251;ts de la m&#233;moire, aspir&#233;e par les serveurs de l'IA, qui pourrait faire grimper la facture de 30 % selon lui.
</description>
    </item>
    <item>
      <title>7 Best Phones You Can&#8217;t Buy in the US (2026), Tested and Reviewed</title>
      <link>https://www.wired.com/gallery/best-phones-you-cant-buy-in-the-united-states/</link>
      <pubDate>Wed, 14 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">67cac20bb1ef86e09d408a9e</guid>
      <description>Wondering what you&#8217;re missing out on? Here are our favorite smartphones that aren&#8217;t officially sold stateside but are available in markets like the UK and Europe.</description>
    </item>
    <item>
      <title>In the U.K., Reddit is king</title>
      <link>https://www.fastcompany.com/91469167/reddit-tiktok-britain-social-media</link>
      <pubDate>2026-01-14T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91469167/reddit-tiktok-britain-social-media</guid>
      <description>Three in five Brits now encounter the site while online, up from one-third in 2023.
Reddit is now the fourth most visited social media platform in the U.K., overtaking TikTok.&#160;</description>
    </item>
    <item>
      <title>Why Levi&#8217;s is teaching high schoolers how to mend their clothes</title>
      <link>https://www.fastcompany.com/91472058/why-levis-is-teaching-high-schoolers-how-to-mend-their-clothes</link>
      <pubDate>2026-01-14T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91472058/why-levis-is-teaching-high-schoolers-how-to-mend-their-clothes</guid>
      <description>The denim brand is launching a high school curriculum to teach students how to stitch up tears and replace buttons. 
Amanda Lee McCarty, sustainability consultant and host of the Clotheshorse podcast, remembers fixing a tear on her Forever 21 shirt with a stapler&#8212;just long enough to get through the workday before tossing it out.</description>
    </item>
    <item>
      <title>Why it feels so good when a meeting gets canceled, according to science</title>
      <link>https://www.fastcompany.com/91473062/why-it-feels-so-good-when-a-meeting-gets-canceled-according-to-science</link>
      <pubDate>2026-01-14T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91473062/why-it-feels-so-good-when-a-meeting-gets-canceled-according-to-science</guid>
      <description>It was just a weekly 30-minute catch-up with a colleague. Why are you so freaking relieved?
You know the feeling: You&#8217;re replying to emails, navigating open tabs, responding to direct messages, when suddenly, it happens&#8212;your standing weekly 2 p.m. gets canceled abruptly. &#8220;Giving everyone 30 minutes back today,&#8221; the organizer says. A rush courses through your nervous system: You&#8217;re free....</description>
    </item>
    <item>
      <title>Why Anthropic&#8217;s new &#8216;Cowork&#8217; could be the first really useful general-purpose AI agent</title>
      <link>https://www.fastcompany.com/91474357/why-anthropics-new-cowork-could-be-the-first-really-useful-general-purpose-ai-agent</link>
      <pubDate>2026-01-14T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91474357/why-anthropics-new-cowork-could-be-the-first-really-useful-general-purpose-ai-agent</guid>
      <description>Anthropic announced a new general-purpose AI agent tool on Monday called Cowork&#8212;and it may emerge as the first actually useful agent tool for work.&#160;
Anthropic&#8217;s Claude Code tool is having a moment: It&#8217;s recently become popular among software developers for its use of agents to write code, run tests, call tools, and multitask. In recent months the company has begun to stress that Claude Code isn&#8217;t just for developers, but can let other kinds of workers build websites, create presentations, and do research&#8212;and stories about non-coders completing interesting projects have filled social media....</description>
    </item>
    <item>
      <title>Webb telescope zooms in on a black holes messy feeding zone</title>
      <link>https://mashable.com/article/james-webb-space-telescope-circinus-galaxy-black-hole</link>
      <pubDate>Wed, 14 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02AChB9qlrGkAIOypWbRDjb</guid>
      <description>NASA's James Webb Space Telescope discovers that most of the hot matter at a galaxy's central black hole is falling in, not blasting out.</description>
    </item>
    <item>
      <title>16 of the best MIT courses you can take online for free</title>
      <link>https://mashable.com/article/free-mit-courses-january-2026</link>
      <pubDate>Wed, 14 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00eICuMwtFJHJNORB1suzzU</guid>
      <description>Find the best free online courses from MIT. Find lessons on AI, investing, and much more.</description>
    </item>
    <item>
      <title>Turn your iPhone or iPad into a scanner for less than $40</title>
      <link>https://mashable.com/article/jan-14-iscanner-app-lifetime-subscription</link>
      <pubDate>Wed, 14 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">07KR47zl0nnQtfhYNi5Wxeq</guid>
      <description>Scan anything, anywhere with a lifetime subscription to the iScanner App, now only $39.99 (reg. $199.90)</description>
    </item>
    <item>
      <title>Start 2026 strong with this deeply discounted Microsoft Office license</title>
      <link>https://mashable.com/article/jan-14-microsoft-office-2024-home-business</link>
      <pubDate>Wed, 14 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">032bH5PTmH4jndZWIK1uYhJ</guid>
      <description>Give yourself a whole new set of tools with this lifetime license to Microsoft Office 2024 Home and Business for Mac or PC, now just $99.97 (reg. $249.99).</description>
    </item>
    <item>
      <title>When in Westerosi history does A Knight of the Seven Kingdoms take place?</title>
      <link>https://mashable.com/article/a-knight-of-the-seven-kingdoms-westeros-timeline</link>
      <pubDate>Wed, 14 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02Fv3yZzQCt2dPjDzdLaPzX</guid>
      <description>From "Game of Thrones" to "House of the Dragon," here's where "A Knight of the Seven Kingdoms" falls on the Westerosi timeline.</description>
    </item>
    <item>
      <title>18 of the best AI courses you can take online for free</title>
      <link>https://mashable.com/article/free-ai-courses-january-2026</link>
      <pubDate>Wed, 14 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">002bcCCH8wJ3biYTjPKKVyi</guid>
      <description>Find free AI courses. Find the best free online AI courses in January 2026.</description>
    </item>
    <item>
      <title>How is Percy Jackson and the Olympians Season 2 different from the books?</title>
      <link>https://mashable.com/article/percy-jackson-season-2-differences-between-book-and-show</link>
      <pubDate>Wed, 14 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01Ns1ywzStDRngpV5pBpabv</guid>
      <description>"Percy Jackson and the Olympians" Season 2 makes several changes from Rick Riordan's "The Sea of Monsters." Let's break them down.</description>
    </item>
    <item>
      <title>How to watch the 2025 Africa Cup of Nations online for free</title>
      <link>https://mashable.com/article/africa-cup-of-nations-2025-live-stream-for-free</link>
      <pubDate>Wed, 14 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01x6w2GJ5DTY19LQCP9NGqI</guid>
      <description>How to watch Africa Cup of Nations for free. Live stream the 2025 Africa Cup of Nations for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Could this be the best value phone of 2026? Get the Google Pixel 10 for a record-low price at Amazon &#8212; but it's selling out fast</title>
      <link>https://www.techradar.com/phones/google-pixel-phones/could-this-be-the-best-value-phone-of-2026-get-the-google-pixel-10-for-a-record-low-price-at-amazon-but-its-selling-out-fast</link>
      <pubDate>Wed, 14 Jan 2026 09:45:12 +0000</pubDate>
      <guid isPermaLink="false">grLEnBatj9F8UHpFNjWV7K</guid>
      <description>The Google Pixel 10 plummets to a record-low price of under &#163;600 in this limited-time deal at Amazon &#8212; but you'll need to move fast as it's already over 50% sold out.</description>
    </item>
    <item>
      <title>Mandat d&#8217;arr&#234;t contre le PDG de OnePlus&#160;: de quoi Ta&#239;wan accuse Pete Lau&#160;?</title>
      <link>https://www.01net.com/actualites/mandat-darret-contre-pdg-de-oneplus-taiwan-accuse-pete-lau.html</link>
      <pubDate>Wed, 14 Jan 2026 09:39:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319931</guid>
      <description>Un mandat d'arr&#234;t a &#233;t&#233; &#233;mis par Taiwan &#224; l'encontre de Pete Lau, le cofondateur et PDG de OnePlus. L'entrepreneur chinois est accus&#233; d&#8217;avoir recrut&#233; ill&#233;galement plus de 70 ing&#233;nieurs ta&#239;wanais via des soci&#233;t&#233;s &#233;cran, en violation avec la loi en vigueur &#224; Taiwan.</description>
    </item>
    <item>
      <title>Google Traduction pourrait bient&#244;t profiter de sa plus importante mise &#224; jour</title>
      <link>https://www.01net.com/actualites/google-traduction-pourrait-bientot-profiter-de-sa-plus-importante-mise-a-jour.html</link>
      <pubDate>Wed, 14 Jan 2026 09:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319934</guid>
      <description>Google serait en train de pr&#233;parer une des plus importantes mises &#224; jour pour son application de traduction.</description>
    </item>
    <item>
      <title>The Samsung Galaxy S25 Ultra is reduced further at Amazon &#8212; save over $300</title>
      <link>https://mashable.com/article/jan-14-samsung-galaxy-s25-ultra-deal</link>
      <pubDate>Wed, 14 Jan 2026 09:26:46 +0000</pubDate>
      <guid isPermaLink="false">06LqqJCvXRdbhmRbEiJzSPJ</guid>
      <description>Get the best smartphone deal. Save 23% on the Samsung Galaxy S25 Ultra at Amazon.</description>
    </item>
  </channel>
</rss>
