<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 21 Nov 2025 16:46:27 GMT</lastBuildDate>
    <item>
      <title>Samsung's huge Black Friday sale features record-low prices on OLED TVs, Galaxy S25 Ultra, appliances, and more</title>
      <link>https://www.techradar.com/phones/samsungs-huge-black-friday-sale-features-record-low-prices-on-oled-tvs-galaxy-s25-ultra-appliances-and-more</link>
      <pubDate>Fri, 21 Nov 2025 16:42:37 +0000</pubDate>
      <guid isPermaLink="false">LhRqcMvDGevgDzJtXN8kDh</guid>
      <description>Samsung's incredible Black Friday deals offer record-low prices on our favorite TVs, phones, and more today</description>
    </item>
    <item>
      <title>Could this be the best Sony Black Friday headphones bargain this year? Get the Sony WH-1000XM4 for a song</title>
      <link>https://www.techradar.com/audio/wireless-headphones/could-this-be-the-best-sony-black-friday-headphones-bargain-this-year-get-the-sony-wh-1000xm4-for-a-song</link>
      <pubDate>Fri, 21 Nov 2025 16:40:15 +0000</pubDate>
      <guid isPermaLink="false">YjFPMdVLnyfrZN3EwoAN94</guid>
      <description>We've been singing these Sony's praises for ages, and now they're close to half price</description>
    </item>
    <item>
      <title>&#171;&#160;Nous ne nous sentons plus en s&#233;curit&#233; en France&#160;&#187; : pourquoi GrapheneOS retire ses serveurs de France suite &#224; un article du Parisien</title>
      <link>https://www.frandroid.com/android/2881329_nous-ne-nous-sentons-plus-en-securite-en-france-pourquoi-grapheneos-retire-ses-serveurs-de-france-suite-a-un-article-du-parisien</link>
      <pubDate>Fri, 21 Nov 2025 16:37:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/2881329_nous-ne-nous-sentons-plus-en-securite-en-france-pourquoi-grapheneos-retire-ses-serveurs-de-france-suite-a-un-article-du-parisien</guid>
      <description>
La situation vient de d&#233;raper s&#233;rieusement. Suite &#224; un article du Parisien qualifiant GrapheneOS d'outil privil&#233;gi&#233; des narcotrafiquants, les d&#233;veloppeurs de cet OS s&#233;curis&#233; ont pris une d&#233;cision radicale. Ils annoncent leur d&#233;part imm&#233;diat de France et la migration de leurs serveurs h&#233;berg&#233;s chez OVH.
</description>
    </item>
    <item>
      <title>Amazon's Black Friday Apple deals don't disappoint &#8211; staggering record-low prices on AirPods, Apple Watch, MacBooks and more</title>
      <link>https://www.techradar.com/seasonal-sales/amazons-black-friday-apple-deals-dont-disappoint-staggering-record-low-prices-on-airpods-apple-watch-macbooks-and-more</link>
      <pubDate>Fri, 21 Nov 2025 16:36:31 +0000</pubDate>
      <guid isPermaLink="false">YbUykMRFpXRwt78g37WRqR</guid>
      <description>The best Black Friday Apple deals are live on Amazon, and I'm rounding up the lowest prices you'll find on AirPods, Apple Watches, iPads, MacBooks, and more.</description>
    </item>
    <item>
      <title>Best Buy's Black Friday deals are here &#8211; I've found 19 top offers from $17.99</title>
      <link>https://www.techradar.com/seasonal-sales/best-buys-black-friday-deals-are-here-ive-found-19-top-offers-from-usd17-99</link>
      <pubDate>Fri, 21 Nov 2025 16:35:15 +0000</pubDate>
      <guid isPermaLink="false">BvAy8K7LpZDyitX8ZLrnAZ</guid>
      <description>This year's Best Buy Black Friday sale has started, so I've searched through the retailer to bring you 19 of the best deals on TVs, laptops, appliances, headphones, games consoles, and more.</description>
    </item>
    <item>
      <title>Qualit&#233; des r&#233;seaux mobiles en 2025&#160;: toujours des zones injustement oubli&#233;es</title>
      <link>https://www.01net.com/actualites/qualite-des-reseaux-mobiles-en-2025-toujours-des-zones-injustement-oubliees.html</link>
      <pubDate>Fri, 21 Nov 2025 16:35:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310046</guid>
      <description>L&#8217;Arcep vient de publier les r&#233;sultats de sa campagne de mesure de la qualit&#233; du r&#233;seau mobile fran&#231;ais. L&#8217;&#233;tude met en concurrence les services des op&#233;rateurs et montre une performance g&#233;n&#233;rale &#233;lev&#233;e du r&#233;seau. Toutefois, des disparit&#233;s persistent dans les territoires ruraux.</description>
    </item>
    <item>
      <title>Bitcoin Developers&#8217; Pardon Request Creates Awkward Situation for Trump</title>
      <link>https://gizmodo.com/bitcoin-developers-pardon-request-creates-awkward-situation-for-trump-2000689156</link>
      <pubDate>Fri, 21 Nov 2025 16:34:06 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000689156</guid>
      <description>It's demonstrably worth a try.</description>
    </item>
    <item>
      <title>&#8216;The Acolyte&#8217; Creator Opens Up About the Show&#8217;s Public Cancelation</title>
      <link>https://gizmodo.com/leslye-headland-acolyte-cancelation-star-wars-2000689473</link>
      <pubDate>Fri, 21 Nov 2025 16:30:39 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000689473</guid>
      <description>Leslye Headland thinks a few things contributed to 'The Acolyte' being a one-and-done show, including different parts of the 'Star Wars' community.</description>
    </item>
    <item>
      <title>Fujifilm Instax Mini LiPlay+ Review: A Camera and Printer in One</title>
      <link>https://www.wired.com/review/fujifilm-instax-mini-liplay-plus/</link>
      <pubDate>Fri, 21 Nov 2025 16:30:00 +0000</pubDate>
      <guid isPermaLink="false">6904f091bfda9cf6f0d70c59</guid>
      <description>Fujifilm's latest Instax instant camera and printer hybrid gets a dedicated selfie lens and some fun new printing options.</description>
    </item>
    <item>
      <title>Philips Hue lights crash to record-low prices for Black Friday &#8211; save up to 54%</title>
      <link>https://www.techradar.com/home/smart-lights/philips-hue-lights-crash-to-record-low-prices-for-black-friday-save-up-to-54-percent</link>
      <pubDate>Fri, 21 Nov 2025 16:29:05 +0000</pubDate>
      <guid isPermaLink="false">63S3mNBXSryaBDLin2jgo3</guid>
      <description>If you've been waiting for the right time to stock up on Philips Hue bulbs, that moment is now &#8211; so don't wait!</description>
    </item>
    <item>
      <title>Fnac et Darty ont attendu la Black Week pour d&#233;gainer leurs meilleures offres</title>
      <link>https://www.frandroid.com/bons-plans/2869625_fnac-et-darty-ont-attendu-la-black-week-pour-degainer-leurs-meilleures-offres</link>
      <pubDate>Fri, 21 Nov 2025 16:26:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2869625_fnac-et-darty-ont-attendu-la-black-week-pour-degainer-leurs-meilleures-offres</guid>
      <description>
La Black Friday Week vient tout juste de d&#233;marrer chez la Fnac et Darty, et les nouvelles offres affluent d&#233;j&#224;. Pour vous faire gagner du temps, nous avons s&#233;lectionn&#233; les meilleures promotions du moment. 
</description>
    </item>
    <item>
      <title>Amazon fait son show lors de la Black Friday Week et d&#233;stocke &#224; petit prix ses nouveaux produits Fire TV 4K, Echo Dot, Kindle&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2874197_amazon-fait-son-show-lors-de-la-black-friday-week-et-destocke-a-petit-prix-ses-nouveaux-produits-fire-tv-4k-echo-dot-kindle</link>
      <pubDate>Fri, 21 Nov 2025 16:21:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2874197_amazon-fait-son-show-lors-de-la-black-friday-week-et-destocke-a-petit-prix-ses-nouveaux-produits-fire-tv-4k-echo-dot-kindle</guid>
      <description>
Une avalanche de promotions est accessible sur Amazon avec l&#8217;apparition quotidienne de nouvelles offres, en particulier sur les appareils maison du g&#233;ant comme les enceintes Echo, les cam&#233;ras connect&#233;es Blink, les liseuses Kindle ou encore les Fire TV.&#160;
</description>
    </item>
    <item>
      <title>Jimdo adds AI to its website builder, promises better business outcomes</title>
      <link>https://www.techradar.com/pro/jimdo-adds-ai-to-its-website-builder-promises-better-business-outcomes</link>
      <pubDate>Fri, 21 Nov 2025 16:20:35 +0000</pubDate>
      <guid isPermaLink="false">oCJ5M4dq8qVLGwkwK4sKBe</guid>
      <description>With Companion, users can ask "strategic questions" and get actionable answers from the AI.</description>
    </item>
    <item>
      <title>Saturn Will Look Naked in the Night Sky This Weekend</title>
      <link>https://gizmodo.com/saturn-will-look-naked-in-the-night-sky-this-weekend-2000689525</link>
      <pubDate>Fri, 21 Nov 2025 16:20:24 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000689525</guid>
      <description>A rare alignment between Earth and Saturn will make the gas giant&#8217;s rings appear so thin that they&#8217;ll be nearly invisible.</description>
    </item>
    <item>
      <title>Trump Energy department drops renewables, promotes fusion in office reshuffle</title>
      <link>https://techcrunch.com/2025/11/21/trump-energy-department-drops-renewables-promotes-fusion-in-office-reshuffle/</link>
      <pubDate>Fri, 21 Nov 2025 16:19:51 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069979</guid>
      <description>The revamped organizational structure cut at least one office authorized by Congress, which could spur legal challenges.</description>
    </item>
    <item>
      <title>La fonderie Intel en passe de r&#233;ussir son pari&#8230; gr&#226;ce &#224; son principal concurrent ?</title>
      <link>https://www.frandroid.com/marques/intel/2880137_la-fonderie-intel-en-passe-de-reussir-son-pari-grace-a-son-principal-concurrent</link>
      <pubDate>Fri, 21 Nov 2025 16:11:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/intel/2880137_la-fonderie-intel-en-passe-de-reussir-son-pari-grace-a-son-principal-concurrent</guid>
      <description>
Au bout du compte, la pr&#233;sence de TSMC en Arizona ferait les affaires d'Intel Foundry, tr&#232;s implant&#233; aux &#201;tats-Unis. On apprend que la filiale semi-conducteur d'Intel aurait sign&#233; avec un quatuor de tr&#232;s grands groupes am&#233;ricains, non pas pour la gravure de leurs puces... mais pour leur packaging.
</description>
    </item>
    <item>
      <title>The best privacy laws in the world: These three VPNs are on sale for a limited time</title>
      <link>https://www.techradar.com/vpn/vpn-services/the-best-privacy-laws-in-the-world-these-three-vpns-are-on-sale-for-a-limited-time</link>
      <pubDate>Fri, 21 Nov 2025 16:08:30 +0000</pubDate>
      <guid isPermaLink="false">rog8bFmHsfjuutkfhjaUEJ</guid>
      <description>NordVPN, Proton VPN, and Privado VPN operate under the best VPN jurisdictions when it comes to privacy. Even better, they have already slashed their prices for Black Friday.</description>
    </item>
    <item>
      <title>My all-time favourite air fryer is less than &#163;30 in Amazon's Black Friday sale</title>
      <link>https://www.techradar.com/seasonal-sales/my-all-time-favourite-air-fryer-is-less-than-gbp30-in-amazons-black-friday-sale</link>
      <pubDate>Fri, 21 Nov 2025 16:08:18 +0000</pubDate>
      <guid isPermaLink="false">C8ncX7k42umVLX6gCwo4yR</guid>
      <description>I use my Instant Vortex air fryer every day, and this Black Friday deal is spectacular value for money.</description>
    </item>
    <item>
      <title>Black Friday DJI deals &#8211; record-low prices on drones, action cameras and more</title>
      <link>https://www.techradar.com/cameras/drones/black-friday-dji-deals-record-low-prices-on-drones-action-cameras-and-more</link>
      <pubDate>Fri, 21 Nov 2025 16:04:57 +0000</pubDate>
      <guid isPermaLink="false">ZbaaCNSGMeiQTYhszZwyXC</guid>
      <description>As if DJI's drones and action cams weren't affordable enough already, there's a now a big sale on its popular products, including the Neo, Pocket 3 and Mini 4K.</description>
    </item>
    <item>
      <title>The 10 best Bluetooth speaker Black Friday deals, based on our reviewers' testing</title>
      <link>https://www.techradar.com/audio/wireless-bluetooth-speakers/the-10-best-bluetooth-speaker-black-friday-deals-based-on-our-reviewers-testing</link>
      <pubDate>Fri, 21 Nov 2025 16:04:23 +0000</pubDate>
      <guid isPermaLink="false">RqQw5g5xaKgteFi59MvFJW</guid>
      <description>Have a very Bluetooth Black Friday with these sensational speakers</description>
    </item>
    <item>
      <title>The best Black Friday home office deals 2025 are now live - these are my picks for professionals working from home</title>
      <link>https://www.techradar.com/seasonal-sales/live/black-friday-home-office-deals</link>
      <pubDate>Fri, 21 Nov 2025 16:04:04 +0000</pubDate>
      <guid isPermaLink="false">fQtojNwKwUsRV2FeTasjn8</guid>
      <description>I'm tracking down all the gear you need for a home office refresh and upgrade this Black Friday with deals on office chairs, desks, laptops, stationery, and more.</description>
    </item>
    <item>
      <title>Le Black Friday fait le m&#233;nage dans les stocks : aspirateurs robots, robots tondeuses, aspirateurs balais&#8230; tout y passe !</title>
      <link>https://www.frandroid.com/bons-plans/2876363_black-friday-week-aspirateur-robot-robot-tondeuse-aspirateur-balais-la-selection-des-meilleures-offres</link>
      <pubDate>Fri, 21 Nov 2025 16:04:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2876363_black-friday-week-aspirateur-robot-robot-tondeuse-aspirateur-balais-la-selection-des-meilleures-offres</guid>
      <description>
C'est le moment d'acqu&#233;rir un compagnon pour vos t&#226;ches du quotidien. Aspirateur robot, balai laveur ou robot tondeuse, nous avons s&#233;lectionn&#233; les meilleures offres de la Black Friday Week. 
</description>
    </item>
    <item>
      <title>I&#8217;ve been searching for the ultimate Black Friday cheap headphones deal, and I think I just found it</title>
      <link>https://www.techradar.com/audio/wireless-headphones/ive-been-searching-for-the-ultimate-black-friday-cheap-headphones-deal-and-i-think-i-just-found-it</link>
      <pubDate>Fri, 21 Nov 2025 16:02:00 +0000</pubDate>
      <guid isPermaLink="false">RV5uknxn9Uuw6NhPkyRQVD</guid>
      <description>My favorite budget headphones are cheaper than ever for Black Friday.</description>
    </item>
    <item>
      <title>65+ early Black Friday deals: Score huge discounts on MacBooks, AirPods, Kindles, Bose headphones, and Ninja appliances</title>
      <link>https://mashable.com/article/best-early-black-friday-live-deals-2025</link>
      <pubDate>Fri, 21 Nov 2025 16:01:33 +0000</pubDate>
      <guid isPermaLink="false">02LXL9FdRGPC9ceXlw6xvOc</guid>
      <description>Get the latest Black Friday deals on Apple products, vacuums, headphones, power stations, and Legos. Save $250 on a new Apple laptop and 27% on a new Kindle.</description>
    </item>
    <item>
      <title>Dell et HP privent de nombreux utilisateurs d&#8217;une fonction essentielle</title>
      <link>https://www.01net.com/actualites/dell-et-hp-privent-de-nombreux-utilisateurs-dune-fonction-essentielle.html</link>
      <pubDate>Fri, 21 Nov 2025 16:00:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310159</guid>
      <description>Mauvaise surprise pour de nombreux utilisateurs de PC sign&#233;s HP et Dell. Il leur est devenu impossible de lire dans leur navigateur web des vid&#233;os encod&#233;es en HEVC, un format tr&#232;s courant sur internet. Une histoire de gros sous pour les constructeurs qui rechignent &#224; payer la licence. Les utilisateurs touch&#233;s ont cependant des alternatives.</description>
    </item>
    <item>
      <title>Limited edition PS5 controllers get massive price cuts in the PlayStation Direct Black Friday sale</title>
      <link>https://www.techradar.com/gaming/limited-edition-ps5-controllers-get-massive-price-cuts-in-the-playstation-direct-black-friday-sale</link>
      <pubDate>Fri, 21 Nov 2025 16:00:08 +0000</pubDate>
      <guid isPermaLink="false">eWgtPM9zWfop6MFdWdkhrZ</guid>
      <description>PlayStation Direct has gone weapons hot on its sales and even includes price cuts on exclusive and limited edition controllers - including 30th Anniversary stock.</description>
    </item>
    <item>
      <title>There Is Only One AI Company. Welcome to the Blob</title>
      <link>https://www.wired.com/story/ai-industry-monopoly-nvidia-microsoft-google/</link>
      <pubDate>Fri, 21 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">691cce99e3f8c54a0182c517</guid>
      <description>As Nvidia, OpenAI, Google, and Microsoft forge partnerships and deals, the AI industry is looking more like one interconnected machine. What does that mean for all of us?</description>
    </item>
    <item>
      <title>U.S. releases a new female crash test dummy that more closely resembles women</title>
      <link>https://www.fastcompany.com/91447068/female-crash-test-dummy-women</link>
      <pubDate>2025-11-21T16:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91447068/female-crash-test-dummy-women</guid>
      <description>The new female dummy&#160;more accurately reflects differences&#160;between men and women, including the shape of the neck, collarbone, pelvis, and legs.
The U.S. government on Thursday released a new crash test dummy design that advocates believe will help make cars safer for women.</description>
    </item>
    <item>
      <title>Satellites en basse orbite | La souverainet&#233; num&#233;rique se&#160;d&#233;place dans&#160;l&#8217;espace</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-11-21/satellites-en-basse-orbite/la-souverainete-numerique-se-deplace-dans-l-espace.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Fri, 21 Nov 2025 11:00:00 -0500</pubDate>
      <guid isPermaLink="false">57407fdead083731b4eb44c3e3dffe53</guid>
      <description>La domination de SpaceX dans le ciel n&#8217;est plus incontest&#233;e. De nouveaux acteurs comme AST SpaceMobile et la canadienne T&#233;l&#233;sat d&#233;ploient des strat&#233;gies cibl&#233;es qui offrent une solution de rechange cr&#233;dible et souvent plus structur&#233;e au r&#233;seau Starlink de la soci&#233;t&#233; a&#233;rospatiale am&#233;ricaine.</description>
    </item>
    <item>
      <title>X was down again&#8211; here's how its latest outage played out</title>
      <link>https://www.techradar.com/news/live/x-is-down-outage-november-21</link>
      <pubDate>Fri, 21 Nov 2025 15:59:45 +0000</pubDate>
      <guid isPermaLink="false">zeH6zp2DBFsf6nTjWstpa6</guid>
      <description>X suffered a major blip again this week, with thousands reporting that the social media site was down in the both the US and UK &#8211;but it seems to have recovered.</description>
    </item>
    <item>
      <title>Black Friday 2025: Live updates on the latest deals from Amazon, Target, Walmart, and more</title>
      <link>https://mashable.com/live/black-friday-live-deals-updates-2025</link>
      <pubDate>Fri, 21 Nov 2025 15:59:34 +0000</pubDate>
      <guid isPermaLink="false">01OcFXXN1Y8YOzZvFp2WxIO</guid>
      <description>Get live updates on Black Friday sales. We found savings of $150 on Dyson Supersonic hair dryers and $300 on Samsung TVs.</description>
    </item>
    <item>
      <title>The best early Black Friday TV deals in 2025: Our favorite 65-inch QLED is under $900</title>
      <link>https://mashable.com/article/best-early-black-friday-tv-live-deals-2025</link>
      <pubDate>Fri, 21 Nov 2025 15:59:16 +0000</pubDate>
      <guid isPermaLink="false">06Jye1D94qstDkEQEaC5mvN</guid>
      <description>Early Black Friday TV deals are already extremely good at Amazon, Walmart, and Best Buy. Hisense, TCL, and Amazon are leading the way.</description>
    </item>
    <item>
      <title>SonicWall tells customers to patch SonicOS flaw allowing hackers to crash firewalls</title>
      <link>https://www.techradar.com/pro/security/sonicwall-tells-customers-to-patch-sonicos-flaw-allowing-hackers-to-crash-firewalls</link>
      <pubDate>Fri, 21 Nov 2025 15:54:00 +0000</pubDate>
      <guid isPermaLink="false">X65TaLnrynNL72TW5jo7J6</guid>
      <description>A high-severity flaw was found in SonicWall OS SSLVPN which can be used to trigger DoS.</description>
    </item>
    <item>
      <title>Ross and TJ Maxx are winning the retail wars as shoppers flock to off-price stores to battle higher costs</title>
      <link>https://www.fastcompany.com/91446947/ross-and-tj-maxx-are-winning-the-retail-wars-as-shoppers-flock-to-off-price-stores-to-battle-higher-costs</link>
      <pubDate>2025-11-21T15:53:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91446947/ross-and-tj-maxx-are-winning-the-retail-wars-as-shoppers-flock-to-off-price-stores-to-battle-higher-costs</guid>
      <description>Data from Placer.ai indicates that foot traffic has increased at retailers known for discount prices. This week&#8217;s earnings reports suggest the same.
The following sentence might cause anxiety. As Thanksgiving looms near, it&#8217;s time to begin holiday shopping. </description>
    </item>
    <item>
      <title>Xiaomi casse les prix de ses meilleurs produits lors de la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2858733_xiaomi-casse-les-prix-de-ses-meilleurs-produits-lors-de-la-black-friday-week</link>
      <pubDate>Fri, 21 Nov 2025 15:52:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2858733_xiaomi-casse-les-prix-de-ses-meilleurs-produits-lors-de-la-black-friday-week</guid>
      <description>
Pour le d&#233;part de la Black Friday Week, Xiaomi propose une s&#233;rie d&#8217;offres sur ses smartphones, ses tablettes et bracelets connect&#233;s... Voici les meilleurs produits Tech en promotion que l&#8217;on recommande.
</description>
    </item>
    <item>
      <title>Youll never lose your valuables again after these early Black Friday deals on Bluetooth trackers</title>
      <link>https://mashable.com/article/best-early-black-friday-bluetooth-tracker-deals-2025</link>
      <pubDate>Fri, 21 Nov 2025 15:40:22 +0000</pubDate>
      <guid isPermaLink="false">05JCWbnDqYrmIni6xElUY8h</guid>
      <description>Find the best early Black Friday bluetooth tracker deals in 2025.</description>
    </item>
    <item>
      <title>Samsung Odyssey G5 Oled : cet excellent &#233;cran PC gaming perd plus de 200 &#8364; de son prix lors de la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2880563_samsung-odyssey-g5-oled-cet-excellent-ecran-pc-gaming-perd-plus-de-200-e-de-son-prix-lors-de-la-black-friday-week</link>
      <pubDate>Fri, 21 Nov 2025 15:39:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2880563_samsung-odyssey-g5-oled-cet-excellent-ecran-pc-gaming-perd-plus-de-200-e-de-son-prix-lors-de-la-black-friday-week</guid>
      <description>
Samsung, c&#8217;est l&#8217;un des ma&#238;tres incontest&#233;s de la dalle OLED avec LG dans le r&#244;le du rival. Et quand la firme cor&#233;enne d&#233;cide de m&#234;ler son savoir-faire &#224; l&#8217;univers du gaming, &#231;a donne des joujoux comme le tout r&#233;cent Odyssey G5 : un 27 pouces QD-OLED, 180 Hz, qui accepte de s&#8217;offrir &#224; prix malin pour la Black Friday Week. Son &#233;tiquette passe de 599 euros &#224; 389 euros sur Rakuten gr&#226;ce &#224; un code promo.
...</description>
    </item>
    <item>
      <title>Zorin OS peut remercier Microsoft, la distribution Linux passe le cap du million de t&#233;l&#233;chargements</title>
      <link>https://www.01net.com/actualites/zorin-os-peut-remercier-microsoft-la-distribution-linux-passe-le-cap-du-million-de-telechargements.html</link>
      <pubDate>Fri, 21 Nov 2025 15:37:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310113</guid>
      <description>Zorin OS peut &#234;tre fi&#232;re de son succ&#232;s. La distribution Linux vient officiellement de f&#234;ter son premier million de t&#233;l&#233;chargements en un peu plus d&#8217;un mois. Une prouesse que l&#8217;OS doit sans doute &#224; la fin r&#233;cente du support de Windows 10.</description>
    </item>
    <item>
      <title>Good lord, the AirPods Black Friday deals are even better than I hoped &#8211; mostly</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/good-lord-the-airpods-black-friday-deals-are-even-better-than-i-hoped-mostly</link>
      <pubDate>Fri, 21 Nov 2025 15:35:44 +0000</pubDate>
      <guid isPermaLink="false">dwQNksZ47ZZVymHN74dYN3</guid>
      <description>Sweet deals are made of this: get the best AirPods for less</description>
    </item>
    <item>
      <title>Bonne nouvelle : AirDrop sur Android fonctionne aussi pour l&#8217;envoi de fichiers vers les Mac et les iPad</title>
      <link>https://www.frandroid.com/marques/google/2880803_bonne-nouvelle-airdrop-sur-android-fonctionne-aussi-pour-lenvoi-de-fichiers-vers-les-mac-et-les-ipad</link>
      <pubDate>Fri, 21 Nov 2025 15:32:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2880803_bonne-nouvelle-airdrop-sur-android-fonctionne-aussi-pour-lenvoi-de-fichiers-vers-les-mac-et-les-ipad</guid>
      <description>
Apr&#232;s l'arriv&#233;e surprise du support d'AirDrop sur Android, Google confirme que l'&#233;change de fichiers ne se cantonne pas aux iPhone. Les Mac et les iPad sont &#233;galement concern&#233;s. 
</description>
    </item>
    <item>
      <title>Its already playtime thanks to these early Black Friday deals on toys and games</title>
      <link>https://mashable.com/article/best-early-black-friday-toys-deals-2025</link>
      <pubDate>Fri, 21 Nov 2025 15:31:36 +0000</pubDate>
      <guid isPermaLink="false">04P0pD1qZ0U210P1P6sa0NT</guid>
      <description>Grab the best early Black Friday toy deals in 2025.</description>
    </item>
    <item>
      <title>Trump and Mamdani are meeting for the first time today. What to know</title>
      <link>https://www.fastcompany.com/91447043/trump-mamdani-meeting-white-house</link>
      <pubDate>2025-11-21T15:30:59</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91447043/trump-mamdani-meeting-white-house</guid>
      <description>Despite casting each other as prime adversaries, Trump and Mamdani have indicated an openness to finding areas of agreement that help the city they&#8217;ve both called home.
President Donald Trump has called New York City&#8217;s Mayor-elect Zohran Mamdani a &#8220;100% Communist Lunatic&#8221; and a &#8220;total nut job.&#8221; Mamdani has called&#160;Trump&#8217;s administration &#8220;authoritarian&#8221;&#160;and described himself as &#8220;Donald Trump&#8217;s worst nightmare.&#8221;...</description>
    </item>
    <item>
      <title>James Cameron Reveals the One Thing That Brought Linda Hamilton Back for &#8216;T2&#8217;</title>
      <link>https://gizmodo.com/james-cameron-linda-hamilton-terminator-2-2000689231</link>
      <pubDate>Fri, 21 Nov 2025 15:30:42 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000689231</guid>
      <description>Cameron's new film, 'Avatar: Fire and Ash,' is coming soon, so he's looking back at his incredible career.</description>
    </item>
    <item>
      <title>Free est pr&#234;t &#224; d&#233;ployer la 5G+ sur iPad, mais Apple tra&#238;ne des pieds</title>
      <link>https://www.frandroid.com/marques/free/2880621_free-est-pret-a-deployer-la-5g-sur-ipad-mais-apple-traine-des-pieds</link>
      <pubDate>Fri, 21 Nov 2025 15:30:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2880621_free-est-pret-a-deployer-la-5g-sur-ipad-mais-apple-traine-des-pieds</guid>
      <description>
Alors que les clients Orange peuvent profiter de la 5G+ sur leur iPad depuis quelques mois, toujours rien chez Free. Pourtant l'op&#233;rateur y travaille.
</description>
    </item>
    <item>
      <title>11 Best Smartwatches (2025): Apple, Wear OS, Hybrid &amp; Kids&#8217; Watches</title>
      <link>https://www.wired.com/gallery/best-smartwatches/</link>
      <pubDate>Fri, 21 Nov 2025 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">5e29b90b0cdf9300086f8e7a</guid>
      <description>These WIRED-tested wearables reduce your reliance on a phone while keeping you connected.</description>
    </item>
    <item>
      <title>The PlayStation 5 Slim and Pro are on sale for Black Friday</title>
      <link>https://www.theverge.com/gadgets/824326/playstation-5-ps5-pro-black-friday-deal-sale-2025</link>
      <pubDate>2025-11-21T10:28:01-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=824326</guid>
      <description>Black Friday is still a week away, but Sony has already slashed the price of three PlayStation 5 models. The PS5 Digital Edition (slim) is down to around $399 ($100 off) &#8212; its lowest price of the year &#8212; at Amazon, Best Buy, and Walmart. The standard PS5 (slim) is also on sale for around [&#8230;]</description>
    </item>
    <item>
      <title>New anti-Mamdani AI videos and the deepfake generation of astroturfing</title>
      <link>https://www.fastcompany.com/91446713/tiktok-instagram-mamdani-deepfake-astroturfing</link>
      <pubDate>2025-11-21T15:27:42</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91446713/tiktok-instagram-mamdani-deepfake-astroturfing</guid>
      <description>&#8220;In the last election cycle, hiring human influencers to spread a particular message was all the rage. Now, teams don&#8217;t even need those personalities.&#8221;
A creepy account that&#8217;s almost certainly using AI to generate videos of imaginary New Yorkers criticizing mayor-elect Zohran Mamdani raises a frightening prospect: that deepfakes could be used not just to impersonate politicians, but also constituents.&#160;...</description>
    </item>
    <item>
      <title>What is Google AI Mode &#8211; and should you use it?</title>
      <link>https://www.techradar.com/ai-platforms-assistants/gemini/what-is-google-ai-mode-and-should-you-use-it</link>
      <pubDate>Fri, 21 Nov 2025 15:25:05 +0000</pubDate>
      <guid isPermaLink="false">nm3nE6DRjPBb2opwN8tJmh</guid>
      <description>Google AI Mode has been supercharged by the latest Gemini update, but should it really become your default way to search?</description>
    </item>
    <item>
      <title>The 30+ best early Black Friday Apple deals: Stunning best-ever prices on AirPods and MacBooks</title>
      <link>https://mashable.com/article/best-early-black-friday-apple-deals-2025-lowest-ever-macbooks-and-airpods</link>
      <pubDate>Fri, 21 Nov 2025 15:23:38 +0000</pubDate>
      <guid isPermaLink="false">00aFulRZIgVQC88EoOuvEqK</guid>
      <description>Mashable has dug up the best early Black Friday Apple deals, including year-round lows on AirPods and MacBooks.</description>
    </item>
    <item>
      <title>A glimpse into the next decade of connectivity: 4 lessons from Yotta 2025</title>
      <link>https://www.techradar.com/pro/a-glimpse-into-the-next-decade-of-connectivity-4-lessons-from-yotta-2025</link>
      <pubDate>Fri, 21 Nov 2025 15:16:11 +0000</pubDate>
      <guid isPermaLink="false">hXTQr29vwdaRuYfyw3oQai</guid>
      <description>Trust in the public Internet is collapsing&#8212;private networks and satellites are replacing it now.</description>
    </item>
    <item>
      <title>AI agents are invading your PC</title>
      <link>https://www.theverge.com/podcast/825979/ai-agents-are-invading-your-pc</link>
      <pubDate>2025-11-21T10:15:22-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=825979</guid>
      <description>For a long, long time, Windows looked like Windows. The version numbers and features changed, but the basic structure of the computer didn't. With Windows 8, Microsoft tried to completely change things&#8230; and we know how that went over. So Windows, by and large, went back to being Windows. And people were mostly grateful for [&#8230;]</description>
    </item>
    <item>
      <title>Galaxy S25, Z Flip FE, Galaxy Watch&#8230; tous les produits Samsung sont &#224; prix cass&#233;s &#224; la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2852851_galaxy-s25-z-flip-fe-galaxy-watch-tous-les-produits-samsung-sont-a-prix-casses-a-la-black-friday-week</link>
      <pubDate>Fri, 21 Nov 2025 15:12:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2852851_galaxy-s25-z-flip-fe-galaxy-watch-tous-les-produits-samsung-sont-a-prix-casses-a-la-black-friday-week</guid>
      <description>
Samsung d&#233;marre sa Black Friday Week avec des promotions sur les smartphones Galaxy S25 et S25 Ultra, allant jusqu'&#224; plus de 200 euros de r&#233;duction imm&#233;diate, ainsi que des remises sur les TV OLED et QLED, avec jusqu'&#224; 1&#8239;000&#8239;euros d&#8217;&#233;conomies, et des bonus suppl&#233;mentaires via des codes promo. 
</description>
    </item>
    <item>
      <title>SpaceX&#8217;s upgraded Starship suffers explosion during testing</title>
      <link>https://techcrunch.com/2025/11/21/spacexs-upgraded-starship-suffers-explosion-during-testing/</link>
      <pubDate>Fri, 21 Nov 2025 15:08:14 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069964</guid>
      <description>It may not have been a massive fireball, but SpaceX now has more work to do before it can kick off this next-generation version of Starship.</description>
    </item>
    <item>
      <title>ChatGPT&#160;: les discussions en groupe disponibles pour tout le monde</title>
      <link>https://www.01net.com/actualites/chatgpt-le-chat-en-groupe-arrive-enfin-mais-il-y-a-un-hic.html</link>
      <pubDate>Fri, 21 Nov 2025 15:07:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308125</guid>
      <description>OpenAI d&#233;ploie enfin les discussions de groupe sur ChatGPT, permettant jusqu&#8217;&#224; vingt participants dans une m&#234;me conversation. Une avanc&#233;e taill&#233;e pour la collaboration, mais qui se fait encore attendre en France.</description>
    </item>
    <item>
      <title>US FCC repeals cybersecurity rules aimed at preventing Salt Typhoon-esque attacks</title>
      <link>https://www.techradar.com/pro/security/us-fcc-repeals-cybersecurity-rules-aimed-at-preventing-salt-typhoon-esque-attacks</link>
      <pubDate>Fri, 21 Nov 2025 15:05:00 +0000</pubDate>
      <guid isPermaLink="false">CFS6DCBpUcChTQdMbeWBsT</guid>
      <description>The US FCC has voted to remove mandated network security and risk management.</description>
    </item>
    <item>
      <title>M&#234;me les Apple iPad et les Samsung Galaxy Tab sont en promo pendant la Black Friday Week ! Notre s&#233;lection d&#8217;offres</title>
      <link>https://www.frandroid.com/bons-plans/2850637_pre-black-friday-tablettes-ipad-galaxy-tab-les-meilleures-offres-avant-derniere-ligne-droite</link>
      <pubDate>Fri, 21 Nov 2025 15:03:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850637_pre-black-friday-tablettes-ipad-galaxy-tab-les-meilleures-offres-avant-derniere-ligne-droite</guid>
      <description>
Longtemps sur une pente d&#233;l&#233;t&#232;re, le march&#233; des tablettes tactiles conna&#238;t depuis quelques mois un net regain. Un retour en force que l'on doit notamment aux fabricants chinois et &#224; leurs exemplaires &#224; prix cass&#233;. Et ceux-ci s'av&#232;rent encore plus int&#233;ressants pendant la Black Friday Week.
</description>
    </item>
    <item>
      <title>Meilleurs smartphones photo 2025 : notre s&#233;lection des photophones &#224; acheter</title>
      <link>https://www.frandroid.com/guide-dachat/smartphones/367607_meilleurs-smartphones-photos</link>
      <pubDate>Fri, 21 Nov 2025 15:02:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/smartphones/367607_meilleurs-smartphones-photos</guid>
      <description>
L'appareil photo est souvent un point majeur lorsqu&#8217;il s&#8217;agit de choisir un nouveau t&#233;l&#233;phone. Lors de nos tests, c'est un domaine que nous scrutons pr&#233;cis&#233;ment. Voici notre s&#233;lection des meilleurs smartphones photo du march&#233;.
</description>
    </item>
    <item>
      <title>On a test&#233; le Hyundai Ioniq 9, une voiture &#233;lectrique XXL qui n&#8217;a pas peur des longs voyages</title>
      <link>https://www.frandroid.com/marques/hyundai/2863931_on-a-teste-le-hyundai-ioniq-9-une-voiture-electrique-xxl-qui-na-pas-peur-des-longs-voyages</link>
      <pubDate>Fri, 21 Nov 2025 15:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/hyundai/2863931_on-a-teste-le-hyundai-ioniq-9-une-voiture-electrique-xxl-qui-na-pas-peur-des-longs-voyages</guid>
      <description>
Apr&#232;s la petite Inster, Hyundai lance en France son total oppos&#233; : le Ioniq 9. Cette immense voiture &#233;lectrique peut accueillir jusqu'&#224; sept personnes et promet un d&#233;luge de technologies, incluant une autonomie solide et une recharge (vraiment) rapide. Nous l'avons essay&#233;, voici notre avis.
</description>
    </item>
    <item>
      <title>The Best Motorola Phones (2025), Tested and Reviewed</title>
      <link>https://www.wired.com/story/best-motorola-phones/</link>
      <pubDate>Fri, 21 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">6484b9ab0124a91cee27d98c</guid>
      <description>Motorola phones may seem old-school, but their reasonable prices, colorful designs, and simple software make them good, wallet-friendly Android smartphones.</description>
    </item>
    <item>
      <title>AI nutrition tracking stinks</title>
      <link>https://www.theverge.com/column/825219/optimizer-ai-nutrition-tracking-wellness</link>
      <pubDate>2025-11-21T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=825219</guid>
      <description>This is Optimizer, a weekly newsletter sent every Friday from Verge senior reviewer Victoria Song that dissects and discusses the latest phones, smartwatches, apps, and other gizmos that swear they're going to change your life. Optimizer arrives in our subscribers' inboxes at 10AM ET. Opt in for Optimizer here. Once again, AI is failing to [&#8230;]</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Saturday, November 22 (game #895)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-22-november-2025</link>
      <pubDate>Fri, 21 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">HhJqfWYPNwExWzJmpeut3Z</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Saturday, November 22 (game #1398)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-22-november-2025</link>
      <pubDate>Fri, 21 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">e4vcDq8Ykqhbmbo2jrm6ZD</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Saturday, November 22 (game #629)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-22-november-2025</link>
      <pubDate>Fri, 21 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">4K6Gbdu3dbnGJyVygDtt7N</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>7 new movies and TV shows to watch on Netflix, Prime Video, HBO Max, and more this weekend (November 21)</title>
      <link>https://www.techradar.com/streaming/7-new-movies-and-tv-shows-to-watch-on-netflix-prime-video-hbo-max-and-more-this-weekend-november-21</link>
      <pubDate>Fri, 21 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">SCfqx3aSt6W8mEk3wcAaZF</guid>
      <description>Netflix has some big releases out this week, but its rivals also provide some healthy competition on the new movies and TV shows front.</description>
    </item>
    <item>
      <title>Yankee Candle designed a new luxury candle line</title>
      <link>https://www.fastcompany.com/91445070/yankee-candle-designed-a-new-luxury-candle-line</link>
      <pubDate>2025-11-21T15:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91445070/yankee-candle-designed-a-new-luxury-candle-line</guid>
      <description>Yankee Candle&#8217;s YC Collection uses a new monogram, curved glass jars, metallic lids, and new fragrances to premiumize its new sub-brand. 

Yankee Candle is going luxury with a new line of candles that&#8217;s designed to be upsold.</description>
    </item>
    <item>
      <title>Protecting productivity: the imperative of cybersecurity in manufacturing</title>
      <link>https://www.techradar.com/pro/protecting-productivity-the-imperative-of-cybersecurity-in-manufacturing</link>
      <pubDate>Fri, 21 Nov 2025 14:59:38 +0000</pubDate>
      <guid isPermaLink="false">e9ihJL83PK9yJjCj6MYh4Z</guid>
      <description>As factories go digital with smart manufacturing, robust cyber defenses ensure continuity and resilience.</description>
    </item>
    <item>
      <title>Frida Kahlo self-portrait sells for $54.7 million, breaking auction record for female artists</title>
      <link>https://www.fastcompany.com/91447041/frida-kahlo-self-portrait-auction-record-female-artists</link>
      <pubDate>2025-11-21T14:56:19</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91447041/frida-kahlo-self-portrait-auction-record-female-artists</guid>
      <description>The sale at Sotheby&#8217;s in New York also topped Kahlo&#8217;s own auction record for a work by a Latin American artist.
A haunting&#160;1940 self-portrait&#160;by famed Mexican artist&#160;Frida Kahlo&#160;sold Thursday for $54.7 million and became the top-selling work by any female artist at an auction.</description>
    </item>
    <item>
      <title>Human risk: don&#8217;t blame the victim, fix the system</title>
      <link>https://www.techradar.com/pro/human-risk-dont-blame-the-victim-fix-the-system</link>
      <pubDate>Fri, 21 Nov 2025 14:55:16 +0000</pubDate>
      <guid isPermaLink="false">xqcdmrtxp8VNPH8QbRAKvS</guid>
      <description>The human element remains the most unpredictable and exploited variable in the cybersecurity equation.</description>
    </item>
    <item>
      <title>Black Friday iPhone deals are live &#8211; get up to &#163;360 off the iPhone 17, and more top sales</title>
      <link>https://www.techradar.com/phones/iphone/black-friday-iphone-deals-are-live-get-up-to-gbp360-off-the-iphone-17-and-more-top-sales</link>
      <pubDate>Fri, 21 Nov 2025 14:54:09 +0000</pubDate>
      <guid isPermaLink="false">V25FnKULdw3AZnAWTY3ZHF</guid>
      <description>Black Friday iPhone deals are now live at retailers across the UK &#8211; I've picked out my favourites.</description>
    </item>
    <item>
      <title>The best early Black Friday iPhone deals: here's how to get a free iPhone 17, iPad, or a super cheap plan</title>
      <link>https://www.techradar.com/phones/iphone/the-best-early-black-friday-iphone-deals-verizon-t-mobile-more</link>
      <pubDate>Fri, 21 Nov 2025 14:51:35 +0000</pubDate>
      <guid isPermaLink="false">WvvCVP3av4gdrVRCx6khja</guid>
      <description>The biggest discounts, plus some buying advice for our readers</description>
    </item>
  </channel>
</rss>
