<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 13 Jan 2026 14:30:30 GMT</lastBuildDate>
    <item>
      <title>&#171; Une erreur s&#8217;est produite &#187; : X anciennement Twitter est en panne</title>
      <link>https://www.frandroid.com/culture-tech/web/2941147_une-erreur-sest-produite-x-anciennement-twitter-est-en-panne</link>
      <pubDate>Tue, 13 Jan 2026 14:29:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/web/2941147_une-erreur-sest-produite-x-anciennement-twitter-est-en-panne</guid>
      <description>
Le r&#233;seau social X affiche un message d'erreur. De nombreux internautes signalent une panne
</description>
    </item>
    <item>
      <title>Meilleures chaises gamer : quel fauteuil de gaming choisir en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/755354_guide-sieges-gaming</link>
      <pubDate>Tue, 13 Jan 2026 14:27:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/755354_guide-sieges-gaming</guid>
      <description>
Avoir une bonne chaise gaming est indispensable quand on passe des heures devant son PC gaming. Voici nos recommandations des meilleurs fauteuils gamer que nous avons pu tester, pour jouer dans des conditions optimales.
</description>
    </item>
    <item>
      <title>'We held off for as long as we could': Framework gives stark warning about 'years' of RAM misery as it hikes prices on desktop PC</title>
      <link>https://www.techradar.com/computing/desktop-pcs/we-held-off-for-as-long-as-we-could-framework-gives-stark-warning-about-years-of-ram-misery-as-it-hikes-prices-on-desktop-pc</link>
      <pubDate>Tue, 13 Jan 2026 14:26:52 +0000</pubDate>
      <guid isPermaLink="false">dRwWvGBUgCFrJoGcsSNDHR</guid>
      <description>If you wanted some better news about the ongoing RAM pricing crisis, you won't find it here.</description>
    </item>
    <item>
      <title>Mais c&#8217;est quoi ce SUV Renault Filante ? Une base chinoise, une production cor&#233;enne et un logo fran&#231;ais</title>
      <link>https://www.frandroid.com/marques/renault/2941131_mais-cest-quoi-ce-suv-renault-filante-une-base-chinoise-une-production-coreenne-et-un-logo-francais</link>
      <pubDate>Tue, 13 Jan 2026 14:25:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2941131_mais-cest-quoi-ce-suv-renault-filante-une-base-chinoise-une-production-coreenne-et-un-logo-francais</guid>
      <description>
Regardez bien les photos, car vous ne la croiserez probablement jamais sur l'A6. La Renault Filante est officielle. Sous ses airs de "super Rafale", ce SUV de segment E cache une r&#233;alit&#233; industrielle implacable : une plateforme Geely, une usine &#224; Busan et une strat&#233;gie qui ignore d&#233;lib&#233;r&#233;ment l'Europe de l'Ouest.
</description>
    </item>
    <item>
      <title>ExpressVPN just dropped a huge MacOS update &#8212; here's the 5 things I'm most excited about</title>
      <link>https://www.techradar.com/vpn/vpn-services/expressvpn-just-dropped-a-huge-macos-update-heres-the-5-things-im-most-excited-about</link>
      <pubDate>Tue, 13 Jan 2026 14:24:55 +0000</pubDate>
      <guid isPermaLink="false">pv5fA4mpxWih9nE8CgjK7k</guid>
      <description>Split tunneling is the headline, but there's much more to look out for</description>
    </item>
    <item>
      <title>Prix des PC portables : l&#8217;astuce radicale de HP pour limiter la hausse des tarifs</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/2940387_penurie-de-ram-et-si-la-chine-venait-sauver-le-marche-pc-europeen</link>
      <pubDate>Tue, 13 Jan 2026 14:13:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/2940387_penurie-de-ram-et-si-la-chine-venait-sauver-le-marche-pc-europeen</guid>
      <description>
Alors que HP r&#233;fl&#233;chirait &#224; int&#233;grer de la m&#233;moire DRAM chinoise &#224; certains de ses PC portables, la Chine se place en v&#233;ritable alternative pour compenser la crise que traverse le march&#233; cette ann&#233;e.
</description>
    </item>
    <item>
      <title>Mises &#224; jour Xiaomi : Orange c&#232;de enfin, l&#8217;op&#233;rateur &#233;voque &#171;&#160;un probl&#232;me de s&#233;curit&#233;&#160;&#187;</title>
      <link>https://www.frandroid.com/marques/xiaomi/2940241_mises-a-jour-xiaomi-orange-cede-enfin-sous-la-pression-des-abonnes</link>
      <pubDate>Tue, 13 Jan 2026 14:12:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2940241_mises-a-jour-xiaomi-orange-cede-enfin-sous-la-pression-des-abonnes</guid>
      <description>
Il y a deux jours, Orange expliquait que valider une mise &#224; jour prenait du temps. Aujourd'hui, apr&#232;s une fronde massive sur les forums et les r&#233;seaux, l'op&#233;rateur d&#233;ploie soudainement la derni&#232;re version d'HyperOS sur les Xiaomi 15. 
</description>
    </item>
    <item>
      <title>Ces extensions ont transform&#233; mon exp&#233;rience de Steam</title>
      <link>https://www.frandroid.com/produits-android/console/2940977_ces-extensions-ont-transforme-mon-experience-de-steam</link>
      <pubDate>Tue, 13 Jan 2026 14:11:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2940977_ces-extensions-ont-transforme-mon-experience-de-steam</guid>
      <description>
Plusieurs extensions pour navigateur permettent de radicalement am&#233;liorer l'exp&#233;rience de Steam et profiter des meilleurs prix.
</description>
    </item>
    <item>
      <title>Quatix 8 Pro : Garmin d&#233;voile une nouvelle montre avec connexion satellite, mais bien plus utile encore</title>
      <link>https://www.frandroid.com/marques/garmin/2941021_quatix-8-pro-garmin-devoile-une-nouvelle-montre-avec-connexion-satellite-mais-bien-plus-utile-encore</link>
      <pubDate>Tue, 13 Jan 2026 14:11:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/garmin/2941021_quatix-8-pro-garmin-devoile-une-nouvelle-montre-avec-connexion-satellite-mais-bien-plus-utile-encore</guid>
      <description>
Apr&#232;s ses Fenix 8 Pro et Fenix 8 Pro Microled lanc&#233;es l'an dernier, Garmin a d&#233;ploy&#233; ses derni&#232;res technologies connect&#233;es vers un nouveau mod&#232;le, la Garmin Quatix 8 Pro, destin&#233;e aux navigateurs. 
</description>
    </item>
    <item>
      <title>The Disney+ Hulu bundle is on sale for $10 for one month right now</title>
      <link>https://www.engadget.com/deals/the-disney-hulu-bundle-is-on-sale-for-10-for-one-month-right-now-192814784.html?src=rss</link>
      <pubDate>Tue, 13 Jan 2026 14:06:25 +0000</pubDate>
      <guid isPermaLink="false">c4b6e8a2-981f-4fc9-b476-d49dcaeed4ba</guid>
      <description>You have the best chance to save on streaming services during the holiday shopping season, but throughout the year, the occasional deal pops up that's worth considering. Case in point: this new Disney+ deal. New and eligible returning subscribers can sign up for the Disney+ Hulu bundle (with ads) for $10 for one month of access. That's $3 off the usual price of the bundle for one month, and more than 58 percent off if you consider the cost of each service individually (Disney+ at $12 per month and, separately, Hulu also at $12 per month).
We'd be remiss if we didn't mention that this isn't qui...</description>
    </item>
    <item>
      <title>1Password launches Unified Access as a one-stop shop for managing company credentials &#8211; say goodbye to shadow IT and SaaS sprawl</title>
      <link>https://www.techradar.com/pro/1password-launches-unified-access-as-a-one-stop-shop-for-managing-company-credentials-say-goodbye-to-shadow-it-and-saas-sprawl</link>
      <pubDate>Tue, 13 Jan 2026 14:05:37 +0000</pubDate>
      <guid isPermaLink="false">jjwen55ebdTztkAybuZXy8</guid>
      <description>Forget about shadow IT and SaaS sprawl - 1Password's Unified Access platform can discover credentials for you and creates a secure, compliant platform to manage your applications.</description>
    </item>
    <item>
      <title>Betterment confirms data breach, tells customers to beware crypto scam notifications</title>
      <link>https://www.techradar.com/pro/security/betterment-confirms-data-breach-tells-customers-to-beware-crypto-scam-notifications</link>
      <pubDate>Tue, 13 Jan 2026 14:05:00 +0000</pubDate>
      <guid isPermaLink="false">QuCpKMKjG4fPihG7xAcW3Q</guid>
      <description>A Betterment employee was tricked into sharing login credentials, which were then used to send phishing emails.</description>
    </item>
    <item>
      <title>De gros nuages noirs &#224; l&#8217;horizon pour le march&#233; du PC</title>
      <link>https://www.01net.com/actualites/de-gros-nuages-noirs-a-lhorizon-pour-le-marche-du-pc.html</link>
      <pubDate>Tue, 13 Jan 2026 14:02:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319748</guid>
      <description>Un petit miracle avant le saut dans le vide : c'est ainsi que l'on pourrait qualifier le quatri&#232;me trimestre 2025 pour les vendeurs de PC. Les livraisons ont augment&#233; de quasiment 10&#160;% en fin d'ann&#233;e derni&#232;re selon IDC, mais 2026 s'annonce extr&#234;mement compliqu&#233;e.</description>
    </item>
    <item>
      <title>The best 55-inch 4K TVs for all budgets, all tested by our experts.</title>
      <link>https://www.techradar.com/televisions/the-best-55-inch-4k-tvs-for-all-budgets-all-tested-by-our-experts</link>
      <pubDate>Tue, 13 Jan 2026 14:02:11 +0000</pubDate>
      <guid isPermaLink="false">svky97AMYZwVeAo76UjEPh</guid>
      <description>Don't settle for less than the best 55-inch 4K TVs, with great pictures, upscaling, interfaces, and audio all in one brilliant package.</description>
    </item>
    <item>
      <title>The Latest &#8216;Avengers: Doomsday&#8217; Trailer Gives Us an Unlikely Team-Up</title>
      <link>https://gizmodo.com/avengers-doomsday-teaser-shuri-namor-fantastic-four-2000706231</link>
      <pubDate>Tue, 13 Jan 2026 14:00:52 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000706231</guid>
      <description>Wakanda welcomes a surprise guest in our latest look at the next 'Avengers' film.</description>
    </item>
    <item>
      <title>Tesla launches a seven-seat version of the 2026 Model Y</title>
      <link>https://www.engadget.com/transportation/evs/tesla-launches-a-seven-seat-version-of-the-2026-model-y-130039385.html?src=rss</link>
      <pubDate>Tue, 13 Jan 2026 14:00:39 +0000</pubDate>
      <guid isPermaLink="false">3717ac85-5655-4c7b-b17c-3966833b7079</guid>
      <description>Tesla's 2026 Model Y is now available on the company's site and it comes with a new (and old) option:  a seven-seat version via a third row. The extra seating costs $2,500 and is only available if you order the Premium All-Wheel-Drive Long Range model. Tesla first teased the option last year via an email to prospective buyers with the promise of "seating for up to seven and enough room for everyone's gear," Electrek reported at the time.&#160;
The new seats appear to be designed mainly for children as they don't offer much legroom, according to images on Tesla's configurator. Tesla notes that the s...</description>
    </item>
    <item>
      <title>Google Messages is getting a big update in 2026 &#8212; here are the 3 new WhatsApp-style features to look out for</title>
      <link>https://www.techradar.com/phones/android/google-messages-is-getting-a-big-update-in-2026-here-are-the-3-new-whatsapp-style-features-to-look-out-for</link>
      <pubDate>Tue, 13 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">RqNQ6kUZXfHRRBy2uTtPvF</guid>
      <description>This is the year that Google Messages finally gets group chat mentions, and a more advanced long-press menu.</description>
    </item>
    <item>
      <title>How Lego&#8217;s Smart Brick works</title>
      <link>https://www.theverge.com/podcast/861148/lego-smart-brick-claude-code-vergecast</link>
      <pubDate>2026-01-13T08:58:24-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=861148</guid>
      <description>The most interesting story at this year's CES was just a little tiny bundle of technology. One way to look at Lego's new Smart Brick is as something like a Raspberry Pi, an endlessly remixable gizmo with infinite hacking potential - it can be anything, in the best possible way. Another way to look at [&#8230;]</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : m&#234;me les iPhone d&#8217;Apple sont en soldes dans cette s&#233;lection des 16 meilleures offres</title>
      <link>https://www.frandroid.com/bons-plans/2931029_les-soldes-cest-le-bon-moment-pour-changer-son-smartphone-voici-le-top-12-des-deals-a-retenir</link>
      <pubDate>Tue, 13 Jan 2026 13:53:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931029_les-soldes-cest-le-bon-moment-pour-changer-son-smartphone-voici-le-top-12-des-deals-a-retenir</guid>
      <description>
Si vous attendiez les soldes pour changer de smartphones, vous avez bien fait ! Durant cette p&#233;riode, on trouve de belles offres du c&#244;t&#233; des Galaxy S de Samsung, des Pixel de Google et appareils Xiaomi, et m&#234;me des iPhone d'Apple. D&#233;couvrez les meilleures offres : il y en a pour tous les budgets.
</description>
    </item>
    <item>
      <title>Quand baisser les graphismes vous rend plus fort : d&#233;couvrez le concept fou de FPS Quest</title>
      <link>https://www.frandroid.com/produits-android/console/2940761_loptimisation-est-risquee-dans-ce-jeu-vos-fps-sont-votre-barre-de-vie</link>
      <pubDate>Tue, 13 Jan 2026 13:50:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2940761_loptimisation-est-risquee-dans-ce-jeu-vos-fps-sont-votre-barre-de-vie</guid>
      <description>
Et si optimiser les performances d'un jeu avait un autre avantage que la fluidit&#233; ? FPS Quest promet d'indexer votre barre de vie avec votre fr&#233;quence d'images par seconde. Enfin, pas tout &#224; fait.
</description>
    </item>
    <item>
      <title>L&#8217;offre &#224; saisir des soldes, c&#8217;est ce pack Xiaomi 15T &#224; prix cass&#233; avec la Redmi Watch 5 Active offerte</title>
      <link>https://www.frandroid.com/bons-plans/2901549_loffre-a-saisir-des-soldes-cest-ce-pack-xiaomi-15t-a-prix-casse-avec-la-redmi-watch-5-active-offerte</link>
      <pubDate>Tue, 13 Jan 2026 13:47:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2901549_loffre-a-saisir-des-soldes-cest-ce-pack-xiaomi-15t-a-prix-casse-avec-la-redmi-watch-5-active-offerte</guid>
      <description>
Boulanger propose un pack tr&#232;s attractif r&#233;unissant le Xiaomi 15T et la Redmi Watch 5 Active pour seulement 499&#8201;euros au lieu de 699&#8201;euros. Une promotion id&#233;ale pour ceux qui veulent s&#8217;&#233;quiper sans faire exploser le budget pendant les soldes d'hiver 2026.
</description>
    </item>
    <item>
      <title>Star Wars Outlaws developer Massive Entertainment and Ubisoft Stockholm face layoffs</title>
      <link>https://www.engadget.com/gaming/star-wars-outlaws-developer-massive-entertainment-and-ubisoft-stockholm-face-layoffs-134234968.html?src=rss</link>
      <pubDate>Tue, 13 Jan 2026 13:42:34 +0000</pubDate>
      <guid isPermaLink="false">ce515656-e5f1-49ca-a2ee-58cae9319013</guid>
      <description>We aren't even two weeks into the new year and Ubisoft is already looking to carry out its second round of layoffs in 2026. The company has informed workers at Massive Entertainment and Ubisoft Stockholm of a "proposed organizational restructure" that could affect around 55 roles across its two Swedish studios. Workers at Massive (the developer of The Division series, Star Wars Outlaws and Avatar: Frontiers of Pandora) were offered voluntary buyouts late last year as part of Ubisoft's ongoing cost-cutting efforts."This restructure follows the completion of the Voluntary Leave Program launched ...</description>
    </item>
    <item>
      <title>'All those moments will be lost in time, like tears in rain' &#8212; Players bid farewell to Anthem as EA officially shuts down the game's servers for good</title>
      <link>https://www.techradar.com/gaming/all-those-moments-will-be-lost-in-time-like-tears-in-rain-players-bid-farewell-to-anthem-as-ea-officially-shuts-down-the-games-servers-for-good</link>
      <pubDate>Tue, 13 Jan 2026 13:35:25 +0000</pubDate>
      <guid isPermaLink="false">xceEX8nBDFdTUL9koekwaf</guid>
      <description>Anthem servers have officially gone offline, making BioWare's 2019 online sci-fi shooter no longer playable, leaving players to share their final farewells.</description>
    </item>
    <item>
      <title>Why prediction markets may be bad for your wallet&#8212;and your mental health</title>
      <link>https://www.fastcompany.com/91459597/prediction-markets-might-be-hurting-your-wallet-and-your-well-being-prediction-markets-wellness</link>
      <pubDate>2026-01-13T13:33:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91459597/prediction-markets-might-be-hurting-your-wallet-and-your-well-being-prediction-markets-wellness</guid>
      <description>The parallels to casinos are drastically obvious.
Prediction markets are all the rage right now. Weekly trading volume on prediction platforms just surpassed $2 billion, and apps like Polymarket are being treated as the &#8220;next big thing&#8221; in consumer finance and entertainment. These platforms are designed to gamify uncertainty by exploiting the same cognitive biases as gambling and day-trading, quietly pushing users toward overspending, emotional volatility, and compulsive checking....</description>
    </item>
    <item>
      <title>Zorin OS continue de s&#233;duire et passe le cap des 2 millions de t&#233;l&#233;chargements</title>
      <link>https://www.01net.com/actualites/zorin-os-continue-de-seduire-et-passe-le-cap-des-2-millions-de-telechargements.html</link>
      <pubDate>Tue, 13 Jan 2026 13:32:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319746</guid>
      <description>Le syst&#232;me d&#8217;exploitation continue de profiter de la fin du support de Windows 10. La distribution Linux a &#233;t&#233; t&#233;l&#233;charg&#233;e plus de deux millions de fois en &#224; peine trois mois.</description>
    </item>
    <item>
      <title>U.S. consumer prices likely stayed high in December, as data recovers from shutdown</title>
      <link>https://www.fastcompany.com/91473928/u-s-consumer-prices-likely-stayed-high-december-data-recovers-shutdown</link>
      <pubDate>2026-01-13T13:30:02</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91473928/u-s-consumer-prices-likely-stayed-high-december-data-recovers-shutdown</guid>
      <description>The 43-day government shutdown last fall blocked the collection of data used to compile the inflation rate. 
Inflation likely remained elevated last month as the cost of electricity, groceries, and clothing may have jumped and continued to pressure consumers&#8217; wallets.The Labor Department is expected to report that consumer prices rose 2.6% in December compared with a year earlier, according to economists&#8217; estimates compiled by data provider FactSet. The yearly rate would be down from 2.7% in November. Monthly prices, however, are expected to rise 0.3% in December, faster than is consistent wit...</description>
    </item>
    <item>
      <title>Deepgram raises $130M at $1.3B valuation and buys a YC AI startup</title>
      <link>https://techcrunch.com/2026/01/13/deepgram-raises-130m-at-1-3b-valuation-and-buys-a-yc-ai-startup/</link>
      <pubDate>Tue, 13 Jan 2026 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3081817</guid>
      <description>Deepgram is raising its Series C round at a $1.3 billion valuation.</description>
    </item>
    <item>
      <title>A Resident Evil showcase is taking place on January 15</title>
      <link>https://www.engadget.com/gaming/a-resident-evil-showcase-is-taking-place-on-january-15-133000548.html?src=rss</link>
      <pubDate>Tue, 13 Jan 2026 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">fed787f0-bcd4-4078-ad14-6c430e23c159</guid>
      <description>Resident Evil Requiem, the first new mainline entry in the series since 2021&#8217;s Resident Evil Village, is just over a month away and Capcom is ready to share more details. The publisher will air a Resident Evil Showcase on January 15 at 5PM ET. You&#8217;ll be able to watch it on Twitch and YouTube (in English and Japanese).The stream will run for around 12 minutes. It will feature &#8220;all the latest info on Resident Evil Requiem,&#8221; which will almost certainly include some gameplay ahead of it hitting PS5, Xbox Series X/S, Nintendo Switch 2 and Steam on February 27. Capcom might have more in store, thoug...</description>
    </item>
    <item>
      <title>&#171; Sweetpea &#187;, des &#233;couteurs con&#231;us par OpenAI et Jony Ive pour concurrencer les AirPods&#160;?</title>
      <link>https://www.frandroid.com/marques/openai/2940963_sweetpea-des-ecouteurs-concus-par-openai-et-jony-ive-pour-concurrencer-les-airpods</link>
      <pubDate>Tue, 13 Jan 2026 13:28:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/openai/2940963_sweetpea-des-ecouteurs-concus-par-openai-et-jony-ive-pour-concurrencer-les-airpods</guid>
      <description>
OpenAI pr&#233;parerait ses premiers &#233;couteurs IA grand public, nom de code &#171; Sweetpea &#187;, avec l&#8217;objectif affich&#233; de rivaliser directement avec les AirPods d&#8217;Apple d&#232;s septembre 2026, selon plusieurs fuites concordantes qui restent toutefois &#224; prendre avec les pincettes de rigueur.
</description>
    </item>
    <item>
      <title>AirTags are back on sale, with a four-pack going for $65</title>
      <link>https://www.engadget.com/deals/airtags-are-back-on-sale-with-a-four-pack-going-for-65-202333994.html?src=rss</link>
      <pubDate>Tue, 13 Jan 2026 13:14:02 +0000</pubDate>
      <guid isPermaLink="false">24b60c33-f851-4bee-9d8b-9c00c8cc034a</guid>
      <description>Most Apple products are pretty expensive, but some of the most affordable (and useful) ones are AirTags. The Bluetooth trackers are priced pretty reasonably even when not on sale, but they can be a steal if you can get them on a discount &#8212; like right now. A four pack of AirTags is on sale for $65 at Amazon, which is only a few dollars more than the record-low price we saw during Black Friday this year.


AirTags can be useful for people who travel frequently, helping you to keep track of essentials like your passport as well as a way to keep tabs on luggage while you're on the go. If you do pu...</description>
    </item>
    <item>
      <title>Camouflage EZ BirdFeed review: a superb value, smart bird feeder camera that identifies your feathered friends</title>
      <link>https://www.techradar.com/cameras/camouflage-ez-birdfeed-review-a-superb-value-smart-bird-feeder-camera-that-identifies-your-feathered-friends</link>
      <pubDate>Tue, 13 Jan 2026 13:08:22 +0000</pubDate>
      <guid isPermaLink="false">yoMh9qGV7S38jgoYMCXsSk</guid>
      <description>An affordable and robust bird feeder camera with built-in solar panels, but slightly let down by picture quality and file management.</description>
    </item>
    <item>
      <title>Counter-Strike 1.6 s&#8217;offre une version VR inattendue, voici &#224; quoi &#231;a ressemble</title>
      <link>https://www.frandroid.com/produits-android/console/2940547_voici-peut-etre-la-pire-version-pour-jouer-a-counter-strike-1-6-mais-aussi-la-plus-fun</link>
      <pubDate>Tue, 13 Jan 2026 13:08:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2940547_voici-peut-etre-la-pire-version-pour-jouer-a-counter-strike-1-6-mais-aussi-la-plus-fun</guid>
      <description>
Un portage VR de Counter-Strike 1.6 vous permet de relancer l'un des FPS par lequel tout a commenc&#233; pour des millions de joueurs. &#192; condition de poss&#233;der un casque de r&#233;alit&#233; virtuelle.
</description>
    </item>
    <item>
      <title>Brace yourself, Resident Evil fans: Capcom announces a 12-minute Resident Evil Showcase, and there are four big potential surprises I'm hoping for</title>
      <link>https://www.techradar.com/gaming/brace-yourself-resident-evil-fans-capcom-announces-a-12-minute-resident-evil-showcase-and-there-are-four-big-potential-surprises-im-hoping-for</link>
      <pubDate>Tue, 13 Jan 2026 13:06:57 +0000</pubDate>
      <guid isPermaLink="false">rHqY9wVnmWhCVJR6R7PMPR</guid>
      <description>Resident Evil fans have waited long enough, and Capcom has finally announced a Resident Evil Showcase, and it may be time for a Requiem demo.</description>
    </item>
    <item>
      <title>1,058 miles without stopping &#8211;the world's longest-range SUV just landed in China, and Tesla should be worried</title>
      <link>https://www.techradar.com/vehicle-tech/dash-cams/1-058-miles-without-stopping-the-worlds-longest-range-suv-just-landed-in-china-and-tesla-should-be-worried</link>
      <pubDate>Tue, 13 Jan 2026 13:06:46 +0000</pubDate>
      <guid isPermaLink="false">Bzp4a8UGsWUV2oKxsQNJp5</guid>
      <description>Xpeng says its latest hybrid G7 boasts the longest combined range of any SUV in the world.</description>
    </item>
    <item>
      <title>5 biggest fails that got a company or product a disparaging nickname from consumers &#8211; starting with the newcomer 'Microslop'</title>
      <link>https://www.techradar.com/computing/5-biggest-fails-that-got-a-company-or-product-a-disparaging-nickname-from-consumers-starting-with-the-newcomer-microslop</link>
      <pubDate>Tue, 13 Jan 2026 13:05:23 +0000</pubDate>
      <guid isPermaLink="false">FrXwQNmJ22fmEewMzPP4mn</guid>
      <description>Microslop is a fresh nickname for Microsoft coined by those who feel the company is pushing AI too hard &#8211; but will it stick?</description>
    </item>
    <item>
      <title>Elijah Wood Says More &#8216;Lord of the Rings&#8217; Movies Are Coming, Just Don&#8217;t Ask Him if He&#8217;s in Them</title>
      <link>https://gizmodo.com/elijah-wood-hunt-for-gollum-lord-of-the-rings-future-2000709422</link>
      <pubDate>Tue, 13 Jan 2026 13:00:48 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000709422</guid>
      <description>However, the once and forever Frodo admits he's very excited about Andy Serkis' 'The Hunt for Gollum.'</description>
    </item>
    <item>
      <title>Insta360 releases AI-powered follow-up to its Link webcams</title>
      <link>https://www.engadget.com/cameras/insta360-releases-ai-powered-follow-up-to-its-link-webcams-130003572.html?src=rss</link>
      <pubDate>Tue, 13 Jan 2026 13:00:03 +0000</pubDate>
      <guid isPermaLink="false">19bef0e5-bb4e-4504-895b-778a3e59e7b9</guid>
      <description>Insta360, a company most known for its action cameras, has released two new AI-powered 4K webcams, the Link 2 Pro and Link 2C Pro, aimed at creators, educators and remote professionals. The company's goal with these models is "a webcam experience that looks and sounds remarkably close to a professional camera and microphone setup."
Both models use a larger 1/1.3-inch sensor with dual native ISO for improved low-light performance over the previous generation, and both support HDR. Insta360 says the audio on both models leverages beamforming technology as well as AI noise canceling to help voice...</description>
    </item>
    <item>
      <title>Urevo SpaceWalk 5L Walking Pad Review: Compact and Affordable</title>
      <link>https://www.wired.com/review/urevo-spacewalk-5l-walking-pad/</link>
      <pubDate>Tue, 13 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">695ece45f1e894638ec8168d</guid>
      <description>Urevo&#8217;s affordable new walking pad is cheaper than a round-trip ticket to hike in Iceland.</description>
    </item>
    <item>
      <title>Insta360&#8217;s face-tracking webcams get bigger sensors and more expensive</title>
      <link>https://www.theverge.com/tech/860616/insta360-link-2-2c-pro-face-tracking-webcam</link>
      <pubDate>2026-01-13T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=860616</guid>
      <description>Insta360 has announced new Pro versions of its Link 2 and Link 2C webcams that first launched in September 2024. As with the previous versions, the new Link 2 Pro and 2C Pro can track the movements of onscreen subjects to ensure they're always in frame, making them ideal for those presenting on a video [&#8230;]</description>
    </item>
    <item>
      <title>Slackbot is an AI agent now</title>
      <link>https://techcrunch.com/2026/01/13/slackbot-is-an-ai-agent-now/</link>
      <pubDate>Tue, 13 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3082152</guid>
      <description>Salesforce unveils Slackbot, a new AI agent that allows users to complete tasks across multiple enterprise applications from Slack.</description>
    </item>
    <item>
      <title>Japanese hi-fi great Marantz has a new high-end AV system &#8212; ready for Dolby Atmos, DTS:X and 4K 120Hz</title>
      <link>https://www.techradar.com/televisions/av-receivers/japanese-hi-fi-great-marantz-has-a-new-high-end-av-system-ready-for-dolby-atmos-dts-x-and-4k-120hz</link>
      <pubDate>Tue, 13 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">bDbkmGMiiRmL3cpiLxdhF7</guid>
      <description>Marantz' new preamp and amp are made for serious home theater &#8211;and are less expansive than its last AV beasts</description>
    </item>
    <item>
      <title>"Slackbot isn&#8217;t just another copilot or AI assistant - it&#8217;s the front door to the Agentic Enterprise" - Salesforce's new superpowered AI is now open to all</title>
      <link>https://www.techradar.com/pro/slackbot-isnt-just-another-copilot-or-ai-assistant-its-the-front-door-to-the-agentic-enterprise-salesforces-new-superpowered-ai-is-now-open-to-all</link>
      <pubDate>Tue, 13 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">sCQe7sgGcK5k9bFFD3dEud</guid>
      <description>Salesforce unleashes its Slackbot AI tool into the world - here's what it can do for you.</description>
    </item>
    <item>
      <title>Slack&#8217;s automated bot is getting an upgrade into an AI workplace helper</title>
      <link>https://www.fastcompany.com/91473260/slacks-automated-bot-is-getting-an-upgrade-into-an-ai-workplace-helper</link>
      <pubDate>2026-01-13T13:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91473260/slacks-automated-bot-is-getting-an-upgrade-into-an-ai-workplace-helper</guid>
      <description>The company envisions&#160;Slackbot&#160;as a personalized work agent for getting things done and&#160;synthesizing&#160;institutional wisdom.&#160;
If&#160;you&#8217;re&#160;a Slack user,&#160;you&#8217;re&#160;probably familiar&#160;with&#160;Slackbot&#160;as a good-natured&#8212;if annoying&#8212;assistant that delivers notifications, reminders, and keyword-based automatic responses within the workplace chat&#160;app.&#160;&#160;&#160;But for organizations with paid Slack plans that have AI features enabled,&#160;Slackbot&#160;is receiving a bit of a brain transplant. The company has rebuilt the humble bot as an AI agent that can help bring you up to speed on workplace discussions&#160;and priorities, pull ...</description>
    </item>
    <item>
      <title>Fanatics goes all-in on entertainment</title>
      <link>https://www.fastcompany.com/91473298/fanatics-goes-all-in-on-entertainment</link>
      <pubDate>2026-01-13T13:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91473298/fanatics-goes-all-in-on-entertainment</guid>
      <description>Fanatics Studios, a collaboration with OBB Media, adds content to the company&#8217;s sports retail, collectibles, and gaming empire. 
The convergence of brand work and entertainment is set to be making significant leaps and bounds this year as a result in a flurry of activity in 2025.&#160;Large brands of consequence have made serious investment in in-house entertainment studios over the past few years&#8212;LVMH, AB InBev, Nike, and Dick&#8217;s Sporting Goods, among them. Now, sports retail and gaming giant Fanatics is partnering with OBB Media to launch Fanatics Studios.&#160;...</description>
    </item>
    <item>
      <title>En 2026, l&#8217;espace se tourne vers deux priorit&#233;s claires : la Terre et la Lune</title>
      <link>https://www.futura-sciences.com/sciences/actualites/espace-2026-espace-tourne-vers-deux-priorites-claires-terre-lune-130102/#xtor%3DRSS-8</link>
      <pubDate>Tue, 13 Jan 2026 13:57:05 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/espace-2026-espace-tourne-vers-deux-priorites-claires-terre-lune-130102/#xtor%3DRSS-8</guid>
      <description>L'ann&#233;e 2026 comptera de nombreuses nouvelles missions spatiales, principalement &#224; destination de la Lune et d&#233;di&#233;es &#224; l&#8217;observation de la Terre. Quatre &#224; destination&#160;de la Lune pour le compte de la Nasa sont pr&#233;vues pour apporter des avanc&#233;es technologiques importantes et mettre en &#339;uvre des...</description>
    </item>
    <item>
      <title>Grok et deepfakes&#160;: pour la France, la strat&#233;gie d&#8217;Elon Musk est &#171;&#160;compl&#232;tement hypocrite&#160;&#187;</title>
      <link>https://www.01net.com/actualites/grok-et-deepfakes-pour-la-france-la-strategie-delon-musk-est-completement-hypocrite.html</link>
      <pubDate>Tue, 13 Jan 2026 12:47:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319724</guid>
      <description>L'ambassadrice de la France pour l'intelligence artificielle, Clara Chappaz, ne d&#233;col&#232;re pas. Rendre payante la g&#233;n&#233;ration d'images sur Grok apr&#232;s le scandale des deepfakes est une r&#233;ponse &#171; cynique &#187; qui permet &#224; X de mon&#233;tiser les abus.</description>
    </item>
    <item>
      <title>The Dreame L50 Ultra robot vacuum and mop has never been cheaper &#8212; save over $500 at Amazon</title>
      <link>https://mashable.com/article/jan-13-dreame-l50-ultra-robot-vacuum-mop-deal</link>
      <pubDate>Tue, 13 Jan 2026 12:45:38 +0000</pubDate>
      <guid isPermaLink="false">051NNKclcN4rLHHuENqpAdJ</guid>
      <description>As of Jan. 13, the Dreame L50 Ultra robot vacuum and mop has dropped to $849.98 at Amazon, 39% off its list price of $1,399.99.</description>
    </item>
    <item>
      <title>New ruling in Rockstar Games legal battle means the GTA 6 studio won't be forced to pay fired employees interim relief &#8212; 'We regret that we were put in a position where dismissals were necessary'</title>
      <link>https://www.techradar.com/gaming/new-ruling-in-rockstar-games-legal-battle-means-the-gta-6-studio-wont-be-forced-to-pay-fired-employees-interim-relief-we-regret-that-we-were-put-in-a-position-where-dismissals-were-necessary</link>
      <pubDate>Tue, 13 Jan 2026 12:45:19 +0000</pubDate>
      <guid isPermaLink="false">ZkWUXMTn88hkHsAPdmC4JW</guid>
      <description>A judge has officially ruled that Rockstar Games won't be forced to pay interim relief to the 34 Grand Theft Auto 6 developers it fired in October, after the IWGB accused the studio of union-busting.</description>
    </item>
    <item>
      <title>WhatsApp planche sur un syst&#232;me de contr&#244;le parental</title>
      <link>https://www.frandroid.com/marques/meta/2940627_whatsapp-planche-sur-un-systeme-de-controle-parental</link>
      <pubDate>Tue, 13 Jan 2026 12:37:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2940627_whatsapp-planche-sur-un-systeme-de-controle-parental</guid>
      <description>
Les &#233;quipes de Meta veulent aider les parents &#224; prot&#233;ger au mieux les &#233;changes de leurs enfants.
</description>
    </item>
    <item>
      <title>Jimmy Kimmel answers Stephen Colberts quickfire questions, gets surprisingly deep</title>
      <link>https://mashable.com/video/jimmy-kimmel-stephen-colbert-questionert</link>
      <pubDate>Tue, 13 Jan 2026 12:31:03 +0000</pubDate>
      <guid isPermaLink="false">01QjdUqwnlGMHhQEZ5egJcC</guid>
      <description>Jimmy Kimmel appeared on "The Late Show" and took Stephen Colbert's "questionert".</description>
    </item>
    <item>
      <title>PC shipments just grew unexpectedly amid RAM shortages</title>
      <link>https://www.theverge.com/news/861124/pc-market-growth-q4-2025-idc</link>
      <pubDate>2026-01-13T07:30:48-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=861124</guid>
      <description>The PC market is bracing for a turbulent year ahead, but shipments managed to exceed expectations in the recent holiday quarter. IDC reports that shipments grew nearly 10 percent year-over-year in the fourth quarter of 2025, reaching 76.4 million in total. Microsoft's end of Windows 10 support undoubtedly helped push PC shipments up, but IDC [&#8230;]</description>
    </item>
  </channel>
</rss>
