<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 11 Jan 2026 10:26:11 GMT</lastBuildDate>
    <item>
      <title>I tested Ulefone's loudest rugged phone - but while the RugKing offers exceptional value, there are limitations I can't overlook</title>
      <link>https://www.techradar.com/pro/phone-communications/ulefone-rugking-rugged-phone-review</link>
      <pubDate>Sun, 11 Jan 2026 10:15:00 +0000</pubDate>
      <guid isPermaLink="false">mfodi2dVD6QxobsmGNT29o</guid>
      <description>The Ulefone RugKing is a lightweight, rugged design ideal for those who need a tough device occasionally.</description>
    </item>
    <item>
      <title>Ambilight, OLED, HDMI 2.1 : ce grand TV 4K Philips &#224; -36 % coche toutes les cases pendant les soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/produits-android/2937107_ambilight-oled-hdmi-2-1-ce-grand-tv-4k-philips-a-36-coche-toutes-les-cases-pendant-les-soldes-dhiver</link>
      <pubDate>Sun, 11 Jan 2026 10:04:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2937107_ambilight-oled-hdmi-2-1-ce-grand-tv-4k-philips-a-36-coche-toutes-les-cases-pendant-les-soldes-dhiver</guid>
      <description>
Support des normes vid&#233;o modernes, technologie Ambilight hautement immersive, fonctionnalit&#233;s gaming &#224; n'en plus finir... Le tout r&#233;cent TV 4K Philips 65OLED950 est l'un des mod&#232;les les plus complets du moment. Pendant les soldes, Darty et la Fnac l'affichent &#224; 1 899 euros au lieu de 2 999 euros.
</description>
    </item>
    <item>
      <title>The Danger of Reducing America's Venezuela Invasion to a 60-Second Video</title>
      <link>https://www.wired.com/story/the-danger-of-reducing-a-americas-venezuela-invasion-to-a-60-second-video/</link>
      <pubDate>Sun, 11 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">696114b55f86de3cc93b6314</guid>
      <description>January 3 marked the return of US military intervention in Latin America. While the events unfolded between Caracas and Brooklyn, social networks had already fabricated their own reality.</description>
    </item>
    <item>
      <title>I boxed a robot at CES. It wasn&#8217;t afraid to go low.</title>
      <link>https://www.fastcompany.com/91472146/ces-robot-boxing-g1-unitree</link>
      <pubDate>2026-01-11T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91472146/ces-robot-boxing-g1-unitree</guid>
      <description>&#8220;I landed several solid shots on its chest cavity, sometimes hard enough to push it back and make it stagger &#8212; but, good grief, can that thing take a punch.&#8221;
When the inevitable robot uprising comes, I&#8217;ll be ready, thanks to some valuable lessons I picked up at CES. First, if given the choice of a dance off versus hand to hand combat, opt for the fight. Second, wear a cup when you do....</description>
    </item>
    <item>
      <title>Voici les trois meilleures voitures &#233;lectriques test&#233;es par Survolt&#233;s en 2025</title>
      <link>https://www.frandroid.com/guide-dachat/2937401_voici-les-trois-meilleures-voitures-electriques-testees-par-survoltes-en-2025</link>
      <pubDate>Sun, 11 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2937401_voici-les-trois-meilleures-voitures-electriques-testees-par-survoltes-en-2025</guid>
      <description>
L'ann&#233;e 2025 a &#233;t&#233; riche en progressions et en &#233;volutions pour le march&#233; de la voiture &#233;lectrique. Voici les trois meilleures voitures &#233;lectriques que nous avons test&#233;es l'ann&#233;e pass&#233;e. 
</description>
    </item>
    <item>
      <title>Ces images de la Nasa montrent, pour la premi&#232;re fois, l&#8217;&#233;volution d&#8217;une supernova sur 25 ans</title>
      <link>https://www.futura-sciences.com/sciences/actualites/supernova-ces-images-nasa-montrent-premiere-fois-evolution-supernova-25-ans-129957/#xtor%3DRSS-8</link>
      <pubDate>Sun, 11 Jan 2026 10:57:00 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/supernova-ces-images-nasa-montrent-premiere-fois-evolution-supernova-25-ans-129957/#xtor%3DRSS-8</guid>
      <description>Elles sont aussi belles qu&#8217;utiles &#224; la science. Ces images ont &#233;t&#233; prises par l&#8217;observatoire de rayons X Chandra. Elles montrent l&#8217;&#233;volution des restes de la supernova de Kepler sur 25&#160;ans.</description>
    </item>
    <item>
      <title>Harley-Davidson dealership owners are closing up shop as sales sag</title>
      <link>https://www.fastcompany.com/91469703/harley-davidson-dealership-owners-closing-up-shop-sales-sag</link>
      <pubDate>2026-01-11T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91469703/harley-davidson-dealership-owners-closing-up-shop-sales-sag</guid>
      <description>After a COVID-era sales boom that led owners to undertake expensive showroom upgrades, years of falling sales and rising costs are pushing many dealerships to the brink.
There are few things more evocative of the free American spirit and the nation&#8217;s wide-open spaces than the image of a&#160;Harley-Davidson&#160;motorcycle zooming down a stretch of empty highway. But while taking one of&#160;the legendary hogs&#160;for a spin may still be liberating for riders, the company&#8217;s independent dealership owners are feeling an increasingly tight financial and business squeeze....</description>
    </item>
    <item>
      <title>B&amp;YOU Pure Fibre VS Freebox Pop S : quel est le meilleur forfait internet single-play du march&#233; ?</title>
      <link>https://www.frandroid.com/versus/2933145_byou-pure-fibre-vs-freebox-pop-s-quel-est-le-meilleur-forfait-internet-single-play-du-marche</link>
      <pubDate>Sun, 11 Jan 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/versus/2933145_byou-pure-fibre-vs-freebox-pop-s-quel-est-le-meilleur-forfait-internet-single-play-du-marche</guid>
      <description>
L'offre single-play, &#224; savoir un forfait avec seulement une connexion internet, a connu un regain d'int&#233;r&#234;t fin 2024 lorsque Bouygues Telecom a lanc&#233; via sa filiale B&amp;YOU la Pure Fibre. Free n'a pas tard&#233; &#224; lui embo&#238;ter le pas. Voyons lequel de ces deux forfaits m&#233;rite votre argent.
</description>
    </item>
    <item>
      <title>Idle infrastructure might cause your next breach &#8211; here&#8217;s how to stop it</title>
      <link>https://www.techradar.com/pro/idle-infrastructure-might-cause-your-next-breach-heres-how-to-stop-it</link>
      <pubDate>Sun, 11 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">ew5kRudcYQfLrkwssC9i7M</guid>
      <description>What CISOs can do to secure inactive systems and overlooked storage before attackers exploit them.</description>
    </item>
    <item>
      <title>How a facial recognition tool for bears can help manage&#160;wildlife</title>
      <link>https://www.fastcompany.com/91470657/bears-facial-recognition-tool</link>
      <pubDate>2026-01-11T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91470657/bears-facial-recognition-tool</guid>
      <description>BearID uses deep learning, a subset of machine learning that makes use of artificial neural networks, to analyze images and identify individual bears. 
When a grizzly bear attacked a group of fourth- and fifth-graders in western Canada in late November 2025, it sparked more than a rescue effort for the 11 people injured&#8212;four with severe injuries. Local authorities began trying to find the specific bear that was involved in order to relocate or euthanize it, depending on the results of their assessment....</description>
    </item>
    <item>
      <title>GM&#8217;s mid-century modern legacy shines in its new Detroit HQ</title>
      <link>https://www.fastcompany.com/91472349/gm-new-detroit-hq-midcentury-modern-legacy</link>
      <pubDate>2026-01-11T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91472349/gm-new-detroit-hq-midcentury-modern-legacy</guid>
      <description>A new headquarters for General Motors draws on the carmaker&#8217;s deep design heritage while facing the new dynamics of a changing industry.
However uncertain the outlook is for the American auto industry in the age of tariffs, growing competition from China, and the rise of EV upstarts, the view inside the new boardroom at General Motors is stylishly optimistic....</description>
    </item>
    <item>
      <title>Fuite de donn&#233;es ENI&#160;: les informations de 50&#160;000 entreprises fran&#231;aises pirat&#233;es</title>
      <link>https://www.01net.com/actualites/fuite-donnees-eni-informations-50-000-entreprises-francaises-piratees.html</link>
      <pubDate>Sun, 11 Jan 2026 08:58:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318884</guid>
      <description>Le groupe ENI reconna&#238;t une fuite de donn&#233;es touchant ses clients professionnels fran&#231;ais. Contact&#233; par 01net, le groupe italien confirme que les donn&#233;es de 50 000 clients ont &#233;t&#233; siphonn&#233;es. ENI tente de minimiser l&#8217;incident en parlant de &#171; divulgation non autoris&#233;e &#187; plut&#244;t que de cyberattaque.</description>
    </item>
  </channel>
</rss>
