<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 24 Jan 2026 20:27:12 GMT</lastBuildDate>
    <item>
      <title>Hasbro Suit Alleges Overprinted &#8216;Magic: The Gathering&#8217; Cards</title>
      <link>https://gizmodo.com/hasbro-suit-alleges-overprinted-magic-the-gathering-cards-2000713744</link>
      <pubDate>Sat, 24 Jan 2026 20:15:27 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000713744</guid>
      <description>Accusations of 'gross mismanagement' have been levvied against Hasbro, owing to its ongoing success and production of 'Magic' cards.</description>
    </item>
    <item>
      <title>Tech CEOs boast and bicker about AI at Davos</title>
      <link>https://techcrunch.com/2026/01/24/tech-ceos-boast-and-bicker-about-ai-at-davos/</link>
      <pubDate>Sat, 24 Jan 2026 20:00:46 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3085845</guid>
      <description>There were times at this week&#8217;s meeting of the World Economic Forum when Davos seemed transformed into a high-powered tech conference.</description>
    </item>
    <item>
      <title>I field-tested the best-selling Wandrd PRVKE backpack, and the hype is real &#8212; it's my new favorite camera bag that doesn't look like one</title>
      <link>https://www.techradar.com/cameras/camera-accessories/wandrd-prvke-v4-review</link>
      <pubDate>Sat, 24 Jan 2026 20:00:00 +0000</pubDate>
      <guid isPermaLink="false">c6doHATLqz45FW3DoXYm4L</guid>
      <description>My month-long test of the stylish Wandrd PRVKE V4 camera bag covers the mid-size 21L version.</description>
    </item>
    <item>
      <title>Un chasseur d&#8217;aurores bor&#233;ales d&#233;voile comment se pr&#233;parer pour les prochaines temp&#234;tes solaires et ne rien manquer</title>
      <link>https://www.futura-sciences.com/sciences/actualites/aurore-boreale-chasseur-aurores-boreales-devoile-preparer-prochaines-tempetes-solaires-ne-rien-manquer-130421/#xtor%3DRSS-8</link>
      <pubDate>Sat, 24 Jan 2026 20:51:26 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/aurore-boreale-chasseur-aurores-boreales-devoile-preparer-prochaines-tempetes-solaires-ne-rien-manquer-130421/#xtor%3DRSS-8</guid>
      <description>Ce mois de janvier a encore une fois &#233;t&#233; particuli&#232;rement dynamique pour les aurores bor&#233;ales. Avec l'activit&#233; solaire actuelle, ce type de ph&#233;nom&#232;ne fascine les scientifiques et le grand public. L'occasion d'apprendre &#224; mieux les &#171; chasser &#187; avec des professionnels.</description>
    </item>
    <item>
      <title>Report reveals that OpenAI's GPT-5.2 model cites Grokipedia</title>
      <link>https://www.engadget.com/ai/report-reveals-that-openais-gpt-52-model-cites-grokipedia-192532977.html?src=rss</link>
      <pubDate>Sat, 24 Jan 2026 19:25:32 +0000</pubDate>
      <guid isPermaLink="false">8a06d7a4-8d1a-4f37-b989-e8d881283bd9</guid>
      <description>OpenAI may have called GPT-5.2 its "most advanced frontier model for professional work," but tests conducted by the Guardian cast doubt on its credibility. According to the report, OpenAI's GPT-5.2 model cited Grokipedia, the online encyclopedia powered by xAI, when it came to specific, but controversial topics related to Iran or the Holocaust.
As seen in the Guardian's report, ChatGPT used Grokipedia as a source for claims about the Iranian government being tied to telecommunications company MTN-Irancell and questions related to Richard Evans, a British historian who served as an expert witne...</description>
    </item>
    <item>
      <title>'Tesla's chip game is no joke': Elon Musk confirms it has restarted work on its biggest supercomputer yet - but what will it actually be used for?</title>
      <link>https://www.techradar.com/pro/teslas-chip-game-is-no-joke-elon-musk-confirms-it-has-restarted-work-on-its-biggest-supercomputer-yet-but-what-will-it-actually-be-used-for</link>
      <pubDate>Sat, 24 Jan 2026 19:25:00 +0000</pubDate>
      <guid isPermaLink="false">9zX6CaNc4wVSn8x3q8nkrU</guid>
      <description>Tesla restarts Dojo 3 with AI5-AI7 chips, aiming to power autonomous vehicles, humanoid robots, data centers, and space-based AI compute.</description>
    </item>
    <item>
      <title>Report Says the E.U. Is Gearing Up to Weaponize Europe&#8217;s Tech Industry Against the U.S.</title>
      <link>https://gizmodo.com/report-says-the-e-u-is-gearing-up-to-weaponize-europes-tech-industry-against-the-u-s-2000712327</link>
      <pubDate>Sat, 24 Jan 2026 19:10:37 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000712327</guid>
      <description>Don't worry. No one is threatening to take away your access to Sweden-based Spotify.</description>
    </item>
    <item>
      <title>Nouveau v&#233;lo &#233;lectrique Decathlon, les voitures &#233;lectriques Xiaomi &#233;tonnent et le lithium menac&#233; &#8211; R&#233;cap&#8217; Survolt&#233;s</title>
      <link>https://www.frandroid.com/survoltes/2953329_recap-survoltes-202604</link>
      <pubDate>Sat, 24 Jan 2026 19:03:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2953329_recap-survoltes-202604</guid>
      <description>
De la perc&#233;e inattendue des voitures Xiaomi en Europe &#224; la nouvelle Renault Twingo &#233;lectrique aper&#231;ue dans un parking, en passant par un nouveau v&#233;lo &#233;lectrique Decathlon, les actualit&#233;s Survolt&#233;s ont &#233;t&#233; nombreuses cette semaine. Voici notre r&#233;cap' !
</description>
    </item>
    <item>
      <title>Google says it's working to fix Gmail issue that's led to flooded inboxes and increased spam warnings</title>
      <link>https://www.engadget.com/apps/google-says-its-working-to-fix-gmail-issue-thats-led-to-flooded-inboxes-and-increased-spam-warnings-183358654.html?src=rss</link>
      <pubDate>Sat, 24 Jan 2026 18:33:58 +0000</pubDate>
      <guid isPermaLink="false">aaee127f-ec6f-4849-b0d7-deb85afefd46</guid>
      <description>If your Gmail inbox is all out of whack today, you're not alone. Gmail users have been encountering issues with the automatic filters that keep their main inbox free from the clutter of promotional emails and non-urgent updates, and some have reported seeing notices that emails have not been scanned for spam. Google confirmed to Engadget and in an update on its Workspace status dashboard that it's aware of the problems, and is currently working on a fix.&#160;On social media and DownDetector, some Gmail users have also reported delays in receiving messages, leading to issues with two-factor authent...</description>
    </item>
    <item>
      <title>Google debuts Me Meme feature in Google Photos app</title>
      <link>https://mashable.com/article/google-debuts-me-meme-feature-google-photos-app</link>
      <pubDate>Sat, 24 Jan 2026 18:33:34 +0000</pubDate>
      <guid isPermaLink="false">04dVsnh5HZuvKH3HAVdI5Mm</guid>
      <description>Google debuts 'Me Meme' feature in Google Photos app</description>
    </item>
    <item>
      <title>The Insta360 CEO just leaked two upcoming cameras in one teaser image &#8211; here's what might be coming</title>
      <link>https://www.techradar.com/cameras/action-cameras/the-insta360-ceo-just-leaked-two-upcoming-cameras-in-one-teaser-image-heres-what-might-be-coming</link>
      <pubDate>Sat, 24 Jan 2026 18:30:00 +0000</pubDate>
      <guid isPermaLink="false">WTbqbstgggtRRYzoUS3z23</guid>
      <description>A Weibo post by Insta360 CEO Jingkang Liu has sparked a speculation frenzy about what's coming down the line.</description>
    </item>
  </channel>
</rss>
