<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 10 Nov 2025 08:53:32 GMT</lastBuildDate>
    <item>
      <title>&#171; Tesla et les entreprises chinoises vont dominer le march&#233; &#187; : pourquoi Elon Musk f&#233;licite l&#8217;un de ses plus grands concurrents</title>
      <link>https://www.frandroid.com/marques/xpeng/2861643_tesla-et-les-entreprises-chinoises-vont-dominer-le-marche-pourquoi-elon-musk-felicite-lun-de-ses-plus-grands-concurrents</link>
      <pubDate>Mon, 10 Nov 2025 08:39:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2861643_tesla-et-les-entreprises-chinoises-vont-dominer-le-marche-pourquoi-elon-musk-felicite-lun-de-ses-plus-grands-concurrents</guid>
      <description>
Elon Musk ne m&#226;che pas ses mots, et pour une fois, il f&#233;licite l'un de ses plus grands concurrents : Xpeng. L'entreprise chinoise, qui fabrique des voitures &#233;lectriques, vient de d&#233;voiler un robot. Et le patron de Tesla semble surpris.
</description>
    </item>
    <item>
      <title>&#171; Boules de feu, des d&#233;bris et des champignons atomiques &#187; : voici comment l&#8217;Ukraine utilise les voitures &#224; hydrog&#232;ne dans la guerre contre la Russie</title>
      <link>https://www.frandroid.com/marques/toyota/2861613_boules-de-feu-des-debris-et-des-champignons-atomiques-voici-comment-lukraine-utilise-les-voitures-a-hydrogene-dans-la-guerre-contre-la-russie</link>
      <pubDate>Mon, 10 Nov 2025 08:30:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/toyota/2861613_boules-de-feu-des-debris-et-des-champignons-atomiques-voici-comment-lukraine-utilise-les-voitures-a-hydrogene-dans-la-guerre-contre-la-russie</guid>
      <description>
Si les ventes de la Toyota Mirai sont en chute libre, la voiture &#233;lectrique &#224; hydrog&#232;ne semble s&#233;duire un autre type d&#8217;utilisateurs. Et pour cause, l&#8217;arm&#233;e ukrainienne s&#8217;en sert d&#233;sormais comme bombe dans le conflit qui l&#8217;oppose &#224; la Russie.
</description>
    </item>
    <item>
      <title>MacBook Pro M6&#160;: Apple r&#233;serverait l&#8217;&#233;cran OLED aux &#233;ditions plus ch&#232;res</title>
      <link>https://www.01net.com/actualites/macbook-pro-m6-apple-reserverait-ecran-oled-editions-plus-cheres.html</link>
      <pubDate>Mon, 10 Nov 2025 08:01:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306568</guid>
      <description>Apple pr&#233;parerait une refonte s&#233;lective de son MacBook Pro. Selon un informateur r&#233;put&#233;, seuls les mod&#232;les M6 Pro et M6 Max auraient droit au nouveau design plus fin et &#224; l&#8217;&#233;cran OLED tactile. Sur l'&#233;dition standard, on trouverait &#224; nouveau un &#233;cran LCD.</description>
    </item>
    <item>
      <title>Caroline Flack&#8217;s truth finally comes out in new Disney+ documentary &#8211; and it&#8217;s the most harrowing watch of the year</title>
      <link>https://www.techradar.com/streaming/disney-plus/caroline-flacks-truth-finally-comes-out-in-new-disney-documentary-and-its-the-most-harrowing-watch-of-the-year</link>
      <pubDate>Mon, 10 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">x7ALWzcKCqYFcxh9rcvdCN</guid>
      <description>Caroline Flack: Search for the Truth on Disney+ and Hulu is a heartbreaking watch, but it reminds us we all need to face a lot of harsh truths.</description>
    </item>
    <item>
      <title>Scared for your career&#8217;s future? Try the &#8216;GPS method&#8217;</title>
      <link>https://www.fastcompany.com/91437633/scared-for-your-careers-future-try-the-gps-method</link>
      <pubDate>2025-11-10T08:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91437633/scared-for-your-careers-future-try-the-gps-method</guid>
      <description>It&#8217;s a grounding practice to help you plot your next move strategically.
The job market is rough right now. Mass layoffs have people desperately clinging to their current positions. The Great Flattening has more and more workers competing for a dwindling number of roles as entry-level roles dry up and AI potentially rendering entire career paths obsolete.&#160;...</description>
    </item>
    <item>
      <title>La nouvelle Renault Twingo prouve que les voitures &#233;lectriques sont plus &#233;cologiques que les essence</title>
      <link>https://www.frandroid.com/marques/renault/2861603_la-nouvelle-renault-twingo-prouve-que-les-voitures-electriques-sont-plus-ecologiques-que-les-essence</link>
      <pubDate>Mon, 10 Nov 2025 07:58:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2861603_la-nouvelle-renault-twingo-prouve-que-les-voitures-electriques-sont-plus-ecologiques-que-les-essence</guid>
      <description>
Tout juste d&#233;voil&#233;e, la nouvelle Renault Twingo fait de gros progr&#232;s par rapport &#224; la pr&#233;c&#233;dente g&#233;n&#233;ration, et notamment sur un point. Car la petite voiture &#233;lectrique affiche une empreinte carbone particuli&#232;rement basse.
</description>
    </item>
    <item>
      <title>9 data-driven ways to finalize your post&#8209;Windows 10 strategy</title>
      <link>https://www.techradar.com/pro/9-data-driven-ways-to-finalize-your-post-windows-10-strategy</link>
      <pubDate>Mon, 10 Nov 2025 07:56:13 +0000</pubDate>
      <guid isPermaLink="false">tJnmHSCPrwWaecD9ZVHqKE</guid>
      <description>As the Windows 10 deadline looms, here are 9 strategies on how to use precise data to upgrade, extend, or repurpose endpoints effectively.</description>
    </item>
    <item>
      <title>Android&#160;16 va mieux masquer votre adresse, particuli&#232;rement si vous habitez &#224; la campagne</title>
      <link>https://www.frandroid.com/marques/google/2861609_android-16-va-mieux-masquer-votre-adresse-particulierement-si-vous-habitez-a-la-campagne</link>
      <pubDate>Mon, 10 Nov 2025 07:55:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2861609_android-16-va-mieux-masquer-votre-adresse-particulierement-si-vous-habitez-a-la-campagne</guid>
      <description>
Petit &#224; petit, Android offre de plus en plus d&#8217;outils pour tenter de limiter le partage des donn&#233;es personnelles avec des tiers. La derni&#232;re en date vise tout particuli&#232;rement celles et ceux qui habitent dans les zones rurales.
</description>
    </item>
    <item>
      <title>Il pense battre Apple et Samsung &#224; leur propre jeu : voici le Motorola Edge 70, on l&#8217;a pris en main</title>
      <link>https://www.frandroid.com/marques/motorola/2853417_il-pense-battre-apple-et-samsung-a-leur-propre-jeu-voici-le-motorola-edge-70-on-la-pris-en-main</link>
      <pubDate>Mon, 10 Nov 2025 07:51:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/motorola/2853417_il-pense-battre-apple-et-samsung-a-leur-propre-jeu-voici-le-motorola-edge-70-on-la-pris-en-main</guid>
      <description>
Le Motorola Edge 70 vient d'&#234;tre officialis&#233; en exclusivit&#233; chez Orange et nous avons d&#233;j&#224; pris en main ce nouveau smartphone ultra fin. Est-il capable de faire trembler Apple et Samsung ?
</description>
    </item>
    <item>
      <title>Apple d&#233;velopperait 5 nouvelles fonctions satellite pour l&#8217;iPhone</title>
      <link>https://www.01net.com/actualites/apple-developperait-5-nouvelles-fonctions-satellite-pour-liphone.html</link>
      <pubDate>Mon, 10 Nov 2025 07:36:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306562</guid>
      <description>Apple serait en train de d&#233;velopper de nouvelles fonctionnalit&#233;s satellite &#224; destination de l&#8217;iPhone. La firme de Cupertino r&#233;fl&#233;chirait m&#234;me &#224; lancer son propre service satellite.</description>
    </item>
    <item>
      <title>Moulinex Companion : le prix du roi des robots cuiseurs fond en ce pr&#233;-Black Friday (-150 &#8364;)</title>
      <link>https://www.frandroid.com/bons-plans/2860519_moulinex-companion-le-prix-du-roi-des-robots-cuiseurs-fond-en-ce-pre-black-friday-150-e</link>
      <pubDate>Mon, 10 Nov 2025 07:22:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860519_moulinex-companion-le-prix-du-roi-des-robots-cuiseurs-fond-en-ce-pre-black-friday-150-e</guid>
      <description>
Il p&#233;trit, &#233;mince, mijote et bien plus : le Moulinex Companion est l'arme secr&#232;te de celles et ceux qui n'ont pas le temps de cuisiner au quotidien. Pendant le pr&#233;-Black Friday, ce robot cuiseur XL est affich&#233; &#224; 449,99 euros au lieu de 599,99 euros sur Amazon. 
</description>
    </item>
    <item>
      <title>Un GPS a envoy&#233; ce retrait&#233; &#224; 2000 km de son rendez-vous, jusqu&#8217;en Croatie</title>
      <link>https://www.01net.com/actualites/gps-defaillant-envoye-francais-2000-kmrendez-vous-croatie.html</link>
      <pubDate>Mon, 10 Nov 2025 07:20:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306555</guid>
      <description>Il devait parcourir 25 kilom&#232;tres, il en a fait plus de 2 000. Parti de Ch&#226;tillon-sur-Thouet pour un simple rendez-vous m&#233;dical, un homme de 85 ans s&#8217;est retrouv&#233;&#8230; en Croatie. Il met en cause son GPS, auquel il s'est fi&#233; sans r&#233;fl&#233;chir.</description>
    </item>
    <item>
      <title>On a compl&#232;tement revu les tests d&#8217;autonomie du 01lab, voici ce que &#231;a change pour vous</title>
      <link>https://www.01net.com/actualites/on-a-completement-revu-les-tests-dautonomie-du-01lab-voici-ce-que-ca-change-pour-vous.html</link>
      <pubDate>Mon, 10 Nov 2025 07:13:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305054</guid>
      <description>Apr&#232;s de bons et loyaux services, les protocoles d'&#233;valuation de l'autonomie des produits en test au 01lab sont remplac&#233;s par une nouvelle version mise au go&#251;t du jour. Gr&#226;ce &#224; lui, nos tests gagnent en pertinence &#224; l'aide de mesures plus pr&#233;cises et plus r&#233;alistes.</description>
    </item>
    <item>
      <title>Google Pixel 10 Pro XL vs iPhone 16 Pro Max&#160;: quel t&#233;l&#233;phone haut de gamme choisir ?</title>
      <link>https://www.frandroid.com/versus/2816515_google-pixel-10-pro-xl-vs-iphone-16-pro-max-quel-telephone-haut-de-gamme-choisir</link>
      <pubDate>Mon, 10 Nov 2025 07:05:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/versus/2816515_google-pixel-10-pro-xl-vs-iphone-16-pro-max-quel-telephone-haut-de-gamme-choisir</guid>
      <description>
Google positionne ses sorties de fa&#231;on &#224; ce que son dernier-n&#233; arrive &#224; la toute fin du cycle de vie de ses principaux concurrents. En l'occurrence, l'iPhone 16 Pro Max fait un beau rival pour le nouveau flagship : qui repartira vainqueur&#160;?
</description>
    </item>
    <item>
      <title>Test du Ricoh GR IV : un vrai compact expert qui a l&#8217;art de se faire oublier</title>
      <link>https://www.frandroid.com/marques/ricoh/2857027_test-du-ricoh-gr-iv-un-vrai-compact-expert-qui-a-lart-de-se-faire-oublier</link>
      <pubDate>Mon, 10 Nov 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/ricoh/2857027_test-du-ricoh-gr-iv-un-vrai-compact-expert-qui-a-lart-de-se-faire-oublier</guid>
      <description>
Avec son nouveau capteur APS-C BSI de 25 MP, sa stabilisation m&#233;canique sur cinq axes et son objectif 28 mm f/2,8 redessin&#233;, le Ricoh GR IV ne bouleverse pas la formule &#8212; il la m&#251;rit. C&#8217;est un outil pens&#233; pour celles et ceux qui photographient beaucoup, souvent, discr&#232;tement. Dans un monde satur&#233; de capteurs d'un milliard de pixels et de bo&#238;tiers bard&#233;s d&#8217;&#233;crans articul&#233;s, le GR IV revendique l&#8217;essence m&#234;me de la photographie : la simplicit&#233;.
...</description>
    </item>
  </channel>
</rss>
