<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 22 Dec 2025 16:32:24 GMT</lastBuildDate>
    <item>
      <title>Instacart scraps AI pricing tests that made some products more expensive</title>
      <link>https://www.theverge.com/news/849061/instacart-ends-ai-pricing-tests-eversight</link>
      <pubDate>2025-12-22T11:32:17-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=849061</guid>
      <description>Instacart is ending its AI-powered pricing tests, which led some users to see higher prices on certain products than others. "Now, if two families are shopping for the same items, at the same time, from the same store location on Instacart, they see the same prices - period," Instacart writes in a blog post on [&#8230;]</description>
    </item>
    <item>
      <title>Colorado Windstorm Causes 4.8 Microsecond Glitch in Official U.S. Time</title>
      <link>https://gizmodo.com/colorado-windstorm-causes-4-8-microsecond-glitch-in-official-u-s-time-2000702524</link>
      <pubDate>Mon, 22 Dec 2025 16:30:47 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702524</guid>
      <description>A destructive windstorm disrupted the power supply to more than a dozen atomic clocks that keep official time in the United States.</description>
    </item>
    <item>
      <title>Uber allows violent felons to drive on its platform, investigation finds</title>
      <link>https://www.engadget.com/big-tech/uber-allows-violent-felons-to-drive-on-its-platform-investigation-finds-162721155.html?src=rss</link>
      <pubDate>Mon, 22 Dec 2025 16:27:21 +0000</pubDate>
      <guid isPermaLink="false">5f49c81d-f1e7-4989-98c4-a5737806376b</guid>
      <description>An investigation by the New York Times into Uber's background checks and safety procedures for its drivers found a patchwork approach that opens the door for violent felons to drive for the ride-hailing platform.
Uber outright rejects applicants convicted of murder, sexual assault, kidnapping and terrorism. However, in 22 states, the Times found Uber can approve applicants convicted of many other offenses including child abuse, assault and stalking, if the convictions are at least seven years old. The extensive investigation also found that in 35 states, these checks are based largely on where...</description>
    </item>
    <item>
      <title>Activists Announce They&#8217;ve to Scrape All of Spotify in Massive 300 Terabyte Archive</title>
      <link>https://gizmodo.com/activists-announce-theyve-to-scrape-all-of-spotify-in-massive-300-terabyte-archive-2000702508</link>
      <pubDate>Mon, 22 Dec 2025 16:25:47 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702508</guid>
      <description>Anna&#8217;s Archive claims it scraped millions of tracks from Spotify in the name of preservation.</description>
    </item>
    <item>
      <title>Faut-il vraiment conserver les lois de Newton pour expliquer les galaxies avec de la mati&#232;re noire ? Partie I</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-faut-il-vraiment-conserver-lois-newton-expliquer-galaxies-matiere-noire-partie-i-128103/#xtor%3DRSS-8</link>
      <pubDate>Mon, 22 Dec 2025 17:25:47 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-faut-il-vraiment-conserver-lois-newton-expliquer-galaxies-matiere-noire-partie-i-128103/#xtor%3DRSS-8</guid>
      <description>Depuis presque 40 ans, les astrophysiciens d&#233;battent pour savoir si l'on doit introduire de nouvelles particules, celles de la fameuse mati&#232;re noire, ou au contraire modifier la physique de Newton pour expliquer les observations concernant les galaxies, les amas de galaxies et la plus vieille...</description>
    </item>
    <item>
      <title>Uber and Lyft to test Baidu robotaxis in London next year, joining Waymo</title>
      <link>https://techcrunch.com/2025/12/22/uber-and-lyft-to-test-baidu-robotaxis-in-london-next-year-joining-waymo/</link>
      <pubDate>Mon, 22 Dec 2025 16:25:19 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078247</guid>
      <description>The geographic expansions continue for the ride-hailing companies' robotaxi plans.</description>
    </item>
    <item>
      <title>Huawei Watch GT 6 Pro : d&#233;j&#224; pr&#232;s de 100 &#8364; de remise pour cette r&#233;cente montre connect&#233;e qui combine &#233;l&#233;gance et fonctions sportives</title>
      <link>https://www.frandroid.com/bons-plans/2918551_huawei-watch-gt-6-pro-deja-pres-de-100-e-de-remise-pour-cette-recente-montre-connectee-qui-combine-elegance-et-fonctions-sportives</link>
      <pubDate>Mon, 22 Dec 2025 16:19:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2918551_huawei-watch-gt-6-pro-deja-pres-de-100-e-de-remise-pour-cette-recente-montre-connectee-qui-combine-elegance-et-fonctions-sportives</guid>
      <description>
Endurante, pr&#233;cise dans ses donn&#233;es et tr&#232;s styl&#233;e, la Huawei Watch GT 6 Pro est une montre connect&#233;e r&#233;ussie. Actuellement, AliExpress la vend &#224; 286,90 euros au lieu de 379,99 euros.
</description>
    </item>
    <item>
      <title>M&#234;me le label &#171; Vendu et exp&#233;di&#233; par Amazon &#187; n&#8217;est plus s&#251;r : m&#233;fiez-vous, de la fausse RAM circule</title>
      <link>https://www.frandroid.com/produits-android/hardware/memoire/2918685_meme-le-label-vendu-et-expedie-par-amazon-nest-plus-sur-mefiez-vous-de-la-fausse-ram-circule</link>
      <pubDate>Mon, 22 Dec 2025 16:19:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/memoire/2918685_meme-le-label-vendu-et-expedie-par-amazon-nest-plus-sur-mefiez-vous-de-la-fausse-ram-circule</guid>
      <description>
Les prix de la RAM grimpent, et les fraudes avec. Un utilisateur Reddit vient d'en faire les frais en recevant un bricolage grossier &#224; la place de sa m&#233;moire DDR5. Si vous comptez monter une machine prochainement, lisez bien ce qui suit avant de cliquer sur "Acheter".
</description>
    </item>
    <item>
      <title>HPE tells customers to patch OneView immediately as top-level security flaw spotted</title>
      <link>https://www.techradar.com/pro/security/hpe-tells-customers-to-patch-oneview-immediately-as-top-level-security-flaw-spotted</link>
      <pubDate>Mon, 22 Dec 2025 16:15:00 +0000</pubDate>
      <guid isPermaLink="false">QTfm67aD3q4tGozWsNGLmF</guid>
      <description>A 10/10 RCE flaw was found in HPE OneView, but it's not yet being abused.</description>
    </item>
    <item>
      <title>The Oura Ring 4 is our health &amp; fitness device of the year &#8212; and it&#8217;s just dropped to a record-low price</title>
      <link>https://www.techradar.com/health-fitness/the-oura-ring-4-is-our-health-and-fitness-device-of-the-year-and-its-just-dropped-to-a-record-low-price</link>
      <pubDate>Mon, 22 Dec 2025 16:12:02 +0000</pubDate>
      <guid isPermaLink="false">VVDvojma5GpuQwmwnsu5xA</guid>
      <description>The Oura Ring 4 is our favorite health &amp; fitness device in 2025. It's back to its all-time low Black Friday price for a limited time &#8211; and it arrives before Christmas.</description>
    </item>
    <item>
      <title>Eureka Ergonomic Ark EL Executive Standing Desk</title>
      <link>https://www.techradar.com/pro/eureka-ergonomic-ark-el-executive-standing-desk</link>
      <pubDate>Mon, 22 Dec 2025 16:05:00 +0000</pubDate>
      <guid isPermaLink="false">ThvFefRQJyiwiqF3X7ifDP</guid>
      <description>The Eureka Ergonomic Ark EL Executive is an attractive and functional standing desk, but its higher price may put off those not looking to spend on a statement piece.</description>
    </item>
    <item>
      <title>Les 10 smartphones les plus populaires de la semaine sur Frandroid : le Galaxy Z TriFold attire toutes les convoitises</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2491986_les-10-smartphones-les-plus-populaires-de-la-semaine-sur-frandroid-le-galaxy-z-trifold-attire-toutes-les-convoitises</link>
      <pubDate>Mon, 22 Dec 2025 16:03:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2491986_les-10-smartphones-les-plus-populaires-de-la-semaine-sur-frandroid-le-galaxy-z-trifold-attire-toutes-les-convoitises</guid>
      <description>
Pour notre top 10 des smartphones les plus populaires de la semaine sur Frandroid, certaines marques prennent le dessus. Sur ce classement, nous retrouvons la nouvelle innovation de chez Samsung.
</description>
    </item>
    <item>
      <title>Adieu Charles de Gaulle, bonjour PA-NG&#160;: la France lance la construction de son nouveau nouveau porte-avions</title>
      <link>https://www.01net.com/actualites/adieu-charles-de-gaulle-bonjour-pa-ng-la-france-lance-la-construction-de-son-nouveau-nouveau-porte-avions.html</link>
      <pubDate>Mon, 22 Dec 2025 16:03:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316657</guid>
      <description>Depuis les &#201;mirats arabes unis, Emmanuel Macron a valid&#233; ce dimanche le lancement de la construction du Porte-Avions de Nouvelle G&#233;n&#233;ration (PA-NG). Un chantier titanesque &#224; 10 milliards d&#8217;euros pour un navire qui devra assurer la souverainet&#233; fran&#231;aise jusqu&#8217;en 2080.</description>
    </item>
    <item>
      <title>1 000 km d&#8217;autonomie en voiture &#233;lectrique : pourquoi il faudra attendre plus longtemps que pr&#233;vu pour la batterie r&#233;volutionnaire</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2918507_1-000-km-dautonomie-en-voiture-electrique-pourquoi-il-faudra-attendre-plus-longtemps-que-prevu-pour-la-batterie-revolutionnaire</link>
      <pubDate>Mon, 22 Dec 2025 16:02:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2918507_1-000-km-dautonomie-en-voiture-electrique-pourquoi-il-faudra-attendre-plus-longtemps-que-prevu-pour-la-batterie-revolutionnaire</guid>
      <description>
Dongfeng vient d'annoncer un report d'un an pour la production de s&#233;rie de ses batteries solides, repoussant l'&#233;ch&#233;ance de septembre 2026 &#224; 2027. Un contretemps assez r&#233;v&#233;lateur des d&#233;fis que repr&#233;sente l'industrialisation de cette technologie promise comme r&#233;volutionnaire.
</description>
    </item>
    <item>
      <title>Get Ready for Tandem OLED TVs, but What the Hell is &#8216;WOLED?&#8217;</title>
      <link>https://gizmodo.com/get-ready-for-tandem-oled-tvs-but-what-the-hell-is-woled-2000702501</link>
      <pubDate>Mon, 22 Dec 2025 16:00:07 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702501</guid>
      <description>Micro RGB is going to have to compete against brighter OLED screens.</description>
    </item>
    <item>
      <title>Chipwrecked</title>
      <link>https://www.theverge.com/ai-artificial-intelligence/848988/nvidia-chip-loans-coreweave-gpu-debt-ai-neocloud</link>
      <pubDate>2025-12-22T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=848988</guid>
      <description>The AI data center build-out, as it currently stands, is dependent on two things: Nvidia chips and borrowed money. Perhaps it was inevitable that people would begin using Nvidia chips to borrow money. As the craze has gone on, I have begun to worry about the weaknesses of the AI data center boom; looking deeper [&#8230;]</description>
    </item>
    <item>
      <title>Fulham vs Nottingham Forest live streams: How to watch Premier League 2025-26 clash from anywhere in the world.</title>
      <link>https://www.techradar.com/how-to-watch/football/fulham-vs-nottingham-forest-premier-league-2025-26</link>
      <pubDate>Mon, 22 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">A5hB5eSMc6iFAL5kkwEgG3</guid>
      <description>We'll show you all the ways you can watch Fulham vs Nottingham Forest in the Premier League this Monday from anywhere in the world.</description>
    </item>
    <item>
      <title>Hisense mise gros sur le home cin&#233;ma avec deux vid&#233;oprojecteurs phares annonc&#233;s pour le CES 2026</title>
      <link>https://www.frandroid.com/marques/hisense/2918611_hisense-mise-gros-sur-le-home-cinema-avec-deux-videoprojecteurs-phares-annonces-pour-le-ces-2026</link>
      <pubDate>Mon, 22 Dec 2025 15:58:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/hisense/2918611_hisense-mise-gros-sur-le-home-cinema-avec-deux-videoprojecteurs-phares-annonces-pour-le-ces-2026</guid>
      <description>
Hisense pr&#233;sentera au CES 2026 une nouvelle g&#233;n&#233;ration de Laser Home Cin&#233;ma avec deux mod&#232;les phares, le XR10 et le PX4-Pro, con&#231;us pour offrir une tr&#232;s grande image &#224; domicile, une forte luminosit&#233; et une large couverture colorim&#233;trique, en s&#8217;appuyant sur la technologie laser TriChroma.&#8203;&#8203;
</description>
    </item>
    <item>
      <title>A comprehensive list of 2025 tech layoffs</title>
      <link>https://techcrunch.com/2025/12/22/tech-layoffs-2025-list/</link>
      <pubDate>Mon, 22 Dec 2025 15:57:49 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=2607662</guid>
      <description>A complete list of all the known layoffs in tech, from Big Tech to startups, broken down by month throughout 2025.</description>
    </item>
    <item>
      <title>730 km d&#8217;autonomie et recharge ultra-rapide : Volkswagen frappe un grand coup avec son nouveau SUV &#233;lectrique avec Xpeng en Chine</title>
      <link>https://www.frandroid.com/marques/volkswagen/2918473_730-km-dautonomie-et-recharge-ultra-rapide-volkswagen-frappe-un-grand-coup-avec-son-nouveau-suv-electrique-avec-xpeng-en-chine</link>
      <pubDate>Mon, 22 Dec 2025 15:56:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2918473_730-km-dautonomie-et-recharge-ultra-rapide-volkswagen-frappe-un-grand-coup-avec-son-nouveau-suv-electrique-avec-xpeng-en-chine</guid>
      <description>
Volkswagen d&#233;voile les caract&#233;ristiques techniques de son nouveau SUV &#233;lectrique, l'ID.Unyx 08, destin&#233; au march&#233; chinois. Avec des batteries allant jusqu'&#224; 95 kWh et une autonomie maximale de 730 km, le constructeur allemand tente de rattraper son retard par rapport aux acteurs locaux.
</description>
    </item>
    <item>
      <title>Cut through camera roll chaos with these Christmas cloud storage deals - including a huge saving on our top choice</title>
      <link>https://www.techradar.com/pro/cut-through-camera-roll-chaos-with-these-christmas-cloud-storage-deals-including-a-huge-saving-on-our-top-choice</link>
      <pubDate>Mon, 22 Dec 2025 15:51:51 +0000</pubDate>
      <guid isPermaLink="false">RZ4wAPw458KTANF9HzMjLj</guid>
      <description>Christmas videos are some of our most precious memories - keep them safe this festive season with our top storage deals.</description>
    </item>
    <item>
      <title>What&#8217;s really going on with the TikTok deal</title>
      <link>https://www.fastcompany.com/91464665/tiktok-bytedance-china-trump-oracle</link>
      <pubDate>2025-12-22T15:51:37</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464665/tiktok-bytedance-china-trump-oracle</guid>
      <description>A big win for national security? Or a shakedown?
The author of The Art of the Deal always likes to claim he&#8217;s a big winner when it comes to any business arrangement he makes. And in some ways, Donald Trump appears to have won big by finalizing a deal that will see Oracle, Silver Lake, and MGX take part-ownership of a new joint venture designed to oversee operations in the United States of TikTok, the wildly popular social video appl. But dig into the details and you&#8217;ll see that what Trump&#8217;s White House is keen to present as a big win for national security looks more like a standard business de...</description>
    </item>
    <item>
      <title>This gift-wrapping robot is quite funny, actually</title>
      <link>https://www.techradar.com/ai-platforms-assistants/this-gift-wrapping-robot-is-quite-funny-actually</link>
      <pubDate>Mon, 22 Dec 2025 15:45:27 +0000</pubDate>
      <guid isPermaLink="false">vCfRYSFHT9QGntyoJEYb9J</guid>
      <description>Humanoid's HMND 01 Alpha Bipedal robot tries to tackle a new holiday-themed task</description>
    </item>
    <item>
      <title>ChatGPT: Everything you need to know about the AI-powered chatbot</title>
      <link>https://techcrunch.com/2025/12/22/chatgpt-everything-to-know-about-the-ai-chatbot/</link>
      <pubDate>Mon, 22 Dec 2025 15:43:15 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=2607630</guid>
      <description>A timeline of ChatGPT product updates and releases, starting with the latest, which we&#8217;ve been updating throughout the year.</description>
    </item>
    <item>
      <title>Pourquoi Apple est-il condamn&#233; en Italie pour abus de position dominante&#160;?</title>
      <link>https://www.01net.com/actualites/pourquoi-apple-est-il-condamne-en-italie-pour-abus-de-position-dominante.html</link>
      <pubDate>Mon, 22 Dec 2025 15:36:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316622</guid>
      <description>98,6 millions d'euros : voil&#224; le ch&#232;que que devra signer Apple en cette fin d'ann&#233;e 2025 en Europe. Neuf mois plus t&#244;t, la marque &#224; la pomme a &#233;t&#233; condamn&#233;e &#224; une amende similaire en France, pour les m&#234;mes raisons.</description>
    </item>
    <item>
      <title>Le nouveau Amazon Fire TV Stick 4K Plus et sa compatibilit&#233; avec le Dolby Atmos et Vision conna&#238;t une perte importante de 57 % de son prix</title>
      <link>https://www.frandroid.com/bons-plans/2918185_le-nouveau-amazon-fire-tv-stick-4k-plus-et-sa-compatibilite-avec-le-dolby-atmos-et-vision-connait-une-perte-importante-de-57-de-son-prix</link>
      <pubDate>Mon, 22 Dec 2025 15:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2918185_le-nouveau-amazon-fire-tv-stick-4k-plus-et-sa-compatibilite-avec-le-dolby-atmos-et-vision-connait-une-perte-importante-de-57-de-son-prix</guid>
      <description>
En cette fin d'ann&#233;e 2025, Amazon brade son Fire TV Stick 4K Plus puisqu'il conna&#238;t une baisse de 57 %. Une offre qui va vous permettre d'emmener le Dolby Vision et l'Atmos dans votre salon &#224; moindre co&#251;t.
</description>
    </item>
    <item>
      <title>Quelles sont les meilleures cartes graphiques ? Le comparatif des GPU</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-gaming/815386_meilleures-cartes-graphiques</link>
      <pubDate>Mon, 22 Dec 2025 15:30:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-gaming/815386_meilleures-cartes-graphiques</guid>
      <description>
La carte graphique (GPU) est un &#233;l&#233;ment essentiel de tout bon PC gamer. Face &#224; un march&#233; en perp&#233;tuelle &#233;volution, avec des g&#233;n&#233;rations de GPU qui s&#8217;encha&#238;nent et des technologies qui progressent sans cesse, il peut &#234;tre difficile de s&#8217;y retrouver. Bienvenue sur notre guide s&#233;lectif qui vous aidera &#224; choisir la carte graphique la plus pertinente selon votre budget.
...</description>
    </item>
    <item>
      <title>It Sure Seems Like the Foldable iPhone Will Be a Wide Boi</title>
      <link>https://gizmodo.com/it-sure-seems-like-the-foldable-iphone-will-be-a-wide-boi-2000702475</link>
      <pubDate>Mon, 22 Dec 2025 15:30:20 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702475</guid>
      <description>It does make sense if you think about it.</description>
    </item>
    <item>
      <title>&#8216;Super flu&#8217; virus tracker: Symptoms and latest update as subclade K influenza variant spreads</title>
      <link>https://www.fastcompany.com/91464609/super-flu-influenza-virus-tracker-symptoms-subclade-k-variant-update</link>
      <pubDate>2025-12-22T15:21:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464609/super-flu-influenza-virus-tracker-symptoms-subclade-k-variant-update</guid>
      <description>New data from the CDC and local health officials show flu cases are spiking. Unfortunately, data reporting is expected to lag during the holiday.
As many families are preparing to gather for the holidays, influenza (flu) cases are spiking across the country. </description>
    </item>
    <item>
      <title>WatchGuard Firebox OS forced to patch worrying security flaw, so update now</title>
      <link>https://www.techradar.com/pro/security/watchguard-firebox-os-forced-to-patch-worrying-security-flaw-so-update-now</link>
      <pubDate>Mon, 22 Dec 2025 15:20:00 +0000</pubDate>
      <guid isPermaLink="false">ZE2jaFiMFuLUc4vandnkGX</guid>
      <description>The firewall maker found a critical RCE that is being abused in the wild.</description>
    </item>
    <item>
      <title>SoftBank is racing to close a $22.5 billion OpenAI funding gap before 2026</title>
      <link>https://www.fastcompany.com/91464632/softbank-racing-close-22-5-billion-openai-funding-gap-before-2026</link>
      <pubDate>2025-12-22T15:19:52</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464632/softbank-racing-close-22-5-billion-openai-funding-gap-before-2026</guid>
      <description>Sources say Softbank is executing various cash-raising schemes, including a sale of some investments.
SoftBank Group is racing to close a $22.5 billion funding commitment to OpenAI by year-end through an array of cash-raising schemes, including a sale of some investments, and could tap its undrawn margin loans borrowed against its valuable ownership in chip firm Arm Holdings, sources said....</description>
    </item>
    <item>
      <title>Amazon pr&#234;te James Bond &#224; Netflix</title>
      <link>https://www.01net.com/actualites/amazon-prete-james-bond-a-netflix.html</link>
      <pubDate>Mon, 22 Dec 2025 15:15:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316663</guid>
      <description>Amazon est pr&#234;teur : le propri&#233;taire du studio MGM autorise en effet Netflix &#224; diffuser plusieurs films du catalogue, dont des James Bond r&#233;cents et des s&#233;ries qui, jusqu'&#224; pr&#233;sents, &#233;taient exclusives &#224; Prime Video. Une d&#233;marche pragmatique et limit&#233;e dans le temps, mais qui confirme une tendance dans le milieu du streaming.</description>
    </item>
    <item>
      <title>&#8216;It&#8217; and &#8216;Black Phone&#8217; Actor James Ransone Has Died at Age 46</title>
      <link>https://gizmodo.com/james-ransone-dead-obituary-it-the-wire-black-phone-2000702371</link>
      <pubDate>Mon, 22 Dec 2025 15:00:10 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702371</guid>
      <description>Along with his genre roles in films like 'It: Chapter Two,' James Ransone was best remembered as Ziggy from 'The Wire.'</description>
    </item>
    <item>
      <title>Quordle hints and answers for Tuesday, December 23 (game #1429)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-23-december-2025</link>
      <pubDate>Mon, 22 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">HLE3cSv8ycMqTS2JEyWzcf</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Tuesday, December 23 (game #926)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-23-december-2025</link>
      <pubDate>Mon, 22 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">nwpzGgYKeC5x34PSMebro5</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Tuesday, December 23 (game #660)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-23-december-2025</link>
      <pubDate>Mon, 22 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">5bz9vp2BEdwYt2euXozSBm</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Business lessons of 2026, from Airbnb, Meta, Linkedin, and more</title>
      <link>https://www.fastcompany.com/91462358/business-lessons-of-2026-from-airbnb-meta-linkedin-and-more</link>
      <pubDate>2025-12-22T15:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91462358/business-lessons-of-2026-from-airbnb-meta-linkedin-and-more</guid>
      <description>Lessons from Airbnb&#8217;s Brian Chesky, Runway&#8217;s Crist&#243;bal Valenzuela, Meta&#8217;s Clara Shih, LinkedIn&#8217;s Aneesh Raman, and other business leaders in interviews from the last year.
This year delivered whiplash: geopolitics, tariffs, and technology all shifting at once. And heading into 2026, the disruption isn&#8217;t easing up. Bob Safian distills hard-won lessons from his Rapid Response podcast this year on how to lead when the ground won&#8217;t stop moving&#8212;featuring standout moments from Airbnb&#8217;s Brian Chesky, Runway&#8217;s Crist&#243;bal Valenzuela, Meta&#8217;s Clara Shih, LinkedIn&#8217;s Aneesh Raman, Planned Parenthood&#8217;s Alexi...</description>
    </item>
    <item>
      <title>Home prices are falling in these 98 housing markets</title>
      <link>https://www.fastcompany.com/91464717/housing-market-home-prices-are-falling-in-these-98-markets</link>
      <pubDate>2025-12-22T15:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464717/housing-market-home-prices-are-falling-in-these-98-markets</guid>
      <description>Among the 300 largest metro-area housing markets, these are the 98 with falling year-over-year home prices between November 2024 and November 2025.
Want more housing market stories from Lance Lambert&#8217;s ResiClub&#160;in your inbox?&#160;Subscribe&#160;to the&#160;ResiClub&#160;newsletter.</description>
    </item>
    <item>
      <title>This underrated Siri feature proves Apple can do AI &#8211; but the iPhone&#8217;s voice assistant still needs a drastic makeover in 2026</title>
      <link>https://www.techradar.com/phones/iphone/this-underrated-siri-feature-proves-apple-can-do-ai-but-the-iphones-voice-assistant-still-needs-a-drastic-makeover-in-2026</link>
      <pubDate>Mon, 22 Dec 2025 14:57:59 +0000</pubDate>
      <guid isPermaLink="false">UR3VoyNB4XewoybYJ3H3J</guid>
      <description>After noticing the subtle improvements made to Siri Suggestions, I'm convinced that Apple can bring meaningful AI upgrades to the iPhone in 2026.</description>
    </item>
    <item>
      <title>Don't let battery anxiety spoil your holiday gadget fun &#8211; grab this lightning deal on the fastest power bank I've tested</title>
      <link>https://www.techradar.com/phones/phone-accessories/dont-let-battery-anxiety-spoil-your-holiday-gadget-fun-grab-this-lightning-deal-on-the-fastest-power-bank-ive-tested</link>
      <pubDate>Mon, 22 Dec 2025 14:55:44 +0000</pubDate>
      <guid isPermaLink="false">xPotixpPQsXEnPKo8usd4Q</guid>
      <description>Get a huge discount on this fast-charging Anker power bank with this limited-time Amazon deal.</description>
    </item>
    <item>
      <title>ChatGPT n&#8217;est plus assez sympa&#160;? OpenAI corrige l&#8217;IA face aux critiques des utilisateurs</title>
      <link>https://www.01net.com/actualites/chatgpt-plus-assez-sympa-openai-corrige-ia-face-critiques-utilisateurs.html</link>
      <pubDate>Mon, 22 Dec 2025 14:47:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316629</guid>
      <description>ChatGPt-5.2 n'est pas parvenu &#224; plaire &#224; tout le monde. Pour certains internautes, la mise &#224; jour a rendu l'IA beaucoup moins sympa qu'avant. Face aux critiques, OpenAI a d&#233;cid&#233; d'ajouter une option qui permet d'ajuster l'aspect chaleureux des r&#233;ponses du chatbot.</description>
    </item>
    <item>
      <title>Paramount has an updated Warner Bros. Discovery bid</title>
      <link>https://www.engadget.com/entertainment/paramount-has-an-updated-warner-bros-discovery-bid-144348321.html?src=rss</link>
      <pubDate>Mon, 22 Dec 2025 14:43:48 +0000</pubDate>
      <guid isPermaLink="false">9701c19c-ff7e-4674-bb96-7233498f186d</guid>
      <description>Paramount Skydance isn't giving up on obtaining Warner Bros. Discovery just yet. The company has amended its $108 billion offer to include Larry Ellison's "irrevocable personal guarantee" equaling $40.4 billion. Ellison is the founder or Oracle and a backer of Skydance, created by his son David Ellison, Paramount Skydance's CEO.&#160;
On December 17, WBD formally recommended shareholders reject Paramount's offer. WBD had already accepted an $82.7 billion offer from Netflix, set to close some time next year following regulatory approval. "[The board] has unanimously determined that the tender offer ...</description>
    </item>
    <item>
      <title>The Doomsday Glacier Is Getting Closer and Closer to Irreversible Collapse</title>
      <link>https://www.wired.com/story/the-doomsday-glacier-is-getting-closer-and-closer-to-irreversible-collapse/</link>
      <pubDate>Mon, 22 Dec 2025 14:43:09 +0000</pubDate>
      <guid isPermaLink="false">69494bd14e7558e7ce233447</guid>
      <description>An analysis of the expansion of cracks in the Thwaites Glacier over the past 20 years suggests that a total collapse could be only a matter of time.</description>
    </item>
    <item>
      <title>Elon Musk&#8217;s net worth skyrockets to $749 billion, following pay package ruling</title>
      <link>https://www.fastcompany.com/91464621/elon-musks-net-worth-skyrockets-700-billion-following-pay-package-ruling</link>
      <pubDate>2025-12-22T14:38:58</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464621/elon-musks-net-worth-skyrockets-700-billion-following-pay-package-ruling</guid>
      <description>According to Forbes&#8217; billionaires list, Musk&#8217;s fortune now surpasses that of Google cofounder Larry Page, by almost $500 billion.
Tesla CEO Elon Musk&#8217;s net worth surged to $749 billion late Friday after the Delaware Supreme Court reinstated Tesla stock options worth $139 billion that were voided last year, according to Forbes&#8217; billionaires index.</description>
    </item>
    <item>
      <title>Skyscanner Makes 2026 Soccer Travel Easy Across North America, Book Affordable Trips Between Host Cities</title>
      <link>https://gizmodo.com/skyscanner-makes-2026-soccer-travel-easy-across-north-america-book-affordable-trips-between-host-cities-2000701648</link>
      <pubDate>Mon, 22 Dec 2025 14:36:13 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000701648</guid>
      <description>Use Skyscanner's Soccer Flight Finder and Soccer Travel Hub to find the best flight deals to all the host cities in the US, Canada, and Mexico.</description>
    </item>
  </channel>
</rss>
