<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 13 Feb 2026 11:34:36 GMT</lastBuildDate>
    <item>
      <title>Chrome&#160;: une des fonctions les plus pratiques arrive enfin sur Android</title>
      <link>https://www.01net.com/actualites/chrome-fonctions-plus-pratiques-arrive-android.html</link>
      <pubDate>Fri, 13 Feb 2026 11:29:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325900</guid>
      <description>Google Chrome pour Android permet enfin d'&#233;pingler des onglets. Voici comment utiliser cette nouvelle fonctionnalit&#233;.</description>
    </item>
    <item>
      <title>Forget zero-days - 'N-days' could be the most worrying security threat facing your systems today, here's why</title>
      <link>https://www.techradar.com/pro/security/forget-zero-days-n-days-could-be-the-most-worrying-security-threat-facing-your-systems-today-heres-why</link>
      <pubDate>Fri, 13 Feb 2026 11:25:43 +0000</pubDate>
      <guid isPermaLink="false">CG2oHhgN658ERoEtYVrEn8</guid>
      <description>The average time to exploit has dropped significantly over the last five years, experts have warned.</description>
    </item>
    <item>
      <title>How to finally operationalize Agentic AI and realize its full potential</title>
      <link>https://www.techradar.com/pro/how-to-finally-operationalize-agentic-ai-and-realize-its-full-potential</link>
      <pubDate>Fri, 13 Feb 2026 11:25:04 +0000</pubDate>
      <guid isPermaLink="false">vL37SEQEsEKGxcZznSUn2g</guid>
      <description>We must integrate AI into the fabric of the organization to fully reap its rewards</description>
    </item>
    <item>
      <title>Major telco breach sees 6.2 million users have personal info leaked - here's what we know so far</title>
      <link>https://www.techradar.com/pro/security/major-telco-breach-sees-6-2-million-users-have-personal-info-leaked-heres-what-we-know-so-far</link>
      <pubDate>Fri, 13 Feb 2026 11:25:00 +0000</pubDate>
      <guid isPermaLink="false">WRcMezSAhoLaP7SLPeduo8</guid>
      <description>Dutch telecommunications giant confirms breach, but says payment data remains secure.</description>
    </item>
    <item>
      <title>&#171; J&#8217;en ai fini de travailler avec des connards &#187;, Jony Ive cartonne Apple</title>
      <link>https://www.frandroid.com/marques/apple/2976577_jen-ai-fini-de-travailler-avec-des-connards-jony-ive-cartonne-apple</link>
      <pubDate>Fri, 13 Feb 2026 11:23:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2976577_jen-ai-fini-de-travailler-avec-des-connards-jony-ive-cartonne-apple</guid>
      <description>
Interview&#233; r&#233;cemment dans le cadre de sa collaboration avec Ferrari, le designer industriel Jony Ive, ancien ma&#238;tre &#224; penser d'Apple pour la conception de certains de ses produits les plus iconiques, s'en est pris indirectement &#224; ses anciens coll&#232;gues, les traitant litt&#233;ralement... de &#171; connards &#187;.
</description>
    </item>
    <item>
      <title>If Silent Hill: Townfall has taught me anything, it's that survival horror and British weather are absolutely meant for each other</title>
      <link>https://www.techradar.com/gaming/if-silent-hill-townfall-has-taught-me-anything-its-that-survival-horror-and-british-weather-are-absolutely-meant-for-each-other</link>
      <pubDate>Fri, 13 Feb 2026 11:20:26 +0000</pubDate>
      <guid isPermaLink="false">zHz3BmNFE63wYoKsXSrxeC</guid>
      <description>Silent Hill: Townfall is set in a creepy little Scottish town that leans heavily into analog tech and medical horror.</description>
    </item>
    <item>
      <title>I officially no longer have any reason to own a PS3 now that one of its biggest exclusives is coming to other platforms</title>
      <link>https://www.techradar.com/gaming/consoles-pc/i-officially-no-longer-have-any-reason-to-own-a-ps3-now-that-one-of-its-biggest-exclusives-is-coming-to-other-platforms</link>
      <pubDate>Fri, 13 Feb 2026 11:18:11 +0000</pubDate>
      <guid isPermaLink="false">HghrsVLXxSPgNV4HTjoYQV</guid>
      <description>Metal Gear Solid 4: Guns of the Patriots is coming to modern systems in a new Master Collection.</description>
    </item>
    <item>
      <title>Ecovacs Winbot Mini 2 : le petit robot qui mise tout sur l&#8217;agilit&#233;</title>
      <link>https://www.frandroid.com/marques/ecovacs/2975069_ecovacs-winbot-mini-2-le-petit-robot-qui-mise-tout-sur-lagilite</link>
      <pubDate>Fri, 13 Feb 2026 11:16:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/ecovacs/2975069_ecovacs-winbot-mini-2-le-petit-robot-qui-mise-tout-sur-lagilite</guid>
      <description>
Apr&#232;s le colossal Winbot W3 Omni pr&#233;sent&#233; au CES, Ecovacs pr&#233;sente un nouveau laveur de vitres qui revient aux essentiels. Point de station multifonction ici : le Winbot Mini 2 se veut le robot lave-vitre le plus compact du march&#233;, capable de se faufiler l&#224; o&#249; d'autres doivent jeter l'&#233;ponge.
</description>
    </item>
    <item>
      <title>Microsoft n&#8217;en peut plus d&#8217;OpenAI&#160;: on connait les raisons du divorce</title>
      <link>https://www.frandroid.com/marques/microsoft/2976395_microsoft-nen-peut-plus-dopenai-on-connait-les-raisons-du-divorce</link>
      <pubDate>Fri, 13 Feb 2026 11:14:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2976395_microsoft-nen-peut-plus-dopenai-on-connait-les-raisons-du-divorce</guid>
      <description>
Microsoft souhaite d&#233;sormais voler de ses propres ailes et vise une &#171; v&#233;ritable autonomie &#187; en mati&#232;re d'IA pour r&#233;duire sa d&#233;pendance &#224; OpenAI.
</description>
    </item>
    <item>
      <title>Votre enfant r&#233;clame un t&#233;l&#233;phone ? D&#233;couvrez cette alternative s&#233;curis&#233;e &#224; petit prix [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2971811_votre-enfant-reclame-un-telephone-decouvrez-cette-alternative-securisee-a-petit-prix</link>
      <pubDate>Fri, 13 Feb 2026 11:12:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2971811_votre-enfant-reclame-un-telephone-decouvrez-cette-alternative-securisee-a-petit-prix</guid>
      <description>
Entre la g&#233;olocalisation, les appels s&#233;curis&#233;s et le mode &#233;cole, la Kids Watch est une montre connect&#233;e qui permet aux enfants de faire un premier pas rassurant dans le monde du num&#233;rique.
</description>
    </item>
    <item>
      <title>The 'QuitGPT' movement is targeting ChatGPT with a boycott and spotlighting the politics behind the AI giant</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/the-quitgpt-movement-is-targeting-chatgpt-with-a-boycott-and-spotlighting-the-politics-behind-the-ai-giant</link>
      <pubDate>Fri, 13 Feb 2026 11:11:05 +0000</pubDate>
      <guid isPermaLink="false">mueecq5n63s8Hx6UnKgMMf</guid>
      <description>QuitGPT is a viral grassroots campaign encouraging users to cancel ChatGPT over political and ethical concerns, highlighting rising tensions between AI platforms and their users.</description>
    </item>
    <item>
      <title>I've spent hours browsing Amazon's Presidents' Day sale &#8212; here are the 49 best deals according to a shopping expert</title>
      <link>https://www.techradar.com/live/news/amazons-presidents-day-sale-live-2026</link>
      <pubDate>Fri, 13 Feb 2026 11:09:34 +0000</pubDate>
      <guid isPermaLink="false">NQ78V4vFXc4Kvy4ub6dwNU</guid>
      <description>Don't waste your time - I've spent hours shopping Amazon's Presidents' Day sale and hand-picked the 49 best deals that are actually worth buying.</description>
    </item>
    <item>
      <title>'Our goal is to create a wholly immersive experience unlike any other in video games' &#8212; Saber Interactive's John Wick game already has me sold thanks to the simple fact that Keanu Reeves is returning for his iconic role</title>
      <link>https://www.techradar.com/gaming/our-goal-is-to-create-a-wholly-immersive-experience-unlike-any-other-in-video-games-saber-interactives-john-wick-game-already-has-me-sold-thanks-to-the-simple-fact-that-keanu-reeves-is-returning-for-his-iconic-role</link>
      <pubDate>Fri, 13 Feb 2026 11:08:04 +0000</pubDate>
      <guid isPermaLink="false">8FShaxSydWtQy2iWa76CXH</guid>
      <description>Saber Interactive has revealed its new AAA third-person John Wick game, which will see the return of Keanu Reeves in the titular role.</description>
    </item>
    <item>
      <title>La technologie QD-OLED Penta Tandem de Samsung Display, qu&#8217;est-ce que c&#8217;est&#160;?</title>
      <link>https://www.frandroid.com/produits-android/tv-connectee-produits/2976779_la-technologie-qd-oled-penta-tandem-de-samsung-display-quest-ce-que-cest</link>
      <pubDate>Fri, 13 Feb 2026 11:07:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/tv-connectee-produits/2976779_la-technologie-qd-oled-penta-tandem-de-samsung-display-quest-ce-que-cest</guid>
      <description>
Samsung Display officialise le lancement de sa technologie &#171;&#160;QD-OLED Penta Tandem&#160;&#187;, une architecture d'&#233;cran reposant sur cinq couches organiques empil&#233;es mais qui est d&#233;j&#224; utilis&#233;e. Au programme, am&#233;lioration de la luminosit&#233;, de l'efficacit&#233; &#233;nerg&#233;tique et de la long&#233;vit&#233; des dalles destin&#233;es aux t&#233;l&#233;viseurs et moniteurs haut de gamme. Mais qu&#8217;est-ce que c&#8217;est exactement&#160;?
...</description>
    </item>
    <item>
      <title>Un t&#233;lescope spatial a d&#233;couvert un syst&#232;me plan&#233;taire &#224; l&#8217;envers qui retourne nos th&#233;ories</title>
      <link>https://www.futura-sciences.com/sciences/actualites/exoplanetes-telescope-spatial-decouvert-systeme-planetaire-envers-retourne-nos-theories-131132/#xtor%3DRSS-8</link>
      <pubDate>Fri, 13 Feb 2026 12:07:18 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/exoplanetes-telescope-spatial-decouvert-systeme-planetaire-envers-retourne-nos-theories-131132/#xtor%3DRSS-8</guid>
      <description>Le satellite Cheops de l&#8217;Agence spatiale europ&#233;enne a r&#233;v&#233;l&#233; des caract&#233;ristiques in&#233;dites du syst&#232;me plan&#233;taire autour de l&#8217;&#233;toile LHS 1903. Cette d&#233;couverte, men&#233;e par une &#233;quipe internationale sous la direction de Thomas Wilson de l&#8217;Universit&#233; de Warwick, remet en question les th&#233;ories sur la...</description>
    </item>
    <item>
      <title>Apr&#232;s 18 ans, PlayStation perd enfin cette exclusivit&#233; et c&#8217;est une tr&#232;s bonne nouvelle</title>
      <link>https://www.frandroid.com/produits-android/console/2976675_apres-18-ans-playstation-perd-enfin-cette-exclusivite-et-cest-une-tres-bonne-nouvelle</link>
      <pubDate>Fri, 13 Feb 2026 11:05:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2976675_apres-18-ans-playstation-perd-enfin-cette-exclusivite-et-cest-une-tres-bonne-nouvelle</guid>
      <description>
Konami a pr&#233;sent&#233; Metal Gear Solid Master Collection Vol.2 contenant Metal Gear Solid 4. Ce jeu &#233;tait bloqu&#233; sur PlayStation 3 depuis 18 ans.
</description>
    </item>
    <item>
      <title>&#171;&#160;Vous allez vous priver des meilleurs outils&#160;&#187; : Google met en garde l&#8217;Europe</title>
      <link>https://www.01net.com/actualites/vous-allez-vous-priver-des-meilleurs-outils-google-met-en-garde-leurope.html</link>
      <pubDate>Fri, 13 Feb 2026 11:01:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325831</guid>
      <description>Le g&#233;ant du num&#233;rique am&#233;ricain plaide pour que l'Europe adopte une &#171; souverainet&#233; num&#233;rique ouverte &#187;&#160;aux meilleures technologies&#8230; dont les siennes, dans un contexte o&#249; les Europ&#233;ens cherchent &#224; &#234;tre moins d&#233;pendants des solutions num&#233;riques am&#233;ricaines.</description>
    </item>
    <item>
      <title>Scientists Discover Time Crystals You Can Hold&#8212;and They Levitate</title>
      <link>https://gizmodo.com/scientists-discover-time-crystals-you-can-hold-and-they-levitate-2000721148</link>
      <pubDate>Fri, 13 Feb 2026 11:00:17 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000721148</guid>
      <description>The time crystal "beads," held midair by sound waves, bring the enigmatic quantum system into renewed practical relevance.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs &#233;couteurs sans fil en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guide-audio/482350_quels-sont-les-meilleurs-ecouteurs-true-wireless-a-moins-de-200-euros-en-2018</link>
      <pubDate>Fri, 13 Feb 2026 11:00:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-audio/482350_quels-sont-les-meilleurs-ecouteurs-true-wireless-a-moins-de-200-euros-en-2018</guid>
      <description>
Les &#233;couteurs sans fil Bluetooth se sont impos&#233;s comme des accessoires essentiels au quotidien, tant pour la musique que pour les appels ou le sport. Nous avons s&#233;lectionn&#233; et test&#233; pour vous les mod&#232;les d'&#233;couteurs sans fil les plus adapt&#233;s &#224; vos besoins et &#224; votre budget.
</description>
    </item>
    <item>
      <title>Here's Why I'd Buy the Last Samsung Soundbar First</title>
      <link>https://www.wired.com/story/the-best-soundbar-is-last-years-samsung/</link>
      <pubDate>Fri, 13 Feb 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">69863bd0c9579aeed874bd91</guid>
      <description>Going one or two generations back in Samsung's Q990 soundbar series is the smartest way to get insane home theater sound.</description>
    </item>
    <item>
      <title>Intersport remet en promotion son v&#233;lo &#233;lectrique pliable pas cher</title>
      <link>https://www.frandroid.com/bons-plans/2898401_intersport-remet-en-promotion-son-velo-electrique-pliable-pas-cher</link>
      <pubDate>Fri, 13 Feb 2026 10:58:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2898401_intersport-remet-en-promotion-son-velo-electrique-pliable-pas-cher</guid>
      <description>
Le Nakamura Felxy Boost est un v&#233;lo pliant &#224; assistance &#233;lectrique principalement ax&#233; pour les d&#233;placements urbains, &#224; retrouver pour 1 199,99 euros sur Interport au lieu de 1 399,99 euros.
</description>
    </item>
    <item>
      <title>A perfect match &#8211; NordVPN teams up with CrowdStrike to take its Threat Protection Pro suite to the next level</title>
      <link>https://www.techradar.com/vpn/vpn-services/a-perfect-match-nordvpn-teams-up-with-crowdstrike-to-take-its-threat-protection-pro-suite-to-the-next-level</link>
      <pubDate>Fri, 13 Feb 2026 10:55:36 +0000</pubDate>
      <guid isPermaLink="false">NjwsmZK8SFRfUNwsUUBqUD</guid>
      <description>NordVPN has strengthened its partnership with CrowdStrike to bring enterprise-grade intelligence to consumer security. Here's all you need to know.</description>
    </item>
    <item>
      <title>Voici toutes les couleurs du Samsung Galaxy S26</title>
      <link>https://www.01net.com/actualites/voici-toutes-les-couleurs-du-samsung-galaxy-s26.html</link>
      <pubDate>Fri, 13 Feb 2026 10:52:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325832</guid>
      <description>Evan Blass r&#233;v&#232;le les coloris princpaux des Galaxy S26 : noir, blanc, bleu clair et violet pour toute la gamme. Pr&#233;sent&#233;s le 25 f&#233;vrier, ils devraient peaufiner l'exp&#233;rience sans r&#233;volution majeure.</description>
    </item>
    <item>
      <title>C&#8217;est une premi&#232;re, et c&#8217;est lourd de sens : pourquoi les voitures &#233;lectriques de Toyota ont d&#233;pass&#233; Volkswagen en Chine</title>
      <link>https://www.frandroid.com/marques/toyota/2976329_cest-une-premiere-et-cest-lourd-de-sens-pourquoi-les-voitures-electriques-de-toyota-ont-depasse-volkswagen-en-chine</link>
      <pubDate>Fri, 13 Feb 2026 10:48:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/toyota/2976329_cest-une-premiere-et-cest-lourd-de-sens-pourquoi-les-voitures-electriques-de-toyota-ont-depasse-volkswagen-en-chine</guid>
      <description>
Le march&#233; chinois est devenu le premier march&#233; automobile mondial, port&#233; par une forte proportion de v&#233;hicules &#233;lectriques. Tous les constructeurs veulent s&#8217;y imposer, et &#233;videmment les deux g&#233;ants mondiaux que sont Toyota et Volkswagen. Mais lorsqu&#8217;il s&#8217;agit de savoir lequel des deux a vendu le plus de voitures &#233;lectriques en Chine&#8230; le r&#233;sultat est loin d&#8217;&#234;tre celui que l&#8217;on aurait imagin&#233;.
...</description>
    </item>
    <item>
      <title>YouTube est disponible nativement sur le Vision Pro, ce qui change pour le casque d&#8217;Apple</title>
      <link>https://www.frandroid.com/marques/apple/2976471_youtube-est-disponible-nativement-sur-le-vision-pro-ce-qui-change-pour-le-casque-dapple</link>
      <pubDate>Fri, 13 Feb 2026 10:46:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2976471_youtube-est-disponible-nativement-sur-le-vision-pro-ce-qui-change-pour-le-casque-dapple</guid>
      <description>
Pr&#232;s de deux ans apr&#232;s le lancement du casque de r&#233;alit&#233; mixte d'Apple, Google d&#233;ploie une version officielle et native de son application YouTube pour visionOS.
</description>
    </item>
    <item>
      <title>There's a new John Wick game on the way</title>
      <link>https://www.engadget.com/gaming/theres-a-new-john-wick-game-on-the-way-103900064.html?src=rss</link>
      <pubDate>Fri, 13 Feb 2026 10:39:01 +0000</pubDate>
      <guid isPermaLink="false">3625f383-68f0-4a9b-be5a-2c62895eee69</guid>
      <description>
There's a new AAA John Wick game coming with Keanu Reaves portraying the main character both in voice and likeness, Lionsgate and Saber Interactive announced. Currently untitled, it's in development for PS5, Xbox Series X and S, and PC, and will be a single-player third-person experience designed for "mature" audiences. So far, there's no release date.&#160;
"The new single-player third-person action game will combine John Wick&#8217;s unparalleled, adrenaline-fueled 'gun-fu' fighting style with Saber&#8217;s proven reputation for creating thrilling gaming experiences that leave players craving more," the com...</description>
    </item>
    <item>
      <title>The Best Mattress Toppers (2026): Supportive, Plush, Memory Foam</title>
      <link>https://www.wired.com/gallery/best-mattress-toppers/</link>
      <pubDate>Fri, 13 Feb 2026 10:38:00 +0000</pubDate>
      <guid isPermaLink="false">6712cce01ba4f640c938c359</guid>
      <description>These toppers will transform your mattress into exactly what you need, whether that&#8217;s a super-plush pillow top, memory foam, or targeted back support.</description>
    </item>
    <item>
      <title>Apr&#232;s 8 mois de silence, Microsoft r&#232;gle discr&#232;tement le pire bug de Windows 11 contre Chrome</title>
      <link>https://www.frandroid.com/marques/microsoft/2976693_apres-8-mois-de-silence-microsoft-regle-discretement-le-pire-bug-de-windows-11-contre-chrome</link>
      <pubDate>Fri, 13 Feb 2026 10:37:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2976693_apres-8-mois-de-silence-microsoft-regle-discretement-le-pire-bug-de-windows-11-contre-chrome</guid>
      <description>
Un f&#226;cheux bug dans Windows 11 emp&#234;chait certains utilisateurs d'utiliser ou m&#234;me de lancer le navigateur Google Chrome. Microsoft vient de d&#233;ployer un correctif pour son syst&#232;me de contr&#244;le parental, le coupable de ce dysfonctionnement.
</description>
    </item>
    <item>
      <title>LinkedIn launches one-stop shop for all the tools your SMB needs to succeed and grow</title>
      <link>https://www.techradar.com/pro/linkedin-launches-one-stop-shop-for-all-the-tools-your-smb-needs-to-succeed-and-grow</link>
      <pubDate>Fri, 13 Feb 2026 10:30:46 +0000</pubDate>
      <guid isPermaLink="false">T4rF92QUPnuc2H8Z2jRhEc</guid>
      <description>Premium All-in-One is one of three Premium plans LinkedIn has for SMBs.</description>
    </item>
    <item>
      <title>&#192; quoi ressemblera l&#8217;iPhone 17e&#160;? Peut-&#234;tre &#224; &#231;a</title>
      <link>https://www.01net.com/actualites/a-quoi-ressemblera-iphone-17e-peut-etre-ca.html</link>
      <pubDate>Fri, 13 Feb 2026 10:26:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325828</guid>
      <description>Voici le meilleur aper&#231;u de ce &#224; quoi pourrait ressembler le futur iPhone 17e d'Apple.</description>
    </item>
    <item>
      <title>No data discolsed and four ISO certifications &#8211; ExpressVPN proves to take good care of your data beyond third-party audits</title>
      <link>https://www.techradar.com/vpn/vpn-services/no-data-discolsed-and-four-iso-certifications-expressvpn-proves-to-take-good-care-of-your-data-beyond-third-party-audits</link>
      <pubDate>Fri, 13 Feb 2026 10:23:58 +0000</pubDate>
      <guid isPermaLink="false">zQhtnYjv4VKVCu45UBKeXi</guid>
      <description>ExpressVPN has announced the acquisition of four ISO certifications alongside a new transparency report revealing zero data disclosures, reinforcing its position as a privacy leader.</description>
    </item>
    <item>
      <title>Krispy Kreme has launched a massive doughnut giveaway &#8212; heres how to win a free dozen</title>
      <link>https://mashable.com/article/krispy-kreme-friday-the-13th-free-giveaway</link>
      <pubDate>Fri, 13 Feb 2026 10:17:07 +0000</pubDate>
      <guid isPermaLink="false">06H3dWkGfYXmNXeWBmxpQ5K</guid>
      <description>Krispy Kreme will give away 13,000 Original Glazed dozens to randomly selected guests at participating U.S. stores on Feb. 13.</description>
    </item>
    <item>
      <title>Chez Spotify, les humains ne codent plus depuis plusieurs mois</title>
      <link>https://www.frandroid.com/services/streaming-musical/2976275_chez-spotify-les-humains-ne-codent-plus-depuis-plusieurs-mois</link>
      <pubDate>Fri, 13 Feb 2026 10:07:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/streaming-musical/2976275_chez-spotify-les-humains-ne-codent-plus-depuis-plusieurs-mois</guid>
      <description>
L&#8217;intelligence artificielle semble incontournable chez Spotify. Selon l&#8217;un de ses patrons, de nombreux d&#233;veloppeurs utiliseraient un syst&#232;me d&#8217;IA personnalis&#233; et ne coderaient tout simplement plus depuis d&#233;cembre 2025. &#160;
</description>
    </item>
    <item>
      <title>En faillite, cette solution de recharge sans fil pour v&#233;lo &#233;lectrique est grandement menac&#233;e</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2976509_en-faillite-cette-solution-de-recharge-sans-fil-pour-velo-electrique-est-grandement-menacee</link>
      <pubDate>Fri, 13 Feb 2026 10:06:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2976509_en-faillite-cette-solution-de-recharge-sans-fil-pour-velo-electrique-est-grandement-menacee</guid>
      <description>
En raison de la faillite de la maison-m&#232;re Fesla Charge aux Pays-Bas, la solution de recharge par induction Tiler Charge, qui fonctionne via la b&#233;quille du v&#233;lo &#233;lectrique et une dalle &#233;lectris&#233;e au sol, voit son avenir s&#8217;assombrir.
</description>
    </item>
    <item>
      <title>Microsoft vous a entendu : cette option d&#233;sesp&#233;r&#233;ment r&#233;clam&#233;e arrivera bient&#244;t sur Windows 11</title>
      <link>https://www.frandroid.com/marques/microsoft/2976309_microsoft-vous-a-entendu-cette-option-desesperement-reclamee-arrivera-bientot-sur-windows-11</link>
      <pubDate>Fri, 13 Feb 2026 10:05:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2976309_microsoft-vous-a-entendu-cette-option-desesperement-reclamee-arrivera-bientot-sur-windows-11</guid>
      <description>
Selon des informations publi&#233;es par le site sp&#233;cialis&#233; Windows Central, Microsoft serait sur le point de d&#233;ployer une option r&#233;clam&#233;e depuis les d&#233;buts de Windows 11, permettant de d&#233;placer et de redimensionner la barre des t&#226;ches.
</description>
    </item>
    <item>
      <title>Apr&#232;s un State of Play d&#8217;anthologie, Sony brade ses abonnements PS Plus Premium et Extra</title>
      <link>https://www.frandroid.com/bons-plans/2976289_apres-un-state-of-play-danthologie-sony-brade-les-abonnements-ps-plus-premium-et-extra</link>
      <pubDate>Fri, 13 Feb 2026 10:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2976289_apres-un-state-of-play-danthologie-sony-brade-les-abonnements-ps-plus-premium-et-extra</guid>
      <description>
Le PlayStation Plus est l'abonnement qui permet, de base, de jouer en ligne sur PS5 mais aussi de profiter de jeux gratuits et de versions d'essai tous les mois, aujourd'hui au prix exceptionnel de 99,99 euros l'ann&#233;e, au lieu de 151,99 euros pour le Premium et de 125,99 euros pour l'Extra.
</description>
    </item>
    <item>
      <title>NYT Mini crossword answers, hints for February 13, 2026</title>
      <link>https://mashable.com/article/nyt-mini-crossword-answers-hints-february-13-2026</link>
      <pubDate>Fri, 13 Feb 2026 10:01:34 +0000</pubDate>
      <guid isPermaLink="false">00bYHCwk0657ICNtBHZhxb2</guid>
      <description>Answers to each clue for the Feb. 13, 2026 edition of NYT's The Mini crossword puzzle.</description>
    </item>
    <item>
      <title>The best iPhone accessories for 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-iphone-accessories-140022449.html?src=rss</link>
      <pubDate>Fri, 13 Feb 2026 10:01:27 +0000</pubDate>
      <guid isPermaLink="false">627af3fd-594b-3179-8c13-badf394090c0</guid>
      <description>The right accessories can make your iPhone feel more capable and more personal. Whether you want to protect your phone, improve your photos or stay powered during a long day out, there are plenty of accessories that can make a real difference. MagSafe gear has opened the door for new chargers, stands and mounts, while portable batteries and compact lenses can upgrade your everyday routine.We tested a range of products to find the best iPhone accessories that offer practical benefits for both new and older models.
Best iPhone accessories































This article originally ap...</description>
    </item>
    <item>
      <title>Fusion startup Helion hits blistering temps as it races toward 2028 deadline</title>
      <link>https://techcrunch.com/2026/02/13/fusion-startup-helion-hits-blistering-temps-as-it-races-toward-2028-deadline/</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3092675</guid>
      <description>Helion's Polaris device hit 150 million degrees C recently, a milestone that nudges the company toward its commercial power plant that will sell electricity to Microsoft.</description>
    </item>
    <item>
      <title>How to let go of resentment on the job</title>
      <link>https://www.fastcompany.com/91490454/how-to-let-go-of-resentment-on-the-job</link>
      <pubDate>2026-02-13T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91490454/how-to-let-go-of-resentment-on-the-job</guid>
      <description>Letting negativity stew isn&#8217;t good for anyone.
No matter how much you like your coworkers, you&#8217;re going to have some conflicts with them. Most of those conflicts involve differences of opinion or approach. A colleague may do something that irks you or causes difficulties for the work you&#8217;re doing. While those conflicts may lead to tension for some period, you typically get beyond those difficulties and may even wind up with a closer relationship to them later....</description>
    </item>
    <item>
      <title>How women&#8217;s skiwear falls short when it comes to actually&#160;skiing</title>
      <link>https://www.fastcompany.com/91491264/how-womens-ski-wear-falls-short-when-it-comes-to-actually-skiing</link>
      <pubDate>2026-02-13T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91491264/how-womens-ski-wear-falls-short-when-it-comes-to-actually-skiing</guid>
      <description>Many fast-fashion collections are deeply impractical. They sell women on the alluring glamour of skiing while leaving them out in the cold.
Marks &amp; Spencer is one of the latest U.K. high-street brands to launch a skiwear collection. Even supermarket Lidl is in on the action, with items in its ski range priced at less than 5 pounds (roughly $6.75). This follows earlier moves by fast-fashion retailers such as Topshop, which launched SNO in the mid 2010&#8217;s, and Zara&#8217;s imaginatively titled Zara Ski collection, which launched in 2023....</description>
    </item>
    <item>
      <title>Taskmaster (Little) Alex Horne and Greg Davies reveal which iconic tasks they would never do</title>
      <link>https://mashable.com/video/taskmaster-alex-horne-greg-davies-slash-or-pass</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">04iLrI42gT0wOdg6c97xs7X</guid>
      <description>Would Taskmaster Alex Horne and Greg Davies actually compete in their own tasks?</description>
    </item>
    <item>
      <title>The DJI Mini 5 Pro Fly More Combo just hit a new record-low price &#8212; save over $500 at Amazon</title>
      <link>https://mashable.com/article/feb-13-dij-mini-5-fly-more-combo-deal</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">07ImPE8xW8OVGelXnKGBqQK</guid>
      <description>Find the best DJI drone deal. Save 32% on the DJI Mini 5 Pro Fly More Combo at Amazon.</description>
    </item>
    <item>
      <title>How to watch Ireland vs. Italy online for free</title>
      <link>https://mashable.com/article/ireland-italy-six-nations-2026-live-stream-for-free</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02K5KdokqVeQHOzAaC6i8YB</guid>
      <description>Watch the Six Nations for free. Live stream Ireland vs. Italy in the 2026 Six Nations for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Watching HBOs Neighbors is like seeing Reddits wildest AITA stories come to life</title>
      <link>https://mashable.com/article/neighbors-hbo</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00Ky2xetq3bCTLi9PL4KfO6</guid>
      <description>HBO and A24's unscripted series "Neighbors" tracks unbelievable, real-life neighbor beef.</description>
    </item>
    <item>
      <title>A cleaner internet experience is just $15</title>
      <link>https://mashable.com/article/feb-13-adlock-lifetime-subscription</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">036pNE5kCyXRmgxvG6l8jJ2</guid>
      <description>Get lifetime access to AdLock Premium for $14.99 and enjoy faster, cleaner, safer browsing across all your devices.</description>
    </item>
    <item>
      <title>Cold Storage review: Like parasitic fungus, this horror comedy will grow on you</title>
      <link>https://mashable.com/article/cold-storage-review</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">055OyIlPqZzaQIJIzxdrQGH</guid>
      <description>Written by "Jurassic Park" co-scribe David Koepp, "Cold Storage" is fungal horror starring Liam Neeson, Joe Keery,</description>
    </item>
    <item>
      <title>How to watch Clemson vs. Duke online for free</title>
      <link>https://mashable.com/article/clemson-duke-college-basketball-2026-live-stream-for-free</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">037AA1XmlQtkK9IYhdpSpFo</guid>
      <description>How to watch college basketball for free. Live stream Duke vs. Clemson in 2026.</description>
    </item>
    <item>
      <title>How to watch Michigan vs. UCLA online for free</title>
      <link>https://mashable.com/article/michigan-ucla-college-basketball-2026-live-stream-for-free</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">06eUhQeIDIxNS3gcWW6WXWv</guid>
      <description>How to watch college basketball for free. Live stream Michigan vs. UCLA in 2026.</description>
    </item>
    <item>
      <title>How to watch Iowa State vs. Kansas online for free</title>
      <link>https://mashable.com/article/iowa-state-kansas-college-basketball-2026-live-stream-for-free</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">04sJuoeBHZSEsUfsMWVJCvf</guid>
      <description>How to watch college basketball for free. Live stream Iowa State vs. Kansas in 2026.</description>
    </item>
    <item>
      <title>How to watch Houston vs. Kansas State online for free</title>
      <link>https://mashable.com/article/houston-kansas-state-college-basketball-2026-live-stream-for-free</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">019FaSJD1au6ltqlZqKgxZS</guid>
      <description>How to watch college basketball for free. Live stream Houston vs. Kansas State in 2026.</description>
    </item>
    <item>
      <title>Crime 101 review: Chris Hemsworth, Mark Ruffalo, and Halle Berry star in heist thriller</title>
      <link>https://mashable.com/article/crime-101-review</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">06JRGjW7fqTG8fY34bUkoUx</guid>
      <description>Chris Hemsworth, Mark Ruffalo, Halle Berry, and Barry Keoghan co-star in "Crime 101." Review.</description>
    </item>
    <item>
      <title>Sonys new XM6 earbuds are finally here &#8212; but youll want to brace yourself</title>
      <link>https://mashable.com/article/sony-wf-1000xm6-earbuds-launch-price</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">05AGLIYBYN3gt692vZMsmtc</guid>
      <description>The Sony WF-1000XM6 are available as of Feb. 12. Here's everything you need to know about the new flagship noise-cancelling earbuds.</description>
    </item>
    <item>
      <title>Walmart has launched its Presidents Day sale &#8212; find live deals on TVs, Apple, laptops, and more</title>
      <link>https://mashable.com/article/best-presidents-day-walmart-deals-2026</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">07JCNHaVxvtQUV4GvWSM7kN</guid>
      <description>Shop the best Presidents' Day deals at Walmart live now: earbuds, TVs, tech, kitchen appliances, and more.</description>
    </item>
    <item>
      <title>The best Presidents Day Apple deals &#8212; huge discounts on AirPods, iPads, Apple Watches, and more</title>
      <link>https://mashable.com/article/best-presidents-day-apple-deals-2026</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">057Ms0UmHPzGX2oqkSGiitQ</guid>
      <description>The best Presidents' Day Apple deals in 2025: Score huge discounts on AirPods, iPads, Apple Watches, and more.</description>
    </item>
    <item>
      <title>How to watch the 2026 Six Nations online for free</title>
      <link>https://mashable.com/article/six-nations-2026-live-stream-for-free</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01a11WhFMlBMgAx5LntdRxx</guid>
      <description>How to watch the Six Nations for free. Live stream the 2026 Six Nations for free from anywhere in the world.</description>
    </item>
    <item>
      <title>The best horror movies of 2025, and where to watch them</title>
      <link>https://mashable.com/article/best-horror-movies-2025</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02ylbs5QcVkhJwMkYiFET7G</guid>
      <description>It's our favorite horror movies of 2025! Did your favorite scary movie make the cut?</description>
    </item>
    <item>
      <title>I found the best robot vacuums for every floor, budget, and level of laziness (after testing 30+ models at home)</title>
      <link>https://mashable.com/roundup/best-robot-vacuums-2026</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01srw4mqnDgi2JU1IVBmpLE</guid>
      <description>I test new robot vacuums at home monthly, comparing brands like Roborock and Eufy to find the best robot vacuum mop combo, budget steals, and more.</description>
    </item>
    <item>
      <title>The best hookup apps for 2026: I swiped until my thumb hurt</title>
      <link>https://mashable.com/roundup/best-hookup-apps</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">047vvAAbRjbRmZdR6OpL2wI</guid>
      <description>We tested the best hookup apps to help you find a fling, situationship, one-night stand, or whatever else you wanna call it.</description>
    </item>
    <item>
      <title>31 best breakup movies to mend a shattered heart</title>
      <link>https://mashable.com/article/best-breakup-movies</link>
      <pubDate>Fri, 13 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">04OCAIkolKKLRnunWclpLMd</guid>
      <description>A roundup of the 31 best breakup movies and the best divorce movies, including "Eternal Sunshine of the Spotless Mind," "Legally Blonde," "Marriage Story," and more.</description>
    </item>
    <item>
      <title>Marvel T&#333;kon: Fighting Souls lands on PS5 and PC August 6 with X-Men in tow</title>
      <link>https://www.engadget.com/gaming/marvel-tokon-fighting-souls-lands-on-ps5-and-pc-august-6-with-x-men-in-tow-095235773.html?src=rss</link>
      <pubDate>Fri, 13 Feb 2026 09:52:35 +0000</pubDate>
      <guid isPermaLink="false">1f752142-27ad-4c29-bc1e-b38138318726</guid>
      <description>
Marvel T&#333;kon: Fighting Souls was first announced last year as a tag fighting game feature superheroes including Captain America, Ms Marvel and Spider-Man, with a launch sometime in 2026. We expected more details to be revealed at Sony's State of Play yesterday and indeed they were. The game will arrive August 6 on PS5 and PC and include the Unbreakable X-Men's Storm, Magik, Wolverine, and Danger.&#160;
The trailer teases each character's fighting style, with Magik and Wolverine using a more in-your-face melee fighting style. Storm and Danger, meanwhile, offer more diverse attack abilities, with St...</description>
    </item>
    <item>
      <title>Death Stranding 2 for PC arrives on March 19</title>
      <link>https://www.engadget.com/gaming/pc/death-stranding-2-for-pc-arrives-on-march-19-095157946.html?src=rss</link>
      <pubDate>Fri, 13 Feb 2026 09:51:57 +0000</pubDate>
      <guid isPermaLink="false">04d940ba-4eee-4ec9-adbe-17e02aba769b</guid>
      <description>Death Stranding 2: On the Beach will be available on PC starting on March 19, Kojima Productions has announced at State of Play. The studio worked with Dutch video game developer Nixxes Software, which Sony acquired in 2021 to help bring PlayStation games to PCs. The sequel to the first Death Stranding is set in Australia almost a year after the events of the original game. It still features a post-apocalyptic world inhabited by strange creatures, and you&#8217;ll still control Sam Porter Bridges to connect survivors in the continent to the chiral network communications system. Kojima Production say...</description>
    </item>
    <item>
      <title>This huge 49-inch OLED INNOCN gaming monitor has never been cheaper at Amazon &#8212; save $300</title>
      <link>https://mashable.com/article/feb-13-49-inch-innocn-oled-gaming-monitor-deal</link>
      <pubDate>Fri, 13 Feb 2026 09:38:05 +0000</pubDate>
      <guid isPermaLink="false">01fmJBSwAOkU2UzxgYt6xp9</guid>
      <description>The INNOCN 49-inch OLED ultrawide gaming monitor drops to $699.99 at Amazon, saving $300 and marking its lowest price ever.</description>
    </item>
  </channel>
</rss>
