<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 02 Dec 2025 15:47:43 GMT</lastBuildDate>
    <item>
      <title>Tropical Storms Drenched Mars for Millions of Years, Strange Pale Rocks Suggest</title>
      <link>https://gizmodo.com/tropical-storms-drenched-mars-for-millions-of-years-strange-pale-rocks-suggest-2000694536</link>
      <pubDate>Tue, 02 Dec 2025 15:42:29 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000694536</guid>
      <description>NASA's Perseverance rover found rocks on Mars that on Earth usually form in tropical environments.</description>
    </item>
    <item>
      <title>Instagram CEO issues full-time return to office order</title>
      <link>https://www.techradar.com/pro/instagram-ceo-issues-full-time-return-to-office-order</link>
      <pubDate>Tue, 02 Dec 2025 15:39:00 +0000</pubDate>
      <guid isPermaLink="false">f44TvLo2zSiFZk398VxVsJ</guid>
      <description>Instagram workers given a February 2026 deadline to return to the office five days per week.</description>
    </item>
    <item>
      <title>Realme Buds Clip : des &#233;couteurs &#224; clip ouverts pour allier musique et conscience de l&#8217;environnement</title>
      <link>https://www.frandroid.com/marques/realme/2895923_realme-buds-clip-des-ecouteurs-a-clip-ouverts-pour-allier-musique-et-conscience-de-lenvironnement</link>
      <pubDate>Tue, 02 Dec 2025 15:38:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/realme/2895923_realme-buds-clip-des-ecouteurs-a-clip-ouverts-pour-allier-musique-et-conscience-de-lenvironnement</guid>
      <description>
La marque realme enrichit son catalogue audio avec les Buds Clip, ses premiers &#233;couteurs &#224; conception ouverte adoptant un design &#224; clip in&#233;dit pour le fabricant mais d&#233;j&#224; vu chez d&#8217;autres. En voici tous les d&#233;tails.
</description>
    </item>
    <item>
      <title>Some of our favorite Cyber Monday deals are still kicking</title>
      <link>https://www.theverge.com/gadgets/835113/best-cyber-monday-deals-still-available-2025</link>
      <pubDate>2025-12-02T10:37:18-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=835113</guid>
      <description>Here&#8217;s a sad, yet predictable truth: most Black Friday and Cyber Monday deals are gone. But, not all of them have disappeared. In fact, some of the most popular deals, like the discounts on the Oura Ring 4, AirPods 4, and Nintendo Switch 2 are still sitting at their Cyber Monday prices. Although, given the [&#8230;]</description>
    </item>
    <item>
      <title>Mistral closes in on Big AI rivals with new open-weight frontier and small models</title>
      <link>https://techcrunch.com/2025/12/02/mistral-closes-in-on-big-ai-rivals-with-mistral-3-open-weight-frontier-and-small-models/</link>
      <pubDate>Tue, 02 Dec 2025 15:37:07 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3071728</guid>
      <description>Mistral unveils its Mistral 3 lineup, including a frontier model and efficient small models designed for offline, customizable enterprise use&#8212;aiming to prove small, fine-tuned AI can beat closed-source giants.</description>
    </item>
    <item>
      <title>Samsung&#8217;s Galaxy Z TriFold Is Launching in the U.S. in Just a Few Months</title>
      <link>https://gizmodo.com/samsungs-galaxy-z-trifold-us-launch-display-cameras-battery-2000694470</link>
      <pubDate>Tue, 02 Dec 2025 15:35:22 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000694470</guid>
      <description>The 6.5-inch foldable phone, which is also a 10-inch tablet when unfolded, won't be cheap.</description>
    </item>
    <item>
      <title>Cyber week sales are live &#8211; over 100 extended deals from Amazon, Walmart, Best Buy, and more</title>
      <link>https://www.techradar.com/seasonal-sales/cyber-week-sales-are-live-over-100-extended-deals-from-amazon-walmart-best-buy-and-more</link>
      <pubDate>Tue, 02 Dec 2025 15:31:53 +0000</pubDate>
      <guid isPermaLink="false">SkYinSkkVuHxmGZhu2oXT4</guid>
      <description>Black Friday and Cyber Monday might be over, but Cyber Week lives on, and I have all the best deals still available from Amazon, Walmart, Best Buy, and more.</description>
    </item>
    <item>
      <title>Titan OS raises $58 million from Highland Europe for its smart TV OS</title>
      <link>https://techcrunch.com/2025/12/02/titan-os-raises-58-million-from-highland-europe-for-its-smart-tv-os/</link>
      <pubDate>Tue, 02 Dec 2025 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3071691</guid>
      <description>Titan OS aims to expand its independent TV operating system in Europe and Latin America.</description>
    </item>
    <item>
      <title>Why supply chains are the weakest link in today&#8217;s cyber defenses</title>
      <link>https://www.techradar.com/pro/why-supply-chains-are-the-weakest-link-in-todays-cyber-defenses</link>
      <pubDate>Tue, 02 Dec 2025 15:26:35 +0000</pubDate>
      <guid isPermaLink="false">h6uSJMGtKE5ZmTfsus5uja</guid>
      <description>Supply chain security remains one of the most fragile and underestimated aspects of cyber security.</description>
    </item>
    <item>
      <title>Galaxy Tab A11 : d&#233;j&#224; &#224; petit prix, cette nouvelle tablette Samsung avec &#233;cran 90 Hz tombe &#224; seulement 119 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2895531_galaxy-tab-a11-deja-a-petit-prix-cette-nouvelle-tablette-samsung-avec-ecran-90-hz-tombe-a-seulement-119-e</link>
      <pubDate>Tue, 02 Dec 2025 15:26:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2895531_galaxy-tab-a11-deja-a-petit-prix-cette-nouvelle-tablette-samsung-avec-ecran-90-hz-tombe-a-seulement-119-e</guid>
      <description>
La Samsung Galaxy Tab A11 vient de sortir, mais cette tablette au design &#233;pur&#233; et &#224; l'&#233;cran bien fluide a d&#233;j&#224; b&#233;n&#233;fici&#233; de plusieurs promotions depuis. C'est d'ailleurs en ce moment que son prix est vraiment int&#233;ressant : sur Amazon, la version 64 Go peut vous revenir &#224; 119,90 euros au lieu de 179,90 euros.
</description>
    </item>
    <item>
      <title>Apple AirTag, Galaxy SmartTag, Tile&#8230; quel porte-cl&#233; connect&#233; choisir en 2025&#8201;?</title>
      <link>https://www.frandroid.com/guide-dachat/guide-objets-connectes/931077_airtag-galaxy-smarttag-tile-quel-porte-cles-connecte-choisir</link>
      <pubDate>Tue, 02 Dec 2025 15:16:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-objets-connectes/931077_airtag-galaxy-smarttag-tile-quel-porte-cles-connecte-choisir</guid>
      <description>
Les porte-cl&#233;s connect&#233;s sont arriv&#233;s via Apple et Samsung. d'autres marques s'y sont ensuite mises. D&#233;couvrez les meilleurs trackers connect&#233;s pour ne plus rien perdre.
</description>
    </item>
    <item>
      <title>Streaming, IPTV, VPN&#160;: l&#8217;Arcom r&#233;clame le blocage automatis&#233; et imm&#233;diat</title>
      <link>https://www.01net.com/actualites/streaming-iptv-vpn-larcom-reclame-le-blocage-automatise-et-immediat.html</link>
      <pubDate>Tue, 02 Dec 2025 15:14:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313085</guid>
      <description>Face &#224; un manque &#224; gagner colossal de 1,5 milliard d'euros, le r&#233;gulateur juge ses outils actuels d&#233;pass&#233;s. Dans un rapport explosif remis &#224; l'Assembl&#233;e, l'Arcom r&#233;clame l'automatisation des blocages pour le sport et s'attaque aux VPN.</description>
    </item>
    <item>
      <title>It&amp;#8217;s their job to keep AI from destroying everything</title>
      <link>https://www.theverge.com/ai-artificial-intelligence/836335/anthropic-societal-impacts-team-ai-claude-effects</link>
      <pubDate>2025-12-02T10:11:21-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=836335</guid>
      <description>One night in May 2020, during the height of lockdown, Deep Ganguli was worried. Ganguli, then research director at the Stanford Institute for Human-Centered AI, had just been alerted to OpenAI's new paper on GPT-3, its latest large language model. This new AI model was potentially 10 times more advanced than any other of its [&#8230;]</description>
    </item>
    <item>
      <title>Free open-world RPG Where Winds Meet finally hits mobile next week after a successful PC and PS5 launch</title>
      <link>https://www.techradar.com/gaming/mobile-gaming/free-open-world-rpg-where-winds-meet-finally-hits-mobile-next-week-after-a-successful-pc-and-ps5-launch</link>
      <pubDate>Tue, 02 Dec 2025 15:10:31 +0000</pubDate>
      <guid isPermaLink="false">i5jpBiebDBzd4jqzxYY2xj</guid>
      <description>Where Winds Meet launches on mobile next week after a successful PC and console debut.</description>
    </item>
    <item>
      <title>The new paradigm: a concentration of data in AI demands greater vigilance</title>
      <link>https://www.techradar.com/pro/the-new-paradigm-a-concentration-of-data-in-ai-demands-greater-vigilance</link>
      <pubDate>Tue, 02 Dec 2025 15:09:21 +0000</pubDate>
      <guid isPermaLink="false">bpWSrNxVwJXguUn3SycGhf</guid>
      <description>In the age of AI, the most dangerous gap for enterprises lies with data in use &#8212; the moment it is loaded into memory for processing.</description>
    </item>
    <item>
      <title>Apple gadgets, ranked</title>
      <link>https://www.theverge.com/podcast/836441/best-apple-gadgets-vergecast</link>
      <pubDate>2025-12-02T10:07:24-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=836441</guid>
      <description>Apple makes a lot of gadgets. Most of them are very good! You'd frankly be hard-pressed to find a company with a better track record, especially across so many categories. But only one Apple gadget can be the best Apple gadget, and it's time for us to decide which one it is. On this episode [&#8230;]</description>
    </item>
    <item>
      <title>Total car control, simplified! Get 30% off OBDeleven digital subscriptions</title>
      <link>https://www.techradar.com/vehicle-tech/total-car-control-simplified-get-30-percent-off-obdeleven-digital-subscriptions</link>
      <pubDate>Tue, 02 Dec 2025 15:06:17 +0000</pubDate>
      <guid isPermaLink="false">X7iWS3LffrQCZ5dw4vJb7f</guid>
      <description>Get car diagnostic ready thanks to this Cyber Deal at OBDeleven</description>
    </item>
    <item>
      <title>5 tips from financial experts to finish 2025 strong</title>
      <link>https://www.fastcompany.com/91452137/5-expert-tips-financial-experts-finish-2025-strong</link>
      <pubDate>2025-12-02T15:03:04</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91452137/5-expert-tips-financial-experts-finish-2025-strong</guid>
      <description>Christine Benz of Morningstar outlines key financial strategies.
As 2025 winds down, here are some moves to help you finish the year strong financially. Morningstar&#8217;s director of personal finance and retirement planning, Christine Benz, discusses strategies.This interview has been edited for length and clarity.</description>
    </item>
    <item>
      <title>The Perfect Holiday Gifts for Your Festive Fandom</title>
      <link>https://gizmodo.com/best-nerdy-christmas-gifts-2025-decorations-clothing-2000685545</link>
      <pubDate>Tue, 02 Dec 2025 15:00:23 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000685545</guid>
      <description>'Tis the season to be jolly, and you can get into the geeky spirit with these must-have gifts and decorations for the festive nerd in your life.</description>
    </item>
    <item>
      <title>30 practical smart home gifts that make everyday life a little easier</title>
      <link>https://www.theverge.com/gadgets/800449/best-practical-smart-home-gift-ideas-2025</link>
      <pubDate>2025-12-02T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=800449</guid>
      <description>Smart home products are all about making everyday life a little easier, which is why they're some of the best and most thoughtful gifts you can give. Some people go all out building a multi-gadget IoT kingdom (like our resident smart home expert, Jen Pattison Tuohy), but a smart home is whatever your recipient wants [&#8230;]</description>
    </item>
    <item>
      <title>Metroid Prime 4 excels when it&amp;#8217;s actually being Metroid</title>
      <link>https://www.theverge.com/games/835325/metroid-prime-4-review-nintendo-switch</link>
      <pubDate>2025-12-02T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=835325</guid>
      <description>When Metroid Prime 4: Beyond is good, it's good. The latest in Nintendo's sci-fi exploration franchise, and the first since Metroid Dread in 2021, Beyond captures the moody sense of isolation and discovery that has been so core to Metroid since it debuted in 1986. Those quiet moments truly make you feel all alone on [&#8230;]</description>
    </item>
    <item>
      <title>How to watch Newcastle vs Tottenham: live streams, TV channels and preview for this Premier League encounter</title>
      <link>https://www.techradar.com/how-to-watch/football/newcastle-vs-tottenham-hostpur-premier-league-2025-26</link>
      <pubDate>Tue, 02 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">dsyzYKGEmTck6uFR6hWTVQ</guid>
      <description>We'll show you all the ways to watch Newcastle vs Tottenham in the Premier League from anywhere in the world.</description>
    </item>
    <item>
      <title>Metroid Prime 4: Beyond was worth the wait &#8211; even if it occasionally gets lost in the desert</title>
      <link>https://www.techradar.com/gaming/metroid-prime-4-beyond-review</link>
      <pubDate>Tue, 02 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">yhG7cnn9eBuqmeZfCukBg7</guid>
      <description>Metroid Prime 4: Beyond is a stunning visual treat on Switch 2, but how does it stack up against the series' best?</description>
    </item>
    <item>
      <title>Backbone is launching a limited-edition Backbone Pro controller with a new transparent design just in time for the holidays</title>
      <link>https://www.techradar.com/gaming/backbone-is-launching-a-limited-edition-backbone-pro-controller-with-a-new-transparent-design-just-in-time-for-the-holidays</link>
      <pubDate>Tue, 02 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">3aesre7hnhseeCScXzH6u8</guid>
      <description>Backbone has announced that it will be releasing a limited-edition Backbone Pro controller in collaboration with Kith.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Wednesday, December 3 (game #906)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-3-december-2025</link>
      <pubDate>Tue, 02 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">FJMv6D9B7cSxLS67VNdhFT</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Wednesday, December 3 (game #640)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-3-december-2025</link>
      <pubDate>Tue, 02 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">XZAN9mBSb6mZj7oX5aBvgL</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Wednesday, December 3 (game #1409)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-3-december-2025</link>
      <pubDate>Tue, 02 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">j6PPdEzBdTwia7zGqbxFSE</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>Mistral launches Mistral 3, a family of open models designed to run on laptops, drones, and edge devices</title>
      <link>https://venturebeat.com/ai/mistral-launches-mistral-3-a-family-of-open-models-designed-to-run-on</link>
      <pubDate>Tue, 02 Dec 2025 15:00:00 GMT</pubDate>
      <guid isPermaLink="false">67XTC5IvbNuCed38iIXoJB</guid>
      <description>Mistral AI, Europe's most prominent artificial intelligence startup, is releasing its most ambitious product suite to date: a family of 10 open-source models designed to run everywhere from smartphones and autonomous drones to enterprise cloud systems, marking a major escalation in the company's challenge to both U.S. tech giants and surging Chinese competitors.The Mistral 3 family, launching today, includes a new flagship model called Mistral Large 3 and a suite of smaller "Ministral 3" models optimized for edge computing applications. All models will be released under the permissive Apache 2...</description>
    </item>
    <item>
      <title>Apple pourrait faire face &#224; d&#8217;autres proc&#233;dures collectives en Europe, apr&#232;s cet arr&#234;t de la cour europ&#233;enne</title>
      <link>https://www.01net.com/actualites/apple-pourrait-faire-face-a-dautres-procedures-collectives-en-europe-apres-cet-arret-de-la-cour-europeenne.html</link>
      <pubDate>Tue, 02 Dec 2025 14:59:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313013</guid>
      <description>La cour de justice de l'UE a estim&#233;, dans un arr&#234;t du mardi 2 d&#233;cembre, que les utilisateurs de l'App Store n&#233;erlandais pouvaient bien intenter une action collective aux Pays-Bas pour r&#233;clamer une indemnisation due aux commissions d'Apple. Cet arr&#234;t pourrait ouvrir la voie &#224; d'autres proc&#233;dures collectives initi&#233;es en Europe.</description>
    </item>
    <item>
      <title>Some of the stuff we bought during Black Friday and Cyber Monday</title>
      <link>https://www.theverge.com/gadgets/835160/black-friday-cyber-monday-deals-staff-shopping</link>
      <pubDate>2025-12-02T09:48:23-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=835160</guid>
      <description>It&#8217;s one thing to do a bit of online shopping during the Black Friday / Cyber Monday sales, but it&#8217;s another to put your money where your mouth is. (Where&#160;did&#160;that phrase come from, anyway?) If you&#8217;re curious what our writers, editors, and reviewers bought for themselves, here are some of the items, many of which [&#8230;]</description>
    </item>
    <item>
      <title>&#171;&#160;Code rouge&#160;&#187; chez ChatGPT&#160;: OpenAI changerait de strat&#233;gie &#224; cause de Gemini</title>
      <link>https://www.01net.com/actualites/code-rouge-chez-chatgpt-openai-changerait-strategie-cause-gemini.html</link>
      <pubDate>Tue, 02 Dec 2025 14:47:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313112</guid>
      <description>Alerte rouge chez OpenAI ! Face au succ&#232;s de Gemini 3, la start-up aurait d&#233;cid&#233; de revoir sa strat&#233;gie. Plusieurs projets de taille auraient &#233;t&#233; suspendus de toute urgence. L&#8217;entreprise se concentrerait d&#233;sormais sur l'am&#233;lioration de ChatGPT.</description>
    </item>
    <item>
      <title>Apple will reportedly refuse India&amp;#8217;s order to preinstall a government app</title>
      <link>https://www.theverge.com/news/836384/apple-india-sanchar-saathi-app-response</link>
      <pubDate>2025-12-02T09:46:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=836384</guid>
      <description>Apple is not planning to comply with an order from the Indian government directing phone manufacturers to preload a state-backed cybersecurity app, according to Reuters.&#160; Industry sources tell Reuters that Apple plans to tell India&#8217;s government that they don&#8217;t comply with requests like this due to privacy and security concerns. However, Apple won&#8217;t go to [&#8230;]...</description>
    </item>
    <item>
      <title>Wooting&#8217;s 60HE v2 is a solid upgrade to the best gaming keyboard</title>
      <link>https://www.theverge.com/tech/836168/wooting-60he-v2-keyboard-gaming-hands-on</link>
      <pubDate>2025-12-02T09:45:45-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=836168</guid>
      <description>Over the past couple of years, I've tried to switch to many different gaming keyboards and always ended up back with a Wooting 60HE. Wooting changed PC gaming with the 60HE, popularizing the use of Hall effect switches and a Rapid Trigger system that speeds up how quickly you can activate keys. Now it's back [&#8230;]</description>
    </item>
    <item>
      <title>Xbox Game Pass en d&#233;cembre 2025 : le plus grand aventurier et une flop&#233;e de p&#233;pites ind&#233;s</title>
      <link>https://www.frandroid.com/actualites-generales/2895779_xbox-game-pass-en-decembre-2025-le-plus-grand-aventurier-et-une-flopee-de-pepites-indes</link>
      <pubDate>Tue, 02 Dec 2025 14:44:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2895779_xbox-game-pass-en-decembre-2025-le-plus-grand-aventurier-et-une-flopee-de-pepites-indes</guid>
      <description>
Pour finir l'ann&#233;e 2025 en beaut&#233;, Microsoft d&#233;ploie l'artillerie lourde dans le Xbox Game Pass. Entre l'arriv&#233;e tr&#232;s attendue d'Indiana Jones, le d&#233;barquement de Mortal Kombat 1 et une foule de p&#233;pites ind&#233;s, le mois de d&#233;cembre s'annonce tr&#232;s prometteur.
</description>
    </item>
    <item>
      <title>Sam Altman calls a &#8216;code red&#8217; for ChatGPT &#8211; here&#8217;s what it will mean for you</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/sam-altman-calls-a-code-red-for-chatgpt-heres-what-it-will-mean-for-you</link>
      <pubDate>Tue, 02 Dec 2025 14:43:36 +0000</pubDate>
      <guid isPermaLink="false">tRWFdTxnM9KGiehtJGKGVd</guid>
      <description>Sam Altman is calling a "code red" on improving the ChatGPT experience for users, but will that be a good thing for you?</description>
    </item>
    <item>
      <title>Sony A7 V vs Sony A7 IV: 5 key upgrades in Sony's latest full-frame all-rounder</title>
      <link>https://www.techradar.com/cameras/mirrorless-cameras/sony-a7-v-vs-sony-a7-iv-5-key-upgrades-in-sonys-latest-full-frame-all-rounder</link>
      <pubDate>Tue, 02 Dec 2025 14:35:01 +0000</pubDate>
      <guid isPermaLink="false">o7EUDQ53Dhys3SFgJgdSbH</guid>
      <description>They look largely the same, but with four years between the Sony A7V and Sony A7 IV, there are several upgrades in the latest model &#8211; I've highlighted the ones you need to know about.</description>
    </item>
    <item>
      <title>MVNO : op&#233;rateurs, d&#233;bits, avantages, prix&#8230; Tout savoir sur les op&#233;rateurs mobiles virtuels en 2025</title>
      <link>https://www.frandroid.com/services/operateurs-mobiles/2316214_mvno-operateurs-debits-avantages-prix-tout-savoir-sur-les-operateurs-mobiles-virtuels</link>
      <pubDate>Tue, 02 Dec 2025 14:35:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/operateurs-mobiles/2316214_mvno-operateurs-debits-avantages-prix-tout-savoir-sur-les-operateurs-mobiles-virtuels</guid>
      <description>
Dans la guerre des prix des forfaits mobiles, le terme de MVNO ressort de temps en temps pour d&#233;finir une certaine cat&#233;gorie d'op&#233;rateur. Il se peut m&#234;me que vous soyez abonn&#233; &#224; un MVNO sans le savoir. De quoi s'agit-il ? Comment &#231;a marche ? Combien &#231;a co&#251;te ? Toutes les r&#233;ponses sont ici.
</description>
    </item>
    <item>
      <title>Amazon is testing 30-minute deliveries</title>
      <link>https://www.theverge.com/news/836337/amazon-now-30-minute-delivery-tests</link>
      <pubDate>2025-12-02T09:32:48-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=836337</guid>
      <description>Amazon is starting to test ultra-fast deliveries that aim to drop household goods at your doorstep in 30 minutes or less. The Amazon Now service is launching now in parts of Seattle and Philadelphia, according to Amazon&#8217;s announcement, allowing eligible customers to shop for items like fresh milk, eggs, produce, cosmetics, electronics, household essentials, over-the-counter [&#8230;]...</description>
    </item>
    <item>
      <title>Quels sont les meilleurs TV Oled en 2025&#8201;?</title>
      <link>https://www.frandroid.com/guide-dachat/679063_quelles-sont-les-meilleures-tv-oled-en-2020-notre-selection</link>
      <pubDate>Tue, 02 Dec 2025 14:30:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/679063_quelles-sont-les-meilleures-tv-oled-en-2020-notre-selection</guid>
      <description>
La technologie Oled est reine pour parmi les t&#233;l&#233;viseurs haut de gamme, gr&#226;ce &#224; ses excellents contrastes et la profondeur de ses noirs. Nous avons s&#233;lectionn&#233; et rassembl&#233; ici les meilleurs TV Oled que nous avons test&#233;s.
</description>
    </item>
    <item>
      <title>Costco is suing the U.S. government over Trump&#8217;s tariffs. Here&#8217;s why</title>
      <link>https://www.fastcompany.com/91452200/costco-suing-u-s-government-over-trumps-tariffs-heres-why</link>
      <pubDate>2025-12-02T14:27:18</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91452200/costco-suing-u-s-government-over-trumps-tariffs-heres-why</guid>
      <description>Court records show Costco joined dozens of companies, including Ray-Ban, Kawasaki, and Revlon suing to safeguard potential refunds from Trump&#8217;s tariffs. 
Costco has sued the U.S. government to ensure it will receive refunds if the Supreme Court rejects President Donald Trump&#8217;s bid for sweeping authority to impose tariffs.</description>
    </item>
    <item>
      <title>Cyber Monday is over, but the Nintendo Switch 2 is still a record low price</title>
      <link>https://www.techradar.com/gaming/cyber-monday-is-over-but-the-nintendo-switch-2-is-still-a-record-low-price</link>
      <pubDate>Tue, 02 Dec 2025 14:26:44 +0000</pubDate>
      <guid isPermaLink="false">6Rwbic8bguwNjVaAU4F3Rg</guid>
      <description>Pick up a Nintendo Switch 2 and a get free copy of Mario Kart World thanks to this huge discount at Walmart.</description>
    </item>
    <item>
      <title>4.3 million have installed this malicious browser extension on Chrome and Edge - here's how to check</title>
      <link>https://www.techradar.com/pro/security/4-3-million-have-installed-this-malicious-browser-extension-on-chrome-and-edge-heres-how-to-check</link>
      <pubDate>Tue, 02 Dec 2025 14:23:00 +0000</pubDate>
      <guid isPermaLink="false">H8ozX2DhZFVTZTm3P3EFGe</guid>
      <description>After five years, browser extensions turned malicious, putting countless people at risk.</description>
    </item>
    <item>
      <title>Voici comment One UI 8.5 veut en finir avec les applications pleines de pubs</title>
      <link>https://www.frandroid.com/marques/samsung/2895625_voici-comment-one-ui-8-5-veut-en-finir-avec-les-applications-pleines-de-pubs</link>
      <pubDate>Tue, 02 Dec 2025 14:15:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2895625_voici-comment-one-ui-8-5-veut-en-finir-avec-les-applications-pleines-de-pubs</guid>
      <description>
La prochaine mise &#224; jour de One UI s'attaque aux applis un peu trop charg&#233;es en publicit&#233;s avec une option cach&#233;e, mais bien pratique.
</description>
    </item>
    <item>
      <title>Bose QC Ultra II : le meilleur casque audio du moment perd 50 &#8364; juste apr&#232;s le Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2832759_bose-qc-ultra-ii-le-meilleur-casque-audio-du-moment-perd-50-juste-apres-le-black-friday</link>
      <pubDate>Tue, 02 Dec 2025 14:13:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2832759_bose-qc-ultra-ii-le-meilleur-casque-audio-du-moment-perd-50-juste-apres-le-black-friday</guid>
      <description>
Apr&#232;s le Black Friday, on trouve encore de belles offres : comme cette promotion sur le r&#233;cent Bose QuietComfort Ultra II qui passe de 449 euros &#224; 399 euros chez plusieurs e-commer&#231;ants. 
</description>
    </item>
    <item>
      <title>Sony Alpha 7 V : ce nouvel hybride plein format veut devenir le roi de la vitesse et de l&#8217;autofocus</title>
      <link>https://www.frandroid.com/marques/sony/2893771_sony-alpha-7-v-ce-nouvel-hybride-plein-format-veut-devenir-le-roi-de-la-vitesse-et-de-lautofocus</link>
      <pubDate>Tue, 02 Dec 2025 14:07:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2893771_sony-alpha-7-v-ce-nouvel-hybride-plein-format-veut-devenir-le-roi-de-la-vitesse-et-de-lautofocus</guid>
      <description>
Sony a pr&#233;sent&#233;, ce mardi, son nouvel appareil photo hybride plein format, le Sony&#160;A7 V. S'il conserve la d&#233;finition de son pr&#233;d&#233;cesseur, il se veut plus rapide aussi bien en photo qu'en vid&#233;o. 
</description>
    </item>
    <item>
      <title>PS5 : sans le dire &#224; personne, Sony a modifi&#233; un d&#233;tail pourtant crucial de ses consoles</title>
      <link>https://www.frandroid.com/marques/sony/2895023_ps5-sans-le-dire-a-personne-sony-a-modifie-un-detail-pourtant-crucial-de-ses-consoles</link>
      <pubDate>Tue, 02 Dec 2025 14:06:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2895023_ps5-sans-le-dire-a-personne-sony-a-modifie-un-detail-pourtant-crucial-de-ses-consoles</guid>
      <description>
Les PlayStation 5 les plus r&#233;cemment sorties d'usine profitent d'un changement tr&#232;s utile mais bien cach&#233; dans leurs entrailles : le passage &#224; une nouvelle technique d'application de leur m&#233;tal liquide. On vous explique en quoi c'est une tr&#232;s bonne nouvelle.
</description>
    </item>
    <item>
      <title>Google corrige 107 failles Android, dont 2 vuln&#233;rabilit&#233;s exploit&#233;es dans des attaques</title>
      <link>https://www.01net.com/actualites/google-corrige-107-failles-android-2-vulnerabilites-exploitees-attaques.html</link>
      <pubDate>Tue, 02 Dec 2025 14:01:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313073</guid>
      <description>Google corrige plus de 100 failles identifi&#233;es dans le code d'Android. Parmi les br&#232;ches, on trouve deux vuln&#233;rabilit&#233;s activement exploit&#233;es par des cybercriminels dans le cadre de cyberattaques.</description>
    </item>
    <item>
      <title>I tested the new Sony A7 V, and now it's my favorite Sony camera ever</title>
      <link>https://www.techradar.com/cameras/sony-a7-v-review</link>
      <pubDate>Tue, 02 Dec 2025 14:01:00 +0000</pubDate>
      <guid isPermaLink="false">MN8DTu7JxDHWeENXpnMkhW</guid>
      <description>Bang on cue, the Sony A7 V has arrived and it blurs the lines between enthusiast and pro cameras forever</description>
    </item>
    <item>
      <title>Scrubs brand Figs launches nonprofit to help &#8216;awesome human&#8217; healthcare workers thrive</title>
      <link>https://www.fastcompany.com/91450186/scrubs-brand-figs-launches-nonprofit-to-help-healthcare-workers</link>
      <pubDate>2025-12-02T14:01:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91450186/scrubs-brand-figs-launches-nonprofit-to-help-healthcare-workers</guid>
      <description>A new foundation set up by the company will support healthcare workers and students in a number of ways, including through direct financial assistance. 
To Trina Spear, cofounder and CEO of medical apparel brand Figs, change for the healthcare industry has to start with a focus on healthcare workers.&#160;</description>
    </item>
    <item>
      <title>The First Reactions to &#8216;Avatar: Fire and Ash&#8217; Are Flying In</title>
      <link>https://gizmodo.com/avatar-3-reviews-reactions-james-cameron-2000694243</link>
      <pubDate>Tue, 02 Dec 2025 14:00:20 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000694243</guid>
      <description>The new James Cameron film starring Sam Worthington and Zoe Salda&#241;a opens December 19.</description>
    </item>
    <item>
      <title>Apple Music Replay 25 is more personal than ever</title>
      <link>https://mashable.com/article/apple-music-replay-25</link>
      <pubDate>Tue, 02 Dec 2025 14:00:11 +0000</pubDate>
      <guid isPermaLink="false">00QyUSxpN1hKYKLr1WU7MKq</guid>
      <description>Apple has launched Apple Music Replay '25, a personalized look into your music listening habits this year.</description>
    </item>
    <item>
      <title>Sony&#8217;s new A7 V uses a partially stacked sensor so you can shoot silently</title>
      <link>https://www.theverge.com/news/835420/sony-a7v-mirrorless-camera-partially-stacked-sensor-price-specs</link>
      <pubDate>2025-12-02T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=835420</guid>
      <description>Sony is announcing the A7 V, its first camera with a partially stacked sensor and various features borrowed from pricier Alpha models. It will be available body-only in late December for $2,899, and a kit including a new 28-70mm f/3.5-5.6 OSS II lens is coming in February.&#160; The A7 V is one of Sony&#8217;s most [&#8230;]</description>
    </item>
    <item>
      <title>Apple Music&#8217;s Replay 2025 is here</title>
      <link>https://techcrunch.com/2025/12/02/apple-musics-replay-2025-is-here/</link>
      <pubDate>Tue, 02 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3071320</guid>
      <description>This year, Apple Music Replay includes even more listening habits, including the "Discovery" section, which highlights new artists users listened to, and "Loyalty," which spotlights artists that users have kept coming back to each year.</description>
    </item>
    <item>
      <title>Ex-engineer blasts Microsoft &#8211; argues it must fix Windows 11 'until it doesn't suck', never mind about AI</title>
      <link>https://www.techradar.com/computing/windows/ex-engineer-blasts-microsoft-argues-it-must-fix-windows-11-until-it-doesnt-suck-never-mind-about-ai</link>
      <pubDate>Tue, 02 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">oEojqfmsVKZDDkojhGGcMN</guid>
      <description>Fed up with Microsoft's big push for AI? Wish it would fix the basic problems with Windows 11 instead? You are very much not alone.</description>
    </item>
    <item>
      <title>YouTube Recap is a fascinating review of your year in videos &#8211; here&#8217;s how to find it</title>
      <link>https://www.techradar.com/streaming/youtube-recap-is-a-fascinating-review-of-your-year-in-videos-heres-how-to-find-it</link>
      <pubDate>Tue, 02 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">wH4f9PULMQbPJZjyjiTCeZ</guid>
      <description>YouTube is joining in with the end-of-year summaries, and you should be able to find yours in your account now.</description>
    </item>
    <item>
      <title>La R5 &#233;lectrique franchit un cap symbolique et s&#8217;offre une fonction attendue de longue date</title>
      <link>https://www.frandroid.com/marques/renault/2895517_la-r5-electrique-franchit-un-cap-symbolique-et-soffre-une-fonction-attendue-de-longue-date</link>
      <pubDate>Tue, 02 Dec 2025 13:54:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2895517_la-r5-electrique-franchit-un-cap-symbolique-et-soffre-une-fonction-attendue-de-longue-date</guid>
      <description>
&#199;a y est, la Renault 5 E-Tech a franchi le cap du 100&#160;000&#7497;&#160;exemplaire produit. &#192; l'occasion de cette c&#233;l&#233;bration, la marque annonce enfin l'arriv&#233;e du "one-pedal" sur sa petite voiture &#233;lectrique en janvier 2026.
</description>
    </item>
    <item>
      <title>The Lenovo Idea Tab Pro is the best iPad alternative, and it's 33% off in this post-Black Friday deal</title>
      <link>https://www.techradar.com/tablets/the-lenovo-idea-tab-pro-is-the-best-ipad-alternative-and-its-33-percent-off-in-this-post-black-friday-deal</link>
      <pubDate>Tue, 02 Dec 2025 13:48:28 +0000</pubDate>
      <guid isPermaLink="false">F7yNQBjCiV9i4fvULzzYoN</guid>
      <description>The Lenovo Idea Tab Pro is one of the best cheap tablets around, and it's currently 33% off in the post-Cyber Monday deals.</description>
    </item>
    <item>
      <title>&#171; Nous avons banni des tricheurs qui streamaient en direct &#187; : l&#8217;anti-cheat de Battlefield 6 ne pardonne pas, voici les chiffres &#233;difiants</title>
      <link>https://www.frandroid.com/produits-android/console/2895411_nous-avons-banni-des-tricheurs-qui-streamaient-en-direct-lanti-cheat-de-battlefield-6-ne-pardonne-pas-voici-les-chiffres-edifiants</link>
      <pubDate>Tue, 02 Dec 2025 13:47:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2895411_nous-avons-banni-des-tricheurs-qui-streamaient-en-direct-lanti-cheat-de-battlefield-6-ne-pardonne-pas-voici-les-chiffres-edifiants</guid>
      <description>
EA fait le point sur son syst&#232;me d'anti-triche pr&#232;s de deux mois apr&#232;s le lancement de Battlefield 6. Et les chiffres sont tr&#232;s encourageants.
</description>
    </item>
  </channel>
</rss>
