<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 06 Nov 2025 14:44:14 GMT</lastBuildDate>
    <item>
      <title>Cameroon social media ban sees Proton VPN signups skyrocket by 3,000%</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/cameroon-social-media-ban-sees-proton-vpn-signups-skyrocket-by-3-000-percent</link>
      <pubDate>Thu, 06 Nov 2025 14:40:04 +0000</pubDate>
      <guid isPermaLink="false">NysLLXJZ7urqX7DNa2SiPc</guid>
      <description>Social media platforms have been blocked in Cameroon amid escalating post-election protests. Many citizens are turning to VPNs, with Proton VPN reporting a 3,000% surge in signups.</description>
    </item>
    <item>
      <title>Pok&#233;mon Legends: Z-A&amp;#8217;s DLC drops this December</title>
      <link>https://www.theverge.com/games/815416/pokemon-legends-za-mega-dimension-release-date</link>
      <pubDate>2025-11-06T09:35:32-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815416</guid>
      <description>Pok&#233;mon Legends: Z-A&#8216;s upcoming expansion finally has a release date and a new trailer revealing what we&#8217;ll find as we step into the Mega Dimension. Today, Nintendo and The Pok&#233;mon Company announced that the Pok&#233;mon Legends: Z-A&#8216;s Mega Dimension DLC will debut on December 10th for the Switch and Switch 2. A trailer for the [&#8230;]</description>
    </item>
    <item>
      <title>Batterie lithium-ion qui gonfle, chauffe et prend feu : toutes vos questions, toutes les r&#233;ponses</title>
      <link>https://www.frandroid.com/survoltes/2858229_batterie-lithium-ion-qui-gonfle-chauffe-et-prend-feu-toutes-vos-questions-toutes-les-reponses</link>
      <pubDate>Thu, 06 Nov 2025 14:35:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2858229_batterie-lithium-ion-qui-gonfle-chauffe-et-prend-feu-toutes-vos-questions-toutes-les-reponses</guid>
      <description>
19 appareils &#224; batterie par foyer fran&#231;ais, 481 000 batteries externes Anker rappel&#233;es, et un incendie en plein vol Air China. Les batteries lithium-ion font r&#233;guli&#232;rement les gros titres, mais faut-il vraiment paniquer ? Non. Par contre, il faut arr&#234;ter de charger son smartphone sous l'oreiller.
</description>
    </item>
    <item>
      <title>YouTube TV and Disney stand-off branded an &#8216;antitrust issue&#8217; by broadcaster &#8211; here's what could happen next</title>
      <link>https://www.techradar.com/streaming/youtube-tv-and-disney-stand-off-branded-an-antitrust-issue-by-broadcaster-heres-what-could-happen-next</link>
      <pubDate>Thu, 06 Nov 2025 14:34:58 +0000</pubDate>
      <guid isPermaLink="false">xm5yvtdZeHLumXqPun7mne</guid>
      <description>The CEO of one of the US' biggest TV station groups, Sinclair, has shared that the Disney-YouTube TV drama is affecting local ABC stations.</description>
    </item>
    <item>
      <title>The Best Mushroom Gifts for Your Fungi Friend (2025)</title>
      <link>https://www.wired.com/gallery/spore-yourself-rotten-with-wireds-mushroom-gift-guide/</link>
      <pubDate>Thu, 06 Nov 2025 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">68f7cdf86fc0dea09153cfdb</guid>
      <description>We're talking mushroom gummies, shiitake-infused cooking oil, and even an automated monotub for serious spore enthusiasts.</description>
    </item>
    <item>
      <title>Amazon lance une offensive contre les IPTV et le streaming ill&#233;gal sur ses produits Fire TV</title>
      <link>https://www.frandroid.com/marques/amazon/2858289_amazon-lance-une-offensive-contre-les-iptv-et-le-streaming-illegal-sur-ses-produits-fire-tv</link>
      <pubDate>Thu, 06 Nov 2025 14:27:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazon/2858289_amazon-lance-une-offensive-contre-les-iptv-et-le-streaming-illegal-sur-ses-produits-fire-tv</guid>
      <description>
Le g&#233;ant am&#233;ricain semble avoir les IPTV et les applications de streaming ill&#233;gal dans le viseur, si l'on en croit les d&#233;clarations relay&#233;es par The Sun.
</description>
    </item>
    <item>
      <title>Fnac et Darty se montrent bien g&#233;n&#233;reux lors du pr&#233;-Black Friday : les 15 deals qui valent le coup</title>
      <link>https://www.frandroid.com/bons-plans/2849237_fnac-et-darty-se-montrent-bien-genereux-lors-du-pre-black-friday-les-15-deals-qui-valent-le-coup</link>
      <pubDate>Thu, 06 Nov 2025 14:23:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849237_fnac-et-darty-se-montrent-bien-genereux-lors-du-pre-black-friday-les-15-deals-qui-valent-le-coup</guid>
      <description>
Pour ne pas laisser le champ libre &#224; Boulanger, la Fnac et Darty prennent aussi de l'avance sur le Black Friday et d&#233;ploient &#224; leur tour de solides offres sur de nombreux produits Tech. Nous avons fait le tri parmi toutes les offres, et voici uniquement celles qui valent le coup. 
</description>
    </item>
    <item>
      <title>Peloton issues recall for 833,000 bikes over faulty seat posts</title>
      <link>https://www.theverge.com/news/815376/peloton-bike-plus-recall-seat-post</link>
      <pubDate>2025-11-06T09:18:47-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815376</guid>
      <description>Peloton is recalling roughly 833,000 of its original Bike Plus machines, according to the U.S. Consumer Product Safety Commission. The reason being that the seat post can break and detach during use, with Peloton receiving three reports of breakages and two reports of injuries resulting from falls. The affected Bike Plus units were sold between [&#8230;]</description>
    </item>
    <item>
      <title>Acheter un jeu PS5 et y jouer sur PC : cet indice sugg&#232;re que Sony travaillerait au &#171;&#160;Cross-Buy&#160;&#187;</title>
      <link>https://www.frandroid.com/marques/sony/2857791_acheter-un-jeu-ps5-et-y-jouer-sur-pc-cet-indice-suggere-que-sony-travaillerait-au-cross-buy</link>
      <pubDate>Thu, 06 Nov 2025 14:12:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2857791_acheter-un-jeu-ps5-et-y-jouer-sur-pc-cet-indice-suggere-que-sony-travaillerait-au-cross-buy</guid>
      <description>
Un indice d&#233;couvert par un d&#233;veloppeur italien dans l'environnement graphique de Sony, sugg&#232;re que l'entreprise travaillerait sur une formule &#171; Cross-Buy &#187; permettant aux joueurs d'acheter des jeux accessibles autant sur PlayStation 5 que sur PC.
</description>
    </item>
    <item>
      <title>Orange pr&#233;parerait son r&#233;p&#233;teur Wi-Fi 7 : enfin la couverture id&#233;ale pour la Livebox 7 ?</title>
      <link>https://www.frandroid.com/marques/orange/2858225_orange-preparerait-son-repeteur-wi-fi-7-enfin-la-couverture-ideale-pour-la-livebox-7</link>
      <pubDate>Thu, 06 Nov 2025 14:12:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/orange/2858225_orange-preparerait-son-repeteur-wi-fi-7-enfin-la-couverture-ideale-pour-la-livebox-7</guid>
      <description>
L&#8217;op&#233;rateur historique fran&#231;ais, Orange, pourrait annoncer dans les prochaines semaines un nouveau r&#233;p&#233;teur compatible Wi-Fi 7, si l&#8217;on en croit une fuite r&#233;cente.
</description>
    </item>
    <item>
      <title>AirDrop deviendrait encore plus pratique sur iOS 26.2 : voici comment</title>
      <link>https://www.frandroid.com/marques/apple/2857617_airdrop-deviendrait-encore-plus-pratique-sur-ios-26-2-voici-comment</link>
      <pubDate>Thu, 06 Nov 2025 14:04:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2857617_airdrop-deviendrait-encore-plus-pratique-sur-ios-26-2-voici-comment</guid>
      <description>
Apple travaillerait sur une option permettant de jumeler deux appareils sur une p&#233;riode de 30 jours pour faciliter l'envoi de fichiers via AirDrop. 
</description>
    </item>
    <item>
      <title>Google warns criminals are building and selling illicit AI tools - and the market is growing</title>
      <link>https://www.techradar.com/pro/security/google-warns-criminals-are-building-and-selling-illicit-ai-tools-and-the-market-is-growing</link>
      <pubDate>Thu, 06 Nov 2025 14:03:00 +0000</pubDate>
      <guid isPermaLink="false">Hez92vFs8n89TS3EAQ3p5T</guid>
      <description>AI tools are being specially built for cyber crime, new Google research warns.</description>
    </item>
    <item>
      <title>The Lego &#8216;Star Trek&#8217; Set Is Here, and It&#8217;s Exactly What You Want</title>
      <link>https://gizmodo.com/lego-star-trek-enterprise-d-price-release-date-minifigures-2000682256</link>
      <pubDate>Thu, 06 Nov 2025 14:00:53 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682256</guid>
      <description>Boldly go with the USS 'Enterprise'-D in Lego form when it hits shelves in late November.</description>
    </item>
    <item>
      <title>11 Best Cheap Laptops (2025), Tested and Reviewed</title>
      <link>https://www.wired.com/gallery/best-cheap-laptops/</link>
      <pubDate>Thu, 06 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">5de936dc64c9e80008125a88</guid>
      <description>From surprisingly good $300 Chromebooks to excellent $650 Windows laptops, these are the best budget laptops we&#8217;ve tested.</description>
    </item>
    <item>
      <title>I&#8217;m The Verge&#8217;s new AV expert, ask me anything!</title>
      <link>https://www.theverge.com/tech/814389/im-the-verges-new-av-expert-ama</link>
      <pubDate>2025-11-06T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814389</guid>
      <description>Hi everyone! I'm John Higgins, the new senior reviewer of TVs and audio here at The Verge. I joined the team just over a month ago, and am raring to go. I've been in tech publishing in some capacity for a little over 20 years, starting at Home Theater Magazine back in 2003 as I [&#8230;]</description>
    </item>
    <item>
      <title>Lego&#8217;s first Star Trek set is a $400 Enterprise with Data, Picard, and Worf minifigures</title>
      <link>https://www.theverge.com/news/815337/lego-star-trek-uss-enterprise-ncc-1701-d-data-picard-riker-worf-minifigures</link>
      <pubDate>2025-11-06T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815337</guid>
      <description>Lego&#8217;s Star Wars partnership helped the company endure financial uncertainty in the late &#8216;90s, but for the first time it&#8217;s announcing a collaboration with that other iconic space franchise. Lego&#8217;s first Star Trek set is a 3,600 piece replica of the USS Enterprise NCC-1701-D from Star Trek: The Next Generation measuring nearly two-feet long. It [&#8230;]</description>
    </item>
    <item>
      <title>Why Benchmark made a rare crypto bet on trading app&#160;Fomo, with $17M Series A</title>
      <link>https://techcrunch.com/2025/11/06/why-benchmark-made-a-rare-crypto-bet-on-trading-app-fomo-with-17m-series-a/</link>
      <pubDate>Thu, 06 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3065312</guid>
      <description>The founders of&#160;Fomo, a&#160;consumer&#160;crypto trading app that launched in May, took an unusual route to raising capital.</description>
    </item>
    <item>
      <title>Spotify now lets you see weekly listening stats</title>
      <link>https://techcrunch.com/2025/11/06/spotify-now-lets-you-see-weekly-listening-stats/</link>
      <pubDate>Thu, 06 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3065579</guid>
      <description>Spotify is adding new feature called "Listening stats" that will show users weekly numbers about their listening habits.</description>
    </item>
    <item>
      <title>How to watch The Celebrity Traitors Finale on BBC iPlayer &#8212; it's *FREE*</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/the-celebrity-traitors-finale-free</link>
      <pubDate>Thu, 06 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">Zfi6sExaBnn2TzCa3oq9cb</guid>
      <description>Here's our guide on how to watch The Celebrity Traitors Finale for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Engage! The Lego Star Trek Enterprise NCC-1701-D model is here, and it is spectacular</title>
      <link>https://www.techradar.com/tech/engage-the-lego-star-trek-enterprise-ncc-1701-d-model-is-here-and-it-is-spectacular</link>
      <pubDate>Thu, 06 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">hVvaRpsaeATRmwFhn26nYG</guid>
      <description>Thousands of pieces, classic characters, and a limited surprise gift and crew member</description>
    </item>
    <item>
      <title>Free fait &#233;voluer l&#8217;offre Freebox R&#233;volution Light : un peu de bon, beaucoup de moins bon</title>
      <link>https://www.frandroid.com/marques/free/2858233_free-fait-evoluer-loffre-freebox-revolution-light-un-peu-de-bon-beaucoup-de-moins-bon</link>
      <pubDate>Thu, 06 Nov 2025 13:53:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2858233_free-fait-evoluer-loffre-freebox-revolution-light-un-peu-de-bon-beaucoup-de-moins-bon</guid>
      <description>
Free a discr&#232;tement mis &#224; jour le catalogue de son offre Freebox. Le forfait Freebox R&#233;volution Light devient une offre permanente, mais perd aussi un peu de son attrait.
</description>
    </item>
    <item>
      <title>Netflix va-t-il racheter Warner Bros Discovery ? La fin du suspens approche</title>
      <link>https://www.frandroid.com/services/svod/2857281_netflix-va-t-il-racheter-warner-bros-discovery-la-fin-du-suspens-approche</link>
      <pubDate>Thu, 06 Nov 2025 13:53:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2857281_netflix-va-t-il-racheter-warner-bros-discovery-la-fin-du-suspens-approche</guid>
      <description>
Quel avenir pour Warner Bros. Discovery ? Si la question reste encore en suspens, on sait d&#233;sormais que l'hiver sera en tout cas crucial pour le conglom&#233;rat am&#233;ricain, approch&#233; par plusieurs gros poissons en vue d'un potentiel rachat.
</description>
    </item>
    <item>
      <title>Batteries solaires : pourquoi la domination chinoise en Europe pourrait marquer une pause</title>
      <link>https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2857709_batteries-solaires-pourquoi-la-domination-chinoise-en-europe-pourrait-marquer-une-pause</link>
      <pubDate>Thu, 06 Nov 2025 13:45:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2857709_batteries-solaires-pourquoi-la-domination-chinoise-en-europe-pourrait-marquer-une-pause</guid>
      <description>
La majorit&#233; des batteries solaires vendues en Europe est de marque chinoise. Il faut dire que P&#233;kin est effectivement un leader incontest&#233; du secteur. Mais, du moins &#224; court terme, l&#8217;empire chinois pourrait conna&#238;tre un l&#233;ger ralentissement.
</description>
    </item>
    <item>
      <title>Boulanger lance une vague de promotions pour le pr&#233;-Black Friday : les 20 offres &#224; ne pas louper</title>
      <link>https://www.frandroid.com/bons-plans/2848955_boulanger-lance-une-vague-de-promotions-pour-le-pre-black-friday-les-20-offres-a-ne-pas-louper</link>
      <pubDate>Thu, 06 Nov 2025 13:43:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848955_boulanger-lance-une-vague-de-promotions-pour-le-pre-black-friday-les-20-offres-a-ne-pas-louper</guid>
      <description>
Apr&#232;s avoir pris de court ses concurrents en lan&#231;ant son op&#233;ration Black Friday avant l&#8217;heure, Boulanger a d&#233;clench&#233; une v&#233;ritable course aux promotions. C&#8217;est donc le moment id&#233;al pour anticiper ses achats de fin d&#8217;ann&#233;e et profiter de remises attractives sans attendre le week-end du Black Friday officiel.&#160;
</description>
    </item>
    <item>
      <title>Thousands of flights in danger of cancellation as FAA announces major cuts</title>
      <link>https://www.theverge.com/news/815359/faa-flight-cuts-airport-government-shutdown</link>
      <pubDate>2025-11-06T08:41:19-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815359</guid>
      <description>The government shutdown-spurred airport chaos is about to get a whole lot worse. The Federal Aviation Administration said Wednesday it will reduce flight volumes by 10 percent across 40 major airports in response, a move that could threaten 3,000 to 4,500 flights daily. The cuts will affect &#8220;high volume&#8221; markets, including in Atlanta, Dallas, New [&#8230;]...</description>
    </item>
    <item>
      <title>10 millions de Fran&#231;ais regardent Netflix avec de la pub</title>
      <link>https://www.01net.com/actualites/10-millions-de-francais-regardent-netflix-avec-de-la-pub.html</link>
      <pubDate>Thu, 06 Nov 2025 13:37:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305737</guid>
      <description>En France, pr&#232;s de la moiti&#233; de la population regarde Netflix. Et 10 millions le font via un abonnement avec pub, selon de nouveaux chiffres M&#233;diam&#233;trie. Un v&#233;ritable carton qui confirme l'implantation dans l'Hexagone de la plateforme de streaming, qui a trouv&#233; le point d'&#233;quilibre pour ne pas inonder les abonn&#233;s avec de la r&#233;clame.</description>
    </item>
    <item>
      <title>Ce laptop Dell polyvalent avec &#233;cran 120 Hz et Ryzen 7 chute sous les 500 &#8364; en plein pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2857801_ce-laptop-dell-polyvalent-avec-ecran-120-hz-et-ryzen-7-chute-sous-les-500-e-en-plein-pre-black-friday</link>
      <pubDate>Thu, 06 Nov 2025 13:36:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2857801_ce-laptop-dell-polyvalent-avec-ecran-120-hz-et-ryzen-7-chute-sous-les-500-e-en-plein-pre-black-friday</guid>
      <description>
Id&#233;al pour la bureautique, et m&#234;me pour du jeu l&#233;ger, le Dell 15 DC15255 est une machine polyvalente qui a aussi l'avantage d'&#234;tre pratique &#224; transporter. En ce pr&#233;-Black Friday, vous trouverez ce mod&#232;le sous Ryzen 7 affich&#233; &#224; 499 euros au lieu de 649 euros.
</description>
    </item>
    <item>
      <title>New teaser hints that two of the most anticipated X-Men might come to Marvel Rivals soon</title>
      <link>https://www.techradar.com/gaming/new-teaser-hints-that-two-of-the-most-anticipated-x-men-might-come-to-marvel-rivals-soon</link>
      <pubDate>Thu, 06 Nov 2025 13:35:35 +0000</pubDate>
      <guid isPermaLink="false">AP22mGvoqFcBQ5oTT2EXS8</guid>
      <description>It looks like Marvel Rivals will soon introduce two of the most anticipated X-Men to the roster.</description>
    </item>
    <item>
      <title>Valve just made Steam Deck downloads much easier &#8211; and I hope this feature comes to all SteamOS handhelds</title>
      <link>https://www.techradar.com/gaming/steam-deck/valve-just-made-steam-deck-downloads-much-easier-and-i-hope-this-feature-comes-to-all-steamos-handhelds</link>
      <pubDate>Thu, 06 Nov 2025 13:35:34 +0000</pubDate>
      <guid isPermaLink="false">h5PY9ZMLGySywtt8JBrE4Z</guid>
      <description>Valve has just released a new Steam Deck 'display-off low-power download' update, but it's currently only available via the beta and preview channels.</description>
    </item>
    <item>
      <title>Ce qui est en train de se passer &#224; la Nasa, sous l&#8217;effet du shutdown, devrait tous nous inqui&#233;ter</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-ce-train-passer-nasa-sous-effet-shutdown-devrait-tous-nous-inquieter-127245/#xtor%3DRSS-8</link>
      <pubDate>Thu, 06 Nov 2025 14:35:25 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-ce-train-passer-nasa-sous-effet-shutdown-devrait-tous-nous-inquieter-127245/#xtor%3DRSS-8</guid>
      <description>Alors que nous arrivons au 36e jour du&#160;shutdown, ce qui en fait le plus long de l'histoire am&#233;ricaine, la Nasa souffre de difficult&#233;s croissantes. Dans quel &#233;tat retrouvera-t-on l'agence spatiale au terme de cette &#233;preuve ?</description>
    </item>
    <item>
      <title>The Best Cheap Headphones We&#8217;ve Tried</title>
      <link>https://www.wired.com/gallery/best-headphones-under-100/</link>
      <pubDate>Thu, 06 Nov 2025 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">5c6730ca7029bd0a760fde8a</guid>
      <description>You could fill a stadium or two with all the cheap headphones out there. We tested a ton of the best headphones under $100 to help you pick the right pair.</description>
    </item>
    <item>
      <title>Watch those typos - email mistakes are causing significant security issues</title>
      <link>https://www.techradar.com/pro/security/email-mistakes-are-causing-significant-security-issues</link>
      <pubDate>Thu, 06 Nov 2025 13:26:00 +0000</pubDate>
      <guid isPermaLink="false">cgW3sWt4WfjEFnazosMRCR</guid>
      <description>Emails sent to the wrong address cause quite a lot of trouble and rake up billions in fines.</description>
    </item>
    <item>
      <title>Swytch est en grande difficult&#233;, un plan de sauvetage est en cours pour l&#8217;un des leaders des kits d&#8217;&#233;lectrification pour v&#233;lo</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2857311_swytch-est-en-grande-difficulte-un-plan-de-sauvetage-est-en-cours-pour-lun-des-leaders-des-kits-delectrification-pour-velo</link>
      <pubDate>Thu, 06 Nov 2025 13:16:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2857311_swytch-est-en-grande-difficulte-un-plan-de-sauvetage-est-en-cours-pour-lun-des-leaders-des-kits-delectrification-pour-velo</guid>
      <description>
Visiblement en difficult&#233; financi&#232;re, Swytch tente de se restructurer &#224; travers un plan de sauvetage soutenu par ses investisseurs historiques. Le sp&#233;cialiste britannique des kits d&#8217;&#233;lectrification pour v&#233;los esp&#232;re ainsi s&#233;curiser sa tr&#233;sorerie.
</description>
    </item>
    <item>
      <title>Foursquare&amp;#8217;s founder launches a new app that talks to you about your neighborhood</title>
      <link>https://www.theverge.com/news/815328/beebot-app-foursquare-founder-ai-audio-updates</link>
      <pubDate>2025-11-06T08:15:35-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815328</guid>
      <description>After teasing its development last year, Foursquare co-founder Dennis Crowley has now launched BeeBot: an AI-powered social app for iPhones that talks to you about what&#8217;s happening nearby. In his blog announcement, Crowley says BeeBot behaves like a &#8220;personalized radio DJ&#8221; that provides location-based audio updates through your headphones, telling you about what friends are [&#8230;]...</description>
    </item>
    <item>
      <title>Apple's $1 billion AI gamble might be too late to tempt users back to Apple Intelligence</title>
      <link>https://www.techradar.com/ai-platforms-assistants/apple-intelligence/apples-usd1-billion-ai-gamble-might-be-too-late-to-tempt-users-back-to-apple-intelligence</link>
      <pubDate>Thu, 06 Nov 2025 13:15:33 +0000</pubDate>
      <guid isPermaLink="false">3Z68vFrZR8gDMZGhwNFKYY</guid>
      <description>Apple and Google are about to sign a lucrative AI deal, but can Gemini fix Apple's AI woes? I think it's too little too late.</description>
    </item>
    <item>
      <title>Fairphone&#8217;s sustainable, repairable noise-cancelling headphones are finally coming to the US. Here&#8217;s why you should pay attention</title>
      <link>https://www.techradar.com/audio/wireless-headphones/fairphones-sustainable-repairable-noise-cancelling-headphones-are-finally-coming-to-the-us-heres-why-you-should-pay-attention</link>
      <pubDate>Thu, 06 Nov 2025 13:12:09 +0000</pubDate>
      <guid isPermaLink="false">gEmphhcbuugTDvVG7Wjz4T</guid>
      <description>These headphones are built to be better for the environment and for your conscience too</description>
    </item>
    <item>
      <title>Kodak's trending Charmera keyring camera is a great gift idea &#8211; I'd preorder the 'blind box' now and hope it lands in time for the holidays</title>
      <link>https://www.techradar.com/cameras/compact-cameras/kodaks-trending-charmera-keyring-camera-is-a-great-gift-idea-id-preorder-the-blind-box-now-and-hope-it-lands-in-time-for-the-holidays</link>
      <pubDate>Thu, 06 Nov 2025 13:03:27 +0000</pubDate>
      <guid isPermaLink="false">zsFhqyK2bE4wFSo5zsosPB</guid>
      <description>Kodak's Charmera digital keyring camera comes in a 'blind box' in any one of six colorways, and costs just $30 / &#163;30, which makes it a great gift idea.</description>
    </item>
    <item>
      <title>Snaps new AI search engine will be powered by Perplexity</title>
      <link>https://mashable.com/article/snap-perplexity-ai-chat</link>
      <pubDate>Thu, 06 Nov 2025 13:03:16 +0000</pubDate>
      <guid isPermaLink="false">06dS9pgkGKAiP8bvaaMltFb</guid>
      <description>Snap has partnered with Perplexity AI to make its chat smarter.</description>
    </item>
    <item>
      <title>Casio redesigns an iconic G-Shock model &#8211; with Garmin-style screen tech</title>
      <link>https://www.techradar.com/health-fitness/exercise-equipment/casio-redesigns-an-iconic-g-shock-model-with-garmin-style-screen-tech</link>
      <pubDate>Thu, 06 Nov 2025 13:01:12 +0000</pubDate>
      <guid isPermaLink="false">EaMocUgSzn94psQTjZS4YA</guid>
      <description>The Casio G-Shock GW-BX5600-1 boasts MIP display tech for a better experience in strong sunlight.</description>
    </item>
    <item>
      <title>Les meilleurs casques audio Bluetooth en novembre 2025 &#8211; La s&#233;lection Frandroid</title>
      <link>https://www.frandroid.com/guide-dachat/guide-audio/457173_guide-dachat-les-meilleurs-casques-bluetooth-sans-fil-de-2017</link>
      <pubDate>Thu, 06 Nov 2025 13:00:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-audio/457173_guide-dachat-les-meilleurs-casques-bluetooth-sans-fil-de-2017</guid>
      <description>
Vous ne savez pas quel casque Bluetooth choisir dans cet oc&#233;an de r&#233;f&#233;rences ? Nous avons r&#233;alis&#233; une s&#233;lection des meilleurs casques audio Bluetooth parmi tous ceux que nous avons pu tester.
</description>
    </item>
    <item>
      <title>Matt Smith Is Preparing to Enter &#8216;Star Wars&#8217; Later This Year</title>
      <link>https://gizmodo.com/matt-smith-star-wars-starfighter-filming-2000682336</link>
      <pubDate>Thu, 06 Nov 2025 13:00:07 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682336</guid>
      <description>Plus, Guy Fawkes opens a portal to hell in a new movie.</description>
    </item>
    <item>
      <title>When Thunderstorms Hit, Asthma Can Become an ER Nightmare</title>
      <link>https://gizmodo.com/thunderstorms-could-turn-your-asthma-into-a-nightmare-2000682082</link>
      <pubDate>Thu, 06 Nov 2025 13:00:04 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682082</guid>
      <description>New research is the latest to find that thunderstorms can worsen your odds of a serious seasonal asthma attack.</description>
    </item>
    <item>
      <title>Inception raises $50 million to build diffusion models for code and text</title>
      <link>https://techcrunch.com/2025/11/06/inception-raises-50-million-to-build-diffusion-models-for-code-and-text/</link>
      <pubDate>Thu, 06 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3065477</guid>
      <description>Diffusion models already power AI image generators, but Inception thinks they can be even more powerful applied in software development.</description>
    </item>
    <item>
      <title>This 15-inch MacBook Air M4 has dropped to a new record-low price &#8212; save over $200 at Amazon</title>
      <link>https://mashable.com/article/nov-6-macbook-air-deal</link>
      <pubDate>Thu, 06 Nov 2025 12:54:43 +0000</pubDate>
      <guid isPermaLink="false">07tllMeigOlNFdf2HN9MkGe</guid>
      <description>As of Nov. 6, the 15-inch 2025 MacBook Air (M4, 16GB RAM, 512GB SSD) is on sale at Amazon for $1,149.99. This is 18% off its list price of $1,399 and its lowest-ever price.</description>
    </item>
    <item>
      <title>FAA to reveal the 40 airports that will have fewer flights during the government shutdown</title>
      <link>https://www.fastcompany.com/91436447/faa-reveal-40-airports-that-will-have-fewer-flights-during-government-shutdown</link>
      <pubDate>2025-11-06T12:49:31</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91436447/faa-reveal-40-airports-that-will-have-fewer-flights-during-government-shutdown</guid>
      <description>Experts predict thousands of flights could be canceled.
Travelers through some of the busiest U.S. airports can expect to learn Thursday whether they&#8217;ll see fewer flights as the government shutdown drags into a second month.The Federal Aviation Administration will announce the 40 &#8220;high-volume markets&#8221; where it is reducing flights by 10% before the cuts go into effect Friday, said agency administrator Bryan Bedford. The move is intended to keep the air space safe during the shutdown, the agency said.Experts predict hundreds if not thousands of flights could be canceled. The cuts could represent...</description>
    </item>
  </channel>
</rss>
