<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 05 Nov 2025 14:45:04 GMT</lastBuildDate>
    <item>
      <title>xAI used employee biometric data to train Elon Musk&#8217;s AI girlfriend</title>
      <link>https://www.theverge.com/news/814168/xai-grok-ani-employee-biometric-data</link>
      <pubDate>2025-11-05T09:43:02-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814168</guid>
      <description>Elon Musk&#8217;s AI company compelled its employees submit their own biometric data to train its &#8220;Ani&#8221; female chatbot, according to The Wall Street Journal. Ani, an anime avatar with blond pigtails and an NSFW setting, was released over the summer for users who subscribe to X&#8217;s $30-a-month SuperGrok service. After testing it, The Verge&#8217;s Victoria [&#8230;]</description>
    </item>
    <item>
      <title>La France entame une &#171; proc&#233;dure de suspension &#187; de Shein</title>
      <link>https://www.frandroid.com/actualites-generales/2856499_la-france-entame-une-procedure-de-suspension-de-shein</link>
      <pubDate>Wed, 05 Nov 2025 14:38:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2856499_la-france-entame-une-procedure-de-suspension-de-shein</guid>
      <description>
De pol&#233;mique en pol&#233;mique, Shein est d&#233;sormais au centre d'une proc&#233;dure de suspension en France.
</description>
    </item>
    <item>
      <title>Le PlayStation Portal va enfin arr&#234;ter de ne servir &#224; rien</title>
      <link>https://www.01net.com/actualites/le-playstation-portal-va-enfin-arreter-de-ne-servir-a-rien.html</link>
      <pubDate>Wed, 05 Nov 2025 14:35:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305398</guid>
      <description>La mise &#224; jour du 6 novembre transforme enfin le PlayStation Portal en v&#233;ritable console nomade : le streaming dans le cloud des jeux PS5 sort de b&#234;ta et s&#8217;ouvre &#224; tous les abonn&#233;s PS Plus Premium, accompagn&#233; de plusieurs am&#233;liorations sympathiques.</description>
    </item>
    <item>
      <title>We have an official launch date and price leaks for the DJI Osmo Action 6 &#8211; with one major upgrade teased</title>
      <link>https://www.techradar.com/cameras/action-cameras/we-have-an-official-launch-date-and-price-leaks-for-the-dji-osmo-action-6-with-one-major-upgrade-teased</link>
      <pubDate>Wed, 05 Nov 2025 14:30:35 +0000</pubDate>
      <guid isPermaLink="false">YGNcCGUdAKivhPVM2TKvXD</guid>
      <description>DJI has scheduled what seems to be the Osmo Action 6 launch for November 18, and we might know pricing too.</description>
    </item>
    <item>
      <title>Apple punit les Europ&#233;ens en retirant une fonction de l&#8217;Apple Watch</title>
      <link>https://www.01net.com/actualites/apple-punit-les-europeens-en-retirant-une-fonction-de-lapple-watch.html</link>
      <pubDate>Wed, 05 Nov 2025 14:28:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305437</guid>
      <description>Ce qu'Apple donne d'une main, elle le retire d'une autre. iOS 26.2 va activer la traduction en direct pour les AirPods en Europe, mais dans le m&#234;me temps va d&#233;sactiver une fonction moins connue (mais pratique) de partage d'historique des r&#233;seaux Wi-Fi entre iPhone et Apple Watch. En ligne de mire du constructeur : le r&#232;glement sur les march&#233;s num&#233;riques (DMA)....</description>
    </item>
    <item>
      <title>This $649 RTX 4060 laptop is the cheapest way to get into gaming and content creation &#8212; save $250 off this jaw-droppingly capable laptop</title>
      <link>https://www.techradar.com/pro/this-usd649-rtx-4060-laptop-is-the-cheapest-way-to-get-into-gaming-and-content-creation-save-usd250-off-this-jaw-droppingly-capable-laptop</link>
      <pubDate>Wed, 05 Nov 2025 14:25:29 +0000</pubDate>
      <guid isPermaLink="false">ogyccBGQF3uSPBzQeAQvPo</guid>
      <description>Asus is clearing out this powerful laptop that can do gaming, content creation and much, much more.</description>
    </item>
    <item>
      <title>ChatGPT memories are disappearing for some users &#8211; here&#8217;s what you can do to protect yours</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/chatgpt-memories-are-disappearing-for-some-users-heres-what-you-can-do-to-protect-yours</link>
      <pubDate>Wed, 05 Nov 2025 14:25:17 +0000</pubDate>
      <guid isPermaLink="false">F8bnqfBWqc63XJcrhuttLT</guid>
      <description>Some ChatGPT users are reporting losing their saved memories &#8211; here&#8217;s how to back yours up before they&#8217;re gone.</description>
    </item>
    <item>
      <title>Anker lance son premier chargeur pour voitures &#233;lectriques, il est boost&#233; &#224; l&#8217;IA</title>
      <link>https://www.01net.com/actualites/anker-lance-son-premier-chargeur-pour-voitures-electriques-il-est-booste-a-lia.html</link>
      <pubDate>Wed, 05 Nov 2025 14:24:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305347</guid>
      <description>Le g&#233;ant chinois Anker, connu pour ses chargeurs et bornes de stockage d'&#233;nergie solaire pour la maison change de dimension. Sa gamme Anker SOLIX innove et introduit un nouveau mod&#232;le : le SOLIX V1. Une borne de recharge pour voiture &#233;lectrique, avec ou sans c&#226;ble.</description>
    </item>
    <item>
      <title>SoftBank, OpenAI launch new joint venture in Japan as AI deals grow ever more circular</title>
      <link>https://techcrunch.com/2025/11/05/softbank-openai-launch-new-joint-venture-in-japan-as-ai-deals-grow-ever-more-circular/</link>
      <pubDate>Wed, 05 Nov 2025 14:22:58 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3065205</guid>
      <description>SoftBank's joint venture with OpenAI that will localize and sell the AI company's enterprise tech to companies in Japan. And the first customer of this joint venture is going to be SoftBank itself.</description>
    </item>
    <item>
      <title>Fraude &#224; la carte bancaire&#160;: 3 r&#233;seaux criminels ont d&#233;rob&#233; 300 millions d&#8217;euros avec de faux abonnements</title>
      <link>https://www.01net.com/actualites/fraude-carte-bancaire-3-reseaux-criminels-derobe-300-millions-deuros-faux-abonnements.html</link>
      <pubDate>Wed, 05 Nov 2025 14:22:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305379</guid>
      <description>Les autorit&#233;s ont d&#233;mantel&#233; trois vastes r&#233;seaux de fraude par carte bancaire. Plus de 4,3 millions de personnes ont &#233;t&#233; pi&#233;g&#233;es par des arnaques aux faux abonnements, op&#233;r&#233;es depuis l'Europe. Plus de 300 millions d&#8217;euros de pertes ont &#233;t&#233; recens&#233;es avant que les forces de l'ordre ne mettent un terme aux activit&#233;s des pirates.</description>
    </item>
    <item>
      <title>Instagram slapped with cease and desist over its use of &amp;#8216;PG-13&amp;#8217; teen accounts</title>
      <link>https://www.theverge.com/news/814159/instagram-mpa-teen-accounts-pg13-rating-cease-and-desist</link>
      <pubDate>2025-11-05T09:21:09-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814159</guid>
      <description>The Motion Picture Association &#8212; the trade group in charge of movie ratings &#8212; has asked Meta to stop using its &#8220;PG-13&#8221; rating when referring to the type of content that teen accounts will see on Instagram. The MPA sent a cease and desist order to Meta on October 28th, saying Meta&#8217;s use of the [&#8230;]</description>
    </item>
    <item>
      <title>C&#8217;est colossal : jamais un trou noir n&#8217;avait &#233;t&#233; vu lib&#233;rer autant d&#8217;&#233;nergie dans tout l&#8217;Univers observable</title>
      <link>https://www.futura-sciences.com/sciences/actualites/trou-noir-supermassif-cest-colossal-jamais-trou-noir-navait-ete-vu-liberer-autant-energie-tout-univers-observable-127236/#xtor%3DRSS-8</link>
      <pubDate>Wed, 05 Nov 2025 15:16:52 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/trou-noir-supermassif-cest-colossal-jamais-trou-noir-navait-ete-vu-liberer-autant-energie-tout-univers-observable-127236/#xtor%3DRSS-8</guid>
      <description>Imaginez un instant &#224; quel point un objet brillant comme un millier de soleils illuminerait le ciel. Comme un million de soleils. Un milliard de soleils. Et maintenant 10&#8201;000&#160;milliards de soleils !&#160;C&#8217;est impossible&#8201;? &#192; concevoir pour nos simples esprits humains. Sans doute. Mais c&#8217;est bel et...</description>
    </item>
    <item>
      <title>California votes yes on Proposition 50, giving Democrats a boost for House races in 2026</title>
      <link>https://www.fastcompany.com/91435550/california-votes-yes-proposition-50-giving-democrats-boost-house-races-2026</link>
      <pubDate>2025-11-05T14:09:13</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91435550/california-votes-yes-proposition-50-giving-democrats-boost-house-races-2026</guid>
      <description>Democrats now have a shot at winning as many as five additional seats in 2026.
California voters approved new congressional district boundaries Tuesday, delivering a victory for Democrats in the state-by-state redistricting battle that will help determine which party wins control of the U.S. House in 2026 and, with it, the power to thwart or advance President Donald Trump&#8217;s agenda.The approval of Proposition 50 gives Democrats a shot at winning as many as five additional seats, just enough to blunt Texas Republicans&#8217; move to redraw their own maps to pick up five GOP seats at Trump&#8217;s urging. Te...</description>
    </item>
    <item>
      <title>5 big tech settlements you might be eligible for in 2025</title>
      <link>https://mashable.com/article/tech-social-media-settlement-payments-check-eligibility</link>
      <pubDate>Wed, 05 Nov 2025 14:06:33 +0000</pubDate>
      <guid isPermaLink="false">016Tl1ktjpoSWFpdwAEY0b6</guid>
      <description>You might be eligible to collect payouts from social media or tech settlements.</description>
    </item>
    <item>
      <title>Apache OpenOffice says it wasn't hit by cyberattack - despite ransomware hacker claims</title>
      <link>https://www.techradar.com/pro/security/apache-openoffice-says-it-wasnt-hit-by-cyberattack-despite-hacker-claims</link>
      <pubDate>Wed, 05 Nov 2025 14:05:00 +0000</pubDate>
      <guid isPermaLink="false">A2Cfw7exr2PYi6kxKZndBo</guid>
      <description>Akira says it's about to leak gigabytes of sensitive data, but OpenOffice says it doesn't even have that type of data.</description>
    </item>
    <item>
      <title>Stay secure with these VPN and password manager Black Friday bundles</title>
      <link>https://www.techradar.com/vpn/vpn-services/stay-secure-with-these-vpn-and-password-manager-black-friday-bundles</link>
      <pubDate>Wed, 05 Nov 2025 14:04:42 +0000</pubDate>
      <guid isPermaLink="false">XVz2ofwKc9T2tLLWeZFuaU</guid>
      <description>Protect your browsing history and passwords at the same time, now for less</description>
    </item>
    <item>
      <title>Amazon has slashed over $600 off the 65-Inch 4K QLED Roku Smart TV</title>
      <link>https://mashable.com/article/nov-5-roku-smart-tv-deal</link>
      <pubDate>Wed, 05 Nov 2025 14:00:49 +0000</pubDate>
      <guid isPermaLink="false">01dMOu8LVEbtsvgF7lwvAOg</guid>
      <description>As of Nov. 5, the 65-Inch 4K QLED Roku Smart TV is discounted at Amazon to $598, 50% off its list price of $1,199.99.</description>
    </item>
    <item>
      <title>The New &#8216;Five Nights at Freddy&#8217;s 2&#8217; Trailer Amps Up the Animatronic Horror</title>
      <link>https://gizmodo.com/five-nights-at-freddys-2-trailer-shadow-freddy-2000681854</link>
      <pubDate>Wed, 05 Nov 2025 14:00:48 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000681854</guid>
      <description>'Five Nights at Freddy's 2', starring Josh Hutcherson and Matthew Lillard, jumpscares its way to theaters this December.</description>
    </item>
    <item>
      <title>Quel hub USB-C choisir pour votre PC portable ou MacBook ?</title>
      <link>https://www.frandroid.com/guide-dachat/673800_meilleurs-hubs-usb-c-pour-votre-pc-ou-macbook</link>
      <pubDate>Wed, 05 Nov 2025 14:00:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/673800_meilleurs-hubs-usb-c-pour-votre-pc-ou-macbook</guid>
      <description>
Si vous achetez un PC portable, il y a fort &#224; parier que celui-ci propose un ou plusieurs ports USB-C... et peut-&#234;tre rien de plus niveau connectique. Voici notre s&#233;lection des meilleurs hubs (ou dongle) USB-C.
</description>
    </item>
    <item>
      <title>The Best Budget TVs (2025): TCL, Hisense, LG and More</title>
      <link>https://www.wired.com/gallery/best-cheap-tvs/</link>
      <pubDate>Wed, 05 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">680a831d1fc915c34efef23f</guid>
      <description>Save cash without sacrificing quality with one of these excellent cheap TVs.</description>
    </item>
    <item>
      <title>Google Maps taps Gemini AI to transform into an &#8216;all-knowing copilot&#8217;</title>
      <link>https://www.theverge.com/news/813588/google-maps-gemini-ai-chatbot-navigation-directions</link>
      <pubDate>2025-11-05T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=813588</guid>
      <description>Google Maps is bringing Gemini&#8217;s AI chatbot to more features, including more &#8220;conversational&#8221; route planning and the use of landmarks and nearby business for navigation. Google has slowly been adding AI to many of its products, including Maps, which last year got an updated version of Immersive View that allows users to ask questions about [&#8230;]</description>
    </item>
    <item>
      <title>Google Maps bakes in Gemini to improve navigation and hands-free use</title>
      <link>https://techcrunch.com/2025/11/05/google-maps-bakes-in-gemini-to-improve-navigation-and-hands-free-use/</link>
      <pubDate>Wed, 05 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3065174</guid>
      <description>Google is now baking Gemini into Maps to let users ask it questions while driving, improve navigation, and do more with the app.</description>
    </item>
    <item>
      <title>What is the release date for Pluribus episodes 1 and 2 on Apple TV?</title>
      <link>https://www.techradar.com/streaming/apple-tv-plus/what-is-the-release-date-for-pluribus-episodes-1-and-2-on-apple-tv</link>
      <pubDate>Wed, 05 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">BMtuzBSsiLQmWiLyp2VeWJ</guid>
      <description>Here's when the first two episodes of Vince Gilligan's new sci-fi drama will launch on Apple's streaming platform.</description>
    </item>
    <item>
      <title>Consoles, manettes et accessoires : le top offres gaming avant le Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2853043_lavant-premiere-du-black-friday-fait-la-part-belle-au-gaming-avec-la-nintendo-switch-2-en-promo-et-bien-dautres</link>
      <pubDate>Wed, 05 Nov 2025 13:56:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2853043_lavant-premiere-du-black-friday-fait-la-part-belle-au-gaming-avec-la-nintendo-switch-2-en-promo-et-bien-dautres</guid>
      <description>
L'ann&#233;e 2025 a &#233;t&#233; on ne peut plus riche pour le jeu vid&#233;o. Outre la sortie de nouveaux titres, la Nintendo Switch 2 a accapar&#233; toute l'attention cet &#233;t&#233; et continue de le faire aujourd'hui. D'autant plus qu'elle fait partie des meilleures offres dans cette s&#233;lection du pr&#233;-Black Friday.
</description>
    </item>
    <item>
      <title>Qobuz arrive sur Google TV : la nouveaut&#233; qui transforme votre t&#233;l&#233;viseur en plateforme musicale</title>
      <link>https://www.frandroid.com/services/streaming-musical/2856479_qobuz-arrive-sur-google-tv-la-nouveaute-qui-transforme-votre-televiseur-en-plateforme-musicale</link>
      <pubDate>Wed, 05 Nov 2025 13:54:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/streaming-musical/2856479_qobuz-arrive-sur-google-tv-la-nouveaute-qui-transforme-votre-televiseur-en-plateforme-musicale</guid>
      <description>
Qobuz annonce le lancement de son application Android TV, offrant d&#233;sormais l&#8217;acc&#232;s &#224; son catalogue de musique en haute qualit&#233; directement sur les t&#233;l&#233;viseurs connect&#233;s.
</description>
    </item>
    <item>
      <title>Cloud streaming finally arrives on the PlayStation Portal</title>
      <link>https://www.theverge.com/news/814078/playstation-portal-ps5-cloud-streaming</link>
      <pubDate>2025-11-05T08:50:35-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814078</guid>
      <description>PlayStation has announced that cloud streaming is officially rolling out to the PlayStation Portal, after a beta test period that started last year. Starting later today (November 5th) at 6PM PT / 9PM ET, PlayStation Premium Plus members will be able to stream select titles from their own library without the need to connect to [&#8230;]</description>
    </item>
    <item>
      <title>Une &#171;&#160;proc&#233;dure de suspension&#160;&#187; visant Shein est enclench&#233;e en France</title>
      <link>https://www.01net.com/actualites/une-procedure-de-suspension-visant-shein-est-enclenchee-en-france.html</link>
      <pubDate>Wed, 05 Nov 2025 13:48:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305387</guid>
      <description>Le site de e-commerce est bien vis&#233; par une &#171;&#160;proc&#233;dure de suspension &#187; dans l'Hexagone, apr&#232;s la pol&#233;mique sur la vente de poup&#233;es gonflables sexuelles &#224; caract&#232;re p&#233;dopornographique.</description>
    </item>
    <item>
      <title>Windows 11&#160;: le Microsoft Store peut installer simultan&#233;ment plusieurs applications</title>
      <link>https://www.01net.com/actualites/windows-11-le-microsoft-store-peut-installer-simultanement-plusieurs-applications.html</link>
      <pubDate>Wed, 05 Nov 2025 13:48:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305382</guid>
      <description>Microsoft vient de lancer une nouvelle fonctionnalit&#233; sur la version en ligne du Microsoft Store. Vous pouvez d&#233;sormais cr&#233;er des packs d&#8217;applications pour les installer toutes en un seul clic.</description>
    </item>
    <item>
      <title>Enfin, le PlayStation Portal devient une vraie console de jeu, &#224; cette condition</title>
      <link>https://www.frandroid.com/marques/sony/2856431_enfin-le-playstation-portal-devient-une-vraie-console-de-jeu-a-cette-condition</link>
      <pubDate>Wed, 05 Nov 2025 13:46:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2856431_enfin-le-playstation-portal-devient-une-vraie-console-de-jeu-a-cette-condition</guid>
      <description>
Sony met enfin &#224; jour le PlayStation Portal pour lui permettre de se connecter en cloud gaming.
</description>
    </item>
    <item>
      <title>All&#8217;s Fair scoring 0% on Rotten Tomatoes is absolutely criminal &#8211; there&#8217;s still good reason to stream the new Hulu show with Kim Kardashian</title>
      <link>https://www.techradar.com/streaming/hulu/alls-fair-scoring-0-percent-on-rotten-tomatoes-is-absolutely-criminal-theres-still-good-reason-to-stream-the-new-hulu-show-with-kim-kardashian</link>
      <pubDate>Wed, 05 Nov 2025 13:39:23 +0000</pubDate>
      <guid isPermaLink="false">W5Nr93m4CqxHtig6DYTghj</guid>
      <description>Kim Kardashian, Glenn Close and Naomi Watts team-up All's Fair has hit a record low on Rotten Tomatoes, but we might as well ignore it.</description>
    </item>
    <item>
      <title>Les produits Samsung sont d&#233;j&#224; &#224; prix cass&#233;s lors du pr&#233;-Black Friday : les 13 deals &#224; ne pas louper</title>
      <link>https://www.frandroid.com/bons-plans/2852851_les-produits-samsung-sont-deja-a-prix-casses-lors-du-pre-black-friday-les-11-deals-a-ne-pas-louper</link>
      <pubDate>Wed, 05 Nov 2025 13:38:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2852851_les-produits-samsung-sont-deja-a-prix-casses-lors-du-pre-black-friday-les-11-deals-a-ne-pas-louper</guid>
      <description>
Le pr&#233;-Black Friday d&#233;marre chez plusieurs e-commer&#231;ants avec de belles r&#233;ductions sur de nombreux produits tech. Samsung est aussi de la partie : t&#233;l&#233;viseurs, smartphones, tablettes&#8230; tout y passe. Voici notre s&#233;lection des meilleures offres de la marque.
</description>
    </item>
    <item>
      <title>DJIs new Osmo Mobile 8 gimbal launches today, but not for you</title>
      <link>https://mashable.com/article/dji-osmo-mobile-8-global-launch-us-availability</link>
      <pubDate>Wed, 05 Nov 2025 13:34:03 +0000</pubDate>
      <guid isPermaLink="false">00CvGRDaWfHws6gnOKdenfM</guid>
      <description>DJI formally released the new Osmo Mobile 8 in all global markets except for the U.S. Here's why you can't buy it there.</description>
    </item>
    <item>
      <title>Google et Epic enterrent la hache de guerre&#160;: le Play Store va s&#8217;ouvrir aux boutiques alternatives</title>
      <link>https://www.01net.com/actualites/google-et-epic-enterrent-la-hache-de-guerre-le-play-store-va-souvrir-aux-boutiques-alternatives.html</link>
      <pubDate>Wed, 05 Nov 2025 13:30:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305380</guid>
      <description>Et si l'affaire opposant Epic &#224; Google permettait &#224; tous, aussi bien au moteur de recherche qu'aux d&#233;veloppeurs et aux utilisateurs, de s'y retrouver ? Alors que le Play Store a commenc&#233; contraint et forc&#233; &#224; s'ouvrir &#224; la concurrence, le g&#233;ant du web et l'&#233;diteur de Fortnite ont fini par trouver un terrain d'entente. Si cet accord &#224; l'amiable est valid&#233; par la justice, il va r&#233;former en profondeur la boutique d'applications Android et cette fois, tout le monde est content....</description>
    </item>
    <item>
      <title>The Best Messenger Bag for Modern Professionals&#8217; Commute (2025)</title>
      <link>https://www.wired.com/gallery/best-messenger-bags/</link>
      <pubDate>Wed, 05 Nov 2025 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">5df831bddccd9300085b9328</guid>
      <description>From everyday canvas sacks to rainstorm-ready sling packs, these one-strap wonders shoulder the burden.</description>
    </item>
    <item>
      <title>Un TV QLED Ambilight (55&#8243;, 144 Hz, Dolby Vision) et une barre de son pour moins de 600 &#8364; ? Oui, c&#8217;est possible avec le Pr&#233; Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2855915_un-tv-qled-ambilight-55-144-hz-dolby-vision-et-une-barre-de-son-pour-moins-de-600-e-oui-cest-possible-avec-le-pre-black-friday</link>
      <pubDate>Wed, 05 Nov 2025 13:26:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2855915_un-tv-qled-ambilight-55-144-hz-dolby-vision-et-une-barre-de-son-pour-moins-de-600-e-oui-cest-possible-avec-le-pre-black-friday</guid>
      <description>
Une dalle Quantum Dot fluide, une ambiance lumineuse unique, et une barre de son pour faire vibrer le salon. Le pack TV Philips 55MLED920 et la barre de son TAB5309 s'invite aux pr&#233;mices du Black Friday et passe 899 euros &#224; 594 euros sur PC Componentes.
</description>
    </item>
    <item>
      <title>Votre Apple Watch va serrer la vis sur le score de sommeil, mais &#231;a ne veut pas dire que vous dormez moins bien</title>
      <link>https://www.frandroid.com/marques/apple/2855547_apple-rend-son-score-de-sommeil-bien-plus-severe-pour-mieux-refleter-votre-recuperation</link>
      <pubDate>Wed, 05 Nov 2025 13:26:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2855547_apple-rend-son-score-de-sommeil-bien-plus-severe-pour-mieux-refleter-votre-recuperation</guid>
      <description>
Apple a revu les mentions de son score de sommeil &#224; la baisse pour mieux refl&#233;ter la r&#233;cup&#233;ration r&#233;elle des utilisateurs. Un score jug&#233; correct jusqu'&#224; pr&#233;sent pourra ainsi &#234;tre &#233;valu&#233; comme faible. 
</description>
    </item>
    <item>
      <title>Nouvelle Tesla Model Y Standard : faut-il acheter la voiture neuve &#224; 35 790 &#8364; ou une version d&#8217;occasion ?</title>
      <link>https://www.frandroid.com/marques/tesla/2845511_nouvelle-tesla-model-y-standard-faut-il-acheter-la-voiture-neuve-a-35-790-e-ou-une-version-doccasion</link>
      <pubDate>Wed, 05 Nov 2025 13:24:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2845511_nouvelle-tesla-model-y-standard-faut-il-acheter-la-voiture-neuve-a-35-790-e-ou-une-version-doccasion</guid>
      <description>
Tesla vient de lancer sa voiture &#233;lectrique la moins ch&#232;re en Europe : la Model Y Standard. Faut-il pr&#233;f&#233;rer cette version, qui co&#251;te 5 000 &#8364; de moins que l'ancien prix d'acc&#232;s ? Ou vaut-il mieux se tourner vers un mod&#232;le d'occasion ? Voici notre analyse.
</description>
    </item>
    <item>
      <title>Government shutdown, now at 36 days, breaks the record for the longest ever</title>
      <link>https://www.fastcompany.com/91435505/government-shutdown-now-36-days-breaks-record-longest-ever</link>
      <pubDate>2025-11-05T13:23:32</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91435505/government-shutdown-now-36-days-breaks-record-longest-ever</guid>
      <description>Missing pay, federal program cuts, and flight delays are disrupting the lives of millions in the U.S.
The government shutdown has entered its 36th day, breaking the record as the longest ever and disrupting the lives of millions of Americans with federal program cuts, flight delays and federal workers nationwide left without paychecks.President Donald Trump has refused to negotiate with Democrats over their demands to salvage expiring health insurance subsidies until they agree to reopen the government. But skeptical Democrats question whether the Republican president will keep his word, parti...</description>
    </item>
    <item>
      <title>Russian hackers hit Windows machines via Linux VMs with new custom malware</title>
      <link>https://www.techradar.com/pro/security/russian-hackers-hit-windows-machines-via-linux-vms-with-new-custom-malware</link>
      <pubDate>Wed, 05 Nov 2025 13:22:00 +0000</pubDate>
      <guid isPermaLink="false">DgdzCYoUk2PGbkUyY2hetZ</guid>
      <description>Hiding malware in VMs bypasses security protections and hides traffic.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs TV de 2025&#8201;? Notre s&#233;lection</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-tv/508152_quelle-television-4k-choisir-la-selection-de-la-redaction</link>
      <pubDate>Wed, 05 Nov 2025 13:21:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-tv/508152_quelle-television-4k-choisir-la-selection-de-la-redaction</guid>
      <description>
Vous cherchez le meilleur t&#233;l&#233;viseur pour vos besoins ? Bienvenue sur notre s&#233;lection meilleurs TV du march&#233;, incluant des mod&#232;les de technologie OLED, QLED, LCD et m&#234;me QD-OLED.
</description>
    </item>
    <item>
      <title>Zohran Mamdani won because he knew when to be online &#8212; and when not to</title>
      <link>https://www.theverge.com/policy/814065/zohran-mamdani-nyc-mayor-race-victory-online</link>
      <pubDate>2025-11-05T08:21:16-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814065</guid>
      <description>Zohran Mamdani owes his win as New York City mayor substantially to his internet presence. Mamdani - as numerous writers have outlined - is good on social video. He picked a message, stuck to it, and adapted that platform to snappy soundbites across multiple mediums. But Mamdani's best trait as an online communicator wasn't knowing [&#8230;]</description>
    </item>
    <item>
      <title>These new headphones can simulate pro studios, listening rooms, or even the infamous &#8216;car test&#8217; &#8211; and I can&#8217;t wait to get my hands on them</title>
      <link>https://www.techradar.com/audio/headphones/these-new-headphones-can-simulate-pro-studios-listening-rooms-or-even-the-infamous-car-test-and-i-cant-wait-to-get-my-hands-on-them</link>
      <pubDate>Wed, 05 Nov 2025 13:13:37 +0000</pubDate>
      <guid isPermaLink="false">2VQXrgqtXc69AYZzxzxLfM</guid>
      <description>Steven Slate Audio wants to bring the studio to you</description>
    </item>
    <item>
      <title>We now have a Nintendo Store app for iOS and Android</title>
      <link>https://www.theverge.com/news/814054/nintendo-store-app-ios-android-games-shop</link>
      <pubDate>2025-11-05T08:07:21-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814054</guid>
      <description>Nintendo has released an official Nintendo Store app, allowing more fans to access the eShop on iPhone, iPad, and Android devices. Five years after exclusively launching in Japan as the &#8220;My Nintendo&#8221; app, Nintendo has now expanded the iOS and Android experience under a new name to other regions, including the US, UK, Canada, and [&#8230;]</description>
    </item>
    <item>
      <title>The latest PlayStation Portal update goes another step toward making it the PS5 handheld fans like me wanted from the start</title>
      <link>https://www.techradar.com/gaming/ps5/the-latest-playstation-portal-update-goes-another-step-toward-making-it-the-ps5-handheld-fans-like-me-wanted-from-the-start</link>
      <pubDate>Wed, 05 Nov 2025 13:01:00 +0000</pubDate>
      <guid isPermaLink="false">mEikWPQ7Wcx4jkWkcVCTkU</guid>
      <description>The latest PlayStation Portal update is here, and it makes everything look and feel slicker, but also brings a feature that all of us wanted from the start.</description>
    </item>
    <item>
      <title>Sony senior manager overseeing the PlayStation Portal says the handheld is now 'the most widely used device' for the PS5 Remote Play, surpassing PC, PS4, PS5, and mobile</title>
      <link>https://www.techradar.com/gaming/playstation/playstation-portal-product-lead-says-the-handheld-is-now-the-most-widely-used-device-for-the-ps5-remote-play-surpassing-pc-ps4-ps5-and-mobile</link>
      <pubDate>Wed, 05 Nov 2025 13:01:00 +0000</pubDate>
      <guid isPermaLink="false">XPUj4bYB3w95mMcmQD6jFh</guid>
      <description>Sony has revealed new statistics for the PlayStation Portal, confirming it is now the most popular PlayStation device to use for Remote Play.</description>
    </item>
    <item>
      <title>Scott Bakula Still Has Hope for Captain Archer&#8217;s &#8216;Star Trek&#8217; Return</title>
      <link>https://gizmodo.com/scott-bakula-star-trek-enterprise-return-2000681782</link>
      <pubDate>Wed, 05 Nov 2025 13:00:51 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000681782</guid>
      <description>Plus, a long-in-limbo Stan Lee project may finally get off the ground.</description>
    </item>
    <item>
      <title>PlayStation Portal senior manager says cloud streaming on the handheld has already proved very popular in its beta phase with PS Plus Premium subscribers &#8211; '7 out of 10 premium portal owners are already streaming as we speak'</title>
      <link>https://www.techradar.com/gaming/playstation/playstation-portal-senior-manager-says-cloud-streaming-on-the-handheld-has-already-proved-very-popular-in-its-beta-phase-with-ps-plus-premium-subscribers-7-out-of-10-premium-portal-owners-are-already-streaming-as-we-speak</link>
      <pubDate>Wed, 05 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">VznpCYR2D9xXQwHugqhkZg</guid>
      <description>The PlayStation Portal's cloud streaming feature is leaving beta, and it's already proved to be a popular option among its PlayStation Plus Premium subscriber testers.</description>
    </item>
    <item>
      <title>I tested Kodak's cheap and cheerful PixPro C1 compact camera &#8211; it was like going back in time, and not in a good way</title>
      <link>https://www.techradar.com/cameras/compact-cameras/kodak-pixpro-c1-review</link>
      <pubDate>Wed, 05 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">gcRGnCVs7qPupRKkWq9c7H</guid>
      <description>Kodak's PixPro C1 looks great and costs just $99 / &#163;79 &#8211; but I'm still not sure I'd buy one</description>
    </item>
    <item>
      <title>Osmo Mobile 8&#8239;: DJI r&#233;volutionne le suivi intelligent et la cr&#233;ation sur smartphone avec un gimbal qui fait bien plus que stabiliser vos vid&#233;os</title>
      <link>https://www.frandroid.com/marques/dji/2855895_osmo-mobile-8-dji-revolutionne-le-suivi-intelligent-et-la-creation-sur-smartphone-avec-un-gimbal-qui-fait-bien-plus-que-stabiliser-vos-videos</link>
      <pubDate>Wed, 05 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dji/2855895_osmo-mobile-8-dji-revolutionne-le-suivi-intelligent-et-la-creation-sur-smartphone-avec-un-gimbal-qui-fait-bien-plus-que-stabiliser-vos-videos</guid>
      <description>
DJI a d&#233;voil&#233; son nouvel Osmo Mobile 8, un gimbal qui fait aussi perche &#224; selfie, station vid&#233;o pour des appels et r&#233;cepteur pour microphones, avec un nouveau mode panorama &#224; 360 degr&#233;s. 
</description>
    </item>
    <item>
      <title>UPS plane crashes on takeoff from Kentucky, leaving at least 7 dead</title>
      <link>https://www.fastcompany.com/91435486/ups-cargo-plane-crashes-takeoff-kentucky-leaving-least-7-dead</link>
      <pubDate>2025-11-05T12:53:14</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91435486/ups-cargo-plane-crashes-takeoff-kentucky-leaving-least-7-dead</guid>
      <description>The plane crashed moments after takeoff  killing all three aboard and injuring 11 on the ground.
A UPS wide-body cargo plane crashed on Tuesday and erupted into a fireball moments after takeoff from the international airport in Louisville, Kentucky, killing seven, including all three aboard, and injuring 11 on the ground, officials said.</description>
    </item>
    <item>
      <title>These slimline tower speakers would fit just Fyne in my tiny apartment &#8211;and for this money, I'm tempted</title>
      <link>https://www.techradar.com/audio/speakers/these-slimline-tower-speakers-would-fit-just-fyne-in-my-tiny-apartment-and-for-this-money-im-tempted</link>
      <pubDate>Wed, 05 Nov 2025 12:52:25 +0000</pubDate>
      <guid isPermaLink="false">Gjbt6m9cm5AtndMPEgC34R</guid>
      <description>When I think of Fyne speakers, the last thing I think of is space-saving &#8211;but this Scottish firm understands the current state of living, and I like that.</description>
    </item>
    <item>
      <title>Hostinger wants to reinvent the email - unsurprisingly, using AI</title>
      <link>https://www.techradar.com/pro/hostinger-wants-to-reinvent-the-email-unsurprisingly-using-ai</link>
      <pubDate>Wed, 05 Nov 2025 12:50:08 +0000</pubDate>
      <guid isPermaLink="false">2qXEV384huPY4F9i2pKSwV</guid>
      <description>Web hosting powerhouse builds its own email service - with AI baked in.</description>
    </item>
  </channel>
</rss>
