<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 23 Dec 2025 11:23:13 GMT</lastBuildDate>
    <item>
      <title>Alphabet secures $4.75 billion Intersect deal to make sure its data centers have enough energy</title>
      <link>https://www.techradar.com/pro/alphabet-secures-usd4-75-billion-intersect-deal-to-make-sure-its-data-centers-have-enough-energy</link>
      <pubDate>Tue, 23 Dec 2025 11:20:00 +0000</pubDate>
      <guid isPermaLink="false">VQhhqMkUhkQTQWgn3SgMtU</guid>
      <description>Google to buy out Intersect Power after offering financial backing in 2024, in a bid to help bolster its data center strategy.</description>
    </item>
    <item>
      <title>Legendary FPS developer Vince Zampella has passed away</title>
      <link>https://www.techradar.com/gaming/gaming-industry/legendary-fps-developer-vince-zampella-has-passed-away</link>
      <pubDate>Tue, 23 Dec 2025 11:18:09 +0000</pubDate>
      <guid isPermaLink="false">aDdhuCHczKondxUHYkuGPb</guid>
      <description>Vince Zampella, best known as the co-creator of Call of Duty and co-founder of Respawn Entertainment, has died in a car accident in Los Angeles at the age of 55.</description>
    </item>
    <item>
      <title>Phishing emails and fake adverts flood inboxes this Christmas - and they&#8217;re getting harder to detect than ever</title>
      <link>https://www.techradar.com/pro/security/phishing-emails-and-fake-adverts-flood-inboxes-this-christmas-and-theyre-getting-harder-to-detect-than-ever</link>
      <pubDate>Tue, 23 Dec 2025 11:12:09 +0000</pubDate>
      <guid isPermaLink="false">Qm3RzHhtMqRZpRNVtnTyhb</guid>
      <description>Be extra safe with your clicks this Christmas, experts say.</description>
    </item>
    <item>
      <title>Google Assistant survit &#224; 2025&#160;: le grand remplacement par Gemini est officiellement report&#233;</title>
      <link>https://www.01net.com/actualites/google-assistant-survit-a-2025-le-grand-remplacement-par-gemini-est-officiellement-reporte.html</link>
      <pubDate>Tue, 23 Dec 2025 11:07:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316800</guid>
      <description>Google confirme que la transition de Google Assistant vers Gemini, initialement pr&#233;vue pour cette fin d'ann&#233;e, est repouss&#233;e &#224; 2026. Une officialisation qui vient cr&#233;dibiliser une date butoir aper&#231;ue d&#232;s le mois dernier : mars 2026.</description>
    </item>
    <item>
      <title>The "feature-stuffed" Garmin Vivoactive 6 drops to a record-low price on Amazon</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/the-feature-stuffed-garmin-vivoactive-6-drops-to-a-record-low-price-on-amazon</link>
      <pubDate>Tue, 23 Dec 2025 11:00:35 +0000</pubDate>
      <guid isPermaLink="false">yFqAYqSmeXW2xXCW6SogpM</guid>
      <description>You can now snap up the excellent Garmin Vivoactive 6 for its lowest-ever price of $249.99 at Amazon.</description>
    </item>
    <item>
      <title>Chinese Crypto Scammers on Telegram Are Fueling the Biggest Darknet Markets Ever</title>
      <link>https://www.wired.com/story/expired-tired-wired-chinese-scammer-crypto-markets/</link>
      <pubDate>Tue, 23 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">691ba344c05ad68f076f4074</guid>
      <description>Online black markets once lurked in the shadows of the dark web. Today, they&#8217;ve moved onto public platforms like Telegram&#8212;and are racking up historic illicit fortunes.</description>
    </item>
    <item>
      <title>Big Balls Was Just the Beginning</title>
      <link>https://www.wired.com/story/expired-tired-wired-doge/</link>
      <pubDate>Tue, 23 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">691b9abda85ddc95bbb595f9</guid>
      <description>DOGE dominated the news this year as Elon Musk&#8217;s operatives shook up several US government agencies. It&#8217;s far from over.</description>
    </item>
    <item>
      <title>How a former Forest Service employee changed the future of housing in California</title>
      <link>https://www.fastcompany.com/91435632/yimby-california-housing-reform-brian-hanlon</link>
      <pubDate>2025-12-23T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91435632/yimby-california-housing-reform-brian-hanlon</guid>
      <description>Inside the genesis of a YIMBY advocacy organization that just successfully pushed for the passage of revolutionary housing laws that could finally ease California&#8217;s housing crisis.
One April night eight years ago, two tech leaders sat down with a former Forest Service employee at Terroir, a natural wine bar in San Francisco. Then they started sketching out a plan that would eventually reshape California&#8217;s housing policy....</description>
    </item>
    <item>
      <title>This AI slop-free browser is the best idea of 2025</title>
      <link>https://www.fastcompany.com/91461264/slop-evader-ai-slop-browser-best-idea-of-2025</link>
      <pubDate>2025-12-23T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91461264/slop-evader-ai-slop-browser-best-idea-of-2025</guid>
      <description>Teleport back in time to Nov. 30, 2022. 
A new extension for Chrome stops AI slop from invading your life. Called Slop Evader, it is a temporal firewall that modifies your Google search queries to exclude any results indexed after November 30, 2022. That is the day the ChatGPT asteroid hit the open web, upending culture and reality as we know it. </description>
    </item>
    <item>
      <title>Homebuilder Lennar&#8217;s average home price is down 21% from the pandemic housing market boom peak</title>
      <link>https://www.fastcompany.com/91464802/housing-market-home-prices-homebuilding-lennar-average-price-is-down-from-pandemic-boom-peak</link>
      <pubDate>2025-12-23T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464802/housing-market-home-prices-homebuilding-lennar-average-price-is-down-from-pandemic-boom-peak</guid>
      <description>The key question is how much of that 21.4% decline reflects mix shift, outright price cuts, or larger incentive packages?
Want more housing market stories from Lance Lambert&#8217;s ResiClub&#160;in your inbox?&#160;Subscribe&#160;to the&#160;ResiClub&#160;newsletter.</description>
    </item>
    <item>
      <title>Voici le meilleur casque audio de l&#8217;ann&#233;e &#8211; Frandroid Awards 2025</title>
      <link>https://www.frandroid.com/marques/2899727_voici-le-meilleur-casque-audio-de-lannee-frandroid-awards-2025</link>
      <pubDate>Tue, 23 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2899727_voici-le-meilleur-casque-audio-de-lannee-frandroid-awards-2025</guid>
      <description>
Le meilleur casque Bluetooth test&#233; par Frandroid est le Bose QuietComfort Ultra Heaphone (2e g&#233;n&#233;ration). D&#233;couvrez pourquoi ce produit a re&#231;u le Frandroid Awards avec Delos de sa cat&#233;gorie.
</description>
    </item>
    <item>
      <title>23 ans plus tard, GTA Vice City est maintenant jouable&#8230; directement sur Google Chrome</title>
      <link>https://www.frandroid.com/produits-android/console/2919037_23-ans-plus-tard-gta-vice-city-est-maintenant-jouable-directement-sur-google-chrome</link>
      <pubDate>Tue, 23 Dec 2025 10:59:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2919037_23-ans-plus-tard-gta-vice-city-est-maintenant-jouable-directement-sur-google-chrome</guid>
      <description>
Une &#233;quipe de d&#233;veloppeurs a r&#233;ussi un petit exploit qui en dit long sur la faible puissance des consoles de notre enfance : faire tenir GTA Vice City sur un simple navigateur internet. On vous explique.
</description>
    </item>
    <item>
      <title>Samsung fait machine arri&#232;re : ces deux fonctions photo sont de retour sur vos Galaxy, mais avec un pi&#232;ge !</title>
      <link>https://www.frandroid.com/marques/samsung/2919397_samsung-fait-machine-arriere-ces-deux-fonctions-photo-sont-de-retour-sur-vos-galaxy-mais-avec-un-piege</link>
      <pubDate>Tue, 23 Dec 2025 10:55:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2919397_samsung-fait-machine-arriere-ces-deux-fonctions-photo-sont-de-retour-sur-vos-galaxy-mais-avec-un-piege</guid>
      <description>
Les modes &#171; Prise unique &#187; et &#171; Enregistrement double &#187; font leur grand retour dans la seconde version b&#234;ta de One UI 8.5, mais Samsung a d&#233;cid&#233; de modifier en profondeur leur accessibilit&#233;.
</description>
    </item>
    <item>
      <title>Vibe code a gift this Christmas: my helpful guide for last-minute crafting</title>
      <link>https://www.techradar.com/pro/website-hosting/vibe-code-a-gift-this-christmas-my-helpful-guide-for-last-minute-crafting</link>
      <pubDate>Tue, 23 Dec 2025 10:54:03 +0000</pubDate>
      <guid isPermaLink="false">CpSWVyc4MeD6DbhmxR3FoS</guid>
      <description>Still looking for a Christmas gift? Try vibe coding a present with my guide.</description>
    </item>
    <item>
      <title>US DJI ban is here &#8211; here's what users of DJI drones and cameras need to know</title>
      <link>https://www.techradar.com/cameras/drones/us-dji-ban-is-here-heres-what-users-of-dji-drones-and-cameras-need-to-know</link>
      <pubDate>Tue, 23 Dec 2025 10:45:04 +0000</pubDate>
      <guid isPermaLink="false">tBx5oLRcAu64CKw98MzdxQ</guid>
      <description>As the FCC adds DJI to its Covered List, here's what we know so far about restrictions on the company's products in the USA.</description>
    </item>
    <item>
      <title>Dometic makes a better portable water faucet</title>
      <link>https://www.theverge.com/tech/848916/dometic-recon-360-water-pump-review</link>
      <pubDate>2025-12-23T05:44:07-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/848916/semi-solid-state-magsafe-power-banks-arrive-from-the-founder-of-hyper</guid>
      <description>As a reluctant doomsday prepper and eager vanlifer, Dometic's battery-powered Go Faucet has, for the last few years, played a central role in my bougie bug-out kit and my camping rig's water system. So it took me all of two minutes with Dometic's new Recon 360 Faucet to realize it's an upgrade in every single [&#8230;]</description>
    </item>
    <item>
      <title>Xiaomi 17 Ultra&#160;: le fleuron se d&#233;voile avant son annonce officielle</title>
      <link>https://www.01net.com/actualites/xiaomi-17-ultra-le-fleuron-se-devoile-avant-son-annonce-officielle.html</link>
      <pubDate>Tue, 23 Dec 2025 10:35:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316775</guid>
      <description>La conf&#233;rence Xiaomi s&#8217;appr&#234;te &#224; r&#233;v&#233;ler son smartphone le plus haut de gamme de l&#8217;ann&#233;e, le Xiaomi 17 Ultra, le 25 d&#233;cembre 2025. La marque distille d&#233;j&#224; des indices sur les r&#233;seaux sociaux.</description>
    </item>
    <item>
      <title>Best Indoor Garden Systems: We've Been Testing All Year (2026)</title>
      <link>https://www.wired.com/gallery/best-indoor-gardening-systems/</link>
      <pubDate>Tue, 23 Dec 2025 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">6877f4e6e1c1b51582845053</guid>
      <description>Grow a backyard&#8217;s worth of greens and vegetables in your house with a vertical hydroponic garden. Here are a few that might be worth the investment.</description>
    </item>
    <item>
      <title>Lego is obsessed with nostalgia. So is everyone else</title>
      <link>https://www.fastcompany.com/91455872/lego-is-obsessed-with-nostalgia-so-is-everyone-else</link>
      <pubDate>2025-12-23T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91455872/lego-is-obsessed-with-nostalgia-so-is-everyone-else</guid>
      <description>Nostalgic IP has overtaken Lego sets in recent years. Here are the best sets that look backwards.
Lego has a nostalgia problem. I do, too. Like Hollywood and its eternal cycle of remakes, the Danish company has found a bottomless treasure pot full of GenX and Gen Z people willing to burn their credit cards to turn their golden memories into bricks. By my count, 2025 alone brought a record-setting 16 sets related to old Lego properties and external IPs, shattering 2023&#8217;s previous peak of 9 sets....</description>
    </item>
    <item>
      <title>The Trump administration is trying to kill these offshore wind projects over &#8216;national security&#8217; concerns that experts say are bogus</title>
      <link>https://www.fastcompany.com/91464931/trump-kills-offshore-wind-projects-national-security-bogus</link>
      <pubDate>2025-12-23T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464931/trump-kills-offshore-wind-projects-national-security-bogus</guid>
      <description>Five major offshore wind projects that are currently under construction on the East Coast now face an uncertain future.
When the Department of the Interior announced on Monday that it was suspending the leases of five offshore wind farms that are currently under construction, it blamed national security concerns. Military experts say that&#8217;s an excuse....</description>
    </item>
    <item>
      <title>La solide Xiaomi Pad 7 Pro dot&#233;e d&#8217;une puce Snapdragon 8s Gen 3 perd plus de 230 &#8364; aujourd&#8217;hui</title>
      <link>https://www.frandroid.com/bons-plans/2919023_la-solide-xiaomi-pad-7-pro-dotee-dune-puce-snapdragon-8s-gen-3-perd-plus-de-230-e-aujourdhui</link>
      <pubDate>Tue, 23 Dec 2025 10:27:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2919023_la-solide-xiaomi-pad-7-pro-dotee-dune-puce-snapdragon-8s-gen-3-perd-plus-de-230-e-aujourdhui</guid>
      <description>
La Xiaomi Pad 7 Pro a l'ambition des plus grands avec un prix r&#233;duit. Preuve en est, la tablette chute &#224; moins de 300 euros chez AliExpress avec le code FRBD25.
</description>
    </item>
    <item>
      <title>Cette innovation du Xiaomi 17 Ultra va enterrer les zooms de nos smartphones</title>
      <link>https://www.frandroid.com/marques/xiaomi/2919111_cette-innovation-du-xiaomi-17-ultra-va-enterrer-les-zooms-de-nos-smartphones</link>
      <pubDate>Tue, 23 Dec 2025 10:26:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2919111_cette-innovation-du-xiaomi-17-ultra-va-enterrer-les-zooms-de-nos-smartphones</guid>
      <description>
Xiaomi s'appr&#234;te &#224; frapper un grand coup sur le march&#233; de la photographie mobile. Le constructeur chinois a confirm&#233; le lancement imminent du Xiaomi 17 Ultra, un fleuron qui inaugure un syst&#232;me de zoom optique continu de 200 m&#233;gapixels, promettant une qualit&#233; d'image constante entre 75 mm et 100 mm.
</description>
    </item>
    <item>
      <title>16 Best Housewarming Gifts We Can't Stop Using (2025): Coasters, Blenders, Sheets</title>
      <link>https://www.wired.com/gallery/best-housewarming-gifts-for-any-new-home-2025/</link>
      <pubDate>Tue, 23 Dec 2025 10:26:00 +0000</pubDate>
      <guid isPermaLink="false">67195132362f1871bc36ca5b</guid>
      <description>Make a house into a home with these gifts, whether your recipient is moving into their first house or a great new apartment.</description>
    </item>
    <item>
      <title>Steam passe enfin au 64 bits sur Windows : ce que &#231;a change</title>
      <link>https://www.frandroid.com/marques/2918989_steam-passe-enfin-au-64-bits-sur-windows-ce-que-ca-change</link>
      <pubDate>Tue, 23 Dec 2025 10:24:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2918989_steam-passe-enfin-au-64-bits-sur-windows-ce-que-ca-change</guid>
      <description>
Valve fait &#233;voluer son client vers l'architecture 64 bits de Windows. Un changement technique qui apporte avant tout une meilleure compatibilit&#233; mat&#233;rielle.
</description>
    </item>
    <item>
      <title>Google Cloud reveals all-new channel program - here's all the key details</title>
      <link>https://www.techradar.com/pro/google-cloud-reveals-all-new-channel-program-heres-all-the-key-details</link>
      <pubDate>Tue, 23 Dec 2025 10:23:42 +0000</pubDate>
      <guid isPermaLink="false">grFXEBTf4aNQZX7jjNE6Nf</guid>
      <description>Google says it's making the Partner Network simpler for 2026 with new automation aids, but partners might not retain their status.</description>
    </item>
    <item>
      <title>Amazon Prime Video en janvier 2026 : voici les films et s&#233;ries &#224; voir, dont la saison 2 de The Night Manager et les Mission Impossible</title>
      <link>https://www.frandroid.com/marques/amazon/2919049_amazon-prime-video-en-janvier-2026-voici-les-films-et-series-a-voir-dont-la-saison-2-de-the-night-manager-et-les-mission-impossible</link>
      <pubDate>Tue, 23 Dec 2025 10:23:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazon/2919049_amazon-prime-video-en-janvier-2026-voici-les-films-et-series-a-voir-dont-la-saison-2-de-the-night-manager-et-les-mission-impossible</guid>
      <description>
De grands classiques, des blockbusters, du spectacle, de nouveaux arrivages et du basket ! Amazon d&#233;voile le catalogue de son service Prime Video pour janvier 2026, voyons ce qu'il y a &#224; regarder.
</description>
    </item>
    <item>
      <title>LG Display abandonne le sous-pixel blanc pour ses dalles de moniteurs gaming OLED et monte jusqu&#8217;&#224; 240Hz voire 480 Hz</title>
      <link>https://www.frandroid.com/events/ces/2919287_lg-display-abandonne-le-sous-pixel-blanc-pour-ses-dalles-de-moniteurs-gaming-oled-et-monte-jusqua-240hz-voire-480-hz</link>
      <pubDate>Tue, 23 Dec 2025 10:16:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/events/ces/2919287_lg-display-abandonne-le-sous-pixel-blanc-pour-ses-dalles-de-moniteurs-gaming-oled-et-monte-jusqua-240hz-voire-480-hz</guid>
      <description>
LG Display vient d&#8217;annoncer au CES 2026 la pr&#233;sentation du premier panneau OLED pour moniteurs combinant une d&#233;finition 4K sur 27 pouces, structure de sous-pixels RVB en ligne et fr&#233;quence de rafra&#238;chissement de 240Hz, une combinaison encore in&#233;dite sur ce segment.
</description>
    </item>
    <item>
      <title>Renault franchit un cap : 1000 km d&#8217;autonomie en conditions r&#233;elles avec cette voiture &#233;lectrique hors du commun</title>
      <link>https://www.frandroid.com/marques/renault/2918981_renault-franchit-un-cap-1000-km-dautonomie-en-conditions-reelles-avec-cette-voiture-electrique-hors-du-commun</link>
      <pubDate>Tue, 23 Dec 2025 10:16:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2918981_renault-franchit-un-cap-1000-km-dautonomie-en-conditions-reelles-avec-cette-voiture-electrique-hors-du-commun</guid>
      <description>
D&#233;voil&#233;e en d&#233;but d&#8217;ann&#233;e 2025, la Renault Filante Record a parcouru 1 008 kilom&#232;tres en seulement 9 heures et 52 minutes. Dot&#233;e d&#8217;une batterie &#233;quivalente &#224; celle du Sc&#233;nic E-Tech, la voiture &#233;lectrique s'attaque directement &#224; Mercedes et son concept Vision EQXX.
</description>
    </item>
    <item>
      <title>574 pirates arr&#234;t&#233;s, 6 ransomwares d&#233;chiffr&#233;s&#160;: la police frappe &#224; nouveau la cybercriminalit&#233; africaine</title>
      <link>https://www.01net.com/actualites/574-pirates-arretes-6-ransomwares-dechiffres-police-frappe-nouveau-cybercriminalite-africaine.html</link>
      <pubDate>Tue, 23 Dec 2025 10:01:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316765</guid>
      <description>Interpol vient de porter un coup majeur &#224; l&#8217;industrie criminelle africaine. Avec l'aide des forces de l'ordre locales, les enqu&#234;teurs ont interpell&#233; plus de 570 pirates et d&#233;chiffr&#233; six ransomwares. Les activit&#233;s vis&#233;es ont abouti &#224; des pertes financi&#232;res de plus de 21 millions de dollars.</description>
    </item>
    <item>
      <title>Watch These Live Cams of the Los Angeles Area Rain and Flood Risk During Christmas Week</title>
      <link>https://gizmodo.com/watch-these-live-cams-of-the-los-angeles-area-rain-and-flood-risk-during-christmas-week-2000702793</link>
      <pubDate>Tue, 23 Dec 2025 10:00:52 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702793</guid>
      <description>Southern California is bracing for mudslides and other hazards during the holiday week.</description>
    </item>
    <item>
      <title>The best SSDs in 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-ssds-140014262.html?src=rss</link>
      <pubDate>Tue, 23 Dec 2025 10:00:36 +0000</pubDate>
      <guid isPermaLink="false">de01e79a-abbe-42cf-88a9-a820abb3b1bd</guid>
      <description>Upgrading to a good SSD can make your computer feel brand new again. Apps open faster, files move in a blink and even older machines start to feel a lot more responsive. It is one of the easiest ways to breathe life into a laptop or desktop without replacing the whole system, and the performance boost is something you notice right away.There are plenty of SSDs to choose from, though, and the naming alone can be confusing if you are not already familiar with the specs. Some drives are built for simple upgrades, while others offer speeds that benefit creators or gamers. To help you sort through ...</description>
    </item>
    <item>
      <title>Want a home security camera without a subscription? I test smart home tech for a living, and these are my 3 recommendations</title>
      <link>https://www.techradar.com/home/home-security/top-3-subscription-free-home-security-cameras</link>
      <pubDate>Tue, 23 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">2enyf8GqqromzVEtRBNiSk</guid>
      <description>These feature-packed home security cameras offer crisp 4K footage, solar charging, local storage for your videos, and AI smarts too &#8211; with no extra fees.</description>
    </item>
    <item>
      <title>The Amandaland Christmas special has a hilarious Motherland Easter egg only a true superfan can spot</title>
      <link>https://www.techradar.com/streaming/entertainment/the-amandaland-christmas-special-has-a-hilarious-motherland-easter-egg-only-a-true-superfan-can-spot</link>
      <pubDate>Tue, 23 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">HMk5SUVfCyoN7gzatpQCs5</guid>
      <description>The Amandaland Christmas special is a British sitcom masterpiece, so keep your eye out for an extra crafty Motherland Easter egg.</description>
    </item>
    <item>
      <title>How &#8216;Cyberchase&#8217; keeps up</title>
      <link>https://www.fastcompany.com/91450169/cyberchase-pbs-ai-children-wnet</link>
      <pubDate>2025-12-23T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91450169/cyberchase-pbs-ai-children-wnet</guid>
      <description>The beloved kids television show is adapting to the age of streaming&#8212;and AI.
In the world of the long-running kids show Cyberchase, Motherboard, a sort of digital queen and literal technocrat, is the beneficent but impaired leader of all of cyberspace. She is&#8212;we are to understand&#8212;a legitimate ruler, yet faces constant attacks from the odious Hacker, a green-skinned android who dresses like a vampire and whose only goal is to sow chaos and eventually take control of Motherboard&#8217;s realm, which we might describe as something akin to a metaverse, or ever-expanding digital world....</description>
    </item>
    <item>
      <title>As health insurance costs rise, lawmakers remain undecided on who should pay for healthcare</title>
      <link>https://www.fastcompany.com/91463843/as-health-insurance-costs-rise-lawmakers-remain-undecided-on-who-should-pay-for-health-care</link>
      <pubDate>2025-12-23T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463843/as-health-insurance-costs-rise-lawmakers-remain-undecided-on-who-should-pay-for-health-care</guid>
      <description>Without finding resolution on this core issue, the U.S. will likely still be embroiled in the same debate for years.
December 15, 2025&#8212;the deadline for enrolling in a marketplace plan through the Affordable Care Act for 2026&#8212;came and went without an agreement on the federal subsidies that kept ACA plans more affordable for many Americans. Despite a last-ditch attempt in the House to extend ACA subsidies, with Congress adjourning for the year on December 19, it&#8217;s looking almost certain that Americans relying on ACA subsidies will face a steep increase in healthcare costs in 2026....</description>
    </item>
    <item>
      <title>What drives people to work during the holidays</title>
      <link>https://www.fastcompany.com/91463941/what-drives-people-to-work-during-the-holidays</link>
      <pubDate>2025-12-23T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463941/what-drives-people-to-work-during-the-holidays</guid>
      <description>There&#8217;s psychology behind why some sabotage their own work-life balance.
By the end of October, David, who works at a roughly 2,000-person finance firm in New York, already knew he&#8217;d be working during the holiday season this year. Usually at the office, he learned he&#8217;d at least get to work remotely between December 26 and January 1&#8212;with the way the financial calendar fell, it was inevitable that he couldn&#8217;t just disappear for clients (like institutional investors and family offices) during that time.&#160;...</description>
    </item>
    <item>
      <title>How will AI transform business in 2026?</title>
      <link>https://www.fastcompany.com/91464688/how-will-ai-transform-business-in-2026</link>
      <pubDate>2025-12-23T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464688/how-will-ai-transform-business-in-2026</guid>
      <description>AI scientist, entrepreneur, and &#8216;Pioneers of AI&#8217; podcast host Rana el Kaliouby shares her predictions for the year ahead.
How should leaders prepare for AI&#8217;s accelerating impact on work and everyday life? AI scientist, entrepreneur, and Pioneers of AI podcast host Rana el Kaliouby shares her predictions for the year ahead&#8212;from physical AI entering the real world to what it means to onboard AI into your org chart. El Kaliouby cuts through today&#8217;s biggest AI headlines, bringing to light the insights that will matter most in the months to come....</description>
    </item>
    <item>
      <title>&#171; L&#8217;ill&#233;gal qui devient payant ET compliqu&#233; &#187; : YGG provoque un scandale dans le milieu du piratage fran&#231;ais</title>
      <link>https://www.frandroid.com/culture-tech/web/2918897_lillegal-qui-devient-payant-et-complique-ygg-provoque-un-scandale-dans-le-milieu-du-piratage-francais</link>
      <pubDate>Tue, 23 Dec 2025 09:47:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/web/2918897_lillegal-qui-devient-payant-et-complique-ygg-provoque-un-scandale-dans-le-milieu-du-piratage-francais</guid>
      <description>
L'arriv&#233;e d'un mode Turbo modifiant le fonctionnement du site de piratage YGG Torrent provoque un scandale. Une partie des utilisateurs pr&#233;pare l'exode.
</description>
    </item>
    <item>
      <title>iOS 26.3 transforme vos &#233;couteurs Bluetooth en Airpods sur iPhone</title>
      <link>https://www.frandroid.com/marques/apple/2918901_ios-26-3-transforme-vos-ecouteurs-bluetooth-en-airpods-sur-iphone</link>
      <pubDate>Tue, 23 Dec 2025 09:45:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2918901_ios-26-3-transforme-vos-ecouteurs-bluetooth-en-airpods-sur-iphone</guid>
      <description>
Pour se mettre en conformit&#233; avec l'Union europ&#233;enne, Apple permet aux &#233;couteurs Bluetooth tiers de profiter de la m&#234;me connexion simplifi&#233;e que les Airpods.&#160;
</description>
    </item>
    <item>
      <title>&#171; &#28189;AD0001Z &#187; : pourquoi cette plaque d&#8217;immatriculation est importante pour le d&#233;veloppement des voitures autonomes</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2918913_%e6%b8%9dad0001z-pourquoi-cette-plaque-dimmatriculation-est-importante-pour-le-developpement-des-voitures-autonomes</link>
      <pubDate>Tue, 23 Dec 2025 09:39:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2918913_%e6%b8%9dad0001z-pourquoi-cette-plaque-dimmatriculation-est-importante-pour-le-developpement-des-voitures-autonomes</guid>
      <description>
C&#8217;est officiel, la Chine a remis la toute premi&#232;re plaque d&#8217;immatriculation &#224; une voiture autonome de niveau 3. Une grande premi&#232;re, qui marque une nouvelle &#233;tape dans le d&#233;veloppement de cette technologie.
</description>
    </item>
    <item>
      <title>Detecting AI-written text is challenging, even for&#160;AI. Here&#8217;s why</title>
      <link>https://www.fastcompany.com/91462947/ai-written-text-detection-verification</link>
      <pubDate>2025-12-23T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91462947/ai-written-text-detection-verification</guid>
      <description>AI text detection is part of an escalating arms race.
People and institutions are grappling with the consequences of AI-written text. Teachers want to know whether students&#8217; work reflects their own understanding; consumers want to know whether an advertisement was written by a human or a machine.</description>
    </item>
  </channel>
</rss>
