<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 12 Feb 2026 08:54:17 GMT</lastBuildDate>
    <item>
      <title>Apr&#232;s la chute de sa femme, il invente le v&#233;lo &#233;lectrique id&#233;al pour les s&#233;niors</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2973989_apres-la-chute-de-sa-femme-il-invente-le-velo-electrique-ideal-pour-les-seniors</link>
      <pubDate>Thu, 12 Feb 2026 08:49:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2973989_apres-la-chute-de-sa-femme-il-invente-le-velo-electrique-ideal-pour-les-seniors</guid>
      <description>
Id&#233;e du designer industriel Laurent Lamballais, l&#8217;Ad&#233;lid&#233;laa est un v&#233;lo &#233;lectrique dot&#233; d'une g&#233;om&#233;trie sp&#233;ciale et &#233;tudi&#233;e pour offrir une excellente stabilit&#233;, notamment pour rassurer les s&#233;niors.
</description>
    </item>
    <item>
      <title>Google Meet introduit une nouvelle option attendue de longue date par les utilisateurs</title>
      <link>https://www.01net.com/actualites/google-meet-introduit-une-nouvelle-option-attendue-de-longue-date-par-les-utilisateurs.html</link>
      <pubDate>Thu, 12 Feb 2026 08:38:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325546</guid>
      <description>Google est en train de d&#233;ployer une importante nouveaut&#233; dans Google Meet. L&#8217;application de visioconf&#233;rence va enfin permettre aux participants de d&#233;placer le contenu partag&#233; dans l&#8217;&#233;cran principal au sein d&#8217;une nouvelle fen&#234;tre.</description>
    </item>
    <item>
      <title>Temp&#234;te Nils&#160;: le kit de survie num&#233;rique pour ne pas finir coup&#233; du monde</title>
      <link>https://www.01net.com/actualites/tempete-nils-le-kit-de-survie-numerique-pour-ne-pas-finir-coupe-du-monde.html</link>
      <pubDate>Thu, 12 Feb 2026 08:38:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325534</guid>
      <description>La temp&#234;te Nils gronde et le risque de coupure &#233;lectrique est r&#233;el. Avant que tout ne saute, voici la check-list vitale pour garder votre smartphone en vie.</description>
    </item>
    <item>
      <title>Il veut prendre la place de votre TV : ce vid&#233;oprojecteur laser &#224; ultra courte focale 4K est en promo</title>
      <link>https://www.frandroid.com/bons-plans/2973469_il-veut-prendre-la-place-de-votre-tv-ce-videoprojecteur-laser-a-ultra-courte-focale-4k-est-en-promo</link>
      <pubDate>Thu, 12 Feb 2026 08:23:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2973469_il-veut-prendre-la-place-de-votre-tv-ce-videoprojecteur-laser-a-ultra-courte-focale-4k-est-en-promo</guid>
      <description>
Si vous aimez voir les choses en grand, le vid&#233;oprojecteur laser Hisense PX3 peut projeter une image 4K de 150 pouces pour 1 799 euros au lieu de 1 990 euros.
</description>
    </item>
    <item>
      <title>Alerte sur l&#8217;iPhone&#160;: Apple met en garde contre une cyberattaque &#171;&#160;extr&#234;mement sophistiqu&#233;e&#160;&#187;</title>
      <link>https://www.01net.com/actualites/faille-iphone-apple-met-garde-contre-cyberattaque-extremement-sophistiquee.html</link>
      <pubDate>Thu, 12 Feb 2026 08:16:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325531</guid>
      <description>Une faille de s&#233;curit&#233; zero day a &#233;t&#233; d&#233;couverte sur l'iPhone. D&#233;busqu&#233;e par Google, la vuln&#233;rabilit&#233; est exploit&#233;e dans le cadre d'une cyberattaque visant des utilisateurs Apple. La firme parle d&#8217;attaque &#171; extr&#234;mement sophistiqu&#233;e &#187; et pousse en urgence une mise &#224; jour de s&#233;curit&#233; sur les smartphones concern&#233;s.</description>
    </item>
    <item>
      <title>The best budgeting apps for 2026</title>
      <link>https://www.engadget.com/apps/best-budgeting-apps-120036303.html?src=rss</link>
      <pubDate>Thu, 12 Feb 2026 08:01:26 +0000</pubDate>
      <guid isPermaLink="false">1bf1c17b-7ece-4b18-b17b-dc7b5e70f411</guid>
      <description>As a former Mint user, I had to find a new budgeting app not too long ago. Intuit, parent company of Mint, shut down the service in March 2024, and prompted users to transition to its other financial app, Credit Karma. However, after testing Credit Karma myself, I found it to be a poor Mint replacement &#8212; that meant I needed to branch out and look elsewhere for a trusted app to track all of my financial accounts, monitor my credit score, follow a monthly spending plan and set goals like building a rainy-day fund and paying down my mortgage faster.I tried out Mint's top competitors in the hopes ...</description>
    </item>
    <item>
      <title>How to Get to Heaven from Belfast review: Derry Girls creator is 2 for 2 as new Netflix show pairs Irish wit with unhinged trauma &#8212; and it works</title>
      <link>https://www.techradar.com/streaming/netflix/how-to-get-to-heaven-from-belfast-review</link>
      <pubDate>Thu, 12 Feb 2026 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">Z57kpKrjjkp9rehF8hGguD</guid>
      <description>How to Get to Heaven from Belfast has all the Derry Girls Easter eggs you could possibly want, only its Irish charm comes with a dark side.</description>
    </item>
    <item>
      <title>Claude just made its most powerful tools free &#8212; from file creation to app integration, all without ads</title>
      <link>https://www.techradar.com/ai-platforms-assistants/claude/claude-just-made-its-most-powerful-tools-free-from-file-creation-to-app-integration-all-without-ads</link>
      <pubDate>Thu, 12 Feb 2026 07:46:53 +0000</pubDate>
      <guid isPermaLink="false">BUjVsGA8UzLjbiGMWrvbP7</guid>
      <description>Anthropic has expanded Claude&#8217;s free tier with powerful file-creation tools, app integrations and customizable Skills.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs robots piscine en 2026 ? Notre s&#233;lection</title>
      <link>https://www.frandroid.com/guide-dachat/1715897_les-meilleurs-robots-piscine-avec-ou-sans-fil-notre-selection</link>
      <pubDate>Thu, 12 Feb 2026 07:46:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1715897_les-meilleurs-robots-piscine-avec-ou-sans-fil-notre-selection</guid>
      <description>
Votre piscine doit &#234;tre nettoy&#233;e et entretenue r&#233;guli&#232;rement, en &#233;t&#233; comme hors saison : pour cela, le robot piscine est indispensable. Bienvenue sur notre s&#233;lection des meilleurs robots piscine.
</description>
    </item>
    <item>
      <title>Windows 11 : une faille critique dans le Bloc-notes corrig&#233;e par la derni&#232;re mise &#224; jour</title>
      <link>https://www.frandroid.com/marques/microsoft/2974471_windows-11-une-faille-critique-dans-le-bloc-notes-corrigee-par-la-derniere-mise-a-jour</link>
      <pubDate>Thu, 12 Feb 2026 07:36:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2974471_windows-11-une-faille-critique-dans-le-bloc-notes-corrigee-par-la-derniere-mise-a-jour</guid>
      <description>
Les r&#233;cents efforts de modernisation du Bloc-notes par Microsoft ont provoqu&#233; une faille de s&#233;curit&#233; critique qui vient heureusement d'&#234;tre corrig&#233;e.
</description>
    </item>
    <item>
      <title>Cyberattaque contre Darty&#160;: les donn&#233;es de 80&#160;000 clients ont &#233;t&#233; pirat&#233;es</title>
      <link>https://www.01net.com/actualites/cyberattaque-contre-darty-donnees-80-000-clients-piratees.html</link>
      <pubDate>Thu, 12 Feb 2026 07:28:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325527</guid>
      <description>Darty vient de reconna&#238;tre une nouvelle fuite de donn&#233;es. Apr&#232;s la cyberattaque visant l&#8217;un de ses prestataires, les informations personnelles d&#8217;environ 80&#8239;000 clients ont &#233;t&#233; compromises. Noms, adresses, coordonn&#233;es et d&#233;tails pr&#233;cis sur les projets de cuisine des acheteurs ont &#233;t&#233; exfiltr&#233;s&#8230; de quoi alimenter des campagnes de phishing ultra&#8209;cibl&#233;es....</description>
    </item>
    <item>
      <title>Apple gal&#232;re encore et toujours avec le nouveau Siri&#160;: vers une sortie en septembre prochain&#8201;?</title>
      <link>https://www.frandroid.com/marques/apple/2974479_apple-galere-encore-et-toujours-avec-le-nouveau-siri-vers-une-sortie-en-septembre-prochain</link>
      <pubDate>Thu, 12 Feb 2026 07:21:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2974479_apple-galere-encore-et-toujours-avec-le-nouveau-siri-vers-une-sortie-en-septembre-prochain</guid>
      <description>
Alors que la plupart des rumeurs s&#8217;accordaient &#224; dire que le Siri boost&#233; &#224; l&#8217;IA arriverait d&#232;s le mois prochain, il semblerait que des petits soucis en interne aient forc&#233; Apple &#224; retarder de nouveau la sortie de l&#8217;outil.
</description>
    </item>
    <item>
      <title>Adieu Visa, Mastercard et PayPal ? Wero devient un poids lourd europ&#233;en avec ce changement</title>
      <link>https://www.frandroid.com/services/banque-en-ligne/2974473_adieu-visa-mastercard-et-paypal-wero-devient-un-poids-lourd-europeen-avec-ce-changement</link>
      <pubDate>Thu, 12 Feb 2026 07:14:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/banque-en-ligne/2974473_adieu-visa-mastercard-et-paypal-wero-devient-un-poids-lourd-europeen-avec-ce-changement</guid>
      <description>
Vous ne vous en rendez pas compte, mais chaque fois que vous payez votre caf&#233; avec votre smartphone, vos donn&#233;es font un aller-retour par les &#201;tats-Unis. Christine Lagarde veut que &#231;a s'arr&#234;te. Avec l'extension de Wero &#224; 13 pays, l'Europe continue d'&#233;tendre son offensive contre l'h&#233;g&#233;monie de Visa, Mastercard et PayPal.
</description>
    </item>
    <item>
      <title>Coriolis se la joue Relax avec son forfait 5G 120 Go sans engagement &#224; 6,99 &#8364;/mois qui &#233;crase la concurrence</title>
      <link>https://www.frandroid.com/bons-plans/2974025_coriolis-se-la-joue-relax-avec-son-forfait-5g-120-go-sans-engagement-a-699-e-mois-qui-ecrase-la-concurrence</link>
      <pubDate>Thu, 12 Feb 2026 07:14:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2974025_coriolis-se-la-joue-relax-avec-son-forfait-5g-120-go-sans-engagement-a-699-e-mois-qui-ecrase-la-concurrence</guid>
      <description>
Coriolis n'est pas le MVNO le plus connu, mais il gagne &#224; l'&#234;tre, notamment avec ce forfait Relax 120 Go 5G &#224; 6,99 euros par mois, tout &#231;a sans engagement.
</description>
    </item>
    <item>
      <title>T-Mobile traduit les coups de fil en direct, sans application ni nouveau smartphone</title>
      <link>https://www.01net.com/actualites/t-mobile-traduit-les-coups-de-fil-en-direct-sans-application-ni-nouveau-smartphone.html</link>
      <pubDate>Thu, 12 Feb 2026 07:03:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325510</guid>
      <description>La traduction en temps r&#233;el est devenue une fonction basique, disponible au travers de nombreuses applications mobiles et m&#234;me ench&#226;ss&#233;e au niveau des syst&#232;mes d'exploitation. L'op&#233;rateur am&#233;ricain T-Mobile va un cran plus loin en proposant de traduire un appel en direct, le tout r&#233;alis&#233; directement par le r&#233;seau.</description>
    </item>
    <item>
      <title>Why most AI rollouts fail</title>
      <link>https://www.fastcompany.com/91476333/why-most-ai-implementations-fail</link>
      <pubDate>2026-02-12T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91476333/why-most-ai-implementations-fail</guid>
      <description>Many companies treat AI as another IT rollout, but successfully scaling AI across an organization requires a different approach.
Artificial intelligence has shifted from an experiment to an expectation. Boards push CEOs about ROI. CEOs launch enterprise rollouts. Leaders invest in tools, platforms, and governance. Yet adoption still stalls. Work-arounds spread. Risk grows. Value lags....</description>
    </item>
    <item>
      <title>NYT Pips hints, answers for February 12, 2026</title>
      <link>https://mashable.com/article/pips-nyt-games-hints-answers-easy-medium-hard-february-12-2026</link>
      <pubDate>Thu, 12 Feb 2026 06:59:12 +0000</pubDate>
      <guid isPermaLink="false">027suZBBIdQZJlvnoEQMSwK</guid>
      <description>The New York Times' latest game, Pips, brings domino fun to your desktop. How to play Pips as well as hints in case you get stuck.</description>
    </item>
  </channel>
</rss>
