<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 12 Jan 2026 17:27:30 GMT</lastBuildDate>
    <item>
      <title>Can a Brain-Sensing Gaming Headset Finally Make Me a Pro Player?</title>
      <link>https://gizmodo.com/neurable-hyperx-brain-sensing-gaming-headset-make-me-a-pro-player-2000709099</link>
      <pubDate>Mon, 12 Jan 2026 17:20:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000709099</guid>
      <description>I tried out Neurable and HyperX's new EEG gaming headset to become the best esports player I never wanted to be.</description>
    </item>
    <item>
      <title>Universal Commerce Protocol : retenez ce standard Google, car c&#8217;est la fin du shopping en ligne &#224; l&#8217;ancienne</title>
      <link>https://www.frandroid.com/marques/google/2939731_universal-commerce-protocol-retenez-ce-standard-google-car-cest-la-fin-du-shopping-en-ligne-a-lancienne</link>
      <pubDate>Mon, 12 Jan 2026 17:20:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2939731_universal-commerce-protocol-retenez-ce-standard-google-car-cest-la-fin-du-shopping-en-ligne-a-lancienne</guid>
      <description>
Alors qu'OpenAI pousse son propre standard, Google r&#233;plique avec une force de frappe massive : l'int&#233;gration native de boutons d'achat dans Gemini et la Recherche. Google vient de d&#233;gainer l'Universal Commerce Protocol (UCP).
</description>
    </item>
    <item>
      <title>Paramount sues after Warner Bros. Discovery rejects its latest deal</title>
      <link>https://www.theverge.com/news/860664/paramount-warner-bros-discovery-lawsuit-netflix-merger</link>
      <pubDate>2026-01-12T12:19:34-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=860664</guid>
      <description>Paramount is turning up the pressure on Warner Bros. Discovery in the wake of its merger with Netflix, as it's now suing the David Zaslav-helmed company in an attempt to get more details surrounding the agreement. In addition to the lawsuit, Paramount CEO David Ellison revealed that the company plans to nominate directors to WBD's [&#8230;]</description>
    </item>
    <item>
      <title>Iranians offline for over 90 hours as digital blackout continues for fifth day &#8211; here's everything we know</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/iranians-offline-for-over-90-hours-as-digital-blackout-continues-for-fifth-day-heres-everything-we-know</link>
      <pubDate>Mon, 12 Jan 2026 17:15:15 +0000</pubDate>
      <guid isPermaLink="false">oEUu8z2kyc9UN8LL3GYabn</guid>
      <description>Over 90 million people in Iran have been prevented from staying in touch and accessing news since Thursday as the wave of protests intensifies.</description>
    </item>
    <item>
      <title>Google&#8217;s Gemini to power Apple&#8217;s AI features like Siri</title>
      <link>https://techcrunch.com/2026/01/12/googles-gemini-to-power-apples-ai-features-like-siri/</link>
      <pubDate>Mon, 12 Jan 2026 17:12:41 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3081878</guid>
      <description>Apple and Google have embarked on a non-exclusive, multi-year partnership that will involve Apple using Gemini models and Google cloud technology for future foundational models.</description>
    </item>
    <item>
      <title>Hacking hub BreachForums hit by data breach - 324,000 accounts exposed</title>
      <link>https://www.techradar.com/pro/security/hacking-hub-breachforums-hit-by-data-breach-324-000-accounts-exposed</link>
      <pubDate>Mon, 12 Jan 2026 17:10:00 +0000</pubDate>
      <guid isPermaLink="false">jHhrJrz4WBF3T8W6ac9gE</guid>
      <description>Names and IP addresses of BreachForums users leaked - but most cannot be used.</description>
    </item>
    <item>
      <title>This $14 DJI accessory is a vlogging and action cam essential &#8211; here's why</title>
      <link>https://www.techradar.com/cameras/camera-accessories/this-usd14-dji-accessory-is-a-vlogging-and-action-cam-essential-heres-why</link>
      <pubDate>Mon, 12 Jan 2026 17:10:00 +0000</pubDate>
      <guid isPermaLink="false">nytJromsm58xLFhZ6TjQEf</guid>
      <description>The cheap DJI Mic Series Mobile Receiver is a must-buy for levelling up audio quality vlogging with a phone</description>
    </item>
    <item>
      <title>&#8216;This is a very robust computer&#8230; but it&#8217;s very, very tiny&#8217; &#8212; it&#8217;s been 21 years since Steve Jobs revealed the Mac mini, and it&#8217;s now the only PC worth buying</title>
      <link>https://www.techradar.com/computing/macs/this-is-a-very-robust-computer-but-its-very-very-tiny-its-been-21-years-since-steve-jobs-revealed-the-mac-mini-and-its-now-the-only-pc-worth-buying</link>
      <pubDate>Mon, 12 Jan 2026 17:09:19 +0000</pubDate>
      <guid isPermaLink="false">6qi3dMMFadXMLTy5ZiaXoX</guid>
      <description>&#8216;We supply the computer, you supply the rest&#8217; &#8211; why 21 years after Steve Jobs announced the Mac mini it&#8217;s still giving Microsoft nightmares</description>
    </item>
    <item>
      <title>'No company can stop nude AI images &#8211; but we&#8217;re the only ones being honest about it' &#8212; British AI rival to ChatGPT bans under-18s and refuses image generation over safety concerns</title>
      <link>https://www.techradar.com/ai-platforms-assistants/no-company-can-stop-nude-ai-images-but-were-the-only-ones-being-honest-about-it-british-ai-rival-to-chatgpt-bans-under-18s-and-refuses-image-generation-over-safety-concerns</link>
      <pubDate>Mon, 12 Jan 2026 17:09:13 +0000</pubDate>
      <guid isPermaLink="false">8EevPiaC4FNHxKjASFrAic</guid>
      <description>A UK AI rival to ChatGPT warns that nude image generation can&#8217;t be made safe as Elon Musk&#8217;s Grok faces regulatory backlash over sexualized AI images.</description>
    </item>
    <item>
      <title>Meta wipes over 500,000 Australian teen accounts in a single week &#8211; but says world-first social media crackdown is failing</title>
      <link>https://www.techradar.com/computing/social-media/meta-wipes-over-500-000-australian-teen-accounts-in-a-single-week-but-says-world-first-social-media-crackdown-is-failing</link>
      <pubDate>Mon, 12 Jan 2026 17:06:42 +0000</pubDate>
      <guid isPermaLink="false">cTGYoncdh9sd6WiS634DmR</guid>
      <description>We're a month into the social media ban in Australia, and Meta is reluctantly complying with it.</description>
    </item>
    <item>
      <title>Paramount files lawsuit against Warner Bros. amidst controversial Netflix merger</title>
      <link>https://techcrunch.com/2026/01/12/paramount-files-lawsuit-against-warner-bros-amidst-controversial-netflix-merger/</link>
      <pubDate>Mon, 12 Jan 2026 17:06:12 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3081875</guid>
      <description>Paramount has filed a lawsuit against Warner Bros. Discovery, demanding greater financial disclosure regarding Netflix's $82.7 billion acquisition.</description>
    </item>
    <item>
      <title>Les SoundSticks 5 et l&#8217;Aura Studio 5 passent au Wi-Fi, voici ce que cela change</title>
      <link>https://www.frandroid.com/marques/harman-kardon/2939959_les-soundsticks-5-et-laura-studio-5-passent-au-wi-fi-voici-ce-que-cela-change</link>
      <pubDate>Mon, 12 Jan 2026 17:05:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/harman-kardon/2939959_les-soundsticks-5-et-laura-studio-5-passent-au-wi-fi-voici-ce-que-cela-change</guid>
      <description>
Harman Kardon a profit&#233; du CES 2026 pour lancer deux versions Wi-Fi de ses enceintes embl&#233;matiques, les SoundSticks 5 Wi-Fi et l&#8217;Aura Studio 5 Wi-Fi. L&#8217;id&#233;e est de proposer des alternatives aux mod&#232;les Bluetooth existants en ajoutant une connectivit&#233; r&#233;seau &#233;tendue.
</description>
    </item>
    <item>
      <title>Les 10 smartphones les plus populaires de la semaine sur Frandroid : les nouveaux smartphones Android font leur entr&#233;e</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2491986_les-10-smartphones-les-plus-populaires-de-la-semaine-sur-frandroid-les-nouveaux-smartphones-android-font-leur-entree</link>
      <pubDate>Mon, 12 Jan 2026 17:03:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2491986_les-10-smartphones-les-plus-populaires-de-la-semaine-sur-frandroid-les-nouveaux-smartphones-android-font-leur-entree</guid>
      <description>
Pour notre top 10 des smartphones les plus populaires de la semaine sur Frandroid, les appareils sous Android rebattent les cartes. Xiaomi, OnePlus et Honor viennent titiller Samsung.
</description>
    </item>
    <item>
      <title>Apple's Siri AI will be powered by Gemini</title>
      <link>https://www.engadget.com/ai/apples-siri-ai-will-be-powered-by-gemini-153636649.html?src=rss</link>
      <pubDate>Mon, 12 Jan 2026 17:03:13 +0000</pubDate>
      <guid isPermaLink="false">0c137b86-3266-40ef-84b5-5072d6f289af</guid>
      <description>Apple and Google have confirmed reports that it will use Google Gemini&#8217;s models to help it power the new version of Siri and other generative AI features. CNBC first reported the news;  Apple and Google subsequently released a joint statement which reads:&#8220;Apple and Google have entered into a multi-year collaboration under which the next generation of Apple Foundation Models will be based on Google's Gemini models and cloud technology. These models will help power future Apple Intelligence features, including a more personalized Siri coming this year.After careful evaluation, Apple determined t...</description>
    </item>
    <item>
      <title>&#8216;Lee Cronin&#8217;s The Mummy&#8217; Takes the Monster Franchise In a Creepy New Direction</title>
      <link>https://gizmodo.com/lee-cronin-mummy-trailer-2000709135</link>
      <pubDate>Mon, 12 Jan 2026 17:00:50 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000709135</guid>
      <description>From producer James Wan and Jason Blum comes a new vision of the Universal Monster</description>
    </item>
    <item>
      <title>Winter Olympics Free Streams: How to watch Milano Cortina 2026 from anywhere in the world, schedule, preview</title>
      <link>https://www.techradar.com/how-to-watch/sport/winter-olympics-2026-live-stream-milano-cortina-2026</link>
      <pubDate>Mon, 12 Jan 2026 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">LmPVNa8dMDsmABLPjijQ7N</guid>
      <description>All the ways to watch Winter Olympics 2026 live streams online from anywhere for FREE, as Milano Cortina in north Italy hosts the biggest deal in winter sport.</description>
    </item>
    <item>
      <title>La F&#233;d&#233;ration Fran&#231;aise de Tennis (FFT) victime d&#8217;un cyberattaque, les donn&#233;es de milliers de licenci&#233;s sont dans la nature</title>
      <link>https://www.01net.com/actualites/la-federation-francaise-de-tennis-fft-victime-dun-cyberattaque-les-donnees-de-milliers-de-licencies-sont-dans-la-nature.html</link>
      <pubDate>Mon, 12 Jan 2026 16:59:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319553</guid>
      <description>Une cyberattaque a touch&#233; les syst&#232;mes informatiques de la F&#233;d&#233;ration Fran&#231;aise de Tennis. Les donn&#233;es personnelles des adh&#233;rents ont &#233;t&#233; d&#233;rob&#233;es.</description>
    </item>
    <item>
      <title>DJI&#8217;s mobile selfie stick / tripod / stabilizer will track you automatically for its lowest price of $103</title>
      <link>https://www.theverge.com/gadgets/860590/dji-mobile-7p-gimbal-stabilizer-anker-341-usb-power-strip-deal-sale</link>
      <pubDate>2026-01-12T11:53:39-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=860590</guid>
      <description>If you&#8217;ve got a recent smartphone, chances are it&#8217;s got a really good camera &#8212; and don&#8217;t you want to take the best photos you can? One way to do that is via the DJI Osmo Mobile 7P Gimbal Stabilizer, a selfie stick that includes a tripod, a telescoping arm, and (perhaps best of all) [&#8230;]</description>
    </item>
    <item>
      <title>The Nikon Z6 III is now $700 cheaper than the Sony A7 V and Canon EOS R6 Mark III with this record-breaking deal</title>
      <link>https://www.techradar.com/cameras/mirrorless-cameras/the-nikon-z6-iii-is-now-usd700-cheaper-than-the-sony-a7-v-and-canon-eos-r6-mark-iii-with-this-record-breaking-deal</link>
      <pubDate>Mon, 12 Jan 2026 16:53:33 +0000</pubDate>
      <guid isPermaLink="false">S8HJqnt3hYFfxJ2XkH92tU</guid>
      <description>The Nikon Z6 III returns to a record-low price at Adorama</description>
    </item>
    <item>
      <title>Fnac et Darty vendent au rabais de nombreux produits Tech lors des soldes d&#8217;hiver 2026</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-vendent-au-rabais-de-nombreux-produits-tech-lors-des-soldes-dhiver-2026</link>
      <pubDate>Mon, 12 Jan 2026 16:50:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-vendent-au-rabais-de-nombreux-produits-tech-lors-des-soldes-dhiver-2026</guid>
      <description>
Fnac et Darty n'h&#233;sitent pas &#224; brader de nombreux produits Tech pendant les soldes d'hiver 2026. Les deux enseignes pratiquent des prix bien bas sur des produits populaires. Pour vous y retrouver, voici les offres qui valent r&#233;ellement le coup. 
</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : voici les meilleures offres en DIRECT avant la fin de la premi&#232;re d&#233;marque</title>
      <link>https://www.frandroid.com/bons-plans/2931731_soldes-dhiver-2026-voici-les-meilleures-offres-en-direct-avant-la-fin-de-la-premiere-demarque</link>
      <pubDate>Mon, 12 Jan 2026 16:49:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931731_soldes-dhiver-2026-voici-les-meilleures-offres-en-direct-avant-la-fin-de-la-premiere-demarque</guid>
      <description>
Les soldes d'hiver 2026 ont d&#233;but&#233; la semaine derni&#232;re et les offres continuent de tomber sur Amazon, Fnac, Darty ou encore Cdiscount et Boulanger. Smartphones, PC portables, t&#233;l&#233;viseurs, tablettes ou encore casques et &#233;couteurs sans fil&#8230; Voici les meilleures offres Tech s&#233;lectionn&#233;es par la r&#233;daction pour l'occasion.
</description>
    </item>
    <item>
      <title>ExpressVPN deal: Two-year plans are up to 78 percent off</title>
      <link>https://www.engadget.com/deals/expressvpn-deal-two-year-plans-are-up-to-78-percent-off-180602243.html?src=rss</link>
      <pubDate>Mon, 12 Jan 2026 16:45:35 +0000</pubDate>
      <guid isPermaLink="false">ad6bc22c-2c6b-4ec4-832c-d6d9af119838</guid>
      <description>If you're looking to up your privacy game on the internet in the new year, you can do so for a little less than usual thanks to ExpressVPN's latest deal. Its two-year plans are up to 78 percent off right now: the Advanced tier is on sale for $101 for two years, plus four additional free months. That works out to $3.59 per month during the promotional period.
We&#8217;ve consistently liked ExpressVPN because it&#8217;s fast, easy to use and widely available across a large global server network. In fact, it's our current pick for best premium VPN. One of the biggest drawbacks has always been its high cost, ...</description>
    </item>
    <item>
      <title>Le Samsung Galaxy S25 FE profite des soldes d&#8217;hiver pour s&#8217;afficher &#224; un super prix</title>
      <link>https://www.frandroid.com/bons-plans/2850197_le-samsung-galaxy-s25-fe-profite-des-soldes-dhiver-pour-safficher-a-un-super-prix</link>
      <pubDate>Mon, 12 Jan 2026 16:45:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850197_le-samsung-galaxy-s25-fe-profite-des-soldes-dhiver-pour-safficher-a-un-super-prix</guid>
      <description>
Lanc&#233; en fin d'ann&#233;e derni&#232;re, le Samsung Galaxy S25 FE profite actuellement des soldes d'hiver pour se faire brader : 529 euros au lieu de 749 euros chez Boulanger, via reprise. Il y a aussi un pack tr&#232;s int&#233;ressant, avec une Galaxy Fit 3 offerte.
</description>
    </item>
    <item>
      <title>Amazon lance une vague de promotions juste avant la 2e d&#233;marque des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2933045_amazon-lance-une-vague-de-promotions-juste-avant-la-2e-demarque-des-soldes</link>
      <pubDate>Mon, 12 Jan 2026 16:44:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933045_amazon-lance-une-vague-de-promotions-juste-avant-la-2e-demarque-des-soldes</guid>
      <description>
Les soldes d&#8217;hiver battent leur plein et, m&#234;me si Amazon n'indique pas clairement sa participation, le g&#233;ant am&#233;ricain continue de brader un tas de produits Tech alors que la deuxi&#232;me d&#233;marque approche. C&#8217;est le moment id&#233;al pour en profiter et bien lancer l&#8217;ann&#233;e 2026.
</description>
    </item>
    <item>
      <title>Rhea Seehorn won her first Golden Globe for Pluribus &#8211; but she should have won it for this Netflix show instead</title>
      <link>https://www.techradar.com/streaming/apple-tv-plus/rhea-seehorn-won-her-first-golden-globe-for-pluribus-but-she-should-have-won-it-for-this-netflix-show-instead</link>
      <pubDate>Mon, 12 Jan 2026 16:44:22 +0000</pubDate>
      <guid isPermaLink="false">BhLHudKb6KEdJ2crTMEN5e</guid>
      <description>Rhea Seehorn won her first Golden Globe in 2026, but it should've happened a lot sooner.</description>
    </item>
    <item>
      <title>DS a fait n&#8217;importe quoi avec sa derni&#232;re voiture &#233;lectrique, et &#231;a m&#8217;a plu</title>
      <link>https://www.frandroid.com/marques/ds-automobiles/2939593_ds-a-fait-nimporte-quoi-avec-sa-derniere-voiture-electrique-et-ca-ma-plu</link>
      <pubDate>Mon, 12 Jan 2026 16:43:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/ds-automobiles/2939593_ds-a-fait-nimporte-quoi-avec-sa-derniere-voiture-electrique-et-ca-ma-plu</guid>
      <description>
Pour soutenir le lancement de sa derni&#232;re voiture &#233;lectrique et capitaliser sur sa participation au championnat de Formula E, DS a pr&#233;sent&#233; le concept &#171; Taylor made N&#176;4&#160;Concept &#187;, vision r&#234;v&#233;e de la N&#176;4 E-Tense par un des pilotes de l'&#233;curie. Un concept aussi d&#233;lirant que sans lendemain, mais qui nous a plu.
</description>
    </item>
    <item>
      <title>En 2000, la puissance de la PlayStation 2 faisait peur &#224; l&#8217;arm&#233;e am&#233;ricaine</title>
      <link>https://www.frandroid.com/marques/sony/2939405_en-2000-la-puissance-de-la-playstation-2-faisait-peur-a-larmee-americaine</link>
      <pubDate>Mon, 12 Jan 2026 16:42:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2939405_en-2000-la-puissance-de-la-playstation-2-faisait-peur-a-larmee-americaine</guid>
      <description>
Le cr&#233;ateur des &#233;v&#233;nements de Final Fantasy 9 r&#233;v&#232;le qu'il a eu un mal fou &#224; recevoir une PS2 pendant le d&#233;veloppement du jeu.
</description>
    </item>
    <item>
      <title>Just Days From SLS Rollout, Here&#8217;s the Latest Update for NASA&#8217;s Artemis 2 Mission</title>
      <link>https://gizmodo.com/just-days-from-sls-rollout-heres-the-latest-update-for-nasas-artemis-2-mission-2000709107</link>
      <pubDate>Mon, 12 Jan 2026 16:40:38 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000709107</guid>
      <description>With launch potentially just three weeks away, the agency is working tirelessly to get the SLS rocket, Orion spacecraft, and the Artemis 2 crew ready for liftoff.</description>
    </item>
    <item>
      <title>C&#8217;est officiel, Apple s&#8217;incline devant la force de Gemini et signe un contrat juteux avec Google</title>
      <link>https://www.frandroid.com/marques/apple/2939807_cest-officiel-apple-sincline-devant-la-force-de-gemini-et-signe-un-contrat-juteux-avec-google</link>
      <pubDate>Mon, 12 Jan 2026 16:38:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2939807_cest-officiel-apple-sincline-devant-la-force-de-gemini-et-signe-un-contrat-juteux-avec-google</guid>
      <description>
Apple confirme que la prochaine version de Siri sera aliment&#233;e par Google Gemini.
</description>
    </item>
    <item>
      <title>The iPhone 17e could arrive soon, but I'm not convinced it'll be worth buying</title>
      <link>https://www.techradar.com/phones/iphone/the-iphone-17e-could-arrive-soon-but-im-not-convinced-itll-be-worth-buying</link>
      <pubDate>Mon, 12 Jan 2026 16:38:21 +0000</pubDate>
      <guid isPermaLink="false">SXuiZDkjs3VBwfbFFVvLDd</guid>
      <description>The iPhone SE was never a yearly release, instead getting a refresh every few years &#8211; the rumored iPhone 17e could see Apple change this pattern, but should it even bother?</description>
    </item>
    <item>
      <title>Leonardo DiCaprios animated Golden Globes side conversation is the nights biggest mystery</title>
      <link>https://mashable.com/article/leonardo-dicaprio-golden-globes-viral-conversation-mystery</link>
      <pubDate>Mon, 12 Jan 2026 16:38:18 +0000</pubDate>
      <guid isPermaLink="false">05xbh09Z36Wsqg9fSraDVMc</guid>
      <description>An off-stage Golden Globes clip of Leonardo DiCaprio gesturing animatedly has sparked lip-reading theories, internet speculation, and a whole new meme.</description>
    </item>
    <item>
      <title>Meta se plie aux ordres de l&#8217;Italie, forc&#233; d&#8217;accepter les concurrents de &#171;&#160;Meta AI&#160;&#187; sur WhatsApp</title>
      <link>https://www.01net.com/actualites/en-italie-meta-contraint-daccepter-les-concurrents-de-son-outil-dia-meta-ai-sur-whatsapp.html</link>
      <pubDate>Mon, 12 Jan 2026 16:35:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317167</guid>
      <description>Sur WhatsApp, la seule fonctionnalit&#233; d'intelligence artificielle (IA) disponible est l'outil d'IA maison de Meta, &#171;&#160;Meta IA &#187; : les syst&#232;mes concurrents ne peuvent pas avoir acc&#232;s &#224; la plateforme. Face &#224; cette exclusion, l'autorit&#233; de la concurrence italienne, qui a ouvert une enqu&#234;te sur le sujet en juillet dernier, a d&#233;cid&#233;, mercredi 24 d&#233;cembre et &#224; titre provisoire, de contraindre Meta &#224; ouvrir la porte &#224; ses rivaux. Une porte que le groupe am&#233;ricain a bien ouvert, apprend-on ce lundi 12 janvier, mais seulement pour l'Italie....</description>
    </item>
    <item>
      <title>A New Jersey lawsuit shows how hard it is to fight deepfake porn</title>
      <link>https://techcrunch.com/2026/01/12/a-new-jersey-lawsuit-shows-how-hard-it-is-to-fight-deepfake-porn/</link>
      <pubDate>Mon, 12 Jan 2026 16:34:53 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3081841</guid>
      <description>For more than two years, an app called ClothOff has been terrorizing young women online &#8212; and it&#8217;s been maddeningly difficult to stop. The app has been taken down from the two major app stores and it&#8217;s banned from most social platforms, but it&#8217;s still available on the web and through a Telegram bot. In [&#8230;]</description>
    </item>
    <item>
      <title>Avec ses AI Overviews, Google joue avec la sant&#233; des internautes</title>
      <link>https://www.01net.com/actualites/avec-ses-ai-overviews-google-joue-avec-la-sante-des-internautes.html</link>
      <pubDate>Mon, 12 Jan 2026 16:30:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319539</guid>
      <description>Les AI Overviews de Google ne sont pas toujours de bon conseil. En particulier quand il s'agit de r&#233;pondre &#224; des questions d'ordre m&#233;dical. Le g&#233;ant du web a retir&#233; plusieurs r&#233;ponses jug&#233;es dangereuses, mais il reste encore beaucoup de travail et de questions autour de la probl&#233;matique de la sant&#233; par l'IA.</description>
    </item>
    <item>
      <title>Good news Copilot haters - some of you will finally be able to disable the AI tool on your work device at last</title>
      <link>https://www.techradar.com/pro/good-news-copilot-haters-some-of-you-will-be-able-to-disable-the-ai-tool-on-your-work-device-at-last</link>
      <pubDate>Mon, 12 Jan 2026 16:30:00 +0000</pubDate>
      <guid isPermaLink="false">j7JE7ry6z49aot9yfjEFwU</guid>
      <description>Admins can now remove the free Copilot app, but only if they're a paying M365 Copilot customer...and it can still be reinstalled anyway.</description>
    </item>
    <item>
      <title>How this psychologist teaches Olympic athletes to approach success and failure</title>
      <link>https://www.fastcompany.com/91472941/how-psychologist-teaches-olympic-athletes-approach-success-failure</link>
      <pubDate>2026-01-12T16:23:47</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91472941/how-psychologist-teaches-olympic-athletes-approach-success-failure</guid>
      <description>Emily Clark, a psychologist with the U.S. Olympic Committee, shares tips on how to stay on task under pressure.
If winning gold medals were the only standard, almost all Olympic athletes would be considered failures.A clinical psychologist with the United States Olympic and Paralympic Committee, Emily Clark&#8217;s job when the Winter Games open in Italy on Feb. 6 is to help athletes interpret what it means to be successful....</description>
    </item>
    <item>
      <title>J&#8217;ai vu la Rolls Royce des nouveaux PC ultraportable chez MSI</title>
      <link>https://www.frandroid.com/marques/msi/2939525_jai-vu-la-rolls-royce-des-nouveaux-pc-ultraportable-chez-msi</link>
      <pubDate>Mon, 12 Jan 2026 16:17:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/msi/2939525_jai-vu-la-rolls-royce-des-nouveaux-pc-ultraportable-chez-msi</guid>
      <description>
MSI a profit&#233; du CES 2026 pour insister sur sa nouvelle identit&#233; Prestige. Non, le constructeur ne fait pas que des produits orient&#233;s jeux vid&#233;o. Le MSI Prestige 13 AI est l'une des stars du salon.
</description>
    </item>
    <item>
      <title>Amazon has started automatically upgrading Prime members to Alexa Plus</title>
      <link>https://www.theverge.com/news/860581/amazon-prime-alexa-plus-automatic-upgrade</link>
      <pubDate>2026-01-12T11:17:36-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=860581</guid>
      <description>Over the past couple of weeks, users on the r/alexa subreddit have reported getting automatically upgraded to Alexa Plus as a perk for their Prime memberships. The update doesn't appear to be opt-in, but there's an option to roll it back. Screenshots of a message from Amazon sent to users state that, "After your device [&#8230;]</description>
    </item>
    <item>
      <title>The DJI Mic 2 just hit its lowest price ever at Amazon</title>
      <link>https://mashable.com/article/jan-12-dji-mic-deal</link>
      <pubDate>Mon, 12 Jan 2026 16:17:26 +0000</pubDate>
      <guid isPermaLink="false">01j94Uf31BZ2mgy9hI0JLX3</guid>
      <description>Get the new DJI Mic 3 wireless microphone bundle for $259 at Amazon. Features 32-bit float recording and 28 hours of battery life.</description>
    </item>
    <item>
      <title>I've picked 20 stunning yet practical home office accessories and stationery essentials for true blue lovers like me</title>
      <link>https://www.techradar.com/home/true-blue-20-items-for-your-eclectic-0000ff-assemblage-to-work-from-home</link>
      <pubDate>Mon, 12 Jan 2026 16:14:14 +0000</pubDate>
      <guid isPermaLink="false">ujgA6Fa3mjgm9nAXt9kt35</guid>
      <description>Everything you need to bring a flash of color to your WFH workspace.</description>
    </item>
    <item>
      <title>Netflix had a huge night at the 2026 Golden Globes with 7 wins</title>
      <link>https://techcrunch.com/2026/01/12/netflix-had-a-huge-night-at-the-2026-golden-globes-with-7-wins/</link>
      <pubDate>Mon, 12 Jan 2026 16:12:49 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3081845</guid>
      <description>As Netflix gears up to acquire Warner Bros., the streaming giant took home 7 awards at the Golden Globes last night.</description>
    </item>
    <item>
      <title>One Piece Season 2 trailer introduces the live-action Baroque Works assassins</title>
      <link>https://mashable.com/video/one-piece-season-2-trailer-baroque-works</link>
      <pubDate>Mon, 12 Jan 2026 16:12:22 +0000</pubDate>
      <guid isPermaLink="false">07rHqkSwdJGPwOso4ir37WX</guid>
      <description>Season 2 of Netflix's "One Piece" introduces the Baroque Works assassins, played by Charithra Chandran, David Dastmalchian, and more.</description>
    </item>
    <item>
      <title>Apple surpasses Samsung to become the worlds number one smartphone maker</title>
      <link>https://mashable.com/article/apple-passes-samsung-mobile-number-one-smartphone-maker</link>
      <pubDate>Mon, 12 Jan 2026 16:07:43 +0000</pubDate>
      <guid isPermaLink="false">00LIYbm5rjzAltzzKucS5Ti</guid>
      <description>New data from Counterpoint has Apple as the world's top smartphone maker, ahead of Samsung.</description>
    </item>
    <item>
      <title>Les produits Xiaomi ne sont pas &#233;pargn&#233;s lors des soldes d&#8217;hiver : voici les 9 meilleurs deals</title>
      <link>https://www.frandroid.com/bons-plans/2936033_les-produits-xiaomi-ne-sont-pas-epargnes-lors-des-soldes-dhiver-voici-les-8-meilleurs-deals</link>
      <pubDate>Mon, 12 Jan 2026 16:06:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2936033_les-produits-xiaomi-ne-sont-pas-epargnes-lors-des-soldes-dhiver-voici-les-8-meilleurs-deals</guid>
      <description>
Xiaomi reste un acteur incontournable du march&#233; de la Tech. Comme chaque ann&#233;e, le constructeur chinois participe aux soldes d'hiver et se d&#233;marque en proposant des offres attractives sur ses smartphones, objets connect&#233;s et t&#233;l&#233;viseurs &#8212; sans oublier son tout nouveau mod&#232;le Poco, d&#233;j&#224; disponible en promotion. 
</description>
    </item>
    <item>
      <title>Hackers are going after top LLM services by cracking misconfigured proxies</title>
      <link>https://www.techradar.com/pro/security/hackers-are-going-after-top-llm-services-by-cracking-misconfigured-proxies</link>
      <pubDate>Mon, 12 Jan 2026 16:05:00 +0000</pubDate>
      <guid isPermaLink="false">y65shACnDehDQ6crshyExH</guid>
      <description>Major hacking campaign identified vulnerable servers and underlying LLM systems.</description>
    </item>
    <item>
      <title>Soundcore AeroFit 2 Pro, des &#233;couteurs hybrides conjuguant confort ouvert et r&#233;duction de bruit qui veulent faire mieux que les AirPods</title>
      <link>https://www.frandroid.com/marques/anker/2939671_soundcore-aerofit-2-pro-des-ecouteurs-hybrides-conjuguant-confort-ouvert-et-reduction-de-bruit-qui-veulent-faire-mieux-que-les-airpods</link>
      <pubDate>Mon, 12 Jan 2026 16:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/anker/2939671_soundcore-aerofit-2-pro-des-ecouteurs-hybrides-conjuguant-confort-ouvert-et-reduction-de-bruit-qui-veulent-faire-mieux-que-les-airpods</guid>
      <description>
Pr&#233;sent&#233;s au CES 2026 de Las Vegas, les nouveaux &#233;couteurs true wireless de Soundcore promettent de r&#233;soudre l'&#233;quation complexe entre maintien optimal, design non intrusif et isolation acoustique gr&#226;ce &#224; une architecture modulable in&#233;dite.
</description>
    </item>
    <item>
      <title>This Documentary Takes You Inside the Very Real World of Competitive Lightsaber Duels (Exclusive)</title>
      <link>https://gizmodo.com/saber-documentary-star-wars-lightsabers-2000707812</link>
      <pubDate>Mon, 12 Jan 2026 16:00:42 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000707812</guid>
      <description>Titled 'Saber,' the new film explores a fascinating niche of 'Star Wars' fandom.</description>
    </item>
    <item>
      <title>The Lego Pok&#233;mon Kanto Region Badge Collection is free when you pre-order the new Venusaur, Charizard, and Blastoise set</title>
      <link>https://mashable.com/article/free-lego-pokemon-kanto-region-badge-collection-deal</link>
      <pubDate>Mon, 12 Jan 2026 16:00:06 +0000</pubDate>
      <guid isPermaLink="false">075ndL5jK2twGLTY6lEh361</guid>
      <description>The Lego Pok&#233;mon Kanto Region Badge Collection is a free gift with purchase of the new Venusaur, Charizard, and Blastoise set.</description>
    </item>
    <item>
      <title>Nvidia Rubin's rack-scale encryption signals a turning point for enterprise AI security</title>
      <link>https://venturebeat.com/security/nvidia-rubin-rack-scale-encryption-enterprise-ai-security</link>
      <pubDate>Mon, 12 Jan 2026 16:00:00 GMT</pubDate>
      <guid isPermaLink="false">1vDEFxaDcNGIt031cZ0x9R</guid>
      <description>Nvidia's Vera Rubin NVL72, announced at CES 2026, encrypts every bus across 72 GPUs, 36 CPUs, and the entire NVLink fabric. It's the first rack-scale platform to deliver confidential computing across CPU, GPU, and NVLink domains.For security leaders, this fundamentally shifts the conversation. Rather than attempting to secure complex hybrid cloud configurations through contractual trust with cloud providers, they can verify them cryptographically. That&#8217;s a critical distinction that matters when nation-state adversaries have proven they are capable of launching targeted cyberattacks at machine ...</description>
    </item>
    <item>
      <title>The first three Lego Pok&#233;mon sets launch in February and include a $650 diorama</title>
      <link>https://www.theverge.com/tech/860511/lego-pokemon-pikachu-poke-ball-eevee-venusaur-charizard-blastoise</link>
      <pubDate>2026-01-12T10:58:49-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=860511</guid>
      <description>After teasing its first collaboration with the Pok&#233;mon franchise last March but sharing very few details, Lego's first Pok&#233;mon sets are now available for preorder through the company's online store. The cheapest of the three is an articulated version of Eevee, but there's also a budget-busting set featuring Charizard, Blastoise, and Venusaur that's a whopping [&#8230;]...</description>
    </item>
    <item>
      <title>The RingConn Gen 2 is on sale for under $240 at Amazon and the health-tracking subscription is free</title>
      <link>https://mashable.com/article/jan-12-ringconn-gen-2-deal</link>
      <pubDate>Mon, 12 Jan 2026 15:58:04 +0000</pubDate>
      <guid isPermaLink="false">012zJ2M8IZFr48ixUpRbo8r</guid>
      <description>The RingConn Gen 2 is on sale at Amazon for $239.20, down from the list price of $299. That's a 20% discount.</description>
    </item>
    <item>
      <title>Cloudflare CEO threatens to pull servers from Italy after AGCOM's &#8364;14M fine</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/cloudflare-ceo-threatens-to-pull-servers-from-italy-after-agcoms-eur14m-fine</link>
      <pubDate>Mon, 12 Jan 2026 15:54:27 +0000</pubDate>
      <guid isPermaLink="false">C9pQgHw2kPAZGfCtZf5tz6</guid>
      <description>Cloudflare has been hit with a massive fine from Italian authorities for refusing to block pirate sites on its public DNS. CEO Matthew Prince has responded with a furious rebuttal, threatening to pull the company's physical presence from Italy entirely.</description>
    </item>
    <item>
      <title>A Palworld trading card game is coming this summer</title>
      <link>https://www.theverge.com/games/860492/palworld-trading-card-game-release-date</link>
      <pubDate>2026-01-12T10:52:55-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=860492</guid>
      <description>Palworld, the monster-hunting action / adventure game known for its originality, is getting into the trading card business. Pocketpair announced today that it has partnered with Bushiroad - the company behind the Weiss Schwarz and Shadowverse: Evolve trading card games - to produce a new TCG featuring creatures from Palworld due out on July 30th. [&#8230;]...</description>
    </item>
    <item>
      <title>India is proposing another far-reaching security rule for smartphones</title>
      <link>https://www.engadget.com/cybersecurity/india-is-proposing-another-far-reaching-security-rule-for-smartphones-155204829.html?src=rss</link>
      <pubDate>Mon, 12 Jan 2026 15:52:04 +0000</pubDate>
      <guid isPermaLink="false">000ac2b0-4dd6-43c3-8491-5b1bd1b3915b</guid>
      <description>India is considering new smartphone security rules that would require device makers to allow government access to source code for &#8220;vulnerability analysis.&#8221; It would also require companies to notify the government of major software updates and security patches before rollout, according to Reuters.
This is the latest in a raft of unprecedented proposals by the Indian government under the guise of security, as it weighs making a package of 83 security standards drafted in 2023 legally binding in the world&#8217;s second-largest smartphone market with nearly 750 million smartphones.
Under the proposals,...</description>
    </item>
    <item>
      <title>Lego's brand-new Star Wars Smart Play sets are up for preorder, and I've tried all 3</title>
      <link>https://www.techradar.com/streaming/entertainment/legos-brand-new-star-wars-smart-play-sets-are-up-for-preorder-and-ive-tried-all-3</link>
      <pubDate>Mon, 12 Jan 2026 15:49:04 +0000</pubDate>
      <guid isPermaLink="false">wVUozVo9b9YAWf7xCVetMA</guid>
      <description>Lego's first three Star WarsSmart Play sets are now up for preorder ahead of the official March 1, 2026, launch, starting at $69.99 / &#163;59.99 / AU$99.99.</description>
    </item>
    <item>
      <title>Les montres connect&#233;es sont en forte promotion durant les soldes : les 7 bonnes affaires &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2937331_les-montres-connectees-sont-en-forte-promotion-durant-les-soldes-les-7-bonnes-affaires-a-retenir</link>
      <pubDate>Mon, 12 Jan 2026 15:47:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2937331_les-montres-connectees-sont-en-forte-promotion-durant-les-soldes-les-7-bonnes-affaires-a-retenir</guid>
      <description>
Les soldes d'hiver permettent de faire de bonnes affaires sur de nombreux produits Tech, dont les montres connect&#233;es ! Ces accessoires lifestyle &amp; sport profitent eux aussi d&#8217;une vague de promotions : voici les offres &#224; retenir. 
</description>
    </item>
    <item>
      <title>Gemini de Google sera le cerveau du futur Siri d&#8217;Apple</title>
      <link>https://www.01net.com/actualites/gemini-de-google-sera-le-cerveau-du-futur-siri.html</link>
      <pubDate>Mon, 12 Jan 2026 15:45:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319534</guid>
      <description>Apple a fini par trouver le chevalier blanc qui sauvera Siri des affres de la m&#233;diocrit&#233; : &#231;a sera Gemini de Google. Les n&#233;gociations qui duraient depuis des mois entre les deux entreprises ont en effet abouti. Il est grand temps : le nouveau Siri personnalis&#233; bas&#233; sur l'IA devait sortir au printemps dernier.</description>
    </item>
    <item>
      <title>Monarch Money is offering 50 percent off its budgeting app for new users</title>
      <link>https://www.engadget.com/apps/monarch-money-is-offering-50-percent-off-its-budgeting-app-for-new-users-204507767.html?src=rss</link>
      <pubDate>Mon, 12 Jan 2026 15:45:37 +0000</pubDate>
      <guid isPermaLink="false">1764214b-3509-4628-8631-8692fa12e904</guid>
      <description>The start of the new year is a great time to get your finances in order, and a good budgeting app can help with that. Instead of laboring over a spreadsheet, you can try one of our favorite budgeting apps for less than usual. Monarch Money is running a sale that gives new users 50 percent off one year of the service, bringing the final cost down to just $50. Just use the code NEWYEAR2026 at checkout to get the discount.
Monarch Money makes for a capable and detailed budgeting companion. You can use the service via apps for iOS, Android, iPadOS or the web, and Monarch also offers a Chrome exten...</description>
    </item>
    <item>
      <title>Samsungs 77-inch entry-level OLED 4K TV is over $1,400 off at Amazon</title>
      <link>https://mashable.com/article/jan-12-samsung-s85f-oled-tv-deal</link>
      <pubDate>Mon, 12 Jan 2026 15:44:05 +0000</pubDate>
      <guid isPermaLink="false">054ucrKWADs5ZzOTMkVAT7m</guid>
      <description>Amazon has the Samsung 77-inch S85F OLED 4K TV on sale for just $1,597.99. That's nearly half off its list price.</description>
    </item>
    <item>
      <title>Throw away these recalled dietary supplements right now. They may contain a &#8216;life-threatening&#8217; ingredient</title>
      <link>https://www.fastcompany.com/91472982/throw-away-these-recalled-dietary-supplements-right-now-they-may-contain-a-life-threatening-ingredient</link>
      <pubDate>2026-01-12T15:40:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91472982/throw-away-these-recalled-dietary-supplements-right-now-they-may-contain-a-life-threatening-ingredient</guid>
      <description>Sold for over a period of three years, a product that claimed to offer &#8220;mental clarity&#8221; might cause serious side effects, according to an FDA notice. 
Fitness brand Modern Warrior has voluntarily recalled all lots of its dietary supplement Modern Warrior Ready after testing revealed the presence of &#8220;undeclared ingredients,&#8221; one of which could be potentially life threatening.  ...</description>
    </item>
    <item>
      <title>Fin des surtaxes sur les voitures &#233;lectriques chinoises : l&#8217;Europe change de strat&#233;gie, voici ce qui remplace les 35 %</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2939635_fin-des-surtaxes-sur-les-voitures-electriques-chinoises-leurope-change-de-strategie-voici-ce-qui-remplace-les-35</link>
      <pubDate>Mon, 12 Jan 2026 15:38:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2939635_fin-des-surtaxes-sur-les-voitures-electriques-chinoises-leurope-change-de-strategie-voici-ce-qui-remplace-les-35</guid>
      <description>
L'Europe vient peut-&#234;tre d'&#233;viter une guerre commerciale totale, mais &#224; quel prix ? Bruxelles propose officiellement de remplacer les droits de douane punitifs sur les voitures &#233;lectriques chinoises par des prix minimums obligatoires. Une "main tendue" qui ressemble surtout &#224; un ultimatum &#233;conomique d&#233;guis&#233;.
</description>
    </item>
    <item>
      <title>Apple picks Google&#8217;s Gemini AI for its big Siri upgrade</title>
      <link>https://www.theverge.com/news/860521/apple-siri-google-gemini-ai-personalization</link>
      <pubDate>2026-01-12T10:38:19-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=860521</guid>
      <description>Apple will use Google's Gemini AI model to power a more personalized Siri coming this year. "After careful evaluation, Apple determined that Google's Al technology provides the most capable foundation for Apple Foundation Models and is excited about the innovative new experiences it will unlock for Apple users," Google and Apple announced on Monday. CNBC [&#8230;]...</description>
    </item>
    <item>
      <title>A beginners guide to sexting</title>
      <link>https://mashable.com/article/how-to-sext-better</link>
      <pubDate>Mon, 12 Jan 2026 15:37:37 +0000</pubDate>
      <guid isPermaLink="false">03qOqirFM3ygelFwV92AIWd</guid>
      <description>Sexting can be fun and downright hot if done right. Here are tips from experts on how to get better at sexting.</description>
    </item>
    <item>
      <title>This 57-inch Samsung monitor is $800 off and its basically two 4K displays in one</title>
      <link>https://mashable.com/article/jan-12-samsung-odyssey-neo-g9-deal</link>
      <pubDate>Mon, 12 Jan 2026 15:35:45 +0000</pubDate>
      <guid isPermaLink="false">01opqMPX561fofv521J5C5X</guid>
      <description>As of Jan. 12, you can get the Samsung 57-inch Odyssey Neo G9 (G95NC) Series gaming monitor for $1,499.99 at Amazon.</description>
    </item>
    <item>
      <title>Trump signals plans for ExxonMobil in Venezuela after White House meeting</title>
      <link>https://www.fastcompany.com/91472939/trump-signals-plans-exxonmobil-venezuela-after-white-house-meeting</link>
      <pubDate>2026-01-12T15:32:44</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91472939/trump-signals-plans-exxonmobil-venezuela-after-white-house-meeting</guid>
      <description>A recent meeting with oil executives at the White House wasn&#8217;t entirely successful in efforts to ease concerns about Venezuela&#8217;s government.
President Donald Trump said Sunday that he is &#8220;inclined&#8221; to keep ExxonMobil out of Venezuela after its top executive was skeptical about oil investment efforts in the country after the toppling of former President Nicol&#225;s Maduro.&#8220;I didn&#8217;t like Exxon&#8217;s response,&#8221; Trump said to reporters on Air Force One as he departed West Palm Beach, Florida. &#8220;They&#8217;re playing too cute.&#8221;During a meeting Friday with oil executives, Trump tried to assuage the concerns of the...</description>
    </item>
    <item>
      <title>Trend Micro releases critical security fixes for Apex Central RCE - so patch now</title>
      <link>https://www.techradar.com/pro/security/trend-micro-releases-critical-security-fixes-for-apex-central-rce-so-patch-now</link>
      <pubDate>Mon, 12 Jan 2026 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">aw2p4TqY5yaroUr7wLQkRe</guid>
      <description>A bug allowed hackers to inject DLLs without user interaction, gaining access to the underlying system.</description>
    </item>
    <item>
      <title>Luminar lines up $22 million bidder for its lidar business</title>
      <link>https://techcrunch.com/2026/01/12/luminar-lines-up-22-million-bidder-for-its-lidar-business/</link>
      <pubDate>Mon, 12 Jan 2026 15:28:16 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3081825</guid>
      <description>The bid comes from Quantum Computing Inc., which already lined up to buy Luminar's semiconductor division. Luminar founder Austin Russell has also expressed interest.</description>
    </item>
  </channel>
</rss>
