<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 21 Dec 2025 19:19:10 GMT</lastBuildDate>
    <item>
      <title>Frozen Waymos backed up San Francisco traffic during a widespread power outage</title>
      <link>https://www.theverge.com/news/848843/waymo-san-francisco-power-outage</link>
      <pubDate>2025-12-21T14:17:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=848843</guid>
      <description>A power outage struck San Francisco on Saturday that blacked out about 130,000 customers at its peak, according to Pacific Gas and Electric Company, but also caused another problem: stranded Waymo vehicles. Posts all over social media showed the company's autonomous SUVs sitting still in the streets and causing traffic jams. Some people posted videos [&#8230;]...</description>
    </item>
    <item>
      <title>OLED vs LCD : une &#233;tude de 18 000 heures r&#233;v&#232;le quelle technologie l&#226;che en premier</title>
      <link>https://www.frandroid.com/produits-android/2917633_oled-vs-lcd-une-etude-de-18-000-heures-revele-quelle-technologie-lache-en-premier</link>
      <pubDate>Sun, 21 Dec 2025 19:15:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2917633_oled-vs-lcd-une-etude-de-18-000-heures-revele-quelle-technologie-lache-en-premier</guid>
      <description>
On vous a toujours r&#233;p&#233;t&#233; la m&#234;me chose : &#171;&#160;L&#8217;OLED c'est beau, mais attention au marquage, le LCD c'est du solide&#160;&#187;. Un test massif men&#233; sur deux ans prouve exactement l'inverse : pendant que l'OLED s'use doucement, les TV LCD, elles, cassent litt&#233;ralement.
</description>
    </item>
    <item>
      <title>GuliKit's $20 mod makes the ROG Xbox Ally's joysticks drift-free</title>
      <link>https://www.engadget.com/gaming/xbox/gulikits-20-mod-makes-the-rog-xbox-allys-joysticks-drift-free-190521030.html?src=rss</link>
      <pubDate>Sun, 21 Dec 2025 19:05:21 +0000</pubDate>
      <guid isPermaLink="false">388bee59-4621-4c3b-bfcf-2ac9e4d6fe36</guid>
      <description>There may not be any reports of stick drift with the ROG Xbox Ally yet, but that doesn't mean there won't be. If you'd rather not end up with joysticks that have a mind of their own, GuliKit revealed its latest TMR Electromagnet Joystick Modules made specifically for your Xbox handheld.
GuliKit said it worked directly with Asus to develop these joystick upgrades, which match the exact dimensions of the ROG Xbox Ally and Ally X's stock sticks. The aftermarket accessories company previously designed a Hall effect joystick upgrade kit for the ROG Ally X, but GuliKit said this mod features electro...</description>
    </item>
    <item>
      <title>This app promises to end your subscription overload &#8212; and I'm glad I found it</title>
      <link>https://www.techradar.com/computing/websites-apps/subee</link>
      <pubDate>Sun, 21 Dec 2025 19:00:00 +0000</pubDate>
      <guid isPermaLink="false">cAVK5JFr8FQ88WWLKBJZ5Q</guid>
      <description>Homescreen Heroes: Subee promises to end subscription overload</description>
    </item>
    <item>
      <title>Coloniser Mars ? &#192; huis clos, des experts europ&#233;ens doutent s&#233;rieusement du sc&#233;nario actuel : d&#233;cryptage avec Pierre Brisson</title>
      <link>https://www.futura-sciences.com/sciences/actualites/mars-coloniser-mars-huis-clos-experts-europeens-doutent-serieusement-scenario-actuel-decryptage-pierre-brisson-129323/#xtor%3DRSS-8</link>
      <pubDate>Sun, 21 Dec 2025 19:57:21 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/mars-coloniser-mars-huis-clos-experts-europeens-doutent-serieusement-scenario-actuel-decryptage-pierre-brisson-129323/#xtor%3DRSS-8</guid>
      <description>Dans le cadre de l'&#233;v&#233;nement EMC25, un colloque consacr&#233; aux enjeux de l'exploration et la colonisation martienne, Pierre Brisson, de la Mars Society, a partag&#233; &#224; Futura ses analyses sur les d&#233;bats, parfois contradictoires, qui ont &#233;merg&#233; autour de la colonisation de Mars. Des analyses qui...</description>
    </item>
    <item>
      <title>Les Sony Inzone Buds dot&#233;s de l&#8217;audio spatial et d&#8217;une r&#233;duction de bruit sont presque &#224; moiti&#233; prix chez Micromania-Zing</title>
      <link>https://www.frandroid.com/bons-plans/2916821_les-sony-inzone-buds-dotes-de-laudio-spatial-et-dune-reduction-de-bruit-sont-presque-a-moitie-prix-chez-micromania-zing</link>
      <pubDate>Sun, 21 Dec 2025 18:24:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2916821_les-sony-inzone-buds-dotes-de-laudio-spatial-et-dune-reduction-de-bruit-sont-presque-a-moitie-prix-chez-micromania-zing</guid>
      <description>
Pour ceux qui ne sont pas fans des casques gaming, les &#233;couteurs sans fil Sony Inzone Buds sont une superbe alternative renforc&#233;e par cette remise de 100 euros chez Micromania-Zing.
</description>
    </item>
    <item>
      <title>&#171;&#160;Ce n&#8217;est pas un bug&#160;&#187; : Google confirme avoir ruin&#233; la recherche des Pixel</title>
      <link>https://www.frandroid.com/marques/google/2917589_ce-nest-pas-un-bug-google-confirme-avoir-ruine-la-recherche-des-pixel</link>
      <pubDate>Sun, 21 Dec 2025 18:11:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2917589_ce-nest-pas-un-bug-google-confirme-avoir-ruine-la-recherche-des-pixel</guid>
      <description>
Jusqu'ici, la barre de recherche en bas de votre Pixel &#233;tait le moyen le plus rapide de trouver une application ou un contact. C'est fini. Avec la mise &#224; jour de novembre, Google a d&#233;cid&#233; que vous aviez plut&#244;t besoin de Gemini et de son application Google lourde, quitte &#224; casser tout le reste.
</description>
    </item>
    <item>
      <title>&#171;&#160;Tr&#232;s bon&#160;&#187; : pourquoi Air France s&#8217;est jet&#233; dans les bras d&#8217;Elon Musk faute de mieux</title>
      <link>https://www.frandroid.com/telecom/2917541_tres-bon-pourquoi-air-france-sest-jete-dans-les-bras-delon-musk-faute-de-mieux</link>
      <pubDate>Sun, 21 Dec 2025 18:01:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2917541_tres-bon-pourquoi-air-france-sest-jete-dans-les-bras-delon-musk-faute-de-mieux</guid>
      <description>
Elon Musk qui tweete "Tr&#232;s bon" en fran&#231;ais, c'est l'image de la semaine. Air France g&#233;n&#233;ralise le Wi-Fi Starlink dans ses avions et la classe politique s'insurge au nom de la souverainet&#233;. Le probl&#232;me ? Air France n'avait pas vraiment le choix.
</description>
    </item>
    <item>
      <title>Les meilleures id&#233;es cadeaux geek et tech de derni&#232;re minute pour No&#235;l</title>
      <link>https://www.frandroid.com/guide-dachat/1151307_nos-idees-cadeaux-tech-et-geek-de-derniere-minute</link>
      <pubDate>Sun, 21 Dec 2025 18:00:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1151307_nos-idees-cadeaux-tech-et-geek-de-derniere-minute</guid>
      <description>
&#192; quelques encablures de No&#235;l, vous n&#8217;avez pas de bonne trouvaille &#224; offrir&#8201;? D&#233;couvrez notre s&#233;lection d&#8217;id&#233;es cadeaux tech et geek de derni&#232;re minute, en boutique, ou pouvant &#234;tre livr&#233;s rapidement chez vous.
</description>
    </item>
    <item>
      <title>Some of our favorite gifts will cost you less than $25</title>
      <link>https://www.theverge.com/gadgets/780844/best-gifts-under-25-2025</link>
      <pubDate>2025-12-21T13:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=780844</guid>
      <description>Holiday shopping on a budget can feel constricting, especially if you've been invited to a white elephant or need a last-minute stocking stuffer. The good news is that, with this guide, you can leave that stress behind. Whether you're aiming for something practical or fun, we've found plenty of great gifts for under $25 - [&#8230;]</description>
    </item>
    <item>
      <title>Waymo cars stall, causing traffic jams, during San Francisco blackout</title>
      <link>https://mashable.com/article/waymo-san-francisco-cars-stuck-during-blackout</link>
      <pubDate>Sun, 21 Dec 2025 17:52:51 +0000</pubDate>
      <guid isPermaLink="false">07czmniqyMy3gGWsOK6jRix</guid>
      <description>Waymo suspended service of its self-driving cars amid a blackout that hit a third of San Francisco residents Saturday night.</description>
    </item>
    <item>
      <title>A new leak may have revealed Samsung's launch window for the Galaxy S26 series &#8212; but they might not go on sale right away</title>
      <link>https://www.techradar.com/phones/samsung-galaxy-phones/a-new-leak-may-have-revealed-samsungs-launch-window-for-the-galaxy-s26-series-but-they-might-not-go-on-sale-right-away</link>
      <pubDate>Sun, 21 Dec 2025 17:30:00 +0000</pubDate>
      <guid isPermaLink="false">XQUj4u84Vh5tgTjkhwHM9U</guid>
      <description>The latest rumor around the Galaxy S26 series points to a launch event in February and shipping in March.</description>
    </item>
    <item>
      <title>Thank Pochita, the &#8216;Chainsaw Man&#8217; Anime Will Return</title>
      <link>https://gizmodo.com/chainsaw-man-assassins-arc-mappa-2000702280</link>
      <pubDate>Sun, 21 Dec 2025 17:25:11 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000702280</guid>
      <description>But will the 'International Assassins' arc be a new season, or another movie? That's what 'Chainsaw Man' fans want to know.</description>
    </item>
    <item>
      <title>A San Francisco power outage left Waymo's self-driving cars stranded at intersections</title>
      <link>https://www.engadget.com/transportation/a-san-francisco-power-outage-left-waymos-self-driving-cars-stranded-at-intersections-172316970.html?src=rss</link>
      <pubDate>Sun, 21 Dec 2025 17:23:16 +0000</pubDate>
      <guid isPermaLink="false">50123868-994d-45c5-8476-c892c531babe</guid>
      <description>Several of Waymo's autonomous vehicles were seen stuck in the middle of San Francisco streets following a significant power outage that took out the city's traffic lights. Waymo responded to the power outage by suspending its ride-hailing services in the city, but images and videos on social media showed the self-driving taxis stopped at intersections with hazard lights on.
"We have temporarily suspended our ride-hailing services in the San Francisco Bay Area due to the widespread power outage," Suzanne Philion, a spokesperson for Waymo, told Engadget in an email. "Our teams are working dilige...</description>
    </item>
  </channel>
</rss>
