<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 22 Nov 2025 10:37:22 GMT</lastBuildDate>
    <item>
      <title>Ce clone de Gmail vous plonge dans les archives priv&#233;es de Jeffrey Epstein</title>
      <link>https://www.frandroid.com/culture-tech/juridique/2881711_ce-clone-de-gmail-vous-plonge-dans-les-archives-privees-de-jeffrey-epstein</link>
      <pubDate>Sat, 22 Nov 2025 10:23:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/juridique/2881711_ce-clone-de-gmail-vous-plonge-dans-les-archives-privees-de-jeffrey-epstein</guid>
      <description>
Deux d&#233;veloppeurs ont mis en ligne Jmail, un site reproduisant l'interface de Gmail pour explorer les milliers de documents relatifs &#224; Jeffrey Epstein r&#233;cemment publi&#233;s par le Congr&#232;s am&#233;ricain. 
</description>
    </item>
    <item>
      <title>Cyberattaque contre Colis Priv&#233; : les donn&#233;es des clients ont &#233;t&#233; compromises</title>
      <link>https://www.01net.com/actualites/cyberattaque-contre-colis-prive-donnees-clients-compromises.html</link>
      <pubDate>Sat, 22 Nov 2025 10:18:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310274</guid>
      <description>Une cyberattaque vient de frapper Colis Priv&#233;. Le transporteur, qui livre 90 millions de colis par an, a confirm&#233; le vol de donn&#233;es de contact de ses clients. Ces informations suffisent &#224; lancer des vagues d'arnaques, dont des escroqueries au colis.</description>
    </item>
    <item>
      <title>Black Friday en DIRECT : voici les meilleures offres du week-end &#224; l&#8217;occasion de la Black Week sur Amazon, Fnac, Darty, Boulanger&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2876855_black-friday-week-week-end-meilleures-offres-en-direct-amazon-fnac-darty-boulanger</link>
      <pubDate>Sat, 22 Nov 2025 10:14:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2876855_black-friday-week-week-end-meilleures-offres-en-direct-amazon-fnac-darty-boulanger</guid>
      <description>
C'est officiellement la Black Friday Week sur Amazon, Fnac, Darty, Boulanger ou encore Cdiscount. C'est donc le bon moment pour faire une excellente affaire sur votre prochain smartphone, tablette, PC portable, TV, etc. Vous retrouverez les meilleures offres Tech en temps r&#233;el dans cet article. 
</description>
    </item>
    <item>
      <title>Devialet Phatom II 95 dB : la tornade sonore au format compact casse son prix pour la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2644121_devialet-phatom-ii-95-db-la-tornade-sonore-au-format-compact-casse-son-prix-pour-la-black-friday-week</link>
      <pubDate>Sat, 22 Nov 2025 10:08:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2644121_devialet-phatom-ii-95-db-la-tornade-sonore-au-format-compact-casse-son-prix-pour-la-black-friday-week</guid>
      <description>
Pas plus grande qu&#8217;un ballon de hand, mais capable de faire trembler les murs. La Phantom II 95 dB de Devialet condense tout le savoir-faire acoustique fran&#231;ais dans un bloc design, dense et percutant. Compacte, nerveuse, pr&#233;cise : une enceinte de salon qui joue dans une autre division. Une jolie r&#233;duction a lieu pendant la Black Friday Week, faisant passer la b&#234;te &#224; 880 euros contre 1 100 euros en temps normal.
...</description>
    </item>
    <item>
      <title>Valve Says Steam Machine Isn't a Console&#8212;but It Is</title>
      <link>https://www.wired.com/story/valve-says-steam-machine-isnt-a-console-but-it-is/</link>
      <pubDate>Sat, 22 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">69209623771219f06b6e7db5</guid>
      <description>Consoles are good, actually.</description>
    </item>
    <item>
      <title>AIOps: how companies can harness AI to reshape IT operations</title>
      <link>https://www.techradar.com/pro/aiops-how-companies-can-harness-ai-to-reshape-it-operations</link>
      <pubDate>Sat, 22 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">fVqSsxGtJhtFSbNBHgJH3o</guid>
      <description>AIOps is reshaping IT operations, but its powerful potential depends entirely on one critical factor.</description>
    </item>
    <item>
      <title>ICYMI: the 7 biggest tech stories of the week, from Google's AirDrop surprise to Gemini 3</title>
      <link>https://www.techradar.com/tech/icymi-the-7-biggest-tech-stories-of-the-week-from-googles-airdrop-surprise-to-gemini-3</link>
      <pubDate>Sat, 22 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">Gp7jBRzs4r6nXPxHmx3hoc</guid>
      <description>Here are the biggest tech stories of the past week, helping you catch up with everything you might have missed.</description>
    </item>
    <item>
      <title>Bren&#233;&#160;Brown and Adam Grant say the best leaders do this. Mediocre managers do the opposite</title>
      <link>https://www.fastcompany.com/91433420/brene-brown-adam-grant-best-leaders-ask-questions</link>
      <pubDate>2025-11-22T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91433420/brene-brown-adam-grant-best-leaders-ask-questions</guid>
      <description>Are you a &#8216;learner&#8217; or a &#8216;knower&#8217;?
How can you tell if someone is a&#160;great leader? They always want to know more. They&#8217;re interested in mastery of a subject or skill. They ask great questions. And, as they find out more, they sometimes change their mind. They&#8217;re a &#8220;learner.&#8221;</description>
    </item>
    <item>
      <title>How &#8216;Sesame Street&#8217; is navigating funding cuts, new media habits, and leaving HBO for Netflix</title>
      <link>https://www.fastcompany.com/91442760/how-sesame-street-is-navigating-funding-cuts-new-media-habits-and-leaving-hbo-for-netflix</link>
      <pubDate>2025-11-22T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91442760/how-sesame-street-is-navigating-funding-cuts-new-media-habits-and-leaving-hbo-for-netflix</guid>
      <description>Sesame Workshop CEO Sherrie Westin discusses the challenges of the past year, partnering with Netflix, and why emotional well-being and kindness matter in today&#8217;s world.
As Sesame Street&#8217;s 56th season gets underway, Elmo, Big Bird, and the Sesame organization are navigating a volatile chapter in the show&#8217;s history&#8212;marked by government funding cuts, evolving new media habits, and AI&#8217;s impact on education. Sherrie Westin, CEO of Sesame Workshop, discusses balancing risk-taking with brand trust, partnering with Netflix, and why emotional well-being and kindness are the skills that matter most in ...</description>
    </item>
    <item>
      <title>Tim Cook&#8217;s track record as Apple CEO is better than you&#8217;re giving him credit for</title>
      <link>https://www.fastcompany.com/91444994/tim-cook-pulled-off-impossible-steve-jobs-apple-ceo-succession</link>
      <pubDate>2025-11-22T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444994/tim-cook-pulled-off-impossible-steve-jobs-apple-ceo-succession</guid>
      <description>Amid reports that Cook may retire soon, here&#8217;s how I view his remarkable, under-appreciated tenure which puts him with Steve Jobs as one of the best tech leaders of all time. 
Last week, the Financial Times reported that Apple CEO Tim Cook may step down next year. This news seemed to have little impact on Apple&#8217;s stock price, but it certainly sparked conversations among Apple fans and armchair tech pundits. Some people have long criticized Cook as a bean counter and &#8220;ops guy,&#8221; believing he was not the right person to helm the 21st century&#8217;s leading consumer technology company, especially one p...</description>
    </item>
    <item>
      <title>&#8216;Huge red flag&#8217;: Top Biden tech adviser warns of AI and the authoritarian moment</title>
      <link>https://www.fastcompany.com/91445749/arati-prabhakar-biden-ai-trump-authoritarianism-palantir</link>
      <pubDate>2025-11-22T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91445749/arati-prabhakar-biden-ai-trump-authoritarianism-palantir</guid>
      <description>Arati Prabhakar talks to Fast Company about what the rise of artificial intelligence will mean for the future of democracy.
Camps are finally emerging in the big fight over whether and how to regulate AI. President Donald Trump earlier this week declared that he would block local officials who try to regulate the technology; according to a draft executive order leaked on Wednesday, the administration will punish states that try. State lawmakers and members of Congress&#8212;including Georgia Republican Rep. Marjorie Taylor Greene&#8212;are now pushing back.&#160;...</description>
    </item>
    <item>
      <title>Boulanger fait son d&#233;stockage durant la Black Friday Week : les 17 deals immanquables du week-end</title>
      <link>https://www.frandroid.com/bons-plans/2859523_boulanger-fait-son-destockage-durant-la-black-friday-week-les-17-deals-immanquables-du-week-end</link>
      <pubDate>Sat, 22 Nov 2025 09:51:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2859523_boulanger-fait-son-destockage-durant-la-black-friday-week-les-17-deals-immanquables-du-week-end</guid>
      <description>
La Black Friday Week d&#233;marre &#224; peine et voil&#224; que d&#233;j&#224; de nouvelles offres font leur apparition chez plusieurs e-commer&#231;ants. Boulanger n&#8217;h&#233;site pas &#224; baisser les prix de nombreuses r&#233;f&#233;rences Tech. Voici les offres qui valent le coup.
</description>
    </item>
    <item>
      <title>Cdiscount d&#233;gaine de belles offres pour la Black Friday Week : les 11 offres &#224; ne pas louper ce week-end</title>
      <link>https://www.frandroid.com/bons-plans/2850059_cdiscount-degaine-de-belles-offres-pour-la-black-friday-week-les-11-offres-a-ne-pas-louper-ce-week-end</link>
      <pubDate>Sat, 22 Nov 2025 09:26:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850059_cdiscount-degaine-de-belles-offres-pour-la-black-friday-week-les-11-offres-a-ne-pas-louper-ce-week-end</guid>
      <description>
Chez Cdiscount une vague de nouvelles offres sur de nombreux produits Tech est apparue lors de la Black Friday Week. Voici notre s&#233;lection des meilleures promotions chez ce marchand. 
</description>
    </item>
    <item>
      <title>Le Samsung Galaxy A57 d&#233;voile une architecture in&#233;dite et de la puissance &#224; revendre</title>
      <link>https://www.frandroid.com/actualites-generales/2881587_le-samsung-galaxy-a57-devoile-une-architecture-inedite-et-de-la-puissance-a-revendre</link>
      <pubDate>Sat, 22 Nov 2025 09:19:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2881587_le-samsung-galaxy-a57-devoile-une-architecture-inedite-et-de-la-puissance-a-revendre</guid>
      <description>
Le futur milieu de gamme de Samsung, le Galaxy A57, vient d'appara&#238;tre sur Geekbench. L'occasion de d&#233;couvrir les performances de son nouveau processeur Exynos 1680.
</description>
    </item>
    <item>
      <title>Garmin Vivoactive 5 : cette montre sportive not&#233;e 9/10 est &#224; moiti&#233; prix pour la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2611337_garmin-vivoactive-5-cette-montre-sportive-notee-9-10-est-a-moitie-prix-pour-la-black-friday-week</link>
      <pubDate>Sat, 22 Nov 2025 09:15:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2611337_garmin-vivoactive-5-cette-montre-sportive-notee-9-10-est-a-moitie-prix-pour-la-black-friday-week</guid>
      <description>
La Garmin Vivoactive 5 est une montre tourn&#233;e vers le sport qui poss&#232;de des capteurs qui se r&#233;v&#232;lent tr&#232;s pertinents et pr&#233;cis pour suivre vos activit&#233;s sportives et sant&#233;. Avec l'arriv&#233;e du nouveau mod&#232;le et la Black Friday Week en cours, cette excellente smartwatch est &#224; moiti&#233; prix. 
</description>
    </item>
    <item>
      <title>Les forces en jeu sont immenses : un compagnon cach&#233; est en train de remodeler la mort de cette &#233;toile</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-forces-jeu-sont-immenses-compagnon-cache-train-remodeler-mort-cette-etoile-127682/#xtor%3DRSS-8</link>
      <pubDate>Sat, 22 Nov 2025 10:12:00 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-forces-jeu-sont-immenses-compagnon-cache-train-remodeler-mort-cette-etoile-127682/#xtor%3DRSS-8</guid>
      <description>Une g&#233;ante rouge situ&#233;e &#224; des centaines de kilom&#232;tres de nous a &#233;t&#233; observ&#233;e en compagnie d'une autre &#233;toile qui semble lui causer des difficult&#233;s. Les m&#233;canismes &#224; l'&#339;uvre peuvent nous aider &#224; comprendre ce qui arrivera &#224; notre propre Soleil &#224; la fin de sa &#171;&#160;vie&#160;&#187;.</description>
    </item>
    <item>
      <title>Quel est le meilleur des iPhone : la s&#233;lection 2025 des mod&#232;les &#224; acheter (et ceux &#224; &#233;viter)</title>
      <link>https://www.frandroid.com/guide-dachat/smartphones/705312_meilleur-iphone</link>
      <pubDate>Sat, 22 Nov 2025 09:02:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/smartphones/705312_meilleur-iphone</guid>
      <description>
Faut-il acheter le dernier iPhone ou bien opter pour un autre smartphone de chez Apple ? C'est &#224; cette question que nous allons tenter de r&#233;pondre dans ce guide d'achat. Quel iPhone choisir ? Voici les conseils et recommandations de la r&#233;daction de Frandroid.
</description>
    </item>
    <item>
      <title>D&#233;couvrez les 20 pires mots de passe de France en 2025, 123456 a &#233;t&#233; d&#233;tr&#244;n&#233;</title>
      <link>https://www.01net.com/actualites/decouvrez-20-pires-mots-passe-france-2025-123456-detrone.html</link>
      <pubDate>Sat, 22 Nov 2025 09:01:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309240</guid>
      <description>NordPass d&#233;voile son palmar&#232;s annuel des pires mots de passe. En France et dans le reste du monde, les mauvaises habitudes ont la vie dure. Les internautes continuent en effet d'utiliser des mots de passe peu s&#233;curis&#233;s.</description>
    </item>
    <item>
      <title>How to get free Legos and redeemable loyalty points during Lego Insiders Weekend: Simply sign up for free</title>
      <link>https://mashable.com/article/black-friday-lego-deals-2025-free-lego-insiders-weekend</link>
      <pubDate>Sat, 22 Nov 2025 09:00:59 +0000</pubDate>
      <guid isPermaLink="false">03srUZdwDnoAnx51Rdg052k</guid>
      <description>Lego Insiders Weekend starts on Nov. 22. Sign up for free to access new Lego freebies and exclusive deals, plus earn points for coupons.</description>
    </item>
    <item>
      <title>Clean up and save up to $1,300 on Roborock's Black Friday vacuum cleaner deals</title>
      <link>https://www.techradar.com/home/robot-vacuums/clean-up-and-save-up-to-usd1-300-on-roborocks-black-friday-vacuum-cleaner-deals</link>
      <pubDate>Sat, 22 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">XWHWRdfyybZzA3tPL6tRSE</guid>
      <description>These Black Friday deals are pristine!</description>
    </item>
    <item>
      <title>Wicked: For Good will be on this streaming service first &#8211; save 16% on an annual subscription</title>
      <link>https://www.techradar.com/streaming/entertainment/wicked-for-good-will-be-on-this-streaming-service-first-save-16-percent-on-an-annual-subscription</link>
      <pubDate>Sat, 22 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">3cXNksB2mHC9567Za2Bs8j</guid>
      <description>Wicked: For Good won&#8217;t be available to stream until next year &#8211; but this is the subscription plan you&#8217;ll need when it does drop.</description>
    </item>
    <item>
      <title>Fnac et Darty donnent tout pour le week-end de la Black Friday Week : le TOP 15 des offres du moment</title>
      <link>https://www.frandroid.com/bons-plans/2869625_fnac-et-darty-donnent-tout-pour-le-week-end-de-la-black-friday-week-le-top-15-des-offres-du-moment</link>
      <pubDate>Sat, 22 Nov 2025 08:57:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2869625_fnac-et-darty-donnent-tout-pour-le-week-end-de-la-black-friday-week-le-top-15-des-offres-du-moment</guid>
      <description>
La Black Friday Week vient tout juste de d&#233;marrer chez la Fnac et Darty, et les nouvelles offres affluent d&#233;j&#224;. Pour vous faire gagner du temps, nous avons s&#233;lectionn&#233; les meilleures promotions du moment. 
</description>
    </item>
    <item>
      <title>Il liquide tous ses bitcoins&#160;: l&#8217;un des premiers investisseurs vend ses cryptos pour plus d&#8217;un milliard de dollars</title>
      <link>https://www.01net.com/actualites/liquide-tous-bitcoins-premiers-acheteurs-vend-toutes-cryptos-milliard-dollars.html</link>
      <pubDate>Sat, 22 Nov 2025 08:46:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310035</guid>
      <description>L&#8217;un des tout premiers investisseurs du Bitcoin vient de liquider l'int&#233;gralit&#233; de son portefeuille. Apr&#232;s plus d&#8217;une d&#233;cennie, il a vendu toutes ses cryptos pour plus d&#8217;un milliard de dollars. La vente survient alors que le cours du Bitcoin est en train de s'effondrer&#8230;</description>
    </item>
  </channel>
</rss>
