<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 27 Dec 2025 10:25:01 GMT</lastBuildDate>
    <item>
      <title>This &#163;315 Core Ultra 7 PC has 16GB RAM, 1TB SSD &#8212; Yes, this is probably the best PC deal of 2025 (yes, even for Pros)</title>
      <link>https://www.techradar.com/pro/this-gbp315-core-ultra-7-pc-has-16gb-ram-1tb-ssd-yes-this-is-probably-the-best-pc-deal-of-2025-yes-even-for-pros</link>
      <pubDate>Sat, 27 Dec 2025 10:20:40 +0000</pubDate>
      <guid isPermaLink="false">mDqkwpYnPiwfLQYiooXPMk</guid>
      <description>I tried to find a deal that's better than this one but I couldn't find anything that's remotely competitive pricewise</description>
    </item>
    <item>
      <title>The US Must Stop Underestimating Drone Warfare</title>
      <link>https://www.wired.com/story/the-us-must-stop-underestimating-drone-warfare/</link>
      <pubDate>Sat, 27 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">694035c5777520f8814e9360</guid>
      <description>The future of conflict is cheap, rapidly manufactured, and tough to defend against.</description>
    </item>
    <item>
      <title>Cette version sp&#233;ciale du Xiaomi 17 Ultra se vend d&#233;j&#224; comme des petits pains : voici les diff&#233;rences</title>
      <link>https://www.frandroid.com/marques/xiaomi/2921435_cette-version-speciale-du-xiaomi-17-ultra-se-vend-deja-comme-des-petits-pains-voici-les-differences</link>
      <pubDate>Sat, 27 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2921435_cette-version-speciale-du-xiaomi-17-ultra-se-vend-deja-comme-des-petits-pains-voici-les-differences</guid>
      <description>
Le Xiaomi 17 Ultra Leica Edition est une version un peu ch&#232;re du Xiaomi 17 Ultra qui conna&#238;t d&#233;j&#224; un succ&#232;s en Chine. Voici ce qui le diff&#233;rencie.
</description>
    </item>
    <item>
      <title>Scammers hit Christmas cheer with fake wine and festive gift emails - here's how to stay safe</title>
      <link>https://www.techradar.com/pro/security/scammers-hit-christmas-cheer-with-fake-wine-and-festive-gift-emails-heres-how-to-stay-safe</link>
      <pubDate>Sat, 27 Dec 2025 09:41:12 +0000</pubDate>
      <guid isPermaLink="false">yRsLWJptqAi5FpNaVbDoaT</guid>
      <description>Holiday-themed emails increasingly carry scams using loan forms, fake order confirmations, and credential harvesting to collect sensitive personal and financial information.</description>
    </item>
    <item>
      <title>Fujifilm's epic 40TB tape cartridge is here - despite what Elon Musk says, the future of offline data storage looks very bright</title>
      <link>https://www.techradar.com/pro/fujifilms-epic-40tb-tape-cartridge-is-here-despite-what-elon-musk-says-the-future-of-offline-data-storage-looks-very-bright</link>
      <pubDate>Sat, 27 Dec 2025 09:40:52 +0000</pubDate>
      <guid isPermaLink="false">gyDoV8EBLWsWrsyzeUpbV4</guid>
      <description>Fujifilm&#8217;s 40TB LTO-10 tape reinforces offline storage relevance as enterprises balance ransomware risk, regulatory demands, and growing AI driven archival volumes.</description>
    </item>
    <item>
      <title>10 must-read business books from 2025</title>
      <link>https://www.fastcompany.com/91460655/best-business-books-2025</link>
      <pubDate>2025-12-27T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91460655/best-business-books-2025</guid>
      <description>The list includes books that cover Nvidia&#8217;s coveted AI chips and the greatest crash on Wall Street in history.
From boardrooms to startup garages, leaders need ideas that work in the real world. These 10 books offer a broader perspective on business, helping us see the patterns behind the day-to-day grind.</description>
    </item>
    <item>
      <title>The &#8216;internet of beings&#8217; is the next fronteir that could change humanity and healthcare</title>
      <link>https://www.fastcompany.com/91452453/internet-of-beings-humanity-healthcare-medicine</link>
      <pubDate>2025-12-27T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91452453/internet-of-beings-humanity-healthcare-medicine</guid>
      <description>The idea of digitising human bodies inspires both dreams and nightmares. 
In the 1966 film Fantastic Voyage, a spacecraft and its crew are shrunk to microscopic size and injected into the body of an injured astronaut to remove a life-threatening blood clot from his brain. The Academy Award-winning movie&#8212;later developed into a novel by Isaac Asimov&#8212;seemed like pure fantasy at the time. However, it anticipated what could be the next revolution in medicine: the idea that ever-smaller and more sophisticated sensors are about to enter our bodies, connecting human beings to the internet....</description>
    </item>
    <item>
      <title>SUV, ludospaces ou vans : le grand comparatif des voitures &#233;lectriques 7 places</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-survoltes/2895521_quelles-sont-les-meilleures-voitures-electriques-7-places-pour-sa-famille</link>
      <pubDate>Sat, 27 Dec 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-survoltes/2895521_quelles-sont-les-meilleures-voitures-electriques-7-places-pour-sa-famille</guid>
      <description>
Malgr&#233; le d&#233;clin des monospaces et l&#8217;av&#232;nement des SUV, il existe toujours des voitures &#233;lectriques familiales. Nous avons s&#233;lectionn&#233; les meilleurs mod&#232;les vendus en France capables d'accueillir jusqu'&#224; 7 places.
</description>
    </item>
    <item>
      <title>Cette cyberattaque utilise ChatGPT pour pi&#233;ger les utilisateurs de Mac</title>
      <link>https://www.01net.com/actualites/cette-cyberattaque-utilise-chatgpt-pour-pieger-utilisateurs-mac.html</link>
      <pubDate>Sat, 27 Dec 2025 08:45:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316595</guid>
      <description>Une cyberattaque vise actuellement les utilisateurs de Mac. Pour pi&#233;ger les internautes, les pirates se servent d'une fonction de partage int&#233;gr&#233;e &#224; ChatGPT. L'attaque aboutit &#224; l'installation d'un virus capable de siphonner toutes vos donn&#233;es.</description>
    </item>
    <item>
      <title>Cyberattaque contre Mondial Relay&#160;: des pirates fran&#231;ais ont vol&#233; une montagne de donn&#233;es</title>
      <link>https://www.01net.com/actualites/cyberattaque-contre-mondial-relay-pirates-francais-vole-montagne-donnees.html</link>
      <pubDate>Sat, 27 Dec 2025 08:45:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317421</guid>
      <description>Mondial Relay indique avoir &#233;t&#233; la cible d'une cyberattaque. Des cybercriminels ont pu acc&#233;der &#224; des donn&#233;es personnelles et sensibles sur les clients et sur les colis envoy&#233;s. L'attaque a &#233;t&#233; revendiqu&#233;e par des hackers fran&#231;ais. Ils ont d'ailleurs mis en vente les informations compromises.</description>
    </item>
    <item>
      <title>La OnePlus Watch Lite est non seulement moins ch&#232;re, mais elle est fournie avec des OnePlus Nord Buds 3 Pro offerts</title>
      <link>https://www.frandroid.com/bons-plans/2921093_la-oneplus-watch-lite-est-non-seulement-moins-chere-mais-elle-est-fournie-avec-des-oneplus-nord-buds-3-pro-offerts</link>
      <pubDate>Sat, 27 Dec 2025 08:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2921093_la-oneplus-watch-lite-est-non-seulement-moins-chere-mais-elle-est-fournie-avec-des-oneplus-nord-buds-3-pro-offerts</guid>
      <description>
Endurante et bourr&#233;e de fonctions de sant&#233;, la OnePlus Watch Lite est une montre connect&#233;e efficace, que l'on peut m&#234;me connecter &#224; deux smartphones en m&#234;me temps. Actuellement, vous la trouverez &#224; 139 euros au lieu de 179 euros sur le site de la marque, qui offre en plus une paire de OnePlus Nord Buds 3 Pro, not&#233;s 9/10.
</description>
    </item>
  </channel>
</rss>
