<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 18 Nov 2025 10:48:14 GMT</lastBuildDate>
    <item>
      <title>Cette nouveaut&#233; de Garmin pourrait rendre ses montres bien plus pratiques &#224; utiliser au quotidien</title>
      <link>https://www.frandroid.com/marques/garmin/2873181_cette-nouveaute-de-garmin-pourrait-rendre-ses-montres-bien-plus-pratiques-a-utiliser-au-quotidien</link>
      <pubDate>Tue, 18 Nov 2025 10:32:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/garmin/2873181_cette-nouveaute-de-garmin-pourrait-rendre-ses-montres-bien-plus-pratiques-a-utiliser-au-quotidien</guid>
      <description>
La couronne rotative de Garmin, attendue pour ses futures montres, devrait aussi faire office de bouton. De quoi r&#233;duire significativement le nombre de touches sur les montres de la marque. 
</description>
    </item>
    <item>
      <title>Chrome en danger&#160;: des pirates exploitent une nouvelle faille du moteur V8, installez la mise &#224; jour</title>
      <link>https://www.01net.com/actualites/chrome-en-danger-des-pirates-exploitent-une-nouvelle-faille-du-moteur-v8-installez-la-mise-a-jour.html</link>
      <pubDate>Tue, 18 Nov 2025 10:32:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308888</guid>
      <description>Google vient de d&#233;couvrir deux vuln&#233;rabilit&#233;s majeures dans le moteur V8, qui g&#232;re l&#8217;ex&#233;cution du code JavaScript dans Chrome. Une des failles a &#233;t&#233; exploit&#233;e dans des cyberattaques. Google a d&#233;ploy&#233; un correctif pour prot&#233;ger ses utilisateurs.</description>
    </item>
    <item>
      <title>In 1988 Samsung Predicted Computer Dating by 2025</title>
      <link>https://gizmodo.com/in-1988-samsung-predicted-computer-dating-by-2025-2000687264</link>
      <pubDate>Tue, 18 Nov 2025 10:30:46 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687264</guid>
      <description>Finding romance with a computer was considered absurd in 1988.</description>
    </item>
    <item>
      <title>Bruxelles va bien passer au crible Amazon, Microsoft et le secteur du cloud</title>
      <link>https://www.01net.com/actualites/bruxelles-va-bien-passer-au-crible-amazon-microsoft-et-le-secteur-du-cloud.html</link>
      <pubDate>Tue, 18 Nov 2025 10:29:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308899</guid>
      <description>Cette fois, la Commission europ&#233;enne va bien examiner attentivement le secteur du cloud, ultra domin&#233; en Europe par trois entreprises am&#233;ricaines : AWS, Azure et Google Cloud. Bruxelles annonce ouvrir deux enqu&#234;tes visant les deux premi&#232;res soci&#233;t&#233;s, sous l'&#233;gide du DMA, une premi&#232;re. Une troisi&#232;me enqu&#234;te vise &#224; d&#233;terminer si le secteur du cloud, jusque-l&#224; &#233;pargn&#233; par ce r&#232;glement europ&#233;en, doit y &#234;tre soumis....</description>
    </item>
    <item>
      <title>Boulanger casse d&#233;j&#224; le prix du Google Pixel 10 Pro, en pack avec ses chargeurs 67 W et sans fil PixelSnap 25 W, lors du pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2872893_boulanger-casse-deja-le-prix-du-google-pixel-10-pro-en-pack-avec-ses-chargeurs-67-w-et-sans-fil-pixelsnap-25-w-lors-du-pre-black-friday</link>
      <pubDate>Tue, 18 Nov 2025 10:25:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2872893_boulanger-casse-deja-le-prix-du-google-pixel-10-pro-en-pack-avec-ses-chargeurs-67-w-et-sans-fil-pixelsnap-25-w-lors-du-pre-black-friday</guid>
      <description>
Le tout nouveau fer de lance de Google, le Pixel 10 Pro, d&#233;barque dans ce presque Black Friday avec un bundle qui recharge. &#192; l&#8217;int&#233;rieur : tout ce qu&#8217;il faut pour le recharger comme il faut, en rapide et m&#234;me en sans-fil gr&#226;ce &#224; la nouveaut&#233; PixelSnap. Avec une offre de reprise, l&#8217;ensemble tombe &#224; 899 euros au lieu de 1 249 euros chez Boulanger.
</description>
    </item>
    <item>
      <title>Honor s&#8217;inspire du design de l&#8217;iPhone Air, mais avec une batterie deux fois plus grosse</title>
      <link>https://www.frandroid.com/marques/honor/2871623_honor-copie-le-design-de-liphone-air-mais-avec-une-batterie-deux-fois-plus-grosse</link>
      <pubDate>Tue, 18 Nov 2025 10:22:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/honor/2871623_honor-copie-le-design-de-liphone-air-mais-avec-une-batterie-deux-fois-plus-grosse</guid>
      <description>
Honor s'appr&#234;te &#224; lancer les Honor 500 et 500 Pro le 24 novembre en Chine. Deux smartphones qui empruntent clairement leur design &#224; l'iPhone Air d'Apple, mais qui cachent une diff&#233;rence de taille : une batterie de 8000 mAh. Soit presque le double de ce qu'on trouve habituellement dans un smartphone.
</description>
    </item>
    <item>
      <title>Amazon lance une vague de promotions pour le pr&#233;-Black Friday : les 21 offres &#224; ne pas louper</title>
      <link>https://www.frandroid.com/bons-plans/2860071_amazon-lance-une-vague-de-promotions-pour-le-pre-black-friday-les-18-offres-a-ne-pas-louper</link>
      <pubDate>Tue, 18 Nov 2025 10:20:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860071_amazon-lance-une-vague-de-promotions-pour-le-pre-black-friday-les-18-offres-a-ne-pas-louper</guid>
      <description>
Amazon d&#233;bute ses offres avant le Black Friday avec une premi&#232;re s&#233;rie de promotions attractives sur les produits Tech : smartphones, ordinateurs, casques audio et consoles voient leurs prix baisser. D&#233;couvrez les meilleures offres &#224; saisir d&#232;s maintenant.
</description>
    </item>
    <item>
      <title>Lock in 25% savings on Webflow&#8217;s annual site and workspace plans</title>
      <link>https://www.techradar.com/pro/lock-in-25-percent-savings-on-webflows-annual-site-and-workspace-plans</link>
      <pubDate>Tue, 18 Nov 2025 10:17:45 +0000</pubDate>
      <guid isPermaLink="false">pRGsBiGQLHrVjT7AC5Njsj</guid>
      <description>Give a boost to your website with this Black Friday Webflow deal.</description>
    </item>
    <item>
      <title>Le Galaxy S26 Ultra pourrait changer la donne gr&#226;ce cette grosse am&#233;lioration photo</title>
      <link>https://www.frandroid.com/marques/samsung/2873119_le-galaxy-s26-ultra-pourrait-changer-la-donne-grace-cette-grosse-amelioration-photo</link>
      <pubDate>Tue, 18 Nov 2025 10:14:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2873119_le-galaxy-s26-ultra-pourrait-changer-la-donne-grace-cette-grosse-amelioration-photo</guid>
      <description>
Si le capteur de 200 Mpx de Samsung devrait &#234;tre conserv&#233; sur le S26 Ultra, l'optique b&#233;n&#233;ficierait d'une ouverture bien plus grande, promettant de belles am&#233;liorations en basse lumi&#232;re.
</description>
    </item>
    <item>
      <title>Mauvaise nouvelle : Tesla augmente les prix de sa Model 3 d&#8217;entr&#233;e de gamme</title>
      <link>https://www.frandroid.com/marques/tesla/2873083_mauvaise-nouvelle-tesla-augmente-les-prix-de-sa-model-3-dentree-de-gamme</link>
      <pubDate>Tue, 18 Nov 2025 10:03:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2873083_mauvaise-nouvelle-tesla-augmente-les-prix-de-sa-model-3-dentree-de-gamme</guid>
      <description>
Tesla vient d'augmenter le prix de sa Model 3 Propulsion de 2 000 euros, la faisant passer au-dessus du seuil psychologique des 40 000 euros. Son rapport qualit&#233;/prix reste difficilement battable.
</description>
    </item>
    <item>
      <title>Gemini 3 expected to launch this week - 5 big upgrades that could make the chatbot better than ChatGPT</title>
      <link>https://www.techradar.com/ai-platforms-assistants/gemini/gemini-3-expected-to-launch-this-week-5-big-upgrades-that-could-make-the-chatbot-better-than-chatgpt</link>
      <pubDate>Tue, 18 Nov 2025 10:02:44 +0000</pubDate>
      <guid isPermaLink="false">r2ZaAymHGDFcJa7hUmVefj</guid>
      <description>The 5 things Google needs to do to beat ChatGPT with the launch of Gemini 3.</description>
    </item>
    <item>
      <title>Microsoft d&#233;joue une attaque DDoS surpuissante contre ses serveurs Azure</title>
      <link>https://www.01net.com/actualites/microsoft-dejoue-une-attaque-ddos-surpuissante-contre-ses-serveurs-azure.html</link>
      <pubDate>Tue, 18 Nov 2025 10:01:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308866</guid>
      <description>Microsoft a d&#233;jou&#233; une attaque DDoS de 15,72 t&#233;rabits par seconde contre ses serveurs Azure. Lanc&#233;e depuis plus de 500&#8239;000 appareils connect&#233;s compromis, elle s'est impos&#233;e comme &#171;&#8239;la plus importante attaque DDoS jamais observ&#233;e dans le cloud&#8239;&#187;.</description>
    </item>
    <item>
      <title>Company Behind AI Actress Tilly Norwood Teams Up with the History Channel</title>
      <link>https://gizmodo.com/company-behind-ai-actress-tilly-norwood-teams-up-with-the-history-channel-2000687261</link>
      <pubDate>Tue, 18 Nov 2025 10:00:47 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687261</guid>
      <description>It's not aliens. It's AI.</description>
    </item>
    <item>
      <title>J-1 avant la fin du Single Day AliExpress : voici les toutes derni&#232;res offres high-tech &#224; saisir [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2857195_j-2-avant-la-fin-du-single-day-aliexpress-voici-les-dernieres-offres-high-tech-a-saisir</link>
      <pubDate>Tue, 18 Nov 2025 10:00:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2857195_j-2-avant-la-fin-du-single-day-aliexpress-voici-les-dernieres-offres-high-tech-a-saisir</guid>
      <description>
Connaissez-vous le Single Day ? Venue de Chine, cette f&#234;te propuls&#233;e en France par AliExpress est une occasion r&#234;v&#233;e pour faire le plein de bonnes affaires. D&#233;couvrez les meilleurs bons plans tech de cette journ&#233;e devenue iconique.
</description>
    </item>
    <item>
      <title>A study of 1 million people reveals a key ingredient for happiness that most leaders ignore</title>
      <link>https://www.fastcompany.com/91442433/study-1-million-people-key-ingredient-happiness-trust</link>
      <pubDate>2025-11-18T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91442433/study-1-million-people-key-ingredient-happiness-trust</guid>
      <description>It could be the most important perk.
What&#8217;s one thing every leader can do to make sure employees are&#160;happy at work&#160;and engaged with their jobs? Make sure they can trust in you, your organization, and one another. That&#8217;s the finding in a 2024 meta-analysis of studies with more than 1 million participants. When leaders seek to&#160;improve employee well-being, they typically think about things like remote work, flexible schedules, and wellness offerings such as gym memberships. But trust may be the most valuable perk of all....</description>
    </item>
    <item>
      <title>Tim Cook may leave Apple as soon as next year. Here&#8217;s who could replace him</title>
      <link>https://www.fastcompany.com/91443634/tim-cook-apple-iphone-ternus-retirement</link>
      <pubDate>2025-11-18T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91443634/tim-cook-apple-iphone-ternus-retirement</guid>
      <description>A Financial Times story has created a flurry of speculation about at least one top contender.
Tim Cook has led Apple for the past 14 years. In that time, the company&#8217;s market cap has jumped from $348 billion to $4 trillion. While his predecessor, Steve Jobs, might have been a leader in the field of innovation, few CEOs have shown the business acumen of Cook. But according to a report in the Financial Times, Cook&#8217;s run as CEO could be over as soon as next year....</description>
    </item>
    <item>
      <title>USPS is raising prices: What to know about package shipping, stamps, and other post office services in 2026</title>
      <link>https://www.fastcompany.com/91443650/usps-is-raising-prices-what-to-know-about-package-shipping-stamps-post-office-postal-service-in-2026</link>
      <pubDate>2025-11-18T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91443650/usps-is-raising-prices-what-to-know-about-package-shipping-stamps-post-office-postal-service-in-2026</guid>
      <description>Consumer costs will go up after the agency posted a $9 billion loss this year&#8212;but the good news is, the changes won&#8217;t affect this holiday season.
If it seems like everything is getting more expensive, you&#8217;re right. Thanks to inflation (up 3%), which has affected goods from food to gas (for which prices are up 4.1%), you can now add the post office to the the long list of places where you&#8217;ll have to pay more....</description>
    </item>
    <item>
      <title>Windows 11&#160;: Microsoft admet que son nouvel Agent IA met en p&#233;ril &#171;&#160;la s&#233;curit&#233; de votre appareil&#160;&#187;</title>
      <link>https://www.01net.com/actualites/windows-11-microsoft-admet-que-son-nouvel-agent-ia-met-en-peril-la-securite-de-votre-appareil.html</link>
      <pubDate>Tue, 18 Nov 2025 09:57:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308890</guid>
      <description>Microsoft vient de d&#233;ployer, aupr&#232;s des Insiders, une mise &#224; jour qui introduit un agent IA qui s&#8217;ex&#233;cute en arri&#232;re-plan et acc&#232;de &#224; tous vos fichiers. Un module qui n&#8217;est a priori pas sans risque pour la s&#233;curit&#233; de votre PC, et qui n&#8217;a pas fini de faire parler.</description>
    </item>
    <item>
      <title>What technology leaders need to ensure AI delivers</title>
      <link>https://www.techradar.com/pro/what-technology-leaders-need-to-ensure-ai-delivers</link>
      <pubDate>Tue, 18 Nov 2025 09:50:01 +0000</pubDate>
      <guid isPermaLink="false">zmjNFjrzMJjAG45cU26Gk</guid>
      <description>The possibilities of AI are limitless, but so is the price tag.</description>
    </item>
    <item>
      <title>The next iOS 26.2 beta has landed, and it includes a handy new AirDrop feature and a hint at big voice assistant changes</title>
      <link>https://www.techradar.com/phones/ios/the-next-ios-26-2-beta-has-landed-and-it-includes-a-handy-new-airdrop-feature-and-a-hint-at-big-voice-assistant-changes</link>
      <pubDate>Tue, 18 Nov 2025 09:48:54 +0000</pubDate>
      <guid isPermaLink="false">WD5oAhBzgrF6EU5xwxMSYM</guid>
      <description>The third iOS 26.3 beta includes AirDrop codes, third-party access to hypertension notifications, and the possibility of ditching Siri in future.</description>
    </item>
    <item>
      <title>En pleine crise apr&#232;s le retrait de Bosch, le salon v&#233;lo n&#176;1 d&#8217;Europe multiplie les gestes d&#8217;apaisement</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2873123_en-pleine-crise-apres-le-retrait-de-bosch-le-salon-velo-n1-deurope-multiplie-les-gestes-dapaisement</link>
      <pubDate>Tue, 18 Nov 2025 09:48:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2873123_en-pleine-crise-apres-le-retrait-de-bosch-le-salon-velo-n1-deurope-multiplie-les-gestes-dapaisement</guid>
      <description>
Eurobike est confront&#233; &#224; une crise majeure apr&#232;s le retrait du ZIV, de Zukunft Fahrrad puis de Bosch, fragilisant l&#8217;&#233;quilibre du salon. Pour tenter de r&#233;tablir le dialogue avec la fili&#232;re, l&#8217;organisateur Fairnamic lance un comit&#233; consultatif charg&#233; de recr&#233;er du lien avec les acteurs du secteur.
</description>
    </item>
    <item>
      <title>The Jackery Explorer 1000 v2 has hit its best-ever price ahead of Black Friday &#8212; score this popular power station for under $350</title>
      <link>https://mashable.com/article/nov-18-jackery-1000-v2-deal</link>
      <pubDate>Tue, 18 Nov 2025 09:47:34 +0000</pubDate>
      <guid isPermaLink="false">06L9d61aDtkEoQfkawmxLE9</guid>
      <description>Find the best early Black Friday portable power station deal. Save 22% on the Jackery Explorer 1000 v2 at Amazon.</description>
    </item>
    <item>
      <title>Pourquoi votre chargeur fait ce bruit aigu et quand faut-il s&#8217;inqui&#233;ter ?</title>
      <link>https://www.frandroid.com/produits-android/accessoires/2873073_pourquoi-votre-chargeur-fait-ce-bruit-aigu-et-quand-faut-il-sinquieter</link>
      <pubDate>Tue, 18 Nov 2025 09:42:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires/2873073_pourquoi-votre-chargeur-fait-ce-bruit-aigu-et-quand-faut-il-sinquieter</guid>
      <description>
Vous l'avez forc&#233;ment remarqu&#233; : votre chargeur &#233;met parfois un sifflement aigu, surtout quand vous rechargez rapidement. Ce bruit vient des bobines &#233;lectroniques qui vibrent &#224; l'int&#233;rieur de l'adaptateur. C'est g&#233;n&#233;ralement normal, mais il y a des cas o&#249; ce sifflement r&#233;v&#232;le un vrai probl&#232;me de s&#233;curit&#233;.
</description>
    </item>
    <item>
      <title>The Roborock Qrevo CurvX is at its lowest-ever price ahead of Black Friday &#8212; save over $600 at Amazon</title>
      <link>https://mashable.com/article/nov-18-roborock-qrevo-robot-vacuum-deal</link>
      <pubDate>Tue, 18 Nov 2025 09:41:58 +0000</pubDate>
      <guid isPermaLink="false">01JKS1uY9cXTYMeBqmboTuS</guid>
      <description>Find the best early Black Friday robot vacuum deal.Save 43% on the roborock Qrevo CurvX at Amazon right now.</description>
    </item>
    <item>
      <title>Personne ne veut des voitures &#233;lectriques &#224; 1 000 kilom&#232;tres d&#8217;autonomie : cette marque chinoise la fait dispara&#238;tre de son catalogue</title>
      <link>https://www.frandroid.com/marques/nio/2871469_personne-ne-veut-des-voitures-electriques-a-1-000-kilometres-dautonomie-cette-marque-chinoise-la-fait-disparaitre-de-son-catalogue</link>
      <pubDate>Tue, 18 Nov 2025 09:37:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nio/2871469_personne-ne-veut-des-voitures-electriques-a-1-000-kilometres-dautonomie-cette-marque-chinoise-la-fait-disparaitre-de-son-catalogue</guid>
      <description>
Le constructeur chinois Nio vient de mettre fin &#224; la production de sa batterie semi-solide permettant de parcourir 1 000 kilom&#232;tres. Une d&#233;cision prise alors que la demande n&#8217;est pas au rendez-vous pour ses voitures &#233;lectriques &#224; grande autonomie.
</description>
    </item>
    <item>
      <title>This AI-powered Shark robot vacuum is down to its best-ever price before Black Friday &#8212; save over $300 right now</title>
      <link>https://mashable.com/article/nov-18-shark-robot-vacuum-deal</link>
      <pubDate>Tue, 18 Nov 2025 09:37:21 +0000</pubDate>
      <guid isPermaLink="false">04ic6clQBPgGavb4pIoknna</guid>
      <description>Find the best robot vacuum deals at Black Friday. Save 55% on the Shark AV2501AE AI at Amazon.</description>
    </item>
    <item>
      <title>Microsoft veut transformer Windows en &#171;&#160;OS Agentique&#160;&#187; : voici ce qui change pour vous</title>
      <link>https://www.frandroid.com/marques/microsoft/2872783_microsoft-veut-transformer-windows-en-os-agentique-voici-ce-qui-change-pour-vous</link>
      <pubDate>Tue, 18 Nov 2025 09:32:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2872783_microsoft-veut-transformer-windows-en-os-agentique-voici-ce-qui-change-pour-vous</guid>
      <description>
Microsoft d&#233;voile la pr&#233;sence d'un espace de travail agentique sur Windows 11. L'occasion pour la firme d'entrer dans les d&#233;tails de sa strat&#233;gie IA. 
</description>
    </item>
    <item>
      <title>Why the placeholder icon is two mountain peaks&#8212;and what they might symbolize</title>
      <link>https://www.fastcompany.com/91442333/placeholder-icon-mountain-peaks-symbolic-meaning</link>
      <pubDate>2025-11-18T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91442333/placeholder-icon-mountain-peaks-symbolic-meaning</guid>
      <description>The little mountain icon has become the standard symbol to signal something missing or something to come. 
It&#8217;s happened to you countless times: You&#8217;re waiting for a website to load, only to see a box with a little mountain range where an image should be. It&#8217;s the placeholder icon for a &#8220;missing image.&#8221;</description>
    </item>
    <item>
      <title>&#171;&#160;Le hardware reste au coeur&#160;&#187; : Microsoft tente de rassurer sur l&#8217;avenir de la console Xbox dans un climat d&#8217;incertitude</title>
      <link>https://www.frandroid.com/marques/microsoft/2872909_le-hardware-reste-au-coeur-microsoft-tente-de-rassurer-sur-lavenir-de-la-console-xbox-dans-un-climat-dincertitude</link>
      <pubDate>Tue, 18 Nov 2025 09:29:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2872909_le-hardware-reste-au-coeur-microsoft-tente-de-rassurer-sur-lavenir-de-la-console-xbox-dans-un-climat-dincertitude</guid>
      <description>
Malgr&#233; sa nouvelle strat&#233;gie d'expansion logicielle, Xbox r&#233;it&#232;re sa priorit&#233; de proposer une exp&#233;rience mat&#233;rielle "de nouvelle g&#233;n&#233;ration" avec sa future console.
</description>
    </item>
    <item>
      <title>The Bluetti Apex 300 power station is $1,000 off ahead of Black Friday &#8212; get the best-ever price on Amazon</title>
      <link>https://mashable.com/article/nov-18-bluetti-apex-300-deal</link>
      <pubDate>Tue, 18 Nov 2025 09:29:34 +0000</pubDate>
      <guid isPermaLink="false">06bRp2ptVKlei8PkfZQ6CEL</guid>
      <description>Find the best early Black Friday power station deal. Save 42% on the Bluetti Apex 300 at Amazon.</description>
    </item>
    <item>
      <title>Galaxy&#160;S26&#160;: le dilemme de Samsung sur la RAM</title>
      <link>https://www.frandroid.com/marques/samsung/2872939_galaxy-s26-le-dilemme-de-samsung-sur-la-ram</link>
      <pubDate>Tue, 18 Nov 2025 09:28:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2872939_galaxy-s26-le-dilemme-de-samsung-sur-la-ram</guid>
      <description>
Alors qu&#8217;il ne reste plus qu&#8217;une poign&#233;e de semaines avant la sortie pr&#233;sum&#233;e des Galaxy&#160;S26, voil&#224; que de nouvelles rumeurs nous en apprennent un peu plus sur les caract&#233;ristiques techniques des t&#233;l&#233;phones, notamment au niveau de la RAM, qui n&#8217;&#233;voluerait que peu par rapport aux derniers mod&#232;les.
</description>
    </item>
    <item>
      <title>Que signifient les chiffres sur les cartes SD et microSD (U1, U3, V30, C10, SD Express, UHS-I, UHS-II, UHS-III, SDHC, SDXC, SDUC) ?</title>
      <link>https://www.frandroid.com/comment-faire/tutoriaux/tutoriels-photo-video/2872977_que-signifient-les-chiffres-sur-les-cartes-sd-et-microsd-u1-u3-v30-c10-sd-express-uhs-i-uhs-ii-uhs-iii-sdhc-sdxc-sduc</link>
      <pubDate>Tue, 18 Nov 2025 09:23:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/comment-faire/tutoriaux/tutoriels-photo-video/2872977_que-signifient-les-chiffres-sur-les-cartes-sd-et-microsd-u1-u3-v30-c10-sd-express-uhs-i-uhs-ii-uhs-iii-sdhc-sdxc-sduc</guid>
      <description>
Vous venez d'acheter un appareil photo ou une GoPro, et on vous demande d'installer une carte SD. Probl&#232;me : sur l'emballage, vous d&#233;couvrez des symboles myst&#233;rieux comme U3, V30, C10 ou UHS-I. Pas de panique, on vous explique ce que tout cela signifie et comment choisir la bonne carte pour votre usage.
</description>
    </item>
    <item>
      <title>&#171; Une exp&#233;rience fascinante &#187; : voici les premiers avis sur le volant r&#233;volutionnaire des futures voitures &#233;lectriques de Peugeot</title>
      <link>https://www.frandroid.com/marques/peugeot/2872379_une-experience-fascinante-voici-les-premiers-avis-sur-le-volant-revolutionnaire-des-futures-voitures-electriques-de-peugeot</link>
      <pubDate>Tue, 18 Nov 2025 09:23:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/peugeot/2872379_une-experience-fascinante-voici-les-premiers-avis-sur-le-volant-revolutionnaire-des-futures-voitures-electriques-de-peugeot</guid>
      <description>
Attendu sur les prochaines voitures &#233;lectriques de Peugeot, le volant Hypersquare tient-il ses promesses&#160;? C&#8217;est ce qu&#8217;ont pu v&#233;rifier certains journalistes britanniques lors d'une prise en main en avant-premi&#232;re.
</description>
    </item>
    <item>
      <title>Android Auto teste ces nouveaux r&#233;glages pour personnaliser l&#8217;&#233;cran d&#8217;accueil</title>
      <link>https://www.01net.com/actualites/android-auto-teste-nouveaux-reglages-personnaliser-ecran-accueil.html</link>
      <pubDate>Tue, 18 Nov 2025 09:20:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308860</guid>
      <description>Android Auto continue d&#8217;avancer sur les widgets et teste aussi une nouvelle barre de navigation. On fait le point sur ces nouveaut&#233;s qui permettent de mieux personnaliser l&#8217;&#233;cran d&#8217;accueil.</description>
    </item>
    <item>
      <title>Le Wand Lick 3-in-1 Review: Three Times the Pleasure</title>
      <link>https://www.wired.com/review/le-wand-lick-3-in-1/</link>
      <pubDate>Tue, 18 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">691b9c1d2d19dc17f7c6479e</guid>
      <description>This double-ended vibrator gives you a bit of everything in one unique-looking package.</description>
    </item>
    <item>
      <title>How to watch Davis Cup Finals 2025: live stream tennis online, TV channel, order of play</title>
      <link>https://www.techradar.com/how-to-watch/tennis/davis-cup-finals-2025</link>
      <pubDate>Tue, 18 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">5U5RDpUydrMCjhZdeQTyAG</guid>
      <description>Watch the 2025 Davis Cup tennis tournament as hosts Italy attempt to defend their title. Here's the schedule, TV channels, broadcasters and streams.</description>
    </item>
    <item>
      <title>Why do smart people do dumb things?</title>
      <link>https://www.fastcompany.com/91439582/why-smart-people-do-dumb-things</link>
      <pubDate>2025-11-18T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91439582/why-smart-people-do-dumb-things</guid>
      <description>IQ, EQ, and coachability all play a part.
What does it mean to be &#8220;smart&#8221; or &#8220;dumb&#8221;? Few questions are more deceptively complex.</description>
    </item>
  </channel>
</rss>
