<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 10 Dec 2025 08:34:59 GMT</lastBuildDate>
    <item>
      <title>Bug de l&#8217;an 2038 : quel est ce probl&#232;me qui va mettre &#224; l&#8217;arr&#234;t huit lignes de m&#233;tro &#224; Paris et le RER A</title>
      <link>https://www.frandroid.com/culture-tech/securite-applications/2904267_bug-de-lan-2038-quel-est-ce-probleme-qui-va-mettre-a-larret-huit-lignes-de-metro-a-paris-et-le-rer-a</link>
      <pubDate>Wed, 10 Dec 2025 08:18:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/securite-applications/2904267_bug-de-lan-2038-quel-est-ce-probleme-qui-va-mettre-a-larret-huit-lignes-de-metro-a-paris-et-le-rer-a</guid>
      <description>
Un &#171; d&#233;faut logiciel grave &#187; a &#233;t&#233; signal&#233; par Alstom concernant le mat&#233;riel roulant dans les transports parisiens. Un probl&#232;me pourtant connu de longue date.
</description>
    </item>
    <item>
      <title>Google Maps sur iOS ajoute enfin cette fonction pourtant &#233;vidente</title>
      <link>https://www.01net.com/actualites/google-maps-ios-ajoute-enfin-fonction-pourtant-evidente.html</link>
      <pubDate>Wed, 10 Dec 2025 08:15:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314654</guid>
      <description>Google Maps active enfin une &#171; nouveaut&#233; &#187; sur iOS que l&#8217;on retrouve depuis des ann&#233;es chez certains concurrents.</description>
    </item>
    <item>
      <title>Mettez &#224; jour Windows d&#8217;urgence&#160;: Microsoft corrige 3 failles zero day qui menacent votre PC</title>
      <link>https://www.01net.com/actualites/mettez-jour-windows-urgence-microsoft-corrige-3-failles-zero-day.html</link>
      <pubDate>Wed, 10 Dec 2025 08:00:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314652</guid>
      <description>Microsoft termine l&#8217;ann&#233;e avec un Patch Tuesday qui colmate 57 failles de s&#233;curit&#233;. Parmi ces failles, on trouve surtout trois vuln&#233;rabilit&#233;s zero day qui peuvent permettre &#224; un attaquant de prendre le contr&#244;le complet de l'ordinateur. Une des failles est activement exploit&#233;e dans des cyberattaques.</description>
    </item>
    <item>
      <title>Kids and Teen Influencers in Australia Say &#8216;Bye-Bye&#8217; to Social Media</title>
      <link>https://www.wired.com/story/kids-and-teen-influencers-in-australia-say-goodbye-to-social-media/</link>
      <pubDate>Wed, 10 Dec 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">69274781797e25fba822c967</guid>
      <description>Starting Wednesday, Australia will prohibit kids under 16 from using social platforms. For youth content creators, it means logging off or finding creative ways to post anyway.</description>
    </item>
    <item>
      <title>Windows 11 est cass&#233; : Microsoft veut revenir aux &#171; fondamentaux en mati&#232;re de performances &#187;</title>
      <link>https://www.frandroid.com/marques/microsoft/2904257_windows-11-est-casse-microsoft-veut-revenir-aux-fondamentaux-en-matiere-de-performances</link>
      <pubDate>Wed, 10 Dec 2025 07:35:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2904257_windows-11-est-casse-microsoft-veut-revenir-aux-fondamentaux-en-matiere-de-performances</guid>
      <description>
Microsoft veut refaire passer Windows devant Linux en mati&#232;re d'optimisation et de performances.
</description>
    </item>
    <item>
      <title>&#171;&#8201;Un v&#233;ritable tournant pour cette cat&#233;gorie de produits&#8201;&#187;&#160;: l&#8217;iPhone pliable a d&#233;j&#224; une sacr&#233;e pression sur les &#233;paules</title>
      <link>https://www.frandroid.com/marques/apple/2904259_un-veritable-tournant-pour-cette-categorie-de-produits-liphone-pliable-a-deja-une-sacree-pression-sur-les-epaules</link>
      <pubDate>Wed, 10 Dec 2025 07:32:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2904259_un-veritable-tournant-pour-cette-categorie-de-produits-liphone-pliable-a-deja-une-sacree-pression-sur-les-epaules</guid>
      <description>
Alors que Samsung s&#8217;&#233;chine &#224; d&#233;mocratiser les smartphones pliables depuis bient&#244;t sept ans, le c&#233;l&#232;bre cabinet d&#8217;analyse IDC pr&#233;dit que le secteur ne d&#233;collera vraiment qu&#8217;avec l&#8217;arriv&#233;e du prochain iPhone.
</description>
    </item>
    <item>
      <title>Une nouvelle option d&#233;barque dans Apple Pay pour payer en plusieurs fois</title>
      <link>https://www.01net.com/actualites/une-nouvelle-option-debarque-dans-apple-pay-pour-payer-en-plusieurs-fois.html</link>
      <pubDate>Wed, 10 Dec 2025 07:30:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314646</guid>
      <description>En cette p&#233;riode d&#8217;achats fr&#233;n&#233;tiques de cadeaux pour les f&#234;tes de fin d&#8217;ann&#233;e, les finances ont parfois du mal &#224; suivre (et c&#8217;est un euph&#233;misme). La prudence recommande d&#8217;y aller mollo sur le portefeuille, mais dans certains cas on peut avoir besoin d&#8217;un coup de pouce. Apple Pay vient justement d&#8217;int&#233;grer le service de paiement &#233;chelonn&#233; Klarna en France....</description>
    </item>
    <item>
      <title>01net Awards&#160;: le meilleur produit maison connect&#233;e de 2025 est&#8230;</title>
      <link>https://www.01net.com/actualites/01net-awards-le-meilleur-produit-maison-connectee-de-2025-est.html</link>
      <pubDate>Wed, 10 Dec 2025 07:25:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314386</guid>
      <description>La r&#233;daction de 01net.com d&#233;signe les meilleurs produits de l&#8217;ann&#233;e. D&#233;couvrez tous les jours les vainqueurs de chaque cat&#233;gorie jusqu&#8217;&#224; la remise des prix le 10 d&#233;cembre, en live s&#8217;il vous plait !</description>
    </item>
    <item>
      <title>Alexa s&#8217;invite &#224; la maison avec cette enceinte Echo Dot derni&#232;re g&#233;n&#233;ration en promo &#224; -53 %</title>
      <link>https://www.frandroid.com/bons-plans/2903589_alexa-sinvite-a-la-maison-avec-cette-enceinte-echo-dot-derniere-generation-en-promo-a-53</link>
      <pubDate>Wed, 10 Dec 2025 07:10:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2903589_alexa-sinvite-a-la-maison-avec-cette-enceinte-echo-dot-derniere-generation-en-promo-a-53</guid>
      <description>
L'Echo Dot 5 nouvelle g&#233;n&#233;ration est une enceinte connect&#233;e embarquant l'assistant vocal Alexa d'Amazon &#224; retrouver pour 29,99 euros sur Amazon et Boulanger, au lieu de 64,99 euros.
</description>
    </item>
    <item>
      <title>Les meilleurs bo&#238;tiers PC : lequel choisir pour son PC gamer en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-hardware/760019_boitier-pc-quel-boitier-choisir-pour-monter-son-pc-gamer</link>
      <pubDate>Wed, 10 Dec 2025 07:09:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-hardware/760019_boitier-pc-quel-boitier-choisir-pour-monter-son-pc-gamer</guid>
      <description>
Bienvenue sur notre comparatif des meilleurs bo&#238;tiers PC pour monter votre PC gamer de r&#234;ve. Compact, RGB, pas cher&#8230; nous avons s&#233;lectionn&#233; pour vous les meilleurs bo&#238;tiers PC disponibles, &#224; tous les prix.
</description>
    </item>
    <item>
      <title>La bague Index 01 de Pebble ne sait faire qu&#8217;une seule chose</title>
      <link>https://www.01net.com/actualites/la-bague-index-01-de-pebble-ne-sait-faire-quune-seule-chose.html</link>
      <pubDate>Wed, 10 Dec 2025 07:00:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314640</guid>
      <description>Pebble, qui a relanc&#233; ses montres connect&#233;es &#224; l&#8217;allure geek il y a quelques mois, est de retour avec un nouveau produit tr&#232;s &#233;tonnant : une bague. Alors certes, elle aussi est connect&#233;e, mais elle ne sait faire qu&#8217;une seule chose, enregistrer des m&#233;mos vocaux de la mani&#232;re la plus simple, la plus efficace et la plus s&#233;curis&#233;e possible. Mission r&#233;ussie ?...</description>
    </item>
    <item>
      <title>The neuroscience of why you&#8217;re always feeling behind at work</title>
      <link>https://www.fastcompany.com/91453717/the-neuroscience-of-why-youre-always-feeling-behind-at-work</link>
      <pubDate>2025-12-10T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91453717/the-neuroscience-of-why-youre-always-feeling-behind-at-work</guid>
      <description>People think they&#8217;re short on hours, but research shows they&#8217;re actually trapped in a distorted internal timeline shaped by stress.
We talk about time at work as if it&#8217;s a fixed resource: something outside of us and something we either &#8220;manage well&#8221; or &#8220;never have enough of.&#8221; People genuinely believe the clock is the problem. But the more you look at how the brain processes experience, the less true this becomes....</description>
    </item>
    <item>
      <title>Google, Microsoft, OpenAI, Anthropic et Amazon s&#8217;allient pour &#171;&#8201;standardiser&#8201;&#187; les IA de demain</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2904249_google-microsoft-openai-anthropic-et-amazon-sallient-pour-standardiser-les-ia-de-demain</link>
      <pubDate>Wed, 10 Dec 2025 06:43:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2904249_google-microsoft-openai-anthropic-et-amazon-sallient-pour-standardiser-les-ia-de-demain</guid>
      <description>
D&#233;sireux de construire la nouvelle &#232;re des IA &#171;&#8201;agentiques&#8201;&#187; sur des bases interop&#233;rables, tous les grands noms de l&#8217;IA ont cr&#233;&#233; une nouvelle structure, sous l&#8217;&#233;gide de la fondation Linux, pour piloter ce chantier.
</description>
    </item>
    <item>
      <title>Surfshark Promo Codes: 87% Off | December 2025</title>
      <link>https://www.wired.com/story/surfshark-coupon/</link>
      <pubDate>Wed, 10 Dec 2025 06:40:00 +0000</pubDate>
      <guid isPermaLink="false">67462fb5b36fe19e4f620021</guid>
      <description>Save up to 87% with a Surfshark coupon code, 3 months of VPN free today, and more December 2025 discounts from WIRED.</description>
    </item>
  </channel>
</rss>
