<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 02 Dec 2025 09:49:37 GMT</lastBuildDate>
    <item>
      <title>Marre de Google Assistant&#8201; sur vos enceintes Home ? Il existe une astuce pour (plus ou moins) forcer le passage sur Gemini</title>
      <link>https://www.frandroid.com/marques/google/2894991_marre-de-google-assistant-sur-vos-enceintes-home-il-existe-une-astuce-pour-plus-ou-moins-forcer-le-passage-sur-gemini</link>
      <pubDate>Tue, 02 Dec 2025 09:49:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2894991_marre-de-google-assistant-sur-vos-enceintes-home-il-existe-une-astuce-pour-plus-ou-moins-forcer-le-passage-sur-gemini</guid>
      <description>
Alors que Google Assistant continue pour le moment de squatter les enceintes intelligentes du g&#233;ant de la recherche, basculer vers la nouvelle IA Gemini n&#8217;a rien de tr&#232;s sorcier... Si vous avez de la chance.
</description>
    </item>
    <item>
      <title>Les voitures &#233;lectriques &#171; officielles &#187; chinoises arrivent en Europe avec une d&#233;cision forte de sens</title>
      <link>https://www.frandroid.com/marques/hongqi/2894907_les-voitures-electriques-officielles-chinoises-arrivent-en-europe-avec-une-decision-forte-de-sens</link>
      <pubDate>Tue, 02 Dec 2025 09:45:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/hongqi/2894907_les-voitures-electriques-officielles-chinoises-arrivent-en-europe-avec-une-decision-forte-de-sens</guid>
      <description>
Les constructeurs chinois arrivent massivement en Europe. Derni&#232;re preuve en date : le constructeur historique du gouvernement chinois, Hongqi, pr&#233;voit de construire une usine sur le Vieux continent.
</description>
    </item>
    <item>
      <title>Windows a du souci &#224; se faire ? Steam franchit un cap historique d&#8217;utilisateurs sur Linux</title>
      <link>https://www.frandroid.com/os/gnu-linux/2894905_windows-a-du-souci-a-se-faire-steam-franchit-un-cap-historique-dutilisateurs-sur-linux</link>
      <pubDate>Tue, 02 Dec 2025 09:43:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/gnu-linux/2894905_windows-a-du-souci-a-se-faire-steam-franchit-un-cap-historique-dutilisateurs-sur-linux</guid>
      <description>
Le syst&#232;me d'exploitation libre s&#233;duit de nouveaux joueurs et s'impose devant macOS en novembre 2025. 
</description>
    </item>
    <item>
      <title>Windows 11 : la grosse mise &#224; jour de novembre est l&#224;, voici toutes les nouveaut&#233;s</title>
      <link>https://www.frandroid.com/marques/microsoft/2894959_windows-11-la-grosse-mise-a-jour-de-novembre-est-la-voici-toutes-les-nouveautes</link>
      <pubDate>Tue, 02 Dec 2025 09:35:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2894959_windows-11-la-grosse-mise-a-jour-de-novembre-est-la-voici-toutes-les-nouveautes</guid>
      <description>
Windows 11 continue de s'am&#233;liorer avec une nouvelle mise &#224; jour riche en fonctionnalit&#233;s, allant de l'am&#233;lioration de l'interface, de nouvelles options de r&#233;cup&#233;ration ou encore des nouveaut&#233;s bienvenues pour les joueurs.
</description>
    </item>
    <item>
      <title>Amazon repousse encore les limites de la livraison avec cette nouveaut&#233;</title>
      <link>https://www.01net.com/actualites/amazon-repousse-limites-livraison-avec-cette-nouveaute.html</link>
      <pubDate>Tue, 02 Dec 2025 09:35:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312930</guid>
      <description>Amazon teste un service de livraison ultra-rapide capable de livrer certains produits en seulement 30 minutes.</description>
    </item>
    <item>
      <title>Le nouvel Outlook ne peut plus ouvrir les fichiers Excel en pi&#232;ce jointe</title>
      <link>https://www.01net.com/actualites/le-nouvel-outlook-ne-peut-plus-ouvrir-les-fichiers-excel-en-piece-jointe.html</link>
      <pubDate>Tue, 02 Dec 2025 09:26:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312968</guid>
      <description>Le client de messagerie de Microsoft souffre d&#8217;un &#233;trange bug. Depuis plusieurs jours, chez certains utilisateurs, Outlook est incapable d&#8217;ouvrir les fichiers Excel re&#231;us en pi&#232;ces jointes dans les e-mails. Microsoft est au courant de la situation et travaille sur un correctif.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs c&#226;bles USB-C selon vos besoins ? Notre s&#233;lection</title>
      <link>https://www.frandroid.com/guide-dachat/1911109_quels-sont-les-meilleurs-cables-usb-c-selon-vos-besoins-notre-selection</link>
      <pubDate>Tue, 02 Dec 2025 09:15:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1911109_quels-sont-les-meilleurs-cables-usb-c-selon-vos-besoins-notre-selection</guid>
      <description>Plus que jamais, cette &#232;re de la tech est sous le signe de la connectique USB-C. En effet, l&#8217;Union europ&#233;enne ou encore la France ont impos&#233; cette norme pour tous les nouveaux produits tech lanc&#233;s. &#192; tel point que m&#234;me Apple a d&#251; c&#233;der avec la g&#233;n&#233;ration d&#8217;iPhone&#160;15. Toutefois, les c&#226;bles USB-C ne sont pas [&#8230;]</description>
    </item>
    <item>
      <title>Le Black Friday est termin&#233;, mais voici les offres encore en ligne qui m&#233;ritent votre attention</title>
      <link>https://www.frandroid.com/bons-plans/2894961_le-black-friday-est-termine-mais-voici-les-offres-encore-en-ligne-qui-meritent-votre-attention</link>
      <pubDate>Tue, 02 Dec 2025 09:10:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2894961_le-black-friday-est-termine-mais-voici-les-offres-encore-en-ligne-qui-meritent-votre-attention</guid>
      <description>
C&#8217;est officiel&#8230; Le Black Friday ainsi que le Cyber Monday sont termin&#233;s&#8201;! Toutefois, plusieurs offres sur des produits Tech populaires sont encore valables chez les diff&#233;rents e-commer&#231;ants, pratique pour celles et ceux qui ont loup&#233; le coche.
</description>
    </item>
    <item>
      <title>&#171; Pas d&#8217;autre solution &#187; : 40 % des employ&#233;s sont licenci&#233;s chez l&#8217;historique marque italienne Campagnolo, sp&#233;cialiste du v&#233;lo</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2894993_pas-dautre-solution-40-des-employes-sont-licencies-chez-lhistorique-marque-italienne-campagnolo-specialiste-du-velo</link>
      <pubDate>Tue, 02 Dec 2025 09:02:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2894993_pas-dautre-solution-40-des-employes-sont-licencies-chez-lhistorique-marque-italienne-campagnolo-specialiste-du-velo</guid>
      <description>
Campagnolo engage une restructuration profonde apr&#232;s trois exercices d&#233;ficitaires, avec la suppression de 40 % de ses effectifs &#224; Vicence. La direction affirme que ces mesures, malgr&#233; l&#8217;apport de 10 millions d&#8217;euros de l&#8217;actionnaire, sont devenues indispensables pour assurer la continuit&#233; de ses activit&#233;s.
</description>
    </item>
    <item>
      <title>Samsung Galaxy Z TriFold&#160;: le vrai prix de l&#8217;innovation (et pourquoi &#231;a va faire mal)</title>
      <link>https://www.01net.com/actualites/samsung-galaxy-z-trifold-le-vrai-prix-de-linnovation-et-pourquoi-ca-va-faire-mal.html</link>
      <pubDate>Tue, 02 Dec 2025 08:42:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312923</guid>
      <description>Samsung officialise le prix du Galaxy Z TriFold en Cor&#233;e. L'analyse des chiffres r&#233;v&#232;le un surco&#251;t de 40 % face au Fold 7. En France, la facture pourrait fr&#244;ler les 3 000 euros.</description>
    </item>
    <item>
      <title>L&#8217;arnaque au faux coursier bancaire est de retour en France</title>
      <link>https://www.01net.com/actualites/arnaque-faux-coursier-bancaire-retour-france.html</link>
      <pubDate>Tue, 02 Dec 2025 08:30:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312894</guid>
      <description>Les faux conseillers bancaires ont une nouvelle astuce pour pi&#233;ger les Fran&#231;ais. De plus en plus souvent, ils envoient un faux coursier au domicile de leur cible. Celui-ci vient r&#233;cup&#233;rer la carte bancaire et le code&#8230;</description>
    </item>
    <item>
      <title>Samsung Galaxy Z TriFold vs Huawei Mate XTs : est-ce que Samsung a repris la main ?</title>
      <link>https://www.frandroid.com/marques/samsung/2894793_samsung-galaxy-z-trifold-vs-huawei-mate-xts-est-ce-que-samsung-a-repris-la-main</link>
      <pubDate>Tue, 02 Dec 2025 08:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2894793_samsung-galaxy-z-trifold-vs-huawei-mate-xts-est-ce-que-samsung-a-repris-la-main</guid>
      <description>
Huawei a eu le m&#233;rite d'&#234;tre le premier. Personne ne pourra lui enlever &#231;a. Mais &#234;tre le premier ne signifie pas &#234;tre le meilleur. Face au nouveau Galaxy Z TriFold de Samsung, le Mate XTs montre ses limites : puissance d'un autre &#226;ge, absence de Google et fragilit&#233;. Voici pourquoi Samsung reprend la main.
</description>
    </item>
    <item>
      <title>Monter un PC gaming : nos recommandations des configurations PC gamer pour tous les budgets</title>
      <link>https://www.frandroid.com/guide-dachat/1588431_monter-un-pc-gaming-nos-recommandations-de-configurations</link>
      <pubDate>Tue, 02 Dec 2025 08:25:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1588431_monter-un-pc-gaming-nos-recommandations-de-configurations</guid>
      <description>
Monter soi-m&#234;me son PC de bureau gamer est la solution id&#233;ale pour avoir un &#233;quipement qui correspond parfaitement &#224; ses besoins. Pour vous aider dans cette t&#226;che, Frandroid vous accompagne pas &#224; pas en vous conseillant les meilleurs composants pour la configuration PC gamer qu'il vous faut.
</description>
    </item>
    <item>
      <title>Ce rice cooker intelligent sign&#233; Xiaomi, test&#233; et valid&#233;, co&#251;te moins de 45 &#8364; gr&#226;ce &#224; cette offre</title>
      <link>https://www.frandroid.com/bons-plans/2893935_ce-rice-cooker-intelligent-signe-xiaomi-teste-et-valide-coute-moins-de-45-e-grace-a-cette-offre</link>
      <pubDate>Tue, 02 Dec 2025 08:19:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2893935_ce-rice-cooker-intelligent-signe-xiaomi-teste-et-valide-coute-moins-de-45-e-grace-a-cette-offre</guid>
      <description>
Si vous r&#234;vez d'un riz parfaitement cuit, sans devoir surveiller une casserole sur le feu, alors c'est un "rice cooker", ou cuiseur &#224; riz, qu'il vous faut. Xiaomi en propose un connect&#233;, le Smart Multifunctional Rice Cooker, que nous avons vraiment appr&#233;ci&#233;. En ce moment, la marque le propose &#224; 44,99 euros au lieu de 49,99 euros.
</description>
    </item>
    <item>
      <title>Taylor Swift | The Eras Tour | The Final Show trailer teases full concert recording</title>
      <link>https://mashable.com/video/taylor-swift-eras-tour-full-recording-trailer-disney</link>
      <pubDate>Tue, 02 Dec 2025 08:03:35 +0000</pubDate>
      <guid isPermaLink="false">04Si4OGOPZzjyK8vbEnr0j7</guid>
      <description>Disney+ has released the trailer for "Taylor Swift | The Eras Tour | The Final Show", a full recording of the tour's last concert.</description>
    </item>
    <item>
      <title>La nouvelle IA chinoise de DeepSeek est aussi puissante que les mod&#232;les am&#233;ricains les plus avanc&#233;s</title>
      <link>https://www.01net.com/actualites/la-nouvelle-ia-chinoise-de-deepseek-est-aussi-puissante-que-les-modeles-americains-les-plus-avances.html</link>
      <pubDate>Tue, 02 Dec 2025 08:01:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1312867</guid>
      <description>Les grands fabricants occidentaux de mod&#232;les IA &#8212; OpenAI, Google, Anthropic&#8230; &#8212; ont tous livr&#233;s ces derni&#232;res semaines leurs derni&#232;res innovations en la mati&#232;re. Mais la Chine n'est pas en reste : DeepSeek vient &#224; son tour de d&#233;voiler les derni&#232;res versions de ses propres mod&#232;les, tous open source, et aux performances similaires &#224; celles de GPT-5 selon les benchmarks....</description>
    </item>
    <item>
      <title>Why companies hire back people they just laid off</title>
      <link>https://www.fastcompany.com/91447602/why-companies-hire-back-people-they-just-laid-off</link>
      <pubDate>2025-12-02T08:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91447602/why-companies-hire-back-people-they-just-laid-off</guid>
      <description>They&#8217;re called &#8216;layoff boomerangs,&#8217; and while the phenomenon may seem harmless, it&#8217;s costly for the company, the employee, and their teams. 
Many of us have heard of &#8220;boomerang employees&#8221;&#8212;someone who leaves a company and later returns&#8212;but there&#8217;s a newer version showing up in the workplace: the layoff boomerang.</description>
    </item>
    <item>
      <title>Netflixs Culinary Class Wars Season 2 trailer teases return of former contestants</title>
      <link>https://mashable.com/video/culinary-class-wars-season-2-trailer-netflix</link>
      <pubDate>Tue, 02 Dec 2025 07:56:12 +0000</pubDate>
      <guid isPermaLink="false">00g9dEQGDGYDAk8ssNDTQPs</guid>
      <description>Netflix has released the official trailer for "Culinary Class Wars Season 2", teasing the return of some previous contestants.</description>
    </item>
    <item>
      <title>Amazon veut remplacer les supermarch&#233;s avec la livraison en 30&#160;minutes</title>
      <link>https://www.frandroid.com/marques/amazon/2894883_amazon-veut-remplacer-les-supermarches-avec-la-livraison-en-30-minutes</link>
      <pubDate>Tue, 02 Dec 2025 07:50:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazon/2894883_amazon-veut-remplacer-les-supermarches-avec-la-livraison-en-30-minutes</guid>
      <description>
Dans sa ville natale de Seattle et &#224; Philadelphie, Amazon cherche &#224; repousser les limites de la livraison ultrarapide avec la promesse d&#8217;une commande sur le pas de votre porte en 30&#160;minutes. De quoi rapprocher le site des services de courses en ligne.
</description>
    </item>
  </channel>
</rss>
