<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 22 Nov 2025 09:32:59 GMT</lastBuildDate>
    <item>
      <title>Cdiscount d&#233;gaine de belles offres pour la Black Friday Week : les 11 offres &#224; ne pas louper ce week-end</title>
      <link>https://www.frandroid.com/bons-plans/2850059_cdiscount-degaine-de-belles-offres-pour-la-black-friday-week-les-11-offres-a-ne-pas-louper-ce-week-end</link>
      <pubDate>Sat, 22 Nov 2025 09:26:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850059_cdiscount-degaine-de-belles-offres-pour-la-black-friday-week-les-11-offres-a-ne-pas-louper-ce-week-end</guid>
      <description>
Chez Cdiscount une vague de nouvelles offres sur de nombreux produits Tech est apparue lors de la Black Friday Week. Voici notre s&#233;lection des meilleures promotions chez ce marchand. 
</description>
    </item>
    <item>
      <title>Le Samsung Galaxy A57 d&#233;voile une architecture in&#233;dite et de la puissance &#224; revendre</title>
      <link>https://www.frandroid.com/actualites-generales/2881587_le-samsung-galaxy-a57-devoile-une-architecture-inedite-et-de-la-puissance-a-revendre</link>
      <pubDate>Sat, 22 Nov 2025 09:19:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2881587_le-samsung-galaxy-a57-devoile-une-architecture-inedite-et-de-la-puissance-a-revendre</guid>
      <description>
Le futur milieu de gamme de Samsung, le Galaxy A57, vient d'appara&#238;tre sur Geekbench. L'occasion de d&#233;couvrir les performances de son nouveau processeur Exynos 1680.
</description>
    </item>
    <item>
      <title>Garmin Vivoactive 5 : cette montre sportive not&#233;e 9/10 est &#224; moiti&#233; prix pour la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2611337_garmin-vivoactive-5-cette-montre-sportive-notee-9-10-est-a-moitie-prix-pour-la-black-friday-week</link>
      <pubDate>Sat, 22 Nov 2025 09:15:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2611337_garmin-vivoactive-5-cette-montre-sportive-notee-9-10-est-a-moitie-prix-pour-la-black-friday-week</guid>
      <description>
La Garmin Vivoactive 5 est une montre tourn&#233;e vers le sport qui poss&#232;de des capteurs qui se r&#233;v&#232;lent tr&#232;s pertinents et pr&#233;cis pour suivre vos activit&#233;s sportives et sant&#233;. Avec l'arriv&#233;e du nouveau mod&#232;le et la Black Friday Week en cours, cette excellente smartwatch est &#224; moiti&#233; prix. 
</description>
    </item>
    <item>
      <title>Les forces en jeu sont immenses : un compagnon cach&#233; est en train de remodeler la mort de cette &#233;toile</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-forces-jeu-sont-immenses-compagnon-cache-train-remodeler-mort-cette-etoile-127682/#xtor%3DRSS-8</link>
      <pubDate>Sat, 22 Nov 2025 10:12:00 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-forces-jeu-sont-immenses-compagnon-cache-train-remodeler-mort-cette-etoile-127682/#xtor%3DRSS-8</guid>
      <description>Une g&#233;ante rouge situ&#233;e &#224; des centaines de kilom&#232;tres de nous a &#233;t&#233; observ&#233;e en compagnie d'une autre &#233;toile qui semble lui causer des difficult&#233;s. Les m&#233;canismes &#224; l'&#339;uvre peuvent nous aider &#224; comprendre ce qui arrivera &#224; notre propre Soleil &#224; la fin de sa &#171;&#160;vie&#160;&#187;.</description>
    </item>
    <item>
      <title>Quel est le meilleur des iPhone : la s&#233;lection 2025 des mod&#232;les &#224; acheter (et ceux &#224; &#233;viter)</title>
      <link>https://www.frandroid.com/guide-dachat/smartphones/705312_meilleur-iphone</link>
      <pubDate>Sat, 22 Nov 2025 09:02:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/smartphones/705312_meilleur-iphone</guid>
      <description>
Faut-il acheter le dernier iPhone ou bien opter pour un autre smartphone de chez Apple ? C'est &#224; cette question que nous allons tenter de r&#233;pondre dans ce guide d'achat. Quel iPhone choisir ? Voici les conseils et recommandations de la r&#233;daction de Frandroid.
</description>
    </item>
    <item>
      <title>D&#233;couvrez les 20 pires mots de passe de France en 2025, 123456 a &#233;t&#233; d&#233;tr&#244;n&#233;</title>
      <link>https://www.01net.com/actualites/decouvrez-20-pires-mots-passe-france-2025-123456-detrone.html</link>
      <pubDate>Sat, 22 Nov 2025 09:01:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309240</guid>
      <description>NordPass d&#233;voile son palmar&#232;s annuel des pires mots de passe. En France et dans le reste du monde, les mauvaises habitudes ont la vie dure. Les internautes continuent en effet d'utiliser des mots de passe peu s&#233;curis&#233;s.</description>
    </item>
    <item>
      <title>Clean up and save up to $1,300 on Roborock's Black Friday vacuum cleaner deals</title>
      <link>https://www.techradar.com/home/robot-vacuums/clean-up-and-save-up-to-usd1-300-on-roborocks-black-friday-vacuum-cleaner-deals</link>
      <pubDate>Sat, 22 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">XWHWRdfyybZzA3tPL6tRSE</guid>
      <description>These Black Friday deals are pristine!</description>
    </item>
    <item>
      <title>Wicked: For Good will be on this streaming service first &#8211; save 16% on an annual subscription</title>
      <link>https://www.techradar.com/streaming/entertainment/wicked-for-good-will-be-on-this-streaming-service-first-save-16-percent-on-an-annual-subscription</link>
      <pubDate>Sat, 22 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">3cXNksB2mHC9567Za2Bs8j</guid>
      <description>Wicked: For Good won&#8217;t be available to stream until next year &#8211; but this is the subscription plan you&#8217;ll need when it does drop.</description>
    </item>
    <item>
      <title>Fnac et Darty donnent tout pour le week-end de la Black Friday Week : le TOP 15 des offres du moment</title>
      <link>https://www.frandroid.com/bons-plans/2869625_fnac-et-darty-donnent-tout-pour-le-week-end-de-la-black-friday-week-le-top-15-des-offres-du-moment</link>
      <pubDate>Sat, 22 Nov 2025 08:57:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2869625_fnac-et-darty-donnent-tout-pour-le-week-end-de-la-black-friday-week-le-top-15-des-offres-du-moment</guid>
      <description>
La Black Friday Week vient tout juste de d&#233;marrer chez la Fnac et Darty, et les nouvelles offres affluent d&#233;j&#224;. Pour vous faire gagner du temps, nous avons s&#233;lectionn&#233; les meilleures promotions du moment. 
</description>
    </item>
    <item>
      <title>Il liquide tous ses bitcoins&#160;: l&#8217;un des premiers investisseurs vend ses cryptos pour plus d&#8217;un milliard de dollars</title>
      <link>https://www.01net.com/actualites/liquide-tous-bitcoins-premiers-acheteurs-vend-toutes-cryptos-milliard-dollars.html</link>
      <pubDate>Sat, 22 Nov 2025 08:46:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310035</guid>
      <description>L&#8217;un des tout premiers investisseurs du Bitcoin vient de liquider l'int&#233;gralit&#233; de son portefeuille. Apr&#232;s plus d&#8217;une d&#233;cennie, il a vendu toutes ses cryptos pour plus d&#8217;un milliard de dollars. La vente survient alors que le cours du Bitcoin est en train de s'effondrer&#8230;</description>
    </item>
    <item>
      <title>Test du Framework Laptop 16 (2025) : j&#8217;ai d&#233;mont&#233; mon PC portable pour y mettre une RTX 5070</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2880837_test-du-framework-laptop-16-2025-jai-demonte-mon-pc-portable-pour-y-mettre-une-rtx-5070</link>
      <pubDate>Sat, 22 Nov 2025 08:34:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2880837_test-du-framework-laptop-16-2025-jai-demonte-mon-pc-portable-pour-y-mettre-une-rtx-5070</guid>
      <description>
Changer sa carte graphique en la clipsant comme une cartouche de GameBoy &#224; l'arri&#232;re du PC ? C'est le r&#234;ve de gosse r&#233;alis&#233; par Framework. J'ai test&#233; l'upgrade 2025 : c'est g&#233;nial, c'est brut et ce n'est pas donn&#233;.
</description>
    </item>
    <item>
      <title>Nuki Smart Lock Go : cette serrure connect&#233;e abordable devient encore moins ch&#232;re gr&#226;ce au Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2880565_nuki-smart-lock-go-cette-serrure-connectee-abordable-devient-encore-moins-chere-grace-au-black-friday</link>
      <pubDate>Sat, 22 Nov 2025 08:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2880565_nuki-smart-lock-go-cette-serrure-connectee-abordable-devient-encore-moins-chere-grace-au-black-friday</guid>
      <description>
Si vous souhaitez simplifier votre entr&#233;e chez vous, alors opter pour une serrure connect&#233;e peut &#234;tre une excellente id&#233;e. L'une des plus abordables du moment, c'est la Nuki Smart Lock Go, affich&#233;e &#224; 99 euros au lieu de 149 euros sur Amazon pendant la Black Friday Week.
</description>
    </item>
    <item>
      <title>La Black Friday Week continue ce week-end : voici les meilleures offres en DIRECT sur Amazon, Fnac, Darty, Boulanger&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2876855_black-friday-week-week-end-meilleures-offres-en-direct-amazon-fnac-darty-boulanger</link>
      <pubDate>Sat, 22 Nov 2025 08:17:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2876855_black-friday-week-week-end-meilleures-offres-en-direct-amazon-fnac-darty-boulanger</guid>
      <description>
C'est officiellement la Black Friday Week sur Amazon, Fnac, Darty, Boulanger ou encore Cdiscount. C'est donc le bon moment pour faire une excellente affaire sur votre prochain smartphone, tablette, PC portable, TV, etc. Vous retrouverez les meilleures offres Tech en temps r&#233;el dans cet article. 
</description>
    </item>
    <item>
      <title>iPhone : Apple lance un &#233;trange support MagSafe &#224; 70 dollars</title>
      <link>https://www.frandroid.com/marques/apple/2881559_iphone-apple-lance-un-etrange-support-magsafe-a-70-dollars</link>
      <pubDate>Sat, 22 Nov 2025 08:08:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2881559_iphone-apple-lance-un-etrange-support-magsafe-a-70-dollars</guid>
      <description>
Apr&#232;s une pochette tricot&#233;e hors de prix, Apple continue ses collaborations artistiques avec un nouvel accessoire MagSafe. Con&#231;u par Bailey Hikawa, ce support aux allures de sculpture moderne vise avant tout &#224; faciliter l&#8217;usage de l&#8217;iPhone pour les personnes en situation de handicap.
</description>
    </item>
    <item>
      <title>Le 01lab a mesur&#233; la charge de l&#8217;iPhone 17 et le verdict est simple&#160;: gardez votre ancien chargeur</title>
      <link>https://www.01net.com/actualites/le-01lab-a-mesure-la-charge-de-liphone-17-et-le-verdict-est-simple-gardez-votre-ancien-chargeur.html</link>
      <pubDate>Sat, 22 Nov 2025 08:01:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310156</guid>
      <description>En septembre, Apple a r&#233;duit le temps de charge pour atteindre 50% de batterie sur l&#8217;iPhone 17, passant de 30 &#224; 20 minutes, une am&#233;lioration notable pour un constructeur peu port&#233; sur la charge rapide. Nos tests confirment que cette promesse est tenue avec un chargeur Apple USB-C de 67 W classique, sans n&#233;cessit&#233; d'utiliser l'adaptateur secteur dynamique sp&#233;cifique de 40 W &#224; 60 W vendu uniquement dans certains pays.&#8203;...</description>
    </item>
    <item>
      <title>Will X's  usage-based API pricing succeed in winning over developers?</title>
      <link>https://www.techradar.com/pro/will-xs-usage-based-api-pricing-succeed-in-winning-over-developers</link>
      <pubDate>Sat, 22 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">NYDPxD4y9Ug7Bg3JN8UxRM</guid>
      <description>What it cost, who stands to benefit, and where the uncertainties lie</description>
    </item>
    <item>
      <title>L&#8217;Apple Watch la plus int&#233;ressante (et la plus abordable) se dote d&#233;j&#224; d&#8217;une belle ristourne pour la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2880795_lapple-watch-la-plus-interessante-et-la-plus-abordable-se-dote-deja-dune-belle-ristourne-pour-la-black-friday-week</link>
      <pubDate>Sat, 22 Nov 2025 07:49:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2880795_lapple-watch-la-plus-interessante-et-la-plus-abordable-se-dote-deja-dune-belle-ristourne-pour-la-black-friday-week</guid>
      <description>
Apple veut s&#233;duire ceux qui n&#8217;ont pas 400 euros &#224; mettre dans une montre connect&#233;e. Le r&#233;sultat ? Une Apple Watch SE 3 modernis&#233;e, boost&#233;e, avec un Always-On&#8230; et qui passe &#224; 234 euros au lieu de 269 euros pendant la Black Friday Week d'Amazon.
</description>
    </item>
  </channel>
</rss>
