<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 14 Dec 2025 08:31:00 GMT</lastBuildDate>
    <item>
      <title>Dangbei N2 Mini : ce vid&#233;oprojecteur compact est &#224; -23 % pour transformer toutes vos pi&#232;ces en mini cin&#233;ma</title>
      <link>https://www.frandroid.com/bons-plans/2906619_dangbei-n2-mini-ce-videoprojecteur-compact-est-a-23-pour-transformer-toutes-vos-pieces-en-mini-cinema</link>
      <pubDate>Sun, 14 Dec 2025 08:25:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2906619_dangbei-n2-mini-ce-videoprojecteur-compact-est-a-23-pour-transformer-toutes-vos-pieces-en-mini-cinema</guid>
      <description>
En qu&#234;te d'un vid&#233;oprojecteur compact, facile &#224; configurer dans toutes les pi&#232;ces ? Le Dangbei N2 Mini pourrait &#234;tre le bon candidat : jusqu'&#224; 100 pouces d'images, haut-parleur Dolby Digital, des ports USB, HDMI et jack. Et un prix qui passe de 219 euros &#224; 169 euros sur Amazon, &#224; condition de faire vite.
</description>
    </item>
    <item>
      <title>Runners rejoice &#8212; the Shokz OpenRun Pro 2 hit a record-low price at Amazon</title>
      <link>https://www.techradar.com/audio/headphones/runners-rejoice-the-shokz-openrun-pro-2-hit-a-record-low-price-at-amazon</link>
      <pubDate>Sun, 14 Dec 2025 07:50:00 +0000</pubDate>
      <guid isPermaLink="false">nxsJbJkc5tensraW5zXwyL</guid>
      <description>Stay safe and run freely with the Shokz OpenRun Pro 2 - now down to &#163;135 on Amazon.</description>
    </item>
    <item>
      <title>Affinity CEO reveals why Canva and Affinity made pro design software free - and what that means for creativity</title>
      <link>https://www.techradar.com/pro/software-services/affinity-ceo-reveals-why-canva-and-affinity-made-pro-design-software-free-and-what-that-means-for-creativity</link>
      <pubDate>Sun, 14 Dec 2025 07:45:00 +0000</pubDate>
      <guid isPermaLink="false">TWkwf2pEgebXigUGfirDm</guid>
      <description>Ash Hewson, CEO of Affinity, explains why the popular design platform is free for all and how the move challenges the prevailing orthodoxy across the creative landscape.</description>
    </item>
    <item>
      <title>&#171; Je pense que j&#8217;aurais du mal &#224; revenir sur mon ancien moniteur &#187; : on a confi&#233; un moniteur TCL Mini LED &#224; un lecteur, voici son bilan [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/ecran-pc/2901581_je-pense-que-jaurais-du-mal-a-revenir-sur-mon-ancien-moniteur-on-a-confie-un-moniteur-tcl-mini-led-a-un-lecteur-voici-son-bilan</link>
      <pubDate>Sun, 14 Dec 2025 07:24:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/ecran-pc/2901581_je-pense-que-jaurais-du-mal-a-revenir-sur-mon-ancien-moniteur-on-a-confie-un-moniteur-tcl-mini-led-a-un-lecteur-voici-son-bilan</guid>
      <description>
D&#233;j&#224; reconnu sur le march&#233; des TV gr&#226;ce &#224; la technologie Mini LED, TCL gagne du terrain sur le segment des moniteurs gaming. Pour tester le savoir-faire de la marque, nous avons d&#233;cid&#233; de nous en remettre au verdict d&#8217;un lecteur de Frandroid, un gamer de surcro&#238;t.
</description>
    </item>
    <item>
      <title>Alpine A390 Review: Price, Specs, Availability</title>
      <link>https://www.wired.com/review/review-alpine-a390/</link>
      <pubDate>Sun, 14 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">6939300ff5337bd85ef55a2a</guid>
      <description>Ahead of its entry into the US, the European brand with an ex-Ferrari boss and decades of motorsport success has a new EV to take on Porsche and Polestar. WIRED tries it on for size.</description>
    </item>
    <item>
      <title>For the First Time, AI Analyzes Language as Well as a Human Expert</title>
      <link>https://www.wired.com/story/in-a-first-ai-models-analyze-language-as-well-as-a-human-expert/</link>
      <pubDate>Sun, 14 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">68f0e840f64cc204081cda48</guid>
      <description>If language is what makes us human, what does it mean now that large language models have gained &#8220;metalinguistic&#8221; abilities?</description>
    </item>
    <item>
      <title>The December effect: How constraints create better leadership decisions</title>
      <link>https://www.fastcompany.com/91455858/why-december-creates-better-leadership-decisions</link>
      <pubDate>2025-12-14T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91455858/why-december-creates-better-leadership-decisions</guid>
      <description>December forces focus, limits choices, and clarifies priorities. Leaders can engineer this productivity all year long.
Every December, something strange happens inside companies. Decisions that were stuck for months suddenly fly through. Projects get approved. Budgets get finalized. People stop debating and finally choose.</description>
    </item>
    <item>
      <title>How to make the most out of your company holiday party</title>
      <link>https://www.fastcompany.com/91458775/how-to-make-the-most-out-of-your-company-holiday-party</link>
      <pubDate>2025-12-14T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91458775/how-to-make-the-most-out-of-your-company-holiday-party</guid>
      <description>Office parties can be daunting, but with the right approach, they can open doors for new opportunities and strengthen relationships.
Any office party can be challenging, but holiday office parties are particularly stressful.&#160;After all, the season brings a set of demands&#8212;including the need to be &#8220;merry and bright&#8221; when you may not feel that way.&#160;To survive this end-of-year event (and to use it to advance your career), here are three strategies that will work wonders....</description>
    </item>
    <item>
      <title>Pour contourner la double authentification, les pirates ont une nouvelle strat&#233;gie redoutable</title>
      <link>https://www.01net.com/actualites/pour-contourner-la-double-authentification-les-pirates-ont-une-nouvelle-strategie-redoutable.html</link>
      <pubDate>Sun, 14 Dec 2025 06:58:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314467</guid>
      <description>La double authentification n&#8217;est plus un bouclier absolu contre les cyberattaques. Un outil employ&#233; par les cybercriminels permet en effet de casser l'authentification deux facteurs. L'op&#233;ration repose sur le d&#233;tournement de cookies de session par le biais d'un faux portail de connexion gliss&#233; entre vous et la plateforme officielle. Explications.</description>
    </item>
    <item>
      <title>&#192; partir de 4,99 &#8364; et jusqu&#8217;&#224; 250 Go, voici les 3 forfaits immanquables avant No&#235;l</title>
      <link>https://www.frandroid.com/bons-plans/2908363_a-partir-de-499-e-et-jusqua-250-go-voici-les-3-forfaits-immanquables-avant-noel</link>
      <pubDate>Sun, 14 Dec 2025 06:49:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2908363_a-partir-de-499-e-et-jusqua-250-go-voici-les-3-forfaits-immanquables-avant-noel</guid>
      <description>
Syma Mobile, B&amp;You et YouPrice anticipent le r&#233;veillon avec des offres charg&#233;es en data ou en services offerts, id&#233;ales pour accompagner un nouveau smartphone sous le sapin ou simplement pour d&#233;gager du budget pour les cadeaux.
</description>
    </item>
  </channel>
</rss>
