<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 07 Jan 2026 10:29:49 GMT</lastBuildDate>
    <item>
      <title>Le successeur d&#8217;un de nos robots pr&#233;f&#233;r&#233;s est l&#224; : pourquoi l&#8217;Anker Eufy Omni S2 va faire mal &#224; la concurrence</title>
      <link>https://www.frandroid.com/marques/anker/2933051_le-successeur-dun-de-nos-robots-preferes-est-la-pourquoi-lanker-eufy-omni-s2-va-faire-mal-a-la-concurrence</link>
      <pubDate>Wed, 07 Jan 2026 10:27:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/anker/2933051_le-successeur-dun-de-nos-robots-preferes-est-la-pourquoi-lanker-eufy-omni-s2-va-faire-mal-a-la-concurrence</guid>
      <description>
C'&#233;tait l'un de nos coups de c&#339;ur en 2025, il revient en version sous st&#233;ro&#239;des. L'Eufy Omni S2 d&#233;barque avec une fiche technique int&#233;ressante : une puissance d'aspiration multipli&#233;e par cinq et un syst&#232;me de lavage au rouleau encore am&#233;lior&#233;. La promesse est simple : c'est le premier robot avec aromath&#233;rapie int&#233;gr&#233;e.
</description>
    </item>
    <item>
      <title>The Intel Core Ultra series 3 processors look impressive enough, but the Arc B390 iGPU is the real game-changer here</title>
      <link>https://www.techradar.com/computing/cpu/the-intel-core-ultra-series-3-processors-look-impressive-enough-but-the-arc-b390-igpu-is-the-real-game-changer-here</link>
      <pubDate>Wed, 07 Jan 2026 10:26:01 +0000</pubDate>
      <guid isPermaLink="false">7Ae8Lf7Zt7FHviEw4jB224</guid>
      <description>Intel's new Arc B390 integrated GPU is one of the most impressive things I saw at CES 2026, promising a new dawn for gaming on thin-and-light laptops.</description>
    </item>
    <item>
      <title>Pour les soldes, Amazon casse en deux le prix du Razr 60, le smartphone &#224; clapet pas cher de Motorola</title>
      <link>https://www.frandroid.com/bons-plans/2735845_pour-les-soldes-amazon-casse-en-deux-le-prix-du-razr-60-le-smartphone-a-clapet-pas-cher-de-motorola</link>
      <pubDate>Wed, 07 Jan 2026 10:25:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2735845_pour-les-soldes-amazon-casse-en-deux-le-prix-du-razr-60-le-smartphone-a-clapet-pas-cher-de-motorola</guid>
      <description>
Si vous &#234;tes tent&#233; par un smartphone &#224; clapet, le Razr 60 de Motorola pourrait bien vous convaincre. Son prix est m&#234;me plus int&#233;ressant gr&#226;ce &#224; cette offre des soldes 2026 sur Amazon : 499 euros contre 899 euros de base. 
</description>
    </item>
    <item>
      <title>Another veteran Marvel star could join The Batman Part II &#8212; and they've already been fancast by DC diehards</title>
      <link>https://www.techradar.com/streaming/entertainment/another-veteran-marvel-star-could-join-the-batman-part-ii-and-theyve-already-been-fancast-by-dc-diehards</link>
      <pubDate>Wed, 07 Jan 2026 10:23:31 +0000</pubDate>
      <guid isPermaLink="false">E9UKND7W4ggykKPVN3kFVW</guid>
      <description>Marvel star Sebastian Stan is reportedly in talks to join the cast of The Batman Part II.</description>
    </item>
    <item>
      <title>Transformer son Mac en iPad g&#233;ant ? C&#8217;est possible avec cet accessoire</title>
      <link>https://www.frandroid.com/marques/apple/2932901_transformer-son-mac-en-ipad-geant-cest-possible-avec-cet-accessoire</link>
      <pubDate>Wed, 07 Jan 2026 10:22:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2932901_transformer-son-mac-en-ipad-geant-cest-possible-avec-cet-accessoire</guid>
      <description>
Transformer son MacBook en &#233;cran tactile, c'est bient&#244;t possible avec l'accessoire Magic Screen. Bient&#244;t lanc&#233; sur Kickstarter, le produit d&#233;bloque de nouvelles utilisations dignes d'un iPad sur l'&#233;cran de votre MacBook.
</description>
    </item>
    <item>
      <title>The top 5 health gadgets at CES this year, from Garmin nutrition tracking to that notorious AI smart mirror</title>
      <link>https://www.techradar.com/health-fitness/the-top-5-health-gadgets-at-ces-this-year-from-garmin-nutrition-tracking-to-that-notorious-ai-smart-mirror</link>
      <pubDate>Wed, 07 Jan 2026 10:20:31 +0000</pubDate>
      <guid isPermaLink="false">ZTBnEoM5Gyske5s2ynyxTW</guid>
      <description>From Garmin's AI nutrition tracking to a sunlight attachment for your laptop, here are the wildest CES 2026 health innovations.</description>
    </item>
    <item>
      <title>Philips Hue 'SpatialAware' feature harmonizes all the lights in a room</title>
      <link>https://www.engadget.com/home/smart-home/philips-hue-spatialaware-feature-harmonizes-all-the-lights-in-a-room-101843600.html?src=rss</link>
      <pubDate>Wed, 07 Jan 2026 10:18:43 +0000</pubDate>
      <guid isPermaLink="false">022c945a-02e7-40fc-8a87-8b1f3aee5a80</guid>
      <description>Philips Hue has introduced a new software feature called SpatialAware at CES 2026 designed to ensure that all the lights in a space are in harmony with each other. Available exclusively for the Hue Bridge Pro, it takes into account each light point in a room and tailors the colors to ensure a natural representation. "In a sunset scene, for example, the lights on one side of the room emit warm yellow tones to mimic the setting sun, while the ceiling lights on the opposite side reflect darker shades," the company wrote on its blog. The new feature is set to launch in the spring of 2026.
To use t...</description>
    </item>
    <item>
      <title>Forfaits Orange : voici les offres mobile et internet de l&#8217;op&#233;rateur historique en 2026</title>
      <link>https://www.frandroid.com/marques/1279963_orange-notre-avis-sur-les-offres-mobile-fibre-et-adsl-en-2023</link>
      <pubDate>Wed, 07 Jan 2026 10:18:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/1279963_orange-notre-avis-sur-les-offres-mobile-fibre-et-adsl-en-2023</guid>
      <description>
Ex-France T&#233;l&#233;com, aujourd'hui Orange, le premier op&#233;rateur historique a aujourd'hui une r&#233;putation de doyen sur le march&#233; des t&#233;l&#233;coms, en France et ailleurs. Orange est connu pour la qualit&#233; de ses services, au d&#233;triment de notre portefeuille. Avec la concurrence f&#233;roce &#224; c&#244;t&#233;, l'op&#233;rateur historique tient-il encore la route en 2026 ?
</description>
    </item>
    <item>
      <title>&#192; l&#8217;heure du tout &#233;lectrique, ce constructeur chinois surprend tout le monde avec un immense moteur V8 essence</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2932705_a-lheure-du-tout-electrique-ce-constructeur-chinois-surprend-tout-le-monde-avec-un-immense-moteur-v8-essence</link>
      <pubDate>Wed, 07 Jan 2026 10:17:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2932705_a-lheure-du-tout-electrique-ce-constructeur-chinois-surprend-tout-le-monde-avec-un-immense-moteur-v8-essence</guid>
      <description>
Le groupe chinois GWM vient de lever le voile sur un tout nouveau moteur. Il s&#8217;agit d&#8217;un surprenant V8 4,0 litres, qui serait install&#233; dans de futures voitures hybrides rechargeables.
</description>
    </item>
    <item>
      <title>The Thrustmaster Heart Xbox controller just dropped to its lowest price since September &#8212; save 27%</title>
      <link>https://www.techradar.com/gaming/the-thrustmaster-heart-xbox-controller-just-dropped-to-its-lowest-price-since-september-save-27-percent</link>
      <pubDate>Wed, 07 Jan 2026 10:16:05 +0000</pubDate>
      <guid isPermaLink="false">sDbnAbF2Z8yBpJyUnugqL</guid>
      <description>You can save 27% off one of Thrustmaster's best controllers at Amazon right now, as the Thrustmaster Heart drops to its lowest price since September.</description>
    </item>
    <item>
      <title>Trois c&#226;bles sous-marins ont &#233;t&#233; sabot&#233;s l&#8217;un apr&#232;s l&#8217;autre en Europe</title>
      <link>https://www.01net.com/actualites/trois-cables-sous-marins-ete-sabotes-un-apres-autre-europe.html</link>
      <pubDate>Wed, 07 Jan 2026 10:11:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318514</guid>
      <description>En quelques jours, trois c&#226;bles sous-marins ont &#233;t&#233; sectionn&#233;s en mer Baltique. Deux navires ont &#233;t&#233; identifi&#233;s comme &#233;tant potentiellement &#224; l'origine des incidents, dont un cargo charg&#233; d'acier russe. Les autorit&#233;s redoutent une op&#233;ration de sabotage en provenance de la Russie.</description>
    </item>
    <item>
      <title>How to watch The Rookie season 8 &#8212; stream online from anywhere in the world</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/the-rookie-season-8-stream-online</link>
      <pubDate>Wed, 07 Jan 2026 10:02:51 +0000</pubDate>
      <guid isPermaLink="false">Z2u3nowQFPgMHMwMWkgRcK</guid>
      <description>Here's how you can watch The Rookie season 8 from anywhere in the world, including free options.</description>
    </item>
    <item>
      <title>Les soldes d&#8217;hiver 2026 d&#233;marrent aujourd&#8217;hui ! Voici les meilleures offres sur les smartphones Apple, Samsung et Xiaomi</title>
      <link>https://www.frandroid.com/bons-plans/2931029_les-soldes-dhiver-2026-demarrent-aujourdhui-voici-les-meilleures-offres-sur-les-smartphones-apple-samsung-et-xiaomi</link>
      <pubDate>Wed, 07 Jan 2026 10:01:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931029_les-soldes-dhiver-2026-demarrent-aujourdhui-voici-les-meilleures-offres-sur-les-smartphones-apple-samsung-et-xiaomi</guid>
      <description>
Du 7 janvier au 3 f&#233;vrier, les soldes d'hiver promettent de faire de bonnes affaires dans la tech, particuli&#232;rement aupr&#232;s des e-commer&#231;ants fran&#231;ais. C'est par exemple l'occasion de mettre la main sur un smartphone que le P&#232;re No&#235;l aurait oubli&#233; de d&#233;poser au pied du sapin.
</description>
    </item>
    <item>
      <title>The best budgeting apps for 2025</title>
      <link>https://www.engadget.com/apps/best-budgeting-apps-120036303.html?src=rss</link>
      <pubDate>Wed, 07 Jan 2026 10:00:35 +0000</pubDate>
      <guid isPermaLink="false">1bf1c17b-7ece-4b18-b17b-dc7b5e70f411</guid>
      <description>As a former Mint user, I had to find a new budgeting app not too long ago. Intuit, parent company of Mint, shut down the service in March 2024, and prompted users to transition to its other financial app, Credit Karma. However, after testing Credit Karma myself, I found it to be a poor Mint replacement &#8212; that meant I needed to branch out and look elsewhere for a trusted app to track all of my financial accounts, monitor my credit score, follow a monthly spending plan and set goals like building a rainy-day fund and paying down my mortgage faster.I tried out Mint's top competitors in the hopes ...</description>
    </item>
    <item>
      <title>Crypto Hardware Wallet Maker Ledger Impacted by Third-Party Data Breach</title>
      <link>https://gizmodo.com/crypto-hardware-wallet-maker-ledger-impacted-by-third-party-data-breach-2000706407</link>
      <pubDate>Wed, 07 Jan 2026 10:00:21 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000706407</guid>
      <description>Crypto wasn't stolen this time, but data was leaked with the potential to lead to thefts later on.</description>
    </item>
    <item>
      <title>Enfin un capteur de 200 Mpx sur l&#8217;iPhone, mais Apple changerait de cr&#232;merie</title>
      <link>https://www.frandroid.com/marques/apple/2932903_enfin-un-capteur-de-200-mpx-sur-liphone-mais-apple-changerait-de-cremerie</link>
      <pubDate>Wed, 07 Jan 2026 09:54:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2932903_enfin-un-capteur-de-200-mpx-sur-liphone-mais-apple-changerait-de-cremerie</guid>
      <description>
Apple franchirait enfin le cap des 200 m&#233;gapixels en 2028 avec l'iPhone 21. Une mutation technologique qui s'accompagnerait d'un changement strat&#233;gique de fournisseur.
</description>
    </item>
    <item>
      <title>If AI can&#8217;t hear you, it can&#8217;t help you: why clear audio drives real productivity</title>
      <link>https://www.techradar.com/pro/if-ai-cant-hear-you-it-cant-help-you-why-clear-audio-drives-real-productivity</link>
      <pubDate>Wed, 07 Jan 2026 09:53:03 +0000</pubDate>
      <guid isPermaLink="false">dmxC6p7gk4C85jGGCedm7Y</guid>
      <description>AI tools only deliver value when meeting audio is clear and intelligible.</description>
    </item>
    <item>
      <title>Le meilleur forfait 5G de ce d&#233;but des soldes est l&#224;, et il co&#251;te moins de 8 &#8364; /mois</title>
      <link>https://www.frandroid.com/bons-plans/2932689_le-meilleur-forfait-5g-de-ce-debut-des-soldes-est-la-et-il-coute-moins-de-8-e-mois</link>
      <pubDate>Wed, 07 Jan 2026 09:52:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2932689_le-meilleur-forfait-5g-de-ce-debut-des-soldes-est-la-et-il-coute-moins-de-8-e-mois</guid>
      <description>
Cdiscount mobile d&#233;marre ses soldes d'hiver en grande pompe. Pendant quelques jours seulement, le MVNO affiche un forfait 5G de 250 Go &#224; 7,99 euros par mois. 
</description>
    </item>
    <item>
      <title>On a vu le PC d&#233;roulant de Lenovo&#160;: son &#233;cran passe de 16 &#224; 24 pouces, c&#8217;est bluffant</title>
      <link>https://www.01net.com/actualites/on-a-vu-le-pc-deroulant-de-lenovo-son-ecran-passe-de-16-a-24-pouces-cest-bluffant.html</link>
      <pubDate>Wed, 07 Jan 2026 09:51:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318513</guid>
      <description>Au CES 2026, Lenovo a pli&#233; le game... ou plut&#244;t d&#233;roul&#233;. D&#233;couvrez le Legion Pro Rollable, un monstre dont l'&#233;cran OLED s'&#233;tire &#224; la demande. Bluffant.</description>
    </item>
    <item>
      <title>Leboncoin est formel : c&#8217;est le &#171; moment id&#233;al &#187; pour acheter une voiture &#233;lectrique d&#8217;occasion</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2932555_leboncoin-est-formel-cest-le-moment-ideal-pour-acheter-une-voiture-electrique-doccasion</link>
      <pubDate>Wed, 07 Jan 2026 09:49:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2932555_leboncoin-est-formel-cest-le-moment-ideal-pour-acheter-une-voiture-electrique-doccasion</guid>
      <description>
Selon l&#8217;Observatoire Leboncoin, c&#8217;est le moment id&#233;al pour s&#8217;offrir une voiture &#233;lectrique d&#8217;occasion : apr&#232;s de fortes baisses de prix depuis l&#8217;&#233;t&#233; 2025, les prix commencent &#224; regrimper.
</description>
    </item>
    <item>
      <title>Les plus grosses nouveaut&#233;s &#233;lectriques du CES 2026 sont &#224; d&#233;couvrir dans notre &#233;mission Survolt&#233;s du jour : il va y en avoir pour tout le monde</title>
      <link>https://www.frandroid.com/survoltes/2932709_les-plus-grosses-nouveautes-electriques-du-ces-2026-sont-a-decouvrir-dans-notre-emission-survoltes-du-jour-il-va-y-en-avoir-pour-tout-le-monde</link>
      <pubDate>Wed, 07 Jan 2026 09:48:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2932709_les-plus-grosses-nouveautes-electriques-du-ces-2026-sont-a-decouvrir-dans-notre-emission-survoltes-du-jour-il-va-y-en-avoir-pour-tout-le-monde</guid>
      <description>
L&#8217;&#233;quipe Survolt&#233;s (Frandroid) et Vroom (Numerama) vous donnent rendez-vous ce mercredi 7 janvier, d&#232;s 18h, pour une &#233;mission sp&#233;ciale CES 2026. Au menu du jour : des nouveaut&#233;s &#233;lectriques tr&#232;s excitantes et un duplex en direct de Las Vegas.
</description>
    </item>
    <item>
      <title>Cet objet pratique d&#8217;Anker peut recharger trois appareils en m&#234;me temps</title>
      <link>https://www.frandroid.com/marques/anker/2932445_cet-objet-pratique-danker-peut-recharger-trois-appareils-en-meme-temps</link>
      <pubDate>Wed, 07 Jan 2026 09:38:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/anker/2932445_cet-objet-pratique-danker-peut-recharger-trois-appareils-en-meme-temps</guid>
      <description>
Anker lance un appareil capable de recharger un smartphone, des &#233;couteurs sans fil et une montre connect&#233;e en m&#234;me temps et qui reste pourtant facile &#224; transporter partout.
</description>
    </item>
    <item>
      <title>Nvidia's new G-Sync Pulsar update for motion clarity is a big win for PC gamers, and here's why</title>
      <link>https://www.techradar.com/computing/monitors/nvidias-new-g-sync-pulsar-update-for-motion-clarity-is-a-big-win-for-pc-gamers-and-heres-why</link>
      <pubDate>Wed, 07 Jan 2026 09:37:06 +0000</pubDate>
      <guid isPermaLink="false">Ghd6NCYZubga8aAvEE74uM</guid>
      <description>Nvidia's G-Sync technology has just levelled up, with G-Sync Pulsar now the answer to stutter and motion blur-free gameplay.</description>
    </item>
    <item>
      <title>PlayStation : Sony d&#233;pose un brevet pour que l&#8217;IA finisse vos jeux &#224; votre place</title>
      <link>https://www.frandroid.com/marques/sony/2932477_playstation-sony-depose-un-brevet-pour-que-lia-finisse-vos-jeux-a-votre-place</link>
      <pubDate>Wed, 07 Jan 2026 09:31:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2932477_playstation-sony-depose-un-brevet-pour-que-lia-finisse-vos-jeux-a-votre-place</guid>
      <description>
Un brevet d&#233;pos&#233; par Sony d&#233;voile les contours d&#8217;un futur dans lequel des assistants IA pourraient faire office de guides fant&#244;mes pour aider les joueurs &#224; traverser certaines parties de jeux.
</description>
    </item>
    <item>
      <title>Les Soldes d&#8217;hiver 2026 commencent fort avec -50% sur le Mova Z50 Ultra, un aspirateur robot laveur &#224; eau chaude 36&#176; in&#233;dit</title>
      <link>https://www.frandroid.com/bons-plans/2930221_les-soldes-dhiver-2026-commencent-fort-avec-50-sur-le-mova-z50-ultra-un-aspirateur-robot-laveur-a-eau-chaude-36-inedit</link>
      <pubDate>Wed, 07 Jan 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930221_les-soldes-dhiver-2026-commencent-fort-avec-50-sur-le-mova-z50-ultra-un-aspirateur-robot-laveur-a-eau-chaude-36-inedit</guid>
      <description>
Le Mova Z50 Ultra est un aspirateur laveur haut de gamme avec une puissance d'aspiration record de 19 000 Pa et un syst&#232;me de lavage innovant Hydro Sync. Il est sold&#233; &#224; 599 euros pour les Soldes Fnac et Darty, au lieu de 1 199 euros.
</description>
    </item>
    <item>
      <title>Lave-biberons Anker Eufy : le luxe ultime des parents &#233;puis&#233;s et fortun&#233;s</title>
      <link>https://www.frandroid.com/events/ces/2932803_lave-biberons-anker-eufy-le-luxe-ultime-des-parents-epuises-et-fortunes</link>
      <pubDate>Wed, 07 Jan 2026 09:29:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/events/ces/2932803_lave-biberons-anker-eufy-le-luxe-ultime-des-parents-epuises-et-fortunes</guid>
      <description>
La "taxe fatigue" des jeunes parents vient de trouver son nouveau roi. Le Eufy Bottle Washer S1 Pro d&#233;barque avec une promesse simple : ne plus jamais toucher un goupillon de votre vie. Pour 469 &#8364;, cet engin promet de laver, st&#233;riliser et s&#233;cher 8 biberons en 40 minutes. C'est cher pay&#233; le sommeil, mais &#231;a se regarde.
</description>
    </item>
    <item>
      <title>On a vu l&#8217;&#233;cran de ce PC portable s&#8217;agrandir tout seul : voici le nouveau concept bluffant de Lenovo</title>
      <link>https://www.frandroid.com/marques/lenovo/2932653_on-a-vu-lecran-de-ce-pc-portable-sagrandir-tout-seul-voici-le-nouveau-concept-bluffant-de-lenovo</link>
      <pubDate>Wed, 07 Jan 2026 09:27:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lenovo/2932653_on-a-vu-lecran-de-ce-pc-portable-sagrandir-tout-seul-voici-le-nouveau-concept-bluffant-de-lenovo</guid>
      <description>
Lors du CES 2026 de Las Vegas, Lenovo a d&#233;voil&#233; le Legion Pro Rollable Concept, un PC portable dont l'&#233;cran peut s'&#233;tirer physiquement pour atteindre une diagonale de 24 pouces. 
</description>
    </item>
    <item>
      <title>Galaxy S26&#160;: la date de l&#8217;Unpacked aurait fuit&#233;, et il va falloir &#234;tre patient</title>
      <link>https://www.01net.com/actualites/galaxy-s26-date-unpacked-aurait-fuite-va-falloir-etre-patient.html</link>
      <pubDate>Wed, 07 Jan 2026 09:16:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318520</guid>
      <description>Samsung d&#233;calerait le lancement de sa gamme Galaxy S26, rompant ainsi avec ses habituels lancements du mois de janvier. Un d&#233;lai qui pourrait s'expliquer par une r&#233;organisation strat&#233;gique de la gamme.</description>
    </item>
    <item>
      <title>The AI bubble &#8211; it will burst, but AI will still be here</title>
      <link>https://www.techradar.com/pro/the-ai-bubble-it-will-burst-but-ai-will-still-be-here</link>
      <pubDate>Wed, 07 Jan 2026 09:08:27 +0000</pubDate>
      <guid isPermaLink="false">AhFmRGuM4ryi9HbY2CMqYM</guid>
      <description>AI isn&#8217;t a bubble; it&#8217;s a technological shift on the scale of the internet or electricity, and you can&#8217;t uninvent intelligence.</description>
    </item>
    <item>
      <title>Premi&#232;re faille Chrome de 2026&#160;: Google d&#233;ploie un correctif, installez la mise &#224; jour</title>
      <link>https://www.01net.com/actualites/premiere-faille-chrome-de-2026-google-deploie-un-correctif-installez-la-mise-a-jour.html</link>
      <pubDate>Wed, 07 Jan 2026 09:01:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318510</guid>
      <description>Google d&#233;marre 2026 avec une premi&#232;re alerte s&#233;curit&#233; sur Chrome. Le g&#233;ant am&#233;ricain corrige en effet une faille jug&#233;e de gravit&#233; &#233;lev&#233;e dans WebView. L'&#233;diteur d&#233;ploie une mise &#224; jour d'urgence pour prot&#233;ger ses utilisateurs.</description>
    </item>
    <item>
      <title>This startup helps enterprising resellers prevent nearly a million pounds of returns from ending up in landfills</title>
      <link>https://www.fastcompany.com/91466217/this-startup-helps-enterprising-resellers-prevent-nearly-a-million-pounds-of-returns-from-ending-up-in-landfills</link>
      <pubDate>2026-01-07T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91466217/this-startup-helps-enterprising-resellers-prevent-nearly-a-million-pounds-of-returns-from-ending-up-in-landfills</guid>
      <description>Founded by three former high school buddies, rScan provides software and logistics to sort chaotic piles of rejected products into merchandise ready for resale.
Americans are likely to have spent a record $1 trillion-plus this holiday shopping season alone, and about $5.5 trillion in retail sales in all of 2025, according to estimates by the National Retail Federation. That includes many unhappy returns for retailers: And when it comes back to them, a lot of the $850 billion in returned merchandise is often cheaper to discard than to inspect, sort, and resell&#8212;adding millions of tons to landfil...</description>
    </item>
    <item>
      <title>Why the best leaders treat their wardrobe like a strategic tool</title>
      <link>https://www.fastcompany.com/91468619/why-the-best-leaders-treat-their-wardrobe-like-a-strategic-tool</link>
      <pubDate>2026-01-07T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91468619/why-the-best-leaders-treat-their-wardrobe-like-a-strategic-tool</guid>
      <description>Leaders are increasingly discovering what fashion psychologists have long known: Appearance isn&#8217;t superficial. It&#8217;s foundational.
Remember that scene in The Devil Wears Prada when Miranda Priestly silences Andy Sachs with a perfectly delivered monologue about a cerulean blue sweater? Andy had dismissed it as trivial&#8212;just another fashion detail. But Miranda&#8217;s lesson wasn&#8217;t about the sweater. It was about power: When you think you&#8217;re outside the system, you&#8217;re actually reinforcing it. You can&#8217;t opt out of the fashion system. You can only choose whether you&#8217;re aware of it....</description>
    </item>
    <item>
      <title>CES 2026 live updates: See the latest news, surprises, and strange tech from LG, Samsung, Lego, and new startups</title>
      <link>https://mashable.com/live/ces-2026-news-live-updates</link>
      <pubDate>Wed, 07 Jan 2026 08:48:05 +0000</pubDate>
      <guid isPermaLink="false">00HdPGMgSorg1E6HI6usOJ2</guid>
      <description>CES 2026 is finally here, and Mashable reporters are on the ground looking for the best in show. Get live updates from the showroom floor and behind the scenes.</description>
    </item>
    <item>
      <title>Razer enferme un compagnon IA dans un bocal connect&#233; avec son &#233;trange projet Ava</title>
      <link>https://www.01net.com/actualites/razer-enferme-un-compagnon-ia-dans-un-bocal-connecte-avec-son-etrange-projet-ava.html</link>
      <pubDate>Wed, 07 Jan 2026 08:30:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318498</guid>
      <description>Amusant ou glauque, chacun aura son opinion sur le projet Ava, derni&#232;re folie sign&#233;e Razer qui enferme un bot IA dans une sorte de bocal connect&#233;. Les compagnons propos&#233;s, d'un go&#251;t plus ou moins douteux, donnent des conseils sur tous les sujets, y compris pour jouer plus efficacement.</description>
    </item>
    <item>
      <title>Philips Hue Will Soon Let Your Lights Work Together for Scenes</title>
      <link>https://gizmodo.com/philips-hue-will-soon-let-your-lights-work-together-for-scenes-2000706444</link>
      <pubDate>Wed, 07 Jan 2026 08:30:20 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000706444</guid>
      <description>It's now far easier to set grouped Philips Hue lights up in scenes.</description>
    </item>
    <item>
      <title>It turns out I&#8217;ve been using my Hue lights all wrong</title>
      <link>https://www.theverge.com/tech/857250/philips-hue-spatial-aware-smart-lighting-feature</link>
      <pubDate>2026-01-07T03:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=857250</guid>
      <description>Color-changing lights are a lot of fun, but it can be hard to figure out how to best use them in your home. Most smart lighting companies offer pre-designed scenes to help you light your space, but the lights don't know where they are physically in your home, and the effect can get diluted. Philips [&#8230;]</description>
    </item>
    <item>
      <title>The Philips Hue app can now customize lighting scenes so they suit the layout of your rooms</title>
      <link>https://www.techradar.com/home/smart-lights/the-philips-hue-app-can-now-customize-lighting-scenes-so-they-suit-the-layout-of-your-rooms</link>
      <pubDate>Wed, 07 Jan 2026 08:30:00 +0000</pubDate>
      <guid isPermaLink="false">xfEjXAbzHoKKZWrpFT5Uwf</guid>
      <description>Hue SpatialAware is a new augmented reality feature that considers the location of your bulbs and lamps when applying a scene.</description>
    </item>
  </channel>
</rss>
