<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 04 Nov 2025 09:42:20 GMT</lastBuildDate>
    <item>
      <title>Test du Dreame H15 Pro FoamWash : que vaut le balai laveur qui nettoie &#224; la mousse ?</title>
      <link>https://www.frandroid.com/test/2848869_test-dreame-h15-pro-foamwash</link>
      <pubDate>Tue, 04 Nov 2025 09:41:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/test/2848869_test-dreame-h15-pro-foamwash</guid>
      <description>
Dreame revient avec le H15 Pro FoamWash, capable de nettoyer les sols en pulv&#233;risant une mousse lavante, con&#231;ue pour &#233;liminer les taches tenaces et les odeurs. Ce mod&#232;le se veut id&#233;al pour les foyers avec animaux, en promettant d'&#233;liminer la salet&#233; et les odeurs en toutes circonstances. Dans ce test complet, voyons si le H15 Pro FoamWash se diff&#233;rencie r&#233;ellement des autres mod&#232;les gr&#226;ce &#224; son nettoyage &#224; la mousse.
...</description>
    </item>
    <item>
      <title>Xiaomi d&#233;gaine une batterie externe 165 W avec c&#226;ble int&#233;gr&#233;&#8230; et un prix qui va faire tr&#232;s mal</title>
      <link>https://www.01net.com/actualites/xiaomi-degaine-une-batterie-externe-165-w-avec-cable-integre-et-un-prix-qui-va-faire-tres-mal.html</link>
      <pubDate>Tue, 04 Nov 2025 09:37:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304923</guid>
      <description>La nouvelle batterie 20 000 mAh de Xiaomi offre 165 W de puissance, un &#233;cran couleur et un c&#226;ble 6A int&#233;gr&#233;. De quoi recharger un PC portable et un tel &#224; fond, pour un prix qui risque&#160;de vous faire tourner la t&#234;te.</description>
    </item>
    <item>
      <title>L&#8217;industrie du v&#233;lo est-elle en crise en Europe ? Ce signe encourageant contrebalance avec la pr&#233;-crise qui frappe le plus grand salon v&#233;lo du continent</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2854083_lindustrie-du-velo-est-elle-en-crise-en-europe-ce-signe-encourageant-contrebalance-avec-la-pre-crise-qui-frappe-le-plus-grand-salon-velo-du-continent</link>
      <pubDate>Tue, 04 Nov 2025 09:35:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2854083_lindustrie-du-velo-est-elle-en-crise-en-europe-ce-signe-encourageant-contrebalance-avec-la-pre-crise-qui-frappe-le-plus-grand-salon-velo-du-continent</guid>
      <description>
&#8203;&#8203;Le salon v&#233;lo Cyclingworld, organis&#233; en mars 2026 &#224; D&#252;sseldorf, annonce l&#8217;ouverture d&#8217;un nouvel espace en plein centre-ville. Le salon gagne ainsi en surface et en ambition, quand, en face, le plus grand salon v&#233;lo d&#8217;Europe - l&#8217;Eurobike - traverse d&#233;j&#224; une pr&#233;-crise &#224; l&#8217;horizon de son &#233;dition 2026.
</description>
    </item>
    <item>
      <title>Que deviennent les avions qui ne volent plus ?</title>
      <link>https://www.futura-sciences.com/sciences/actualites/avion-deviennent-avions-ne-volent-plus-125771/#xtor%3DRSS-8</link>
      <pubDate>Tue, 04 Nov 2025 10:30:13 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/avion-deviennent-avions-ne-volent-plus-125771/#xtor%3DRSS-8</guid>
      <description>Le nouvel &#233;pisode de Radar, le podcast de Safran, ouvre cette fois les portes d&#8217;un endroit unique en France&#160;: les hangars de TARMAC Aerosave, qui accueillent les avions hors service, en r&#233;paration, maintenance ou fin de vie.</description>
    </item>
    <item>
      <title>A New Light-Based Cancer Treatment Kills Tumor Cells and Spares Healthy Ones</title>
      <link>https://www.wired.com/story/a-new-light-based-cancer-treatment-kills-tumor-cells-and-spares-healthy-ones/</link>
      <pubDate>Tue, 04 Nov 2025 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">68ff8475bb2a8c8875e782d7</guid>
      <description>By combining LED technology and nanomaterials, researchers have created a therapy that eliminates cancer cells using localized heat without damaging healthy tissue.</description>
    </item>
    <item>
      <title>Free lance une box Stranger Things en &#233;dition limit&#233;e</title>
      <link>https://www.01net.com/actualites/free-lance-une-box-stranger-things-en-edition-limitee.html</link>
      <pubDate>Tue, 04 Nov 2025 09:28:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304951</guid>
      <description>&#192; l&#8217;approche de la derni&#232;re saison de Stranger Things, l&#8217;op&#233;rateur Free habille ses 266 boutiques et sa Freebox Ultra aux couleurs de la s&#233;rie culte de Netflix. Stickers, animations lumineuses et clin d&#8217;&#339;il au Stranger Things Day.</description>
    </item>
    <item>
      <title>AMD se voit poursuivie en justice sur la technologie phare de ses processeurs de jeu</title>
      <link>https://www.frandroid.com/marques/amd/2853955_amd-se-voit-poursuivie-en-justice-sur-la-technologie-phare-de-ses-processeurs-de-jeu</link>
      <pubDate>Tue, 04 Nov 2025 09:28:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amd/2853955_amd-se-voit-poursuivie-en-justice-sur-la-technologie-phare-de-ses-processeurs-de-jeu</guid>
      <description>
AMD est accus&#233;e d'avoir viol&#233; dix brevets visant ses technologies d'empilement 3D et de 3D V-Cache dans ses processeurs. 
</description>
    </item>
    <item>
      <title>La Fnac et Darty frappent fort pour ce d&#233;but de pr&#233;-Black Friday : les 14 offres Tech &#224; ne pas rater</title>
      <link>https://www.frandroid.com/bons-plans/2849237_la-fnac-et-darty-frappent-fort-pour-ce-debut-de-black-friday-les-8-offres-tech-a-ne-pas-rater</link>
      <pubDate>Tue, 04 Nov 2025 09:22:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849237_la-fnac-et-darty-frappent-fort-pour-ce-debut-de-black-friday-les-8-offres-tech-a-ne-pas-rater</guid>
      <description>
Le pr&#233;-Black Friday a commenc&#233; vendredi dernier chez Boulanger et les deux enseignes fran&#231;aises, la Fnac et Darty, se joignent &#233;videmment aux festivit&#233;s et revoient &#224; la baisse le prix de certaines r&#233;f&#233;rences Tech. Il y aura forc&#233;ment de quoi vous faire plaisir : d&#233;couvrez ici les offres qui valent le coup ! 
</description>
    </item>
    <item>
      <title>Le pr&#233;-Black Friday casse d&#233;j&#224; les prix des iPhone, Samsung Galaxy et Google Pixel : les 11 bons plans smartphones &#224; ne pas louper</title>
      <link>https://www.frandroid.com/bons-plans/2848295_le-pre-black-friday-lance-les-premieres-promotions-sur-les-smartphones-dont-le-google-pixel-10-voici-les-meilleures-offres</link>
      <pubDate>Tue, 04 Nov 2025 09:21:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848295_le-pre-black-friday-lance-les-premieres-promotions-sur-les-smartphones-dont-le-google-pixel-10-voici-les-meilleures-offres</guid>
      <description>
C'est d&#233;sormais bien connu, les commer&#231;ants n'attendent pas le Black Friday pour mettre en avant leurs promotions avec le label de l'&#233;v&#233;nement. L'avantage ? Plus de temps pour faire ses courses de No&#235;l, et &#224; deux mois du r&#233;veillon, on vous comprend si vous vous appr&#233;tez d&#233;j&#224; &#224; craquer pour certains de ces smartphones.
</description>
    </item>
    <item>
      <title>Pano S1 et Pano S2&#8239;chez Dreame, deux barres de son de r&#234;ve&#160;?</title>
      <link>https://www.frandroid.com/marques/dreame/2854029_pano-s1-et-pano-s2-chez-dreame-deux-barres-de-son-de-reve</link>
      <pubDate>Tue, 04 Nov 2025 09:16:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dreame/2854029_pano-s1-et-pano-s2-chez-dreame-deux-barres-de-son-de-reve</guid>
      <description>
Le fabricant Dreame, principalement reconnu pour ses aspirateurs balais et robots, a r&#233;cemment choisi d&#8217;&#233;tendre ses activit&#233;s avec des produits hi-fi&#8239;: lors de l&#8217;IFA 2025, la marque chinoise a r&#233;v&#233;l&#233; deux nouvelles barres de son, les Pano S1 et Pano S2. Elles sont maintenant disponibles en Chine et bient&#244;t chez nous.
</description>
    </item>
    <item>
      <title>&#199;a y est, la voiture volante est enfin devenue r&#233;alit&#233; gr&#226;ce &#224; ce constructeur automobile chinois</title>
      <link>https://www.frandroid.com/marques/xpeng/2853831_ca-y-est-la-voiture-volante-est-enfin-devenue-realite-grace-a-ce-constructeur-automobile-chinois</link>
      <pubDate>Tue, 04 Nov 2025 09:14:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2853831_ca-y-est-la-voiture-volante-est-enfin-devenue-realite-grace-a-ce-constructeur-automobile-chinois</guid>
      <description>
Connue pour ses voitures &#233;lectriques, la marque chinoise Xpeng s&#8217;int&#233;resse aussi &#224; un autre domaine&#160;: la voiture volante. Et voil&#224; que la production en s&#233;rie vient juste de d&#233;marrer pour l&#8217;&#233;tonnante invention du constructeur.
</description>
    </item>
    <item>
      <title>Pixel 9 et 10&#160;: Google ne compte rien faire contre ce bug tr&#232;s aga&#231;ant</title>
      <link>https://www.01net.com/actualites/pixel-9-10-google-compte-rien-faire-contre-bug-tres-agacant.html</link>
      <pubDate>Tue, 04 Nov 2025 09:06:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304927</guid>
      <description>Les Pixel 9 et 10 tra&#238;nent un bug depuis des mois et Google n&#8217;a visiblement pas l&#8217;intention de le corriger.</description>
    </item>
    <item>
      <title>Jackery Explorer 500 v2 Portable Power Station + SolarSaga 100W Portable Solar Panels Review</title>
      <link>https://www.techradar.com/pro/jackery-explorer-500-v2-portable-power-station-solarsaga-100w-portable-solar-panels-review</link>
      <pubDate>Tue, 04 Nov 2025 09:05:02 +0000</pubDate>
      <guid isPermaLink="false">DqzajMFQvEaw8MdEFXjjbF</guid>
      <description>Small power in Jackery&#8217;s new line of power stations for ultra-portability</description>
    </item>
    <item>
      <title>Sur PS4 et PS5, Sony rembourse ce nouveau jeu Mortal Kombat malgr&#233; la politique stricte du PlayStation Store</title>
      <link>https://www.frandroid.com/marques/sony/2853931_sur-ps4-et-ps5-sony-rembourse-ce-nouveau-jeu-mortal-kombat-malgre-la-politique-stricte-du-playstation-store</link>
      <pubDate>Tue, 04 Nov 2025 09:04:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2853931_sur-ps4-et-ps5-sony-rembourse-ce-nouveau-jeu-mortal-kombat-malgre-la-politique-stricte-du-playstation-store</guid>
      <description>
Confront&#233;s &#224; de gros probl&#232;mes techniques, notamment un input lag catastrophique, les joueurs PS4 et PS5 de Mortal Kombat: Legacy Kollection obtiennent des remboursements exceptionnels de la part du PlayStation Store, for&#231;ant Sony &#224; contourner sa propre politique.
</description>
    </item>
    <item>
      <title>La dr&#244;le d&#8217;id&#233;e d&#8217;Android 17 : des applications accessibles depuis votre &#233;cran de veille</title>
      <link>https://www.frandroid.com/android/mises-a-jour-android/2853915_la-drole-didee-dandroid-17-des-applications-accessibles-depuis-votre-ecran-de-veille</link>
      <pubDate>Tue, 04 Nov 2025 09:03:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/mises-a-jour-android/2853915_la-drole-didee-dandroid-17-des-applications-accessibles-depuis-votre-ecran-de-veille</guid>
      <description>
Et si l&#8217;interface de votre application restait accessible m&#234;me quand vous verrouillez votre t&#233;l&#233;phone&#8201;? C&#8217;est ce que semble pr&#233;parer Google dans Android 17.
</description>
    </item>
    <item>
      <title>Voici la surprise de Free : une Freebox Ultra &#201;dition Limit&#233;e Stranger Things</title>
      <link>https://www.frandroid.com/marques/2853925_voici-la-nouveaute-de-free-une-freebox-ultra-edition-limitee-stranger-things</link>
      <pubDate>Tue, 04 Nov 2025 09:01:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2853925_voici-la-nouveaute-de-free-une-freebox-ultra-edition-limitee-stranger-things</guid>
      <description>
Nous avions vu juste dans nos pr&#233;dictions, Free annonce aujourd'hui une nouvelle Freebox Ultra &#233;dition limit&#233;e. Cette ann&#233;e, c'est en partenariat avec Netflix et la sortie de l'ultime saison de Stranger Things.
</description>
    </item>
    <item>
      <title>Nouvelle baisse du Bitcoin&#160;: plus d&#8217;un milliard de dollars s&#8217;&#233;vaporent du march&#233; crypto</title>
      <link>https://www.01net.com/actualites/bitcoin-devisse-sous-105-000-dollars-plus-milliard-dollars-evaporent-marche-crypto.html</link>
      <pubDate>Tue, 04 Nov 2025 09:01:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304916</guid>
      <description>Le Bitcoin replonge sous les 105 000 dollars, entra&#238;nant tout le march&#233; crypto dans sa chute. De plus en plus loin de son record, la cryptomonnaie num&#233;ro un continue de s'afficher dans le rouge. En 24 heures, plus d&#8217;un milliard de dollars de positions ont &#233;t&#233; liquid&#233;es sur le march&#233;&#8230;</description>
    </item>
    <item>
      <title>Honda lance sa premi&#232;re moto &#233;lectrique&#160;: design redoutable, mais un simple permis A1 peut la dompter</title>
      <link>https://www.01net.com/actualites/honda-lance-sa-premiere-moto-electrique-design-redoutable-mais-un-simple-permis-a1-peut-la-dompter.html</link>
      <pubDate>Tue, 04 Nov 2025 09:00:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304875</guid>
      <description>Honda d&#233;voile la WN7, la premi&#232;re moto &#233;lectrique de son histoire. Derri&#232;re son allure tr&#232;s sportive se cache en r&#233;alit&#233; une moto taill&#233;e pour la ville.</description>
    </item>
    <item>
      <title>Comparatif : quelles sont les meilleures enceintes Bluetooth &#224; acheter en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guide-audio/722626_guide-meilleures-enceintes-portables</link>
      <pubDate>Tue, 04 Nov 2025 09:00:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-audio/722626_guide-meilleures-enceintes-portables</guid>
      <description>
Pratique, compacte, l'enceinte Bluetooth sans fil nous accompagne autant &#224; la maison qu'en d&#233;placement ou en vacances. On vous propose ici une s&#233;lection pointue des meilleures enceintes Bluetooth que nous avons pu tester.
</description>
    </item>
    <item>
      <title>Black Friday 2025 : la braderie continue chez Amazon &amp; Co, voici les meilleures offres en avant-premi&#232;re</title>
      <link>https://www.frandroid.com/bons-plans/2849105_black-friday-2025-la-braderie-continue-chez-amazon-co-voici-les-meilleures-offres-en-avant-premiere</link>
      <pubDate>Tue, 04 Nov 2025 08:57:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849105_black-friday-2025-la-braderie-continue-chez-amazon-co-voici-les-meilleures-offres-en-avant-premiere</guid>
      <description>
Non, vous ne r&#234;vez pas ! Novembre commence &#224; peine que le Black Friday commence d&#233;j&#224; chez certains e-commer&#231;ants fran&#231;ais. Dans cet article, nous allons vous lister les meilleures offres en temps r&#233;el pour que vous puissiez faire d'excellentes affaires sur les meilleurs produits tech du moment. 
</description>
    </item>
    <item>
      <title>Peut-on esp&#233;rer une sortie du Samsung Galaxy Z Trifold en France ?</title>
      <link>https://www.frandroid.com/marques/samsung/2853901_peut-on-esperer-une-sortie-du-samsung-galaxy-z-trifold-en-france</link>
      <pubDate>Tue, 04 Nov 2025 08:46:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2853901_peut-on-esperer-une-sortie-du-samsung-galaxy-z-trifold-en-france</guid>
      <description>
L'espoir est faible mais il existe : une variante europ&#233;enne du Samsung Galaxy Z Trifold pourrait voir le jour.
</description>
    </item>
    <item>
      <title>&#171; Cette d&#233;cision n&#8217;a pas &#233;t&#233; prise &#224; la l&#233;g&#232;re &#187; : nouvelle faillite dans le v&#233;lo &#233;lectrique, l&#8217;ann&#233;e 2025 est une petite h&#233;catombe</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2853907_cette-decision-na-pas-ete-prise-a-la-legere-nouvelle-faillite-dans-le-velo-electrique-lannee-2025-est-une-petite-hecatombe</link>
      <pubDate>Tue, 04 Nov 2025 08:37:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2853907_cette-decision-na-pas-ete-prise-a-la-legere-nouvelle-faillite-dans-le-velo-electrique-lannee-2025-est-une-petite-hecatombe</guid>
      <description>
YT Industries USA met fin &#224; ses activit&#233;s apr&#232;s l&#8217;&#233;chec des discussions avec sa maison-m&#232;re allemande, en difficult&#233; depuis plusieurs mois elle aussi. Cette fermeture est &#224; ajouter dans la liste des faillites qui continue d&#8217;affecter le secteur du v&#233;lo &#233;lectrique en 2025.
</description>
    </item>
    <item>
      <title>Windows 10, c&#8217;est fini&#8230; sauf pour pr&#232;s d&#8217;un tiers des joueurs</title>
      <link>https://www.01net.com/actualites/windows-10-cest-fini-sauf-pour-pres-dun-tiers-des-joueurs.html</link>
      <pubDate>Tue, 04 Nov 2025 08:31:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304873</guid>
      <description>&#192; moins de vivre sous un caillou, tout le monde sait d&#233;sormais que Microsoft a mis fin au support de Windows 10 depuis le mois dernier. &#199;a n'emp&#234;che pas de continuer &#224; utiliser le syst&#232;me d'exploitation &#233;videmment, et les joueurs ne s'en privent pas.</description>
    </item>
    <item>
      <title>Xbouse : la bourde de Microsoft n&#8217;est pas pass&#233;e inaper&#231;ue en France</title>
      <link>https://www.frandroid.com/marques/microsoft/2853897_xbouse-la-bourde-de-microsoft-nest-pas-passee-inapercue-en-france</link>
      <pubDate>Tue, 04 Nov 2025 08:19:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2853897_xbouse-la-bourde-de-microsoft-nest-pas-passee-inapercue-en-france</guid>
      <description>
Le compte officiel britannique de Xbox s'est amus&#233; &#224; publier une image de Xbouse. Un jeu de mots en anglais, qui prend un tout autre sens en fran&#231;ais.
</description>
    </item>
    <item>
      <title>&#171;&#160;C&#8217;est presque comme si tu achetais plusieurs jeux&#160;&#187; : GTA VI &#224; 100 euros, vous en pensez quoi&#160;?</title>
      <link>https://www.01net.com/actualites/cest-presque-comme-si-tu-achetais-plusieurs-jeux-gta-vi-a-100-euros-vous-en-pensez-quoi.html</link>
      <pubDate>Tue, 04 Nov 2025 08:03:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304770</guid>
      <description>La sortie de GTA&#8239;VI s&#8217;annonce comme un moment cl&#233; pour l&#8217;industrie vid&#233;oludique. Un acteur de GTA&#8239;V estime que le jeu pourrait justifier un prix de 100&#8239;euros, relan&#231;ant le d&#233;bat sur le co&#251;t des grandes productions.</description>
    </item>
  </channel>
</rss>
