<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 15 Nov 2025 09:32:01 GMT</lastBuildDate>
    <item>
      <title>5 things we want from the iPhone 18 and iPhone 18 Pro</title>
      <link>https://www.techradar.com/phones/iphone/5-things-we-want-from-the-iphone-18-and-iphone-18-pro</link>
      <pubDate>Sat, 15 Nov 2025 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">zveHrQ4JVT4LFGRM4pEkCC</guid>
      <description>There's a lot Apple could do to make the iPhone 18 series better than the iPhone 17 line, including battery, camera, and AI improvements.</description>
    </item>
    <item>
      <title>Amazon continue les offres pendant le week-end du pr&#233;-Black Friday : voici le TOP des deals</title>
      <link>https://www.frandroid.com/bons-plans/2860071_amazon-brade-deja-un-tas-de-produits-tech-pour-le-pre-black-friday-les-14-offres-a-retenir</link>
      <pubDate>Sat, 15 Nov 2025 09:29:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860071_amazon-brade-deja-un-tas-de-produits-tech-pour-le-pre-black-friday-les-14-offres-a-retenir</guid>
      <description>
Amazon lance d&#233;j&#224; ses premi&#232;res promotions avant le Black Friday et baisse fortement les prix sur de nombreux produits Tech. D&#233;couvrez d&#232;s maintenant les meilleures offres &#224; ne pas manquer.
</description>
    </item>
    <item>
      <title>Black Friday sur les montres connect&#233;es : les smartwatches Apple, Garmin, Xiaomi, Samsung en profitent aussi</title>
      <link>https://www.frandroid.com/bons-plans/2854639_top-offres-black-friday-montres-bracelets-connectes</link>
      <pubDate>Sat, 15 Nov 2025 09:11:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2854639_top-offres-black-friday-montres-bracelets-connectes</guid>
      <description>
Nous ne sommes que mi-novembre, mais les promotions d&#233;barquent avant l&#8217;heure. Ce pr&#233;-Black Friday met &#224; l&#8217;honneur les montres connect&#233;es et les bracelets, orient&#233;s sport ou lifestyle. Tour d&#8217;horizon des meilleures offres d&#233;j&#224; propos&#233;es par les e-commer&#231;ants pour s'offrir une smartwach &#224; prix cass&#233;.
</description>
    </item>
    <item>
      <title>Meilleurs smartphones haut de gamme 2025 : nos recommandations et tests</title>
      <link>https://www.frandroid.com/guide-dachat/smartphones/289788_quels-sont-les-meilleurs-smartphones-haut-de-gamme-android-en-2017</link>
      <pubDate>Sat, 15 Nov 2025 09:02:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/smartphones/289788_quels-sont-les-meilleurs-smartphones-haut-de-gamme-android-en-2017</guid>
      <description>
Vous partez en qu&#234;te du smartphone de vos r&#234;ves et vous avez un budget illimit&#233; pour vous l'offrir&#160;? Bienvenue sur notre s&#233;lection de smartphones haut de gamme, tous test&#233;s et approuv&#233;s, pour vous aider dans votre choix.
</description>
    </item>
    <item>
      <title>The ransomware payment debate: what it means for organizations</title>
      <link>https://www.techradar.com/pro/the-ransomware-payment-debate-what-it-means-for-organizations</link>
      <pubDate>Sat, 15 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">fFoobYwXyL6PLCna7nw9Se</guid>
      <description>Ransomware is on the rise. To pay or not to pay the ransom? That is the question.</description>
    </item>
    <item>
      <title>This new Netflix movie is a dream come true for its director &#8211; here&#8217;s what inspired the animated adventure In Your Dreams</title>
      <link>https://www.techradar.com/streaming/netflix/this-new-netflix-movie-is-a-dream-come-true-for-its-director-heres-what-inspired-the-animated-adventure-in-your-dreams</link>
      <pubDate>Sat, 15 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">fgj2zJzJp6uRRRPowRE6xP</guid>
      <description>Alex Woo, the co-director of Netflix's new animation In Your Dreams, reveals the decade-long journey it took to produce his debut feature film.</description>
    </item>
    <item>
      <title>Stressed about shopping for holiday gifts? These &#8216;consumer wisdom&#8217; tips can help</title>
      <link>https://www.fastcompany.com/91440439/consumer-wisdom-tips-shopping-holiday-gifts</link>
      <pubDate>2025-11-15T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91440439/consumer-wisdom-tips-shopping-holiday-gifts</guid>
      <description>They are everyday ways of aligning your spending with your goals, resources, and values.
Every fall, I anticipate the winter holidays with almost childlike joy. I look forward to familiar traditions with friends and family, eggnog in my coffee, and the sense that everyone is feeling a little lighter and more connected.</description>
    </item>
    <item>
      <title>Black Friday 2025 : voici les meilleures offres encore en ligne ce week-end</title>
      <link>https://www.frandroid.com/bons-plans/2864479_black-friday-2025-meilleures-offres-week-end-en-direct-amazon</link>
      <pubDate>Sat, 15 Nov 2025 08:54:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2864479_black-friday-2025-meilleures-offres-week-end-en-direct-amazon</guid>
      <description>
La date officielle du Black Friday approche &#224; grands pas et les marchands multiplient les promotions en attendant le jour J, le 28 novembre 2025. Le pr&#233;-Black Friday est donc toujours en cours d'un c&#244;t&#233;, chez Amazon, Boulanger, Fnac, Darty ou encore Cdiscount. Et de l'autre, vous avez le Singles Day qui continue, notamment chez AliExpress et autres sites, aussi appel&#233; 11.11. C'est ici que vous retrouverez le meilleur de ces deux &#233;v&#232;nements avec les promos les plus int&#233;ressantes.
...</description>
    </item>
    <item>
      <title>Don't splash the cash! Here are 23 cheap and cheerful early Black Friday deals to grab this weekend</title>
      <link>https://www.techradar.com/seasonal-sales/dont-splash-the-cash-here-are-23-cheap-and-cheerful-early-black-friday-deals-to-grab-this-weekend</link>
      <pubDate>Sat, 15 Nov 2025 08:31:00 +0000</pubDate>
      <guid isPermaLink="false">6k6R4fRohGW5eHGyF3LQde</guid>
      <description>Look after the pounds this Black Friday season with these cheap but handy deals on tech, tools and more.</description>
    </item>
    <item>
      <title>Cette offre in&#233;dite du pr&#233;-Black Friday sur le Meta Quest 3S est la meilleure occasion pour se mettre &#224; la VR</title>
      <link>https://www.frandroid.com/bons-plans/2869265_cette-offre-inedite-du-pre-black-friday-sur-le-meta-quest-3s-est-la-meilleure-occasion-pour-se-mettre-a-la-vr</link>
      <pubDate>Sat, 15 Nov 2025 08:16:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2869265_cette-offre-inedite-du-pre-black-friday-sur-le-meta-quest-3s-est-la-meilleure-occasion-pour-se-mettre-a-la-vr</guid>
      <description>
Le Meta Quest 3S est un casque VR plus abordable que le Meta Quest 3, surtout pendant le pr&#233;-Black Friday o&#249; il est &#224; 249,99 euros au lieu de 329,99 euros sur Amazon.
</description>
    </item>
    <item>
      <title>Ces 7 failles critiques de ChatGPT peuvent vous mettre en danger</title>
      <link>https://www.01net.com/actualites/7-failles-critiques-chatgpt-mettent-danger.html</link>
      <pubDate>Sat, 15 Nov 2025 08:05:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308114</guid>
      <description>Sept vuln&#233;rabilit&#233;s critiques ont &#233;t&#233; d&#233;couvertes dans ChatGPT. Elles permettent aux pirates de voler des conversations, manipuler les r&#233;ponses de l'IA ou ex&#233;cuter du code malveillant sur l'appareil. Baptis&#233;es "HackedGPT", ces failles inqui&#232;tent les experts en cybers&#233;curit&#233; de Tenable.</description>
    </item>
    <item>
      <title>La derni&#232;re mise &#224; jour de la Switch 2 met KO des docks tiers</title>
      <link>https://www.01net.com/actualites/la-derniere-mise-a-jour-de-la-switch-2-met-ko-des-docks-tiers.html</link>
      <pubDate>Sat, 15 Nov 2025 08:03:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308362</guid>
      <description>La derni&#232;re mise &#224; jour du logiciel interne de la Switch 2 pose de gros probl&#232;mes aux docks tiers : leur fonctionnement est alt&#233;r&#233;, en particulier la sortie vid&#233;o. Nintendo assure que ce n'&#233;tait pas son intention, mais le doute reste entier.</description>
    </item>
    <item>
      <title>Recharger votre &#233;lectrique en 10 minutes au lieu de 30 : cette invention promet de tout changer</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2870319_recharger-votre-electrique-en-10-minutes-au-lieu-de-30-cette-invention-promet-de-tout-changer</link>
      <pubDate>Sat, 15 Nov 2025 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2870319_recharger-votre-electrique-en-10-minutes-au-lieu-de-30-cette-invention-promet-de-tout-changer</guid>
      <description>
La recharge des voitures &#233;lectriques en moins de 10 minutes est d&#233;j&#224; une r&#233;alit&#233; en Chine avec BYD et Zeekr. En Europe, cela pourrait bient&#244;t &#234;tre le cas gr&#226;ce &#224; cette solution d'une entreprise anglaise.
</description>
    </item>
    <item>
      <title>Remote work and the big breaches of 2025: Cause or convenient excuse?</title>
      <link>https://www.techradar.com/pro/remote-work-and-the-big-breaches-of-2025-cause-or-convenient-excuse</link>
      <pubDate>Sat, 15 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">5KZxXc2LRh7aqTYBif82AS</guid>
      <description>Remote work can make businesses more vulnerable - but it doesn't have to.</description>
    </item>
    <item>
      <title>Italy vs South Africa free streams: How to watch Autumn International 2025 rugby from anywhere, TV channel, preview</title>
      <link>https://www.techradar.com/how-to-watch/rugby/italy-vs-south-africa-autumn-international-2025-free</link>
      <pubDate>Sat, 15 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">tpnxEzo36nKxXUf7agKPci</guid>
      <description>Here's how to watch Italy vs South Africa live streams from wherever you are in the world, as the Azzuri take on the world champions in Turin.</description>
    </item>
    <item>
      <title>2025 Black Friday ads: Best deals from Walmart, Amazon, Target, Best Buy, Kohls, Home Depot, and more</title>
      <link>https://mashable.com/article/2025-black-friday-ads-deals-walmart-target-best-buy-kohls</link>
      <pubDate>Sat, 15 Nov 2025 07:55:15 +0000</pubDate>
      <guid isPermaLink="false">01v8icrkU8ARvuwAs5knhlq</guid>
      <description>Black Friday Ads. Browse the best deals from Black Friday ads from Amazon, Target, Best Buy, Walmart, Home Depot, and more in 2025.</description>
    </item>
  </channel>
</rss>
