<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 07 Jan 2026 14:29:04 GMT</lastBuildDate>
    <item>
      <title>Boulanger brade un tas de produit Tech durant les soldes d&#8217;hiver : voici le TOP 15 des deals &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2931541_boulanger-degaine-de-belles-offres-pour-les-soldes-dhiver-les-10-offres-qui-meritent-votre-argent</link>
      <pubDate>Wed, 07 Jan 2026 14:18:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931541_boulanger-degaine-de-belles-offres-pour-les-soldes-dhiver-les-10-offres-qui-meritent-votre-argent</guid>
      <description>
Les soldes d&#8217;hiver 2026 viennent tout juste de commencer, donnant une excellente opportunit&#233; d'optimiser ses achats Tech. Pour bien entamer l&#8217;ann&#233;e, le site Boulanger d&#233;ploie une s&#233;rie de remises attractives sur une large gamme de produits. D&#233;couvrez en temps r&#233;el notre s&#233;lection des meilleures offres &#224; ne pas manquer.
</description>
    </item>
    <item>
      <title>Jouer gratuitement aux jeux Android payants ? Ce serait (presque) possible gr&#226;ce &#224; Google</title>
      <link>https://www.frandroid.com/marques/google/2933517_jouer-gratuitement-aux-jeux-android-payants-ce-serait-presque-possible-grace-a-google</link>
      <pubDate>Wed, 07 Jan 2026 14:17:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2933517_jouer-gratuitement-aux-jeux-android-payants-ce-serait-presque-possible-grace-a-google</guid>
      <description>
Google travaille &#224; une fonctionnalit&#233; qui ravirait bon nombre de joueurs sur Android. Surtout ceux qui h&#233;sitent avant de payer pour le titre qui les int&#233;resse.
</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : les meilleures offres &#224; ne pas rater pour cette premi&#232;re journ&#233;e de promotions</title>
      <link>https://www.frandroid.com/bons-plans/2931731_top-depart-soldes-dhiver-2026-les-meilleures-offres-en-direct</link>
      <pubDate>Wed, 07 Jan 2026 14:15:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931731_top-depart-soldes-dhiver-2026-les-meilleures-offres-en-direct</guid>
      <description>
On a bien mang&#233; pendant les f&#234;tes, la nouvelle ann&#233;e est pass&#233;e et il a neig&#233; dans presque toute la France : c'est maintenant l'heure des soldes d'hiver. De plus, cette &#233;dition risque d'&#234;tre particuli&#232;rement int&#233;ressante pour s'&#233;quiper &#224; de bons prix avant la hausse annonc&#233;e en 2026. 
</description>
    </item>
    <item>
      <title>Razer a fait plaisir &#224; Elon Musk : le Project AVA est une &#171;&#160;waifu&#160;&#187; holographique qui vous juge quand vous jouez</title>
      <link>https://www.frandroid.com/marques/2932591_razer-project-ava-le-tamagotchi-du-futur-est-une-waifu-holographique-qui-vous-juge-quand-vous-jouez</link>
      <pubDate>Wed, 07 Jan 2026 14:15:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2932591_razer-project-ava-le-tamagotchi-du-futur-est-une-waifu-holographique-qui-vous-juge-quand-vous-jouez</guid>
      <description>
C'est un peu effrayant. Razer vient de d&#233;voiler Project AVA, un compagnon IA enferm&#233; dans un &#233;cran transparent de 5,5 pouces. Il tourne sous Grok (xAI), analyse votre &#233;cran en temps r&#233;el et promet de vous aider &#224; gagner vos parties class&#233;es.
</description>
    </item>
    <item>
      <title>Warners Bros. Discovery board urges shareholders to reject amended Paramount bid</title>
      <link>https://www.engadget.com/entertainment/streaming/warners-bros-discovery-board-urges-shareholders-to-reject-amended-paramount-bid-141513357.html?src=rss</link>
      <pubDate>Wed, 07 Jan 2026 14:15:13 +0000</pubDate>
      <guid isPermaLink="false">0d85764d-4fa7-4514-8838-b36076c55171</guid>
      <description>In a unanimous written determination, the Warner Bros. Discovery's board is advising shareholders to once again reject Paramount Skydance's "inadequate" hostile takeover bid. The letter to shareholders cites a number of concerns with the offer and reiterates its position that Netflix's offer remains superior. Netflix and WBD have entered into a merger agreement in early December after the WBD board selected its offer over other bidders.
There are two key differences between the two options: Netflix is willing to pay $82 billion, but only for the Warner Bros., HBO and HBO Max divisions; Paramou...</description>
    </item>
    <item>
      <title>The best Wi-Fi extenders in 2025: top devices for boosting your WiFi network.</title>
      <link>https://www.techradar.com/computing/wi-fi-broadband/the-best-wi-fi-extenders-in-2025-top-devices-for-boosting-your-wifi-network</link>
      <pubDate>Wed, 07 Jan 2026 14:15:12 +0000</pubDate>
      <guid isPermaLink="false">a8rnybWysHFd3Wrjbh8nkd</guid>
      <description>The best Wi-Fi extenders will make sure you can get online anywhere in your house.</description>
    </item>
    <item>
      <title>The best gaming TV for all budgets, all real-world tested by our experts.</title>
      <link>https://www.techradar.com/televisions/the-best-gaming-tv-for-all-budgets-all-real-world-tested-by-our-experts</link>
      <pubDate>Wed, 07 Jan 2026 14:14:07 +0000</pubDate>
      <guid isPermaLink="false">zV9tGwHLr45KCjZ6GNCvsM</guid>
      <description>Our guide to finding the best gaming TV for your PS5, Xbox Series X, PC or even last-gen console that will suit all budgets.</description>
    </item>
    <item>
      <title>I&#8217;m a trained TV calibrator, and here are the best TVs you can buy</title>
      <link>https://www.techradar.com/televisions/im-a-trained-tv-calibrator-and-here-are-the-best-tvs-you-can-buy</link>
      <pubDate>Wed, 07 Jan 2026 14:12:42 +0000</pubDate>
      <guid isPermaLink="false">grVvX3GVPDiFj2oPnXx4AD</guid>
      <description>Top OLED and QLED sets to consider, from elite TVs to wallet-friendly options &#8211; all tested by us.</description>
    </item>
    <item>
      <title>Everything announced at CES 2026</title>
      <link>https://www.engadget.com/general/everything-announced-at-ces-2026-130124802.html?src=rss</link>
      <pubDate>Wed, 07 Jan 2026 14:11:50 +0000</pubDate>
      <guid isPermaLink="false">fd3b4bbf-1b78-4e34-9914-70a2e6f85389</guid>
      <description>It's the first week of a new year and there's no time for the tech world to slowly ease back into things following the holidays. That's because CES 2026 is in full swing, with all manner of companies descending on Las Vegas to reveal their latest innovations and what they're planning to bring your way in the near future.&#160;Many of the Engadget crew are on the ground to check out as much of the new tech as possible. Of course, we're keeping tabs on all of the major CES press conferences too. Samsung held its First Look presentation, which focuses on home products, while LG has shown off a wide ar...</description>
    </item>
    <item>
      <title>Le mini PC beige triste est mort : place au r&#233;tro-cool</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-fixes/mini-pc/2933567_le-mini-pc-beige-triste-est-mort-place-au-retro-cool</link>
      <pubDate>Wed, 07 Jan 2026 14:10:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-fixes/mini-pc/2933567_le-mini-pc-beige-triste-est-mort-place-au-retro-cool</guid>
      <description>
Vous cherchez un mini PC qui a de la gueule ? Regardez &#231;a. Le AYANEO AM03 mise tout sur le style avec son look cubique et ses d&#233;tails soign&#233;s. Sous le capot, la marque fait un choix pragmatique : un Intel Core i9-12900H. C'est de l'ancien, oui, mais &#224; moins de 400 &#8364;, &#231;a limite la casse.
</description>
    </item>
    <item>
      <title>Wi-Fi sur MacBook et iPad : pourquoi vous devriez peut-&#234;tre changer les r&#233;glages de votre box internet</title>
      <link>https://www.frandroid.com/marques/apple/2933495_wi-fi-sur-macbook-et-ipad-pourquoi-vous-devriez-peut-etre-changer-les-reglages-de-votre-box-internet</link>
      <pubDate>Wed, 07 Jan 2026 14:08:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2933495_wi-fi-sur-macbook-et-ipad-pourquoi-vous-devriez-peut-etre-changer-les-reglages-de-votre-box-internet</guid>
      <description>
Apple a discr&#232;tement am&#233;lior&#233; les performances Wi-Fi de ses derniers iPad et MacBook sur iPadOS 26 et macOS 26. Mais il faudra poss&#233;der un routeur compatible pour pouvoir en profiter.
</description>
    </item>
    <item>
      <title>Wearable AI is coming &#8212; and Razer&#8217;s Project Motoko is leading the charge with smart headphones</title>
      <link>https://www.techradar.com/ai-platforms-assistants/wearable-ai-is-coming-and-razers-project-motoko-is-leading-the-charge-with-smart-headphones</link>
      <pubDate>Wed, 07 Jan 2026 14:03:21 +0000</pubDate>
      <guid isPermaLink="false">hwgEFZTEZUimmJ5LCNfCpc</guid>
      <description>Razer&#8217;s Project Motoko reimagines headphones as intelligent, camera-equipped AI companions that respond to your environment and needs without a screen in sight.</description>
    </item>
    <item>
      <title>Flamb&#233;e de la RAM&#160;: les prix vont augmenter chez Samsung aussi</title>
      <link>https://www.01net.com/actualites/flambee-de-la-ram-les-prix-vont-augmenter-chez-samsung-aussi.html</link>
      <pubDate>Wed, 07 Jan 2026 14:02:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318619</guid>
      <description>Il n'y aura pas de miracles chez Samsung. Malgr&#233; sa position dominante sur le march&#233; des semi-conducteurs, le groupe cor&#233;en pr&#233;vient que la hausse des co&#251;ts finira par se retrouver sur les &#233;tiquettes de ses propres produits.</description>
    </item>
    <item>
      <title>Aqara&#8217;s New Thermostat Is Also a Home Hub, Presence Sensor, and Video Doorbell Monitor</title>
      <link>https://gizmodo.com/aqaras-new-thermostat-is-also-a-home-hub-presence-sensor-and-video-doorbell-monitor-2000705839</link>
      <pubDate>Wed, 07 Jan 2026 14:00:15 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705839</guid>
      <description>The Thermostat Hub W200 combines many of the best features of Aqara's lineup to make a very compelling smart home thermostat.</description>
    </item>
    <item>
      <title>Ikea is expanding its Matter support to two stylish lamps</title>
      <link>https://www.theverge.com/tech/853143/ikea-smart-home-matter-varmblixt-donut-color-changing-pendant-lamp</link>
      <pubDate>2026-01-07T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=853143</guid>
      <description>After debuting 21 new Matter-compatible smart home devices last November, Ikea is expanding Matter support to some of its existing home furnishings starting with two upgraded lamps at CES 2026. The Varmblixt donut lamp is getting a small redesign to complement its new color-changing smart home capabilities, while the new Varmblixt pendant lamp will let [&#8230;]...</description>
    </item>
    <item>
      <title>Netflix is bringing back some big franchises in 2026</title>
      <link>https://www.theverge.com/streaming/856756/netflix-2026-releases-bridgerton-one-piece-3-body</link>
      <pubDate>2026-01-07T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=856756</guid>
      <description>Last year was a pivotal one for Netflix, as it saw arguably the streamer's two most prominent series - Stranger Things and Squid Game - come to an end. And while Netflix has a number of competing priorities now, its lineup for 2026 also shows it's not quite done with blockbuster franchises just yet. The [&#8230;]</description>
    </item>
    <item>
      <title>Ikea&#8217;s $10 Kallsup speakers are tiny, colorful, and surprisingly loud</title>
      <link>https://www.theverge.com/tech/857403/ikea-kallsup-bluetooth-speaker-price-release-date</link>
      <pubDate>2026-01-07T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=857403</guid>
      <description>Ikea's new cute, colorful Kallsup Bluetooth speakers cost just $10 (&#8364;5 in Europe) each and feature instant Bluetooth pairing. Pair one to your phone, then, with a two-button sequence, another Kallsup can join the party. You can theoretically pair up to 100. The team I chatted with at CES - where Ikea is making its [&#8230;]</description>
    </item>
    <item>
      <title>Spotify lowers monetization threshold for video podcasts</title>
      <link>https://techcrunch.com/2026/01/07/spotify-lowers-monetization-threshold-for-video-podcasts/</link>
      <pubDate>Wed, 07 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3080635</guid>
      <description>Spotify is dropping the minimum episode requirement to three, minimum consumption hours to 2,000, and engaged audience member threshold to 1,000 over the last 30 days.</description>
    </item>
    <item>
      <title>IKEA just revealed a new donut-shaped smart light &#8211; and it'll look sweet on your tables or walls</title>
      <link>https://www.techradar.com/tech-events/ikea-just-revealed-a-new-donut-shaped-smart-light-and-itll-look-sweet-on-your-table-or-wall</link>
      <pubDate>Wed, 07 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">fAVTtVb6iV5VhHqQEHpRhJ</guid>
      <description>The lights can be controlled using a remote, or connected to IKEA's Wi-Fi hub and linked to your smart home system.</description>
    </item>
    <item>
      <title>Clear Drop is trying to do something about all those plastic bags under your sink</title>
      <link>https://www.engadget.com/home/smart-home/clear-drop-is-trying-to-do-something-about-all-those-plastic-bags-under-your-sink-140000254.html?src=rss</link>
      <pubDate>Wed, 07 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">61d49e20-3d2e-4d6f-92a1-8472a751ccc5</guid>
      <description>Even if you bring home as few bags as possible &#8212; using reusable bags, carrying purchases home with your own two hands &#8212; soft plastics sill accumulate. I certainly have a collection with one flimsy plastic sack filled with dozens or hundreds of others. I plan to do something with it&#8230; eventually. 
Unfortunately, there aren&#8217;t a ton of options for what to do with those soft plastics, as most recycling facilities can&#8217;t accept them. But no one likes seeing them end up in oceans and rivers and stuck up in trees. So I was excited to see the Clear Drop Soft Plastic Compactor (CPC) at CES. It&#8217;s a pre-re...</description>
    </item>
    <item>
      <title>Ce vid&#233;oprojecteur Xgimi 4K ultra lumineux qui co&#251;te 500 &#8364; pendant les soldes de moins est parfait pour les amateurs de cin&#233;ma</title>
      <link>https://www.frandroid.com/bons-plans/2520229_ce-videoprojecteur-xgimi-4k-ultra-lumineux-qui-coute-500-euros-pendant-les-soldes-de-moins-est-parfait-pour-les-amateurs-de-cinema</link>
      <pubDate>Wed, 07 Jan 2026 13:56:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2520229_ce-videoprojecteur-xgimi-4k-ultra-lumineux-qui-coute-500-euros-pendant-les-soldes-de-moins-est-parfait-pour-les-amateurs-de-cinema</guid>
      <description>
Si vous voulez profiter d'un v&#233;ritable home cin&#233;ma, vous pouvez vous tourner vers le Xgimi Horizon S Max. Un vid&#233;oprojecteur 4K ultra lumineux qui voit son prix s'adoucir en passant de 1 999 euros &#224; 1 499 euros gr&#226;ce aux promotions des soldes. 
</description>
    </item>
    <item>
      <title>The base Kindle is on sale for $20 off right now</title>
      <link>https://www.engadget.com/deals/the-base-kindle-is-on-sale-for-20-off-right-now-183302578.html?src=rss</link>
      <pubDate>Wed, 07 Jan 2026 13:55:37 +0000</pubDate>
      <guid isPermaLink="false">e9865d5d-82c0-47b4-858f-2d61df88bf8c</guid>
      <description>The latest entry-level Kindle ereader is on sale for $90 via Amazon. This is a nice discount of $20. It's not a record-low price, but it's certainly a budget-friendly way to keep that New Year's resolution to read more.
This made our list of the best ereaders, and for good reason. It's an iconic device that gets the job done. It doesn't have much by way of modern bells and whistles, but it ships with 16GB of storage and comes in two snazzy colorways. 


The build is compact and durable. It's also light, which makes it easy to pack and easy to hold up with one hand. It allows access to the vast...</description>
    </item>
    <item>
      <title>Le moins cher des Tesla Model Y pourrait bient&#244;t gagner 100 km d&#8217;autonomie gr&#226;ce &#224; une nouvelle batterie myst&#232;re</title>
      <link>https://www.frandroid.com/marques/tesla/2933431_le-moins-cher-des-tesla-model-y-pourrait-bientot-gagner-100-km-dautonomie-grace-a-une-nouvelle-batterie-mystere</link>
      <pubDate>Wed, 07 Jan 2026 13:49:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2933431_le-moins-cher-des-tesla-model-y-pourrait-bientot-gagner-100-km-dautonomie-grace-a-une-nouvelle-batterie-mystere</guid>
      <description>
Quelques mois apr&#232;s la pr&#233;sentation du Model Y "pas cher", &#224; savoir la version Standard &#224; 39 990 euros en Europe, Tesla pourrait d'ores et d&#233;j&#224; lui proposer une plus grosse batterie pour porter son autonomie &#224; plus de 650 km.
</description>
    </item>
    <item>
      <title>Anker's new 45W Nano charger with smart display from CES is already $10 off</title>
      <link>https://www.engadget.com/deals/ankers-new-45w-nano-charger-with-smart-display-from-ces-is-already-10-off-160707191.html?src=rss</link>
      <pubDate>Wed, 07 Jan 2026 13:49:28 +0000</pubDate>
      <guid isPermaLink="false">e5fce599-c299-44cd-983e-1c46fb9819b8</guid>
      <description>Anker introduced a nifty little charger at CES 2026, which is a refresh of the pre-existing Nano Charger. It's already on sale for $30, which is a discount of $10. These are preorders, however, with shipments officially going out on January 20.
The 45W charger includes a smart display that shows real-time data like power flow, temperature and charging status. It also features "fun animations to keep things cheerful." Anker says it can recognize what's being charged and automatically adjust certain metrics to ensure a longer battery lifespan. 


To that end, it works with just about everything....</description>
    </item>
    <item>
      <title>Apr&#232;s les montres, Amazfit s&#8217;attaque &#224; votre assiette et aux lunettes avec deux innovations surprenantes au CES</title>
      <link>https://www.frandroid.com/marques/amazfit/2933461_apres-les-montres-amazfit-sattaque-a-votre-assiette-et-aux-lunettes-avec-deux-innovations-surprenantes-au-ces</link>
      <pubDate>Wed, 07 Jan 2026 13:44:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazfit/2933461_apres-les-montres-amazfit-sattaque-a-votre-assiette-et-aux-lunettes-avec-deux-innovations-surprenantes-au-ces</guid>
      <description>
Lors du CES de Las Vegas, Amazfit a d&#233;voil&#233; sa ligne directrice dans le domaine du sport et de la sant&#233; connect&#233;e, notamment avec une cam&#233;ra pour analyser l'alimentation et des lunettes connect&#233;es Amazfit Helio Glasses. 
</description>
    </item>
    <item>
      <title>&#171;&#160;Ni une d&#233;cision arbitraire, ni un choix politique&#160;&#187; : le patron de l&#8217;Anssi revient sur la certification SNC de l&#8217;alliance Google-Thal&#232;s</title>
      <link>https://www.01net.com/actualites/ni-une-decision-arbitraire-ni-un-choix-politique-le-patron-de-lanssi-revient-sur-la-certification-snc-de-lalliance-google-thales.html</link>
      <pubDate>Wed, 07 Jan 2026 13:43:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318523</guid>
      <description>Vincent Strubel, &#224; la t&#234;te de l'Anssi, a pris son b&#226;ton de p&#232;lerin pour rappeler ce qu'est le label SecNumCloud (SNC), apr&#232;s la certification SNC de l'offre de cloud hybride de Google et de Thal&#232;s. Pour la premi&#232;re fois mi-d&#233;cembre, une offre associant un g&#233;ant am&#233;ricain &#224; une entreprise fran&#231;aise a re&#231;u cette certification qui n'&#233;tait, jusqu'ici, qu'accord&#233;e &#224; des entreprises fran&#231;aises : un toll&#233; pour les d&#233;fenseurs d'une souverainet&#233; num&#233;rique fran&#231;aise et europ&#233;enne....</description>
    </item>
    <item>
      <title>Warner Bros. rejects takeover bid from Paramount, siding with Netflix&#8217;s offer</title>
      <link>https://www.fastcompany.com/91470407/warner-bros-rejects-takeover-bid-paramount-siding-netflixs-offer</link>
      <pubDate>2026-01-07T13:37:33</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91470407/warner-bros-rejects-takeover-bid-paramount-siding-netflixs-offer</guid>
      <description>Shareholders were once again urged to back Netflix&#8217;s offer for $72 billion.
Warner Bros. again rejected Paramount&#8217;s latest takeover bid and told shareholders Wednesday to stick with a rival offer from Netflix.Warner&#8217;s leadership has repeatedly rebuffed Skydance-owned Paramount&#8217;s overtures &#8212; and urged shareholders just weeks ago to back its the sale of its streaming and studio business to Netflix for $72 billion. Paramount, meanwhile, has sweetened its $77.9 billion offer for the entire company and gone straight to shareholders with a hostile bid.Warner Bros. Discovery said Wednesday that its b...</description>
    </item>
    <item>
      <title>Pick up the Apple Watch Series 11 while it's $100 off</title>
      <link>https://www.engadget.com/deals/pick-up-the-apple-watch-series-11-while-its-100-off-154609513.html?src=rss</link>
      <pubDate>Wed, 07 Jan 2026 13:37:08 +0000</pubDate>
      <guid isPermaLink="false">9398dfc3-7cc2-4fa1-ba51-8f9fa52c78af</guid>
      <description>If you're looking to get in shape in the new year, a wearable that tracks your daily activity and workouts can help with that. Our current favorite smartwatch is the Apple Watch Series 11, and it's on sale for $100 off right now. That brings it down to $299, which is the lowest price we've seen it so far since its release last September.


The Series 11 is our best overall smartwatch pick, and we gave it a score of 90 out of 100 in our hands-on review. We were impressed with the battery life, which lasted longer than the 24 hours it's rated for in our testing. We also liked how lightweight and...</description>
    </item>
    <item>
      <title>Lego Smart Play hands-on: Using technology to get kids to play together</title>
      <link>https://www.engadget.com/entertainment/lego-smart-play-hands-on-using-technology-to-get-kids-to-play-together-133000436.html?src=rss</link>
      <pubDate>Wed, 07 Jan 2026 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">27c066b4-5f4b-4b62-9099-8412c652c6c9</guid>
      <description>Lego&#8217;s new Smart Play system, announced at CES earlier this week, is an embrace of digital technology the likes of which we haven&#8217;t seen from the company before. And while the demonstration it gave on Monday was a good start towards showing just what Lego&#8217;s Smart Brick is capable of, there&#8217;s no substitute for seeing it in person. Fortunately, an extended demo answered a lot of my questions on how the system will work once kids and adults get their hands on the first round of sets with Smart Play.As I detailed yesterday, the Smart Play system contains three elements. The Smart Brick is packed w...</description>
    </item>
    <item>
      <title>Maybe We Should Pump the Brakes on the Idea That Robotaxis Are Safer</title>
      <link>https://gizmodo.com/maybe-we-should-pump-the-brakes-on-the-idea-that-robotaxis-are-safer-2000706339</link>
      <pubDate>Wed, 07 Jan 2026 13:27:01 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000706339</guid>
      <description>The evidence is sparse.</description>
    </item>
    <item>
      <title>Why is there a RAM shortage? AI demand and the mad scramble for memory chips could hit where it hurts</title>
      <link>https://www.fastcompany.com/91470364/why-is-there-a-ram-shortage-in-2026-ai-cause-memory-chip-scramble</link>
      <pubDate>2026-01-07T13:27:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91470364/why-is-there-a-ram-shortage-in-2026-ai-cause-memory-chip-scramble</guid>
      <description>There&#8217;s only so much RAM to go around, and with data centers seen as the priority, smartphone and laptop makers may have to raise prices to compete.
The stock prices of RAM and NAND manufacturers surged yesterday, with Micron Technology (Nasdaq: MU) up 10%, Sandisk Corporation (Nasdaq: SNDK) up 27%, Western Digital Corporation (Nasdaq: WDC) up 16%, and Seagate Technology Holdings (Nasdaq: STX) up 14%....</description>
    </item>
    <item>
      <title>Black Ops 7 Season One Reloaded brings some beautiful new maps to the game &#8212; here are its official release times</title>
      <link>https://www.techradar.com/gaming/black-ops-7-season-one-reloaded-brings-some-beautiful-new-maps-to-the-game-here-are-its-official-release-times</link>
      <pubDate>Wed, 07 Jan 2026 13:22:36 +0000</pubDate>
      <guid isPermaLink="false">6DYxagUod4TPRLruCLmWyk</guid>
      <description>Call of Duty: Black Ops 7 Season One Reloaded is almost here, so here are the official release times and some of its biggest inclusions.</description>
    </item>
    <item>
      <title>Honor ne savait pas qui copier entre Apple et Google, alors ils ont fait les deux et c&#8217;est pas mal</title>
      <link>https://www.frandroid.com/marques/honor/2933419_honor-ne-savait-pas-qui-copier-entre-apple-et-google-alors-ils-ont-fait-les-deux-et-cest-pas-mal</link>
      <pubDate>Wed, 07 Jan 2026 13:19:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/honor/2933419_honor-ne-savait-pas-qui-copier-entre-apple-et-google-alors-ils-ont-fait-les-deux-et-cest-pas-mal</guid>
      <description>
C'est un m&#233;lange bizarre entre un Google Pixel et un iPhone Air. Mais ne vous arr&#234;tez pas au design. Le Honor Magic 8 Air affiche une fiche technique int&#233;ressante pour un format "Slim". Avec ses 158 grammes et sa puce haut de gamme, Honor semble avoir trouv&#233; la formule magique que Apple cherche encore.
</description>
    </item>
    <item>
      <title>Votre MacBook devient enfin tactile : cet accessoire g&#233;nial devance Apple de quasiment un an</title>
      <link>https://www.frandroid.com/marques/apple/2932901_transformer-son-mac-en-ipad-geant-cest-possible-avec-cet-accessoire</link>
      <pubDate>Wed, 07 Jan 2026 13:17:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2932901_transformer-son-mac-en-ipad-geant-cest-possible-avec-cet-accessoire</guid>
      <description>
Transformer son MacBook en &#233;cran tactile, c'est bient&#244;t possible avec l'accessoire Magic Screen. Bient&#244;t lanc&#233; sur Kickstarter, le produit d&#233;bloque de nouvelles utilisations dignes d'un iPad sur l'&#233;cran de votre MacBook.
</description>
    </item>
    <item>
      <title>Les plus grosses nouveaut&#233;s &#233;lectriques du CES 2026 sont &#224; d&#233;couvrir dans notre &#233;mission Survolt&#233;s du jour : il va y en avoir pour tout le monde</title>
      <link>https://www.frandroid.com/survoltes/2932709_les-plus-grosses-nouveautes-electriques-du-ces-2026-sont-a-decouvrir-dans-notre-emission-survoltes-du-jour-il-va-y-en-avoir-pour-tout-le-monde</link>
      <pubDate>Wed, 07 Jan 2026 13:17:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2932709_les-plus-grosses-nouveautes-electriques-du-ces-2026-sont-a-decouvrir-dans-notre-emission-survoltes-du-jour-il-va-y-en-avoir-pour-tout-le-monde</guid>
      <description>
L&#8217;&#233;quipe Survolt&#233;s (Frandroid) et Vroom (Numerama) vous donnent rendez-vous ce mercredi 7 janvier, d&#232;s 18h, pour une &#233;mission sp&#233;ciale CES 2026. Au menu du jour : des nouveaut&#233;s &#233;lectriques tr&#232;s excitantes et un duplex en direct de Las Vegas.
</description>
    </item>
    <item>
      <title>The best tech announced at CES 2026 so far</title>
      <link>https://www.theverge.com/tech/854159/ces-2026-best-tech-gadgets-smartphones-appliances-robots-tvs-ai-smart-home</link>
      <pubDate>2026-01-07T08:13:25-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=854159</guid>
      <description>The CES show floor officially opened its doors yesterday and along with it came a deluge of more announcements and reveals. If you're struggling to stay on top of all the new tech, gadgets, concepts, and AI-powered devices as day two gets underway, we've rounded up some of the best hardware and upgrades that have [&#8230;]</description>
    </item>
    <item>
      <title>Oubliez le Wi-Fi 7&#160;: le Wi-Fi 8 s&#8217;invite par surprise au CES 2026</title>
      <link>https://www.01net.com/actualites/oubliez-le-wi-fi-7-le-wi-fi-8-sinvite-par-surprise-au-ces-2026.html</link>
      <pubDate>Wed, 07 Jan 2026 13:12:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318568</guid>
      <description>Le CES 2026 cr&#233;e la surprise : alors que le Wi-Fi 7 s'installe &#224; peine, le Wi-Fi 8 d&#233;barque d&#233;j&#224;. Asus et MediaTek d&#233;voilent les premiers routeurs, mais vous encore le temps avant de vous &#233;quiper.</description>
    </item>
    <item>
      <title>Discord confidentially files for IPO in the U.S., sources say</title>
      <link>https://www.fastcompany.com/91470370/discord-confidentially-files-ipo-u-s-sources-say</link>
      <pubDate>2026-01-07T13:05:36</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91470370/discord-confidentially-files-ipo-u-s-sources-say</guid>
      <description>Deliberations are ongoing, Bloomberg News reports.
Chat platform Discord filed confidentially for an initial public offering in the United States, Bloomberg News reported on Tuesday, citing people familiar with the matter.</description>
    </item>
    <item>
      <title>La fin du double &#233;cran ? Ce PC portable Lenovo cache une fonctionnalit&#233; g&#233;niale</title>
      <link>https://www.frandroid.com/marques/lenovo/2932653_on-a-vu-lecran-de-ce-pc-portable-sagrandir-tout-seul-voici-le-nouveau-concept-bluffant-de-lenovo</link>
      <pubDate>Wed, 07 Jan 2026 13:04:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lenovo/2932653_on-a-vu-lecran-de-ce-pc-portable-sagrandir-tout-seul-voici-le-nouveau-concept-bluffant-de-lenovo</guid>
      <description>
Lors du CES 2026 de Las Vegas, Lenovo a d&#233;voil&#233; le Legion Pro Rollable Concept, un PC portable dont l'&#233;cran peut s'&#233;tirer physiquement pour atteindre une diagonale de 24 pouces. 
</description>
    </item>
    <item>
      <title>Your Ring doorbell and cameras are getting a huge upgrade with AI-powered warnings when something looks unusual</title>
      <link>https://www.techradar.com/tech-events/your-ring-doorbell-and-cameras-are-getting-a-huge-upgrade-with-ai-powered-warnings-when-something-looks-unusual</link>
      <pubDate>Wed, 07 Jan 2026 13:02:45 +0000</pubDate>
      <guid isPermaLink="false">4FHSrBACkwjAXELeiB8AjE</guid>
      <description>Ring launches new AI alerts, plus a collection of sensors to detect break-ins, floods, carbon monoxide, and much more.</description>
    </item>
    <item>
      <title>Je n&#8217;ai aucun style, mais je porte des lunettes de natation connect&#233;es</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/lunettes-intelligentes/2932401_je-nai-aucun-style-mais-je-porte-des-lunettes-de-natation-connectees</link>
      <pubDate>Wed, 07 Jan 2026 13:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/lunettes-intelligentes/2932401_je-nai-aucun-style-mais-je-porte-des-lunettes-de-natation-connectees</guid>
      <description>
J'ignorais totalement qu'il existait des lunettes de piscine connect&#233;es, puis j'ai d&#233;couvert les Holoswim 2 Pro.
</description>
    </item>
    <item>
      <title>What is the release date for Spartacus: House of Ashur episode 7 on Starz?</title>
      <link>https://www.techradar.com/streaming/entertainment/spartacus-house-of-ashur-episode-7-release-date-time-starz</link>
      <pubDate>Wed, 07 Jan 2026 13:01:53 +0000</pubDate>
      <guid isPermaLink="false">jBLDmhRkoqNrTDemMrkXLY</guid>
      <description>With Opiter's shock death at the end of episode 6, all hell is about to break loose. But when does Spartacus: House of Ashur episode 7 drop on Starz?</description>
    </item>
    <item>
      <title>Mia Goth Declares &#8216;The Odyssey&#8217; Better Than &#8216;Star Wars,&#8217; Sorta</title>
      <link>https://gizmodo.com/mia-goth-the-odyssey-star-wars-2000706501</link>
      <pubDate>Wed, 07 Jan 2026 13:00:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000706501</guid>
      <description>The 'Pearl' and 'Frankenstein' star has slightly different levels of compliments for both upcoming films.</description>
    </item>
    <item>
      <title>Don&#8217;t like Spotify Messages? These two big upgrades could soon change your mind</title>
      <link>https://www.techradar.com/audio/spotify/dont-like-spotify-messages-these-two-big-upgrades-could-soon-change-your-mind</link>
      <pubDate>Wed, 07 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">HTjpGHdhxd9mWmQUw9viiU</guid>
      <description>You can now see your friends' listening activity in real time, and send Jam requests with Spotify Messages.</description>
    </item>
    <item>
      <title>Klipsch Atlas HP-1 hands-on: A return to hi-fi headphones at CES 2026</title>
      <link>https://www.engadget.com/audio/headphones/klipsch-atlas-hp-1-hands-on-a-return-to-hi-fi-headphones-at-ces-2026-130000415.html?src=rss</link>
      <pubDate>Wed, 07 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">b12f6ceb-4be5-4f5f-9b8c-8f655579a77d</guid>
      <description>Klipsch hasn&#8217;t debuted new headphones in years, but that&#8217;s going to change in 2026. At CES, Klipsch announced the upcoming Atlas hi-fi series that includes wireless and both closed and semi-open back models. All three are expected to arrive this summer, but the company hasn&#8217;t announced pricing or many details on any of them just yet. However, I was able to listen to the Atlas HP-1, the wireless model with active noise cancelation (ANC). Without going into specifics, Klipsch says the HP-1 is designed for both daily wear and travel. This is thanks to the combination of light weight, comfort and ...</description>
    </item>
    <item>
      <title>Vie num&#233;rique | Comment prot&#233;ger son t&#233;l&#233;phone des douaniers am&#233;ricains</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-01-07/vie-numerique/comment-proteger-son-telephone-des-douaniers-americains.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 07 Jan 2026 08:00:00 -0500</pubDate>
      <guid isPermaLink="false">557c9af7eb7d3008b2294d146c131f27</guid>
      <description>En mars dernier, lorsque la douane am&#233;ricaine a refoul&#233; un scientifique fran&#231;ais apr&#232;s avoir fouill&#233; son t&#233;l&#233;phone, les autorit&#233;s fran&#231;aises ont cri&#233; au scandale&#160;: des commentaires critiquant les politiques de Donald Trump, lus dans son t&#233;l&#233;phone, avaient motiv&#233; cette d&#233;cision, a d&#233;nonc&#233; Paris. Des responsables am&#233;ricains ont ni&#233; cette interpr&#233;tation, mais depuis, bien des voyageurs se demandent si ces fouilles sont l&#233;gales....</description>
    </item>
    <item>
      <title>Roblox, Call of Duty, and Fortnite head up last year's most played games &#8212; and yes, that's the same as 2024</title>
      <link>https://www.techradar.com/gaming/gaming-industry/roblox-call-of-duty-and-fortnite-head-up-last-years-most-played-games-and-yes-thats-the-same-as-2024</link>
      <pubDate>Wed, 07 Jan 2026 12:55:56 +0000</pubDate>
      <guid isPermaLink="false">9jEMoZaLSKXbS2NSqrkGym</guid>
      <description>The top five most-played games of 2025 absolutely will not shock you, with usual suspects GTA, Fortnite, and Roblox heading up the list.</description>
    </item>
    <item>
      <title>The Magic: The Gathering Tarkir Dragonstorm Booster Box is below market value at Amazon</title>
      <link>https://mashable.com/article/jan-7-magic-the-gathering-tarkir-dragonstorm-play-booster-deal</link>
      <pubDate>Wed, 07 Jan 2026 12:55:18 +0000</pubDate>
      <guid isPermaLink="false">02w4vZpHZUhkMf38mhuJJIq</guid>
      <description>The Magic: The Gathering Tarkir Dragonstorm Play Booster Box is on sale for $98.68 at Amazon. That's below market value.</description>
    </item>
    <item>
      <title>Lenovo IdeaPad Pro 5 : taill&#233; pour les cr&#233;atifs, cet ultrabook avec RTX 4050 est 1 000 &#8364; moins cher pendant les soldes d&#8217;hiver (et une carte cadeau est offerte)</title>
      <link>https://www.frandroid.com/bons-plans/2932983_lenovo-ideapad-pro-5-taille-pour-les-creatifs-cet-ultrabook-avec-rtx-4050-est-1-000-e-moins-cher-pendant-les-soldes-dhiver-et-une-carte-cadeau-est-offerte</link>
      <pubDate>Wed, 07 Jan 2026 12:54:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2932983_lenovo-ideapad-pro-5-taille-pour-les-creatifs-cet-ultrabook-avec-rtx-4050-est-1-000-e-moins-cher-pendant-les-soldes-dhiver-et-une-carte-cadeau-est-offerte</guid>
      <description>
Avec son &#233;cran OLED bien fluide et sa carte graphique RTX 4050, le Lenovo IdeaPad Pro 5 est un ultraportable qui peut tout &#224; fait accompagner les cr&#233;ateurs de contenu et les joueurs occasionnels. Pendant les soldes, Darty fait en plus chuter son prix, qui passe de 1 799,99 euros &#224; 779,99 euros.
</description>
    </item>
    <item>
      <title>YouTube Music users are furious about AI slop songs &#8211;and as a recording musician, I'm angry too</title>
      <link>https://www.techradar.com/audio/audio-streaming/youtube-music-users-are-furious-about-ai-slop-songs-and-as-a-recording-musician-im-angry-too</link>
      <pubDate>Wed, 07 Jan 2026 12:46:54 +0000</pubDate>
      <guid isPermaLink="false">zya7d3QF2A4WGefAhPkFb9</guid>
      <description>AI slop isn't made to be listened to: it's there to trick you &#8211; and as a recording musician, I'm angry it's dominating YouTube Music recommendations</description>
    </item>
    <item>
      <title>The weirdest tech we&amp;#8217;ve seen at CES 2026</title>
      <link>https://www.theverge.com/tech/855460/ces-2026-weirdest-announcements</link>
      <pubDate>2026-01-07T07:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=855460</guid>
      <description>There's never a shortage of exciting and innovative tech at CES. A superthin TV and tri-folding phone are cool and all, but sometimes the weirdest gadgets are the ones that make us go "huh." Luckily, there was plenty of wacky stuff on the show floor this year, and we've rounded up some of the most [&#8230;]</description>
    </item>
  </channel>
</rss>
