<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 20 Feb 2026 15:40:59 GMT</lastBuildDate>
    <item>
      <title>Le plan ing&#233;nieux d&#8217;Octopus Energy pour baisser votre facture gr&#226;ce &#224; un d&#233;tail de votre compteur LinkyOctopus ballons</title>
      <link>https://www.frandroid.com/survoltes/energie/2984979_le-plan-ingenieux-doctopus-energy-pour-baisser-votre-facture-grace-a-un-detail-de-votre-compteur-linkyoctopus-ballons</link>
      <pubDate>Fri, 20 Feb 2026 15:39:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/2984979_le-plan-ingenieux-doctopus-energy-pour-baisser-votre-facture-grace-a-un-detail-de-votre-compteur-linkyoctopus-ballons</guid>
      <description>
Le fournisseur Octopus Energy d&#233;voile une offre d'&#233;lectricit&#233; in&#233;dite en France. Elle utilise le Linky pour allumer ou &#233;teindre le ballon d'eau chaude de mani&#232;re dynamique, pour r&#233;duire la facture d'&#233;lectricit&#233;.
</description>
    </item>
    <item>
      <title>Bon plan PS5 : le lecteur de disques pour Slim et Pro revient en promotion</title>
      <link>https://www.frandroid.com/bons-plans/2984853_bon-plan-ps5-le-lecteur-de-disques-pour-slim-et-pro-revient-en-promotion</link>
      <pubDate>Fri, 20 Feb 2026 15:34:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2984853_bon-plan-ps5-le-lecteur-de-disques-pour-slim-et-pro-revient-en-promotion</guid>
      <description>
Gr&#226;ce &#224; JoyBuy qui offre une l&#233;g&#232;re promotion de 3,3 % sur le lecteur de disques de la PS5, il est possible de faire &#233;voluer votre PlayStation 5 ou votre PlayStation 5 Pro &#224; prix r&#233;duit. 
</description>
    </item>
    <item>
      <title>AI&#8217;s promise to indie filmmakers: faster, cheaper, lonelier</title>
      <link>https://techcrunch.com/2026/02/20/ais-promise-to-indie-filmmakers-faster-cheaper-lonelier/</link>
      <pubDate>Fri, 20 Feb 2026 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3094387</guid>
      <description>AI expands access to filmmaking for resource-constrained creators. But as efficiency becomes the industry&#8217;s north star, creativity risks being overwhelmed by a deluge of low-effort, AI-generated content.</description>
    </item>
    <item>
      <title>Prepare for pitch battle: Startup Battlefield 200 nominations are open</title>
      <link>https://techcrunch.com/2026/02/20/prepare-for-pitch-battle-startup-battlefield-200-nominations-are-open/</link>
      <pubDate>Fri, 20 Feb 2026 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3094874</guid>
      <description>Nominations for TechCrunch Startup Battlefield 200 are open. Pitch at&#160;Disrupt 2026&#160;in October in front of top VCs and the full TechCrunch audience. Nominate your startup or for one that's deserving.</description>
    </item>
    <item>
      <title>Samsung&#8217;s Galaxy Z TriFold restock sold out in minutes</title>
      <link>https://www.theverge.com/gadgets/881946/samsung-galaxy-z-trifold-restock-buy</link>
      <pubDate>2026-02-20T10:24:16-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=881946</guid>
      <description>Samsung unleashed a new batch of Galaxy Z TriFold units after selling out initial stock of the behemoth foldable that turns into a 10-inch tablet. It took less than ten minutes to sell through today's supply, which either speaks to the phone's surprising popularity or, rather, just how few of them the company is making. [&#8230;]</description>
    </item>
    <item>
      <title>Tamron&#8217;s new dongle lets you wirelessly control your lens from your phone</title>
      <link>https://www.theverge.com/tech/881943/tamron-link-usb-dongle-bluetooth-adapter-camera-lens-remote</link>
      <pubDate>2026-02-20T10:19:11-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=881943</guid>
      <description>Tamron has announced a new USB-C dongle that wirelessly connects compatible lenses to mobile devices and laptops so they can be customized and controlled remotely. It works with 16 of the company's lenses to start. The $50 Tamron-Link dongle is available now, and while its Bluetooth range is limited to just over 16-feet, it's one [&#8230;]</description>
    </item>
    <item>
      <title>FBI warns ATM "jackpotting" attacks are soaring - here's what you need to know</title>
      <link>https://www.techradar.com/pro/security/fbi-warns-atm-jackpotting-attacks-are-soaring-heres-what-you-need-to-know</link>
      <pubDate>Fri, 20 Feb 2026 15:15:00 +0000</pubDate>
      <guid isPermaLink="false">keHC7Ei93BdC4o7ZH5XdiC</guid>
      <description>Physically breaking into an ATM is getting more popular and the FBI is sounding the alarm.</description>
    </item>
    <item>
      <title>Couleurs, prix, design&#160;: on fait le point sur le futur MacBook pas cher</title>
      <link>https://www.01net.com/actualites/couleurs-prix-design-on-fait-le-point-sur-le-futur-macbook-pas-cher.html</link>
      <pubDate>Fri, 20 Feb 2026 15:14:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327227</guid>
      <description>Le 4 mars, Apple organise un &#233;v&#233;nement sp&#233;cial qui devrait &#234;tre consacr&#233; &#224; des produits un peu meilleur march&#233; que d'habitude chez le constructeur : il devrait en effet &#234;tre question de l'iPhone 17e et surtout, de ce fameux MacBook d'entr&#233;e de gamme. En attendant la grande r&#233;v&#233;lation, quelques rumeurs permettent d'imaginer &#224; quoi ressemblera le portable....</description>
    </item>
    <item>
      <title>Test du Samsung Galaxy Book 6 Ultra : la vision est accomplie</title>
      <link>https://www.frandroid.com/marques/samsung/2966121_test-du-samsung-galaxy-book-6-ultra-la-vision-est-accomplie</link>
      <pubDate>Fri, 20 Feb 2026 15:14:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2966121_test-du-samsung-galaxy-book-6-ultra-la-vision-est-accomplie</guid>
      <description>
Pour cette ann&#233;e 2026, Samsung sort du chapeau son Galaxy Book 6 version Ultra. Panther Lake a-t-il enfin de quoi r&#233;aliser la vision du constructeur ? R&#233;ponse dans notre test.
</description>
    </item>
    <item>
      <title>Ubisoft lays off 40 staff working on Splinter Cell remake, says game remains in development</title>
      <link>https://www.engadget.com/gaming/ubisoft-lays-off-40-staff-working-on-splinter-cell-remake-says-game-remains-in-development-151139753.html?src=rss</link>
      <pubDate>Fri, 20 Feb 2026 15:11:40 +0000</pubDate>
      <guid isPermaLink="false">b56100ee-784d-4751-a2d7-fdf1243b78e6</guid>
      <description>It has already been a depressingly busy year for layoffs at Ubisoft, and the French publisher&#8217;s Toronto studio is the latest workforce to be hit. Around 40 jobs have been cut at the studio, which is one of Ubisoft&#8217;s largest and has previously worked on games including Watch Dogs: Legion and Far Cry 6.
"This decision was not taken lightly and does not in any way reflect the talent, dedication, or contributions of the individuals affected," Ubisoft said in a statement to Mobile Syrup, which first reported the new layoffs. "Our priority now is to support them through this transition with comprehe...</description>
    </item>
    <item>
      <title>Peak XV raises $1.3B, doubles down on AI as global VC rivalry in India heats up</title>
      <link>https://techcrunch.com/2026/02/20/peak-xv-raises-1-3b-doubles-down-on-ai-as-global-vc-rivalry-in-india-heats-up/</link>
      <pubDate>Fri, 20 Feb 2026 15:10:40 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3094931</guid>
      <description>Peak XV says most of its new capital will target India as the firm prioritizes AI, fintech and cross-border bets while navigating recent partner departures.</description>
    </item>
    <item>
      <title>Microsoft France supprime une centaine de postes &#224; Issy-les-Moulineaux</title>
      <link>https://www.01net.com/actualites/microsoft-france-supprime-centaine-postes-issy-les-moulineaux.html</link>
      <pubDate>Fri, 20 Feb 2026 15:07:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327208</guid>
      <description>Microsoft a annonc&#233; son intention de fermer son centre d'ing&#233;nierie d'Issy-les-Moulineaux, mena&#231;ant une centaine de postes. Le g&#233;ant am&#233;ricain souhaite centraliser ses forces dans des hubs internationaux, au d&#233;triment de son antenne fran&#231;aise.</description>
    </item>
    <item>
      <title>Transf&#233;rer directement une eSIM d&#8217;iPhone vers un smartphone Android est possible, mais seulement chez cet op&#233;rateur</title>
      <link>https://www.frandroid.com/marques/apple/2984831_transferer-directement-une-esim-diphone-vers-un-smartphone-android-est-possible-mais-seulement-chez-cet-operateur</link>
      <pubDate>Fri, 20 Feb 2026 15:06:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2984831_transferer-directement-une-esim-diphone-vers-un-smartphone-android-est-possible-mais-seulement-chez-cet-operateur</guid>
      <description>
iOS 26.3 ajoute entre autres la possibilit&#233; de transf&#233;rer une eSIM d'un iPhone vers un mobile Android. Mais la liste des op&#233;rateurs qui jouent le jeu en France est bien maigre pour le moment.
</description>
    </item>
    <item>
      <title>Watch the First &#8216;Witch Hat Atelier&#8217; Trailer and Get Ready for Your New Anime Obsession</title>
      <link>https://gizmodo.com/witch-hat-atelier-anime-trailer-release-date-crunchyroll-2000724450</link>
      <pubDate>Fri, 20 Feb 2026 15:00:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000724450</guid>
      <description>We finally have a great first look at how Kamome Shirahama's fantastic magical manga is being brought to animated life.</description>
    </item>
    <item>
      <title>Fender Mix Headphones Review: So Much More Than a Branding Gimmick</title>
      <link>https://gizmodo.com/fender-mix-headphones-review-so-much-more-than-a-branding-gimmick-2000723612</link>
      <pubDate>Fri, 20 Feb 2026 15:00:02 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000723612</guid>
      <description>It surprised me, but Fender's first pair of wireless headphones has some solid features that are actually worth paying for.</description>
    </item>
    <item>
      <title>I review laptops for The Verge, ask me anything</title>
      <link>https://www.theverge.com/column/881567/i-review-laptops-for-the-verge-ask-me-anything</link>
      <pubDate>2026-02-20T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=881567</guid>
      <description>What up, Verge-heads! Wait. "Vergesters?" "Verge-igans?" Nope, that ain't it&#8230; GREETINGS, DEAREST VERGE SUBSCRIBERS! Antonio here. &#240;&#376;&#8216;&#8249;&#240;&#376;&#143;&#187; I'm your friendly neighborhood laptop reviewer, and I'm hosting an exclusive subscriber "AMA" today at 11AM PT / 2PM ET. I review laptops ranging from MacBooks and Chromebooks to weird-but-awesome tablets and a $6,000 gaming laptop. So I [&#8230;]...</description>
    </item>
    <item>
      <title>The wellness wild west&#8217;s latest skincare fad is salmon sperm</title>
      <link>https://www.theverge.com/column/881906/optimizer-wellness-wild-west-pdrn-salmon-sperm-skincare-rejuran</link>
      <pubDate>2026-02-20T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=881906</guid>
      <description>This is Optimizer, a weekly newsletter sent every Friday from Verge senior reviewer Victoria Song that dissects and discusses the latest gizmos and potions that swear they're going to change your life. Opt in for Optimizer here. While scrolling through my TikTok feed, I often find myself thinking of Elizabeth B&#225;thory. Legend has it that [&#8230;]</description>
    </item>
    <item>
      <title>TechCrunch Disrupt&#160;2026 Super Early Bird rates end in&#160;1&#160;week</title>
      <link>https://techcrunch.com/2026/02/20/techcrunch-disrupt-2026-super-early-bird-rates-end-in-1-week/</link>
      <pubDate>Fri, 20 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3094846</guid>
      <description>The lowest ticket rates of the year for TechCrunch Disrupt 2026 ends next Friday, February 27. Save up to $680 on your pass. Register now before prices increase.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Saturday, February 21 (game #986)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-21-february-2026</link>
      <pubDate>Fri, 20 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">YbdPSj7NMpA5meyykBFCBo</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Saturday, February 21 (game #720)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-21-february-2026</link>
      <pubDate>Fri, 20 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">A8LowS9eMQpcwsk4EEcoHX</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Saturday, February 21 (game #1489)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-21-february-2026</link>
      <pubDate>Fri, 20 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">g8x9rypay2BGWF5rbnTyRB</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>7 new movies and TV shows to watch on Netflix, Prime Video, HBO Max and more this weekend (February 20)</title>
      <link>https://www.techradar.com/streaming/7-new-movies-and-tv-shows-to-watch-on-netflix-prime-video-hbo-max-and-more-this-weekend-february-20</link>
      <pubDate>Fri, 20 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">RXZRdJmsrZUVdGcnQg6fNa</guid>
      <description>From The Night Agent's return to Brendan Fraser's latest movie, here's what's worth watching at home this weekend.</description>
    </item>
    <item>
      <title>ExpressVPN unveils 'industry-first hybrid' VPN browser extension &#8212; and takes on the Metaverse with new Meta Quest app</title>
      <link>https://www.techradar.com/vpn/vpn-services/expressvpn-unveils-industry-first-hybrid-vpn-browser-extension-and-takes-on-the-metaverse-with-new-meta-quest-app</link>
      <pubDate>Fri, 20 Feb 2026 14:53:52 +0000</pubDate>
      <guid isPermaLink="false">mckqtVnnDDCM5H4ub3WMXe</guid>
      <description>ExpressVPN just dropped a massive update for VR fans and browser power-users. Here&#8217;s what the new 'hybrid' VPN extension actually does.</description>
    </item>
    <item>
      <title>Friend or foe? AI: The new cybersecurity threat and solutions</title>
      <link>https://www.techradar.com/pro/friend-or-foe-ai-the-new-cybersecurity-threat-and-solutions</link>
      <pubDate>Fri, 20 Feb 2026 14:46:50 +0000</pubDate>
      <guid isPermaLink="false">pzkmBc6YzSbNqceSwbmZsP</guid>
      <description>Understanding the risks now emerging at every layer of the AI stack.</description>
    </item>
    <item>
      <title>Les Pixel de Google peuvent enregistrer vos appels, voici comment faire</title>
      <link>https://www.frandroid.com/marques/google/2984669_les-pixel-de-google-peuvent-enregistrer-vos-appels-voici-comment-faire</link>
      <pubDate>Fri, 20 Feb 2026 14:42:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2984669_les-pixel-de-google-peuvent-enregistrer-vos-appels-voici-comment-faire</guid>
      <description>
D'abord restreinte &#224; certaines r&#233;gions du monde, la fonction d'enregistrement des appels t&#233;l&#233;phoniques directement sur un Google Pixel arrive en France.
</description>
    </item>
    <item>
      <title>How to watch Super Rugby Pacific live streams online for free</title>
      <link>https://mashable.com/article/super-rugby-pacific-live-stream-for-free</link>
      <pubDate>Fri, 20 Feb 2026 14:32:44 +0000</pubDate>
      <guid isPermaLink="false">068dzWrs8TyxN1jqTTlVfFN</guid>
      <description>How to watch Super Rugby Pacific for free. Live stream the 2026 Super Rugby Pacific for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Trump bars two &#8216;not worthy&#8217; governors from annual bipartisan meeting at White House, prompting backlash</title>
      <link>https://www.fastcompany.com/91495956/trump-bars-two-not-worthy-governors-annual-bipartisan-meeting-white-house-prompting-backlash</link>
      <pubDate>2026-02-20T14:32:24</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91495956/trump-bars-two-not-worthy-governors-annual-bipartisan-meeting-white-house-prompting-backlash</guid>
      <description>Trump refused to invite Democratic governors Jared Polis of Colorado and Wes Moore of Maryland.
The National Governors Association is pulling out of an annual meeting at the White House after President Donald Trump declined to invite two Democratic governors, undercutting one of Washington&#8217;s few remaining bipartisan gatherings.Trump is still expected to meet with governors at the White House on Friday but the event will not be facilitated by an organization founded more than a century ago to help state leaders from both parties advocate for their interests in Washington. The Republican preside...</description>
    </item>
    <item>
      <title>&#171;&#160;Une superintelligence ferait mieux que moi&#160;&#187; : le constat choc de Sam Altman sur nos emplois</title>
      <link>https://www.01net.com/actualites/une-superintelligence-ferait-mieux-que-moi-le-constat-choc-de-sam-altman-sur-nos-emplois.html</link>
      <pubDate>Fri, 20 Feb 2026 14:32:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327153</guid>
      <description>En Inde, le patron d'OpenAI, Sam Altman, pr&#233;dit une superintelligence capable de surpasser les humains d'ici 2028. M&#234;me les PDG vont trinquer.</description>
    </item>
    <item>
      <title>YouTube d&#233;ploie Gemini sur TV : ce nouveau bouton permet d&#8217;interroger les vid&#233;os</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2984847_youtube-deploie-gemini-sur-tv-ce-nouveau-bouton-permet-dinterroger-les-videos</link>
      <pubDate>Fri, 20 Feb 2026 14:30:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2984847_youtube-deploie-gemini-sur-tv-ce-nouveau-bouton-permet-dinterroger-les-videos</guid>
      <description>
Fini le temps o&#249; vous regardiez passivement une recette de cuisine en essayant de deviner les proportions. Google d&#233;ploie actuellement son bouton &#171; Demander &#187; (Ask), propuls&#233; par l'intelligence artificielle Gemini, directement sur l'application YouTube de votre t&#233;l&#233;viseur. Une nouveaut&#233; qui promet de changer notre fa&#231;on de consommer la vid&#233;o depuis le canap&#233;.
...</description>
    </item>
    <item>
      <title>Why investors are going gaga over solid-state transformers</title>
      <link>https://techcrunch.com/2026/02/20/why-investors-are-going-gaga-over-solid-state-transformers/</link>
      <pubDate>Fri, 20 Feb 2026 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3094571</guid>
      <description>The technology promises to replace several parts of the grid with one device that&#8217;s both controllable and updatable.</description>
    </item>
    <item>
      <title>Nintendo&#8217;s next big Pok&#233;mon presentation is on February 27th</title>
      <link>https://www.theverge.com/games/881332/nintendo-pokemon-presents-pokemon-day</link>
      <pubDate>2026-02-20T09:25:52-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=881332</guid>
      <description>Pok&#233;mon Day is always a big deal for Nintendo fans, but with this year being the franchise's 30th anniversary, the next Pok&#233;mon Presents stream is likely to bring the heat when it begins on February 27th at 9AM ET. With Pok&#233;mon Legends: Z-A behind us and Pok&#233;mon Pokopia right around the corner, chances are high [&#8230;]</description>
    </item>
    <item>
      <title>Google rejected nearly two million Android apps and blocked more than 80,000 developer accounts from Google Play in 2025</title>
      <link>https://www.techradar.com/pro/security/google-rejected-nearly-two-million-android-apps-and-blocked-more-than-80-000-developer-accounts-from-google-play-in-2025</link>
      <pubDate>Fri, 20 Feb 2026 14:20:00 +0000</pubDate>
      <guid isPermaLink="false">StxmtA87wE3zK5878RHrVS</guid>
      <description>The numbers of removed apps and accounts are less than previous years, but still worryingly high.</description>
    </item>
    <item>
      <title>Avec 40 % de remise sur le The Frame 2025, c&#8217;est la chute de prix qu&#8217;on attendait pour le plus beau t&#233;l&#233;viseur de Samsung</title>
      <link>https://www.frandroid.com/bons-plans/2869427_avec-40-de-remise-sur-le-the-frame-2025-cest-la-chute-de-prix-quon-attendait-pour-le-plus-beau-televiseur-de-samsung</link>
      <pubDate>Fri, 20 Feb 2026 14:18:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2869427_avec-40-de-remise-sur-le-the-frame-2025-cest-la-chute-de-prix-quon-attendait-pour-le-plus-beau-televiseur-de-samsung</guid>
      <description>
Le TV Samsung The Frame est l&#8217;un des plus originaux avec son design atypique en forme de tableau.&#160;Celui de 2025 met le paquet avec un taux de rafra&#238;chissement &#224; 144 Hz et si vous attendiez un prix accessible, c'est le moment : la version 55 pouces passe de 1 490 euros &#224; 879 euros. 
</description>
    </item>
    <item>
      <title>How to watch England vs. Ireland online for free</title>
      <link>https://mashable.com/article/england-ireland-six-nations-2026-live-stream-for-free</link>
      <pubDate>Fri, 20 Feb 2026 14:15:00 +0000</pubDate>
      <guid isPermaLink="false">07GPo1cimrEL4fv4aqGzAtl</guid>
      <description>Watch the Six Nations for free. Live stream England vs. Ireland in the 2026 Six Nations for free from anywhere in the world.</description>
    </item>
    <item>
      <title>New Research Suggests You Actually Want QR Code Menus Replaced by&#8230; Augmented Reality?</title>
      <link>https://gizmodo.com/new-research-suggests-you-actually-want-qr-code-menus-replaced-by-augmented-reality-2000724318</link>
      <pubDate>Fri, 20 Feb 2026 14:10:07 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000724318</guid>
      <description>Could a 3D burger spinning on your phone screen save the restaurant industry?</description>
    </item>
    <item>
      <title>Google Pixel 11 : la nouvelle puce de s&#233;curit&#233; Titan M3 ferait son apparition</title>
      <link>https://www.frandroid.com/marques/google/2984757_le-pixel-11-devrait-serieusement-muscler-son-jeu-sur-la-securite</link>
      <pubDate>Fri, 20 Feb 2026 14:06:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2984757_le-pixel-11-devrait-serieusement-muscler-son-jeu-sur-la-securite</guid>
      <description>
Alors que le Pixel 10 est sorti depuis peu, c'est d&#233;j&#224; son successeur qui fait parler de lui. Selon de nouvelles fuites, le Google Pixel 11, propuls&#233; par la future puce Tensor G6, s&#8217;appr&#234;terait &#224; int&#233;grer une nouvelle version de sa puce de s&#233;curit&#233; Titan introduite en 2021.
</description>
    </item>
    <item>
      <title>Dangerous Massiv Android malware poses as IPTV app to infect devices and steal banking info</title>
      <link>https://www.techradar.com/pro/security/dangerous-massiv-android-malware-poses-as-iptv-app-to-infect-devices-and-steal-banking-info</link>
      <pubDate>Fri, 20 Feb 2026 14:04:13 +0000</pubDate>
      <guid isPermaLink="false">dh7YFed7AjawGUd2RqzUh3</guid>
      <description>Fake IPTV apps used as covers for malware are rising in popularity, researchers discover.</description>
    </item>
    <item>
      <title>Une IA a voulu &#171;&#160;supprimer et recr&#233;er l&#8217;environnement&#160;&#187; d&#8217;un serveur Amazon&#8230; et a provoqu&#233; une panne</title>
      <link>https://www.01net.com/actualites/une-ia-a-voulu-supprimer-et-recreer-lenvironnement-dun-serveur-amazon-et-a-provoque-une-panne.html</link>
      <pubDate>Fri, 20 Feb 2026 14:03:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327197</guid>
      <description>Mettre l'IA aux commandes d'un serveur n'est peut-&#234;tre pas une tr&#232;s bonne id&#233;e. Amazon Web Services a connu au moins deux interruptions de service ces derniers mois. En cause : des agents IA sp&#233;cialis&#233;s dans le d&#233;veloppement logiciel qui ont provoqu&#233; des pannes en faisant n'importe quoi. Amazon affirme n&#233;anmoins qu'il s'agissait d'erreur humaine.</description>
    </item>
    <item>
      <title>It Might Be an Even Longer Wait for &#8216;KPop Demon Hunters 2&#8217;</title>
      <link>https://gizmodo.com/kpop-demon-hunters-2-production-update-release-date-2000724187</link>
      <pubDate>Fri, 20 Feb 2026 14:00:49 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000724187</guid>
      <description>Plus, 'Scream 7' can't escape the long arm of 'Scary Movie 6'.</description>
    </item>
    <item>
      <title>The first discount on Samsung's newest cheap tablet has landed</title>
      <link>https://www.techradar.com/tablets/the-first-discount-on-samsungs-newest-cheap-tablet-has-landed</link>
      <pubDate>Fri, 20 Feb 2026 14:00:30 +0000</pubDate>
      <guid isPermaLink="false">8vpgM5fUH3KnePMpNUBKYm</guid>
      <description>The Samsung Galaxy Tab A11 Plus just got its first ever discount at Amazon, making the cheap yet capable tablet even more affordable.</description>
    </item>
    <item>
      <title>Nintendo turned its biggest flop into an expensive, uncomfortable novelty</title>
      <link>https://www.theverge.com/games/881677/nintendo-switch-virtual-boy-review</link>
      <pubDate>2026-02-20T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=881677</guid>
      <description>I've written about a lot of different video game hardware over the years, from new consoles to retro gadgets to whatever you want to call the Playdate. But I can't remember ever being perpetually sore from testing a device; such are the joys of the Virtual Boy. Nintendo has turned its biggest flop into an [&#8230;]</description>
    </item>
    <item>
      <title>What is the release date for A Knight of the Seven Kingdoms episode 6 on HBO Max?</title>
      <link>https://www.techradar.com/streaming/hbo-max/what-is-the-release-date-for-a-knight-of-the-seven-kingdoms-episode-6-on-hbo-max</link>
      <pubDate>Fri, 20 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">BK73pG5ZkXGkFofGVjqCgC</guid>
      <description>The final episode of A Knight of the Seven Kingdoms' debut season comes out soon &#8212; here's when and where you can watch it.</description>
    </item>
    <item>
      <title>Pok&#233;mon FireRed and LeafGreen preorders go live &#8212; where to buy now for Nintendo Switch</title>
      <link>https://mashable.com/article/pokemon-fire-red-leaf-green-nintendo-switch-live-preorders</link>
      <pubDate>Fri, 20 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">03SqPJRF0fDY5YKBoz718PH</guid>
      <description>Pok&#233;mon FireRed and LeafGreen land on the Switch eShop for $19.99 ahead of Pok&#233;mon Day 2026, with pre-load support and classic Kanto gameplay.</description>
    </item>
    <item>
      <title>How to watch USA vs. Slovakia in mens ice hockey online for free</title>
      <link>https://mashable.com/article/usa-slovakia-winter-ice-hockey-2026-live-stream-for-free</link>
      <pubDate>Fri, 20 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">00vDL8uHOkwcQqtSAHThpK2</guid>
      <description>How to watch ice hockey for free. Live stream USA vs. Slovakia in men's ice hockey for free from anywhere in the world.</description>
    </item>
    <item>
      <title>How to watch the 2026 winter sports curling online for free</title>
      <link>https://mashable.com/article/curling-winter-sports-2026-live-stream-for-free</link>
      <pubDate>Fri, 20 Feb 2026 13:59:54 +0000</pubDate>
      <guid isPermaLink="false">07m0Pu7YPKNSiJ9h2BK6dV3</guid>
      <description>How to watch curling for free. Live stream the 2026 winter sports curling for free from anywhere in the world.</description>
    </item>
    <item>
      <title>OpenAI says 18 to 24-year-olds account for nearly 50% of ChatGPT usage in India</title>
      <link>https://techcrunch.com/2026/02/20/openai-says-18-to-24-year-olds-account-for-nearly-50-of-chatgpt-usage-in-india/</link>
      <pubDate>Fri, 20 Feb 2026 13:57:03 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3094890</guid>
      <description>The company said on Friday that users between 18 and 24 years of age account for nearly 50% of all messages sent by Indians to ChatGPT, and users under 30 accounted for 80% of usage in the country.</description>
    </item>
    <item>
      <title>Fuite de donn&#233;es chez PayPal&#160;: des transactions non autoris&#233;es ont touch&#233; certains comptes</title>
      <link>https://www.01net.com/actualites/fuite-donnees-paypal-transactions-non-autorisees-touche-certains-comptes.html</link>
      <pubDate>Fri, 20 Feb 2026 13:55:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1327169</guid>
      <description>PayPal r&#233;v&#232;le avoir &#233;t&#233; victime d'une fuite de donn&#233;es. Pendant pr&#232;s de six mois, des donn&#233;es sensibles de clients, dont des num&#233;ros de s&#233;curit&#233; sociale, ont &#233;t&#233; collect&#233;es par des pirates. La faille a conduit &#224; des transactions frauduleuses.</description>
    </item>
    <item>
      <title>James Cameron just made 3 arguments against Netflix buying Warner Bros. The last one has stakes for the entire world</title>
      <link>https://www.fastcompany.com/91495947/james-cameron-just-made-3-arguments-against-netflix-buying-warner-bros-the-last-one-has-stakes-for-the-entire-world</link>
      <pubDate>2026-02-20T13:51:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91495947/james-cameron-just-made-3-arguments-against-netflix-buying-warner-bros-the-last-one-has-stakes-for-the-entire-world</guid>
      <description>While many in Hollywood have resisted speaking out against the controversial megamerger, the &#8216;Titanic&#8217; director said it would be &#8216;disastrous.&#8217;  
The biggest drama in Hollywood in recent months hasn&#8217;t been on the silver screen but in the boardrooms of two of the most powerful companies in the industry. </description>
    </item>
    <item>
      <title>Trump&#8217;s rollback of this key EPA finding will hit poor and minority Americans the hardest</title>
      <link>https://www.fastcompany.com/91495951/trumps-rollback-key-epa-finding-hit-poor-minority-americans-hardest</link>
      <pubDate>2026-02-20T13:49:08</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91495951/trumps-rollback-key-epa-finding-hit-poor-minority-americans-hardest</guid>
      <description>The Environmental Protection Agency recently revoked the &#8216;endangerment finding,&#8217; which is key in protecting the public from pollutants.
In a stretch of Louisiana with about 170 fossil fuel and petrochemical plants, premature death is a fact of life for people living nearby. The air is so polluted and the cancer rates so high it is known as Cancer Alley.&#8220;Most adults in the area are attending two to three funerals per month,&#8221; said Gary C. Watson Jr., who was born and raised in St. John the Baptist Parish, a majority Black community in Cancer Alley about 30 miles outside of New Orleans. His fathe...</description>
    </item>
    <item>
      <title>A brave YouTuber just modded their iPhone Air with a transparent case and built-in SIM card slot thanks to a 'dream collaboration' &#8212; but it isn't for the faint-hearted</title>
      <link>https://www.techradar.com/phones/a-brave-youtuber-just-modded-their-iphone-air-with-a-transparent-case-and-built-in-sim-card-slot-thanks-to-a-dream-collaboration-but-it-isnt-for-the-faint-hearted</link>
      <pubDate>Fri, 20 Feb 2026 13:48:55 +0000</pubDate>
      <guid isPermaLink="false">RTvqPURCScM3qJseu9EcjT</guid>
      <description>One YouTuber hacked their iPhone Air to give it a transparent back and a SIM card slot. But the fresh new design also comes with a few downsides.</description>
    </item>
    <item>
      <title>Your Coffee Grinder Is as Important as Your Brewer&#8212;Here Are the 5 Best We&#8217;ve Tested</title>
      <link>https://www.wired.com/gallery/best-coffee-grinders/</link>
      <pubDate>Fri, 20 Feb 2026 13:42:18 +0000</pubDate>
      <guid isPermaLink="false">5ea0453804fd570008ac40e5</guid>
      <description>We used particle size analysis and real-world testing to find the best conical burr, flat burr, and blade grinders for every budget and style of coffee drinker.</description>
    </item>
    <item>
      <title>Wildlight Entertainment announces Highguard update that will add a new Base and Raid Tool despite recent website troubles</title>
      <link>https://www.techradar.com/gaming/wildlight-entertainment-announces-highguard-update-that-will-add-a-new-base-and-raid-tool-despite-recent-website-troubles</link>
      <pubDate>Fri, 20 Feb 2026 13:41:32 +0000</pubDate>
      <guid isPermaLink="false">KmkghD2QksNip3aQMkxk9j</guid>
      <description>Despite recent website troubles, Wildlight Entertainment has confirmed that Highguard is still alive with the announcement of a new content update.</description>
    </item>
  </channel>
</rss>
