<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 06 Nov 2025 16:55:48 GMT</lastBuildDate>
    <item>
      <title>Microsoft AI says it&amp;#8217;ll make superintelligent AI that won&amp;#8217;t be terrible for humanity</title>
      <link>https://www.theverge.com/news/815619/microsoft-ai-humanist-superintelligence</link>
      <pubDate>2025-11-06T11:51:08-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815619</guid>
      <description>Microsoft AI wants you to know that its work toward superintelligence involves keeping humans &#8220;at the top of the food chain.&#8221; In a lengthy blog post on Thursday, Microsoft AI head Mustafa Suleyman highlighted the formation of a new team dedicated to developing a &#8220;humanist superintelligence&#8221; that&#8217;s &#8220;designed only to serve humanity.&#8221; This kind of [&#8230;]</description>
    </item>
    <item>
      <title>Le Black Friday liquide les stocks de smartphones  : voici le meilleur des promos sur les iPhone d&#8217;Apple, Samsung Galaxy et Google Pixel</title>
      <link>https://www.frandroid.com/bons-plans/2848295_le-black-friday-liquide-les-stocks-de-smartphones-notre-top-10-des-promos-sur-les-iphone-dapple-samsung-galaxy-et-google-pixel</link>
      <pubDate>Thu, 06 Nov 2025 16:49:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848295_le-black-friday-liquide-les-stocks-de-smartphones-notre-top-10-des-promos-sur-les-iphone-dapple-samsung-galaxy-et-google-pixel</guid>
      <description>
Le Black Friday est bien en avance cette ann&#233;e, et de tous les produits tech, ce sont les smartphones qui en profitent le plus. Samsung Galaxy, iPhone d'Apple, Google Pixel, Xiaomi Redmi, de l'entr&#233;e au haut de gamme, voyons ce que r&#233;servent les e-commer&#231;ants en ce d&#233;but de Black November.
</description>
    </item>
    <item>
      <title>Voici la recette secr&#232;te de Renault pour cr&#233;er une voiture &#233;lectrique &#224; 20 000 &#8364; : dans les coulisses de la cr&#233;ation de la nouvelle Twingo</title>
      <link>https://www.frandroid.com/marques/renault/2854889_voici-la-recette-secrete-de-renault-pour-creer-une-voiture-electrique-a-20-000-e-dans-les-coulisses-de-la-creation-de-la-nouvelle-twingo</link>
      <pubDate>Thu, 06 Nov 2025 16:46:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2854889_voici-la-recette-secrete-de-renault-pour-creer-une-voiture-electrique-a-20-000-e-dans-les-coulisses-de-la-creation-de-la-nouvelle-twingo</guid>
      <description>
Les voitures &#233;lectriques &#224; moins de 20 000 euros sont encore rares, et d'autant plus celles produites en Europe. La Renault Twingo y arrive pourtant ; nous sommes partis &#224; la rencontre de ses cr&#233;ateurs pour savoir comment ils y sont parvenus. Voici ce que nous avons d&#233;couvert.
</description>
    </item>
    <item>
      <title>New Research Throws the Ultimate Fate of the Universe Into Question</title>
      <link>https://gizmodo.com/new-research-throws-the-ultimate-fate-of-the-universe-into-question-2000682183</link>
      <pubDate>Thu, 06 Nov 2025 16:45:15 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682183</guid>
      <description>The popular consensus among scientists is that the universe will continue expanding until the bitter end. A team of researchers is now pumping the brakes on that idea.</description>
    </item>
    <item>
      <title>Ampoules, capteurs, t&#233;l&#233;commandes&#160;: Ikea connecte tout gr&#226;ce &#224; Matter</title>
      <link>https://www.01net.com/actualites/ampoules-capteurs-telecommandes-ikea-connecte-tout-grace-a-matter.html</link>
      <pubDate>Thu, 06 Nov 2025 16:30:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305832</guid>
      <description>&#201;clairage, capteurs, t&#233;l&#233;commandes : ce n'est pas un lancement, c'est une v&#233;ritable invasion chez Ikea, qui a d&#233;voil&#233; 21 (!) nouveaux appareils domotiques aujourd'hui. Un point commun entre tous ces appareils : leur compatibilit&#233; Matter.</description>
    </item>
    <item>
      <title>The First Look at &#8216;Stranger Things: Tales From &#8217;85&#8217; Reveals an Animated Adventure</title>
      <link>https://gizmodo.com/strange-things-tales-from-85-trailer-netflix-animated-2000682471</link>
      <pubDate>Thu, 06 Nov 2025 16:30:28 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682471</guid>
      <description>Ahead of 'Stranger Things' season 5, Netflix has given us a first look at its new animated spinoff, coming in 2026.</description>
    </item>
    <item>
      <title>Sports streaming is a fragmented hot mess</title>
      <link>https://www.theverge.com/column/815571/sports-streaming-mess</link>
      <pubDate>2025-11-06T11:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815571</guid>
      <description>This is Lowpass by Janko Roettgers, a newsletter on the ever-evolving intersection of tech and entertainment, syndicated just for The Verge subscribers once a week. This week, JJ Watt finally had enough. The former NFL star, who played for the Houston Texans for close to a decade, took to X to declare that he was [&#8230;]</description>
    </item>
    <item>
      <title>Apple Music will soon let you share songs and lyrics to your WhatsApp status as the fight against Spotify continues</title>
      <link>https://www.techradar.com/audio/apple-music/apple-music-will-soon-let-you-share-songs-and-lyrics-to-your-whatsapp-status-as-the-fight-against-spotify-continues</link>
      <pubDate>Thu, 06 Nov 2025 16:30:00 +0000</pubDate>
      <guid isPermaLink="false">ZesJbMqALZuAdYkCB6cmXG</guid>
      <description>Apple is reportedly working on direct integration between Apple Music and WhatsApp to match previously-released Spotify features as Wrapped season approaches</description>
    </item>
    <item>
      <title>Passer &#224; Windows 11 sans se ruiner : d&#233;couvrez ce PC portable HP efficace &#224; seulement 419 &#8364; [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2856789_passer-a-windows-11-sans-se-ruiner-decouvrez-ce-pc-portable-hp-efficace-a-seulement-419-e</link>
      <pubDate>Thu, 06 Nov 2025 16:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2856789_passer-a-windows-11-sans-se-ruiner-decouvrez-ce-pc-portable-hp-efficace-a-seulement-419-e</guid>
      <description>
Les bonnes affaires du jour c&#244;t&#233; informatique sont &#224; faire chez PcComponentes : le revendeur espagnol brade plusieurs de ses r&#233;f&#233;rences en clavier azerty &#224; quelques encablures du Black Friday.
</description>
    </item>
    <item>
      <title>Gemini Deep Research is able to delve into your Gmail, Docs, Drive and even Chat - but will it really make you more productive?</title>
      <link>https://www.techradar.com/pro/gemini-deep-research-can-now-connect-to-your-gmail-docs-drive-and-even-chat</link>
      <pubDate>Thu, 06 Nov 2025 16:26:00 +0000</pubDate>
      <guid isPermaLink="false">WXz79eGHHV8Ptux34Wvdc7</guid>
      <description>Deep Research can now get even more context from Gmail, Google Drive and Chat, as well as Search.</description>
    </item>
    <item>
      <title>This Florida Doctor&#8217;s Office Gave Its Own Patients Hepatitis C</title>
      <link>https://gizmodo.com/this-florida-doctors-office-gave-its-own-patients-hepatitis-c-2000682425</link>
      <pubDate>Thu, 06 Nov 2025 16:25:35 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682425</guid>
      <description>The Florida Department of Health found that several patients of Lily J. Voepel caught the bloodborne infection while under her care.</description>
    </item>
    <item>
      <title>Doctolib sanctionn&#233; pour avoir verrouill&#233; le march&#233; des prises de rendez-vous en ligne</title>
      <link>https://www.frandroid.com/android/applications/2858899_doctolib-sanctionne-pour-avoir-verrouille-le-marche-des-prises-de-rendez-vous-en-ligne</link>
      <pubDate>Thu, 06 Nov 2025 16:20:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/applications/2858899_doctolib-sanctionne-pour-avoir-verrouille-le-marche-des-prises-de-rendez-vous-en-ligne</guid>
      <description>
Doctolib, la star de la prise de rendez-vous m&#233;dicaux en ligne, vient d&#8217;&#234;tre frapp&#233;e par une sanction importante. L&#8217;Autorit&#233; de la concurrence fran&#231;aise lui a inflig&#233; une amende de 4,6 millions d&#8217;euros pour des pratiques jug&#233;es abusives sur le march&#233;.
</description>
    </item>
    <item>
      <title>This Cheap Dual-Screen Handheld Is the Best Way to Recreate the Nintendo DS</title>
      <link>https://gizmodo.com/anbernic-rg-ds-best-way-to-recreate-nintendo-ds-2000682443</link>
      <pubDate>Thu, 06 Nov 2025 16:15:41 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682443</guid>
      <description>Not only is it the cheapest option, but it's the only one that offers purist controls.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs TV TCL en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/1610991_quelles-sont-les-meilleures-tv-tcl-disponibles</link>
      <pubDate>Thu, 06 Nov 2025 16:15:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1610991_quelles-sont-les-meilleures-tv-tcl-disponibles</guid>
      <description>
Sur le march&#233; des t&#233;l&#233;viseurs, la marque chinoise TCL est de plus en plus pr&#233;sente, notamment avec des mod&#232;les aux tarifs agressifs. Pour vous aider, nous avons s&#233;lectionn&#233; les meilleurs TV TCL disponibles actuellement.
</description>
    </item>
    <item>
      <title>Stranger Things: Tales From 85 trailer, images, voice cast, and 2026 release window unveiled by Netflix for Stranger Things Day 2025</title>
      <link>https://www.techradar.com/streaming/netflix/stranger-things-tales-from-85-trailer-images-voice-cast-and-2026-release-window-unveiled-by-netflix-for-stranger-things-day-2025</link>
      <pubDate>Thu, 06 Nov 2025 16:04:17 +0000</pubDate>
      <guid isPermaLink="false">NB6PErTrHxBR2jNfeycxMY</guid>
      <description>Netflix has revealed some new details about its first Stranger Things spin-off, including a whole new cast for Eleven, Mike, and more.</description>
    </item>
    <item>
      <title>Avant-Black Friday smartphones &#224; moins de 500 euros : les meilleures offres sur les Samsung Galaxy, Xiaomi Redmi et Nothing Phone</title>
      <link>https://www.frandroid.com/bons-plans/2856691_le-black-month-est-la-avec-des-reductions-phares-le-top-des-meilleures-offres-de-smartphones-a-moins-de-500-e</link>
      <pubDate>Thu, 06 Nov 2025 16:02:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2856691_le-black-month-est-la-avec-des-reductions-phares-le-top-des-meilleures-offres-de-smartphones-a-moins-de-500-e</guid>
      <description>
Si le Black Friday se fera attendre jusqu'&#224; la fin du mois, les e-commer&#231;ants fran&#231;ais n'ont eux pas attendu pour lancer des offres. Les smartphones font partie des produits qui profitent de r&#233;ductions vraiment int&#233;ressantes, notamment sur l'entr&#233;e et le milieu de gamme. 
</description>
    </item>
    <item>
      <title>The Roman Empire&#8217;s Entire Road Network Just Got Mapped, and It&#8217;s Mind-Blowing</title>
      <link>https://gizmodo.com/the-roman-empires-entire-road-network-just-got-mapped-and-its-mind-blowing-2000681707</link>
      <pubDate>Thu, 06 Nov 2025 16:00:57 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000681707</guid>
      <description>A new study identified over 68,000 more miles of ancient Roman roads than were previously known.</description>
    </item>
    <item>
      <title>Watch &#8216;Shimmer,&#8217; a Gorgeous and Poignant Sci-Fi Short With Oscar Aspirations (Exclusive)</title>
      <link>https://gizmodo.com/watch-shimmer-a-gorgeous-and-poignant-sci-fi-short-with-oscar-aspirations-exclusive-2000681710</link>
      <pubDate>Thu, 06 Nov 2025 16:00:30 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000681710</guid>
      <description>io9 talks to Mexican filmmaker Andr&#233;s Palma about his animated creation, the tale of a family trying to survive the post-apocalypse.</description>
    </item>
    <item>
      <title>Pebblebee&#8217;s new trackers are brighter, louder, thinner, and more colorful</title>
      <link>https://www.theverge.com/news/814728/pebblebee-clip-card-5-trackers-apple-find-my-google-hub</link>
      <pubDate>2025-11-06T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814728</guid>
      <description>Pebblebee has announced new versions of its AirTag-like Clip tracker and wallet-sized Card tracker. The new Clip 5 features a similar design to the previous version with a built-in loop for attaching it to a keychain but includes improvements focused on its personal safety features, plus more color options. The new Card 5 is 30 [&#8230;]</description>
    </item>
    <item>
      <title>The world&#8217;s first Thin-Ply Carbon Diaphragm headphones are here from an audio icon &#8211; and I need to try them</title>
      <link>https://www.techradar.com/audio/speakers/the-worlds-first-thin-ply-carbon-diaphragm-headphones-are-here-from-an-audio-icon-and-i-need-to-try-them</link>
      <pubDate>Thu, 06 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">MG9eANfnwEN2u2CJtoMJ8o</guid>
      <description>Meet HEDDphone D1: A HEDD-y mix of futuristic technology in open-back cans</description>
    </item>
    <item>
      <title>Stream Ring&#160;: l&#8217;inqui&#233;tante bague connect&#233;e qui enregistre et imite votre voix</title>
      <link>https://www.01net.com/actualites/stream-ring-linquietante-bague-connectee-qui-enregistre-et-imite-votre-voix.html</link>
      <pubDate>Thu, 06 Nov 2025 15:59:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305702</guid>
      <description>La start-up am&#233;ricaine Sandbar, fond&#233;e par deux anciens employ&#233;s de Meta, lance une bague connect&#233;e qui retranscrit vos notes vocales et vous r&#233;pond avec un clone de votre propre voix. Disponible en pr&#233;commande &#224; partir de 249 dollars, elle arrivera &#224; l'&#233;t&#233; 2026.</description>
    </item>
    <item>
      <title>Pok&#233;mon Legends: Z-A Mega Dimension DLC has an official release date and the first trailer confirms new Mega Evolutions</title>
      <link>https://www.techradar.com/gaming/pokemon-legends-z-a-mega-dimension-dlc-has-an-official-release-date-and-the-first-trailer-confirms-new-mega-evolutions</link>
      <pubDate>Thu, 06 Nov 2025 15:57:09 +0000</pubDate>
      <guid isPermaLink="false">KgNLR8hzDZG2AGi8rkme8a</guid>
      <description>The Pok&#233;mon Company has announced the release date for the first expansion for Pok&#233;mon Legends: Z-A.</description>
    </item>
    <item>
      <title>Nvidia CEO Says China &#8216;Will Win&#8217; the Global AI Race as the U.S. Falls Behind in Energy</title>
      <link>https://gizmodo.com/nvidia-ceo-says-china-will-win-the-global-ai-race-as-the-u-s-falls-behind-in-energy-2000682396</link>
      <pubDate>Thu, 06 Nov 2025 15:55:52 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682396</guid>
      <description>It's all thanks to China's energy policy, Nvidia's Jensen Huang claims.</description>
    </item>
    <item>
      <title>Spotify is launching a weekly mini &#8216;Wrapped&#8217;</title>
      <link>https://www.theverge.com/news/815521/spotify-listening-stats-weekly-feature-wrapped</link>
      <pubDate>2025-11-06T10:53:10-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815521</guid>
      <description>Spotify has introduced a new &#8220;listening stats&#8221; feature that gives you a weekly overview of your recent music streaming habits. It essentially acts like a mini version of Spotify&#8217;s annual Wrapped review, showing you which artists and songs you&#8217;ve listened to the most each week, and making curated playlists inspired by those results. Listening stats [&#8230;]...</description>
    </item>
    <item>
      <title>Le Samsung Galaxy A36 5G dop&#233; &#224; l&#8217;IA est &#224; moiti&#233; prix pendant ce pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2658803_le-samsung-galaxy-a36-5g-dope-a-lia-est-a-moitie-prix-pendant-ce-pre-black-friday</link>
      <pubDate>Thu, 06 Nov 2025 15:49:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2658803_le-samsung-galaxy-a36-5g-dope-a-lia-est-a-moitie-prix-pendant-ce-pre-black-friday</guid>
      <description>
D&#233;voil&#233; en d&#233;but d'ann&#233;e, le Samsung Galaxy A36 5G fait partie des premiers smartphones de la s&#233;rie Galaxy A &#224; offrir les fonctions IA du constructeur. S'il vous int&#233;resse, sachez que ce digne successeur du tr&#232;s bon Galaxy A35 est en ce moment propos&#233; &#224; 209 euros au lieu de 399,99 euros pendant le pr&#233;-Black Friday chez Cdiscount
</description>
    </item>
    <item>
      <title>Avec l&#8217;iPhone Air 2, Apple pourrait corriger un des gros d&#233;fauts de son smartphone ultra fin</title>
      <link>https://www.01net.com/actualites/avec-liphone-air-2-apple-pourrait-corriger-un-des-gros-defauts-de-son-smartphone-ultra-fin.html</link>
      <pubDate>Thu, 06 Nov 2025 15:47:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305796</guid>
      <description>Apple ne renonce pas &#224; l&#8217;ultrafin. Malgr&#233; des ventes timides, l&#8217;iPhone Air 2 miserait sur un nouveau capteur ultra grand-angle pour combler son principal retard face &#224; Samsung et Motorola.</description>
    </item>
    <item>
      <title>Best Buy's early Black Friday sale is filled with unbelievable TV deals &#8211; shop the 15 best from Samsung, Sony, and LG</title>
      <link>https://www.techradar.com/televisions/best-buys-early-black-friday-sale-is-filled-with-unbelievable-tv-deals-shop-the-15-best-from-samsung-sony-and-lg</link>
      <pubDate>Thu, 06 Nov 2025 15:47:06 +0000</pubDate>
      <guid isPermaLink="false">PKC3oXJUWZajNMBh8v84d5</guid>
      <description>Best Buy's early Black Friday sale is now live, featuring incredible TV deals. Here are the 15 best, with savings of over $1,000 from Samsung, LG, and Sony.</description>
    </item>
    <item>
      <title>Mastodon&#8217;s latest software update brings quote posts to all server operators</title>
      <link>https://techcrunch.com/2025/11/06/mastodons-latest-software-update-brings-quote-posts-to-all-server-operators/</link>
      <pubDate>Thu, 06 Nov 2025 15:43:52 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3065618</guid>
      <description>Mastodon's latest software version brings quote posts with added controls to all servers.</description>
    </item>
    <item>
      <title>Iran&#8217;s "VPN mafia" blamed for delays on the lifting of Telegram ban &#8211; here's what we know</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/irans-vpn-mafia-blamed-for-delays-on-the-lifting-of-telegram-ban-heres-what-we-know</link>
      <pubDate>Thu, 06 Nov 2025 15:42:09 +0000</pubDate>
      <guid isPermaLink="false">AfiVPeC6CzSdjEPBps55bG</guid>
      <description>While reports suggested Iran is ready to lift the ban, Durov's platform remains restricted. An Iranian lawmaker said the VPN industry is to blame this time.</description>
    </item>
    <item>
      <title>Early Black Friday TV deals are live in the UK &#8211; I've found the 9 best offers from &#163;89.99</title>
      <link>https://www.techradar.com/televisions/early-black-friday-tv-deals-are-live-in-the-uk-ive-found-the-9-best-offers-from-gbp89-99</link>
      <pubDate>Thu, 06 Nov 2025 15:40:48 +0000</pubDate>
      <guid isPermaLink="false">hSxk6aYLgmwqCxfMbEVUwE</guid>
      <description>Black Friday is always a great time of the year to buy a new TV, so I've rounded up the best deals available now in the early sales.</description>
    </item>
    <item>
      <title>Peloton recalls 833,000 bikes after reports of injuries</title>
      <link>https://techcrunch.com/2025/11/06/peloton-recalls-833000-bikes-after-reports-of-injuries/</link>
      <pubDate>Thu, 06 Nov 2025 15:35:23 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3065620</guid>
      <description>The Consumer Product Safety Commission is warning Peloton users to stop using the affected bikes immediately.</description>
    </item>
    <item>
      <title>25 WIRED-Approved Gifts for Frequent Travelers (2025)</title>
      <link>https://www.wired.com/gallery/best-travel-gifts/</link>
      <pubDate>Thu, 06 Nov 2025 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">5dc5ea9ff34856000812609e</guid>
      <description>For the frequent flier who treats the Delta Sky Club like their second home.</description>
    </item>
    <item>
      <title>How AI is fueling an existential crisis in education</title>
      <link>https://www.theverge.com/podcast/815434/ai-education-schools-research-cheating-chatgpt-jobs-grades</link>
      <pubDate>2025-11-06T10:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815434</guid>
      <description>Here on Decoder, we&#8217;ve talked a lot about generative AI, which is a very big idea that is causing quite a few problems. One thing we keep hearing about over and over again is that generative AI is causing a lot of problems in schools. A lot of people out there, including many of the [&#8230;]</description>
    </item>
    <item>
      <title>I tested Nikon's updated 24-70mm f/2.8 pro zoom for a month, and it's a 5-star lens by every metric</title>
      <link>https://www.techradar.com/cameras/camera-lenses/nikon-z-24-70mm-f-2-8-s-ii-review</link>
      <pubDate>Thu, 06 Nov 2025 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">E6ydigrTDHrUcRK3pPVfd4</guid>
      <description>The Z 24-70mm f/2.8 S II is Nikon's first second-gen Z-mount lens, with a new optical design, slimmer profile and internal zoom &#8211; but is it a big enough upgrade to tempt owners of the original?</description>
    </item>
    <item>
      <title>Samsung n&#8217;&#233;pargne aucun de ses produits pour le pr&#233;-Black Friday : le TOP 15 des offres &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2852851_samsung-nepargne-aucun-de-ses-produits-pour-le-pre-black-friday-le-top-15-des-offres-a-retenir</link>
      <pubDate>Thu, 06 Nov 2025 15:28:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2852851_samsung-nepargne-aucun-de-ses-produits-pour-le-pre-black-friday-le-top-15-des-offres-a-retenir</guid>
      <description>
Samsung participe pleinement &#224; cette p&#233;riode de pr&#233;-Black Friday. Smartphones, t&#233;l&#233;viseurs, tablettes, barres de son, vid&#233;oprojecteurs et m&#234;me aspirateurs-balais&#8239;: la marque sud-cor&#233;enne casse les prix sur de nombreuses r&#233;f&#233;rences r&#233;centes et populaires. D&#233;couvrez les meilleures offres &#224; saisir dans cet article.  
</description>
    </item>
    <item>
      <title>From caution to confidence: Tackling AI obstacles with education</title>
      <link>https://www.techradar.com/pro/from-caution-to-confidence-tackling-ai-obstacles-with-education</link>
      <pubDate>Thu, 06 Nov 2025 15:26:25 +0000</pubDate>
      <guid isPermaLink="false">4hE4URraksYVc8fzTaBu2D</guid>
      <description>Generative AI, agents, and automation can unlock countless benefits for an enterprise.</description>
    </item>
    <item>
      <title>IKEA explose les prix de la maison connect&#233;e Matter : voici les 21 nouveaux produits</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/2858571_ikea-explose-les-prix-de-la-maison-connectee-matter-voici-les-21-nouveaux-produits</link>
      <pubDate>Thu, 06 Nov 2025 15:24:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/2858571_ikea-explose-les-prix-de-la-maison-connectee-matter-voici-les-21-nouveaux-produits</guid>
      <description>
IKEA fait son grand saut dans Matter. Le su&#233;dois abandonne totalement Zigbee pour lancer 21 appareils Thread &#224; des prix d&#233;fiant toute concurrence.
</description>
    </item>
    <item>
      <title>Best Home Depot Black Friday Deals</title>
      <link>https://www.wired.com/story/black-friday-home-depot-deals-2025/</link>
      <pubDate>Thu, 06 Nov 2025 15:23:34 +0000</pubDate>
      <guid isPermaLink="false">690bbc923af117d48a73f29d</guid>
      <description>Black Friday lasts a month this year at The Home Depot, including half off select tools and tool sets.</description>
    </item>
    <item>
      <title>Human stories break through</title>
      <link>https://www.fastcompany.com/91435693/human-stories-break-through</link>
      <pubDate>2025-11-06T15:20:41</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91435693/human-stories-break-through</guid>
      <description>AI has flooded the internet with content making meaningful stories a competitive advantage.
Over the last two years, the value of content has collapsed. Thanks to the LLM revolution, the internet is drowning in an avalanche of indistinguishable output: an endless parade of fast-food writing, recycled reports, and SEO-bait fluff optimized for algorithms instead of people. That&#8217;s why the only competitive moat left is the human story....</description>
    </item>
    <item>
      <title>Gootloader malware returns with fake NDA scam - here's what we know</title>
      <link>https://www.techradar.com/pro/security/gootloader-malware-returns-with-fake-nda-scam-heres-what-we-know</link>
      <pubDate>Thu, 06 Nov 2025 15:19:00 +0000</pubDate>
      <guid isPermaLink="false">PgzWNYWnxaTfyLQ7YagQwW</guid>
      <description>After a six-month hiatus, Gootloader is back to its old tricks - but it has gone through a few changes too.</description>
    </item>
    <item>
      <title>Changing what works to what scales</title>
      <link>https://www.fastcompany.com/91435669/changing-what-works-to-what-scales</link>
      <pubDate>2025-11-06T15:14:35</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91435669/changing-what-works-to-what-scales</guid>
      <description>What it takes to change strategy while everything still works&#8212;and why the real bottleneck isn&#8217;t technology, it&#8217;s capacity.
Tech is shifting faster than the models we built our impact on. And that means even thriving nonprofits face a choice: Keep optimizing what works&#8212;or rebuild for what&#8217;s coming.</description>
    </item>
    <item>
      <title>What to Do in St. Paul and Minneapolis If You&#8217;re Here for Business (2025)</title>
      <link>https://www.wired.com/story/the-wired-guide-to-the-twin-cities-for-business-travelers/</link>
      <pubDate>Thu, 06 Nov 2025 15:13:49 +0000</pubDate>
      <guid isPermaLink="false">68ff83b0e07c003159d07eff</guid>
      <description>Where to stay, play, eat, and work, while on a business trip to Minneapolis and St. Paul.</description>
    </item>
    <item>
      <title>Chaos and lies: Why Sam Altman was booted from OpenAI, according to new testimony</title>
      <link>https://www.theverge.com/ai-artificial-intelligence/814876/ilya-sutskever-deposition-openai-sam-altman-elon-musk-lawsuit</link>
      <pubDate>2025-11-06T10:13:17-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814876</guid>
      <description>"What did Ilya see?" Two years ago, it was the meme seen 'round the world (or at least 'round the tech industry). OpenAI CEO Sam Altman had been briefly ousted in November 2023 by members of the company's board of directors, including his longtime collaborator and fellow cofounder Ilya Sutskever. The board claimed Altman "was [&#8230;]</description>
    </item>
    <item>
      <title>Why data sovereignty is essential to help businesses prepare for impending AI regulation</title>
      <link>https://www.techradar.com/pro/why-data-sovereignty-is-essential-to-help-businesses-prepare-for-impending-ai-regulation</link>
      <pubDate>Thu, 06 Nov 2025 15:12:58 +0000</pubDate>
      <guid isPermaLink="false">DMz9jryivGoJJPpfXofPvT</guid>
      <description>For businesses, controlling data is key to thriving amid new global AI regulations and risks.</description>
    </item>
    <item>
      <title>ESPN Bet is shutting down, and now ESPN is partnering with DraftKings</title>
      <link>https://www.theverge.com/news/815472/espn-bet-shutdown-draftkings-partnership</link>
      <pubDate>2025-11-06T10:12:45-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=815472</guid>
      <description>ESPN Bet is winding down in favor of a new integration with DraftKings. In an announcement on Thursday, ESPN revealed that it will shutter the standalone betting app in December, while also cutting ties with Penn Entertainment, the company it worked with to develop ESPN Bet. In its place, ESPN will introduce DraftKings&#8217; betting features [&#8230;]</description>
    </item>
    <item>
      <title>Microsoft is finally adding a real em-dash shortcut to Windows 11 &#8211; just as AI made you want to stop using it</title>
      <link>https://www.techradar.com/computing/windows/microsoft-is-finally-adding-a-real-em-dash-shortcut-to-windows-11-just-as-ai-made-you-want-to-stop-using-it</link>
      <pubDate>Thu, 06 Nov 2025 15:12:32 +0000</pubDate>
      <guid isPermaLink="false">eSxAwBGhB6LPiJUojhu3k6</guid>
      <description>Got to dash? If you want the long variety of this punctuation in Windows 11, you can now have it without a ridiculously clunky 'shortcut'.</description>
    </item>
    <item>
      <title>&#8216;Woke is back&#8217; on social media following Mamdani victory</title>
      <link>https://www.fastcompany.com/91436255/zohran-mamdani-twitter-woke-left-new-york-city-politics-election</link>
      <pubDate>2025-11-06T15:10:52</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91436255/zohran-mamdani-twitter-woke-left-new-york-city-politics-election</guid>
      <description>For the online left, something shifted on Tuesday night.
New York City has elected a democratic socialist as its next mayor. Across the internet, progressive internet users are hopescrolling for the first time in years and proudly declaring: &#8220;woke is back.&#8221;</description>
    </item>
    <item>
      <title>Shein&#160;: les douaniers de Roissy-CDG vont contr&#244;ler 200&#160;000 colis provenant de la plateforme</title>
      <link>https://www.01net.com/actualites/shein-les-douaniers-de-roissy-cdg-vont-controler-200-000-colis-provenant-de-la-plateforme.html</link>
      <pubDate>Thu, 06 Nov 2025 15:10:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305793</guid>
      <description>Apr&#232;s la proc&#233;dure de suspension, les op&#233;rations de contr&#244;le : la ministre des Comptes publics a annonc&#233; une op&#233;ration in&#233;dite &#224; l'a&#233;roport Roissy Charles de Gaulle o&#249; transitent pr&#232;s de 95 % des produits provenant de Chine : tous les colis provenant de Shein vont subir un contr&#244;le de conformit&#233;.</description>
    </item>
    <item>
      <title>L&#8217;&#171;&#160;Arche de No&#233;&#160;&#187; du cosmos : l&#8217;histoire vraie derri&#232;re la naissance du Seti sovi&#233;tique</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-arche-noe-cosmos-histoire-vraie-derriere-naissance-seti-sovietique-127229/#xtor%3DRSS-8</link>
      <pubDate>Thu, 06 Nov 2025 16:10:20 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-arche-noe-cosmos-histoire-vraie-derriere-naissance-seti-sovietique-127229/#xtor%3DRSS-8</guid>
      <description>Le souvenir de Carl Sagan et Frank Drake, pionniers du programme Seti pour la recherche des civilisations extraterrestres, est encore bien vivace dans le grand public de l'Europe de l'Ouest et des &#201;tats-Unis. Mais on ne peut pas en dire autant de leurs coll&#232;gues du temps de l'URSS, de l'autre...</description>
    </item>
    <item>
      <title>Quelles sont les meilleures tablettes tactiles &#224; acheter en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guide-tablettes/320702_guide-dachat-tablette-choisir-noel</link>
      <pubDate>Thu, 06 Nov 2025 15:02:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-tablettes/320702_guide-dachat-tablette-choisir-noel</guid>
      <description>
La bonne vieille tablette tactile trouve toujours sa place dans nos foyers. Pour savoir laquelle choisir, de la petite tablette pas ch&#232;re aux iPad Pro les plus puissants, vous &#234;tes au bon endroit. Voici notre s&#233;lection des meilleures tablettes du march&#233;. 
</description>
    </item>
    <item>
      <title>Beaucoup de style et un petit prix&#160;: Renault lance sa nouvelle Twingo &#233;lectrique</title>
      <link>https://www.01net.com/actualites/beaucoup-de-style-et-un-petit-prix-renault-lance-sa-nouvelle-twingo-electrique.html</link>
      <pubDate>Thu, 06 Nov 2025 15:00:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305085</guid>
      <description>Renault prend le march&#233; de l&#8217;&#233;lectrique &#224; rebours avec une nouvelle Twingo taill&#233;e pour la ville. Nous avons pu la d&#233;couvrir lors de sa premi&#232;re sortie officielle.</description>
    </item>
    <item>
      <title>&#8216;Gremlins 3&#8217; Is Real, and Coming in 2027</title>
      <link>https://gizmodo.com/gremlins-3-release-date-warner-bros-2000682397</link>
      <pubDate>Thu, 06 Nov 2025 15:00:24 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000682397</guid>
      <description>Chris Columbus will direct the long-awaited threequel, 35 years after 'The New Batch' hit theaters.</description>
    </item>
    <item>
      <title>The Verge&#8217;s guide to Black Friday 2025</title>
      <link>https://www.theverge.com/tech/808624/black-friday-cyber-monday-guide-2025</link>
      <pubDate>2025-11-06T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?post_type=vm_package&amp;p=808624</guid>
      <description>At the end of November, we&#8217;ll gather friends and family to dine on our favorite foods. And once our stomachs settle, the real feast will begin. This year, the 24-hour deal blitz that is Black Friday will commence on November 28th, followed by a weeklong Cyber Monday sale that kicks off on December 1st. Many [&#8230;]</description>
    </item>
    <item>
      <title>How I built a vanlife setup powerful enough for work and play</title>
      <link>https://www.theverge.com/reviews/810253/vanlife-setup-power-victron-solar-sogen-video</link>
      <pubDate>2025-11-06T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/810253/the-espresso-pro-portable-monitor-is-a-revolution-for-remote-work</guid>
      <description>Last year I did the thing I'd been dreaming about for a decade: I bought a van. After twenty years of tech journalism, creating a mobile test platform for remote work was just as exciting as having an adventure vehicle to pursue my outdoor hobbies. For that I'd need lots of battery capacity to power [&#8230;]</description>
    </item>
    <item>
      <title>Hyrule Warriors: Age of Imprisonment finishes what Tears of the Kingdom started</title>
      <link>https://www.theverge.com/entertainment/814762/hyrule-warriors-age-of-imprisonment-zelda-tears-of-the-kingdom</link>
      <pubDate>2025-11-06T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=814762</guid>
      <description>Though my 100-plus-hour completed save file would beg to differ, The Legend of Zelda: Tears of the Kingdom is an unfinished game. Think of it like Korean barbecue. Without the kimchi, rice, sprouts, or sauce, it's just meat - tasty meat to be sure, but not a complete (or healthy) dinner. Hyrule Warriors: Age of [&#8230;]</description>
    </item>
    <item>
      <title>Quordle hints and answers for Friday, November 7 (game #1383)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-7-november-2025</link>
      <pubDate>Thu, 06 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">NKFhgurjyvVyRYS4pqGJfT</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Friday, November 7 (game #880)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-7-november-2025</link>
      <pubDate>Thu, 06 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">DKjF4CYowhsfYZeL73Jxgg</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Friday, November 7 (game #614)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-7-november-2025</link>
      <pubDate>Thu, 06 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">8iaPwMe6x5yYQoSvhcFq5a</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Spotify launches listening stats every 24 hours plus a weekly Wrapped, and it's a sure-fire way to beat Apple Music Replay</title>
      <link>https://www.techradar.com/audio/spotify/spotify-launches-listening-stats-every-24-hours-plus-a-weekly-wrapped-and-its-a-sure-fire-way-to-beat-apple-music-replay</link>
      <pubDate>Thu, 06 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">Jhc2EKjfjCtz49jhpKAQaZ</guid>
      <description>Spotify's new 'Listening stats' tab updates every 24 hours, showing your top artists and songs from the past four weeks.</description>
    </item>
    <item>
      <title>Your Ring camera is about to get smarter with Single Event Alert &#8211; and it should mean fewer notifications</title>
      <link>https://www.techradar.com/home/smart-home/your-ring-camera-is-about-to-get-smarter-with-single-event-alert-and-it-should-mean-fewer-notifications</link>
      <pubDate>Thu, 06 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">CnH5ugnXyspuBpECEb6ryU</guid>
      <description>If you're regularly getting too many alerts from your Ring cameras, this should help (but you'll have to pay for it).</description>
    </item>
    <item>
      <title>Renault lance une voiture &#233;lectrique &#224; moins de 20 000 &#8364; : voici la nouvelle Twingo E-Tech</title>
      <link>https://www.frandroid.com/marques/renault/2854895_renault-lance-une-voiture-electrique-a-moins-de-20-000-e-voici-la-nouvelle-twingo-e-tech</link>
      <pubDate>Thu, 06 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2854895_renault-lance-une-voiture-electrique-a-moins-de-20-000-e-voici-la-nouvelle-twingo-e-tech</guid>
      <description>
Apr&#232;s la R5 et la R4, Renault r&#233;interpr&#232;te une autre de ses anciennes gloires avec la nouvelle Twingo E-Tech. Cette nouvelle voiture &#233;lectrique se veut abordable, avec un prix sous les 20 000 euros hors bonus, sans oublier un r&#233;el sens de la praticit&#233;.
</description>
    </item>
    <item>
      <title>Je suis mont&#233; &#224; bord de la nouvelle Renault Twingo &#233;lectrique : moins de 20 000 &#8364; et un vrai coup de c&#339;ur</title>
      <link>https://www.frandroid.com/marques/renault/2848907_je-suis-monte-a-bord-de-la-nouvelle-renault-twingo-electrique-moins-de-20-000-e-et-un-vrai-coup-de-coeur</link>
      <pubDate>Thu, 06 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2848907_je-suis-monte-a-bord-de-la-nouvelle-renault-twingo-electrique-moins-de-20-000-e-et-un-vrai-coup-de-coeur</guid>
      <description>
J'ai pu monter &#224; bord de la nouvelle Renault Twingo E-Tech. Si sa promesse de rejoindre le club tr&#232;s select des voitures &#233;lectriques &#224; moins de 20 000 &#8364; est tenue, je me suis rendu compte qu'elle apportait quelque chose de nouveau dans la cat&#233;gorie des citadines. Voici mes premi&#232;res impressions.
</description>
    </item>
    <item>
      <title>Mate 70 Air&#160;: Huawei lance un iPhone Air aux st&#233;ro&#239;des</title>
      <link>https://www.01net.com/actualites/mate-70-air-huawei-lance-un-iphone-air-aux-steroides.html</link>
      <pubDate>Thu, 06 Nov 2025 14:59:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305799</guid>
      <description>Apr&#232;s Samsung, Apple et Motorola, au tour de Huawei de se lancer dans la bagarre des smartphones ultrafins ! Le Mate 70 Air est le plus &#233;pais du march&#233;, mais il compense par un bloc appareil photo complet et une grosse batterie.</description>
    </item>
    <item>
      <title>Cdiscount : voici les 10 bonnes affaires &#224; d&#233;nicher pendant le pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2850059_cdiscount-voici-les-10-bonnes-affaires-a-denicher-pendant-le-pre-black-friday</link>
      <pubDate>Thu, 06 Nov 2025 14:58:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2850059_cdiscount-voici-les-10-bonnes-affaires-a-denicher-pendant-le-pre-black-friday</guid>
      <description>
Cdiscount entre lui aussi dans la course aux bonnes affaires en ouvrant son op&#233;ration pr&#233;-Black Friday. Il y a une multitude de r&#233;ductions sur une large s&#233;lection de produits Tech. Les offres sont nombreuses, mais vous retrouverez uniquement celles qui m&#233;ritent votre argent.&#160;
</description>
    </item>
    <item>
      <title>Not&#233; 9/10, ce compteur GPS Garmin en promo fonctionnant &#224; l&#8217;&#233;nergie solaire va ravir les cyclistes pendant ce pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2594031_note-9-10-ce-compteur-gps-garmin-en-promo-fonctionnant-a-lenergie-solaire-va-ravir-les-cyclistes-pendant-ce-pre-black-friday</link>
      <pubDate>Thu, 06 Nov 2025 14:58:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2594031_note-9-10-ce-compteur-gps-garmin-en-promo-fonctionnant-a-lenergie-solaire-va-ravir-les-cyclistes-pendant-ce-pre-black-friday</guid>
      <description>
Les cyclistes de tous horizons vont &#234;tre ravis : les compteurs GPS Garmin Edge 840 Solar et classique sont en promotion pendant le pr&#233;-Black Friday chez Alltricks, respectivement &#224; 499,99 euros et 349,99 euros.
</description>
    </item>
  </channel>
</rss>
