<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 01 Jan 2026 10:27:51 GMT</lastBuildDate>
    <item>
      <title>Voitures &#233;lectriques les plus vendues en 2025 : voici le classement final, la Renault 5 &#233;crase la concurrence</title>
      <link>https://www.frandroid.com/marques/2925037_voitures-electriques-les-plus-vendues-en-2025-voici-le-classement-final-la-renault-5-ecrase-la-concurrence</link>
      <pubDate>Thu, 01 Jan 2026 10:19:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2925037_voitures-electriques-les-plus-vendues-en-2025-voici-le-classement-final-la-renault-5-ecrase-la-concurrence</guid>
      <description>
On s'y attendait, mais pas &#224; ce point. Les chiffres de 2025 sont tomb&#233;s et c'est un massacre : la Renault 5 E-Tech a litt&#233;ralement pli&#233; le game avec pr&#232;s de 38 000 immatriculations. Pendant ce temps, Tesla sauve les meubles avec son SUV, mais grimace sur sa berline.
</description>
    </item>
    <item>
      <title>Ce TV 4K Mini LED 65&#8243; 144 Hz de Xiaomi en promo &#224; moins de 600 &#8364; est le meilleur mod&#232;le accessible pour bien commencer l&#8217;ann&#233;e</title>
      <link>https://www.frandroid.com/bons-plans/2924045_ce-tv-4k-mini-led-65-144-hz-de-xiaomi-en-promo-a-moins-de-600-e-est-le-meilleur-modele-accessible-pour-bien-commencer-lannee</link>
      <pubDate>Thu, 01 Jan 2026 10:16:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2924045_ce-tv-4k-mini-led-65-144-hz-de-xiaomi-en-promo-a-moins-de-600-e-est-le-meilleur-modele-accessible-pour-bien-commencer-lannee</guid>
      <description>
Dalle 4K Mini LED, fr&#233;quence de rafra&#238;chissement de 144 Hz, ports HDMI 2.1... Le Xiaomi TV S Mini LED 65 a tout d'un mod&#232;le premium, sauf le prix. Actuellement, Amazon le propose &#224; 599 euros au lieu de 799 euros.
</description>
    </item>
    <item>
      <title>&#171;&#160;Ajustements strat&#233;giques&#160;&#187;, Asus pr&#233;pare une flamb&#233;e des prix d&#232;s le 5 janvier 2026</title>
      <link>https://www.frandroid.com/marques/asus/2924973_ajustements-strategiques-asus-prepare-une-flambee-des-prix-des-le-5-janvier-2026</link>
      <pubDate>Thu, 01 Jan 2026 10:11:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/asus/2924973_ajustements-strategiques-asus-prepare-une-flambee-des-prix-des-le-5-janvier-2026</guid>
      <description>
Souvent critiqu&#233; pour le placement tarifaire, hardi, de certains de ses produits, le ta&#239;wanais Asus souhaite en remettre une couche. Dans un contexte de p&#233;nurie mondiale de m&#233;moire vive, le groupe s'appr&#234;te &#224; mettre en &#339;uvre une hausse notable de ses tarifs pour 2026.
</description>
    </item>
    <item>
      <title>Fin du support Apple : voici les 5 produits d&#233;clar&#233;s obsol&#232;tes ou vintage en 2026</title>
      <link>https://www.frandroid.com/os/ios/2925009_fin-du-support-apple-voici-les-5-produits-declares-obsoletes-ou-vintage-en-2026</link>
      <pubDate>Thu, 01 Jan 2026 10:01:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/ios/2925009_fin-du-support-apple-voici-les-5-produits-declares-obsoletes-ou-vintage-en-2026</guid>
      <description>
Bonne ann&#233;e 2026. Pour f&#234;ter &#231;a, Apple vient de mettre &#224; jour sa "kill list". Si vous poss&#233;dez un iPhone 11 Pro ou le tristement c&#233;l&#232;bre MacBook Air Intel de 2020, mauvaise nouvelle : ils sont d&#233;sormais class&#233;s "Vintage". Concr&#232;tement ? En cas de panne, la r&#233;paration devient une loterie.
</description>
    </item>
    <item>
      <title>The best smart scales for 2026</title>
      <link>https://www.engadget.com/home/smart-home/best-smart-scale-160033523.html?src=rss</link>
      <pubDate>Thu, 01 Jan 2026 10:00:37 +0000</pubDate>
      <guid isPermaLink="false">b2af2a56-de99-4a43-8bd9-d5e576825e83</guid>
      <description>If you are trying to stay on top of your health this year, a smart scale can make the process feel more manageable. These devices log details like body fat, muscle mass and water levels, then sync everything to your phone so you can see patterns instead of guessing. It is an easy way to track changes and stay motivated between workouts or check-ins with your doctor.Some smart scales keep things simple and focus on just your data, while others tie into big fitness platforms or support multiple users under one roof. With so many choices, we pulled together the best smart scales to help you find ...</description>
    </item>
    <item>
      <title>10 Tech Cleanup Tasks for New Year's Day</title>
      <link>https://www.wired.com/story/10-tech-cleanup-tasks-for-new-years-day/</link>
      <pubDate>Thu, 01 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">693cb4b642f512253adf01ae</guid>
      <description>Knock out these simple chores on this day of fresh starts to keep you and your devices humming smoothly.</description>
    </item>
    <item>
      <title>The 12 most exciting cameras to expect in 2026 &#8212; from DJI's first 360 drone to the iPhone 18</title>
      <link>https://www.techradar.com/cameras/the-12-most-exciting-cameras-to-expect-in-2026-from-djis-first-360-drone-to-the-iphone-18</link>
      <pubDate>Thu, 01 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">VNUG4bvbb5CpAMYDU28vRW</guid>
      <description>What can we learn from 2025 as to what new camera gear to expect for 2026? Here are the likely and most exciting launches that could come in the next 12 months...</description>
    </item>
    <item>
      <title>5000 dollars la carte graphique Nvidia GeForce RTX ? Le cauchemar du PC gamer recommence</title>
      <link>https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2924999_5000-dollars-la-carte-graphique-nvidia-geforce-rtx-le-cauchemar-du-pc-gamer-recommence</link>
      <pubDate>Thu, 01 Jan 2026 09:49:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2924999_5000-dollars-la-carte-graphique-nvidia-geforce-rtx-le-cauchemar-du-pc-gamer-recommence</guid>
      <description>
On vous avait pr&#233;venus, mais la r&#233;alit&#233; d&#233;passe la fiction. Une RTX 5090 &#224; 5000 dollars d'ici la fin de l'ann&#233;e ? C'est le sc&#233;nario catastrophe dessin&#233; par les derni&#232;res &#233;tudes de l'industrie. Entre une demande d&#233;lirante pour l'IA et des co&#251;ts de fabrication qui s'envolent, le PC gaming vit une crise d'accessibilit&#233; sans pr&#233;c&#233;dent.
</description>
    </item>
    <item>
      <title>Renault passe devant Stellantis : le pari du 100 % &#233;lectrique a pay&#233;</title>
      <link>https://www.frandroid.com/marques/renault/2924987_renault-passe-devant-stellantis-le-pari-du-100-electrique-a-paye</link>
      <pubDate>Thu, 01 Jan 2026 09:40:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2924987_renault-passe-devant-stellantis-le-pari-du-100-electrique-a-paye</guid>
      <description>
Pour la premi&#232;re fois depuis la fusion PSA-Fiat, Renault est repass&#233; devant Stellantis. Une victoire symbolique, mais brutale, port&#233;e par un succ&#232;s que tout le monde attendait : la Renault 5. Pendant que Stellantis g&#233;rait ses crises, le Losange a d&#233;roul&#233;.
</description>
    </item>
    <item>
      <title>La Poste est victime d&#8217;une nouvelle cyberattaque&#160;: ses services en ligne sont touch&#233;s</title>
      <link>https://www.01net.com/actualites/la-poste-est-victime-dune-nouvelle-cyberattaque-ses-services-en-ligne-sont-touches.html</link>
      <pubDate>Thu, 01 Jan 2026 09:38:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317781</guid>
      <description>Une nouvelle cyberattaque touche La Poste.</description>
    </item>
    <item>
      <title>Panne La Poste et Banque Postale : les sites de nouveau inaccessibles ce 1er janvier</title>
      <link>https://www.frandroid.com/culture-tech/securite-applications/2924977_panne-la-poste-et-banque-postale-les-sites-de-nouveau-inaccessibles-ce-1er-janvier</link>
      <pubDate>Thu, 01 Jan 2026 09:31:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/securite-applications/2924977_panne-la-poste-et-banque-postale-les-sites-de-nouveau-inaccessibles-ce-1er-janvier</guid>
      <description>
Bonne ann&#233;e ? Pas pour tout le monde. Si vous essayez de consulter vos comptes sur La Banque Postale ou de suivre un colis ce matin, c'est le noir complet. &#192; peine remis de l'attaque de No&#235;l, le groupe La Poste subit une nouvelle offensive ce 1er janvier.
</description>
    </item>
    <item>
      <title>Here&#8217;s What It&#8217;s Like to Use Acuity Scheduling for Your Business or Side Hustle (2026)</title>
      <link>https://www.wired.com/story/acuity-scheduling/</link>
      <pubDate>Thu, 01 Jan 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">6942e46a4f4622208e797269</guid>
      <description>The online booking platform aims to streamline scheduling for everything from virtual appointments to workshops.</description>
    </item>
    <item>
      <title>Frais bancaires, d&#233;couvert, retraits et virements, cybers&#233;curit&#233;&#8230; Ce qui change pour les banques en ligne en 2026</title>
      <link>https://www.frandroid.com/services/banque-en-ligne/2922791_frais-bancaires-decouvert-retraits-et-virements-cybersecurite-ce-qui-change-pour-les-banques-en-ligne-en-2026</link>
      <pubDate>Thu, 01 Jan 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/banque-en-ligne/2922791_frais-bancaires-decouvert-retraits-et-virements-cybersecurite-ce-qui-change-pour-les-banques-en-ligne-en-2026</guid>
      <description>
Des frais bancaires en hausse et la red&#233;finition des r&#232;gles du d&#233;couvert ont de quoi faire d&#233;marrer 2026 sous les plus mauvais auspices. Mais les banques en ligne adopteront &#233;galement de bonnes mesures d&#232;s le 1er janvier prochain comme un renforcement des exigences de cybers&#233;curit&#233; pour mieux lutter contre les fraudes.
</description>
    </item>
    <item>
      <title>How to watch Mrs Brown's Boys 2026 New Year's special &#8212; stream second festive installment of long-running sitcom</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/mrs-browns-boys-2026-new-years-special-free</link>
      <pubDate>Thu, 01 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">BbLaXGZiPgWXFEXJR5rWgG</guid>
      <description>Things are getting tense as the gang prepare for an incoming storm. Here's how to watch the Mrs Brown's Boys 2026 New Year's special online and from anywhere.</description>
    </item>
    <item>
      <title>UK drone laws have just changed &#8211; read this now if your drone has a camera</title>
      <link>https://www.techradar.com/cameras/drones/uk-drone-laws-have-just-changed-if-your-drone-has-a-camera-read-this-now</link>
      <pubDate>Thu, 01 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">k2iZMYhPvynYWWCNFreSJj</guid>
      <description>Drone laws in the UK have just changed &#8211;here's everything you need to know.</description>
    </item>
    <item>
      <title>I've tested a bunch of Shark vacuums and they all have the same problem</title>
      <link>https://www.techradar.com/home/vacuums/ive-tested-a-bunch-of-shark-vacuums-and-they-all-have-the-same-problem</link>
      <pubDate>Thu, 01 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">s6GxDAPVGDzKxwiy5qf7bD</guid>
      <description>In Shark's EOY report card, this is the area it should look to improve.</description>
    </item>
    <item>
      <title>5 predictions for AI in 2026 &#8211; what&#8217;s next for ChatGPT, Gemini, and you</title>
      <link>https://www.techradar.com/ai-platforms-assistants/5-predictions-for-ai-in-2026-whats-next-for-chatgpt-gemini-and-you</link>
      <pubDate>Thu, 01 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">eSUNeN9uvCSQyj3kWMMxMJ</guid>
      <description>AI is about to become more embedded in daily life than ever, reshaping how we search, create, communicate, and define what's real.</description>
    </item>
    <item>
      <title>What you need to know about hidden markets to get lucky in love, work, and life</title>
      <link>https://www.fastcompany.com/91452462/hidden-markets-get-lucky-love-work-life</link>
      <pubDate>2026-01-01T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91452462/hidden-markets-get-lucky-love-work-life</guid>
      <description>Some things are doled out by&#160;hidden markets&#160;that do not rely on prices to decide who gets what. 
Below, Judd Kessler shares five key insights from his new book,&#160;Lucky by Design: The Hidden Economics You Need to Get More of What You Want.</description>
    </item>
    <item>
      <title>The leadership stories you cared most about in 2025</title>
      <link>https://www.fastcompany.com/91463946/the-leadership-stories-you-cared-most-about-in-2025</link>
      <pubDate>2026-01-01T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91463946/the-leadership-stories-you-cared-most-about-in-2025</guid>
      <description>It was a turbulent year in the workforce. Here are the traits and trends that defined the last 12 months&#8217; leadership.
The past year saw unprecedented change and turmoil in the labor market, from pandemic-era layoffs to AI fundamentally and tangibly turning the workforce on its head. But it&#8217;s in these times of uncertainty and transition that leadership becomes of paramount importance. In 2025, the very nature of leadership itself morphed along with the times, and specific themes resonated with readers in specific ways. And they&#8217;re bound to remain very much in the game heading into 2026....</description>
    </item>
    <item>
      <title>En 2026, voici comment les vid&#233;oprojecteurs vont vous faire oublier les TV</title>
      <link>https://www.frandroid.com/produits-android/tv-connectee-produits/projecteur/2922621_en-2026-voici-comment-les-videoprojecteurs-vont-vous-faire-oublier-les-tv</link>
      <pubDate>Thu, 01 Jan 2026 08:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/tv-connectee-produits/projecteur/2922621_en-2026-voici-comment-les-videoprojecteurs-vont-vous-faire-oublier-les-tv</guid>
      <description>
En cette p&#233;riode, rien de tel que de faire un petit bilan des tendances de l&#8217;ann&#233;e 2025 et de celles qui devraient marquer 2026 concernant le march&#233; des vid&#233;oprojecteurs.
</description>
    </item>
  </channel>
</rss>
