<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 11 Feb 2026 07:08:00 GMT</lastBuildDate>
    <item>
      <title>Samsung to hold its Galaxy S26 event on February 25</title>
      <link>https://techcrunch.com/2026/02/10/samsung-to-hold-its-galaxy-s26-event-on-february-25/</link>
      <pubDate>Wed, 11 Feb 2026 07:06:44 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3091848</guid>
      <description>Samsung is going to launch S26 lineup just before Mobile World Congress (MWC).</description>
    </item>
    <item>
      <title>Amazon teste discr&#232;tement Alexa+ en France</title>
      <link>https://www.01net.com/actualites/amazon-teste-discretement-alexa-en-france.html</link>
      <pubDate>Wed, 11 Feb 2026 07:01:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325245</guid>
      <description>Amazon a d&#233;ploy&#233; d&#233;but f&#233;vrier Alexa+, la version dop&#233;e &#224; l'IA g&#233;n&#233;rative de l'assistant&#8230; mais uniquement aux &#201;tats-Unis. Ce qui pose la question de savoir quand cette nouveaut&#233; sortira en France. Surprise : c'est d&#233;j&#224; le cas, mais aupr&#232;s d'une poign&#233;e d'utilisateurs dans le cadre d'un test. Amazon a pr&#233;cis&#233; &#224; 01net qu'il n'y avait aucune date pr&#233;cise pour le lancement grand public....</description>
    </item>
    <item>
      <title>We raved about these Ninja air fryers, coffee machines and slushie makers &#8211; and we love them even more at up to 54% off</title>
      <link>https://www.techradar.com/home/small-appliances/we-raved-about-these-ninja-air-fryers-coffee-machines-and-slushie-makers-and-we-love-them-even-more-at-up-to-54-percent-off</link>
      <pubDate>Wed, 11 Feb 2026 06:43:08 +0000</pubDate>
      <guid isPermaLink="false">DL4D8ki7Xt7AbawsTWRuNk</guid>
      <description>Ninja has discounted a heap of its well-reviewed devices on Amazon, with savings of up to AU$281 on some of our favourites, including some fresh releases like the Crispi and the Luxe Cafe Premier.</description>
    </item>
    <item>
      <title>Samsung Unpacked&#160;: heure, lieu, jeu-concours, codes promo&#8230; Tout savoir sur la conf&#233;rence d&#8217;annonce des Galaxy&#160;S26</title>
      <link>https://www.frandroid.com/marques/samsung/2973133_samsung-unpacked-heure-lieu-jeu-concours-codes-promo-tout-savoir-sur-la-conference-dannonce-des-galaxy-s26</link>
      <pubDate>Wed, 11 Feb 2026 06:32:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2973133_samsung-unpacked-heure-lieu-jeu-concours-codes-promo-tout-savoir-sur-la-conference-dannonce-des-galaxy-s26</guid>
      <description>
Plus personne n&#8217;avait de doute, mais Samsung le confirme tout de m&#234;me, la keynote de pr&#233;sentation de ses futurs t&#233;l&#233;phones haut de gamme aura bien lieu le 25&#160;f&#233;vrier &#224; San Francisco.
</description>
    </item>
    <item>
      <title>01net morning&#160;: test de l&#8217;enceinte Echo Dot Max, la mauvaise surprise de la Twingo &#224; 16&#160;000&#160;&#8364;, ChatGPT dans Leboncoin</title>
      <link>https://www.01net.com/actualites/01net-morning-test-de-lenceinte-echo-dot-max-la-mauvaise-surprise-de-la-twingo-a-16-000-e-chatgpt-dans-leboncoin.html</link>
      <pubDate>Wed, 11 Feb 2026 06:30:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325239</guid>
      <description>Bonjour &#224; tous, voici la matinale de 01net ! Qu&#8217;avez-vous manqu&#233; hier ? Retrouvez toute l&#8217;actu &#224; connaitre pour d&#233;marrer la journ&#233;e du bon pied !</description>
    </item>
    <item>
      <title>Pourquoi payer plus ? Ce forfait 5G de 150 Go utilise le r&#233;seau le plus performant de France pour moins de 8 &#8364;/mois</title>
      <link>https://www.frandroid.com/bons-plans/2972657_pourquoi-payer-plus-ce-forfait-5g-de-150-go-utilise-le-reseau-le-plus-performant-de-france-pour-moins-de-8-e-mois</link>
      <pubDate>Wed, 11 Feb 2026 06:20:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2972657_pourquoi-payer-plus-ce-forfait-5g-de-150-go-utilise-le-reseau-le-plus-performant-de-france-pour-moins-de-8-e-mois</guid>
      <description>
150 Go de 5G sur le r&#233;seau class&#233; n&#176;1 pour seulement 7,99 euros ? Ce forfait sans engagement coche toutes les cases, avec en prime une carte SIM &#224; prix cass&#233;.
</description>
    </item>
    <item>
      <title>Nordic Combined at Winter Olympics 2026 Free Streams: TV Channels, Schedule, Preview</title>
      <link>https://www.techradar.com/how-to-watch/sport/nordic-combined-at-winter-olympics-2026-free-streams-milano-cortina</link>
      <pubDate>Wed, 11 Feb 2026 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">wdVFYAGY9DwJbgDEfKqBNd</guid>
      <description>All the ways to watch Winter Olympics Nordic Combined 2026 live streams for FREE, with Johannes Lamparter, Jens Luras Oftebro and Julian Schmid headlining the action.</description>
    </item>
    <item>
      <title>How to watch England vs. West Indies online for free</title>
      <link>https://mashable.com/article/england-west-indies-t20-world-cup-2026-live-stream-for-free</link>
      <pubDate>Wed, 11 Feb 2026 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">02EXzev36WfDV6NJFkN6BNv</guid>
      <description>How to watch T20 World Cup for free. Live stream England vs. West Indies in the 2026 T20 World Cup for free from anywhere in the world.</description>
    </item>
    <item>
      <title>With co-founders leaving and an IPO looming, Elon Musk turns talk to the moon</title>
      <link>https://techcrunch.com/2026/02/10/with-co-founders-leaving-and-an-ipo-looming-elon-musk-turns-talk-to-the-moon/</link>
      <pubDate>Wed, 11 Feb 2026 05:23:26 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3091847</guid>
      <description>According to The New York Times, which reports that it heard the meeting, Musk told employees that xAI needs a lunar manufacturing facility, a factory on the moon that will build AI satellites and fling them into space via a giant catapult.</description>
    </item>
    <item>
      <title>The best Super Bowl ad may not have been an ad at all</title>
      <link>https://www.fastcompany.com/91490618/the-best-super-bowl-ad-may-not-have-been-an-ad-at-all</link>
      <pubDate>2026-02-11T05:23:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91490618/the-best-super-bowl-ad-may-not-have-been-an-ad-at-all</guid>
      <description>Autodesk CMO Dara Treseder unpacks the marketing lessons from a disappointing ad slate.
The Super Bowl LX ad blitz was a big budget highwire act&#8212;from Anthropic&#8217;s shot at OpenAI to Lady Gaga&#8217;s homage to Mr. Rogers and Dunkin&#8217;s nostalgia-fueled celeb fest. Autodesk CMO Dara Treseder breaks down what worked, what didn&#8217;t, and what the ads reveal about where marketing is headed next. Treseder also unpacks the business impact of Bad Bunny&#8217;s halftime show, and what it signals for the NFL and Apple....</description>
    </item>
  </channel>
</rss>
