<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 31 Dec 2025 08:35:27 GMT</lastBuildDate>
    <item>
      <title>Avant 2 ans, le temps d&#8217;&#233;cran laisse des traces durables dans le cerveau des enfants</title>
      <link>https://www.01net.com/actualites/avant-2-ans-le-temps-decran-laisse-des-traces-durables-dans-le-cerveau-des-enfants.html</link>
      <pubDate>Wed, 31 Dec 2025 08:02:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317706</guid>
      <description>Une &#233;tude confirme, s'il en &#233;tait besoin, que limiter le temps d'&#233;cran chez les tr&#232;s jeunes enfants est crucial. En cas de surexposition, les enfants se montrent en effet plus anxieux et moins prompts &#224; prendre des d&#233;cisions.</description>
    </item>
    <item>
      <title>I'm a professional photographer and asked ChatGPT to critique my photos &#8211; here are 4 things I learned</title>
      <link>https://www.techradar.com/cameras/photography/im-a-professional-photographer-and-asked-chatgpt-to-critique-my-photos-here-are-4-things-i-learned</link>
      <pubDate>Wed, 31 Dec 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">DrjUPfDn6q7XyS3cBSLjxH</guid>
      <description>AI can offer some surprisingly insightful feedback on how you can improve your photography, if you know how to prompt it correctly</description>
    </item>
    <item>
      <title>&#199;a sent mauvais pour les PC et les smartphones&#160;: le march&#233; s&#8217;enfonce et les prix s&#8217;envolent</title>
      <link>https://www.01net.com/actualites/ca-sent-mauvais-pour-les-pc-et-les-smartphones-le-marche-senfonce-et-les-prix-senvolent.html</link>
      <pubDate>Wed, 31 Dec 2025 07:30:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317699</guid>
      <description>La situation ne va pas aller en s'am&#233;liorant sur le march&#233; des PC. Les pr&#233;visions pour 2026 &#233;taient d&#233;j&#224; dans le rouge, leur r&#233;vision par IDC les enfoncent encore davantage dans le cramoisi. Premi&#232;re cause de cette mauvaise fortune : la demande toujours plus folle en m&#233;moire vive par les acteurs de l'IA.</description>
    </item>
    <item>
      <title>Ce laptop gaming surperformant (RTX 5070 Ti + Ryzen 9 + &#233;cran OLED QHD+ 240 Hz) perd plus de 450 &#8364; de son prix</title>
      <link>https://www.frandroid.com/bons-plans/2922977_ce-laptop-gaming-surperformant-rtx-5070-ti-ryzen-9-ecran-oled-qhd-240-hz-perd-plus-de-450-e-de-son-prix</link>
      <pubDate>Wed, 31 Dec 2025 07:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2922977_ce-laptop-gaming-surperformant-rtx-5070-ti-ryzen-9-ecran-oled-qhd-240-hz-perd-plus-de-450-e-de-son-prix</guid>
      <description>
Le Lenovo Legion 7 Pro Gen 10 est un monstre de puissance qui coche toutes les cases pour jouer sans le moindre compromis. Il voit son tarif fondre, passant de 2&#8239;669&#8239;euros &#224; 2&#8239;215&#8239;euros. 
</description>
    </item>
    <item>
      <title>Google Chrome&#160;: pourquoi vous allez adorer le nouveau mode lecture sur Android</title>
      <link>https://www.01net.com/actualites/google-chrome-pourquoi-vous-allez-adorer-nouveau-mode-lecture-android.html</link>
      <pubDate>Wed, 31 Dec 2025 07:13:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317709</guid>
      <description>Google a retravaill&#233; le mode lecture de Chrome sur Android pour le rendre beaucoup plus agr&#233;able &#224; utiliser. Pr&#233;sentation.</description>
    </item>
    <item>
      <title>Samsung veut analyser le cerveau pour d&#233;tecter le d&#233;clin cognitif ou Alzheimer</title>
      <link>https://www.01net.com/actualites/samsung-regarde-du-cote-du-cerveau-pour-la-detection-precoce-du-declin-cognitif.html</link>
      <pubDate>Wed, 31 Dec 2025 07:01:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317678</guid>
      <description>Les donn&#233;es collect&#233;es en tout temps par les montres connect&#233;es et autres appareils sont un tr&#233;sor d'informations qu'il est possible d'exploiter pour d&#233;tecter des troubles de sant&#233;. L'analyse des donn&#233;es provenant de capteurs de fr&#233;quence cardiaque permettent par exemple d'identifier des probl&#232;mes de fibrillation auriculaire. Samsung veut aller un cran plus loin avec un futur service qui pourrait d&#233;tecter le d&#233;clin cognitif....</description>
    </item>
    <item>
      <title>Dyson's latest flagship vacuum isn't great &#8211; but these 2 particular innovations are genius</title>
      <link>https://www.techradar.com/home/vacuums/dysons-latest-flagship-vacuum-isnt-great-but-these-2-particular-innovations-are-genius</link>
      <pubDate>Wed, 31 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">kb2TsTBrP4R3TvsALqTiAY</guid>
      <description>These innovations couldn't save the V16 &#8211; but they could shine in the next flagship vacuum.</description>
    </item>
  </channel>
</rss>
