<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 10 Nov 2025 07:33:47 GMT</lastBuildDate>
    <item>
      <title>Moulinex Companion : le prix du roi des robots cuiseurs fond en ce pr&#233;-Black Friday (-150 &#8364;)</title>
      <link>https://www.frandroid.com/bons-plans/2860519_moulinex-companion-le-prix-du-roi-des-robots-cuiseurs-fond-en-ce-pre-black-friday-150-e</link>
      <pubDate>Mon, 10 Nov 2025 07:22:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860519_moulinex-companion-le-prix-du-roi-des-robots-cuiseurs-fond-en-ce-pre-black-friday-150-e</guid>
      <description>
Il p&#233;trit, &#233;mince, mijote et bien plus : le Moulinex Companion est l'arme secr&#232;te de celles et ceux qui n'ont pas le temps de cuisiner au quotidien. Pendant le pr&#233;-Black Friday, ce robot cuiseur XL est affich&#233; &#224; 449,99 euros au lieu de 599,99 euros sur Amazon. 
</description>
    </item>
    <item>
      <title>Un GPS a envoy&#233; ce retrait&#233; &#224; 2000 km de son rendez-vous, jusqu&#8217;en Croatie</title>
      <link>https://www.01net.com/actualites/gps-defaillant-envoye-francais-2000-kmrendez-vous-croatie.html</link>
      <pubDate>Mon, 10 Nov 2025 07:20:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306555</guid>
      <description>Il devait parcourir 25 kilom&#232;tres, il en a fait plus de 2 000. Parti de Ch&#226;tillon-sur-Thouet pour un simple rendez-vous m&#233;dical, un homme de 85 ans s&#8217;est retrouv&#233;&#8230; en Croatie. Il met en cause son GPS, auquel il s'est fi&#233; sans r&#233;fl&#233;chir.</description>
    </item>
    <item>
      <title>On a compl&#232;tement revu les tests d&#8217;autonomie du 01lab, voici ce que &#231;a change pour vous</title>
      <link>https://www.01net.com/actualites/on-a-completement-revu-les-tests-dautonomie-du-01lab-voici-ce-que-ca-change-pour-vous.html</link>
      <pubDate>Mon, 10 Nov 2025 07:13:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1305054</guid>
      <description>Apr&#232;s de bons et loyaux services, les protocoles d'&#233;valuation de l'autonomie des produits en test au 01lab sont remplac&#233;s par une nouvelle version mise au go&#251;t du jour. Gr&#226;ce &#224; lui, nos tests gagnent en pertinence &#224; l'aide de mesures plus pr&#233;cises et plus r&#233;alistes.</description>
    </item>
    <item>
      <title>Google Pixel 10 Pro XL vs iPhone 16 Pro Max&#160;: quel t&#233;l&#233;phone haut de gamme choisir ?</title>
      <link>https://www.frandroid.com/versus/2816515_google-pixel-10-pro-xl-vs-iphone-16-pro-max-quel-telephone-haut-de-gamme-choisir</link>
      <pubDate>Mon, 10 Nov 2025 07:05:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/versus/2816515_google-pixel-10-pro-xl-vs-iphone-16-pro-max-quel-telephone-haut-de-gamme-choisir</guid>
      <description>
Google positionne ses sorties de fa&#231;on &#224; ce que son dernier-n&#233; arrive &#224; la toute fin du cycle de vie de ses principaux concurrents. En l'occurrence, l'iPhone 16 Pro Max fait un beau rival pour le nouveau flagship : qui repartira vainqueur&#160;?
</description>
    </item>
    <item>
      <title>Test du Ricoh GR IV : un vrai compact expert qui a l&#8217;art de se faire oublier</title>
      <link>https://www.frandroid.com/marques/ricoh/2857027_test-du-ricoh-gr-iv-un-vrai-compact-expert-qui-a-lart-de-se-faire-oublier</link>
      <pubDate>Mon, 10 Nov 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/ricoh/2857027_test-du-ricoh-gr-iv-un-vrai-compact-expert-qui-a-lart-de-se-faire-oublier</guid>
      <description>
Avec son nouveau capteur APS-C BSI de 25 MP, sa stabilisation m&#233;canique sur cinq axes et son objectif 28 mm f/2,8 redessin&#233;, le Ricoh GR IV ne bouleverse pas la formule &#8212; il la m&#251;rit. C&#8217;est un outil pens&#233; pour celles et ceux qui photographient beaucoup, souvent, discr&#232;tement. Dans un monde satur&#233; de capteurs d'un milliard de pixels et de bo&#238;tiers bard&#233;s d&#8217;&#233;crans articul&#233;s, le GR IV revendique l&#8217;essence m&#234;me de la photographie : la simplicit&#233;.
...</description>
    </item>
    <item>
      <title>Apple pourrait s&#8217;&#233;manciper des op&#233;rateurs classiques en misant tout sur la connectivit&#233; satellite</title>
      <link>https://www.frandroid.com/marques/apple/2861599_apple-pourrait-semanciper-des-operateurs-classiques-en-misant-tout-sur-la-connectivite-satellite</link>
      <pubDate>Mon, 10 Nov 2025 06:40:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2861599_apple-pourrait-semanciper-des-operateurs-classiques-en-misant-tout-sur-la-connectivite-satellite</guid>
      <description>
Depuis l&#8217;iPhone&#160;14, Apple n&#8217;a cess&#233; d&#8217;enrichir son offre de connectivit&#233; par satellite. Mais l&#8217;entreprise est loin d&#8217;en avoir fini avec ce chapitre, si l&#8217;on en croit les derni&#232;res rumeurs.
</description>
    </item>
    <item>
      <title>Le prix de l&#8217;iPad Air 11 M3 est au plus bas &#224; l&#8217;occasion du pr&#233;-Black Friday sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2859359_le-prix-de-lipad-air-11-m3-est-au-plus-bas-a-loccasion-du-pre-black-friday-sur-amazon</link>
      <pubDate>Mon, 10 Nov 2025 06:35:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2859359_le-prix-de-lipad-air-11-m3-est-au-plus-bas-a-loccasion-du-pre-black-friday-sur-amazon</guid>
      <description>
L'iPad Air M3 est une tablette tactile si puissante qu'elle devient une bonne alternative au MacBook Air, surtout qu'elle est &#224; 599 euros au lieu de 719 euros sur Amazon.
</description>
    </item>
    <item>
      <title>01net morning&#160;: essai de la nouvelle Seat Ibiza, la valeur de votre carte bancaire sur le dark web, comment installer Chrome OS Flex sur un vieux PC</title>
      <link>https://www.01net.com/actualites/01net-morning-essai-de-la-nouvelle-seat-ibiza-la-valeur-de-votre-carte-bancaire-sur-le-dark-web-comment-installer-chrome-os-flex-sur-un-vieux-pc.html</link>
      <pubDate>Mon, 10 Nov 2025 06:30:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306537</guid>
      <description>Bonjour &#224; tous, voici la matinale de 01net ! Qu&#8217;avez-vous manqu&#233; hier ? Retrouvez toute l&#8217;actu &#224; connaitre pour d&#233;marrer la journ&#233;e du bon pied !</description>
    </item>
  </channel>
</rss>
