<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 23 Jan 2026 15:31:17 GMT</lastBuildDate>
    <item>
      <title>OpenAI chief Sam Altman plans India visit as AI leaders converge in New Delhi: sources</title>
      <link>https://techcrunch.com/2026/01/23/openai-chief-sam-altman-plans-india-visit-as-ai-leaders-converge-in-new-delhi-sources/</link>
      <pubDate>Fri, 23 Jan 2026 15:30:09 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3085456</guid>
      <description>Sam Altman is set for his first India visit in nearly a year.</description>
    </item>
    <item>
      <title>Fortinet FortiGate devices hit in automated attacks which create rogue accounts and steal firewall data</title>
      <link>https://www.techradar.com/pro/security/fortinet-fortigate-devices-hit-in-automated-attacks-which-create-rogue-accounts-and-steal-firewall-data</link>
      <pubDate>Fri, 23 Jan 2026 15:25:00 +0000</pubDate>
      <guid isPermaLink="false">vajoKuUMP7ioEsCd8JbwUJ</guid>
      <description>A recent patch is apparently not working particularly well, and Fortinet is already working on another.</description>
    </item>
    <item>
      <title>The end of the Sony era in TVs</title>
      <link>https://www.theverge.com/podcast/866619/sony-tcl-tvs-chatgpt-ads-vergecast</link>
      <pubDate>2026-01-23T10:20:10-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=866619</guid>
      <description>There aren't many tech companies that can claim Sony's level of influence in how we live our lives. From the Walkman to the PlayStation to the Trinitron, Sony has been making excellent gadgets in multiple categories for decades, which makes this week's news just a little sad. Sony's new joint venture with TCL isn't the [&#8230;]</description>
    </item>
    <item>
      <title>Ce bug des smartphones Pixel est un cauchemar pour la vie priv&#233;e</title>
      <link>https://www.frandroid.com/marques/google/2953447_ce-bug-des-smartphones-pixel-est-un-cauchemar-pour-la-vie-privee</link>
      <pubDate>Fri, 23 Jan 2026 15:18:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2953447_ce-bug-des-smartphones-pixel-est-un-cauchemar-pour-la-vie-privee</guid>
      <description>
Quelques utilisateurs sont touch&#233;s par un probl&#232;me tr&#232;s &#233;trange. De quoi donner des sueurs froides chaque fois que quelqu'un vous appelle et que vous ne d&#233;crochez pas.
</description>
    </item>
    <item>
      <title>Cracking the AI code: realizing AI's true value in finance</title>
      <link>https://www.techradar.com/pro/cracking-the-ai-code-realizing-ais-true-value-in-finance</link>
      <pubDate>Fri, 23 Jan 2026 15:17:48 +0000</pubDate>
      <guid isPermaLink="false">9LZpk6rNfmrwNVHkRaxARP</guid>
      <description>AI's role in finance is evolving, and finance teams must now focus on delivering tangible results.</description>
    </item>
    <item>
      <title>Raspberry Pi d&#233;gaine un nouveau produit, et ce n&#8217;est pas un PC</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/2953615_raspberry-pi-degaine-un-nouveau-produit-et-ce-nest-pas-un-pc</link>
      <pubDate>Fri, 23 Jan 2026 15:17:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/2953615_raspberry-pi-degaine-un-nouveau-produit-et-ce-nest-pas-un-pc</guid>
      <description>
Loin est le temps de la simple petite carte PC &#224; 40 dollars, Raspberry continue d'&#233;tendre son &#233;cosyst&#232;me de produits. Cette fois, c'est une cl&#233; USB, et ce n'est pas sans int&#233;r&#234;t.
</description>
    </item>
    <item>
      <title>Voici quand vous verrez encore plus de publicit&#233;s sur l&#8217;App Store</title>
      <link>https://www.frandroid.com/marques/apple/2953585_voici-quand-vous-verrez-encore-plus-de-publicites-sur-lapp-store</link>
      <pubDate>Fri, 23 Jan 2026 15:17:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2953585_voici-quand-vous-verrez-encore-plus-de-publicites-sur-lapp-store</guid>
      <description>
Apr&#232;s avoir annonc&#233; l'arriv&#233;e de publicit&#233;s suppl&#233;mentaires dans l'App Store, Apple d&#233;voile quand nous y aurons droit.
</description>
    </item>
    <item>
      <title>Gaze Deeply Into Nature With These Award-Winning Ecology Photos</title>
      <link>https://gizmodo.com/gaze-deeply-into-nature-with-these-award-winning-ecology-photos-2000713286</link>
      <pubDate>Fri, 23 Jan 2026 15:15:02 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000713286</guid>
      <description>Winning shots from the Capturing Ecology competition highlight the complex relationships that shape ecosystems.</description>
    </item>
    <item>
      <title>Epson EcoTank ET-4950 series review: I can&#8217;t find another mid-price printer so loaded with features and ink</title>
      <link>https://www.techradar.com/pro/epson-ecotank-et-4950-ink-tank-printer-review</link>
      <pubDate>Fri, 23 Jan 2026 15:15:00 +0000</pubDate>
      <guid isPermaLink="false">jhV7RWNSuFyZqynhKLAY6F</guid>
      <description>Epson&#8217;s feature-packed 4-in-1 can even duplex scan.</description>
    </item>
    <item>
      <title>Anbernic&#8217;s next wireless controller adds a screen and heart rate monitoring</title>
      <link>https://www.theverge.com/tech/866600/anbernic-rg-g01-smart-wireless-gaming-controller-heart-rate-sensor-display</link>
      <pubDate>2026-01-23T10:11:26-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=866600</guid>
      <description>Anbernic has announced its second wireless controller through a teaser video on YouTube highlighting its features. The company's first gamepad, the RG P01, offered features like Hall effect triggers and joysticks for just $18. Pricing for the new Anbernic RG G01 hasn't been revealed, but it may be more expensive due to several upgrades, including [&#8230;]...</description>
    </item>
    <item>
      <title>Les g&#233;ants de la tech d&#233;pensent sans compter pour se mettre l&#8217;administration Trump dans la poche</title>
      <link>https://www.01net.com/actualites/les-geants-de-la-tech-depensent-sans-compter-pour-se-mettre-ladministration-trump-dans-la-poche.html</link>
      <pubDate>Fri, 23 Jan 2026 15:10:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322216</guid>
      <description>Les grandes entreprises de la tech ont d&#233;pens&#233; sans compter pour &#234;tre dans les petits papiers de l'administration Trump. Les d&#233;penses de lobbying ont &#233;t&#233; d&#233;voil&#233;es et elles sont globalement en hausse. Meta, Amazon et Google ont &#233;t&#233; les plus d&#233;pensiers l'an dernier.</description>
    </item>
    <item>
      <title>1348: Ex Voto, an action game featuring a female knight on a quest to save Jennifer English in medieval Italy, sounds like just the game for me, and it's launching in March</title>
      <link>https://www.techradar.com/gaming/1348-ex-voto-an-action-game-featuring-a-female-knight-on-a-quest-to-save-jennifer-english-in-medieval-italy-sounds-like-just-the-game-for-me-and-its-launching-in-march</link>
      <pubDate>Fri, 23 Jan 2026 15:07:31 +0000</pubDate>
      <guid isPermaLink="false">a5yssoLryAKSPn7UPocCuP</guid>
      <description>Indie studio Sedleo and publisher Dear Villagers have announced that their medieval action-adventure game 1348: Ex Voto will launch on March 12, 2026, for PC and PS5.</description>
    </item>
    <item>
      <title>&#171; C&#8217;est extr&#234;mement simple de le sortir pour shooter &#187; : nous avons mis le Fujifilm X Half dans les mains de l&#8217;un de nos lecteurs [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/2891267_cest-extremement-simple-de-le-sortir-pour-shooter-nous-avons-mis-le-fujifilm-x-half-dans-les-mains-de-lun-de-nos-lecteurs</link>
      <pubDate>Fri, 23 Jan 2026 15:05:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2891267_cest-extremement-simple-de-le-sortir-pour-shooter-nous-avons-mis-le-fujifilm-x-half-dans-les-mains-de-lun-de-nos-lecteurs</guid>
      <description>
Tent&#233; par l'effet vintage du Fujifilm X Half ? Ce petit bo&#238;tier au rendu argentique est propos&#233; &#224; 799 euros par le constructeur. Mais est-il fait pour vous ? Pour le savoir, nous l'avons confi&#233; &#224; l'un de nos lecteurs. 
</description>
    </item>
    <item>
      <title>'We have initiated an immediate internal review': Asus responds to worries about AMD Ryzen 9800X3D CPUs dying in its motherboards</title>
      <link>https://www.techradar.com/computing/cpu/we-have-initiated-an-immediate-internal-review-asus-responds-to-worries-about-amd-ryzen-9800x3d-cpus-dying-in-its-motherboards</link>
      <pubDate>Fri, 23 Jan 2026 15:01:06 +0000</pubDate>
      <guid isPermaLink="false">GK8x8tvFsCUVYfnzS3gDTR</guid>
      <description>Following past issues with ASRock motherboards, we're now seeing an uptick in reports of problems with Asus boards.</description>
    </item>
    <item>
      <title>Best Action Cameras (2026), Tested and Reviewed</title>
      <link>https://www.wired.com/gallery/best-action-cameras/</link>
      <pubDate>Fri, 23 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">5d9b71b4647bad00082493ab</guid>
      <description>Gearing up to shred the slopes or dive into the seas? These photography tools are made for danger.</description>
    </item>
    <item>
      <title>Influencers are pushing suspicious peptides. How much are you willing to risk?</title>
      <link>https://www.theverge.com/column/866577/optimizer-peptides-compounding-pharmacies-glp-3-retatrutide-influencers-wellness-wild-west</link>
      <pubDate>2026-01-23T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=866577</guid>
      <description>This is Optimizer, a weekly newsletter sent every Friday from Verge senior reviewer Victoria Song that dissects and discusses the latest gizmos and potions that swear they're going to change your life. Optimizer arrives in our subscribers' inboxes at 10AM ET. Opt in for Optimizer here. On TikTok, it's disturbingly easy to find videos of [&#8230;]</description>
    </item>
    <item>
      <title>Only 1 week left (or until the first 500 passes are gone): The first TechCrunch Disrupt 2026 ticket discount is ending</title>
      <link>https://techcrunch.com/2026/01/23/only-1-week-left-or-until-the-first-500-passes-are-gone-the-first-disrupt-2026-ticket-discount-is-ending/</link>
      <pubDate>Fri, 23 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3085434</guid>
      <description>Register now&#160;to&#160;save up to $680 on your TechCrunch Disrupt 2026 pass and get a second ticket at 50% off.&#160;This offer ends&#160;next week on January 30, or once the first&#160;500 tickets&#160;are claimed &#8212; whichever comes first.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Saturday, January 24 (game #1461)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-24-january-2026</link>
      <pubDate>Fri, 23 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">LG7eRrvKQ73FS6y7P693ZR</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Saturday, January 24 (game #692)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-24-january-2026</link>
      <pubDate>Fri, 23 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">ptgH89a2kcjQiGpLRrcU5L</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Saturday, January 24 (game #958)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-24-january-2026</link>
      <pubDate>Fri, 23 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">9vThBWefGqvjV4QcMhyGVH</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>Die My Love missing a best cinematography nod is the most outrageous 2026 Oscars snub &#8212; but Seamus McGarvey's starter camera kit is exactly what any budding filmmaker needs</title>
      <link>https://www.techradar.com/streaming/entertainment/die-my-love-missing-a-best-cinematography-nod-is-the-most-outrageous-2026-oscars-snub-but-seamus-mcgarveys-starter-camera-kit-is-exactly-what-any-budding-filmmaker-needs</link>
      <pubDate>Fri, 23 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">Xu9QVcRVamFghTfzt3TWwn</guid>
      <description>I'm furious that Die My Love is missing from this year's Oscars lineup, but for cinematographer Seamus McGarvey, the magic is in 'how we look and feel, not what we use to shoot with'.</description>
    </item>
    <item>
      <title>7 new movies and TV shows to watch on Netflix, Prime Video, HBO Max, and more this weekend (January 23)</title>
      <link>https://www.techradar.com/streaming/7-new-movies-and-tv-shows-to-watch-on-netflix-prime-video-hbo-max-and-more-this-weekend-january-23</link>
      <pubDate>Fri, 23 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">rNH5xugMqWX9vUSkEgNrzG</guid>
      <description>From anticipated new shows to the streaming debut of two movie biopics, here's what you'll want to watch this weekend.</description>
    </item>
    <item>
      <title>Trois c&#226;bles sous-marins sabot&#233;s en Europe&#160;: la Finlande soup&#231;onne la Russie</title>
      <link>https://www.01net.com/actualites/trois-cables-sous-marins-ete-sabotes-un-apres-autre-europe.html</link>
      <pubDate>Fri, 23 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318514</guid>
      <description>En quelques jours, trois c&#226;bles sous-marins ont &#233;t&#233; sectionn&#233;s en mer Baltique. Deux navires ont &#233;t&#233; identifi&#233;s comme &#233;tant potentiellement &#224; l'origine des incidents, dont un cargo charg&#233; d'acier russe. Les autorit&#233;s redoutent une op&#233;ration de sabotage en provenance de la Russie.</description>
    </item>
    <item>
      <title>The human paradox at the center of modern cyber resilience</title>
      <link>https://www.techradar.com/pro/the-human-paradox-at-the-center-of-modern-cyber-resilience</link>
      <pubDate>Fri, 23 Jan 2026 14:56:52 +0000</pubDate>
      <guid isPermaLink="false">KGCviFNB34Dps3hhKfYw7m</guid>
      <description>Human workers are key to preventing cyberattacks and operating alongside AI to enhance cyber resilience.</description>
    </item>
    <item>
      <title>On a vu la premi&#232;re voiture &#233;lectrique chinoise qui conduit seule &#224; 120 km/h : la GAC Hyptec A800</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2904239_on-a-vu-gac-hyptec-a800-la-premiere-voiture-electrique-chinoise-qui-conduit-seule-a-120-km-h</link>
      <pubDate>Fri, 23 Jan 2026 14:51:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2904239_on-a-vu-gac-hyptec-a800-la-premiere-voiture-electrique-chinoise-qui-conduit-seule-a-120-km-h</guid>
      <description>
On a pu monter &#224; bord de la voiture &#233;lectrique chinoise qui a obtenu la premi&#232;re licence locale pour conduite en autonomie &#224; 120 km/h, la GAC Hyptec A800. Voici notre premier avis.
</description>
    </item>
    <item>
      <title>14 of the best deals from the Amazon UK weekend sale &#8211; I've picked the top tech offers from &#163;13.99</title>
      <link>https://www.techradar.com/tech/14-of-the-best-deals-from-the-amazon-uk-weekend-sale-ive-picked-the-top-tech-offers-from-gbp13-99</link>
      <pubDate>Fri, 23 Jan 2026 14:49:20 +0000</pubDate>
      <guid isPermaLink="false">8PP5DGW4E4r3eY7wWRJznj</guid>
      <description>I've searched through this weekend's sale at Amazon UK and picked out 14 of the best tech offers that start from just &#163;13.99.</description>
    </item>
    <item>
      <title>L&#8217;une des meilleures enceintes portables connect&#233;es de chez Bose revient &#224; un super prix pour les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2606127_lune-des-meilleures-enceintes-portables-connectees-de-chez-bose-revient-a-un-super-prix-pour-les-soldes</link>
      <pubDate>Fri, 23 Jan 2026 14:46:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2606127_lune-des-meilleures-enceintes-portables-connectees-de-chez-bose-revient-a-un-super-prix-pour-les-soldes</guid>
      <description>
Les soldes d'hiver continuent et pour l'occasion Amazon l&#226;che une belle offre pour une enceinte intelligente. La puissante et mobile Bose Portable Smart Speaker passe de 419 euros lors de son lancement &#224; 239 euros.
</description>
    </item>
    <item>
      <title>Malaysia lifts ban on Grok after taking X at its word</title>
      <link>https://www.engadget.com/ai/malaysia-lifts-ban-on-grok-after-taking-x-at-its-word-144457468.html?src=rss</link>
      <pubDate>Fri, 23 Jan 2026 14:44:57 +0000</pubDate>
      <guid isPermaLink="false">5cbaca85-e2d0-4740-8f24-9f356e2edd20</guid>
      <description>After being one of the first countries in the world to block Elon Musk&#8217;s Grok chatbot, Malaysia has now lifted its ban. Along with Indonesia, the country moved swiftly to temporarily halt access to X's frequently controversial AI chatbot earlier this month, after multiple reports emerged of it being used to generate deepfake sexualized images of people, including women and children.
At the time, the Malaysian Communications and Multimedia Commission (MCMC) said the restrictions would remain in place until X Corp and parent xAI could prove they had enforced the necessary safeguards against misu...</description>
    </item>
    <item>
      <title>&#171;&#160;Vers une hausse massive des prix&#160;&#187; : pourquoi vous ne trouverez bient&#244;t plus de GPU Nvidia au prix officiel</title>
      <link>https://www.frandroid.com/marques/nvidia/2953489_vers-une-hausse-massive-des-prix-pourquoi-vous-ne-trouverez-bientot-plus-de-gpu-nvidia-au-prix-officiel</link>
      <pubDate>Fri, 23 Jan 2026 14:40:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2953489_vers-une-hausse-massive-des-prix-pourquoi-vous-ne-trouverez-bientot-plus-de-gpu-nvidia-au-prix-officiel</guid>
      <description>
La notion de prix conseill&#233; n'a d&#233;cid&#233;ment plus aucun sens alors que Nvidia aurait abandonn&#233; un programme incitant ses partenaires &#224; le pratiquer.
</description>
    </item>
    <item>
      <title>AI labs wage a reputational knife fight at Davos</title>
      <link>https://www.theverge.com/column/866573/ai-labs-wage-a-reputational-knife-fight-at-davos</link>
      <pubDate>2026-01-23T09:40:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=866573</guid>
      <description>This is an excerpt of Sources by Alex Heath, a newsletter about AI and the tech industry, syndicated just for The Verge subscribers once a week. The leaders of the three preeminent frontier AI labs spent this week at the World Economic Forum in Davos, Switzerland, taking shots at each other like candidates in a [&#8230;]</description>
    </item>
    <item>
      <title>Samsung a gaff&#233; : l&#8217;&#233;norme nouveaut&#233; &#233;cran du Galaxy S26 Ultra confirm&#233;e par erreur</title>
      <link>https://www.frandroid.com/marques/samsung/2953581_samsung-a-gaffe-lenorme-nouveaute-ecran-du-galaxy-s26-ultra-confirmee-par-erreur</link>
      <pubDate>Fri, 23 Jan 2026 14:38:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2953581_samsung-a-gaffe-lenorme-nouveaute-ecran-du-galaxy-s26-ultra-confirmee-par-erreur</guid>
      <description>
Samsung a laiss&#233; appara&#238;tre un indice explicite sur une fonctionnalit&#233; tr&#232;s attendue de son prochain smartphone haut de gamme. Une capture publi&#233;e sur son propre site montre en effet la pr&#233;sence de l&#8217;&#171; Affichage confidentiel &#187; pour One UI 8.5. 
</description>
    </item>
    <item>
      <title>Get the 512GB Samsung P9 microSD Express card for 33 percent off right now</title>
      <link>https://www.engadget.com/deals/get-the-512gb-samsung-p9-microsd-express-card-for-33-percent-off-right-now-143849920.html?src=rss</link>
      <pubDate>Fri, 23 Jan 2026 14:35:36 +0000</pubDate>
      <guid isPermaLink="false">b7c1c9b1-8762-4b3b-bd34-558e13eba66f</guid>
      <description>MicroSD Express cards are still a little hard to find, considering they're pretty new and only really started becoming popular last year once the Switch 2 came out. These upgraded versions of microSD cards are the only ones compatible with the Switch 2 for expanding its storage, so if you're already starting to feel the crunch on your console, it's worth picking one up. Samsung's P9 microSD Express card is on sale right now &#8212; you can grab the 512GB version of $80, which is 33 percent off and one of the best prices we've seen.


The P9 boasts transfer speeds of up to 800MB/s, making moving game...</description>
    </item>
    <item>
      <title>Linux users targeted as crypto-stealing malware hits Snap packages - here's how to stay safe</title>
      <link>https://www.techradar.com/pro/security/linux-users-targeted-as-crypto-stealing-malware-hits-snap-packages-heres-how-to-stay-safe</link>
      <pubDate>Fri, 23 Jan 2026 14:35:00 +0000</pubDate>
      <guid isPermaLink="false">GBsAWUHUfTiLwV9iFqQ29k</guid>
      <description>There's a "relentless" campaign on the Ubuntu app store, and people are losing their crypto, experts warn.</description>
    </item>
    <item>
      <title>Tesla finally kills Autopilot in a bid to boost FSD subscriptions</title>
      <link>https://www.theverge.com/transportation/866586/tesla-kills-autopilot-autosteer-fsd-subscription</link>
      <pubDate>2026-01-23T09:34:21-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=866586</guid>
      <description>Tesla scrapped its Autopilot driver assist feature that used to come standard in new vehicles, as it attempts to steer customers to its newly subscription-only Full Self-Driving (FSD) system. According to Electrek, the company removed Basic Autopilot as a standard feature from new Model 3 and Model Y vehicles in North America. That means in [&#8230;]</description>
    </item>
    <item>
      <title>Quel forfait mobile pour le Japon&#8201;? Nos conseils pour communiquer et rester connect&#233;</title>
      <link>https://www.frandroid.com/telecom/forfait-mobile/1945544_quel-forfait-mobile-pour-le-japon-nos-conseils-pour-communiquer-et-rester-connecte</link>
      <pubDate>Fri, 23 Jan 2026 14:30:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/forfait-mobile/1945544_quel-forfait-mobile-pour-le-japon-nos-conseils-pour-communiquer-et-rester-connecte</guid>
      <description>
Vous avez pr&#233;vu un voyage au Japon, mais vous souhaitez savoir comment vous allez pouvoir communiquer avec vos proches rest&#233;s en France sans en payer le prix fort ? Voici les meilleurs forfaits pour le Japon.
</description>
    </item>
    <item>
      <title>This reduction would 'offset the initial cost of the device': New research argues for health services giving out Apple Watches to patients for free &#8212; here's why</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/this-reduction-would-offset-the-initial-cost-of-the-device-new-research-argues-for-health-services-giving-out-apple-watches-to-patients-for-free-heres-why</link>
      <pubDate>Fri, 23 Jan 2026 14:29:20 +0000</pubDate>
      <guid isPermaLink="false">RtS3knQHS9bfpdJUDjp59K</guid>
      <description>Science confirms what we knew all along: smartwatches are literal lifesavers.</description>
    </item>
    <item>
      <title>Gemini peut d&#233;sormais vraiment vous aider &#224; r&#233;viser le bac</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2953351_gemini-peut-desormais-vraiment-vous-aider-a-reviser-le-bac</link>
      <pubDate>Fri, 23 Jan 2026 14:26:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2953351_gemini-peut-desormais-vraiment-vous-aider-a-reviser-le-bac</guid>
      <description>
Google n'en finit plus d'ajouter des fonctions &#224; son IA Gemini. Bien consciente que ChatGPT est tr&#232;s utilis&#233; pour les r&#233;visions, la firme propose d&#233;sormais un mode sp&#233;cial pour Gemini.
</description>
    </item>
    <item>
      <title>Le Tesla Model Y vient de s&#8217;am&#233;liorer : voici ce qui change (et ce qu&#8217;il manque encore)</title>
      <link>https://www.frandroid.com/marques/tesla/2953415_le-tesla-model-y-vient-de-sameliorer-voici-ce-qui-change-et-ce-quil-manque-encore</link>
      <pubDate>Fri, 23 Jan 2026 14:22:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2953415_le-tesla-model-y-vient-de-sameliorer-voici-ce-qui-change-et-ce-quil-manque-encore</guid>
      <description>
Ce n'&#233;tait qu'une question de temps : apr&#232;s la Chine et les &#201;tats-Unis, le Tesla Model Y s'am&#233;liore subtilement en Europe, notamment en qualit&#233; per&#231;ue. Dommage : les versions 7 places et les nouvelles batteries, dont l'arriv&#233;e semble imminente, manquent &#224; l'appel.
</description>
    </item>
    <item>
      <title>Soldes montres connect&#233;es : les 14 promotions pour &#234;tre &#224; l&#8217;heure &#224; ses s&#233;ances de sport ! Voici notre top des meilleurs bons plans</title>
      <link>https://www.frandroid.com/bons-plans/2937331_soldes-montres-connectees-les-14-promotions-pour-etre-a-lheure-a-ses-seances-de-sport-voici-notre-top-des-meilleurs-bons-plans</link>
      <pubDate>Fri, 23 Jan 2026 14:19:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2937331_soldes-montres-connectees-les-14-promotions-pour-etre-a-lheure-a-ses-seances-de-sport-voici-notre-top-des-meilleurs-bons-plans</guid>
      <description>
Les soldes d'hiver permettent de faire de bonnes affaires sur de nombreux produits Tech, dont les montres connect&#233;es ! Ces accessoires lifestyle &amp; sport profitent eux aussi d&#8217;une vague de promotions : voici les offres &#224; retenir.  
</description>
    </item>
    <item>
      <title>Apple pourrait d&#233;voiler tr&#232;s rapidement de nouveaux MacBook Pro</title>
      <link>https://www.01net.com/actualites/apple-pourrait-devoiler-tres-rapidement-de-nouveaux-macbook-pro.html</link>
      <pubDate>Fri, 23 Jan 2026 14:15:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322197</guid>
      <description>Apple pr&#233;pare tr&#232;s certainement de nouveaux MacBook Pro. Le constructeur organise non pas une keynote, mais une &#171;&#160;Apple Experience &#187; la semaine prochaine, durant laquelle seront convi&#233;s des cr&#233;ateurs. Un moment id&#233;al pour leur pr&#233;senter le nouvel abonnement Creator Studio&#8230; et pourquoi pas des portables in&#233;dits.</description>
    </item>
    <item>
      <title>Le Galaxy S26 Ultra pourrait bien signer l&#8217;arr&#234;t de mort des protections d&#8217;&#233;cran</title>
      <link>https://www.frandroid.com/marques/samsung/2953359_le-galaxy-s26-ultra-pourrait-bien-signer-larret-de-mort-des-protections-decran</link>
      <pubDate>Fri, 23 Jan 2026 14:14:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2953359_le-galaxy-s26-ultra-pourrait-bien-signer-larret-de-mort-des-protections-decran</guid>
      <description>
Vous faites partie de ceux qui passent dix minutes &#224; chasser la moindre bulle d'air sous un film plastique hors de prix ? Samsung pourrait bient&#244;t rendre ce rituel obsol&#232;te avec le Galaxy S26 Ultra, dont les nouvelles technologies d'affichage promettent d&#8217;&#233;nerver les fabricants d'accessoires.
</description>
    </item>
    <item>
      <title>One Familiar Face Isn&#8217;t Back for &#8216;The Mummy 4&#8217; Yet</title>
      <link>https://gizmodo.com/the-mummy-4-oded-fehr-ardeth-bay-2000713209</link>
      <pubDate>Fri, 23 Jan 2026 14:00:32 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000713209</guid>
      <description>Plus, somehow 'Primitive War' returned, and is bringing 'secret Cold War agendas' with it.</description>
    </item>
    <item>
      <title>Comment transf&#233;rer une eSIM entre deux smartphones ?</title>
      <link>https://www.frandroid.com/telecom/2733813_transfert-desim-voici-le-guide-pour-transferer-facilement-une-sim-virtuelle-entre-deux-smartphones</link>
      <pubDate>Fri, 23 Jan 2026 14:00:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2733813_transfert-desim-voici-le-guide-pour-transferer-facilement-une-sim-virtuelle-entre-deux-smartphones</guid>
      <description>
L'eSIM est aujourd'hui disponible aupr&#232;s des quatre grands op&#233;rateurs et de quelques op&#233;rateurs virtuels. Si elle est pratique &#224; installer, son transfert d'un smartphone &#224; l'autre n'est pas forc&#233;ment &#233;vident. La d&#233;marche n'est pourtant pas compliqu&#233;e une fois qu'on la conna&#238;t, d'o&#249; ce guide.
</description>
    </item>
    <item>
      <title>How to watch NBA live streams online for free</title>
      <link>https://mashable.com/article/nba-live-stream-for-free</link>
      <pubDate>Fri, 23 Jan 2026 14:00:02 +0000</pubDate>
      <guid isPermaLink="false">00g25aEcur2kjg9jd7L05SO</guid>
      <description>How to watch NBA for free. Live stream NBA games for free from anywhere in the world.</description>
    </item>
    <item>
      <title>The Best Paper Notebooks and Journals, Tested and Reviewed (2026): Leuchttherm, Midori, Field Notes</title>
      <link>https://www.wired.com/gallery/the-best-paper-notebook-and-journals/</link>
      <pubDate>Fri, 23 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">66c37ae6bfbc1f252e6030c1</guid>
      <description>Celebrate National Handwriting Day (I did not make that up) with new notebooks, a journal, or sketchbooks.</description>
    </item>
    <item>
      <title>Spartacus: House of Ashur episode 8 reveals the most distressing gladiator death in the Starz show to date &#8212; and its cast 'felt completely shaken' after filming</title>
      <link>https://www.techradar.com/streaming/entertainment/spartacus-house-of-ashur-episode-8-interview</link>
      <pubDate>Fri, 23 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">SuUp2TzkGuQHRmnsWLPr7c</guid>
      <description>The final scene of a Spartacus: House of Ashur episode is always a shocker, but episode 8 is the most deeply upsetting yet... even for its cast.</description>
    </item>
    <item>
      <title>What is the release date for A Knight of the Seven Kingdoms episode 2 on HBO Max?</title>
      <link>https://www.techradar.com/streaming/hbo-max/what-is-the-release-date-for-a-knight-of-the-seven-kingdoms-episode-2-on-hbo-max</link>
      <pubDate>Fri, 23 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">qJNic2xGRJia56wdRSTSwh</guid>
      <description>Find out when and where you can watch episode 2 of A Knight of the Seven Kingdoms.</description>
    </item>
    <item>
      <title>Samsung Bespoke Fridge with AI review: All the bells and whistles</title>
      <link>https://www.engadget.com/home/kitchen-tech/samsung-bespoke-fridge-with-ai-review-all-the-bells-and-whistles-140000099.html?src=rss</link>
      <pubDate>Fri, 23 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">1511d80f-6cd2-4573-bcf8-da54b7c99e56</guid>
      <description>At their core, refrigerators are relatively simple devices. If you're the type of person to view every extra feature as a component that could potentially go wrong, basic iceboxes are probably the kind you go for. But for those on the other end of the spectrum, Samsung's latest Bespoke Refrigerators with AI inside have more bells and whistles than you might think possible &#8212; including an optional 32-inch screen.
Editor's note: The model we tested for this review came out in the second half of 2025 and will continue to be on sale throughout 2026. Hardware will remain the same, the only changes w...</description>
    </item>
    <item>
      <title>Ring can now verify if a video has been altered</title>
      <link>https://www.engadget.com/home/smart-home/ring-can-now-verify-if-a-video-has-been-altered-140000140.html?src=rss</link>
      <pubDate>Fri, 23 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">9d4563e0-3185-47a5-a9a4-8c4221e5d167</guid>
      <description>Ring has launched a new tool that can tell you if a video clip captured by its camera has been altered or not. The company says that every video downloaded from Ring starting in December 2025 going forward will come with a digital security seal. &#8220;Think of it like the tamper-evident seal on a medicine bottle,&#8221; it explained. Its new tool, called Ring Verify, can tell you if a video has been altered in any way. Even adjusting a video clip&#8217;s brightness or trimming a few seconds off will break that seal, and the tool will tell you that it cannot be verified. All you have to do is visit the tool&#8217;s w...</description>
    </item>
    <item>
      <title>Minnesota economic blackout: List of stores closed today, schedule of events, where to donate as anti-ICE protest kicks off</title>
      <link>https://www.fastcompany.com/91480026/minnesota-day-of-truth-and-freedom-anti-ice-protest-economic-blackout-today-list-of-stores-closing-where-to-donate-event-schedule</link>
      <pubDate>2026-01-23T14:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480026/minnesota-day-of-truth-and-freedom-anti-ice-protest-economic-blackout-today-list-of-stores-closing-where-to-donate-event-schedule</guid>
      <description>Hundreds of businesses across the state are closing their doors on January 23 for the Day of Truth and Freedom.
Minnesota continues to be the beating heart of nationwide anti-ICE movements with The Day of Truth and Freedom. Today, January 23, hundreds of businesses across the state are closing their doors in protest after community groups, faith-based organizations, and unions came together to call for an &#8220;economic blackout.&#8221;&#160;...</description>
    </item>
    <item>
      <title>Professor Reports That OpenAI Deleted His Work, World Laughs in His Face</title>
      <link>https://gizmodo.com/professor-reports-that-openai-deleted-his-work-world-laughs-in-his-face-2000713196</link>
      <pubDate>Fri, 23 Jan 2026 13:55:24 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000713196</guid>
      <description>"Amazing sob story: 'ChatGPT deleted all the work I hadn't done.'"</description>
    </item>
    <item>
      <title>TurboTax Deluxe is on sale for only $45 ahead of tax season</title>
      <link>https://www.engadget.com/deals/turbotax-deluxe-is-on-sale-for-only-45-ahead-of-tax-season-204848111.html?src=rss</link>
      <pubDate>Fri, 23 Jan 2026 13:46:27 +0000</pubDate>
      <guid isPermaLink="false">8d4b28c6-34f1-44bb-800a-eec732a96ded</guid>
      <description>With the spring approaching, it's time to start thinking about how you'll file your taxes. Unfortunately, with the recent demise of Direct File, there isn't a free, government-provided alternative to TurboTax in 2026, and you'll need to look to other federal programs, including IRS Free File, to file your paperwork. If you don't qualify for Free File, chances are you'll need to dish out cash for Intuit's software. And while we hate to suggest you give money to a company that has spent decades lobbying to ensure America's tax system remains a nightmare, we can at least save you some money if Tu...</description>
    </item>
    <item>
      <title>Il est encore temps d&#8217;acheter un puissant laptop sous RTX 5070 + 32 Go de RAM &#224; bon prix pendant les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2804861_il-est-encore-temps-dacheter-un-puissant-laptop-sous-rtx-5070-32-go-de-ram-a-bon-prix-pendant-les-soldes</link>
      <pubDate>Fri, 23 Jan 2026 13:44:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2804861_il-est-encore-temps-dacheter-un-puissant-laptop-sous-rtx-5070-32-go-de-ram-a-bon-prix-pendant-les-soldes</guid>
      <description>
En ce moment, vous avez le PC portable gaming Lenovo Legion 5 15IRX10 pour 1 299,99 euros alors qu'il &#233;tait propos&#233; &#224; 1 799,99 euros &#224; sa sortie. Il y a d&#233;j&#224; eu moins cher, mais &#231;a reste un tr&#232;s bon prix compte tenu de la p&#233;nurie des composants. 
</description>
    </item>
    <item>
      <title>3 things to know about Trump&#8217;s &#8216;Golden Dome&#8217; and Greenland&#8217;s role in nuclear defense</title>
      <link>https://www.fastcompany.com/91480010/3-things-know-about-trumps-golden-dome-greenlands-role-nuclear-defense</link>
      <pubDate>2026-01-23T13:33:19</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480010/3-things-know-about-trumps-golden-dome-greenlands-role-nuclear-defense</guid>
      <description>Trump says U.S. ownership of Greenland is crucial for his &#8216;Golden Dome&#8217; missile defense system.
In a hypothetical nuclear war involving Russia, China and the United States, the island of Greenland would be in the middle of Armageddon.The strategic importance of the Arctic territory &#8212; under the flight paths that nuclear-armed missiles from China and Russia could take on their way to incinerating targets in the United States, and vice versa &#8212; is one of the reasons U.S. President Donald Trump has cited in his disruptive campaign to wrest control of Greenland from Denmark, alarming Greenlanders an...</description>
    </item>
  </channel>
</rss>
