<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 09 Dec 2025 06:38:54 GMT</lastBuildDate>
    <item>
      <title>Fin du calvaire : passer d&#8217;Android &#224; l&#8217;iPhone (et inversement) ne sera plus jamais pareil</title>
      <link>https://www.frandroid.com/android/2902917_fin-du-calvaire-passer-dandroid-a-liphone-et-inversement-ne-sera-plus-jamais-pareil</link>
      <pubDate>Tue, 09 Dec 2025 06:32:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/2902917_fin-du-calvaire-passer-dandroid-a-liphone-et-inversement-ne-sera-plus-jamais-pareil</guid>
      <description>
Passer d'iOS &#224; Android ou inversement n'est jamais une partie de plaisir. Une fonctionnalit&#233; native, rep&#233;r&#233;e dans des versions de test, promet de rendre le changement de cr&#233;merie bien moins douloureux.
</description>
    </item>
    <item>
      <title>Les offres group&#233;es SFR (Box + Mobile) : &#233;conomies et avantages [Sponso]</title>
      <link>https://www.frandroid.com/telecom/forfait-mobile/2895137_les-offres-groupees-sfr-box-mobile-economies-et-avantages</link>
      <pubDate>Tue, 09 Dec 2025 06:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/forfait-mobile/2895137_les-offres-groupees-sfr-box-mobile-economies-et-avantages</guid>
      <description>
Et si vous rassembliez tous vos abonnements t&#233;l&#233;com au sein d&#8217;une m&#234;me offre ? L'offre SFR Multi constitue justement une bonne opportunit&#233; pour payer moins cher et profiter de multiples avantages.
</description>
    </item>
    <item>
      <title>Le m&#234;me prix pour deux vies diff&#233;rentes : quel forfait B&amp;You correspond vraiment &#224; votre usage ?</title>
      <link>https://www.frandroid.com/bons-plans/2901721_le-meme-prix-pour-deux-vies-differentes-quel-forfait-byou-correspond-vraiment-a-votre-usage</link>
      <pubDate>Tue, 09 Dec 2025 06:20:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2901721_le-meme-prix-pour-deux-vies-differentes-quel-forfait-byou-correspond-vraiment-a-votre-usage</guid>
      <description>
Pour le m&#234;me prix, Bouygues Telecom propose deux forfaits tr&#232;s diff&#233;rents. L'un mise tout sur le voyage, l'autre sur la musique. &#192; 19,99 euros par mois, le plus dur sera de choisir l'offre qui correspond le mieux &#224; votre quotidien.
</description>
    </item>
    <item>
      <title>Avec ou sans &#233;cran&#160;: Google contre-attaque dans la bataille des lunettes connect&#233;es</title>
      <link>https://www.01net.com/actualites/dans-la-bataille-des-lunettes-connectees-google-contre-attaque-avec-des-modeles-avec-et-sans-ecran.html</link>
      <pubDate>Tue, 09 Dec 2025 06:07:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314401</guid>
      <description>Comme tous les autres constructeurs, Google a bien per&#231;u le succ&#232;s des lunettes connect&#233;es Ray-Ban de Meta. Le g&#233;ant du web pr&#233;pare donc sa propre offensive avec ses propres partenaires et a donn&#233; quelques d&#233;tails cette nuit durant l&#8217;Android Show consacr&#233; &#224; Android XR.</description>
    </item>
    <item>
      <title>LEGO Smart Brick : tout savoir sur la brique connect&#233;e qui arrive en 2026</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/2902811_lego-smart-brick-tout-savoir-sur-la-brique-connectee-qui-arrive-en-2026</link>
      <pubDate>Tue, 09 Dec 2025 06:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/2902811_lego-smart-brick-tout-savoir-sur-la-brique-connectee-qui-arrive-en-2026</guid>
      <description>
En 2026, LEGO pr&#233;pare un changement de paradigme massif. Une brique intelligente, bard&#233;e de capteurs et rechargeable sans fil, s'appr&#234;te &#224; d&#233;barquer dans vos sets Star Wars et Pok&#233;mon. Sur le papier, c'est fascinant. Dans la r&#233;alit&#233; ? C'est complexe.
</description>
    </item>
    <item>
      <title>Apple et Google vont simplifier le switch entre iOS et Android et vice-versa</title>
      <link>https://www.01net.com/actualites/apple-et-google-vont-simplifier-le-switch-entre-ios-et-android-et-vice-versa.html</link>
      <pubDate>Tue, 09 Dec 2025 05:17:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314396</guid>
      <description>Apple et Google savent travailler en bonne intelligence quand leurs int&#233;r&#234;ts sont en jeu. Nouvel exemple en date : les deux rivaux d&#233;veloppent de nouveaux moyens pour faciliter le transfert des donn&#233;es entre iOS et Android, et vice-versa. Une nouveaut&#233; qui apparaitra tr&#232;s rapidement sur les deux plateformes.</description>
    </item>
    <item>
      <title>Getting rid of old furniture immediately starts lowering the toxic flame retardants in your body. Here&#8217;s why</title>
      <link>https://www.fastcompany.com/91456433/getting-rid-of-old-furniture-can-immediately-start-making-you-healthier-heres-why</link>
      <pubDate>2025-12-09T05:01:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91456433/getting-rid-of-old-furniture-can-immediately-start-making-you-healthier-heres-why</guid>
      <description>Old sofas are filled with flame retardants, which have been linked to cancer risk and neurodevelopmental issues. A new study looks at what happens in your body when you get new furniture.
If your sofa was made between 1970 and 2014, its foam is likely loaded with flame retardants&#8212;chemicals that can escape into dust and end up in the air you breathe....</description>
    </item>
    <item>
      <title>Fewer women then men want promotions</title>
      <link>https://www.fastcompany.com/91456538/fewer-women-then-men-want-promotions</link>
      <pubDate>2025-12-09T05:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91456538/fewer-women-then-men-want-promotions</guid>
      <description>According to the newest edition of McKinsey&#8217;s Women in the Workplace report, women are having trouble getting promoted and wanting to be promoted.
From return-to-office mandates, anxiety about AI taking (or reshaping) jobs, and a highly competitive atmosphere for recent graduates and other job seekers, 2025 has been a year of change. It&#8217;s also been a big year of change for women in the workplace, with a record number exiting the workforce. And, according to a new report, women are now also less inclined to seek promotions....</description>
    </item>
    <item>
      <title>How to watch the 2025 Africa Cup of Nations online for free</title>
      <link>https://mashable.com/article/africa-cup-of-nations-2025-live-stream-for-free</link>
      <pubDate>Tue, 09 Dec 2025 05:00:00 +0000</pubDate>
      <guid isPermaLink="false">01x6w2GJ5DTY19LQCP9NGqI</guid>
      <description>How to watch Africa Cup of Nations for free. Live stream the 2025 Africa Cup of Nations for free from anywhere in the world.</description>
    </item>
    <item>
      <title>How to watch Atalanta vs. Chelsea online for free</title>
      <link>https://mashable.com/article/atalanta-chelsea-champions-league-2025-live-stream-for-free</link>
      <pubDate>Tue, 09 Dec 2025 05:00:00 +0000</pubDate>
      <guid isPermaLink="false">05f2gV1qBENg6qoxlYDOH8H</guid>
      <description>How to watch Champions League for free. Live stream Atalanta vs. Chelsea in the Champions League for free.</description>
    </item>
    <item>
      <title>How to watch Bayern Munich vs. Sporting online for free</title>
      <link>https://mashable.com/article/bayern-munich-sporting-champions-league-2025-live-stream-for-free</link>
      <pubDate>Tue, 09 Dec 2025 05:00:00 +0000</pubDate>
      <guid isPermaLink="false">06BBz2NXg2zTte3eo4KHeyn</guid>
      <description>How to watch Champions League for free. Live stream Bayern Munich vs. Sporting in the Champions League for free.</description>
    </item>
    <item>
      <title>How to watch Inter Milan vs. Liverpool online for free</title>
      <link>https://mashable.com/article/inter-milan-liverpool-2025-champions-league-live-stream-for-free</link>
      <pubDate>Tue, 09 Dec 2025 05:00:00 +0000</pubDate>
      <guid isPermaLink="false">0658BTuVkWCErnqDiZVtcXn</guid>
      <description>How to watch the Champions League for free. Watch Inter Milan vs. Liverpool in the Champions League for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Moon phase today: What the moon will look like on December 9</title>
      <link>https://mashable.com/article/moon-phase-today-dec-9</link>
      <pubDate>Tue, 09 Dec 2025 05:00:00 +0000</pubDate>
      <guid isPermaLink="false">05zZAqz2EqjbEr0IA5CSjkz</guid>
      <description>See the moon phase expected for December 9, 2025 as well as when the next full moon is expected.</description>
    </item>
  </channel>
</rss>
