<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 25 Jan 2026 20:29:27 GMT</lastBuildDate>
    <item>
      <title>&#8216;Halo&#8217; Actor Steve Downes Asks You Not to Remake His Voice with AI</title>
      <link>https://gizmodo.com/halo-actor-steve-downes-asks-you-not-to-remake-his-voice-with-ai-2000713343</link>
      <pubDate>Sun, 25 Jan 2026 20:00:02 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000713343</guid>
      <description>The man behind Master Chief feels a way about generative AI when it comes to his voice being used for any 'Halo' fan project or video.</description>
    </item>
    <item>
      <title>Microsoft unveils first robotics model targeted at boosting physical AI in a bid to free robots from the production line</title>
      <link>https://www.techradar.com/pro/microsoft-unveils-first-robotics-model-targeted-at-boosting-physical-ai-in-a-bid-to-free-robots-from-the-production-line</link>
      <pubDate>Sun, 25 Jan 2026 19:35:00 +0000</pubDate>
      <guid isPermaLink="false">XKwNsyqpMAPeukrjcKfwQL</guid>
      <description>Microsoft introduces Rho-alpha, a robotics model combining language, touch, simulation, and human feedback to extend robots beyond predictable factory environments.</description>
    </item>
    <item>
      <title>Microsoft releases second emergency Windows 11 update to fix Outlook crashes</title>
      <link>https://www.engadget.com/computing/microsoft-releases-second-emergency-windows-11-update-to-fix-outlook-crashes-192012812.html?src=rss</link>
      <pubDate>Sun, 25 Jan 2026 19:20:12 +0000</pubDate>
      <guid isPermaLink="false">5b52de00-c9d8-4644-a192-9726b4d47c3d</guid>
      <description>Microsoft issued another out-of-band update to fix a bug that caused Outlook to crash for Windows 11 users. This second emergency patch addresses issues seen with Outlook and files stored in the cloud following Microsoft's January 2026 Windows security update.
According to Microsoft, this update fixes a bug where some apps that "open or save files stored in cloud-backed locations" became unresponsive or displayed error messages. Some users also experienced Outlook crashing or not opening when PST files are stored in cloud-based options like OneDrive.
This is the second time this year that Micr...</description>
    </item>
    <item>
      <title>Samsung's 12 best Super Bowl TV deals that I recommend buying &#8212; up to $2,000 off 4K, QLED, and OLED TVs</title>
      <link>https://www.techradar.com/tech/samsungs-12-best-super-bowl-tv-deals-that-i-recommend-buying-up-to-usd1-200-off-4k-qled-and-oled-tvs</link>
      <pubDate>Sun, 25 Jan 2026 19:09:51 +0000</pubDate>
      <guid isPermaLink="false">FhxboQtaUMLXx7sKZPjQ8H</guid>
      <description>Samsung's Super Bowl TV sale is live, and I'm rounding up today's 12 best deals I recommend for watching the big game, including up to $1,500 off 4K, QLED, and OLED TVs.</description>
    </item>
    <item>
      <title>Test ViewSonic M1B Max : le mini vid&#233;oprojecteur portable Google TV &#224; moins de 500 euros</title>
      <link>https://www.frandroid.com/marques/viewsonic/2946091_test-du-videoprojecteur-viewsonic-m1b-max-le-mini-projecteur-led-sur-batterie-qui-veut-tout-faire</link>
      <pubDate>Sun, 25 Jan 2026 19:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/viewsonic/2946091_test-du-videoprojecteur-viewsonic-m1b-max-le-mini-projecteur-led-sur-batterie-qui-veut-tout-faire</guid>
      <description>
Le ViewSonic M1B Max est un vid&#233;oprojecteur Full HD 1080p portable avec batterie, Google TV et pied inclinable sur 360 degr&#233;s. Voici notre test complet pour savoir s&#8217;il peut devenir votre compagnon cin&#233;ma du quotidien.
</description>
    </item>
    <item>
      <title>I tested the three most popular Nintendo Switch 2 cameras, and this is the only one I&#8217;d recommend</title>
      <link>https://www.techradar.com/gaming/nintendo-switch/i-tested-the-three-most-popular-nintendo-switch-2-cameras-and-this-is-the-only-one-id-recommend</link>
      <pubDate>Sun, 25 Jan 2026 19:00:00 +0000</pubDate>
      <guid isPermaLink="false">vsRVMoFkdvrtQuDC7gWrK5</guid>
      <description>I&#8217;ve tested three cameras for Nintendo Switch 2, but there&#8217;s only one model I&#8217;d spend my own money on.</description>
    </item>
    <item>
      <title>I used to ignore my bank account but with this app I&#8217;m in control of every cent</title>
      <link>https://www.techradar.com/computing/websites-apps/ynab</link>
      <pubDate>Sun, 25 Jan 2026 19:00:00 +0000</pubDate>
      <guid isPermaLink="false">grgBDW4QBD6YPhzR8tvmjV</guid>
      <description>Homescreen Heroes: YNAB has rewired my relationship with money</description>
    </item>
    <item>
      <title>&#8216;Jujutsu Kaisen&#8217; Keeps Looking So Damn Good</title>
      <link>https://gizmodo.com/jujutsu-kaisen-keeps-looking-so-damn-good-2000713456</link>
      <pubDate>Sun, 25 Jan 2026 18:50:04 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000713456</guid>
      <description>An evolving art style has helped each 'Jujutsu Kaisen' season feel distinct and stun viewers during its many, *many* fights.</description>
    </item>
    <item>
      <title>Ce pack tout en 1 permet de voir qui est &#224; la porte, de surveiller son int&#233;rieur et son ext&#233;rieur avec 62 % de remise pour les soldes</title>
      <link>https://www.frandroid.com/produits-android/2952013_ce-pack-tout-en-1-permet-de-voir-qui-est-a-la-porte-de-surveiller-son-interieur-et-son-exterieur-avec-62-de-remise-pour-les-soldes</link>
      <pubDate>Sun, 25 Jan 2026 18:41:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2952013_ce-pack-tout-en-1-permet-de-voir-qui-est-a-la-porte-de-surveiller-son-interieur-et-son-exterieur-avec-62-de-remise-pour-les-soldes</guid>
      <description>
Si l'id&#233;e d'&#233;quiper son logement en cam&#233;ras de surveillance tra&#238;ne dans un coin de la t&#234;te, les soldes sont le bon moment de passer &#224; l'action. C'est le cas de ce pack sign&#233; Arlo, qui r&#233;unit une sonnette connect&#233;e et deux cam&#233;ras, dont une est pens&#233;e pour l'int&#233;rieur et l'autre pour l'ext&#233;rieur. Avec 62 % de r&#233;duction chez Darty, le prix de ce bundle passe de 399,99 euros &#224; 149,99 euros.
...</description>
    </item>
  </channel>
</rss>
