<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 18 Dec 2025 09:31:40 GMT</lastBuildDate>
    <item>
      <title>Android 16 QPR3&#160;: voici les 5 premi&#232;res nouveaut&#233;s</title>
      <link>https://www.01net.com/actualites/android-16-qpr3-voici-premieres-nouveautes.html</link>
      <pubDate>Thu, 18 Dec 2025 09:27:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315991</guid>
      <description>Android 16 QPR3, la prochaine version de l'OS de Google, d&#233;voile d&#233;j&#224; quelques nouveaut&#233;s &#224; travers sa premi&#232;re b&#234;ta. On fait le point.</description>
    </item>
    <item>
      <title>La future BYD Dolphin G hybride marque un tournant historique : c&#8217;est la premi&#232;re voiture chinoise con&#231;ue pour l&#8217;Europe</title>
      <link>https://www.frandroid.com/marques/byd/2914355_la-future-byd-dolphin-g-hybride-marque-un-tournant-historique-cest-la-premiere-voiture-chinoise-concue-pour-leurope</link>
      <pubDate>Thu, 18 Dec 2025 09:27:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2914355_la-future-byd-dolphin-g-hybride-marque-un-tournant-historique-cest-la-premiere-voiture-chinoise-concue-pour-leurope</guid>
      <description>
D&#233;j&#224; leader mondial de la voiture &#233;lectrique, BYD veut d&#233;sormais frapper un grand coup en Europe en lan&#231;ant une compacte hybride rechargeable : la Dolphin G. C'est la premi&#232;re voiture de BYD con&#231;ue pour l'Europe et qui ne sera pas vendue en Chine selon la patronne du constructeur.
</description>
    </item>
    <item>
      <title>Save now on the next-gen AI workstation from Corsair that is designed for creators and developers</title>
      <link>https://www.techradar.com/computing/save-now-on-the-next-gen-ai-workstation-from-corsair-that-is-designed-for-creators-and-developers</link>
      <pubDate>Thu, 18 Dec 2025 09:26:02 +0000</pubDate>
      <guid isPermaLink="false">YQMGZqMJRb5peaetsmSjQd</guid>
      <description>Save now on the compact, next-gen AI workstation designed for creators and developers</description>
    </item>
    <item>
      <title>Ces AirPods 4 &#224; prix cass&#233; feront un excellent cadeau &#224; mettre sous le sapin de No&#235;l</title>
      <link>https://www.frandroid.com/bons-plans/2882467_ces-airpods-4-a-prix-casse-feront-un-excellent-cadeau-a-mettre-sous-le-sapin-de-noel</link>
      <pubDate>Thu, 18 Dec 2025 09:18:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2882467_ces-airpods-4-a-prix-casse-feront-un-excellent-cadeau-a-mettre-sous-le-sapin-de-noel</guid>
      <description>
Si vous souhaitez acheter des &#233;couteurs sans fil Apple pas chers pour accompagner votre iPhone, les AirPods 4 sont tout choisis. Ils sont une bonne affaire et la version sans ANC passe de 149 euros &#224; 109 euros seulement. 
</description>
    </item>
    <item>
      <title>Tesla va finalement produire ses batteries en Europe : pourquoi cela pourrait baisser le prix du Model Y en France</title>
      <link>https://www.frandroid.com/marques/tesla/2914327_tesla-va-finalement-produire-ses-batteries-en-europe-pourquoi-cela-pourrait-baisser-le-prix-du-model-y-en-france</link>
      <pubDate>Thu, 18 Dec 2025 09:13:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2914327_tesla-va-finalement-produire-ses-batteries-en-europe-pourquoi-cela-pourrait-baisser-le-prix-du-model-y-en-france</guid>
      <description>
C&#8217;est confirm&#233;, Tesla va fabriquer ses propres batteries dans son usine de Berlin pour ses voitures &#233;lectriques. La capacit&#233; annuelle sera cependant faible et ne devrait qu'atteindre les 8 GWh.
</description>
    </item>
    <item>
      <title>The best streaming deals: Get 50 percent off MasterClass subscriptions, plus save on Starz, Audible, Crunchyroll and others</title>
      <link>https://www.engadget.com/deals/the-best-streaming-deals-get-50-percent-off-masterclass-subscriptions-plus-save-on-starz-audible-crunchyroll-and-others-133028536.html?src=rss</link>
      <pubDate>Thu, 18 Dec 2025 09:01:25 +0000</pubDate>
      <guid isPermaLink="false">026fe1b5-ea22-49f6-8016-fd8686928f5c</guid>
      <description>Whether you&#8217;re a true cord-cutter or you just want to watch the next season of Stranger Things when it drops, everyone&#8217;s on the lookout for streaming deals nowadays. Plenty have chosen VOD and live TV streaming services over traditional cable in recent years, but the savings that choice got you just a few years ago have somewhat evaporated now. Companies like Netflix, Disney, Max and others have been consistently raising prices to the point where you may question if streaming is even worth it anymore.
We at Engadget still think so, for many reasons, but you can (and should) be smart with your ...</description>
    </item>
    <item>
      <title>Quelle est la meilleure voiture Tesla &#224; choisir en 2025&#8201;?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-survoltes/guides-dachat-voitures/1333657_quelle-est-la-meilleure-tesla-a-choisir</link>
      <pubDate>Thu, 18 Dec 2025 09:00:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-survoltes/guides-dachat-voitures/1333657_quelle-est-la-meilleure-tesla-a-choisir</guid>
      <description>
Si la marque Tesla vous attire, mais que vous avez du mal &#224; vous y retrouver entre les diff&#233;rentes versions disponibles, ce guide est fait pour vous. D&#233;couvrez les diff&#233;rents v&#233;hicules de la gamme pour y voir plus clair et d&#233;terminer quelle Tesla choisir.
</description>
    </item>
    <item>
      <title>Lovense Spinel Review: A Great Mini Sex Machine</title>
      <link>https://www.wired.com/review/lovense-spinel/</link>
      <pubDate>Thu, 18 Dec 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">6941c42b9f24e324b91b3787</guid>
      <description>The multi-stimulating sex machine can heat up, can be mounted via a suction cup, and is totally worth the splurge.</description>
    </item>
    <item>
      <title>Les Oscars seront bient&#244;t diffus&#233;s   en exclusivit&#233; sur YouTube</title>
      <link>https://www.frandroid.com/marques/google/2914345_les-oscars-seront-bientot-diffuses-en-exclusivite-sur-youtube</link>
      <pubDate>Thu, 18 Dec 2025 08:54:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2914345_les-oscars-seront-bientot-diffuses-en-exclusivite-sur-youtube</guid>
      <description>
Google remporte les n&#233;gociations devant Disney et sa filiale ABC en acqu&#233;rant les droits exclusifs de diffusion de la c&#233;r&#233;monie des Oscars &#224; compter de 2029. 
</description>
    </item>
    <item>
      <title>Android&#160;16 va vous aider &#224; chasser les applis trop curieuses de vos d&#233;placements</title>
      <link>https://www.frandroid.com/marques/google/2914359_android-16-va-vous-aider-a-chasser-les-applis-trop-curieuses-de-vos-deplacements</link>
      <pubDate>Thu, 18 Dec 2025 08:52:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2914359_android-16-va-vous-aider-a-chasser-les-applis-trop-curieuses-de-vos-deplacements</guid>
      <description>
Une petite nouveaut&#233; discr&#232;te dans la prochaine version d&#8217;Android&#160;16 devrait ravir celles et ceux qui souhaitent savoir quelles applications les espionnent un peu trop.
</description>
    </item>
    <item>
      <title>YouTube will stop giving Billboard its music streaming data</title>
      <link>https://mashable.com/article/youtube-billboard-music-charts-withdraw</link>
      <pubDate>Thu, 18 Dec 2025 08:21:50 +0000</pubDate>
      <guid isPermaLink="false">0373HRfHlZ0R2K3HREAqcmm</guid>
      <description>YouTube won't share music streaming data with Billboard any more, objecting to how it weights streams when calculating U.S. charts.</description>
    </item>
    <item>
      <title>Fuite massive de donn&#233;es &#224; la CAF&#160;: les informations de 8,6 millions de Fran&#231;ais compromises</title>
      <link>https://www.01net.com/actualites/fuite-massive-donnees-caf-informations-86-millions-francais-compromises.html</link>
      <pubDate>Thu, 18 Dec 2025 08:18:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315984</guid>
      <description>Une fuite massive frappe la Caisse des Allocations Familiales (CAF). Des pirates ont pu exfiltrer plus de 22 millions de donn&#233;es personnelles. Plus de huit millions de Fran&#231;ais seraient touch&#233;s. Les hackers du minist&#232;re de l'Int&#233;rieur sont bien d&#233;cid&#233;s &#224; montrer qu'ils ne plaisantent pas&#8230;</description>
    </item>
    <item>
      <title>La premi&#232;re barre de son Dolby Atmos Flex Connect au monde est sign&#233;e LG</title>
      <link>https://www.frandroid.com/marques/lg/2914411_la-premiere-barre-de-son-dolby-atmos-flex-connect-au-monde-est-signee-lg</link>
      <pubDate>Thu, 18 Dec 2025 08:17:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lg/2914411_la-premiere-barre-de-son-dolby-atmos-flex-connect-au-monde-est-signee-lg</guid>
      <description>
En amont du CES 2026, LG annonce l&#8217;arriv&#233;e sur le march&#233; de la toute premi&#232;re barre de son au monde &#224; embarquer la technologie Dolby Atmos Flex Connect permettant non seulement de synchroniser les haut-parleurs d&#8217;un t&#233;l&#233;viseur de la marque avec ceux de la barre de son mais &#233;galement un auto calibrage qui prend en compte les caract&#233;ristiques acoustiques et physiques de la pi&#232;ce.
...</description>
    </item>
    <item>
      <title>Amazon casse d&#233;j&#224; le prix du nouveau smartphone pas cher d&#8217;Oppo avec un &#233;cran AMOLED 120 Hz et une autonomie XXL</title>
      <link>https://www.frandroid.com/bons-plans/2913717_amazon-casse-deja-le-prix-du-nouveau-smartphone-pas-cher-doppo-avec-un-ecran-amoled-120-hz-et-une-autonomie-xxl</link>
      <pubDate>Thu, 18 Dec 2025 08:08:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2913717_amazon-casse-deja-le-prix-du-nouveau-smartphone-pas-cher-doppo-avec-un-ecran-amoled-120-hz-et-une-autonomie-xxl</guid>
      <description>
Avec un budget inf&#233;rieur &#224; 300 euros, il est possible de se procurer un bon smartphone sans trop de compromis. C'est le cas du Oppo A6 Pro 5G, qui pr&#233;sente une belle fiche technique pour un prix bien bas : 249 euros contre 299 euros de base.  
</description>
    </item>
    <item>
      <title>Emily in Paris season 5 ending explained: does Emily return to Paris, do Emily and Gabriel get back together and our season 6 predictions</title>
      <link>https://www.techradar.com/streaming/netflix/emily-in-paris-season-5-ending-explained</link>
      <pubDate>Thu, 18 Dec 2025 08:02:00 +0000</pubDate>
      <guid isPermaLink="false">TNvjATHMDtRoPkSvwJ5V5J</guid>
      <description>Goodbye Paris, hello Rome! The ending of Emily in Paris season 5 shakes things up once again &#8211; here are the answers to all of your burning questions.</description>
    </item>
    <item>
      <title>The best multi-device wireless charging pads for 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-multi-device-wireless-charging-pads-120557582.html?src=rss</link>
      <pubDate>Thu, 18 Dec 2025 08:01:26 +0000</pubDate>
      <guid isPermaLink="false">92afccad-7a6d-4b3e-b701-91c6301fd52f</guid>
      <description>There&#8217;s a good chance you own a couple of gadgets that support wireless charging now, be it your iPhone or Android phone, wireless earbuds or smartwatch. Multi-device wireless chargers can help power them all up in one place, without the need for a bunch of cords messing up your space. There are dozens of these accessories out there today, and we&#8217;ve tested a bunch of the most popular models. You&#8217;ll find out top picks below for the best wireless charging pads, plus some advice on how to choose the right one for your needs.
Table of contents

Best wireless charging pads
Do wireless charging pads...</description>
    </item>
    <item>
      <title>Emily in Paris season 5 isn't home sweet Rome, but an Italian holiday from hell &#8212; and Marcello is the biggest disappointment of all</title>
      <link>https://www.techradar.com/streaming/netflix/emily-in-paris-season-5-review</link>
      <pubDate>Thu, 18 Dec 2025 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">RDsKuNkeUNK4oYe33y5BRJ</guid>
      <description>Emily in Paris season 5 is proof that the concept doesn't work in another city &#8211; and Marcello might just be Emily's worst boyfriend yet.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs ultraportables en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/1661013_meilleurs-pc-ultraportables-quel-modele-de-pc-nomade-choisir</link>
      <pubDate>Thu, 18 Dec 2025 08:00:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1661013_meilleurs-pc-ultraportables-quel-modele-de-pc-nomade-choisir</guid>
      <description>
Vous &#234;tes &#224; la recherche d&#8217;un ordinateur portable &#224; la fois l&#233;ger, compact et performant ? Les ultraportables, aussi appel&#233;s ultrabooks, sont faits pour vous. Voici notre s&#233;lection des meilleurs mod&#232;les, soigneusement test&#233;s par l&#8217;&#233;quipe de Frandroid.
</description>
    </item>
    <item>
      <title>SFR a &#233;t&#233; pirat&#233; et les donn&#233;es de ses clients sont dans la nature</title>
      <link>https://www.frandroid.com/marques/sfr/2914357_sfr-a-ete-pirate-et-les-donnees-de-ses-clients-sont-dans-la-nature</link>
      <pubDate>Thu, 18 Dec 2025 07:55:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sfr/2914357_sfr-a-ete-pirate-et-les-donnees-de-ses-clients-sont-dans-la-nature</guid>
      <description>
SFR a une nouvelle fois &#233;t&#233; victime d'un piratage massif des donn&#233;es de ses clients. Heureusement, les informations bancaires n'ont pas &#233;t&#233; d&#233;voil&#233;es.
</description>
    </item>
    <item>
      <title>I tested the Geekom AX8 Max - and this mini PC is ideally balanced for the office, but I&#8217;m not sold on the color</title>
      <link>https://www.techradar.com/computing/geekom-ax8-max-mini-pc-review</link>
      <pubDate>Thu, 18 Dec 2025 07:47:00 +0000</pubDate>
      <guid isPermaLink="false">6Qa8qVHGe9xwk6aTKxEPtH</guid>
      <description>The Geekom AX8 Max is a mid-range mini PC sporting an AMD Ryzen 7 8745HS with integrated Radeon 780M, enabling it to handle day-to-day office tasks, multimedia, and a touch of gaming, whilst maintaining a small form factor and footprint.</description>
    </item>
  </channel>
</rss>
