<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 29 Dec 2025 12:54:50 GMT</lastBuildDate>
    <item>
      <title>iPhone Fold : une vid&#233;o d&#233;voile le design, le prix et la fin de Face ID</title>
      <link>https://www.frandroid.com/marques/apple/2922159_iphone-fold-une-video-devoile-le-design-le-prix-et-la-fin-de-face-id</link>
      <pubDate>Mon, 29 Dec 2025 12:25:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2922159_iphone-fold-une-video-devoile-le-design-le-prix-et-la-fin-de-face-id</guid>
      <description>
Jon Prosser a encore frapp&#233;. Le leaker controvers&#233; nous sert une nouvelle vision de l'iPhone Fold attendu pour d&#233;but 2026. Selon le leaker, on aurait droit &#224; un ch&#226;ssis ultra-fin de 4,5 mm et un retour inattendu de Touch ID. Si les caract&#233;ristiques font r&#234;ver, le prix annonc&#233; risque de calmer tout le monde.
</description>
    </item>
    <item>
      <title>La version Switch 2 de Final Fantasy VII Remake Intergrade est en pr&#233;co &#224; son meilleur prix avec un petit bonus</title>
      <link>https://www.frandroid.com/bons-plans/2922037_la-version-switch-2-de-final-fantasy-vii-remake-intergrade-est-en-preco-a-son-meilleur-prix-avec-un-petit-bonus</link>
      <pubDate>Mon, 29 Dec 2025 12:24:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2922037_la-version-switch-2-de-final-fantasy-vii-remake-intergrade-est-en-preco-a-son-meilleur-prix-avec-un-petit-bonus</guid>
      <description>
Final Fantasy VII Remake Intergrade sortira le 22 janvier 2026 sur Switch 2 et Amazon vous le propose &#224; 44,99 euros au lieu de 49,99 euros avec, en cadeau, un booster Magic: The Gathering - Final Fantasy.
</description>
    </item>
    <item>
      <title>Watch out, Sonos &#8212; Samsung's new wireless speakers look very cool, and directly challenge the Era models</title>
      <link>https://www.techradar.com/audio/multi-room/watch-out-sonos-samsungs-new-wireless-speakers-look-very-cool-and-directly-challenge-the-era-models</link>
      <pubDate>Mon, 29 Dec 2025 12:13:05 +0000</pubDate>
      <guid isPermaLink="false">v5nRTCTUtyJ9vm7VWjoYin</guid>
      <description>Two new speakers with minimalist designs, and driver setups that directly target Sonos' main home speakers</description>
    </item>
    <item>
      <title>Le chinois BYD d&#233;tr&#244;ne Tesla et devient le roi de la voiture &#233;lectrique en 2025</title>
      <link>https://www.01net.com/actualites/le-chinois-byd-detrone-tesla-et-devient-le-roi-de-la-voiture-electrique-en-2025.html</link>
      <pubDate>Mon, 29 Dec 2025 12:03:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317444</guid>
      <description>En 2025, le g&#233;ant chinois BYD a officiellement vol&#233; la vedette &#224; Tesla. Elon Musk perd sa couronne mondiale face &#224; une offensive asiatique inarr&#234;table.</description>
    </item>
    <item>
      <title>The Best Vacuum for Pet Hair&#8212;We Tested Many to Find Which Ones Work Best (2026)</title>
      <link>https://www.wired.com/gallery/best-pet-hair-vacuums/</link>
      <pubDate>Mon, 29 Dec 2025 12:02:00 +0000</pubDate>
      <guid isPermaLink="false">67c8d2eb3d1913842b362a9a</guid>
      <description>Cordless, handheld, robot, and traditional&#8212;we tested them all to find the vacuum that&#8217;s fantastic for fur.</description>
    </item>
    <item>
      <title>The Worst Hacks of 2025</title>
      <link>https://www.wired.com/story/worst-hacks-of-2025/</link>
      <pubDate>Mon, 29 Dec 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">69401e7fb1544ff47e62b620</guid>
      <description>From university breaches to cyberattacks that shut down whole supply chains, these were the worst cybersecurity incidents of the year.</description>
    </item>
    <item>
      <title>The Best Body Pillow, Tested and Reviewed (2025)</title>
      <link>https://www.wired.com/gallery/best-body-pillows/</link>
      <pubDate>Mon, 29 Dec 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">667497571fa07790f9045da0</guid>
      <description>From the classic body pillow to unique shapes for optimal limb support, we tested a wide range of body pillows designed for side sleepers.</description>
    </item>
    <item>
      <title>I write for a living and this is the only Mac and iOS app I&#8217;ll use in 2026</title>
      <link>https://www.techradar.com/computing/i-write-for-a-living-and-this-is-the-only-mac-and-ios-app-ill-use-in-2026</link>
      <pubDate>Mon, 29 Dec 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">rv6WouF5QygTQ649yfDKZj</guid>
      <description>Ulysses is a powerhouse for professional writing &#8211;and it's pretty great for casual writing and storing ideas too.</description>
    </item>
    <item>
      <title>Building a business in 2026? Launch your website for less with this huge Hostinger discount - exclusive to TechRadar</title>
      <link>https://www.techradar.com/pro/website-building/building-a-business-in-2026-launch-your-website-for-less-with-this-huge-hostinger-discount-exclusive-to-techradar</link>
      <pubDate>Mon, 29 Dec 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">PEUigyitihfr7NbSmzKArF</guid>
      <description>If you want to start your own business in 2026, this exclusive Hostinger discount is one to take advantage of.</description>
    </item>
    <item>
      <title>Brighter OLEDs, better viewing angles and cheaper prices &#8211; here's what I want to see from LG, Samsung and every other major TV brand in 2026</title>
      <link>https://www.techradar.com/televisions/brighter-oleds-better-viewing-angles-and-cheaper-prices-heres-what-i-want-to-see-from-lg-samsung-and-every-other-major-tv-brand-in-2026</link>
      <pubDate>Mon, 29 Dec 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">8JuYGY9y3Tz8pcbsLZNqBS</guid>
      <description>Every TV brand had a great year in 2025, but there's always room for improvement. So, I put together a wishlist for 2026.</description>
    </item>
    <item>
      <title>Google Photos is coming to Samsung TVs in 2026</title>
      <link>https://www.theverge.com/news/850594/samsung-tv-google-photos-integration-2026</link>
      <pubDate>2025-12-29T06:48:46-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=850594</guid>
      <description>Google Photos will finally be available on TVs next year, starting with an upcoming integration for Samsung TVs. Samsung announced that the planned integration will "seamlessly bring the photos people capture on their phones to Samsung TVs, where they can appear in a larger, cinematic format," and that it wants Google Photos to be "deeply [&#8230;]</description>
    </item>
    <item>
      <title>Les jeux PS4 gratuits sur Playstation Plus, c&#8217;est bient&#244;t termin&#233;</title>
      <link>https://www.01net.com/actualites/les-jeux-ps4-gratuits-sur-playstation-plus-cest-bientot-termine.html</link>
      <pubDate>Mon, 29 Dec 2025 11:41:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317463</guid>
      <description>Mauvaise nouvelle pour les derniers joueurs sur PS4 et pour les abonn&#233;s &#224; la formule de base du Playstation Plus. Les titres PS4 gratuits vont dispara&#238;tre du catalogue.</description>
    </item>
    <item>
      <title>Google Photos s&#8217;invite sur les TV Samsung pour transformer le salon en album vivant</title>
      <link>https://www.frandroid.com/marques/samsung/2922135_google-photos-sinvite-sur-les-tv-samsung-pour-transformer-le-salon-en-album-vivant</link>
      <pubDate>Mon, 29 Dec 2025 11:36:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2922135_google-photos-sinvite-sur-les-tv-samsung-pour-transformer-le-salon-en-album-vivant</guid>
      <description>
Samsung pr&#233;voit d&#8217;int&#233;grer Google Photos &#224; sa gamme de t&#233;l&#233;viseurs Samsung &#224; partir de 2026, afin de permettre &#224; chacun de retrouver ses souvenirs personnels sur grand &#233;cran, avec plusieurs fonctionnalit&#233;s dop&#233;es &#224; l&#8217;IA, dont des outils cr&#233;atifs bas&#233;s sur le mod&#232;le Nano Banana de Google DeepMind.
</description>
    </item>
    <item>
      <title>Netflix shares first glimpse of upcoming Take That doc</title>
      <link>https://mashable.com/video/netflix-take-that-documentary</link>
      <pubDate>Mon, 29 Dec 2025 11:32:34 +0000</pubDate>
      <guid isPermaLink="false">06HBBF5txzrfQrBCV601nzL</guid>
      <description>Netflix has teased a first look at its upcoming Take That documentary, which will hit screens on 27 Jan. 2026.</description>
    </item>
    <item>
      <title>Google's new cheap earbuds are its best in years &#8212; though it must be said, the bar wasn't especially high</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/googles-new-cheap-earbuds-are-its-best-in-years-although-itmust-be-said-the-bar-there-wasnt-especially-high</link>
      <pubDate>Mon, 29 Dec 2025 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">K9n4GbNdezNjQvMDbGGCeK</guid>
      <description>Google's latest low-cost earbuds may solve issues with older buds, but they don't crack the market yet.</description>
    </item>
    <item>
      <title>Boulanger frappe fort avec -54% sur ce TV OLED Samsung de 77&#8243; pour une image 144 Hz sans reflet et d&#8217;une finesse exceptionnelle</title>
      <link>https://www.frandroid.com/bons-plans/2921883_boulanger-frappe-fort-avec-54-sur-ce-tv-oled-samsung-de-77-pour-une-image-144-hz-sans-reflet-et-dune-finesse-exceptionnelle</link>
      <pubDate>Mon, 29 Dec 2025 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2921883_boulanger-frappe-fort-avec-54-sur-ce-tv-oled-samsung-de-77-pour-une-image-144-hz-sans-reflet-et-dune-finesse-exceptionnelle</guid>
      <description>
Boulanger fait une sacr&#233;e r&#233;duction sur un t&#233;l&#233;viseur premium et gigantesque : le Samsung TQ77S95D passe de 4999 euros &#224; sa sortie, &#224; 2299 euros ici.
</description>
    </item>
    <item>
      <title>On en sait plus sur le smartphone Pocket PLAY d&#8217;Ayaneo : fiche technique de brute, ergonomie &#224; quitte ou double</title>
      <link>https://www.frandroid.com/marques/ayaneo/2922087_on-en-sait-plus-sur-le-smartphone-pocket-play-dayaneo-fiche-technique-de-brute-ergonomie-a-quitte-ou-double</link>
      <pubDate>Mon, 29 Dec 2025 11:16:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/ayaneo/2922087_on-en-sait-plus-sur-le-smartphone-pocket-play-dayaneo-fiche-technique-de-brute-ergonomie-a-quitte-ou-double</guid>
      <description>
Le r&#234;ve du Xperia Play est de retour. Ayaneo vient de d&#233;tailler son Pocket PLAY, un smartphone gaming au format coulissant. Sur le papier, l'&#233;cran OLED 165 Hz sans encoche fait envie. Mais la marque a fait un choix technique sur les contr&#244;les qui risque de faire hurler les puristes.
</description>
    </item>
    <item>
      <title>iPhone pliant&#160;: malgr&#233; un proc&#232;s avec Apple, ce leaker le montre en vid&#233;o</title>
      <link>https://www.01net.com/actualites/iphone-pliant-malgre-un-proces-avec-apple-ce-leaker-le-montre-en-video.html</link>
      <pubDate>Mon, 29 Dec 2025 11:11:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317448</guid>
      <description>Le c&#233;l&#232;bre leaker Jon Prosser, pourtant en plein litige juridique avec la Pomme, vient de publier une vid&#233;o explosive. Il y d&#233;taille le futur iPhone pliant attendu pour 2026, avec des rendus 3D ultra-pr&#233;cis.</description>
    </item>
    <item>
      <title>Montres Garmin : cette nouvelle option va booster votre autonomie pour vos sorties longues</title>
      <link>https://www.frandroid.com/marques/garmin/2921909_montres-garmin-cette-nouvelle-option-va-booster-votre-autonomie-pour-vos-sorties-longues</link>
      <pubDate>Mon, 29 Dec 2025 11:07:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/garmin/2921909_montres-garmin-cette-nouvelle-option-va-booster-votre-autonomie-pour-vos-sorties-longues</guid>
      <description>
Garmin a publi&#233; une mise &#224; jour pour ses montres de sport permettant de profiter d'outils bien plus avanc&#233;s pour g&#233;rer la consommation de batterie.
</description>
    </item>
    <item>
      <title>En 2026, les &#233;crans gaming vont enfin d&#233;passer les 1000 Hz, mais pour quoi faire ?</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/ecran-pc/2921867_en-2026-les-ecrans-gaming-vont-enfin-depasser-les-1000-hz-mais-pour-quoi-faire</link>
      <pubDate>Mon, 29 Dec 2025 11:03:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/ecran-pc/2921867_en-2026-les-ecrans-gaming-vont-enfin-depasser-les-1000-hz-mais-pour-quoi-faire</guid>
      <description>
Samsung et HKC ont d&#233;voil&#233; deux &#233;crans &#224; plus de 1 000 Hz qui seront officiellement pr&#233;sent&#233;s au CES 2026 de Las Vegas. Si la barri&#232;re bris&#233;e est symbolique, elle n'indique cependant pas une tendance de fond pour les &#233;crans de jeu sur PC.
</description>
    </item>
    <item>
      <title>Votre PC va souffler : Microsoft acc&#233;l&#232;re radicalement la recherche sous Windows 11</title>
      <link>https://www.frandroid.com/marques/microsoft/2921839_votre-pc-va-souffler-microsoft-accelere-radicalement-la-recherche-sous-windows-11</link>
      <pubDate>Mon, 29 Dec 2025 11:01:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2921839_votre-pc-va-souffler-microsoft-accelere-radicalement-la-recherche-sous-windows-11</guid>
      <description>
Microsoft va r&#233;duire le temps de recherche de l'Explorateur de fichiers. Une optimisation simple qui devrait soulager les utilisateurs de Windows 11 avec une configuration modeste. 
</description>
    </item>
    <item>
      <title>3 New Tricks to Try With Google Gemini Live After Its Latest Major Upgrade</title>
      <link>https://www.wired.com/story/3-tricks-google-gemini-live-latest-major-upgrade/</link>
      <pubDate>Mon, 29 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">693cab53d6000ff8d3d2288c</guid>
      <description>Google's AI is now even smarter, and more versatile.</description>
    </item>
    <item>
      <title>The New Surveillance State Is You</title>
      <link>https://www.wired.com/story/expired-tired-wired-surveillance-state/</link>
      <pubDate>Mon, 29 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">691ba3cfa5d5636ff2e7189a</guid>
      <description>Privacy may be dead, but civilians are turning conventional wisdom on its head by surveilling the cops as much as the cops surveil them.</description>
    </item>
    <item>
      <title>The Year &#8216;Magatecture&#8217; consumed the White House</title>
      <link>https://www.fastcompany.com/91464736/the-year-magatecture-consumed-the-white-house</link>
      <pubDate>2025-12-29T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464736/the-year-magatecture-consumed-the-white-house</guid>
      <description>Extra-tall flagpoles, a $400 million ballroom, and lots and lots of gold. For the first year of his second term, Trump&#8217;s been busy remaking 1600 Pennsylvania Avenue in his image.
All the changes to the White House over the past year read like a reality TV drama. Clashes with architects. A lawsuit over the East Wing demolition. Paving over the beloved Rose Garden and turning it into an exclusive club. President Trump&#8217;s promise (or was it a threat?) to make federal buildings beautiful again primarily played out at 1600 Pennsylvania Avenue....</description>
    </item>
    <item>
      <title>This is what to do if you experience professional ghosting</title>
      <link>https://www.fastcompany.com/91465689/this-is-what-to-do-if-you-experience-professional-ghosting</link>
      <pubDate>2025-12-29T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91465689/this-is-what-to-do-if-you-experience-professional-ghosting</guid>
      <description>Do these things to move forward from the experience. 
A little while ago, I&#8217;d submitted my article to a well-respected publication that I&#8217;d done a lot of research for. I was beyond excited and delighted when, following an encouraging meeting with a senior editor, I&#8217;d heard that they accepted it for publication. It had taken months to get the article to this point, many previous failed submission attempts, and over a decade of expertise and experience&#8212;but I&#8217;d finally done it! And it was going to be&#160;career-changing. Unfortunately, what happened next was anything but....</description>
    </item>
    <item>
      <title>Deux nouvelles barres de son qui veulent changer la donne : Samsung HW-Q990H et HW-QS90H</title>
      <link>https://www.frandroid.com/marques/samsung/2922029_deux-nouvelles-barres-de-son-qui-veulent-changer-la-donne-samsung-hw-q990h-et-hw-qs90h</link>
      <pubDate>Mon, 29 Dec 2025 10:56:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2922029_deux-nouvelles-barres-de-son-qui-veulent-changer-la-donne-samsung-hw-q990h-et-hw-qs90h</guid>
      <description>
Samsung met &#224; jour sa gamme audio 2026 avec deux barres de son Q-Series phares, les Samsung HW-Q990H et HW-QS90H qui seront officiellement pr&#233;sent&#233;es lors du CES 2026 &#224; Las Vegas.
</description>
    </item>
  </channel>
</rss>
