<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 09 Nov 2025 16:41:40 GMT</lastBuildDate>
    <item>
      <title>Looking to snap up an early Black Friday deal on a new MacBook Air? Here's your chance - the M4 model is literally the cheapest it's ever been</title>
      <link>https://www.techradar.com/cameras/action-cameras/looking-to-snap-up-an-early-black-friday-deal-on-a-new-macbook-air-heres-your-chance-the-m4-model-is-literally-the-cheapest-its-ever-been</link>
      <pubDate>Sun, 09 Nov 2025 16:30:00 +0000</pubDate>
      <guid isPermaLink="false">Jra9pNqcb6VRw88CX7rTC6</guid>
      <description>If you're looking to snap up a MacBook this Black Friday, here's an early deal that'll save you $250.</description>
    </item>
    <item>
      <title>Suunto Vertical : cette montre de sport outdoor ultra-endurante est &#224; -33 % en ce pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2857255_suunto-vertical-cet-montre-de-sport-outdoor-ultra-endurante-est-a-33-en-ce-pre-black-friday</link>
      <pubDate>Sun, 09 Nov 2025 16:20:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2857255_suunto-vertical-cet-montre-de-sport-outdoor-ultra-endurante-est-a-33-en-ce-pre-black-friday</guid>
      <description>
Autonomie bluffante, cartographie d&#233;taill&#233;e, GNSS multibandes pr&#233;cis... La Suunto Vertical est clairement taill&#233;e pour les activit&#233;s outdoor. Cette montre connect&#233;e lanc&#233;e il y a deux ans est de retour en promotion pendant le pr&#233;-Black Friday : Amazon la propose &#224; 429 euros au lieu de 599 euros. 
</description>
    </item>
    <item>
      <title>Consoles, manettes et accessoires : le top 8 des meilleures offres gaming avant le Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2853043_lavant-premiere-du-black-friday-fait-la-part-belle-au-gaming-avec-la-nintendo-switch-2-en-promo-et-bien-dautres</link>
      <pubDate>Sun, 09 Nov 2025 16:09:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2853043_lavant-premiere-du-black-friday-fait-la-part-belle-au-gaming-avec-la-nintendo-switch-2-en-promo-et-bien-dautres</guid>
      <description>
L'ann&#233;e 2025 a &#233;t&#233; on ne peut plus riche pour le jeu vid&#233;o. Outre la sortie de nouveaux titres, la Nintendo Switch 2 a accapar&#233; toute l'attention cet &#233;t&#233; et continue de le faire aujourd'hui. D'autant plus qu'elle fait partie des meilleures offres dans cette s&#233;lection du pr&#233;-Black Friday.
</description>
    </item>
    <item>
      <title>Better object removal, improved lighting and more - these "Sneaks" could be Adobe's next big leap forward</title>
      <link>https://www.techradar.com/pro/better-object-removal-improved-lighting-and-more-these-sneaks-could-be-adobes-next-big-leap-forward</link>
      <pubDate>Sun, 09 Nov 2025 16:04:00 +0000</pubDate>
      <guid isPermaLink="false">T9EEvGdjj3C2WgzzHppvga</guid>
      <description>Adobe Sneaks is an opportunity for insiders and staff to put their projects in front of thousands.</description>
    </item>
    <item>
      <title>Xbox is dead &#8211; here's why I want to buy this compact gaming PC on Black Friday instead</title>
      <link>https://www.techradar.com/cameras/action-cameras/xbox-is-dead-heres-why-i-want-to-buy-this-compact-gaming-pc-on-black-friday-instead</link>
      <pubDate>Sun, 09 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">KfofE25S3ktNvYsjn9aQ6T</guid>
      <description>The Asus ROG NUC is one of the best mini gaming PCs I've ever seen, and with the console wars grinding to a halt, there's never been a better time to jump to PC.</description>
    </item>
    <item>
      <title>Black Friday OLED TV deals are live &#8211; shop record-low prices from Samsung, LG and Sony</title>
      <link>https://www.techradar.com/seasonal-sales/black-friday-oled-tv-deals-are-live-shop-record-low-prices-from-samsung-lg-and-sony</link>
      <pubDate>Sun, 09 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">jjzxjDTSYZq7swBwqweoPi</guid>
      <description>Black Friday OLED TV deals are live thanks to early sales, and I'm rounding up today's top offers on this year's top-rated OLED displays from Samsung, LG, and Sony.</description>
    </item>
    <item>
      <title>Netflix&#8217;s &#8216;Stranger Things&#8217; and &#8216;Squid Game&#8217; Experiences Hit Dallas Next Month</title>
      <link>https://gizmodo.com/netflixs-stranger-things-and-squid-game-experiences-hit-dallas-next-month-2000683426</link>
      <pubDate>Sun, 09 Nov 2025 15:30:14 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683426</guid>
      <description>If you can't get enough 'Squid Game' or 'Stranger Things' this year, Netflix House has some immersive experiences in Dallas for you.</description>
    </item>
    <item>
      <title>Our 8 Favorite Pizza Ovens: Wood, Gas, Electric, and Grill (2025)</title>
      <link>https://www.wired.com/gallery/best-backyard-pizza-oven/</link>
      <pubDate>Sun, 09 Nov 2025 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">667f3b96d52a1baa605ef2b0</guid>
      <description>Craving carb-y comfort? We picked our favorite outdoor ovens for backyards, countertops, or camping.</description>
    </item>
    <item>
      <title>The tale of the Fire Phone, Amazon&#8217;s very strange smartphone</title>
      <link>https://www.theverge.com/podcast/816739/amazon-fire-phone-version-history</link>
      <pubDate>2025-11-09T10:20:24-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=816739</guid>
      <description>When Jeff Bezos decided Amazon needed to get in the smartphone game, he went all in. And the resulting device, the Fire Phone, wound up more densely packed with big ideas than just about any gadget you'll find anywhere. There was just one tiny problem: they were mostly bad ideas. The Fire Phone shipped in [&#8230;]</description>
    </item>
    <item>
      <title>I'm a Black Friday expert &#8211; here are 13 early deals worth adding to your cart right now</title>
      <link>https://www.techradar.com/seasonal-sales/im-a-black-friday-expert-here-are-13-early-deals-worth-adding-to-your-cart-right-now</link>
      <pubDate>Sun, 09 Nov 2025 15:18:32 +0000</pubDate>
      <guid isPermaLink="false">VeWP7J9iaKNcx8JbqaGpsT</guid>
      <description>While there are hundreds of early Black Friday deals, only a select few are actually worth buying, and as a deals expert, I'm rounding up my 13 favorite offers.</description>
    </item>
    <item>
      <title>Pete Davidson returns to the Weekend Update desk to explain Riyadh Comedy Festival</title>
      <link>https://mashable.com/video/snl-pete-davidson-weekend-update-return</link>
      <pubDate>Sun, 09 Nov 2025 15:15:37 +0000</pubDate>
      <guid isPermaLink="false">05HeGIQfSdh2FsNLkAkkKrh</guid>
      <description>Ex-SNL cast member Pete Davidson gives excuses for Saudi Arabia comedy festival, rags on Colin Jost, and (partially) defends Staten Island.</description>
    </item>
    <item>
      <title>Fnac et Darty se montrent bien g&#233;n&#233;reux lors du pr&#233;-Black Friday : les 18 deals qui valent le coup</title>
      <link>https://www.frandroid.com/bons-plans/2849237_fnac-et-darty-se-montrent-bien-genereux-lors-du-pre-black-friday-les-15-deals-qui-valent-le-coup</link>
      <pubDate>Sun, 09 Nov 2025 15:12:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849237_fnac-et-darty-se-montrent-bien-genereux-lors-du-pre-black-friday-les-15-deals-qui-valent-le-coup</guid>
      <description>
Pour ne pas laisser le champ libre &#224; Boulanger, la Fnac et Darty prennent aussi de l'avance sur le Black Friday et d&#233;ploient &#224; leur tour de solides offres sur de nombreux produits Tech. Nous avons fait le tri parmi toutes les offres, et voici uniquement celles qui valent le coup. 
</description>
    </item>
    <item>
      <title>La photo de la semaine : un ph&#233;nom&#232;ne c&#233;leste ultra-rare capt&#233; pile au bon moment</title>
      <link>https://www.futura-sciences.com/sciences/breves/voie-lactee-photo-semaine-phenomene-celeste-ultra-rare-capte-pile-bon-moment-10841/#xtor%3DRSS-8</link>
      <pubDate>Sun, 09 Nov 2025 16:08:52 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/breves/voie-lactee-photo-semaine-phenomene-celeste-ultra-rare-capte-pile-bon-moment-10841/#xtor%3DRSS-8</guid>
      <description>La photo de cette semaine est ind&#233;niablement de celles qui font r&#234;ver. Parce qu&#8217;&#224; la veille de l&#8217;ouverture de la COP30 &#224; Bel&#233;m (Br&#233;sil) et alors que les scientifiques des Nations unies viennent d&#8217;annoncer que nous avons perdu une premi&#232;re bataille dans notre guerre contre le r&#233;chauffement...</description>
    </item>
    <item>
      <title>6 Best Dyson Vacuums (2025): V15 Detect, Gen5 Detect, Digital Slim</title>
      <link>https://www.wired.com/gallery/best-dyson-vacuums/</link>
      <pubDate>Sun, 09 Nov 2025 15:02:00 +0000</pubDate>
      <guid isPermaLink="false">5df3c23c48e9d2000853d4fb</guid>
      <description>Feeling the pull of a new clean machine? We&#8217;ll help you make sense of Dyson&#8217;s whirlwind vacuum lineup.</description>
    </item>
    <item>
      <title>Une Porsche au prix d&#8217;une Tesla Model 3 : j&#8217;ai essay&#233; ces deux voitures &#233;lectriques et voici celle qu&#8217;il faut choisir</title>
      <link>https://www.frandroid.com/marques/porsche/2857665_une-porsche-au-prix-dune-tesla-model-3-jai-essaye-ces-deux-voitures-electriques-et-voici-celle-quil-faut-choisir</link>
      <pubDate>Sun, 09 Nov 2025 15:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/porsche/2857665_une-porsche-au-prix-dune-tesla-model-3-jai-essaye-ces-deux-voitures-electriques-et-voici-celle-quil-faut-choisir</guid>
      <description>
J'ai pu tester la Porsche Taycan &#233;lectrique sur 1 500 km. De quoi la comparer avec la Tesla Model 3. Pourquoi ? Car il est possible d'acheter une Porsche &#233;lectrique d'occasion au m&#234;me prix qu'une Tesla neuve. On compare ces deux choix, entre passion et raison.
</description>
    </item>
    <item>
      <title>Deck out your tree with ornaments of retro consoles, movie moments, and more</title>
      <link>https://www.theverge.com/tech/811614/best-christmas-ornaments-2025</link>
      <pubDate>2025-11-09T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=811614</guid>
      <description>Do the ornaments you adorn your Christmas tree with reflect you or your family&#8217;s interests? If not, maybe you should rectify that. We recently went hands on with Hallmark&#8217;s realistic Xbox 360 replica ornament, which plays a snippet of audio from Halo 3. As it turns out, there are many other ornaments available that are [&#8230;]</description>
    </item>
    <item>
      <title>What is iCloud+? And is it worth the money?</title>
      <link>https://www.techradar.com/computing/software/what-is-icloud-and-is-it-worth-the-money</link>
      <pubDate>Sun, 09 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">aTEWtd93CsYfdWhCn3C6We</guid>
      <description>Wondering if you should upgrade to a paid iCloud+ plan? Here&#8217;s everything the service has to offer.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Monday, November 10 (game #1386)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-10-november-2025</link>
      <pubDate>Sun, 09 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">sZhtS3FYuLVAT33daRZ56V</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Monday, November 10 (game #883)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-10-november-2025</link>
      <pubDate>Sun, 09 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">CKiEQEBPqWyZGQKRDkCvZE</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Monday, November 10 (game #617)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-10-november-2025</link>
      <pubDate>Sun, 09 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">L7wRY3JYXTEgyfgfKycMxL</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>SNL Cold Open gets Trumps thoughts on the NYC mayor, SNAP, and the Grinch</title>
      <link>https://mashable.com/video/snl-nikki-glaser-cold-open</link>
      <pubDate>Sun, 09 Nov 2025 14:54:27 +0000</pubDate>
      <guid isPermaLink="false">05Xqlk8PJwbTV8SsmQEfwwU</guid>
      <description>SNL's recent episode, hosted by Nikki Glaser, opens with another unsettlingly good Trump impression.</description>
    </item>
    <item>
      <title>SNL American Girl Doll sketch gets uncomfortable, fast</title>
      <link>https://mashable.com/video/snl-american-girl-doll-xl-sketch</link>
      <pubDate>Sun, 09 Nov 2025 14:44:22 +0000</pubDate>
      <guid isPermaLink="false">04CgiOdzZvXsnbh9Ye5mEBK</guid>
      <description>'SNL' American Girl Doll sketch gets uncomfortable, fast</description>
    </item>
  </channel>
</rss>
