<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 08 Feb 2026 08:38:20 GMT</lastBuildDate>
    <item>
      <title>&#201;cran 90 Hz et 7 ans de mises &#224; jour : la Samsung Galaxy Tab A11 version 128 Go ne d&#233;passe pas 180 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2969029_ecran-90-hz-et-7-ans-de-mises-a-jour-la-samsung-galaxy-tab-a11-version-128-go-ne-depasse-pas-180-e</link>
      <pubDate>Sun, 08 Feb 2026 08:22:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2969029_ecran-90-hz-et-7-ans-de-mises-a-jour-la-samsung-galaxy-tab-a11-version-128-go-ne-depasse-pas-180-e</guid>
      <description>
Avec son &#233;cran bien fluide et son suivi logiciel rassurant, la Samsung Galaxy Tab A11 compte parmi les tablettes tactiles abordables les plus recommandables du moment. C'est d'autant plus le cas quand elle est propos&#233;e &#224; 179,90 euros au lieu de 229,90 euros dans sa version 128 Go, comme sur Amazon.
</description>
    </item>
    <item>
      <title>Android&#160;: ce malware espion vous pi&#232;ge avec une fausse conversation WhatsApp</title>
      <link>https://www.01net.com/actualites/android-ce-malware-espion-vous-piege-avec-une-fausse-conversation-whatsapp.html</link>
      <pubDate>Sun, 08 Feb 2026 08:01:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323880</guid>
      <description>Une fausse appli de rencontre tente actuellement de pi&#233;ger certains utilisateurs Android. L'application sert de cheval de Troie pour installer GhostChat sur votre smartphone. Ce virus va piller toutes vos donn&#233;es, tandis qu'un pirate converse avec vous sur WhatsApp en se faisant passer pour une pr&#233;tendante. L'op&#233;ration s&#8217;inscrit dans une vaste campagne d&#8217;espionnage qui vise &#224; la fois les t&#233;l&#233;phones et les ordinateurs....</description>
    </item>
    <item>
      <title>Friend&#160;: le pendentif IA qui promet de combattre la solitude, en vous &#233;coutant en permanence</title>
      <link>https://www.01net.com/actualites/friend-le-pendentif-ia-qui-promet-de-combattre-la-solitude-en-vous-ecoutant-en-permanence.html</link>
      <pubDate>Sun, 08 Feb 2026 07:06:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324607</guid>
      <description>Depuis plusieurs semaines, des publicit&#233;s pour un pendentif connect&#233; de la soci&#233;t&#233; Friend s&#8217;affichent dans le m&#233;tro parisien. Pr&#233;sent&#233; comme un &#171; ami virtuel &#187;, ce gadget embarque une intelligence artificielle capable de capter les d&#233;placements, les conversations et les sons environnants pour interagir en temps r&#233;el avec son propri&#233;taire. Cet objet semble &#234;tre la promesse de lutter contre la solitude, au prix d&#8217;une &#233;coute permanente....</description>
    </item>
    <item>
      <title>AI didn&#8217;t kill customer support. It&#8217;s rebuilding it</title>
      <link>https://www.fastcompany.com/91484518/ai-didnt-kill-customer-support-its-rebuilding-it</link>
      <pubDate>2026-02-08T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91484518/ai-didnt-kill-customer-support-its-rebuilding-it</guid>
      <description>As AI absorbs routine tickets, support roles are shifting toward systems thinking, technical fluency, and human judgment at scale.
A few months ago, I walked into the office of one of our customers, a publicly traded vertical software company with tens of thousands of small business customers. I expected to meet a traditional support team with rows of agents on the phones, sitting at computers triaging tickets. Instead, it looked more like a control room....</description>
    </item>
    <item>
      <title>Ces 3 forfaits 5G de la semaine cachent des bonus qui ne dureront pas</title>
      <link>https://www.frandroid.com/marques/2968517_ces-3-forfaits-5g-de-la-semaine-cachent-des-bonus-qui-ne-dureront-pas</link>
      <pubDate>Sun, 08 Feb 2026 06:51:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2968517_ces-3-forfaits-5g-de-la-semaine-cachent-des-bonus-qui-ne-dureront-pas</guid>
      <description>
Cette semaine, Free, B&amp;You et NRJ Mobile frappent fort avec des forfaits mobiles 5G sans engagement. Parfaites pour le streaming intensif ou les voyages, ces offres int&#232;grent aussi des bonus limit&#233;s comme Perplexity Pro ou l&#8217;option Watch.
</description>
    </item>
  </channel>
</rss>
