<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 30 Dec 2025 14:25:48 GMT</lastBuildDate>
    <item>
      <title>Ni lithium, ni cobalt : tout savoir sur la batterie au sel qui &#233;quipera certaines voitures d&#232;s 2026</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2922821_ni-lithium-ni-cobalt-tout-savoir-sur-la-batterie-au-sel-qui-equipera-certaines-voitures-des-2026</link>
      <pubDate>Tue, 30 Dec 2025 14:25:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2922821_ni-lithium-ni-cobalt-tout-savoir-sur-la-batterie-au-sel-qui-equipera-certaines-voitures-des-2026</guid>
      <description>
Selon le g&#233;ant chinois CATL, les batteries au sodium (au sel, sans lithium) devraient se d&#233;velopper &#224; grande &#233;chelle &#224; partir de 2026. Et tout particuli&#232;rement le cas dans le secteur des voitures &#233;lectriques.
</description>
    </item>
    <item>
      <title>Les meilleurs claviers gaming m&#233;caniques en 2025 : guide d&#8217;achat complet</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-gaming/671139_meilleurs-claviers-gaming-mecaniques</link>
      <pubDate>Tue, 30 Dec 2025 14:18:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-gaming/671139_meilleurs-claviers-gaming-mecaniques</guid>
      <description>
Vous &#234;tes perdus dans la jungle des claviers pour le gaming ? On fait le point sur les meilleurs mod&#232;les du march&#233; et toutes les caract&#233;ristiques &#224; prendre en compte avant d'acheter votre nouveau clavier m&#233;canique pour jouer. 
</description>
    </item>
    <item>
      <title>Adieu le flou : ce petit outil gratuit vous permet de retrouver la fluidit&#233; l&#233;gendaire du CRT sur votre &#233;cran PC</title>
      <link>https://www.frandroid.com/produits-android/console/2923161_adieu-le-flou-ce-petit-outil-gratuit-vous-permet-de-retrouver-la-fluidite-legendaire-du-crt-sur-votre-ecran-pc</link>
      <pubDate>Tue, 30 Dec 2025 14:12:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2923161_adieu-le-flou-ce-petit-outil-gratuit-vous-permet-de-retrouver-la-fluidite-legendaire-du-crt-sur-votre-ecran-pc</guid>
      <description>
Et si vous profitiez de la fluidit&#233; d'un &#233;cran CRT sur votre &#233;cran de PC ? ShaderBeam est un nouvel outil qui vous promet de retrouver la clart&#233; de mouvement des &#233;crans cathodiques sur n'importe quelle dalle moderne.
</description>
    </item>
    <item>
      <title>TCL&#8217;s New Paper-Like Tablet Has a Bunch of AI in It</title>
      <link>https://gizmodo.com/tcls-new-paper-like-tablet-has-a-bunch-of-ai-in-it-2000703992</link>
      <pubDate>Tue, 30 Dec 2025 14:05:51 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703992</guid>
      <description>The Note A1 Nxtpaper throws a lot of AI features at the wall.</description>
    </item>
    <item>
      <title>I'm TechRadar Pro's hardware editor - here are the 9 coolest business tech we reviewed this year from world-first business laptops to electric office chairs</title>
      <link>https://www.techradar.com/pro/im-techradar-pros-hardware-editor-here-are-the-9-coolest-business-tech-we-reviewed-this-year-from-world-first-business-laptops-to-electric-office-chairs</link>
      <pubDate>Tue, 30 Dec 2025 14:05:00 +0000</pubDate>
      <guid isPermaLink="false">ejrqJGWUj2AZcZXimKTeFM</guid>
      <description>The best business tech we tested in 2025.</description>
    </item>
    <item>
      <title>Les &#233;crans pliants s&#8217;adaptent aux consoles portables</title>
      <link>https://www.01net.com/actualites/les-ecrans-pliants-sadaptent-aux-consoles-portables.html</link>
      <pubDate>Tue, 30 Dec 2025 14:03:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317635</guid>
      <description>Et si la prochaine id&#233;e un peu folle du jeu mobile venait des &#233;crans pliants ? One-Netbook, adepte des formats atypiques, s&#8217;attaque au concept de console portable avec la OneXSugar Wallet, un appareil hybride qui se plie et se d&#233;plie pour passer d&#8217;un objet compact &#224; une machine de jeu &#224; grand &#233;cran.</description>
    </item>
    <item>
      <title>Ce sont peut-&#234;tre les derni&#232;res offres avant la fin d&#8217;ann&#233;e pour la PS5 Slim</title>
      <link>https://www.frandroid.com/bons-plans/2920581_ce-sont-peut-etre-les-dernieres-offres-avant-la-fin-dannee-pour-la-ps5-slim</link>
      <pubDate>Tue, 30 Dec 2025 14:03:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2920581_ce-sont-peut-etre-les-dernieres-offres-avant-la-fin-dannee-pour-la-ps5-slim</guid>
      <description>
Compacte, dot&#233;e d'un espace de stockage confortable et toujours aussi performante, la PS5 Slim est bien plac&#233;e sur le podium des consoles next-gen. Si vous n'avez pas encore craqu&#233;, sachez qu'elle est actuellement, et s&#251;rement pour la derni&#232;re fois de cette fin d'ann&#233;e 2025, en promo : PC Componentes la propose en pack avec une DualSense suppl&#233;mentaire &#224; 494,88 euros au lieu de 599,99 euros, ou seule &#224; 445,29 euros au lieu de 549,99 euros.
...</description>
    </item>
    <item>
      <title>Final stretch of 2025 shows mixed shares in global markets</title>
      <link>https://www.fastcompany.com/91467748/final-stretch-2025-shows-mixed-shares-global-markets</link>
      <pubDate>2025-12-30T14:01:27</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91467748/final-stretch-2025-shows-mixed-shares-global-markets</guid>
      <description>Most markets will not operate on New Year&#8217;s day, and some will also be closed Wednesday and Friday.
Shares opened mixed in Europe on Tuesday after slipping in Asia as some regional markets wrapped up trading for the year.Crude oil prices edged higher and gold and silver resumed their ascent. U.S. futures were flat.In Tokyo, Japanese Prime Minister Sanae Takaichi rang out the final session for 2025 in a traditional year-end ceremony.&#8220;By realizing a Japanese economy that earns the trust of investors around the world, we will create a virtuous cycle in which global capital flows into Japan,&#8221; Taka...</description>
    </item>
    <item>
      <title>Meta buys startup known for its AI task automation agents</title>
      <link>https://www.engadget.com/ai/meta-buys-startup-known-for-its-ai-task-automation-agents-140045275.html?src=rss</link>
      <pubDate>Tue, 30 Dec 2025 14:00:45 +0000</pubDate>
      <guid isPermaLink="false">35d389ba-b56d-4881-a576-2b009dd12336</guid>
      <description>Meta has acquired an AI startup called Manus &#8212; known for its custom research and website-building agents &#8212; in a deal valued at more than $2 billion, according toThe Wall Street Journal. It's reportedly one of the largest acquisitions yet involving a startup nurtured in China's AI ecosystem.&#160;
Manus arrived in March 2025, shortly after another Chinese AI startup, DeepSeek appeared on the scene. The company (called Butterfly Effect at the time) originally described it as "the first general AI agent" to perform complex tasks autonomously, rather than just generating ideas. It draws from several th...</description>
    </item>
    <item>
      <title>Thor Dreads Loss in the Latest &#8216;Avengers: Doomsday&#8217; Trailer</title>
      <link>https://gizmodo.com/avengers-doomsday-trailer-thor-marvel-studios-2000703069</link>
      <pubDate>Tue, 30 Dec 2025 14:00:31 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703069</guid>
      <description>Chris Hemsworth returns as the god of thunder in our latest look at the next 'Avengers' movie.</description>
    </item>
    <item>
      <title>The Canon EOS R6 Mark III is great, but this lens is amazing</title>
      <link>https://www.theverge.com/gadgets/850602/canon-eos-r6-mark-iii-rf-45mm-12-camera-lens-impressions-review</link>
      <pubDate>2025-12-30T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=850602</guid>
      <description>Canon's new EOS R6 Mark III is an excellent camera. It's not a groundbreaking upgrade to the 3-year-old R6 Mark II, but it takes the same body with great ergonomics and adds more resolution, video that now goes up to 7K with open-gate filming, and improved autofocus performance. If you're in need of an impeccably [&#8230;]</description>
    </item>
    <item>
      <title>Here&#8217;s what you should know about the US TikTok deal</title>
      <link>https://techcrunch.com/2025/12/30/heres-whats-you-should-know-about-the-us-tiktok-deal/</link>
      <pubDate>Tue, 30 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=2966426</guid>
      <description>A number of investors are competing for the opportunity to purchase the app, and if a deal were to go through, the platform's U.S. business could have its valuation soar to upward of $60 billion.</description>
    </item>
    <item>
      <title>I tested the Cuisinart FlexPrep 1.1L&#8211; a budget-friendly but incredibly powerful food processor</title>
      <link>https://www.techradar.com/home/small-appliances/cuisinart-flexprep-1-1-l-food-processor-review</link>
      <pubDate>Tue, 30 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">BKamrzhspZP5G3pChWKQhE</guid>
      <description>The Cuisinart FlexPrep 1.1L Food Processor packs a lot of power in a compact package, delivering high-quality results with impressive speed.</description>
    </item>
    <item>
      <title>TCL introduces its own take on a color Kindle Scribe</title>
      <link>https://www.engadget.com/mobile/tablets/tcl-introduces-its-own-take-on-a-color-kindle-scribe-140000207.html?src=rss</link>
      <pubDate>Tue, 30 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">7219a2bf-94ab-4baa-9de5-af9793683a56</guid>
      <description>Hot on the tail of Amazon's Kindle Scribe Colorosoft, TCL is introducing its own take on a distraction-free note-taking and reading device. Unlike the new Scribe, however, it doesn't use E Ink. The TCL Note A1 NXTPAPER is the company's latest device to use NXTPAPER, TCL's custom paper-like LCD screen, which offers some of the qualities of E Ink without the limitations.TCL says the 11.5-inch color "NXTPAPER Pure" display on the Note A1 has a 2,200 x 1,440 resolution and a 120Hz refresh rate, which should mean it looks clearer and feels much smoother to interact with than the color E Ink screen ...</description>
    </item>
    <item>
      <title>Samsung Galaxy S26 Ultra&#160;: une vid&#233;o d&#233;voile son design massif en avance</title>
      <link>https://www.01net.com/actualites/samsung-galaxy-s26-ultra-une-video-devoile-son-design-massif-en-avance.html</link>
      <pubDate>Tue, 30 Dec 2025 13:37:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317632</guid>
      <description>L'ann&#233;e 2025 se termine sur une note explosive pour les fans de Samsung. Alors que la pr&#233;sentation officielle n'est attendue qu'en f&#233;vrier, une fuite d'une ampleur in&#233;dite vient de lever le voile sur le design d&#233;finitif des futurs fleurons de la marque.</description>
    </item>
    <item>
      <title>Samsung is reportedly readying a Brain Health feature to check for early signs of dementia</title>
      <link>https://www.techradar.com/health-fitness/samsung-is-reportedly-readying-a-brain-health-feature-to-check-for-early-signs-of-dementia</link>
      <pubDate>Tue, 30 Dec 2025 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">SRqn9S6824469HnBa2yzUg</guid>
      <description>Brain Health by Samsung is apparently going to be launching at the CES 2026 show in January.</description>
    </item>
    <item>
      <title>How to watch the NVIDIA CES 2026 presentation live</title>
      <link>https://www.engadget.com/computing/how-to-watch-the-nvidia-ces-2026-presentation-live-130028065.html?src=rss</link>
      <pubDate>Tue, 30 Dec 2025 13:00:28 +0000</pubDate>
      <guid isPermaLink="false">4a8ad1a0-9035-4f52-a4e0-783ee7c9700b</guid>
      <description>CFOTO via Getty Images
At CES 2025, NVIDIA spent the bulk of its presentation touting (what else) its leading position in the artificial intelligence arena. But it also spent time talking up new hardware, including its RTX 5000-series GPUs and Project Digits desktop supercomputer (later redubbed Spark). This year, the company's website says it's "lighting up CES 2026 with the power of AI." To that end, NVIDIA is pulling out all the stops at its Vegas installation, promising hands-on demos in its booth at the Fontainebleau, replete with the "latest NVIDIA solutions driving innovation and produc...</description>
    </item>
    <item>
      <title>Free speech&#8217;s great leap backwards</title>
      <link>https://www.theverge.com/policy/849841/trump-immigration-social-media-free-speech</link>
      <pubDate>2025-12-30T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=849841</guid>
      <description>In early December, Joshua Aaron, the developer behind the ICEBlock app - designed to let people alert others about the presence of Immigration and Customs Enforcement (ICE) agents - filed a federal lawsuit alleging his First Amendment rights were violated. The Department of Justice had urged Apple to remove Aaron's app from its App Store, [&#8230;]</description>
    </item>
    <item>
      <title>Le Galaxy S26 Ultra se d&#233;voile en vid&#233;o et il a tout d&#8217;une brique</title>
      <link>https://www.frandroid.com/marques/2922671_le-galaxy-s26-ultra-se-devoile-en-video-et-il-a-tout-dune-brique</link>
      <pubDate>Tue, 30 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2922671_le-galaxy-s26-ultra-se-devoile-en-video-et-il-a-tout-dune-brique</guid>
      <description>
Le design du Galaxy S26 Ultra ne fait plus aucun doute. Une fuite d&#233;voile un smartphone aux ar&#234;tes bien droites.
</description>
    </item>
    <item>
      <title>Nvidia in 2025: year in review</title>
      <link>https://www.techradar.com/computing/gpu/nvidia-in-2025-year-in-review</link>
      <pubDate>Tue, 30 Dec 2025 12:45:00 +0000</pubDate>
      <guid isPermaLink="false">RM8HiR5iMSTYpBdoLYa4H</guid>
      <description>AI profits hit new heights, but it's been something of a rollercoaster for Nvidia this year with its new generation of Blackwell GPUs.</description>
    </item>
    <item>
      <title>Amazon fait &#8722;63 % sur le chargeur rapide Xiaomi 120 W qui d&#233;tecte vos appareils et adapte la puissance automatiquement</title>
      <link>https://www.frandroid.com/bons-plans/2923017_amazon-fait-%e2%88%9263-sur-le-chargeur-rapide-xiaomi-120-w-qui-detecte-vos-appareils-et-adapte-la-puissance-automatiquement</link>
      <pubDate>Tue, 30 Dec 2025 12:41:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2923017_amazon-fait-%e2%88%9263-sur-le-chargeur-rapide-xiaomi-120-w-qui-detecte-vos-appareils-et-adapte-la-puissance-automatiquement</guid>
      <description>
Avec le Xiaomi 120W Hypercharge Combo Type-A vous allez vite retrouver de l'autonomie sur vos appareils, surtout qu'il est en promo &#224; 25,69 euros au lieu de 69,99 euros.
</description>
    </item>
    <item>
      <title>Commodore 64 Ultimate Review: An Astonishing Remake</title>
      <link>https://www.wired.com/review/commodore-64-ultimate/</link>
      <pubDate>Tue, 30 Dec 2025 12:30:00 +0000</pubDate>
      <guid isPermaLink="false">694964e2d904ee60304dcddc</guid>
      <description>The reborn Commodore 64 is an astonishing remake&#8212;but daunting if you weren&#8217;t there the first time around.</description>
    </item>
  </channel>
</rss>
