<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 09 Dec 2025 08:35:43 GMT</lastBuildDate>
    <item>
      <title>Survols de drones en France&#160;: la base ultra-sensible de Creil a ripost&#233;, mais les appareils ont disparu</title>
      <link>https://www.01net.com/actualites/survols-drones-france-base-ultra-sensible-creil-riposte-mais-appareils-disparu.html</link>
      <pubDate>Tue, 09 Dec 2025 08:22:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314421</guid>
      <description>Des drones ont &#233;t&#233; identifi&#233;s au-dessus de la base militaire de Creil. Les d&#233;fenses ont tent&#233; d'abattre les engins, mais ceux-ci ont disparu dans la nuit. Il s'agit d'un nouveau site particuli&#232;rement sensible qui re&#231;oit la visite d'un essaim d'a&#233;ronefs.</description>
    </item>
    <item>
      <title>D&#233;j&#224; 8 bless&#233;s signal&#233;s : pourquoi ces v&#233;los &#233;lectriques et m&#233;caniques sont rappel&#233;s en urgence</title>
      <link>https://www.frandroid.com/marques/cube/2902949_deja-8-blesses-signales-pourquoi-ces-velos-electriques-et-mecaniques-sont-rappeles-en-urgence</link>
      <pubDate>Tue, 09 Dec 2025 08:09:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/cube/2902949_deja-8-blesses-signales-pourquoi-ces-velos-electriques-et-mecaniques-sont-rappeles-en-urgence</guid>
      <description>
Trois fabricants de v&#233;los - Stromer, Klever Mobility et Cube - rappellent plusieurs de leurs mod&#232;les &#233;lectriques et m&#233;caniques apr&#232;s la d&#233;couverte d&#8217;un d&#233;faut sur une fourche WREN pouvant compromettre la s&#233;curit&#233; des cyclistes.
</description>
    </item>
    <item>
      <title>Amazon casse le prix de la Huawei Watch GT 5 version 46 mm, une montre connect&#233;e de sport ultra-endurante</title>
      <link>https://www.frandroid.com/bons-plans/2901965_amazon-casse-le-prix-de-la-huawei-watch-gt-5-version-46-mm-une-montre-connectee-de-sport-ultra-endurante</link>
      <pubDate>Tue, 09 Dec 2025 08:08:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2901965_amazon-casse-le-prix-de-la-huawei-watch-gt-5-version-46-mm-une-montre-connectee-de-sport-ultra-endurante</guid>
      <description>
Malgr&#233; la sortie r&#233;cente de la Huawei Watch GT 6, la Huawei Watch GT 5 demeure, un an apr&#232;s son lancement, une excellente montre de sport, qui a en plus l'avantage d'&#234;tre tr&#232;s endurante. Actuellement, Amazon la propose &#224; 169,99 euros au lieu de 269,99 euros. 
</description>
    </item>
    <item>
      <title>Fairphone's newest eco-friendly headphones have a feature I wish Bose or Sony would use &#8211; and the sound's good too</title>
      <link>https://www.techradar.com/audio/wireless-headphones/fairphone-fairbuds-xl-2025-review</link>
      <pubDate>Tue, 09 Dec 2025 08:05:00 +0000</pubDate>
      <guid isPermaLink="false">Hbu2n8mSsZ9t3kiaaTkgr</guid>
      <description>The most eco-friendly headphones just got a little bit eco friendlier &#8211; and slightly better sounding, too</description>
    </item>
    <item>
      <title>You can put the best part of Fairphone&amp;#8217;s new headphones into the older model</title>
      <link>https://www.theverge.com/news/839481/fairphone-xl-wireless-headphones-repairable-modular</link>
      <pubDate>2025-12-09T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=839481</guid>
      <description>Over two years after Fairphone introduced its first pair of modular and repairable wireless headphones, the company has announced an upgraded version. The new Fairbuds XL look similar to the originals but feature an updated design with more comfortable fabrics and improved sound thanks to new drivers. What's most interesting about these is that thanks [&#8230;]...</description>
    </item>
    <item>
      <title>Fairphone updates its over ear headphones with better sound</title>
      <link>https://www.engadget.com/audio/fairphone-updates-its-over-ear-headphones-with-better-sound-080000773.html?src=rss</link>
      <pubDate>Tue, 09 Dec 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">1b2023f2-cd30-4c42-9320-102883f95551</guid>
      <description>Two years ago, Fairphone launched a pair of modular, fully-repairable headphones called the Fairbuds XL. Now, the Dutch social enterprise is releasing an updated version where the focus isn&#8217;t just on the quality of its hardware, but on the merits of its raw materials.&#160;The 2025 Fairbuds XL ship with new &#8220;premium&#8221; 40mm dynamic drivers and stronger N52 rated magnets for &#8220;more power and enhanced bass response.&#8221; Listeners should expect to hear &#8220;improved accuracy in mid and high frequencies&#8221; thanks to improved audio tuning. And there&#8217;s a new paper-based speaker membrane that&#8217;s more refined than what...</description>
    </item>
    <item>
      <title>Gr&#226;ce &#224; l&#8217;Europe, vous pourrez bient&#244;t &#233;viter les publicit&#233;s cibl&#233;es sur Facebook et Instagram</title>
      <link>https://www.frandroid.com/marques/meta/2902943_grace-a-leurope-vous-pourrez-bientot-eviter-les-publicites-ciblees-sur-facebook-et-instagram</link>
      <pubDate>Tue, 09 Dec 2025 07:52:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2902943_grace-a-leurope-vous-pourrez-bientot-eviter-les-publicites-ciblees-sur-facebook-et-instagram</guid>
      <description>
Sous la menace d&#8217;une amende sal&#233;e de la part de la Commission europ&#233;enne, Meta va d&#233;ployer un syst&#232;me permettant aux internautes pr&#233;sents sur le Vieux Continent de recevoir des publicit&#233;s plus g&#233;n&#233;riques.
</description>
    </item>
    <item>
      <title>C&#8217;est la plus grande saisie de contrefa&#231;ons de son histoire : Specialized et AliExpress d&#233;mant&#232;lent deux r&#233;seaux li&#233;s au v&#233;lo</title>
      <link>https://www.frandroid.com/marques/specialized/2902935_cest-la-plus-grande-saisie-de-contrefacons-de-son-histoire-specialized-et-aliexpress-demantelent-deux-reseaux-lies-au-velo</link>
      <pubDate>Tue, 09 Dec 2025 07:26:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/specialized/2902935_cest-la-plus-grande-saisie-de-contrefacons-de-son-histoire-specialized-et-aliexpress-demantelent-deux-reseaux-lies-au-velo</guid>
      <description>
AliExpress, Specialized et les autorit&#233;s chinoises ont annonc&#233; avoir d&#233;mantel&#233; deux r&#233;seaux de production de contrefa&#231;ons, avec plus de 1,5 million de dollars de marchandises saisies et li&#233;es au v&#233;lo.
</description>
    </item>
    <item>
      <title>Microsoft va corriger ces deux gros d&#233;fauts dans Teams, et &#231;a va vous changer la vie</title>
      <link>https://www.01net.com/actualites/microsoft-va-corriger-ces-deux-gros-defauts-dans-teams-et-ca-va-vous-changer-la-vie.html</link>
      <pubDate>Tue, 09 Dec 2025 07:23:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314426</guid>
      <description>La plate-forme collaborative de Microsoft souffre de plusieurs d&#233;sagr&#233;ments au sein de sa messagerie. Microsoft est sur le point d&#8217;en corriger certains.</description>
    </item>
    <item>
      <title>Your own 'supercomputer' made up of old Framework motherboards? This Kickstarter project aims to achieve just that</title>
      <link>https://www.techradar.com/pro/your-own-supercomputer-made-up-of-old-framework-motherboards-this-kickstarter-project-aims-to-achieve-just-that</link>
      <pubDate>Tue, 09 Dec 2025 07:18:56 +0000</pubDate>
      <guid isPermaLink="false">GryUbb5o9fdK9czKzVbA3G</guid>
      <description>FrameCluster turns unused Framework mainboards into 3D-printed rack clusters, focusing on simple organization, practical reuse, small-scale production.</description>
    </item>
    <item>
      <title>Ce moniteur MSI QD-OLED de 27 pouces &#224; la fluidit&#233; exemplaire est nettement plus int&#233;ressant apr&#232;s 450 &#8364; de remise</title>
      <link>https://www.frandroid.com/bons-plans/2902153_ce-moniteur-msi-qd-oled-de-27-pouces-a-la-fluidite-exemplaire-est-nettement-plus-interessant-apres-450-e-de-remise</link>
      <pubDate>Tue, 09 Dec 2025 07:16:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2902153_ce-moniteur-msi-qd-oled-de-27-pouces-a-la-fluidite-exemplaire-est-nettement-plus-interessant-apres-450-e-de-remise</guid>
      <description>
Un moniteur OLED n'est pas &#224; la port&#233;e de toutes les bourses, c'est pourquoi lorsque l'un d'entre eux passe de 1 099 euros &#224; 649 euros, il devient plus int&#233;ressant de s'y pencher et c'est le cas du MSI MPG 271QRX. 
</description>
    </item>
    <item>
      <title>D&#233;missions en s&#233;rie chez Apple&#160;: le patron des puces Silicon n&#8217;a &#171;&#160;pas l&#8217;intention de partir&#160;&#187;</title>
      <link>https://www.01net.com/actualites/demissions-serie-chez-apple-patron-puces-silicon-envisage-serieusement-partir.html</link>
      <pubDate>Tue, 09 Dec 2025 07:07:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314160</guid>
      <description>Apple est en train de vivre le plus grand remaniement de direction depuis la mort de Steve Jobs. Des figures cl&#233;s comme Jeff Williams, Luca Maestri, Alan Dye ou encore John Giannandrea, ont abandonn&#233; leur poste. Par contre, le strat&#232;ge des puces Apple Silicon, Johny Srouji, indique &#224; ses &#233;quipes qu'il n'a pas l'intention de partir.</description>
    </item>
    <item>
      <title>01net Awards&#160;: le meilleur produit pour le jardin est&#8230;</title>
      <link>https://www.01net.com/actualites/01net-awards-le-meilleur-produit-pour-le-jardin-est.html</link>
      <pubDate>Tue, 09 Dec 2025 07:04:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314351</guid>
      <description>La r&#233;daction de 01net.com d&#233;signe les meilleurs produits de l&#8217;ann&#233;e. D&#233;couvrez tous les jours les vainqueurs de chaque cat&#233;gorie jusqu&#8217;&#224; la remise des prix le 10 d&#233;cembre, en live s&#8217;il vous plait !</description>
    </item>
    <item>
      <title>Giant face aux douanes am&#233;ricaines : la fin du cauchemar pour le n&#176;1 mondial du v&#233;lo ?</title>
      <link>https://www.frandroid.com/marques/giant/2902003_giant-face-aux-douanes-americaines-la-fin-du-cauchemar-pour-le-n1-mondial-du-velo</link>
      <pubDate>Tue, 09 Dec 2025 07:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/giant/2902003_giant-face-aux-douanes-americaines-la-fin-du-cauchemar-pour-le-n1-mondial-du-velo</guid>
      <description>
En terminant le remboursement des frais de recrutement de certains travailleurs et avec un nouveau lot de mesures, le groupe Giant esp&#232;re reprendre ses importations de v&#233;los &#233;lectriques et de composants aux &#201;tats-Unis .
</description>
    </item>
    <item>
      <title>The critical move most leaders miss after a crisis</title>
      <link>https://www.fastcompany.com/91452765/the-critical-move-most-leaders-miss-after-a-crisis</link>
      <pubDate>2025-12-09T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91452765/the-critical-move-most-leaders-miss-after-a-crisis</guid>
      <description>Steering an organization through a crisis is important, but it&#8217;s equally important to make sure that crisis leadership doesn&#8217;t become a norm.
For most leaders these last five years have been ones of great volatility, uncertainty, complexity, and ambiguity. Political dynamics, economic shifts, massive layoffs, strategy pivots, technology disruptions, and more are shaping how we lead and what we can accomplish together. Leading through uncertainty is no longer a mere possibility, it&#8217;s core to the job description.&#160;...</description>
    </item>
    <item>
      <title>Google reconnait un probl&#232;me des Pixel 9 Pro et propose une solution</title>
      <link>https://www.01net.com/actualites/google-reconnait-probleme-pixel-9-pro-xl-propose-solution.html</link>
      <pubDate>Tue, 09 Dec 2025 06:55:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314409</guid>
      <description>Google confirme que certains de ses Pixel 9 Pro et 9 Pro XL ont un souci d&#8217;affichage. Un programme sp&#233;cial vient d&#8217;&#234;tre lanc&#233; pour les malheureux utilisateurs concern&#233;s.</description>
    </item>
    <item>
      <title>Google va concurrencer les Meta Ray-Ban avec trois nouvelles paires de lunettes connect&#233;es</title>
      <link>https://www.frandroid.com/marques/google/2902925_google-va-concurrencer-les-meta-ray-ban-avec-trois-nouvelles-paires-de-lunettes-connectees</link>
      <pubDate>Tue, 09 Dec 2025 06:50:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2902925_google-va-concurrencer-les-meta-ray-ban-avec-trois-nouvelles-paires-de-lunettes-connectees</guid>
      <description>
Bien d&#233;cid&#233; &#224; ne pas laisser une trop grosse part du g&#226;teau &#224; la concurrence, Google vient de d&#233;voiler ses ambitions dans le secteur des lunettes connect&#233;es avec une tripot&#233;e de mod&#232;les pr&#233;vue pour les prochaines ann&#233;es.
</description>
    </item>
    <item>
      <title>On a test&#233; le Samsung Galaxy XR : ne vous pr&#233;cipitez pas, voici pourquoi</title>
      <link>https://www.frandroid.com/marques/samsung/2902831_on-a-teste-le-samsung-galaxy-xr-ne-vous-precipitez-pas-voici-pourquoi</link>
      <pubDate>Tue, 09 Dec 2025 06:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2902831_on-a-teste-le-samsung-galaxy-xr-ne-vous-precipitez-pas-voici-pourquoi</guid>
      <description>
Voici la r&#233;ponse de Google et Samsung &#224; l'h&#233;g&#233;monie naissante d'Apple dans la r&#233;alit&#233; mixte. De passage &#224; New York, je n'ai pas r&#233;sist&#233;. J'ai ramen&#233; un Galaxy XR dans mes valises pour comprendre ce que "Android XR" a dans le ventre. Le produit est utilisable en fran&#231;ais, le Play Store est l&#224;, et la promesse est belle : transformer votre environnement en un bureau Android g&#233;ant et infini. Voici ce que j'en pense.
...</description>
    </item>
  </channel>
</rss>
