<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 13 Nov 2025 09:41:15 GMT</lastBuildDate>
    <item>
      <title>L&#8217;application Google prend des airs de Pinterest avec cette mise &#224; jour</title>
      <link>https://www.frandroid.com/marques/google/2866987_lapplication-google-prend-des-airs-de-pinterest-avec-cette-mise-a-jour</link>
      <pubDate>Thu, 13 Nov 2025 09:31:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2866987_lapplication-google-prend-des-airs-de-pinterest-avec-cette-mise-a-jour</guid>
      <description>
Apr&#232;s plusieurs mois de tests, Google commence &#224; d&#233;ployer sur son application mobile un flux d'images inspir&#233; de Pinterest. De quoi trouver des inspirations directement dans Google Images.   
</description>
    </item>
    <item>
      <title>Samsung&amp;#8217;s trifold gets a name and &amp;#8216;confirmed&amp;#8217; specs</title>
      <link>https://www.theverge.com/news/819820/samsungs-trifold-gets-a-name-and-confirmed-specs</link>
      <pubDate>2025-11-13T04:31:34-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=819820</guid>
      <description>Reputable gadget leaker Evan Blass has taken to X with &#8220;some confirmed details&#8221; on Samsung&#8217;s upcoming trifold phone. It&#8217;ll be called the &#8220;Galaxy Z TriFold,&#8221; according to Blass, with a 6.5-inch cover display that maxes out at 2600 nits brightness. It unfurls to produce a 10-inch display on the inside capable of reaching a peak [&#8230;]</description>
    </item>
    <item>
      <title>Steam Deck 2 : Valve en dit plus sur la puissance de la prochaine console</title>
      <link>https://www.frandroid.com/marques/valve/2867065_voici-pourquoi-valve-nannonce-toujours-pas-de-steam-deck-2</link>
      <pubDate>Thu, 13 Nov 2025 09:28:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/valve/2867065_voici-pourquoi-valve-nannonce-toujours-pas-de-steam-deck-2</guid>
      <description>
Le Steam Deck 2 se fait attendre, encore et toujours. Pourtant, la console portable est bien &#224; l'esprit de Valve. Mais alors, qu'est-ce qui bloque ?
</description>
    </item>
    <item>
      <title>GWM lance son premier SUV &#233;lectrique, avec l&#8217;Europe en ligne de mire</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2866911_gwm-lance-son-premier-suv-electrique-avec-leurope-en-ligne-de-mire</link>
      <pubDate>Thu, 13 Nov 2025 09:27:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2866911_gwm-lance-son-premier-suv-electrique-avec-leurope-en-ligne-de-mire</guid>
      <description>
D&#233;voil&#233;e en septembre 2025, la nouvelle GWM Ora 5 fait enfin ses d&#233;buts sur le march&#233;. D&#8217;abord vendue en Chine, cette voiture &#233;lectrique devrait d&#233;barquer un jour en Europe.
</description>
    </item>
    <item>
      <title>Voici les photos du Galaxy S26 Edge que Samsung a annul&#233;</title>
      <link>https://www.frandroid.com/marques/samsung/2866995_voici-les-photos-du-galaxy-s26-edge-que-samsung-a-annule</link>
      <pubDate>Thu, 13 Nov 2025 09:23:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2866995_voici-les-photos-du-galaxy-s26-edge-que-samsung-a-annule</guid>
      <description>
Samsung a annul&#233; son Galaxy S26 Edge qui devait &#234;tre son smartphone le plus fin jamais con&#231;u. Des photos d'un mod&#232;le factice, publi&#233;es par le r&#233;put&#233; OnLeaks, viennent de faire surface. Elles r&#233;v&#232;lent un design encore plus fin que le Galaxy S25 Edge.
</description>
    </item>
    <item>
      <title>Google Maps et Tesla viennent de simplifier les voyages en voiture &#233;lectrique</title>
      <link>https://www.01net.com/actualites/google-maps-tesla-viennent-simplifier-voyages-voiture-electrique.html</link>
      <pubDate>Thu, 13 Nov 2025 09:21:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1307622</guid>
      <description>Google Maps affiche maintenant en direct le nombre de bornes libres dans les stations Tesla Supercharger. De quoi vous &#233;viter quelques mauvaises surprises.</description>
    </item>
    <item>
      <title>ChatGPT 5.1 is smarter, nicer, and better at actually doing what you asked</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/chatgpt-5-1-is-smarter-nicer-and-better-at-actually-doing-what-you-asked</link>
      <pubDate>Thu, 13 Nov 2025 09:15:22 +0000</pubDate>
      <guid isPermaLink="false">tQU7RZdHoi36mqTXRhfD6Z</guid>
      <description>OpenAI&#8217;s GPT&#8209;5.1 upgrade makes ChatGPT more reliable and gives it a customizable personality.</description>
    </item>
    <item>
      <title>Google Pixel 10 : le prix de cet excellent photophone tombe d&#233;j&#224; bien bas lors du pr&#233;-Black Friday sur Amazon (-30 %)</title>
      <link>https://www.frandroid.com/marques/2848533_google-pixel-10-le-prix-de-cet-excellent-photophone-tombe-deja-bien-bas-lors-du-pre-black-friday-sur-amazon-30</link>
      <pubDate>Thu, 13 Nov 2025 09:08:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2848533_google-pixel-10-le-prix-de-cet-excellent-photophone-tombe-deja-bien-bas-lors-du-pre-black-friday-sur-amazon-30</guid>
      <description>
Le Google 10 &#224; de belles choses &#224; offrir : un zoom optique x5, un Tensor G5 optimis&#233;, une meilleure batterie et la promesse de 7 ans de mises &#224; jour. Int&#233;ress&#233; ? Il peut vous revenir &#224; moins de 650 euros sur Amazon gr&#226;ce &#224; cette offre pr&#233;-Black Friday.
</description>
    </item>
    <item>
      <title>Enfin des bonnes nouvelles pour les voitures &#233;lectriques de Volkswagen gr&#226;ce au concurrent de Tesla</title>
      <link>https://www.frandroid.com/marques/volkswagen/2866839_enfin-des-bonnes-nouvelles-pour-les-voitures-electriques-de-volkswagen-grace-au-concurrent-de-tesla</link>
      <pubDate>Thu, 13 Nov 2025 09:07:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2866839_enfin-des-bonnes-nouvelles-pour-les-voitures-electriques-de-volkswagen-grace-au-concurrent-de-tesla</guid>
      <description>
D&#233;marr&#233; en 2024, le partenariat entre Volkswagen et Rivian avait connu des d&#233;buts un peu tendus. Mais aujourd&#8217;hui, tout semble aller pour le mieux entre les deux associ&#233;s. Ces derniers collaborent sur le logiciel des voitures &#233;lectriques de la marque allemande.
</description>
    </item>
    <item>
      <title>&#171; C&#8217;est juste un ordinateur non du coup ? &#187; : la question qui tue de JDG sur la Steam Machine et on y r&#233;pond</title>
      <link>https://www.frandroid.com/produits-android/console/console-de-jeux/2867019_cest-juste-un-ordinateur-question-jdg-pourquoi-la-steam-machine-est-bien-plus-complexe-quun-simple-pc</link>
      <pubDate>Thu, 13 Nov 2025 09:06:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/console-de-jeux/2867019_cest-juste-un-ordinateur-question-jdg-pourquoi-la-steam-machine-est-bien-plus-complexe-quun-simple-pc</guid>
      <description>
Fr&#233;d&#233;ric Molas du Joueur du Grenier a r&#233;sum&#233; en une phrase le probl&#232;me de communication de Valve : "C'est juste un ordinateur non du coup ?" Techniquement oui, fondamentalement non. 
</description>
    </item>
    <item>
      <title>Windows&#160;10&#160;: Microsoft corrige le bug qui privait certains PC de mises &#224; jour</title>
      <link>https://www.frandroid.com/marques/microsoft/2867005_windows-10-microsoft-corrige-le-bug-qui-privait-certains-pc-de-mises-a-jour</link>
      <pubDate>Thu, 13 Nov 2025 09:03:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2867005_windows-10-microsoft-corrige-le-bug-qui-privait-certains-pc-de-mises-a-jour</guid>
      <description>
Alors que Microsoft a techniquement offert un an de mise &#224; jour suppl&#233;mentaire &#224; tous les utilisateurs et utilisatrices europ&#233;ennes de Windows&#160;10, un bug emp&#234;chait de nombreuses machines d&#8217;en profiter. Cela devrait &#234;tre r&#233;gl&#233;.
</description>
    </item>
    <item>
      <title>Starbucks Red Cup Day is here: When, how to get your free cup</title>
      <link>https://mashable.com/article/starbucks-2025-red-cup-day</link>
      <pubDate>Thu, 13 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">00KzR9V7fATOhTHtVeHoOYS</guid>
      <description>The date for Starbucks' Red Cup Day 2025 has been announced. Find out when the event goes live and how to get your free cup.</description>
    </item>
    <item>
      <title>Puissante, mais pas trop : voici les derniers indices sur la nouvelle puce de Qualcomm</title>
      <link>https://www.frandroid.com/marques/qualcomm/2865349_puissante-mais-pas-trop-voici-les-derniers-indices-sur-la-nouvelle-puce-de-qualcomm</link>
      <pubDate>Thu, 13 Nov 2025 08:59:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/qualcomm/2865349_puissante-mais-pas-trop-voici-les-derniers-indices-sur-la-nouvelle-puce-de-qualcomm</guid>
      <description>
La nouvelle puce Snapdragon 8 Gen 5 de Qualcomm a &#233;t&#233; flash&#233;e sur Geekbench 6 &#224; bord (vraisemblablement) d'un Moto X70 Ultra. De quoi nous offrir d'autres indices quant aux performances du premier SoC &#171; non Elite &#187; &#224; s'appuyer sur des coeurs Oryon.
</description>
    </item>
    <item>
      <title>Victor Wood Master Wireless Earphones : du bois dans les oreilles pour une nouvelle r&#233;f&#233;rence premium&#160;?</title>
      <link>https://www.frandroid.com/marques/jvc/2867035_victor-wood-master-wireless-earphones-du-bois-dans-les-oreilles-pour-une-nouvelle-reference-premium</link>
      <pubDate>Thu, 13 Nov 2025 08:55:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/jvc/2867035_victor-wood-master-wireless-earphones-du-bois-dans-les-oreilles-pour-une-nouvelle-reference-premium</guid>
      <description>
Le march&#233; des &#233;couteurs sans fil haut de gamme accueille un nouvel acteur &#224; la technologie singuli&#232;re. Victor, sous l&#8217;impulsion de JVC Kenwood, pr&#233;sente les Wood Master Wireless Earphones, misant sur un driver hybride en bois et une suite d&#8217;innovations acoustiques.
</description>
    </item>
    <item>
      <title>La p&#233;riode du Black Friday regorge d&#233;j&#224; de bons plans : voici le TOP des meilleures offres en DIRECT</title>
      <link>https://www.frandroid.com/bons-plans/2864479_la-periode-du-black-friday-regorge-de-bons-plans-mais-voici-le-top-50-des-meilleures-offres</link>
      <pubDate>Thu, 13 Nov 2025 08:51:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2864479_la-periode-du-black-friday-regorge-de-bons-plans-mais-voici-le-top-50-des-meilleures-offres</guid>
      <description>
Avant le coup d'envoi officiel du vendredi noir &#224; la fin du mois, les offres se multiplient et deviennent de plus en plus int&#233;ressantes. D'un c&#244;t&#233;, il y a le pr&#233;-Black Friday chez la majorit&#233; des e-commer&#231;ants fran&#231;ais comme Boulanger, Fnac Darty, Amazon et Cdiscount, et de l'autre c&#244;t&#233;, il y a aussi le Singles Day, ou 11.11, chez AliExpress et consorts. Vous retrouverez les meilleures offres des deux &#233;v&#233;nements dans cet article. 
...</description>
    </item>
    <item>
      <title>Avec le Steam Frame, Valve s&#8217;attaque &#224; Meta et revient en force sur le march&#233; de la VR</title>
      <link>https://www.01net.com/actualites/steam-frame-valve-attaque-meta-revient-force-marche-vr.html</link>
      <pubDate>Thu, 13 Nov 2025 08:48:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1307590</guid>
      <description>Valve pr&#233;sente le Steam Frame, son nouveau casque de r&#233;alit&#233; virtuelle sans fil. Con&#231;u pour fonctionner de fa&#231;on autonome, il ambitionne d'offrir une exp&#233;rience de jeu fluide en combinant plusieurs technologies. Il marque le grand retour de Valve dans la VR, six ans apr&#232;s le Valve Index.</description>
    </item>
    <item>
      <title>Google recommande d&#8217;&#233;viter le Wi-Fi public : voici pourquoi</title>
      <link>https://www.frandroid.com/marques/google/2866841_google-recommande-deviter-le-wi-fi-public-voici-pourquoi</link>
      <pubDate>Thu, 13 Nov 2025 08:31:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2866841_google-recommande-deviter-le-wi-fi-public-voici-pourquoi</guid>
      <description>
Alors que les arnaques et les cyberattaques se multiplient, Google alerte ses utilisateurs sur les dangers li&#233;s l'utilisation des Wi-Fi publics. 
</description>
    </item>
    <item>
      <title>9 startups changing disability tech</title>
      <link>https://mashable.com/article/disability-tech-startup-innovation-remarkable-summit</link>
      <pubDate>Thu, 13 Nov 2025 08:28:19 +0000</pubDate>
      <guid isPermaLink="false">03vT0qweSeUms0eplZuT4YK</guid>
      <description>Disability tech accelerator Remarkable's 2025 Disability Tech Summit showcased several startups addressing the needs of people with disabilities.</description>
    </item>
    <item>
      <title>115 millions de cartes bancaires pirat&#233;es&#160;: Google riposte contre les hackers chinois de Lighthouse</title>
      <link>https://www.01net.com/actualites/115-millions-cartes-bancaires-piratees-google-riposte-contre-hackers-chinois-lighthouse.html</link>
      <pubDate>Thu, 13 Nov 2025 08:22:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1307553</guid>
      <description>Google intensifie sa lutte contre les cybercriminels chinois sp&#233;cialis&#233;s dans le phishing. Le g&#233;ant am&#233;ricain vient de saisir la justice afin de mettre un terme d&#233;finitif aux activit&#233;s de  Lighthouse, une puissante plateforme chinoise ayant permis d'orchestrer des campagnes mondiales de phishing. Elle a notamment &#233;t&#233; utilis&#233;e pour pirater plus de 100 millions de cartes de cr&#233;dit....</description>
    </item>
    <item>
      <title>Le signalement des contenus ill&#233;gaux toujours difficile sur X/Twitter</title>
      <link>https://www.01net.com/actualites/le-signalement-des-contenus-illegaux-toujours-difficile-sur-x-twitter.html</link>
      <pubDate>Thu, 13 Nov 2025 08:01:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1307533</guid>
      <description>Le r&#233;seau social X, anciennement Twitter, n'est pas au bout de ses peines en Europe. Le r&#233;gulateur irlandais vient en effet de lancer une nouvelle enqu&#234;te contre la plateforme d'Elon Musk, soup&#231;onn&#233;e de ne pas informer correctement les utilisateurs de leurs droits quand ils signalent des contenus ill&#233;gaux.</description>
    </item>
    <item>
      <title>Intuit reveals new AI agents in a bid to help SMBs across the world grow and prosper</title>
      <link>https://www.techradar.com/pro/intuit-reveals-new-ai-agents-in-a-bid-to-help-smbs-across-the-world-grow-and-prosper</link>
      <pubDate>Thu, 13 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">j4bhq5iv5YDLgn8oA8UCZm</guid>
      <description>Intuit finds many SMBs are being held back by technological hurdles, but AI can help pave the way to success.</description>
    </item>
    <item>
      <title>Valve d&#233;voile le Steam Controller, la manette de jeu ultime pour PC</title>
      <link>https://www.frandroid.com/marques/valve/2866905_valve-devoile-le-steam-controller-la-manette-de-jeu-ultime-pour-pc</link>
      <pubDate>Thu, 13 Nov 2025 07:59:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/valve/2866905_valve-devoile-le-steam-controller-la-manette-de-jeu-ultime-pour-pc</guid>
      <description>
Valve lance une nouvelle manette de jeu pens&#233;e pour tous les appareils "o&#249; Steam est install&#233;". Le nouveau Steam Controller arrivera dans quelques mois et a plus d'un argument pour convaincre les joueurs PC.
</description>
    </item>
    <item>
      <title>Google recule et laissera les utilisateurs et utilisatrices &#171;&#8201;exp&#233;riment&#233;es&#8201;&#187; installer des apps non certifi&#233;es</title>
      <link>https://www.frandroid.com/marques/google/2866929_google-recule-et-laissera-les-utilisateurs-et-utilisatrices-experimentees-installer-des-apps-non-certifiees</link>
      <pubDate>Thu, 13 Nov 2025 07:54:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2866929_google-recule-et-laissera-les-utilisateurs-et-utilisatrices-experimentees-installer-des-apps-non-certifiees</guid>
      <description>
La grogne a &#233;t&#233; utile. Apr&#232;s l&#8217;annonce d&#8217;un plan visant &#224; verrouiller la possibilit&#233; d&#8217;installer des APK depuis le web, Google a l&#226;ch&#233; du lest et va finalement laisser celles et ceux qui souhaitent installer n&#8217;importe quelles apps sur leurs t&#233;l&#233;phones.
</description>
    </item>
    <item>
      <title>Coros Pace 3 : le prix baisse en plein Singles Day maintenant que le nouveau mod&#232;le a &#233;t&#233; annonc&#233;</title>
      <link>https://www.frandroid.com/bons-plans/2866021_coros-pace-3-le-prix-baisse-en-plein-singles-day-maintenant-que-le-nouveau-modele-a-ete-annonce</link>
      <pubDate>Thu, 13 Nov 2025 07:49:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2866021_coros-pace-3-le-prix-baisse-en-plein-singles-day-maintenant-que-le-nouveau-modele-a-ete-annonce</guid>
      <description>
La Coros Pace 3 est une montre connect&#233;e orient&#233;e running &#224; retrouver pour 210,26 euros sur AliExpress pendant le Single Day, au lieu de 249 euros prix de lancement.
</description>
    </item>
  </channel>
</rss>
