<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 15 Jan 2026 11:24:45 GMT</lastBuildDate>
    <item>
      <title>Les batteries silicium-carbone : on vous explique tout sur la r&#233;volution discr&#232;te des smartphones</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2536605_les-batteries-silicium-carbone-on-vous-explique-tout-sur-la-revolution-discrete-des-smartphones</link>
      <pubDate>Thu, 15 Jan 2026 11:22:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2536605_les-batteries-silicium-carbone-on-vous-explique-tout-sur-la-revolution-discrete-des-smartphones</guid>
      <description>
Le silicium, &#233;l&#233;ment abondant sur Terre, pourrait bien r&#233;soudre l'un des probl&#232;mes les plus persistants de nos smartphones : l'autonomie limit&#233;e. Voici pourquoi cette technologie silicium-carbone change la donne.
</description>
    </item>
    <item>
      <title>Pas donn&#233; et lent &#224; recharger : le pari risqu&#233; du Suzuki e Vitara, la premi&#232;re voiture &#233;lectrique de la marque</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2943699_pas-donne-et-lent-a-recharger-le-pari-risque-du-suzuki-e-vitara-la-premiere-voiture-electrique-de-la-marque</link>
      <pubDate>Thu, 15 Jan 2026 11:15:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2943699_pas-donne-et-lent-a-recharger-le-pari-risque-du-suzuki-e-vitara-la-premiere-voiture-electrique-de-la-marque</guid>
      <description>
D&#233;voil&#233; en fin d&#8217;ann&#233;e 2024, le Suzuki e Vitara a pris son temps pour arriver en France. Mais voil&#224; que la nouvelle voiture &#233;lectrique du constructeur japonais est enfin disponible &#224; la commande.
</description>
    </item>
    <item>
      <title>OpenAI&#8217;s ChatGPT translator challenges Google Translate</title>
      <link>https://www.theverge.com/news/862448/openai-chatgpt-translate-tool-launch-website</link>
      <pubDate>2026-01-15T06:13:45-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=862448</guid>
      <description>OpenAI has launched ChatGPT Translate, a standalone web translation tool that supports over 50 languages and is positioned as a direct competitor to Google Translate. The two services look visually similar: both feature two text boxes - one for typing or pasting the source text, and another that displays the translated results - alongside dropdown [&#8230;]...</description>
    </item>
    <item>
      <title>Volvo EX60 : on a creus&#233; HuginCore, et ce n&#8217;est pas (que) du marketing</title>
      <link>https://www.frandroid.com/marques/volvo/2943871_volvo-ex60-on-a-creuse-hugincore-et-ce-nest-pas-que-du-marketing</link>
      <pubDate>Thu, 15 Jan 2026 11:07:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volvo/2943871_volvo-ex60-on-a-creuse-hugincore-et-ce-nest-pas-que-du-marketing</guid>
      <description>
Pour son EX60, Volvo centralise tout dans son HuginCore, un cerveau num&#233;rique de 250 TOPS. Marketing ou r&#233;elle avanc&#233;e ? On fait le point.
</description>
    </item>
    <item>
      <title>AWS brings &#8216;Sovereign&#8217; cloud to Europe - you can pause your geopatriation plans, for now</title>
      <link>https://www.techradar.com/pro/aws-brings-sovereign-cloud-to-europe-you-can-pause-your-geopatriation-plans-for-now</link>
      <pubDate>Thu, 15 Jan 2026 11:05:00 +0000</pubDate>
      <guid isPermaLink="false">ZpcqFpxyBzksgbBStwYcG4</guid>
      <description>Your geopatriation dreams come true, thanks to new AWS sovereign cloud.</description>
    </item>
    <item>
      <title>Fans think there's even more evidence suggesting that an Assassin's Creed Black Flag remake is on the way &#8212; but the real explanation is a lot less exciting</title>
      <link>https://www.techradar.com/gaming/fans-think-theres-even-more-evidence-suggesting-that-an-assassins-creed-black-flag-remake-is-on-the-way-but-the-real-explanation-is-a-lot-less-exciting</link>
      <pubDate>Thu, 15 Jan 2026 11:01:51 +0000</pubDate>
      <guid isPermaLink="false">CZXrNcHhun73M6q249gm4A</guid>
      <description>Fans think that there's now even more evidence pointing to an Assassin's Creed Black Flag remake as parts of the game's soundtrack appear on YouTube.</description>
    </item>
    <item>
      <title>Quel forfait mobile pour les &#201;tats-Unis&#8201;? Nos conseils pour communiquer et rester connect&#233;</title>
      <link>https://www.frandroid.com/telecom/1837223_quel-forfait-mobile-pour-les-etats-unis-nos-conseils-pour-communiquer-et-rester-connecte</link>
      <pubDate>Thu, 15 Jan 2026 11:00:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/1837223_quel-forfait-mobile-pour-les-etats-unis-nos-conseils-pour-communiquer-et-rester-connecte</guid>
      <description>
Vous avez pr&#233;vu un voyage aux &#201;tats-Unis, mais vous vous demandez comment vous allez pouvoir communiquer avec vos proches rest&#233;s en France sans en payer le prix fort ? On vous donne ici nos recommandations et les forfaits qui vous sauveront des frais d'itin&#233;rance.
</description>
    </item>
    <item>
      <title>Forza Horizon 6 could launch sooner than you think, if reports of a strange advertisement seen in Forza Horizon 5 are to be believed</title>
      <link>https://www.techradar.com/gaming/forza-horizon-6-could-launch-sooner-than-you-think-if-reports-of-a-strange-advertisement-seen-in-forza-horizon-5-are-to-be-believed</link>
      <pubDate>Thu, 15 Jan 2026 10:57:33 +0000</pubDate>
      <guid isPermaLink="false">z36VShXMV9y3DDoaqrDEEM</guid>
      <description>Forza Horizon 6 might be out as early as May, though one detail from this leak - allegedly found in Forza Horizon 5 - has me concerned.</description>
    </item>
    <item>
      <title>Rockstar has launched its own mod marketplace ahead of the launch of Grand Theft Auto 6</title>
      <link>https://www.techradar.com/gaming/rockstar-has-launched-its-own-mod-marketplace-ahead-of-the-launch-of-grand-theft-auto-6</link>
      <pubDate>Thu, 15 Jan 2026 10:56:44 +0000</pubDate>
      <guid isPermaLink="false">cE75qaMc7xWHAfd6V3Xvx3</guid>
      <description>Rockstar Games has launched its own website dedicated to the buying and selling of GTA Online and Red Dead Online mods, called the Cfx Marketplace.</description>
    </item>
    <item>
      <title>'We're actively developing it': Marvel producer confirms one of the worst-rated MCU TV shows is edging closer to getting a second season on Disney+</title>
      <link>https://www.techradar.com/streaming/disney-plus/were-actively-developing-it-marvel-producer-confirms-one-of-the-worst-rated-mcu-tv-shows-is-edging-closer-to-getting-a-second-season-on-disney</link>
      <pubDate>Thu, 15 Jan 2026 10:56:15 +0000</pubDate>
      <guid isPermaLink="false">A7J63M72B8hxqjo5AwxQrC</guid>
      <description>Marvel's Head of TV and Animation has provided a major update on the future of adult animated show Marvel Zombies.</description>
    </item>
    <item>
      <title>Voici la meilleure voiture &#233;lectrique de Nissan : elle &#233;crase la gamme europ&#233;enne, mais il y a un hic</title>
      <link>https://www.frandroid.com/marques/nissan/2943723_voici-la-meilleure-voiture-electrique-de-nissan-elle-ecrase-la-gamme-europeenne-mais-il-y-a-un-hic</link>
      <pubDate>Thu, 15 Jan 2026 10:50:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nissan/2943723_voici-la-meilleure-voiture-electrique-de-nissan-elle-ecrase-la-gamme-europeenne-mais-il-y-a-un-hic</guid>
      <description>
Si la gamme europ&#233;enne des voitures &#233;lectriques de Nissan semble enfin se dynamiser, la marque japonaise va bien plus loin en Chine avec la pr&#233;sentation du NX8, un SUV &#224; la recharge ultra-rapide et &#224; l'int&#233;rieur futuriste.
</description>
    </item>
    <item>
      <title>'Society cannot function if no one is accountable for AI' &#8212; Jaron Lanier, the godfather of virtual reality, discusses how far our empathy should extend to AI in episode two of new podcast, The Ten Reckonings</title>
      <link>https://www.techradar.com/ai-platforms-assistants/society-cannot-function-if-no-one-is-accountable-for-ai-jaron-lanier-the-godfather-of-virtual-reality-discusses-how-far-our-empathy-should-extend-to-ai-in-episode-two-of-new-podcast-the-ten-reckonings</link>
      <pubDate>Thu, 15 Jan 2026 10:48:34 +0000</pubDate>
      <guid isPermaLink="false">SjbhVAyft6NaP7ZeYLzZkk</guid>
      <description>As AI spreads faster than the rules meant to govern it, technologists warn that progress without human accountability risks undermining society itself.</description>
    </item>
    <item>
      <title>Norton VPN just dropped exclusive prices for TechRadar readers on new two-year plans &#8212; here's how to get the best deal for you</title>
      <link>https://www.techradar.com/vpn/vpn-services/norton-vpn-just-dropped-exclusive-prices-for-techradar-readers-on-new-two-year-plans-heres-how-to-get-the-best-deal-for-you</link>
      <pubDate>Thu, 15 Jan 2026 10:43:59 +0000</pubDate>
      <guid isPermaLink="false">3LczvRbbEYjoRDFJ34EXUk</guid>
      <description>Longer plans and lower prices, exclusively for TechRadar readers</description>
    </item>
    <item>
      <title>Cyberattaque mondiale&#160;: Microsoft neutralise un &#171;&#160;moteur essentiel&#160;&#187; des arnaques en ligne</title>
      <link>https://www.01net.com/actualites/cyberattaque-mondiale-microsoft-neutralise-moteur-essentiel-arnaques-ligne.html</link>
      <pubDate>Thu, 15 Jan 2026 10:39:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320246</guid>
      <description>Microsoft vient d&#8217;abattre l&#8217;une des principales plateformes criminelles pour les arnaques en ligne. Responsable de millions de cyberattaques dans le monde, l'outil a &#233;t&#233; neutralis&#233; avec l'appui des forces de l'ordre. Avant sa chute, la plateforme a caus&#233; plus de 40&#8239;millions de dollars de pertes.</description>
    </item>
    <item>
      <title>Wikipedia&#8217;s Existential Threats Feel Greater Than Ever</title>
      <link>https://www.wired.com/story/wikipedias-existential-threats-have-never-been-greater/</link>
      <pubDate>Thu, 15 Jan 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">69656b22bf96e65096dda915</guid>
      <description>As the free online encyclopedia turns 25, it&#8217;s facing political opposition, AI scraping, dwindling volunteers, and a public that may no longer believe in its ideals.</description>
    </item>
    <item>
      <title>Lizn Hearpieces Review: Affordable but Uncomfortable Hearing Aids</title>
      <link>https://www.wired.com/review/lizn-hearpieces/</link>
      <pubDate>Thu, 15 Jan 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">6967bb862be92cf562ad3ea4</guid>
      <description>These odd-looking hearing aids double as solid earbuds, but comfort is a major issue.</description>
    </item>
    <item>
      <title>ISS mission splashes down after medical issue</title>
      <link>https://www.engadget.com/science/space/iss-mission-splashes-down-after-medical-issue-103000302.html?src=rss</link>
      <pubDate>Thu, 15 Jan 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">a5f9e45c-de75-4cf1-a10a-2bb74c8678cd</guid>
      <description>The  SpaceX Dragon spacecraft carrying the Crew-11 astronauts has splashed down into the ocean after they left the ISS a month earlier than planned due a medical issue. It&#8217;s the first time NASA cut a mission short due to a medical concern. The agency didn&#8217;t name the crew member and their condition but stated that they were stable and that it wasn&#8217;t a case of medical evacuation. NASA merely decided to end the mission early out of an abundance of caution, because the ISS didn&#8217;t have the tools for a proper diagnosis.  NASA astronauts Mike Fincke and Zena Cardman, JAXA&#8217;s Kimiya Yui and Russian cos...</description>
    </item>
    <item>
      <title>La s&#233;lection des meilleurs smartphones &#224; grand &#233;cran en 2026</title>
      <link>https://www.frandroid.com/guide-dachat/382644_6-alternatives-samsung-galaxy-note-7</link>
      <pubDate>Thu, 15 Jan 2026 10:27:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/382644_6-alternatives-samsung-galaxy-note-7</guid>
      <description>
D'ann&#233;e en ann&#233;e, les smartphones ne cessent de grandir. Vous &#234;tes adeptes des grands &#233;crans ? Que ce soit pour jouer, regarder des vid&#233;os ou juste pour un plus grand confort, nous avons s&#233;lectionn&#233; pour vous les meilleurs t&#233;l&#233;phones avec un grand &#233;cran.
</description>
    </item>
    <item>
      <title>Cette liseuse de 6&#8243; compatible tout format glisse sous les 100 &#8364; pendant les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2943549_cette-liseuse-de-6-compatible-tout-format-glisse-sous-les-100-e-pendant-les-soldes</link>
      <pubDate>Thu, 15 Jan 2026 10:27:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2943549_cette-liseuse-de-6-compatible-tout-format-glisse-sous-les-100-e-pendant-les-soldes</guid>
      <description>
La Vivlio Light Zen est une liseuse qui joue la carte de la l&#233;g&#232;ret&#233; avec un &#233;cran de 6 pouces. Elle embarque avec elle facilement plus de 4 000 ebooks, et avec les soldes d'hiver, elle l&#226;che du lest sur son prix en passant de 109 euros &#224; 94 euros sur E.Leclerc.
</description>
    </item>
    <item>
      <title>One UI 8.5 va doper les performances de votre smartphone Samsung gr&#226;ce &#224; ce petit changement</title>
      <link>https://www.frandroid.com/marques/samsung/2943747_one-ui-8-5-va-doper-les-performances-de-votre-smartphone-samsung-grace-a-ce-petit-changement</link>
      <pubDate>Thu, 15 Jan 2026 10:14:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2943747_one-ui-8-5-va-doper-les-performances-de-votre-smartphone-samsung-grace-a-ce-petit-changement</guid>
      <description>
One UI 8.5 ne se contenterait pas de changements esth&#233;tiques, mais s'attaquerait au c&#339;ur m&#234;me du syst&#232;me : le noyau Android. &#192; la cl&#233;, une fluidit&#233; et une r&#233;activit&#233; nettement revues &#224; la hausse.
</description>
    </item>
    <item>
      <title>Arc Raiders just received its first patch of 2026, and it makes some very necessary changes to the way this controversial throwable item works</title>
      <link>https://www.techradar.com/gaming/arc-raiders-just-received-its-first-patch-of-2026-and-it-makes-some-very-necessary-changes-to-the-way-this-controversial-throwable-item-works</link>
      <pubDate>Thu, 15 Jan 2026 10:11:35 +0000</pubDate>
      <guid isPermaLink="false">fJqtijvoZBkxrpHVhGMB7a</guid>
      <description>The most controversial Arc Raiders throwable weapon just got nerfed. Here&#8217;s everything that&#8217;s changed as part of Update 1.11.0.</description>
    </item>
    <item>
      <title>Microsoft hits global virtual desktop cybercrime phishing platform - 'RedDVS' caused phishing chaos and resulted in millions of losses</title>
      <link>https://www.techradar.com/pro/security/microsoft-hits-global-virtual-desktop-cybercrime-phishing-platform-reddvs-caused-phishing-chaos-and-resulted-in-millions-of-losses</link>
      <pubDate>Thu, 15 Jan 2026 10:11:29 +0000</pubDate>
      <guid isPermaLink="false">XJkkESFzi8gc9w7ycB7EoP</guid>
      <description>RedVDS disrupted, and servers seized, in an operation conducted by Europol and German authorities.</description>
    </item>
    <item>
      <title>&#8216;That model has finally broken': Nothing CEO says the era of bargain smartphones is over &#8211; and that its prices could jump by 30%</title>
      <link>https://www.techradar.com/phones/nothing-phones/that-model-has-finally-broken-nothing-ceo-says-the-era-of-bargain-smartphones-is-over-and-that-its-prices-could-jump-by-30-percent</link>
      <pubDate>Thu, 15 Jan 2026 10:09:23 +0000</pubDate>
      <guid isPermaLink="false">RuYWDUfdjE9XGzjdcHZqZD</guid>
      <description>Nothing's CEO says the 'specs race' is over, as rising memory prices mean 'intentional design' is more important than ever.</description>
    </item>
    <item>
      <title>Les fonctions de base de Galaxy AI resteront gratuites, c&#8217;est Samsung qui le dit</title>
      <link>https://www.frandroid.com/marques/2943423_les-fonctions-de-base-de-galaxy-ai-resteront-gratuites-cest-samsung-qui-le-dit</link>
      <pubDate>Thu, 15 Jan 2026 10:05:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2943423_les-fonctions-de-base-de-galaxy-ai-resteront-gratuites-cest-samsung-qui-le-dit</guid>
      <description>
Une simple modification des conditions d&#8217;utilisation met fin au suspense entourant les fonctionnalit&#233;s de bases de Galaxy AI.
</description>
    </item>
    <item>
      <title>Our Favorite Coway Air Purifiers Are on Sale (2026)</title>
      <link>https://www.wired.com/story/coway-air-purifier-deals-january-2026/</link>
      <pubDate>Thu, 15 Jan 2026 10:02:00 +0000</pubDate>
      <guid isPermaLink="false">6967ec742a35b050b1eec69e</guid>
      <description>Breathe easier with these discounts on one of WIRED&#8217;s favorite air purifier brands, including an option for large rooms.</description>
    </item>
    <item>
      <title>The best cheap fitness trackers for 2026</title>
      <link>https://www.engadget.com/wearables/best-cheap-fitness-trackers-140054780.html?src=rss</link>
      <pubDate>Thu, 15 Jan 2026 10:00:36 +0000</pubDate>
      <guid isPermaLink="false">76788acc-b3c9-4c22-8f2f-6e3454c53d79</guid>
      <description>You don&#8217;t need to spend a fortune to stay on top of your health goals while tracking your fitness. These days, even cheap fitness trackers come packed with features that help you monitor your heart rate, track your steps and even analyze your sleep stages. Many budget options now include GPS tracking for those outdoor runs, real-time heart rate tracking to keep you in the right zone during workouts and, thankfully, most work with both iPhone and Android devices.Some even go beyond basic metrics, providing insights on daily readiness to help you decide if you&#8217;re up for an intense workout or nee...</description>
    </item>
    <item>
      <title>Agatha Christie&#8217;s Seven Dials creator on rites of passage, Broadchurch and Sherlock comparisons, and what you should watch next: &#8216;It doesn&#8217;t feel like we cheated anything&#8217;</title>
      <link>https://www.techradar.com/streaming/netflix/agatha-christies-seven-dials-creator-on-rites-of-passage-broadchurch-and-sherlock-comparisons-and-what-you-should-watch-next-it-doesnt-feel-like-we-cheated-anything</link>
      <pubDate>Thu, 15 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">DinWKToXkoav3SKN4Y5YGM</guid>
      <description>It makes total sense for Broadchurch creator Chris Chibnall to be behind Agatha Christie's Seven Dials on Netflix &#8211; but don't waste your time directly comparing the two.</description>
    </item>
    <item>
      <title>Why we should worry about the recent decline of reading, according to science</title>
      <link>https://www.fastcompany.com/91471437/reading-decline-why-we-should-worry-science</link>
      <pubDate>2026-01-15T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91471437/reading-decline-why-we-should-worry-science</guid>
      <description>Concerning lessons from cognitive and educational psychology.
Last year, various surveys, including reliable indicators, have highlighted a significant decline in reading habits over the past decades.</description>
    </item>
    <item>
      <title>Samsung&#8217;s Galaxy Z TriFold is a phone, a tablet, and a realistic test of how much device you really need</title>
      <link>https://www.fastcompany.com/91471696/samsungs-galaxy-z-trifold-phone-ces</link>
      <pubDate>2026-01-15T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91471696/samsungs-galaxy-z-trifold-phone-ces</guid>
      <description>From desktop-style DeX to pro-level photo editing, Samsung is targeting people who push their phones harder than most.
Foldable phones have spent years trying to justify themselves. Some were too fragile, others too bulky, and most felt like solutions in search of a problem. The Galaxy Z TriFold is Samsung&#8217;s clearest attempt yet to answer a more reasonable question: Can one device replace the phone-tablet combo without becoming a chore to carry?...</description>
    </item>
    <item>
      <title>Crypto scams took $17 billion last year. 2026 could be even worse</title>
      <link>https://www.fastcompany.com/91474880/crypto-scams-took-17-billion-last-year-2026-could-be-even-worse</link>
      <pubDate>2026-01-15T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91474880/crypto-scams-took-17-billion-last-year-2026-could-be-even-worse</guid>
      <description>After a banner year for people being fleeced out of their cryptocurrency, 2026 started with major news of new hacks, scams, and rug pulls.
2025 was a banner year for cryptocurrencies on many fronts. Global regulation eased. Stablecoins powered $46 trillion in annual transactions. And major shifts in U.S. government policy spurred wider adoption. But with that expansion came a notable bump in crypto fraud....</description>
    </item>
    <item>
      <title>Google Gemini change d&#8217;interface pour mieux organiser vos contenus</title>
      <link>https://www.01net.com/actualites/google-gemini-change-interface-pour-mieux-organiser-contenus.html</link>
      <pubDate>Thu, 15 Jan 2026 09:59:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320236</guid>
      <description>Google d&#233;ploie une refonte de l'onglet &#171; Mes contenus &#187; dans Gemini pour mettre de l'ordre dans votre historique. Un changement qui va dans le bon sens, m&#234;me s'il reste encore pas mal de travail.</description>
    </item>
    <item>
      <title>Sony se pr&#233;pare &#224; la sortie de GTA 6 : pourquoi le PSSR 2.0 de la PS5 Pro pourrait tout changer</title>
      <link>https://www.frandroid.com/marques/sony/2943667_sony-se-prepare-a-la-sortie-de-gta-6-pourquoi-le-pssr-2-0-de-la-ps5-pro-pourrait-tout-changer</link>
      <pubDate>Thu, 15 Jan 2026 09:59:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2943667_sony-se-prepare-a-la-sortie-de-gta-6-pourquoi-le-pssr-2-0-de-la-ps5-pro-pourrait-tout-changer</guid>
      <description>
La PS5 Pro devrait recevoir prochainement une mise &#224; jour majeure avec l'arriv&#233;e du PSSR 2.0. Une nouvelle fuite d&#233;taille des nouveaut&#233;s prometteuses pour les nouveaux, mais aussi les anciens jeux de la console. 
</description>
    </item>
    <item>
      <title>Focal Azurys : cet &#233;l&#233;gant casque Hi-Fi made in France est &#224; -40 % pour les soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2868043_focal-azurys-cet-elegant-casque-hi-fi-made-in-france-est-a-40-pour-les-soldes-dhiver</link>
      <pubDate>Thu, 15 Jan 2026 09:55:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2868043_focal-azurys-cet-elegant-casque-hi-fi-made-in-france-est-a-40-pour-les-soldes-dhiver</guid>
      <description>
Un casque hi-fi ferm&#233;, fabriqu&#233; en France, qui m&#234;le savoir-faire artisanal et transducteurs maison, c&#8217;est l&#8217;Azurys : une &#233;l&#233;gance sign&#233;e Focal. Et pour ces soldes d'hiver 2026, il se permet une coupe dans son tarif, passant de 549 euros &#224; 329 euros.
</description>
    </item>
    <item>
      <title>Boulanger fait le plein d&#8217;offres pour le lancement de la 2e d&#233;marque des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2931541_boulanger-fait-le-plein-doffres-pour-le-lancement-de-la-2e-demarque-des-soldes</link>
      <pubDate>Thu, 15 Jan 2026 09:54:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931541_boulanger-fait-le-plein-doffres-pour-le-lancement-de-la-2e-demarque-des-soldes</guid>
      <description>
Pendant la deuxi&#232;me d&#233;marque des soldes, on trouve de quoi se faire plaisir avec de belles r&#233;ductions chez Boulanger. L'enseigne lance des offres attractives sur les smartphones haut de gamme, dont l&#8217;ancien flagship de Google ou encore le r&#233;cent milieu de gamme de Xiaomi. 
</description>
    </item>
    <item>
      <title>La Chine veut acc&#233;l&#233;rer sur 2 points majeurs concernant les voitures &#233;lectriques, dont la fameuse batterie solide</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2943447_la-chine-veut-accelerer-sur-2-points-majeurs-concernant-les-voitures-electriques-dont-la-fameuse-batterie-solide</link>
      <pubDate>Thu, 15 Jan 2026 09:50:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2943447_la-chine-veut-accelerer-sur-2-points-majeurs-concernant-les-voitures-electriques-dont-la-fameuse-batterie-solide</guid>
      <description>
Le gouvernement chinois veut rendre ses voitures &#233;lectriques encore plus comp&#233;titives, et notamment sur deux points en particulier. Il s&#8217;agit de la conduite autonome de niveau 3 ainsi que des batteries solides.
</description>
    </item>
    <item>
      <title>Ces compagnies a&#233;riennes interdisent la recharge via batterie externe en vol d&#232;s aujourd&#8217;hui</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2943673_ces-compagnies-aeriennes-interdisent-la-recharge-via-batterie-externe-en-vol-des-aujourdhui</link>
      <pubDate>Thu, 15 Jan 2026 09:48:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2943673_ces-compagnies-aeriennes-interdisent-la-recharge-via-batterie-externe-en-vol-des-aujourdhui</guid>
      <description>
C'est fini. Si vous comptiez sur votre batterie externe Anker pour survivre &#224; un vol long-courrier sur Lufthansa, changez vos plans. D&#232;s ce 15 janvier 2026, le groupe allemand harmonise ses r&#232;gles : vous pouvez transporter votre batterie, mais interdiction formelle de l'utiliser.
</description>
    </item>
    <item>
      <title>Plus moyen d&#8217;y &#233;chapper, SFR augmente ses frais de r&#233;siliation pour tout le monde</title>
      <link>https://www.frandroid.com/marques/sfr/2943561_plus-moyen-dy-echapper-sfr-augmente-ses-frais-de-resiliation-pour-tout-le-monde</link>
      <pubDate>Thu, 15 Jan 2026 09:41:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sfr/2943561_plus-moyen-dy-echapper-sfr-augmente-ses-frais-de-resiliation-pour-tout-le-monde</guid>
      <description>
En guise de cadeau de bonne ann&#233;e, SFR a d&#233;cid&#233; d&#8217;augmenter les frais de r&#233;siliation et de changement d&#8217;offre pour toute sa client&#232;le. Une mesure qui simplifie la grille tarifaire, mais qui risque d&#8217;en frustrer certains et certaines.
</description>
    </item>
    <item>
      <title>What is the release date for The Pitt season 2 episode 2 on HBO Max?</title>
      <link>https://www.techradar.com/streaming/hbo-max/the-pitt-season-2-episode-2-release-date-time</link>
      <pubDate>Thu, 15 Jan 2026 09:35:56 +0000</pubDate>
      <guid isPermaLink="false">W3EvURZnkGT2j298vQe4hF</guid>
      <description>New attending physician Dr. Baran Al-Hashimi was only introduced in the first episode, but she's intent on changing everything in The Pitt season 2 episode 2 &#8211; here's when it's on HBO Max.</description>
    </item>
    <item>
      <title>Microsoft taps India&#8217;s Varaha for durable carbon removal offtake</title>
      <link>https://techcrunch.com/2026/01/15/microsoft-taps-indias-varaha-for-asia-first-durable-carbon-removal-offtake/</link>
      <pubDate>Thu, 15 Jan 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3082552</guid>
      <description>Microsoft is buying over 100,000 tons of carbon dioxide removal credits from India's Varaha over the next three years.</description>
    </item>
    <item>
      <title>How the &#8216;Rule of 3&#8217; framework simplifies tough decisions</title>
      <link>https://www.fastcompany.com/91471361/decisions-rule-of-3-framework</link>
      <pubDate>2026-01-15T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91471361/decisions-rule-of-3-framework</guid>
      <description>It&#8217;s a process that makes overthinking almost impossible.
Should I take this project? Say yes to the new job offer? Stick with this plan or walk away? Every choice we make can feel huge. And every path has its own set of risks and rewards. There are always more questions for every life-changing decision. Sometimes the pros-and-cons lists feel more like busywork than progress. You check off the boxes, stare at the lists, and still end up confused, stuck in the same mental loop. That&#8217;s why I rely on the rule of 3 framework to make tough decisions. I hope it helps you clarify your life-changing c...</description>
    </item>
    <item>
      <title>Et si la fabrication additive fa&#231;onnait l&#8217;avenir de l&#8217;a&#233;ronautique ?</title>
      <link>https://www.futura-sciences.com/sciences/actualites/aeronautique-si-fabrication-additive-faconnait-avenir-aeronautique-127488/#xtor%3DRSS-8</link>
      <pubDate>Thu, 15 Jan 2026 10:30:00 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/aeronautique-si-fabrication-additive-faconnait-avenir-aeronautique-127488/#xtor%3DRSS-8</guid>
      <description>Le nouveau num&#233;ro de &#171;&#160;Radar &#187;, le podcast de Safran, ouvre les portes du Safran Additive Manufacturing Campus o&#249;, gr&#226;ce &#224; l'impression 3D, se fa&#231;onnent des avions plus performants, plus l&#233;gers et plus sobres.</description>
    </item>
  </channel>
</rss>
