<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 27 Jan 2026 08:38:55 GMT</lastBuildDate>
    <item>
      <title>Pourquoi Apple vient de sauver vos vieux iPhone 5s et iPhone 6 du placard</title>
      <link>https://www.frandroid.com/os/ios/2956007_pourquoi-apple-vient-de-sauver-vos-vieux-iphone-5s-et-iphone-6-du-placard</link>
      <pubDate>Tue, 27 Jan 2026 08:36:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/ios/2956007_pourquoi-apple-vient-de-sauver-vos-vieux-iphone-5s-et-iphone-6-du-placard</guid>
      <description>
Vous pensiez que votre vieil iPhone 5s &#233;tait d&#233;finitivement bon pour le recyclage ? D&#233;trompez-vous. Apple vient de d&#233;ployer iOS 12.5.8 pour ses reliques de 2013 et 2014 afin d'&#233;viter une panne logicielle d&#232;s l'an prochain?
</description>
    </item>
    <item>
      <title>Une faille de Microsoft Office est activement exploit&#233;e par des pirates</title>
      <link>https://www.01net.com/actualites/faille-microsoft-office-activement-exploitee-pirates.html</link>
      <pubDate>Tue, 27 Jan 2026 08:29:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322619</guid>
      <description>Microsoft alerte sur une nouvelle faille critique dans Office. D&#233;j&#224; exploit&#233;e par des cybercriminels, la vuln&#233;rabilit&#233; permet de d&#233;sactiver la s&#233;curit&#233; mise en place par Microsoft. L&#8217;&#233;diteur a commenc&#233; &#224; d&#233;ployer d'urgence un correctif pour Microsoft 365 et les versions r&#233;centes d&#8217;Office.</description>
    </item>
    <item>
      <title>Fin de l&#8217;ADSL : pourquoi des milliers de Fran&#231;ais vont se r&#233;veiller sans Internet et sans t&#233;l&#233;phone</title>
      <link>https://www.frandroid.com/telecom/2955981_fin-de-ladsl-pourquoi-des-milliers-de-francais-vont-se-reveiller-sans-internet-et-sans-telephone</link>
      <pubDate>Tue, 27 Jan 2026 08:23:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2955981_fin-de-ladsl-pourquoi-des-milliers-de-francais-vont-se-reveiller-sans-internet-et-sans-telephone</guid>
      <description>
Ce mardi 27 janvier, Orange d&#233;branche d&#233;finitivement l'ADSL dans 763 communes fran&#231;aises. Ce n'est plus une exp&#233;rimentation rurale, mais une bascule massive qui touche Lyon ou Ajaccio. Pr&#232;s de 860 000 foyers sont concern&#233;s par cette extinction du r&#233;seau cuivre historique.
</description>
    </item>
    <item>
      <title>The best wireless earbuds for 2026</title>
      <link>https://www.engadget.com/audio/headphones/best-wireless-earbuds-120058222.html?src=rss</link>
      <pubDate>Tue, 27 Jan 2026 08:01:26 +0000</pubDate>
      <guid isPermaLink="false">52299dcd-39b7-3f30-8524-2c7d79d13daa</guid>
      <description>Wireless earbuds are now the default option for everyday listening, whether you&#8217;re heading out for a commute, fitting in a workout or just watching videos at home. The best wireless earbuds combine reliable connectivity, comfortable fits and sound quality that holds up across music, calls and podcasts, all without the hassle of cables. Most are small enough to disappear into a pocket and pair quickly with phones, tablets and laptops.What sets one pair apart from another often comes down to priorities. Some earbuds lean heavily on active noise cancellation, while others focus on long battery li...</description>
    </item>
    <item>
      <title>Vous avez aim&#233; Liquid Glass dans iOS 26&#160;? Vous allez adorer la transparence d&#8217;Android 17</title>
      <link>https://www.01net.com/actualites/vous-avez-aime-liquid-glass-dans-ios-26-vous-allez-adorer-la-transparence-dandroid-17.html</link>
      <pubDate>Tue, 27 Jan 2026 08:01:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322587</guid>
      <description>Une fois n'est pas coutume (hum), Google pourrait s'inspirer d'iOS pour l'interface d'Android. Et plus sp&#233;cifiquement de Liquid Glass, le nouveau &#171;&#160;langage de design &#187; inaugur&#233; avec iOS 26 et les autres syst&#232;mes d'exploitation d'Apple. Android 17 devrait ainsi int&#233;grer davantage d'effets de transparence et de flou dans plusieurs &#233;l&#233;ments graphiques....</description>
    </item>
    <item>
      <title>Intel&#8217;s Panther Lake Chips Aren&#8217;t Just Good&#8212;They Beat Apple's M5</title>
      <link>https://www.wired.com/story/intel-panther-lake-core-ultra-series-3-review/</link>
      <pubDate>Tue, 27 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">696fd2185963d82ddd46cfa9</guid>
      <description>I&#8217;ve tested two new laptops powered by Panther Lake&#8212;pitting them head-to-head against laptops with Apple Silicon&#8212;and Intel has finally scored a much-needed win with the Core Ultra Series 3.</description>
    </item>
    <item>
      <title>Rachet&#233;e par Rebirth, Cowboy promet un come-back express d&#232;s f&#233;vrier pour ses v&#233;los &#233;lectriques</title>
      <link>https://www.frandroid.com/marques/cowboy/2955605_rachetee-par-rebirth-cowboy-promet-un-come-back-express-des-fevrier-pour-ses-velos-electriques</link>
      <pubDate>Tue, 27 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/cowboy/2955605_rachetee-par-rebirth-cowboy-promet-un-come-back-express-des-fevrier-pour-ses-velos-electriques</guid>
      <description>
Mi-d&#233;cembre, la marque belge de v&#233;los &#233;lectriques Cowboy est officiellement pass&#233;e sous le contr&#244;le du groupe fran&#231;ais Rebirth. Quelques semaines apr&#232;s ce rachat, l&#8217;entreprise donne des pr&#233;cisions sur les changements de direction internes et les priorit&#233;s des prochains mois.
</description>
    </item>
    <item>
      <title>L&#8217;interdiction des r&#233;seaux sociaux aux moins de 15&#160;ans adopt&#233;s &#224; l&#8217;Assembl&#233;e&#160;: que contient vraiment le texte&#8201;?</title>
      <link>https://www.frandroid.com/culture-tech/politique/2955951_linterdiction-des-reseaux-sociaux-aux-moins-de-15-ans-adoptes-a-lassemblee-que-contient-le-texte</link>
      <pubDate>Tue, 27 Jan 2026 07:54:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/politique/2955951_linterdiction-des-reseaux-sociaux-aux-moins-de-15-ans-adoptes-a-lassemblee-que-contient-le-texte</guid>
      <description>
Apr&#232;s une longue soir&#233;e au Palais Bourbon, les d&#233;put&#233;s fran&#231;ais ont adopt&#233; en premi&#232;re lecture la loi sur l&#8217;interdiction des r&#233;seaux sociaux aux moins de 15&#160;ans. Mais le texte modifie plusieurs autres aspects du rapport des mineurs avec le num&#233;rique.
</description>
    </item>
    <item>
      <title>How organizations can mitigate shadow AI without stifling innovation</title>
      <link>https://www.techradar.com/pro/how-organizations-can-mitigate-shadow-ai-without-stifling-innovation</link>
      <pubDate>Tue, 27 Jan 2026 07:41:21 +0000</pubDate>
      <guid isPermaLink="false">977WoUtjFY57dZ58m4UNCf</guid>
      <description>Shadow AI has forced organizations to walk a fine line between pursuing innovation and ensuring protection.</description>
    </item>
    <item>
      <title>Apple d&#233;ploie une mise &#224; jour surprise d&#8217;iOS 12 pour les vieux iPhone</title>
      <link>https://www.01net.com/actualites/apple-deploie-une-mise-a-jour-surprise-dios-12-pour-les-vieux-iphone.html</link>
      <pubDate>Tue, 27 Jan 2026 07:39:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322622</guid>
      <description>La firme de Cupertino vient de d&#233;ployer une mise &#224; jour pour ses appareils fonctionnant toujours sous iOS 12. Trois ans apr&#232;s l&#8217;arr&#234;t officiel de leur support, Apple redonne vie &#224; l&#8217;iPhone 5s et &#224; l&#8217;iPhone 6.</description>
    </item>
    <item>
      <title>Fini l&#8217;option cach&#233;e, Bouygues Telecom bouleverse l&#8217;offre B&amp;You Pure Fibre</title>
      <link>https://www.frandroid.com/marques/bouygues-telecom/2955941_fini-loption-cachee-bouygues-telecom-bouleverse-loffre-byou-pure-fibre</link>
      <pubDate>Tue, 27 Jan 2026 07:36:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bouygues-telecom/2955941_fini-loption-cachee-bouygues-telecom-bouleverse-loffre-byou-pure-fibre</guid>
      <description>
L'offre B&amp;You Pure Fibre est d&#233;sormais divis&#233;e en deux forfaits distincts. Une clarification autrefois masqu&#233;e sous une option cach&#233;e.
</description>
    </item>
    <item>
      <title>Trop de promesses, trop d&#8217;usages&#160;: pourquoi Meta s&#8217;est plant&#233; avec son m&#233;tavers</title>
      <link>https://www.01net.com/actualites/trop-de-promesses-trop-dusages-pourquoi-meta-sest-plante-avec-son-metavers.html</link>
      <pubDate>Tue, 27 Jan 2026 07:30:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322585</guid>
      <description>Le m&#233;tavers co&#251;tait trop cher et courait trop de li&#232;vres &#224; la fois : c'est ce qui explique la purge r&#233;cente avec ses centaines de suppression de postes des Reality Labs, a expliqu&#233; le patron du mat&#233;riel chez Meta.</description>
    </item>
    <item>
      <title>Not&#233; 9/10 et &#233;lu meilleur rapport qualit&#233;/prix, ce TV TCL mini LED 55&#8243; est en plus sold&#233; &#224; -300 &#8364; pour un max de divertissement</title>
      <link>https://www.frandroid.com/bons-plans/2955035_note-9-10-et-elu-meilleur-rapport-qualite-prix-ce-tv-tcl-mini-led-55-est-en-plus-solde-a-300-e-pour-un-max-de-divertissement</link>
      <pubDate>Tue, 27 Jan 2026 07:18:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2955035_note-9-10-et-elu-meilleur-rapport-qualite-prix-ce-tv-tcl-mini-led-55-est-en-plus-solde-a-300-e-pour-un-max-de-divertissement</guid>
      <description>
Le TCL C89K existe en plusieurs tailles : la plus raisonnable est la 55 pouces et c'est celle qui est &#224; retrouver sold&#233;e sur Darty &#224; 699,99 euros au lieu de 999,99 euros au lancement.
</description>
    </item>
    <item>
      <title>WhatsApp accus&#233; de lire vos messages priv&#233;s malgr&#233; le chiffrement, Meta aurait menti</title>
      <link>https://www.frandroid.com/marques/meta/2955907_whatsapp-accuse-de-lire-vos-messages-prives-malgre-le-chiffrement-meta-aurait-menti</link>
      <pubDate>Tue, 27 Jan 2026 07:14:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2955907_whatsapp-accuse-de-lire-vos-messages-prives-malgre-le-chiffrement-meta-aurait-menti</guid>
      <description>
Meta est au-devant d'un nouveau proc&#232;s. La firme est accus&#233;e de mentir concernant la confidentialit&#233; des donn&#233;es sur WhatsApp. La messagerie laisserait un acc&#232;s en lecture &#224; l'entreprise.
</description>
    </item>
    <item>
      <title>Crypto&#160;: fuite de donn&#233;es &#224; r&#233;p&#233;tition chez la start-up fran&#231;aise Waltio</title>
      <link>https://www.01net.com/actualites/fuite-donnees-touche-50-000-investisseurs-crypto-france.html</link>
      <pubDate>Tue, 27 Jan 2026 07:10:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322352</guid>
      <description>La plateforme fran&#231;aise Waltio, sp&#233;cialis&#233;e dans la fiscalit&#233; des cryptomonnaies, vient d'&#234;tre victime d'une cyberattaque. Revendiqu&#233;e par le gang Sjiny Hunters, l'attaque a permis de voler les donn&#233;es de 50 000 investisseurs fran&#231;ais. Ceux-ci risquent de se retrouver dans le viseur des criminels sp&#233;cialis&#233;s dans l'extorsion.</description>
    </item>
    <item>
      <title>Android 17 : pourquoi Google s&#8217;obstine &#224; copier Apple</title>
      <link>https://www.frandroid.com/android/2955923_android-17-pourquoi-google-sobstine-a-copier-apple</link>
      <pubDate>Tue, 27 Jan 2026 07:09:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/2955923_android-17-pourquoi-google-sobstine-a-copier-apple</guid>
      <description>
Le design est une affaire de cycles. Mais voir Android 17 copier l'un des aspects les plus critiqu&#233;s d'iOS 26 nous laisse sceptique. 
</description>
    </item>
    <item>
      <title>Double batterie et moteur surpuissant &#224; 3 300 &#8364; : le premier v&#233;lo &#233;lectrique familial de Knaap envoie du lourd</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2955247_double-batterie-et-moteur-surpuissant-a-3-300-e-le-premier-velo-electrique-familial-de-knaap-envoie-du-lourd</link>
      <pubDate>Tue, 27 Jan 2026 07:04:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2955247_double-batterie-et-moteur-surpuissant-a-3-300-e-le-premier-velo-electrique-familial-de-knaap-envoie-du-lourd</guid>
      <description>
Pour diversifier son offre, la firme n&#233;erlandaise de fatbikes pr&#233;sente son premier v&#233;lo cargo &#233;lectrique, le longtail Knaap PAR X26 &#224; double batterie, avec un gros moteur central et un &#233;quipement quasi parfait, le tout &#224; prix abordable.
</description>
    </item>
    <item>
      <title>YouTube teste une option payante pour une fonction jusque-l&#224; gratuite</title>
      <link>https://www.01net.com/actualites/youtube-teste-une-option-payante-pour-une-fonction-jusque-la-gratuite.html</link>
      <pubDate>Tue, 27 Jan 2026 07:01:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322579</guid>
      <description>YouTube a besoin de justifier le prix de son abonnement premium avec l'ajout r&#233;gulier de nouvelles fonctions, et parfois l'inspiration manque. Pourquoi ne pas faire d'une fonction gratuite une option payante ?</description>
    </item>
    <item>
      <title>Il cr&#233;e une PS4 portable avec un &#233;cran 1080p OLED</title>
      <link>https://www.frandroid.com/produits-android/console/console-de-jeux/2955909_il-cree-une-ps4-portable-avec-un-ecran-1080p-oled</link>
      <pubDate>Tue, 27 Jan 2026 07:01:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/console-de-jeux/2955909_il-cree-une-ps4-portable-avec-un-ecran-1080p-oled</guid>
      <description>
Ce n'est ni un Steam Deck, ni une &#233;ni&#232;me console chinoise sous Android. C'est une PlayStation 4 Slim enti&#232;rement d&#233;soss&#233;e, d&#233;coup&#233;e et remont&#233;e dans un ch&#226;ssis imprim&#233; en 3D. 
</description>
    </item>
    <item>
      <title>80% of employees struggle with this hidden workplace bias. Here&#8217;s what employers can do</title>
      <link>https://www.fastcompany.com/91477739/70-of-employees-struggle-with-this-hidden-workplace-bias</link>
      <pubDate>2026-01-27T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91477739/70-of-employees-struggle-with-this-hidden-workplace-bias</guid>
      <description>These standard office practices could be making life difficult for the majority of employees.
It&#8217;s 7:45 a.m. in the office. Someone bounces in, already back from the gym, already through their emails. Cheerfully asks if everyone&#8217;s &#8220;okay&#8221; because it&#8217;s so quiet and people seem a bit tired.</description>
    </item>
    <item>
      <title>Google Photos&#160;: l&#8217;outil pour transformer des photos en vid&#233;os passe au niveau sup&#233;rieur</title>
      <link>https://www.01net.com/actualites/google-photos-outil-transformer-photos-videos-passe-niveau-superieur.html</link>
      <pubDate>Tue, 27 Jan 2026 06:58:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322600</guid>
      <description>En donnant la possibilit&#233; de faire des instructions textuelles pr&#233;cises, Google Photos am&#233;liore enfin son outil qui permet de transformer des photos en vid&#233;os.</description>
    </item>
  </channel>
</rss>
