<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 24 Jan 2026 08:32:35 GMT</lastBuildDate>
    <item>
      <title>Final Fantasy VII Remake Intergrade&#160;: la version Switch 2 est-elle au niveau&#160;?</title>
      <link>https://www.01net.com/actualites/final-fantasy-vii-remake-intergrade-la-version-switch-2-est-elle-au-niveau.html</link>
      <pubDate>Sat, 24 Jan 2026 08:31:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322161</guid>
      <description>Attendue de longue date, la version Switch 2 de Final Fantasy VII Remake Intergrade est disponible depuis cette semaine en France. Mais que vaut vraiment ce portage et m&#233;rite-t-il qu&#8217;on se replonge une &#233;ni&#232;me fois dans l&#8217;aventure ?</description>
    </item>
    <item>
      <title>Xiaomi brade d&#233;j&#224; son tout nouveau smartphone pas cher, le Redmi Note 15 4G, avec des &#233;couteurs offerts en prime</title>
      <link>https://www.frandroid.com/bons-plans/2951789_xiaomi-brade-deja-son-tout-nouveau-smartphone-pas-cher-le-redmi-note-15-4g-avec-des-ecouteurs-offerts-en-prime</link>
      <pubDate>Sat, 24 Jan 2026 08:24:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2951789_xiaomi-brade-deja-son-tout-nouveau-smartphone-pas-cher-le-redmi-note-15-4g-avec-des-ecouteurs-offerts-en-prime</guid>
      <description>
Une batterie de 6 000 mAh, un grand &#233;cran AMOLED, un capteur photo de 108 m&#233;gapixels et une certification IP64, le tout &#224; prix serr&#233; : c'est la promesse du nouveau Xiaomi Redmi Note 15 4G. Avec les soldes, une remise et une ODR font tr&#233;bucher le tarif de 233 euros &#224; 179 euros tout en ajoutant une paire de Redmi Buds Active 6 offerte.
</description>
    </item>
    <item>
      <title>iPhone : Apple pr&#233;parerait un chamboulement en coulisses pour 2028</title>
      <link>https://www.frandroid.com/marques/apple/2954283_iphone-apple-preparerait-un-chamboulement-en-coulisses-pour-2028</link>
      <pubDate>Sat, 24 Jan 2026 08:07:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2954283_iphone-apple-preparerait-un-chamboulement-en-coulisses-pour-2028</guid>
      <description>
Apple se tournerait vers Intel pour moins d&#233;pendre de TSMC sur la fabrication des puces pour certains iPhone d&#232;s 2028.
</description>
    </item>
    <item>
      <title>6 milliards de mots de passe pirat&#233;s&#160;: les virus voleurs de donn&#233;es ont fait un carnage en 2025</title>
      <link>https://www.01net.com/actualites/6-milliards-mots-passe-pirates-virus-voleurs-donnees-carnage-2025.html</link>
      <pubDate>Sat, 24 Jan 2026 08:06:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321231</guid>
      <description>Plus de six milliards de mots de passe ont &#233;t&#233; siphonn&#233;s par des malwares en 2025. M&#234;me les mots de passe complexes et bien s&#233;curis&#233;s n'&#233;chappent pas aux virus de type infostealer. Ces identifiants compromis offrent aux cybercriminels un carburant in&#233;puisable pour leurs attaques.</description>
    </item>
    <item>
      <title>The Loch Capsule dishwasher is small, fast, and efficient &#8212; it even sanitizes gadgets</title>
      <link>https://www.theverge.com/reviews/866476/loch-capsule-review-counter-dishwasher-vanlife-tiny-house</link>
      <pubDate>2026-01-24T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/866476/tcls-playcube-projector-is-more-fun-than-a-rubiks-cube</guid>
      <description>A dishwasher is a luxury item some people can't live without. It's one of the first major kitchen devices I bought just as soon as I could afford one. And now that the kids are grown, it's the appliance I thought I'd miss most in my nomadic vanlife pursuits. Loch sent me its $459.99 / [&#8230;]</description>
    </item>
    <item>
      <title>Our 'favourite travel camera' for most people just hit a record-low price - the five-star-rated OM System OM-5 Mark II</title>
      <link>https://www.techradar.com/cameras/mirrorless-cameras/our-favourite-travel-camera-for-most-people-just-hit-a-record-low-price-the-five-star-rated-om-system-om-5-mark-ii</link>
      <pubDate>Sat, 24 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">gaczUe5kBfvf8JsVTkaegG</guid>
      <description>Get our top-rated travel camera, the OM SYSTEM OM-5 Mark II, for under &#163;900</description>
    </item>
    <item>
      <title>Russia&#8217;s battle against VPNs is entering a new phase: Here's what to expect in 2026</title>
      <link>https://www.techradar.com/vpn/vpn-services/russias-battle-against-vpns-is-entering-a-new-phase-heres-what-to-expect-in-2026</link>
      <pubDate>Sat, 24 Jan 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">PPZycvhhPrcixqsjT8FFwi</guid>
      <description>New laws and sophisticated blocking techniques are making VPN use in Russia increasingly difficult. Here's what changed last year and what to expect over the next 12 months.</description>
    </item>
    <item>
      <title>Stop tracking employee engagement. Try this instead</title>
      <link>https://www.fastcompany.com/91475008/stop-tracking-employee-engagement-try-this-instead</link>
      <pubDate>2026-01-24T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91475008/stop-tracking-employee-engagement-try-this-instead</guid>
      <description>Companies have never had more tools to measure engagement, yet employees are feeling more disconnected than ever.
Companies have never had more tools to measure engagement, yet employees have never reported feeling more disconnected.</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver : les prix chutent et les d&#233;cibels montent dans ce top des offres sur les casques, &#233;couteurs et enceintes</title>
      <link>https://www.frandroid.com/bons-plans/2953611_soldes-dhiver-les-prix-chutent-et-les-decibels-montent-dans-ce-top-des-offres-sur-les-casques-ecouteurs-et-enceintes</link>
      <pubDate>Sat, 24 Jan 2026 06:39:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2953611_soldes-dhiver-les-prix-chutent-et-les-decibels-montent-dans-ce-top-des-offres-sur-les-casques-ecouteurs-et-enceintes</guid>
      <description>
Les soldes d'hiver sont d&#233;j&#224; dans leur troisi&#232;me d&#233;marque et il n'y a plus que celle-ci et la quatri&#232;me pour faire de bonnes affaires sur l'audio. Voici notre s&#233;lection des meilleures promotions sur les casques Bluetooth, &#233;couteurs sans fil, enceintes et barres de son lors de cette p&#233;riode.
</description>
    </item>
  </channel>
</rss>
