<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 11 Dec 2025 11:23:21 GMT</lastBuildDate>
    <item>
      <title>Leapmotor D19 : plus de 1 000 km d&#8217;autonomie pour cette voiture &#233;lectrique chinoise de Stellantis qui inaugure une technologie allemande</title>
      <link>https://www.frandroid.com/marques/leapmotor/2906329_leapmotor-d19-plus-de-1-000-km-dautonomie-pour-cette-voiture-electrique-chinoise-de-stellantis-qui-inaugure-une-technologie-allemande</link>
      <pubDate>Thu, 11 Dec 2025 11:18:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/leapmotor/2906329_leapmotor-d19-plus-de-1-000-km-dautonomie-pour-cette-voiture-electrique-chinoise-de-stellantis-qui-inaugure-une-technologie-allemande</guid>
      <description>
D&#233;voil&#233; au mois d&#8217;octobre 2025, le nouveau Leapmotor D19 se d&#233;cline en une version &#233;quip&#233;e d&#8217;un prolongateur d&#8217;autonomie. Fourni par l&#8217;&#233;quipementier allemand ZF, ce dernier poss&#232;de une petite particularit&#233;. Il pourrait arriver en Europe gr&#226;ce &#224; Stellantis.
</description>
    </item>
    <item>
      <title>Smartphones Samsung&#160;: ces deux mod&#232;les incontournables arriveraient plus t&#244;t que pr&#233;vu</title>
      <link>https://www.01net.com/actualites/smartphones-samsung-modeles-incontournables-pourraient-arriver-plus-tot.html</link>
      <pubDate>Thu, 11 Dec 2025 11:10:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314996</guid>
      <description>Les Galaxy A37 et A57 pourraient arriver plus t&#244;t que pr&#233;vu, ce qui bousculerait le calendrier habituel de Samsung.</description>
    </item>
    <item>
      <title>The Dyson V11 is a fantastic vacuum to buy while it&#8217;s still at its Black Friday price</title>
      <link>https://www.techradar.com/home/vacuums/the-dyson-v11-is-a-fantastic-vacuum-to-buy-while-its-still-at-its-black-friday-price</link>
      <pubDate>Thu, 11 Dec 2025 11:08:52 +0000</pubDate>
      <guid isPermaLink="false">5fCufdjTrkqUhmz7S56DwC</guid>
      <description>The Dyson V11 is a superb vacuum cleaner for most homes. It's currently available at a great price right now at Amazon. Here's why you need it in your life.</description>
    </item>
    <item>
      <title>Android just got a life-saving upgrade that lets you share live video with emergency rescuers &#8211; here's how it works</title>
      <link>https://www.techradar.com/phones/android/android-just-got-a-life-saving-upgrade-that-lets-you-share-live-video-with-emergency-rescuers-heres-how-it-works</link>
      <pubDate>Thu, 11 Dec 2025 11:07:25 +0000</pubDate>
      <guid isPermaLink="false">BQ5r8zURew4sBYDqSSr7h9</guid>
      <description>Android Emergency Live Video is a new feature that lets you show responders what you can see, so they can better assist you.</description>
    </item>
    <item>
      <title>Adobe sees a bright future as AI bet pays off</title>
      <link>https://www.theverge.com/news/842256/adobe-2025-earnings-ai-growth</link>
      <pubDate>2025-12-11T06:06:44-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=842256</guid>
      <description>Entrenching generative AI into Adobe's creative software ecosystem is paying off, according to the company's latest earnings. While its share price has fallen by more than 37 percent this year at the time of writing, Adobe is reporting a bump in annual profits driven by record revenue of $23.77 billion for 2025 - an 11 [&#8230;]</description>
    </item>
    <item>
      <title>The SteelSeries Arctis Nova 7 Gen 2 gaming headset dips back down to a lowest-ever UK price</title>
      <link>https://www.techradar.com/gaming/the-steelseries-arctis-nova-7-gen-2-gaming-headset-dips-back-down-to-a-lowest-ever-uk-price</link>
      <pubDate>Thu, 11 Dec 2025 11:05:09 +0000</pubDate>
      <guid isPermaLink="false">zc6xsX2kNDmx2MbLHebKYP</guid>
      <description>The SteelSeries Arctis Nova 7 Gen 2 is at its lowest price in a year, and I highly recommend it for the companion app and custom game profiles.</description>
    </item>
    <item>
      <title>&#171;&#160;C&#8217;est un d&#233;sastre&#160;&#187; : le portage de Skyrim sur Switch 2 rend le jeu injouable</title>
      <link>https://www.frandroid.com/actualites-generales/2906381_cest-un-desastre-le-portage-de-skyrim-sur-switch-2-rend-le-jeu-injouable</link>
      <pubDate>Thu, 11 Dec 2025 11:03:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2906381_cest-un-desastre-le-portage-de-skyrim-sur-switch-2-rend-le-jeu-injouable</guid>
      <description>
Skyrim est sorti sur Switch 2 cette semaine &#224; la surprise g&#233;n&#233;rale. Mais le RPG d&#233;sormais culte de Bethesda est dans un &#233;tat qui ne justifie pour l'instant pas son tarif de 60 euros.
</description>
    </item>
    <item>
      <title>Games Workshop Has Finally Learned Its Lesson</title>
      <link>https://gizmodo.com/warhammer-40k-horus-heresy-end-of-ruin-print-on-demand-2000698175</link>
      <pubDate>Thu, 11 Dec 2025 11:00:15 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000698175</guid>
      <description>After months of silence, the 'Warhammer 40,000' creator has decided on a new way to sell its fancy books without them being immediately scalped by resellers.</description>
    </item>
    <item>
      <title>Port raises $100M at $800M valuation to take on Spotify&#8217;s Backstage</title>
      <link>https://techcrunch.com/2025/12/11/port-raises-100m-at-800m-valuation-to-take-on-spotifys-backstage/</link>
      <pubDate>Thu, 11 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3073429</guid>
      <description>Port offers a proprietary alternative to Spotify's popular devtool catalog Backstage, but with a valuable addition: it can be used to manage AI agents, too.</description>
    </item>
    <item>
      <title>Runware raises $50M Series A to help make image, video generation easier for developers</title>
      <link>https://techcrunch.com/2025/12/11/runware-raises-50m-series-a-from-dawn-capital-comcast-ventures-to-become-the-api-for-all-ai/</link>
      <pubDate>Thu, 11 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3074800</guid>
      <description>Runware lets developers integrate realtime image generation in their apps, with an affordable pricing model.</description>
    </item>
    <item>
      <title>The Rings of Power season 3 has officially wrapped filming, and I've got thoughts about when it'll launch on Prime Video</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/the-rings-of-power-season-3-has-officially-wrapped-filming-and-ive-got-thoughts-about-when-itll-launch-on-prime-video</link>
      <pubDate>Thu, 11 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">gYSTTFkQbW63jQwKJnrLcC</guid>
      <description>Prime Video has confirmed that filming has wrapped on The Rings of Power's third season.</description>
    </item>
    <item>
      <title>Spoiled Jennifer Lawrence return to Hunger Games: Sunrise on the Reaping proves we don&#8217;t deserve to have anything nice</title>
      <link>https://www.techradar.com/streaming/entertainment/spoiled-jennifer-lawrence-return-to-hunger-games-sunrise-on-the-reaping-proves-we-dont-deserve-to-have-anything-nice</link>
      <pubDate>Thu, 11 Dec 2025 10:55:53 +0000</pubDate>
      <guid isPermaLink="false">RaqT5aGJy7g23VDhpFb8Tm</guid>
      <description>Jennifer Lawrence and Josh Hutcherson are confirmed to return for The Hunger Games: Sunrise on the Reaping, but why are we finding this out now?</description>
    </item>
    <item>
      <title>&#171;&#160;Voir sous la peau&#160;&#187; : quand Donald Trump confond la 6G avec un appareil photo</title>
      <link>https://www.01net.com/actualites/voir-sous-la-peau-quand-donald-trump-confond-la-6g-avec-un-appareil-photo.html</link>
      <pubDate>Thu, 11 Dec 2025 10:43:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314993</guid>
      <description>Donald Trump a une vision bien &#224; lui de la tech. En direct face au patron de Qualcomm, le pr&#233;sident am&#233;ricain a confondu la 6G avec... un zoom photo ultra-puissant. Une s&#233;quence d&#233;j&#224; culte.</description>
    </item>
    <item>
      <title>Skyrim developer says it was 'really easy' to port the beloved RPG to Switch 2</title>
      <link>https://www.techradar.com/gaming/skyrim-developer-says-it-was-really-easy-to-port-the-beloved-rpg-to-switch-2</link>
      <pubDate>Thu, 11 Dec 2025 10:37:27 +0000</pubDate>
      <guid isPermaLink="false">vimC9gGBiCFEMCNYCCDSvX</guid>
      <description>Skyrim developer says it's 'a bit of a joke' bringing the game to yet another platform, but discusses why it's come to Switch 2.</description>
    </item>
    <item>
      <title>Nebula Mars 3 Air : ce vid&#233;oprojecteur nomade perd plus de 200 &#8364; de son prix sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2906129_nebula-mars-3-air-ce-videoprojecteur-nomade-perd-plus-de-200-e-de-son-prix-sur-amazon</link>
      <pubDate>Thu, 11 Dec 2025 10:37:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2906129_nebula-mars-3-air-ce-videoprojecteur-nomade-perd-plus-de-200-e-de-son-prix-sur-amazon</guid>
      <description>
Les vid&#233;oprojecteurs ont longtemps trimball&#233; cette r&#233;putation d&#8217;armoires normandes : lourds, statiques, condamn&#233;s au fond d&#8217;un salon. Mais la donne a chang&#233;. Depuis quelques ann&#233;es, la sc&#232;ne s&#8217;est remplie de machines nomades, compactes et surtout &#233;quip&#233;es d&#8217;une vraie batterie. Le Nebula Mars 3 Air est petit, malin, autonome, avec les bonnes fonctionnalit&#233;s. Et Amazon lui fait perdre du poids,  son prix passe de 599,99 euros &#224; 395,99 euros.
...</description>
    </item>
    <item>
      <title>Oubliez les montres hors de prix, l&#8217;Amazfit Active Max se d&#233;voile avec une fiche technique impressionnante</title>
      <link>https://www.frandroid.com/marques/amazfit/2906237_oubliez-les-montres-hors-de-prix-lamazfit-active-max-se-devoile-avec-une-fiche-technique-impressionnante</link>
      <pubDate>Thu, 11 Dec 2025 10:36:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazfit/2906237_oubliez-les-montres-hors-de-prix-lamazfit-active-max-se-devoile-avec-une-fiche-technique-impressionnante</guid>
      <description>
D'apr&#232;s les informations obtenues par le journaliste Roland Quandt, Amazfit devrait lancer prochainement une nouvelle montre de sport accessible et avec une autonomie impressionnante, l'Amazfit Active Max. 
</description>
    </item>
    <item>
      <title>Librarians Aren&#8217;t Hiding Secret Books From You That Only AI Knows About</title>
      <link>https://gizmodo.com/librarians-arent-hiding-secret-books-from-you-that-only-ai-knows-about-2000698176</link>
      <pubDate>Thu, 11 Dec 2025 10:30:51 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000698176</guid>
      <description>AI chatbots are generating fake titles that people insist are real.</description>
    </item>
    <item>
      <title>Harness hits $5.5B valuation with $240M raise to automate AI&#8217;s &#8216;after-code&#8217; gap</title>
      <link>https://techcrunch.com/2025/12/11/harness-hits-5-5b-valuation-with-240m-to-automate-ais-after-code-gap/</link>
      <pubDate>Thu, 11 Dec 2025 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3074984</guid>
      <description>Goldman Sachs has led Harness's Series E round, with participation from IVP, Menlo Ventures, and Unusual Ventures.</description>
    </item>
    <item>
      <title>Adobe Photoshop is now built into ChatGPT for free &#8211; and you don't need graphic design skills to use it</title>
      <link>https://www.techradar.com/ai-platforms-assistants/adobe-photoshop-is-now-built-into-chatgpt-for-free-and-you-dont-need-graphic-design-skills-to-use-it</link>
      <pubDate>Thu, 11 Dec 2025 10:28:10 +0000</pubDate>
      <guid isPermaLink="false">xgVj8WSg6gF9fkd7CLLU5G</guid>
      <description>Adobe has launched three of its popular creativity and productivity tools, Photoshop, Express, and Acrobat, as apps inside ChatGPT, for free.</description>
    </item>
    <item>
      <title>US could demand five-year social media history from tourists before allowing entry</title>
      <link>https://www.engadget.com/social-media/us-could-demand-five-year-social-media-history-from-tourists-before-allowing-entry-102751243.html?src=rss</link>
      <pubDate>Thu, 11 Dec 2025 10:27:51 +0000</pubDate>
      <guid isPermaLink="false">5844efd6-28d8-4305-b70e-80e5ac2e7fe8</guid>
      <description>Tourists from Europe and other regions could be asked to provide a five-year social media history before given entry to the United States, according to a new proposal from the US Customs and Border Protection service (CBP). The new rule would affect visitors from countries who normally enjoy relatively easy entry to the US via the Electronic System for Travel Authorization (ESTA).
The new proposal cites an executive order issued by President Trump from January titled "Protecting the United States From Foreign Terrorists and Other National Security and Public Safety Threats." In his first year ...</description>
    </item>
    <item>
      <title>Finalize your trip to Japan with Jetpac eSIM- claim a 15% discount code valid on all Japan plans</title>
      <link>https://www.techradar.com/pro/finalize-your-trip-to-japan-with-jetpac-esim-claim-a-15-percent-discount-code-valid-on-all-japan-plans</link>
      <pubDate>Thu, 11 Dec 2025 10:26:14 +0000</pubDate>
      <guid isPermaLink="false">WNQHTJaQdajv3cUvSLFrLC</guid>
      <description>Jetpac is known for its ease of use, strong connection speeds, extensive global coverage in 200+ destinations, and intuitive app.</description>
    </item>
    <item>
      <title>Apr&#232;s le retrait de Bosch, le plus grand salon v&#233;lo d&#8217;Europe change radicalement de strat&#233;gie et tend une nouvelle fois la main aux marques</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2906295_apres-le-retrait-de-bosch-le-plus-grand-salon-velo-deurope-change-radicalement-de-strategie-et-tend-une-nouvelle-fois-la-main-aux-marques</link>
      <pubDate>Thu, 11 Dec 2025 10:12:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2906295_apres-le-retrait-de-bosch-le-plus-grand-salon-velo-deurope-change-radicalement-de-strategie-et-tend-une-nouvelle-fois-la-main-aux-marques</guid>
      <description>
Eurobike ouvre un appel &#224; contributions pour l&#8217;&#233;dition 2026 alors que le salon traverse une crise majeure. L&#8217;objectif ici est de donner l&#8217;opportunit&#233; aux marques de sugg&#233;rer des sujets et des intervenants pour l&#8217;&#233;v&#233;nement.
</description>
    </item>
    <item>
      <title>Warner Bros. admet que l&#8217;accord avec Netflix pourrait &#234;tre annul&#233;, si Paramount Skydance met quelques milliards en plus</title>
      <link>https://www.frandroid.com/services/svod/2906133_warner-bros-admet-que-laccord-avec-netflix-pourrait-etre-annule-si-paramount-skydance-met-quelques-milliards-en-plus</link>
      <pubDate>Thu, 11 Dec 2025 10:11:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2906133_warner-bros-admet-que-laccord-avec-netflix-pourrait-etre-annule-si-paramount-skydance-met-quelques-milliards-en-plus</guid>
      <description>
Le deal entre Warner Bros. Discovery et Netflix pourrait capoter plus rapidement qu'on ne le pensait, et c'est David Zaslav qui en fait l'aveu. Le PDG du conglom&#233;rat a effectivement annonc&#233; que l'accord de vente pouvait &#234;tre annul&#233; &#224; condition que Paramount mette encore un peu la main &#224; la poche.
</description>
    </item>
    <item>
      <title>La cl&#233; de voiture sur smartphone se g&#233;n&#233;ralise : la preuve avec Samsung et Porsche</title>
      <link>https://www.frandroid.com/marques/porsche/2906229_la-cle-de-voiture-sur-smartphone-se-generalise-la-preuve-avec-samsung-et-porsche</link>
      <pubDate>Thu, 11 Dec 2025 10:09:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/porsche/2906229_la-cle-de-voiture-sur-smartphone-se-generalise-la-preuve-avec-samsung-et-porsche</guid>
      <description>
Les nouvelles voitures &#233;lectriques de Porsche deviennent compatibles avec la cl&#233; num&#233;rique des smartphones Samsung. De quoi d&#233;verrouiller les Macan et Cayenne avec son Galaxy et partager leur acc&#232;s &#224; des contacts d'un geste.
</description>
    </item>
    <item>
      <title>Google Pixel 10a : pourquoi vous n&#8217;avez sans doute aucune raison de l&#8217;attendre</title>
      <link>https://www.frandroid.com/marques/google/2906225_google-pixel-10a-pourquoi-vous-navez-sans-doute-aucune-raison-de-lattendre</link>
      <pubDate>Thu, 11 Dec 2025 10:07:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2906225_google-pixel-10a-pourquoi-vous-navez-sans-doute-aucune-raison-de-lattendre</guid>
      <description>
Une r&#233;cente fuite sur le Pixel 10a semble r&#233;v&#233;ler une triste nouvelle : le t&#233;l&#233;phone reprendrait &#224; l'identique la fiche technique du Pixel 9a de cette ann&#233;e.
</description>
    </item>
    <item>
      <title>Tim Cook en croisade contre la v&#233;rification d&#8217;&#226;ge obligatoire sur l&#8217;App Store</title>
      <link>https://www.01net.com/actualites/tim-cook-en-croisade-contre-la-verification-dage-obligatoire-sur-lapp-store.html</link>
      <pubDate>Thu, 11 Dec 2025 10:02:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314986</guid>
      <description>Apple ne veut pas prendre la responsabilit&#233; de la v&#233;rification de l&#8217;&#226;ge des utilisateurs de l&#8217;App Store. Tim Cook a pris son b&#226;ton de p&#232;lerin pour batailler contre un projet de loi qui imposerait une telle mesure au niveau national aux &#201;tats-Unis.</description>
    </item>
    <item>
      <title>The best noise-canceling headphones for 2025</title>
      <link>https://www.engadget.com/audio/headphones/best-noise-canceling-headphones-130029881.html?src=rss</link>
      <pubDate>Thu, 11 Dec 2025 10:00:35 +0000</pubDate>
      <guid isPermaLink="false">5de7a513-2989-4305-b9a9-0cf68ac17136</guid>
      <description>Noise is hard to escape, whether it&#8217;s the hum of traffic, the buzz of a busy office or the neighbor&#8217;s lawn mower starting up right when you need to focus. That&#8217;s where noise-canceling headphones earn their keep. A good pair doesn&#8217;t just quiet the world around you, it creates a pocket of calm so you can actually enjoy your music, podcasts or peace and quiet.Modern noise-canceling headphones have come a long way, combining powerful ANC with clearer sound, longer battery life and smarter features like adaptive modes and multipoint connectivity. Some emphasize comfort for long flights, while other...</description>
    </item>
    <item>
      <title>Uber Reportedly Downplaying EV Incentives for Drivers As It Prepares to Miss Emissions Goals</title>
      <link>https://gizmodo.com/uber-reportedly-downplaying-ev-incentives-for-drivers-as-it-prepares-to-miss-emissions-goals-2000698087</link>
      <pubDate>Thu, 11 Dec 2025 10:00:03 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000698087</guid>
      <description>Trump 2.0 has been hard on EV adoption. Uber is just one more example.</description>
    </item>
    <item>
      <title>OpenAI turns 10 today. Where will it be in another decade?</title>
      <link>https://www.fastcompany.com/91447143/openai-anniversary-sam-altman-chatgpt</link>
      <pubDate>2025-12-11T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91447143/openai-anniversary-sam-altman-chatgpt</guid>
      <description>A shock announcement at an academic conference led to one of the most important companies on the planet. But what&#8217;s next?
On December 11, 2015, OpenAI arrived on the scene with a bang. Announced on the penultimate day of the Conference on Neural Information Processing Systems, an academic confab held in Montreal&#8217;s Palais des Congr&#232;s by Elon Musk, Sam Altman, and others, the organization had been in the planning for months (an infamous July 2015 meeting at the Rosewood Sand Hill Hotel brought on board many of OpenAI&#8217;s key early staffers)....</description>
    </item>
    <item>
      <title>The hardest startup in America</title>
      <link>https://www.fastcompany.com/91448561/this-is-the-hardest-startup-in-america</link>
      <pubDate>2025-12-11T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448561/this-is-the-hardest-startup-in-america</guid>
      <description>Augustus Doricko&#8217;s Rainmaker uses cloud seeding tech to bring rain where it&#8217;s needed. In the process, he&#8217;s been swept up in a storm of controversy involving accusations that he&#8217;s playing God, an agent of the deep state, and worse. 
Augustus Doricko, founder and CEO of cloud-seeding startup Rainmaker, surveys the sky from a sunbaked hillside 5 miles from Utah&#8217;s Great Salt Lake. On this balmy Sunday afternoon in late September, the lake is calm, but its serenity belies a potentially catastrophic problem: The Great Salt Lake is shrinking&#8212;and is at risk of disappearing altogether....</description>
    </item>
    <item>
      <title>Is it really so bad to be fake at work?</title>
      <link>https://www.fastcompany.com/91453568/fake-at-work-strategic-authenticity</link>
      <pubDate>2025-12-11T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91453568/fake-at-work-strategic-authenticity</guid>
      <description>In fact, total honesty is not a virtue, but a hazard.
Faking tends to get a bad rap. We celebrate authenticity, praise, and honesty, and preach radical transparency&#8212;as if the workplace would magically improve if everyone walked around expressing their unfiltered &#8220;true selves.&#8221;</description>
    </item>
    <item>
      <title>This startup is building a network of home batteries to help solve the grid&#8217;s woes</title>
      <link>https://www.fastcompany.com/91458082/this-startup-is-building-a-network-of-home-batteries-to-help-solve-the-grids-woes</link>
      <pubDate>2025-12-11T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91458082/this-startup-is-building-a-network-of-home-batteries-to-help-solve-the-grids-woes</guid>
      <description>Haven works with homeowners to freely installs batteries and solar to homes that qualify for state incentives around areas where the grid is particularly overloaded.
As data centers strain the power grid, utilities are scrambling to build new power plants. But a startup in California is one of a handful focusing on the problem from a different angle: building a network of batteries and solar panels at homes to relieve pressure on the grid more quickly....</description>
    </item>
    <item>
      <title>Super prix pour le Samsung Galaxy Book 4 Edge : ce performant laptop sous Snapdragon X est &#224; moins de 600 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2451814_super-prix-pour-le-samsung-galaxy-book-4-edge-ce-performant-laptop-sous-snapdragon-x-est-a-moins-de-600-euros</link>
      <pubDate>Thu, 11 Dec 2025 09:49:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2451814_super-prix-pour-le-samsung-galaxy-book-4-edge-ce-performant-laptop-sous-snapdragon-x-est-a-moins-de-600-euros</guid>
      <description>
L&#233;ger, performant et endurant, le Samsung Galaxy Book 4 Edge a&#160;toutes ces qualit&#233;s que l&#8217;on attend d&#8217;un laptop pour travailler. Aujourd&#8217;hui, il est possible de l&#8217;obtenir &#224; seulement 599 euros.
</description>
    </item>
    <item>
      <title>&#171;&#160;Une grosse faille&#160;&#187; : comment cette erreur de l&#8217;Europe a provoqu&#233; une arriv&#233;e massive des voitures hybrides chinoises</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2906035_une-grosse-faille-comment-cette-erreur-de-leurope-a-provoque-une-arrivee-massive-des-voitures-hybrides-chinoises</link>
      <pubDate>Thu, 11 Dec 2025 09:43:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2906035_une-grosse-faille-comment-cette-erreur-de-leurope-a-provoque-une-arrivee-massive-des-voitures-hybrides-chinoises</guid>
      <description>
Face &#224; l&#8217;invasion de voitures &#233;lectriques chinoises, l&#8217;Europe a d&#233;cid&#233; de mettre en place des droits de douane punitifs. Mais il semblerait que cette mesure ait en fait eu l&#8217;effet inverse, alors que les ventes d&#8217;autos de l&#8217;Empire du Milieu ne cessent de grimper sur le Vieux Continent.
</description>
    </item>
    <item>
      <title>Myst&#232;re en Russie&#160;: des centaines de Porsche transform&#233;es en briques, sabotage ou bug&#160;?</title>
      <link>https://www.01net.com/actualites/mystere-en-russie-des-centaines-de-porsche-transformees-en-briques-sabotage-ou-bug.html</link>
      <pubDate>Thu, 11 Dec 2025 09:34:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314966</guid>
      <description>En Russie, c&#8217;est l&#8217;h&#233;catombe pour les propri&#233;taires de Porsche. Leurs bolides refusent de d&#233;marrer. Sabotage &#224; distance ou bug du syst&#232;me antivol ?</description>
    </item>
    <item>
      <title>Bagues connect&#233;es : oubliez les designs lisses, voici pourquoi ce mod&#232;le Diesel sort du lot</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/bagues-connectees/2906177_bagues-connectees-oubliez-les-designs-lisses-voici-pourquoi-ce-modele-diesel-sort-du-lot</link>
      <pubDate>Thu, 11 Dec 2025 09:32:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/bagues-connectees/2906177_bagues-connectees-oubliez-les-designs-lisses-voici-pourquoi-ce-modele-diesel-sort-du-lot</guid>
      <description>
La marque indienne Ultrahuman a d&#233;voil&#233; une nouvelle &#233;dition de sa bague connect&#233;e Ultrahuman Ring Air. Con&#231;ue en partenariat avec la marque Diesel, elle propose un design qui sort clairement du lot. 
</description>
    </item>
    <item>
      <title>Quels sont les meilleurs vid&#233;oprojecteurs &#224; ultra courte focale en 2025 ? Notre s&#233;lection</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-tv/1272065_quels-sont-les-meilleurs-videoprojecteur-a-ultra-courte-focale</link>
      <pubDate>Thu, 11 Dec 2025 09:30:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-tv/1272065_quels-sont-les-meilleurs-videoprojecteur-a-ultra-courte-focale</guid>
      <description>
Envie d'une image de plusieurs m&#232;tres de large, mais pas envie de percer des trous dans le plafond pour installer un vid&#233;oprojecteur ? Nous avons choisi les meilleurs mod&#232;les de vid&#233;oprojecteurs &#224; courte, et ultra courte focale, que nous avons pu tester.
</description>
    </item>
    <item>
      <title>The best memes of 2025, from 6-7 to Gods country. See the list.</title>
      <link>https://mashable.com/article/best-memes-of-2025-list</link>
      <pubDate>Thu, 11 Dec 2025 09:27:57 +0000</pubDate>
      <guid isPermaLink="false">0251onwkStcVWoAuZeJ2osS</guid>
      <description>From 100 men vs. a gorilla, to jokes about the new pope, and so much more &#8212; we've had some good memes in 2025.</description>
    </item>
  </channel>
</rss>
