<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 14 Dec 2025 18:33:26 GMT</lastBuildDate>
    <item>
      <title>Cyberattaque contre l&#8217;iPhone&#160;: 2 failles Apple sont &#224; l&#8217;origine d&#8217;une &#171;&#160;attaque extr&#234;mement sophistiqu&#233;e&#160;&#187;</title>
      <link>https://www.01net.com/actualites/cyberattaque-iphone-2-failles-apple-origine-attaque-extremement-sophistiquee.html</link>
      <pubDate>Sun, 14 Dec 2025 18:14:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315279</guid>
      <description>Deux vuln&#233;rabilit&#233;s ont &#233;t&#233; d&#233;couvertes dans le code de l'iPhone et de plusieurs autres appareils Apple. Le duo de failles a permis &#224; des cybercriminels de d&#233;ployer une cyberattaque sophistiqu&#233;e contre des utilisateurs. Apple d&#233;ploie un correctif pour colmater les br&#232;ches.</description>
    </item>
    <item>
      <title>Pantone's color of 2026 is creamy Cloud Dancer &#8211; and here are 12 ways to bring it into your kitchen</title>
      <link>https://www.techradar.com/home/small-appliances/cloud-dancer-pantone-kitchen</link>
      <pubDate>Sun, 14 Dec 2025 18:00:00 +0000</pubDate>
      <guid isPermaLink="false">CT3XDQw4x7Yjx95MnDJZVE</guid>
      <description>This soft off-white shade will complement your existing style, whether it's classic or modern.</description>
    </item>
    <item>
      <title>Android 17 could finally introduce Motion Cues to combat motion sickness &#8211; matching the same feature in iOS</title>
      <link>https://www.techradar.com/phones/android/android-17-could-finally-introduce-motion-cues-to-combat-motion-sickness-matching-the-same-feature-in-ios</link>
      <pubDate>Sun, 14 Dec 2025 17:30:00 +0000</pubDate>
      <guid isPermaLink="false">xDkCXQskqMyJykVZWwUTBV</guid>
      <description>Android devices could work better for passengers if this anti-motion sickness feature finally sees the light of day.</description>
    </item>
    <item>
      <title>Making sense of the risky Netflix-Warner Bros. deal</title>
      <link>https://techcrunch.com/2025/12/14/making-sense-of-the-risky-netflix-warner-bros-deal/</link>
      <pubDate>Sun, 14 Dec 2025 17:27:05 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3075815</guid>
      <description>Netflix's $82.6 billion acquisition of Warner Bros. encapsulates a fraught moment for Hollywood, as the entertainment business is increasingly overshadowed by tech giants.</description>
    </item>
    <item>
      <title>The Two &#8216;It&#8217; Movies May Finally Get Their Extended Cut</title>
      <link>https://gizmodo.com/the-two-it-movies-may-finally-get-their-extended-cut-2000699293</link>
      <pubDate>Sun, 14 Dec 2025 17:25:43 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000699293</guid>
      <description>Andy Muschietti let longtime fans know he's still got a supercut of the 'It' duology on his mind that he wants to make happen.</description>
    </item>
    <item>
      <title>TechCrunch Mobility: Rivian&#8217;s survival plan involves more than cars</title>
      <link>https://techcrunch.com/2025/12/14/rivians-survival-plan-involves-more-than-cars/</link>
      <pubDate>Sun, 14 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3075731</guid>
      <description>Welcome back to TechCrunch Mobility &#8212; your central hub for news and insights on the future of transportation.</description>
    </item>
    <item>
      <title>OnePlus 15 vs Samsung Galaxy S25&#160;: comment choisir le meilleur smartphone haut de gamme&#160;?</title>
      <link>https://www.frandroid.com/versus/2906247_oneplus-15-vs-samsung-galaxy-s25-comment-choisir-le-meilleur-smartphone-haut-de-gamme</link>
      <pubDate>Sun, 14 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/versus/2906247_oneplus-15-vs-samsung-galaxy-s25-comment-choisir-le-meilleur-smartphone-haut-de-gamme</guid>
      <description>
Se tourner vers Samsung est une &#233;vidence, lorsqu'on cherche un smartphone Android. Mais d'autres marques ont &#233;galement des produits haut de gamme de tr&#232;s bon standing, comme le OnePlus 15 qui met tout le monde d'accord en cette fin d'ann&#233;e.
</description>
    </item>
    <item>
      <title>Voici les meilleurs &#233;couteurs ouverts de l&#8217;ann&#233;e &#8211; Frandroid Awards 2025</title>
      <link>https://www.frandroid.com/produits-android/audio/ecouteurs-true-wireless/2900209_voici-les-meilleurs-ecouteurs-ouverts-de-lannee-frandroid-awards-2025</link>
      <pubDate>Sun, 14 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/audio/ecouteurs-true-wireless/2900209_voici-les-meilleurs-ecouteurs-ouverts-de-lannee-frandroid-awards-2025</guid>
      <description>
Les meilleurs &#233;couteurs ouverts test&#233;s par Frandroid sont les Shokz OpenFit 2 Plus. D&#233;couvrez pourquoi ce produit a re&#231;u le Frandroid Awards avec Delos de sa cat&#233;gorie. 
</description>
    </item>
    <item>
      <title>Ayaneo's first smartphone is a major callback to the Xperia Play</title>
      <link>https://www.engadget.com/mobile/smartphones/ayaneos-first-smartphone-is-a-major-callback-to-the-xperia-play-165206332.html?src=rss</link>
      <pubDate>Sun, 14 Dec 2025 16:52:06 +0000</pubDate>
      <guid isPermaLink="false">37c20788-2f29-4c24-ab11-1c9ec3442072</guid>
      <description>Close enough, welcome back Xperia Play. After releasing a teaser video in early November, Ayaneo fully revealed its first smartphone called the Pocket Play. As suspected, the Ayaneo Pocket Play features a sliding mechanism that transforms it from a chunky smartphone into a gaming handheld.


In its gaming configuration, the Pocket Play features a controller setup with a D-pad, ABXY buttons and four shoulder buttons. However, Ayaneo has modernized the Xperia Play design by incorporating two touchpads, which will also be seen in the handheld maker's next flagship device called the Next II. Accor...</description>
    </item>
  </channel>
</rss>
