<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 24 Nov 2025 14:46:18 GMT</lastBuildDate>
    <item>
      <title>PSA: Microsoft 365 Family purchased from Amazon comes with a hidden flaw that could prove costly - here's what you need to know</title>
      <link>https://www.techradar.com/pro/psa-microsoft-365-family-purchased-from-amazon-comes-with-a-hidden-flaw-that-could-prove-costly-heres-what-you-need-to-know</link>
      <pubDate>Mon, 24 Nov 2025 14:39:07 +0000</pubDate>
      <guid isPermaLink="false">moGNr6W3nMHrVyAskFcbvY</guid>
      <description>Microsoft 365 Family subscription purchased from Amazon is massively discounted, but with a hidden downside you need to know.</description>
    </item>
    <item>
      <title>01net Awards&#160;: &#233;lisez vos meilleurs produits tech 2025</title>
      <link>https://www.01net.com/actualites/votes-01net-awards-2025-prix-lecteurs.html</link>
      <pubDate>Mon, 24 Nov 2025 14:38:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308976</guid>
      <description>C'est le moment de voter pour les produits qui vous ont marqu&#233; en 2025 !</description>
    </item>
    <item>
      <title>Les nouveaux Google Pixels Buds 2a profitent du Black Friday pour perdre 50 &#8364;, des &#233;couteurs intra avec une ANC au top</title>
      <link>https://www.frandroid.com/bons-plans/2883319_les-nouveaux-google-pixels-buds-2a-profitent-du-black-friday-pour-perdre-50-e-des-ecouteurs-intra-avec-une-anc-au-top</link>
      <pubDate>Mon, 24 Nov 2025 14:33:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2883319_les-nouveaux-google-pixels-buds-2a-profitent-du-black-friday-pour-perdre-50-e-des-ecouteurs-intra-avec-une-anc-au-top</guid>
      <description>
Les Google Pixel 2a sont des &#233;couteurs Bluetooth r&#233;cents qui passent d&#233;j&#224; de 149,99 euros &#224; 99,99 euros sur Fnac pendant la Black Friday Week.
</description>
    </item>
    <item>
      <title>The 23 best Black Friday streaming deals for Apple TV, Prime Video, Disney+, HBO Max and more</title>
      <link>https://www.techradar.com/live/news/best-black-friday-streaming-deals-2025</link>
      <pubDate>Mon, 24 Nov 2025 14:32:07 +0000</pubDate>
      <guid isPermaLink="false">pbK9xiavELaCZBPkPXsSah</guid>
      <description>Steering clear of 2025&#8217;s streaming price hikes just got easier with these 21 early Black Friday deals from Apple TV, Prime Video, Disney+, HBO Max and more.</description>
    </item>
    <item>
      <title>Quelles sont les meilleures tablettes tactiles &#224; acheter en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guide-tablettes/320702_guide-dachat-tablette-choisir-noel</link>
      <pubDate>Mon, 24 Nov 2025 14:30:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-tablettes/320702_guide-dachat-tablette-choisir-noel</guid>
      <description>
La bonne vieille tablette tactile trouve toujours sa place dans nos foyers. Pour savoir laquelle choisir, de la petite tablette pas ch&#232;re aux iPad Pro les plus puissants, vous &#234;tes au bon endroit. Voici notre s&#233;lection des meilleures tablettes du march&#233;. 
</description>
    </item>
    <item>
      <title>Windows 11&#160;: Microsoft pr&#233;pare d&#8217;importantes nouveaut&#233;s pour l&#8217;Explorateur de fichiers</title>
      <link>https://www.01net.com/actualites/windows-11-microsoft-prepare-dimportantes-nouveautes-pour-lexplorateur-de-fichiers.html</link>
      <pubDate>Mon, 24 Nov 2025 14:21:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310742</guid>
      <description>Dans une r&#233;cente build Windows 11 publi&#233;e aupr&#232;s des membres de son programme Insider, Microsoft introduit teste plusieurs nouveaut&#233;s visant &#224; am&#233;liorer les performances de l&#8217;Explorateur de fichiers.</description>
    </item>
    <item>
      <title>US banks scramble to assess data theft after hackers breach financial tech firm</title>
      <link>https://techcrunch.com/2025/11/24/us-banks-scramble-to-assess-data-theft-after-hackers-breach-financial-tech-firm/</link>
      <pubDate>Mon, 24 Nov 2025 14:18:55 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3070240</guid>
      <description>U.S. banking giants including JPMorgan Chase, Citi, and Morgan Stanley are working to identify what data was stolen in a recent cyberattack on a New York financial firm.</description>
    </item>
    <item>
      <title>Xiaomi n&#8217;h&#233;site pas &#224; baisser le prix de ses produits, m&#234;me les plus r&#233;cents, lors de la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2858733_xiaomi-casse-encore-plus-les-prix-de-ses-produits-meme-recents-lors-de-la-black-friday-week</link>
      <pubDate>Mon, 24 Nov 2025 14:12:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2858733_xiaomi-casse-encore-plus-les-prix-de-ses-produits-meme-recents-lors-de-la-black-friday-week</guid>
      <description>
Alors que le Black Friday du 28 novembre approche, Xiaomi se pr&#233;pare avec une avalanche d&#8217;offres exceptionnelles sur ses produits phares. Smartphones, tablettes et bracelets connect&#233;s sont propos&#233;s &#224; prix r&#233;duit pour l&#8217;occasion. Voici une s&#233;lection des meilleures promos Tech &#224; ne pas manquer.
</description>
    </item>
    <item>
      <title>Thanksgiving travel 2025: Want to avoid traffic? Here are the best and worst times to hit the roads this week</title>
      <link>https://www.fastcompany.com/91448027/thanksgiving-travel-2025-best-and-worst-driving-times-this-week</link>
      <pubDate>2025-11-24T14:10:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448027/thanksgiving-travel-2025-best-and-worst-driving-times-this-week</guid>
      <description>With more than 73 million Americans expected to travel by car for the holidays, AAA and INRIX have released new data to help you avoid congestion.
The Thanksgiving holiday is nearly upon us, which means tens of millions of Americans will be traveling nationwide this week to visit their loved ones and celebrate around the dinner table with them on Thursday.&#160;...</description>
    </item>
    <item>
      <title>J&#8217;ai roul&#233; avec une moto &#233;lectrique Harley-Davidson en plein centre ville avec 30 motards : une exp&#233;rience hors du commun</title>
      <link>https://www.frandroid.com/survoltes/moto/2882537_jai-roule-avec-une-moto-electrique-harley-davidson-en-plein-centre-ville-avec-30-motards-une-experience-hors-du-commun</link>
      <pubDate>Mon, 24 Nov 2025 14:10:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/moto/2882537_jai-roule-avec-une-moto-electrique-harley-davidson-en-plein-centre-ville-avec-30-motards-une-experience-hors-du-commun</guid>
      <description>
Nous avons eu la chance de rouler dans Milan avec trente motos &#233;lectrique dont des Livewire (Harley-Davidson), lors de la Silent Ride. Une exp&#233;rience bluffante, clairement.
</description>
    </item>
    <item>
      <title>Cette marque am&#233;ricaine de v&#233;los est enfin vendue apr&#232;s deux ans de montagnes russes</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2882885_cette-marque-americaine-de-velos-est-enfin-vendue-apres-deux-ans-de-montagnes-russes</link>
      <pubDate>Mon, 24 Nov 2025 14:09:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2882885_cette-marque-americaine-de-velos-est-enfin-vendue-apres-deux-ans-de-montagnes-russes</guid>
      <description>
Apr&#232;s avoir rachet&#233; Felt en 2021, Pierer Mobility, d&#233;sormais propri&#233;t&#233; de Bajaj, se s&#233;pare d&#233;finitivement de la marque Felt Bicycles.
</description>
    </item>
    <item>
      <title>OnePlus pr&#233;pare l&#8217;arriv&#233;e d&#8217;une nouvelle montre connect&#233;e ultrafine &#224; prix abordable</title>
      <link>https://www.frandroid.com/marques/oneplus/2883433_oneplus-prepare-larrivee-dune-nouvelle-montre-connectee-ultrafine-a-prix-abordable</link>
      <pubDate>Mon, 24 Nov 2025 14:06:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/oneplus/2883433_oneplus-prepare-larrivee-dune-nouvelle-montre-connectee-ultrafine-a-prix-abordable</guid>
      <description>
OnePlus a d&#233;voil&#233; le design de sa nouvelle montre connect&#233;e ultrafine, la OnePlus Watch Lite, dont la sortie est pr&#233;vue pour le 17 d&#233;cembre prochain. 
</description>
    </item>
    <item>
      <title>Malaysia may ban users under 16 from social media starting next year</title>
      <link>https://techcrunch.com/2025/11/24/malaysia-may-ban-users-under-16-from-social-media-starting-next-year/</link>
      <pubDate>Mon, 24 Nov 2025 14:03:32 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3070209</guid>
      <description>The country's communications minister Fahmi Fadzil said the administration is considering systems for implementing age restrictions on social media sites.</description>
    </item>
    <item>
      <title>This high-end standing desk made my home office a place I love - and it's on sale this Black Friday</title>
      <link>https://www.techradar.com/pro/this-high-end-standing-desk-made-my-home-office-a-place-i-love-and-its-on-sale-this-black-friday</link>
      <pubDate>Mon, 24 Nov 2025 14:03:00 +0000</pubDate>
      <guid isPermaLink="false">bpJZ6Abt4ZUEzKhUVLsXdR</guid>
      <description>If you want an office standing desk that stands out this Black Friday, look no further.</description>
    </item>
    <item>
      <title>Google Assistant vit ses derniers moments dans Android</title>
      <link>https://www.01net.com/actualites/google-assistant-vit-ses-derniers-moments-dans-android.html</link>
      <pubDate>Mon, 24 Nov 2025 14:01:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310729</guid>
      <description>Gemini est en passe de remplacer ce bon vieux Google Assistant partout dans Android. Un mouvement in&#233;luctable qui va faire disparaitre du paysage toute r&#233;f&#233;rence &#224; l'ancien assistant dans les r&#233;glages du syst&#232;mes d'exploitation.</description>
    </item>
    <item>
      <title>Momentic raises $15M to automate software testing</title>
      <link>https://techcrunch.com/2025/11/24/momentic-raises-15m-to-automate-software-testing/</link>
      <pubDate>Mon, 24 Nov 2025 14:00:27 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3070202</guid>
      <description>AI testing startup Momentic has raised $15 million in a Series A round led by Standard Capital, with participation from Dropbox Ventures. Existing investors at Y Combinator, FCVC, Transpose Platform and Karman Ventures also participated.</description>
    </item>
    <item>
      <title>One Final &#8216;Stranger Things&#8217; Season 5 Trailer Brings the Beginning of the End</title>
      <link>https://gizmodo.com/stranger-things-season-5-part-1-trailer-streaming-2000690655</link>
      <pubDate>Mon, 24 Nov 2025 14:00:24 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000690655</guid>
      <description>The last battle for Hawkins begins this week, and Netflix isn't done teasing.</description>
    </item>
    <item>
      <title>The 10 Best Home Arcade Machines (2025), Tested and Reviewed</title>
      <link>https://www.wired.com/gallery/best-home-arcade-machines/</link>
      <pubDate>Mon, 24 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">68230948bbb03bd4a74ad7fb</guid>
      <description>Rewind to the classic games of the &#8217;70s and &#8217;80s with a WIRED-tested home arcade machine.</description>
    </item>
    <item>
      <title>Amazon Is Using Specialized AI Agents for Deep Bug Hunting</title>
      <link>https://www.wired.com/story/amazon-autonomous-threat-analysis/</link>
      <pubDate>Mon, 24 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">6920a1c0acfbaf841c45b04e</guid>
      <description>Born out of an internal hackathon, Amazon&#8217;s Autonomous Threat Analysis system uses a variety of specialized AI agents to detect weaknesses and propose fixes to the company&#8217;s platforms.</description>
    </item>
    <item>
      <title>This startup wants to build a fusion reactor &#8212;&#160;on a boat</title>
      <link>https://techcrunch.com/2025/11/24/this-startup-wants-to-build-a-fusion-reactor-on-a-boat/</link>
      <pubDate>Mon, 24 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3070057</guid>
      <description>Startups are still racing to build the world's first commercial fusion power plant on land, but Maritime Fusion thinks the path will be easier out at sea.</description>
    </item>
    <item>
      <title>What is the release date for The Mighty Nein episode 4 on Prime Video?</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/what-is-the-release-date-for-the-mighty-nein-episode-4-on-prime-video</link>
      <pubDate>Mon, 24 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">9BZZrPxJF6yAoYFTBzaYLU</guid>
      <description>The Mighty Nein's next installment lands on Prime Video this week &#8211; here's when you can stream it.</description>
    </item>
    <item>
      <title>Kodak reveals affordable 35mm film camera that's a glorious blast from the past</title>
      <link>https://www.techradar.com/cameras/kodaks-affordable-35mm-film-camera-looks-like-a-black-or-white-blast-from-the-past</link>
      <pubDate>Mon, 24 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">ifPPoofZoR6tktFBP2eWhC</guid>
      <description>Kodak has announced the Snapic A1, a 35mm analog film camera available in two colors and costing just $99.</description>
    </item>
    <item>
      <title>Value City and American Signature Furniture are closing stores in bankruptcy: See list of locations</title>
      <link>https://www.fastcompany.com/91448023/value-city-american-signature-furniture-closing-stores-full-list-locations</link>
      <pubDate>2025-11-24T13:49:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448023/value-city-american-signature-furniture-closing-stores-full-list-locations</guid>
      <description>Retailers that sell home furnishings have been struggling with lower sales in the wake of a housing market downturn. Here&#8217;s what to know.
Another home furnishings retail chain has sought Chapter 11 bankruptcy protection as it deals with higher costs, reduced sales, a downturn in the housing market, and President Trump&#8217;s tariffs. </description>
    </item>
    <item>
      <title>Mauvaise nouvelle pour les abonn&#233;s Orange&#160;: r&#233;silier votre Livebox co&#251;te d&#233;sormais plus cher</title>
      <link>https://www.01net.com/actualites/mauvaise-nouvelle-pour-les-abonnes-orange-resilier-votre-livebox-coute-desormais-plus-cher.html</link>
      <pubDate>Mon, 24 Nov 2025 13:46:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310704</guid>
      <description>Orange a discr&#232;tement revu &#224; la hausse ses frais de r&#233;siliation pour les offres Livebox. La note passe de 50 &#224; 60 euros, ce qui complique la migration vers certains concurrents.</description>
    </item>
    <item>
      <title>La Nintendo Switch 2 et la PS5 sont les vedettes du Black Friday ! Notre s&#233;lection des meilleurs offres sur les consoles et le gaming</title>
      <link>https://www.frandroid.com/bons-plans/2853043_black-friday-week-switch-2-voici-les-meilleures-promo-sur-les-consoles-jeux-manettes-et-accessoires-nintendo-playstation-et-xbox</link>
      <pubDate>Mon, 24 Nov 2025 13:44:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2853043_black-friday-week-switch-2-voici-les-meilleures-promo-sur-les-consoles-jeux-manettes-et-accessoires-nintendo-playstation-et-xbox</guid>
      <description>
L'ann&#233;e 2025 a &#233;t&#233; particuli&#232;rement riche du c&#244;t&#233; des jeux vid&#233;o. La Black Friday Week sur l'univers consoles et jeux vid&#233;o ne pouvait donc &#234;tre que passionnante. La toute r&#233;cente Nintendo Switch 2 est bien s&#251;r la grande vedette cette ann&#233;e, mais la PS5 n'a pas non plus dit son dernier mot...
</description>
    </item>
    <item>
      <title>Revolut hits $75B valuation in new capital raise</title>
      <link>https://techcrunch.com/2025/11/24/revolut-hits-75b-valuation-in-new-capital-raise/</link>
      <pubDate>Mon, 24 Nov 2025 13:31:31 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3070196</guid>
      <description>The deal was led by Coatue, Greenoaks, Dragoneer and Fidelity. Investors including Nvidia's NVentures, Andreessen Horowitz, Franklin Templeton, and other backers advised by T. Rowe Price Associates also participated.</description>
    </item>
    <item>
      <title>Markets worldwide are mixed as traders place hopes on a rate cut by the Fed</title>
      <link>https://www.fastcompany.com/91448037/markets-worldwide-mixed-traders-place-hopes-rate-cut-fed</link>
      <pubDate>2025-11-24T13:28:23</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448037/markets-worldwide-mixed-traders-place-hopes-rate-cut-fed</guid>
      <description>Germany&#8217;s DAX gained 0.5% to 23,201.85, while Britain&#8217;s FTSE 100 rose 0.1% to 9,547.77.
World shares and U.S. futures were mixed on Monday after Wall Street was buoyed by revived hopes for an interest rate cut by the Federal Reserve.The future for the S&amp;P 500 was up 0.2% while that for the Dow Jones Industrial Average was nearly unchanged.Germany&#8217;s DAX gained 0.5% to 23,201.85, while the CAC 40 edged less than 0.1% lower to 7,978.77. Britain&#8217;s FTSE 100 inched up 0.1% to 9,547.77.Markets in Japan were closed for a holiday.Hong Kong&#8217;s benchmark, the Hang Seng, rose 2% to 25,716.50. It got a boos...</description>
    </item>
    <item>
      <title>I test coffee makers for a living, and these are the only 3 espresso machine deals you should consider this Black Friday</title>
      <link>https://www.techradar.com/home/coffee-machines/i-test-coffee-makers-for-a-living-and-these-are-the-only-espresso-machine-deals-you-should-consider-this-black-friday</link>
      <pubDate>Mon, 24 Nov 2025 13:26:34 +0000</pubDate>
      <guid isPermaLink="false">jX8SFVFS8iQoH2cbQETTnL</guid>
      <description>These are the only deals I'd recommend to my family and friends &#8211; and to you.</description>
    </item>
    <item>
      <title>HUAWEI brade ses meilleurs produits pour le Black Friday&#8239;: smartphone pliant, montres connect&#233;es et &#233;couteurs en promo [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2880129_huawei-brade-ses-meilleurs-produits-pour-le-black-friday-smartphone-pliant-montres-connectees-et-ecouteurs-en-promo</link>
      <pubDate>Mon, 24 Nov 2025 13:24:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2880129_huawei-brade-ses-meilleurs-produits-pour-le-black-friday-smartphone-pliant-montres-connectees-et-ecouteurs-en-promo</guid>
      <description>
HUAWEI lance une s&#233;lection d&#8217;offres sur ses produits les plus aboutis pour le Black Friday : le smartphone pliant Mate X6, la montre connect&#233;e Watch GT 5 Pro et les &#233;couteurs FreeClip.
</description>
    </item>
    <item>
      <title>Le prix de ce TV LG OLED atypique de 55&#8243; s&#8217;affiche enfin &#224; un prix bien plus attractif lors de la Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2442316_le-prix-de-ce-tv-lg-oled-atypique-de-55-saffiche-enfin-a-un-prix-bien-plus-attractif-lors-de-la-black-friday-week</link>
      <pubDate>Mon, 24 Nov 2025 13:23:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2442316_le-prix-de-ce-tv-lg-oled-atypique-de-55-saffiche-enfin-a-un-prix-bien-plus-attractif-lors-de-la-black-friday-week</guid>
      <description>
Un t&#233;l&#233;viseur performant avec du style, voil&#224; ce que propose le  LG 55LX1Q. Son mod&#232;le en 55 pouces devient enfin plus attractif en tombant &#224; 759 euros, contre 1 099 euros &#224; son lancement.
</description>
    </item>
    <item>
      <title>Fed up with data snoopers? Surfshark takes IP spoofing to new heights with new Multi IP feature</title>
      <link>https://www.techradar.com/vpn/vpn-services/fed-up-with-data-snoopers-surfshark-takes-ip-spoofing-to-new-heights-with-new-multi-ip-feature</link>
      <pubDate>Mon, 24 Nov 2025 13:22:50 +0000</pubDate>
      <guid isPermaLink="false">NM6Co4sMKXKBFuq3Emcftm</guid>
      <description>Surfshark has launched its new Multi IP feature, which allows users to assign different IP addresses to each website opened during a session.</description>
    </item>
    <item>
      <title>Panic over &#8211; Google says your Gmails aren&#8217;t being used train its Gemini AI and explains what &#8216;Smart Features&#8217; do instead</title>
      <link>https://www.techradar.com/ai-platforms-assistants/gemini/panic-over-google-says-your-gmails-arent-being-used-train-its-gemini-ai-and-explains-what-smart-features-do-instead</link>
      <pubDate>Mon, 24 Nov 2025 13:08:23 +0000</pubDate>
      <guid isPermaLink="false">6rveZ9FGEHTDCZXAa5UqZ6</guid>
      <description>Despite a recent report, Google says your emails aren&#8217;t being used to train its Gemini AI model &#8211;here's what's happening instead.</description>
    </item>
    <item>
      <title>Save 75% on Hallmark+ via Prime Video this Black Friday &#8211; start with this unhinged TV show I loved, and you will too</title>
      <link>https://www.techradar.com/streaming/entertainment/hallmark-prime-video-black-friday-deal-the-way-home</link>
      <pubDate>Mon, 24 Nov 2025 13:06:22 +0000</pubDate>
      <guid isPermaLink="false">rSgfYPda9ri5t5GynfRKoD</guid>
      <description>Think you've seen a time travel TV show? Wait until you watch The Way Home on Hallmark+ &#8211; which is 75% off through Prime Video for Black Friday.</description>
    </item>
    <item>
      <title>Forget Sony, Fujifilm, and Nikon &#8211; this brand makes the best affordable lenses, and they're 20% off for Black Friday</title>
      <link>https://www.techradar.com/cameras/camera-lenses/forget-sony-fujifilm-and-nikon-this-brand-makes-the-best-affordable-lenses-and-theyre-20-percent-off-for-black-friday</link>
      <pubDate>Mon, 24 Nov 2025 13:05:37 +0000</pubDate>
      <guid isPermaLink="false">ioLwLtwKwTTwCMvsdCuqVY</guid>
      <description>Affordable Chinese lens maker Viltrox has slashed 20% off its entire range for Black Friday.</description>
    </item>
    <item>
      <title>Google tells employees they need to double their work every 6 months to keep up with AI</title>
      <link>https://www.techradar.com/pro/google-tells-employees-they-need-to-double-their-work-every-6-months-to-keep-up-with-ai</link>
      <pubDate>Mon, 24 Nov 2025 13:03:00 +0000</pubDate>
      <guid isPermaLink="false">fqzd5HqVo8JXFD9M44Dy6F</guid>
      <description>Google wants to double AI capacity every six months, but it wants to keep a lid on cost and power consumption.</description>
    </item>
    <item>
      <title>&#171;&#160;41 % moins cher que le thermique&#160;&#187; : la voiture &#233;lectrique met KO l&#8217;essence et le diesel avec la recharge rapide</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2882907_41-moins-cher-que-le-thermique-la-voiture-electrique-met-ko-lessence-et-le-diesel-avec-la-recharge-rapide</link>
      <pubDate>Mon, 24 Nov 2025 13:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2882907_41-moins-cher-que-le-thermique-la-voiture-electrique-met-ko-lessence-et-le-diesel-avec-la-recharge-rapide</guid>
      <description>
Alors que Bruxelles envisage d&#8217;assouplir l&#8217;interdiction des voitures thermiques en 2035, tout le monde n&#8217;est pas d&#8217;accord. Et notamment Electra, une entreprise sp&#233;cialis&#233;e dans les bornes de charge pour les voitures &#233;lectriques.
</description>
    </item>
    <item>
      <title>Hugh Jackman Isn&#8217;t Saying No to More Wolverine Returns</title>
      <link>https://gizmodo.com/hugh-jackman-wolverine-return-marvel-2000690467</link>
      <pubDate>Mon, 24 Nov 2025 13:00:46 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000690467</guid>
      <description>Plus, Brendan Fraser says he's waited 20 years to make 'The Mummy 4'.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs TV de 2025&#8201;? Notre s&#233;lection</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-tv/508152_quelle-television-4k-choisir-la-selection-de-la-redaction</link>
      <pubDate>Mon, 24 Nov 2025 13:00:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-tv/508152_quelle-television-4k-choisir-la-selection-de-la-redaction</guid>
      <description>
Vous cherchez le meilleur t&#233;l&#233;viseur pour vos besoins ? Bienvenue sur notre s&#233;lection meilleurs TV du march&#233;, incluant des mod&#232;les de technologie OLED, QLED, LCD et m&#234;me QD-OLED.
</description>
    </item>
    <item>
      <title>OnePlus 15R will get a late launch next month</title>
      <link>https://www.theverge.com/news/827430/oneplus-15r-will-get-a-late-launch-next-month</link>
      <pubDate>2025-11-24T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=827430</guid>
      <description>This month&#8217;s OnePlus 15 arrived to much fanfare about its enormous battery life, but no sign of the cheaper 15R that was expected alongside it. Now we finally know that phone will be revealed on December 17th, alongside the OnePlus Pad Go 2 and Watch Lite. Both the phone and tablet will release in the [&#8230;]</description>
    </item>
    <item>
      <title>OnePlus just dropped its own Apple Watch SE rival with the affordable Watch Lite</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/oneplus-just-dropped-its-own-apple-watch-se-rival-with-the-affordable-watch-lite</link>
      <pubDate>Mon, 24 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">RztQNs7Cc8FkX29cq5xCBJ</guid>
      <description>OnePlus has launched the Watch Lite smartwatch as it attempts to compete with the Apple Watch SE.</description>
    </item>
    <item>
      <title>OnePlus 15R launch date confirmed &#8211; and it's arriving alongside two other devices</title>
      <link>https://www.techradar.com/phones/oneplus-phones/the-oneplus-15r-release-date-has-been-confirmed</link>
      <pubDate>Mon, 24 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">XvhYU4MrW9Ry9TZ54vmLkG</guid>
      <description>The OnePlus 15R, OnePlus Pad Go 2, and OnePlus Watch Lite are all launching soon, and we now know the colors and pre-order perks.</description>
    </item>
    <item>
      <title>Chargeurs propri&#233;taires : l&#8217;Europe signe enfin leur arr&#234;t de mort pour les remplacer par de l&#8217;USB-C</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/2883281_chargeurs-proprietaires-leurope-signe-enfin-leur-arret-de-mort-pour-les-remplacer-par-de-lusb-c</link>
      <pubDate>Mon, 24 Nov 2025 12:56:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/2883281_chargeurs-proprietaires-leurope-signe-enfin-leur-arret-de-mort-pour-les-remplacer-par-de-lusb-c</guid>
      <description>
Vous pensiez qu'avec l'arriv&#233;e de l'USB-C sur l'iPhone 15, l'Europe allait se reposer sur ses lauriers ? C'est mal conna&#238;tre la Commission europ&#233;enne. Apr&#232;s avoir tordu le bras aux fabricants de smartphones, Bruxelles s'attaque maintenant &#224; la source du probl&#232;me : le bloc d'alimentation lui-m&#234;me.
</description>
    </item>
    <item>
      <title>Cyberattaque contre Colis Priv&#233; : des pirates fran&#231;ais ont vol&#233; 15 millions de donn&#233;es</title>
      <link>https://www.01net.com/actualites/cyberattaque-contre-colis-prive-donnees-clients-compromises.html</link>
      <pubDate>Mon, 24 Nov 2025 12:52:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310274</guid>
      <description>Une cyberattaque vient de frapper Colis Priv&#233;. Le transporteur, qui livre 90 millions de colis par an, a confirm&#233; le vol de donn&#233;es de contact de ses clients. Ces informations suffisent &#224; lancer des vagues d'arnaques, dont des escroqueries au colis.</description>
    </item>
  </channel>
</rss>
