<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 20 Jan 2026 11:27:54 GMT</lastBuildDate>
    <item>
      <title>C&#8217;est le grand d&#233;stockage c&#244;t&#233; TV 4K et vid&#233;oprojecteurs lors des soldes : les 18 offres &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2933417_cest-le-grand-destockage-cote-tv-4k-et-videoprojecteurs-lors-des-soldes-les-18-offres-a-saisir</link>
      <pubDate>Tue, 20 Jan 2026 11:23:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933417_cest-le-grand-destockage-cote-tv-4k-et-videoprojecteurs-lors-des-soldes-les-18-offres-a-saisir</guid>
      <description>
&#192; la veille de la troisi&#232;me d&#233;marque des soldes d&#8217;hiver, les offres sur les t&#233;l&#233;viseurs 4K se multiplient chez les e-commer&#231;ants. Certains mod&#232;les haut de gamme voient m&#234;me leur prix fortement chuter. Pour vous aider &#224; faire le bon choix avant la prochaine vague de promotions, voici notre s&#233;lection des meilleures affaires du moment sur les TV 4K et les vid&#233;oprojecteurs.
...</description>
    </item>
    <item>
      <title>La manette Nacon Revolution 5 Pro pour jouer fa&#231;on Xbox sur PS5 est sold&#233;e &#224; moiti&#233; prix</title>
      <link>https://www.frandroid.com/bons-plans/2473222_la-manette-nacon-revolution-5-pro-pour-jouer-facon-xbox-sur-ps5-est-soldee-a-moitie-prix</link>
      <pubDate>Tue, 20 Jan 2026 11:22:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2473222_la-manette-nacon-revolution-5-pro-pour-jouer-facon-xbox-sur-ps5-est-soldee-a-moitie-prix</guid>
      <description>
La Nacon Revolution 5 Pro est une manette premium certifi&#233;e par Sony qui offre de grandes possibilit&#233;s de personnalisation et une ergonomie pris&#233;e par les gamers pro, que vous retrouvez &#224; 110,39 euros au lieu de 230,99 euros pendant les soldes.
</description>
    </item>
    <item>
      <title>Spotify is testing a feature that syncs audiobooks with paper editions</title>
      <link>https://www.theverge.com/news/864296/spotify-page-match-audiobook-testing-feature</link>
      <pubDate>2026-01-20T06:20:49-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864296</guid>
      <description>Spotify appears to be working on a novel feature that will allow audiobook listeners to pick up where they left off in the physical book. Android Authority reports that version 9.1.18.282 of the Spotify app includes code references to a Page Match beta feature that can quickly sync audiobooks on the platform with their paper [&#8230;]</description>
    </item>
    <item>
      <title>Key Apple, Nvidia, and Tesla supplier sees confidential files allegedly exposed in major breach - here's what we know so far</title>
      <link>https://www.techradar.com/pro/security/key-apple-nvidia-and-tesla-supplier-sees-confidential-files-allegedly-exposed-in-major-breach-heres-what-we-know-so-far</link>
      <pubDate>Tue, 20 Jan 2026 11:20:27 +0000</pubDate>
      <guid isPermaLink="false">S7GLzZbjQoKN4tfTSQmfNE</guid>
      <description>One of the key suppliers for Apple, Tesla, and Nvidia has seemingly suffered a ransomware attack.</description>
    </item>
    <item>
      <title>Chrome n&#8217;arr&#234;te pas de planter&#160;? Une extension malveillante est peut-&#234;tre en train de vous pirater</title>
      <link>https://www.01net.com/actualites/chrome-arrete-pas-planter-extension-malveillante-peut-etre-train-pirater.html</link>
      <pubDate>Tue, 20 Jan 2026 11:04:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321179</guid>
      <description>Si votre navigateur Chrome n'arr&#234;te pas de planter, il est possible qu'une extension malveillante soit parvenue &#224; s'immiscer sur celui-ci. En ce moment, une fausse extension cens&#233;e bloquer les publicit&#233;s se propage sur Internet. Une fois install&#233;e, elle va tout faire pour faire crasher Chrome. C'est la premi&#232;re &#233;tape d'une cyberattaque qui aboutit &#224; l'installation d'un redoutable virus....</description>
    </item>
    <item>
      <title>China&#8217;s Renewable Energy Revolution Is a Huge Mess That Might Save the World</title>
      <link>https://www.wired.com/story/china-renewable-energy-revolution/</link>
      <pubDate>Tue, 20 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">695d92bf6fc6e2d6635bf9b0</guid>
      <description>A global onslaught of cheap Chinese green power is upending everything in its path. No one is ready for its repercussions.</description>
    </item>
    <item>
      <title>China&#8217;s AI Boyfriend Business Is Taking On a Life of Its Own</title>
      <link>https://www.wired.com/story/china-ai-boyfriends/</link>
      <pubDate>Tue, 20 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">695d905a622a5fef5397a0ad</guid>
      <description>Gen Z women in China are all in on digital companionship&#8212;even setting up dates with real-world versions of their AI boyfriends.</description>
    </item>
    <item>
      <title>You&#8217;ve Never Heard of China&#8217;s Greatest Sci-Fi Novel</title>
      <link>https://www.wired.com/story/china-sci-fi-morning-star-lingao/</link>
      <pubDate>Tue, 20 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">692dd707f6f72d479485558f</guid>
      <description>Millions of words. Thousands of authors. The Morning Star of Lingao is barely known outside China&#8212;but it contains the secret to the country&#8217;s modernization and malaise.</description>
    </item>
    <item>
      <title>Your First Humanoid Robot Coworker Will Probably Be Chinese</title>
      <link>https://www.wired.com/story/china-humanoid-robot-coworkers/</link>
      <pubDate>Tue, 20 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">6969308f0c83d3fa3f25aafb</guid>
      <description>Explosive acceleration, limited dexterity, eyes in the back of its head. What could possibly go wrong?</description>
    </item>
    <item>
      <title>Thousands of Companies Are Driving China&#8217;s AI Boom. A Government Registry Tracks Them All</title>
      <link>https://www.wired.com/story/china-ai-boom-algorithm-registry/</link>
      <pubDate>Tue, 20 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">692dd2c954bc86901c669564</guid>
      <description>How the Cyberspace Administration of China inadvertently made a guide to the country&#8217;s homegrown AI revolution.</description>
    </item>
    <item>
      <title>23 Ways You&#8217;re Already Living in the Chinese Century</title>
      <link>https://www.wired.com/china-issue/</link>
      <pubDate>Tue, 20 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">696a017638843637c9c278f2</guid>
      <description>The robotics explosion. The energy revolution. The cultural takeover. It&#8217;s everything you wanted for the United States&#8212;but done better in China.</description>
    </item>
    <item>
      <title>How China&#8217;s &#8216;Crystal Capital&#8217; Cornered the Market on a Western Obsession</title>
      <link>https://www.wired.com/story/china-crystal-capital/</link>
      <pubDate>Tue, 20 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">695d8f13c8fcfa0242b8cd64</guid>
      <description>Decades ago, Donghai was a backwater county. Today, thanks to an army of 24/7 livestreamers, it orchestrates a multibillion-dollar global industry.</description>
    </item>
    <item>
      <title>He Went to Prison for Gene-Editing Babies. Now He&#8217;s Planning to Do It Again</title>
      <link>https://www.wired.com/story/china-he-jiankui-gene-editing-alzheimers/</link>
      <pubDate>Tue, 20 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">695d8fc39f9e2bc3b2c02550</guid>
      <description>Chinese scientist He Jiankui wants to end Alzheimer&#8217;s and thinks Silicon Valley is conducting a &#8220;Nazi eugenic experiment.&#8221;</description>
    </item>
    <item>
      <title>Chinese EV Batteries Are Eating the World</title>
      <link>https://www.wired.com/story/chinese-ev-batteries/</link>
      <pubDate>Tue, 20 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">69694f6365a76ca2adea03e4</guid>
      <description>China&#8217;s lithium batteries aren&#8217;t always &#8220;made in China.&#8221; Companies like BYD and CATL are building factories on nearly every continent.</description>
    </item>
    <item>
      <title>She Was Given Up by Her Chinese Parents&#8212;and Spent 14 Years Trying to Find a Way Back</title>
      <link>https://www.wired.com/story/china-adoption-birth-parents/</link>
      <pubDate>Tue, 20 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">691bc2e1ac0ba064a93a24c9</guid>
      <description>More and more Chinese adoptees in the US are trying to reunite with their birth parents. For Youxue, it took more than a decade, and a remarkable coincidence.</description>
    </item>
    <item>
      <title>Meta&#8217;s Oversight Board takes up permanent bans in landmark case</title>
      <link>https://techcrunch.com/2026/01/20/metas-oversight-board-is-taking-on-its-first-case-focused-the-companys-ability-to-disable-accounts/</link>
      <pubDate>Tue, 20 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3083706</guid>
      <description>For the first time, Meta's Oversight Board is looking for specific policy recommendations around disabled accounts.</description>
    </item>
    <item>
      <title>David is winning the protein brand wars by saying nothing at all</title>
      <link>https://www.fastcompany.com/91475255/david-is-winning-the-protein-brand-wars-by-saying-nothing-at-all</link>
      <pubDate>2026-01-20T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91475255/david-is-winning-the-protein-brand-wars-by-saying-nothing-at-all</guid>
      <description>One company is using minimalism to stand out in the &#8216;protein bubble.&#8217;
Protein is everywhere these days. The cultural obsession with the macronutrient has become unavoidable; from constant protein-adjacent Instagram ads to protein-focused recipes and protein-filled Chipotle bowls, Starbucks drinks, and Pepsi products. All of these products are starting to sound like part of some big, loud, fitness influencer chorus. But there&#8217;s one brand that&#8217;s managed to break through the noise&#8212;often, by saying nothing at all.&#160;...</description>
    </item>
    <item>
      <title>Cartes graphiques : c&#8217;est fini, le prix des GPU Nvidia et AMD va tr&#232;s bient&#244;t flamber</title>
      <link>https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2948753_cartes-graphiques-cest-fini-le-prix-des-gpu-nvidia-et-amd-va-tres-bientot-flamber</link>
      <pubDate>Tue, 20 Jan 2026 10:58:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2948753_cartes-graphiques-cest-fini-le-prix-des-gpu-nvidia-et-amd-va-tres-bientot-flamber</guid>
      <description>
L'&#233;p&#233;e de Damocl&#232;s tarifaire va s'abattre d&#233;finitivement sur le march&#233; des cartes graphiques alors que les deux constructeurs s'appr&#234;tent &#224; augmenter s&#233;rieusement le prix de leurs GPU.
</description>
    </item>
    <item>
      <title>C&#8217;&#233;tait &#171; vraiment incroyable &#187; : des aurores d&#8217;une intensit&#233; jamais vue depuis des d&#233;cennies ont embras&#233; la nuit en France</title>
      <link>https://www.futura-sciences.com/sciences/actualites/aurore-boreale-cetait-vraiment-incroyable-aurores-intensite-jamais-vue-depuis-decennies-ont-embrase-nuit-france-130348/#xtor%3DRSS-8</link>
      <pubDate>Tue, 20 Jan 2026 11:47:09 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/aurore-boreale-cetait-vraiment-incroyable-aurores-intensite-jamais-vue-depuis-decennies-ont-embrase-nuit-france-130348/#xtor%3DRSS-8</guid>
      <description>Les mod&#232;les des chercheurs n&#8217;osaient pas y croire. Ce sont pourtant bien des aurores bor&#233;ales d&#8217;une intensit&#233; rare qui ont illumin&#233; le ciel d&#8217;Europe cette nuit. Le spectacle d&#8217;une vie&#8230;</description>
    </item>
    <item>
      <title>Meilleurs aspirateurs-robots laveurs en d&#233;cembre 2026 : la s&#233;lection</title>
      <link>https://www.frandroid.com/guide-dachat/2037272_quels-sont-les-meilleurs-aspirateurs-robots-laveur-notre-selection</link>
      <pubDate>Tue, 20 Jan 2026 10:45:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2037272_quels-sont-les-meilleurs-aspirateurs-robots-laveur-notre-selection</guid>
      <description>
De plus en plus d'aspirateurs robots proposent une fonction de nettoyage humide pour s'occuper &#224; fond des sols. Certes, il s'agit souvent de mod&#232;les plus chers, mais aussi plus performants et polyvalents. Apr&#232;s tests, voici notre s&#233;lection des meilleurs aspirateurs robots laveurs.
</description>
    </item>
    <item>
      <title>Envie d&#8217;un nouveau smartphone ? Voici les 16 meilleurs deals Apple, Samsung, Google et Xiaomi des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2931029_envie-dun-nouveau-smartphone-voici-les-16-meilleurs-deals-apple-samsung-google-et-xiaomi-des-soldes</link>
      <pubDate>Tue, 20 Jan 2026 10:44:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931029_envie-dun-nouveau-smartphone-voici-les-16-meilleurs-deals-apple-samsung-google-et-xiaomi-des-soldes</guid>
      <description>
La troisi&#232;me d&#233;marque des soldes d&#8217;hiver d&#233;bute d&#232;s demain, et les offres se multiplient d&#233;j&#224; sur les smartphones, notamment sur d&#8217;anciens flagships comme le Galaxy Z Flip 6 ou le Pixel Fold 9 Pro. Certaines r&#233;ductions atteignent m&#234;me jusqu&#8217;&#224; -50%, de quoi d&#233;nicher de tr&#232;s belles affaires avant la prochaine vague de promotions&#8239;!
</description>
    </item>
    <item>
      <title>Comparatif : les meilleurs casques audio pas chers (&#224; moins de 100 &#8364;)</title>
      <link>https://www.frandroid.com/guide-dachat/guide-audio/688056_meilleurs-casques-audio-filaires-bluetooth-moins-de-100-euros</link>
      <pubDate>Tue, 20 Jan 2026 10:43:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-audio/688056_meilleurs-casques-audio-filaires-bluetooth-moins-de-100-euros</guid>
      <description>
Si la plupart des casques audio sans-fil sont assez co&#251;teux, il existe tout de m&#234;me de bons produits &#224; moins de 100 euros. Voici notre s&#233;lection des meilleurs casques pas chers en 2026.
</description>
    </item>
    <item>
      <title>Bungie announces new Marathon release date alongside preorder details, a full voice cast, and a new gameplay trailer</title>
      <link>https://www.techradar.com/gaming/bungie-announces-new-marathon-release-date-alongside-preorder-details-a-full-voice-cast-and-a-new-gameplay-trailer</link>
      <pubDate>Tue, 20 Jan 2026 10:42:30 +0000</pubDate>
      <guid isPermaLink="false">yyQCSUxDyQ6edK46hzj3mG</guid>
      <description>Bungie has finally announced a firm release date for its first-person, sci-fi extraction shooter, Marathon, alongside preorder details and a brand new gameplay trailer.</description>
    </item>
    <item>
      <title>Pourquoi cette nouvelle berline &#233;lectrique chinoise dit adieu &#224; ses poign&#233;es de portes popularis&#233;es par Tesla</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2948477_pourquoi-cette-nouvelle-berline-electrique-chinoise-dit-adieu-a-ses-poignees-de-portes-popularisees-par-tesla</link>
      <pubDate>Tue, 20 Jan 2026 10:40:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2948477_pourquoi-cette-nouvelle-berline-electrique-chinoise-dit-adieu-a-ses-poignees-de-portes-popularisees-par-tesla</guid>
      <description>
D&#233;voil&#233;e en 2023, l&#8217;Avatr 12 s&#8217;offre un petit coup de jeune en ce d&#233;but d&#8217;ann&#233;e 2026. La voiture &#233;lectrique chinoise dit notamment adieu &#224; ses poign&#233;es affleurantes, pour une raison bien pr&#233;cise.
</description>
    </item>
    <item>
      <title>Microsoft&#8217;s free Xbox Cloud Gaming is coming soon with ads</title>
      <link>https://www.theverge.com/news/864261/xbox-cloud-gaming-free-ads-testing</link>
      <pubDate>2026-01-20T05:38:34-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864261</guid>
      <description>Microsoft has been testing its ad-supported Xbox Cloud Gaming service over the past few months, as I exclusively revealed in October. Now, the software giant is getting close to testing the free streaming option with Xbox Insiders. Over the weekend, Microsoft updated its Xbox app with loading screens for Xbox Cloud Gaming that mention "1 [&#8230;]</description>
    </item>
    <item>
      <title>Pourquoi choisir le nouveau mod&#232;le quand le Xiaomi Redmi Note 14 Pro 5G est &#224; moins de 100 &#8364; ?</title>
      <link>https://www.frandroid.com/bons-plans/2948447_pourquoi-choisir-le-nouveau-modele-quand-le-xiaomi-redmi-note-14-pro-5g-est-a-moins-de-100-e</link>
      <pubDate>Tue, 20 Jan 2026 10:35:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2948447_pourquoi-choisir-le-nouveau-modele-quand-le-xiaomi-redmi-note-14-pro-5g-est-a-moins-de-100-e</guid>
      <description>
Le Xiaomi Redmi Note 14 Pro 5G a beau avoir &#233;t&#233; tout juste remplac&#233;, ce dernier reste un milieu de gamme tr&#232;s convaincant, surtout maintenant qu'il peut revenir &#224; seulement 99 euros gr&#226;ce &#224; cette offre. 
</description>
    </item>
    <item>
      <title>Une semaine sans charger son smartphone&#160;? Realme va lancer un mod&#232;le dot&#233; d&#8217;une batterie de 10&#160;001 mAh</title>
      <link>https://www.01net.com/actualites/une-semaine-sans-charger-son-smartphone-realme-va-lancer-un-modele-dote-dune-batterie-de-10-001-mah.html</link>
      <pubDate>Tue, 20 Jan 2026 10:32:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321154</guid>
      <description>Le standard de l'autonomie mobile s'appr&#234;te &#224; voler en &#233;clats. Realme lance la production du P4 Power, un smartphone grand public &#233;quip&#233; d'une batterie de 10 001 mAh, promettant de tenir une semaine enti&#232;re loin d'une prise.</description>
    </item>
    <item>
      <title>'When it needs to pivot, it turns the wheels and does a crab walk' &#8211; Segway Navimow exec reveals the invention that means its new flagship lawnbot won't churn up your grass</title>
      <link>https://www.techradar.com/home/robot-vacuums/when-it-needs-to-pivot-it-turns-the-wheels-and-does-a-crab-walk-segway-navimow-exec-reveals-the-invention-that-means-its-new-flagship-lawnbot-wont-churn-up-your-grass</link>
      <pubDate>Tue, 20 Jan 2026 10:30:34 +0000</pubDate>
      <guid isPermaLink="false">z5MkXgADhuEH6UeQcnJBb9</guid>
      <description>Exclusive: 'It's a showcase of the best technology we have.'</description>
    </item>
    <item>
      <title>Cryptocurrencies Are Dying in Record Numbers, Report Says</title>
      <link>https://gizmodo.com/cryptocurrencies-are-dying-in-record-numbers-report-says-2000711765</link>
      <pubDate>Tue, 20 Jan 2026 10:30:20 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711765</guid>
      <description>2025 was a mass die-off event for memecoins.</description>
    </item>
    <item>
      <title>Batteries Anker Solix et EDF (Tempo) : voici la mise &#224; jour qu&#8217;on attendait tous avec une grosse r&#233;serve</title>
      <link>https://www.frandroid.com/produits-android/hardware/batterie/2948745_batteries-anker-solix-et-edf-tempo-voici-la-mise-a-jour-quon-attendait-tous-avec-une-grosse-reserve</link>
      <pubDate>Tue, 20 Jan 2026 10:28:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/batterie/2948745_batteries-anker-solix-et-edf-tempo-voici-la-mise-a-jour-quon-attendait-tous-avec-une-grosse-reserve</guid>
      <description>
ous avez une batterie Anker sur votre balcon ? Elle vient probablement de devenir beaucoup plus rentable. La marque d&#233;ploie sa mise &#224; jour 3.15.0 qui connecte enfin votre mat&#233;riel aux tarifs de 830 fournisseurs, dont EDF. L'id&#233;e est simple : l'IA charge quand c'est pas cher, et injecte quand les prix montent.
</description>
    </item>
    <item>
      <title>Autonomie, chauffage et co&#251;ts : voici le vrai bilan des voitures &#233;lectriques sous -40&#176;C</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2948389_autonomie-chauffage-et-couts-voici-le-vrai-bilan-des-voitures-electriques-sous-40c</link>
      <pubDate>Tue, 20 Jan 2026 10:22:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2948389_autonomie-chauffage-et-couts-voici-le-vrai-bilan-des-voitures-electriques-sous-40c</guid>
      <description>
Si les voitures &#233;lectriques sont impact&#233;es par les temp&#233;ratures tr&#232;s basses, elles restent moins co&#251;teuses que les voitures diesel &#224; l'usage. C&#8217;est ce que prouve une nouvelle fois cette &#233;tude, men&#233;e en Alaska par -40&#176;C.
</description>
    </item>
    <item>
      <title>Sony&amp;#8217;s TV business is being taken over by TCL</title>
      <link>https://www.theverge.com/news/864263/sony-tcl-tv-business-partnership-takeover-announcement</link>
      <pubDate>2026-01-20T05:21:49-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864263</guid>
      <description>Sony has announced plans to spin off its TV hardware business, shifting it to a new joint venture with TCL. The two companies have signed a nonbinding agreement for Sony's home entertainment business, with TCL set to hold a 51 percent stake in the new venture and Sony holding 49 percent. With this partnership, TCL [&#8230;]</description>
    </item>
    <item>
      <title>L&#8217;app Google change compl&#232;tement l&#8217;interface de sa recherche vocale&#160;: voici &#224; quoi elle ressemble</title>
      <link>https://www.01net.com/actualites/application-google-change-interface-recherche-vocale.html</link>
      <pubDate>Tue, 20 Jan 2026 10:14:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321160</guid>
      <description>L'application Google met enfin un coup de peinture &#224; sa recherche vocale sur Android avec une interface bien plus moderne et &#233;pur&#233;e.</description>
    </item>
    <item>
      <title>Redmi Buds&#160;: 2 failles de s&#233;curit&#233; Bluetooth mettent en danger les utilisateurs</title>
      <link>https://www.01net.com/actualites/redmi-buds-2-failles-securite-bluetooth-mettent-danger-utilisateurs1321143.html</link>
      <pubDate>Tue, 20 Jan 2026 10:01:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321143</guid>
      <description>Deux failles de s&#233;curit&#233; ont &#233;t&#233; d&#233;couvertes dans les Redmi Buds. Les vuln&#233;rabilit&#233;s permettent d'exfiltrer des donn&#233;es confidentielles, comme des num&#233;ros de t&#233;l&#233;phone, et de faire planter les &#233;couteurs sans fil &#224; distance. Les failles peuvent &#234;tre exploit&#233;es par n'importe quel attaquant qui se situe &#224; proximit&#233;.</description>
    </item>
    <item>
      <title>The best wireless chargers for 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-wireless-charger-140036359.html?src=rss</link>
      <pubDate>Tue, 20 Jan 2026 10:01:26 +0000</pubDate>
      <guid isPermaLink="false">1fe3d1e8-55e1-40d5-a463-1336dd916f19</guid>
      <description>If you&#8217;ve upgraded your phone recently, there&#8217;s a good chance it supports wireless charging. Battery life can be one of the first things to deteriorate as your phone ages, so you&#8217;ll need quick and easy ways to power up wherever you are. You may not always be able to have a cable on your person, but investing in a wireless phone charger (or a few) can make it more convenient to plop your phone down and know it&#8217;ll have more juice when you pick it back up again.While you&#8217;re not going to get the same charging speed with a wireless charger that you would with a power cable, the convenience of a pow...</description>
    </item>
    <item>
      <title>NYSE&#8217;s Tokenized Stocks Create More Questions for Crypto&#8217;s Relevance</title>
      <link>https://gizmodo.com/nyses-tokenized-stocks-create-more-questions-for-cryptos-relevance-2000711752</link>
      <pubDate>Tue, 20 Jan 2026 10:00:29 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711752</guid>
      <description>Given that Bitcoin was created to circumvent traditional finance, what are we even doing here?</description>
    </item>
    <item>
      <title>Intel admits consumers don&#8217;t care about &#8217;AI PCs&#8217;&#8212;yet</title>
      <link>https://www.fastcompany.com/91476135/intel-ai-pc</link>
      <pubDate>2026-01-20T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91476135/intel-ai-pc</guid>
      <description>Turns out most folks just want better battery life and faster graphics. Who knew?
Remember a couple of years ago when Intel declared that the &#8220;age of the AI PC&#8221; had arrived?</description>
    </item>
    <item>
      <title>300 % de d&#233;bit d&#8217;air en plus : comment ce petit embout veut rendre le gonflage d&#8217;un pneu v&#233;lo bien plus rapide</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2948545_300-de-debit-dair-en-plus-comment-ce-petit-embout-veut-rendre-le-gonflage-dun-pneu-velo-bien-plus-rapide</link>
      <pubDate>Tue, 20 Jan 2026 09:57:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2948545_300-de-debit-dair-en-plus-comment-ce-petit-embout-veut-rendre-le-gonflage-dun-pneu-velo-bien-plus-rapide</guid>
      <description>
Le march&#233; des valves de pneus v&#233;lo continue d&#8217;&#233;voluer. Dernier exemple en date : un dispositif d&#233;velopp&#233; par BBB Cycling qui vise &#224; am&#233;liorer la valve Presta sans en modifier le format.
</description>
    </item>
    <item>
      <title>Even with the release of the Canon EOS R6 Mark III, I still think the Canon EOS C50 is a superb buy for videographers &#8211; here's why</title>
      <link>https://www.techradar.com/cameras/video-cameras/even-with-the-release-of-the-canon-eos-r6-mark-iii-i-still-think-the-canon-eos-c50-is-a-superb-buy-for-videographers-heres-why</link>
      <pubDate>Tue, 20 Jan 2026 09:54:29 +0000</pubDate>
      <guid isPermaLink="false">pdGHSTEqAnGgyryodms8WE</guid>
      <description>The Canon EOS R6 Mark III might have the edge in price, but don't overlook the EOS C50 if you're a serious videographer.</description>
    </item>
    <item>
      <title>Pr&#233;parez-vous &#224; raquer : Samsung confirme la forte hausse de prix pour ses PC portables</title>
      <link>https://www.frandroid.com/marques/samsung/2948391_preparez-vous-a-raquer-samsung-confirme-la-forte-hausse-de-prix-pour-ses-pc-portables</link>
      <pubDate>Tue, 20 Jan 2026 09:54:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2948391_preparez-vous-a-raquer-samsung-confirme-la-forte-hausse-de-prix-pour-ses-pc-portables</guid>
      <description>
D&#233;voil&#233;s au CES, les nouveaux Galaxy Book 6 Pro et Ultra de Samsung voient cette semaine leurs tarifs &#234;tre d&#233;taill&#233;s en Cor&#233;e. Comme on pouvait s'y attendre, le prix de ces mod&#232;les augmente nettement par rapport &#224; celui de leurs pr&#233;d&#233;cesseurs. 
</description>
    </item>
    <item>
      <title>Samsung Galaxy Z Fold 6 : cet excellent smartphone pliable revient &#224; moiti&#233; prix pour les soldes d&#8217;hiver 2026</title>
      <link>https://www.frandroid.com/bons-plans/2817739_samsung-galaxy-z-fold-6-cet-excellent-smartphone-pliable-revient-a-moitie-prix-pour-les-soldes-dhiver-2026</link>
      <pubDate>Tue, 20 Jan 2026 09:48:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2817739_samsung-galaxy-z-fold-6-cet-excellent-smartphone-pliable-revient-a-moitie-prix-pour-les-soldes-dhiver-2026</guid>
      <description>
Le Samsung Galaxy Z Fold 6 se plie au jeu des promotions lors des soldes d'hiver sur Boulanger et passe de 1 999 euros &#224; sa sortie &#224; 999 euros.
</description>
    </item>
    <item>
      <title>Quel est le meilleur moment pour acheter un nouvel iPhone ?</title>
      <link>https://www.frandroid.com/guide-dachat/2062062_quand-acheter-un-iphone-nos-conseils-pour-choisir-le-meilleur-moment</link>
      <pubDate>Tue, 20 Jan 2026 09:45:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2062062_quand-acheter-un-iphone-nos-conseils-pour-choisir-le-meilleur-moment</guid>
      <description>
La question du timing pour l'achat d'un iPhone est primordiale. Vous souhaitez acqu&#233;rir un iPhone ou une autre d&#233;clinaison de la gamme ? L'&#233;quipe Guide d'achat vous le d&#233;conseille &#224; cette p&#233;riode pr&#233;cise de l'ann&#233;e, et on vous explique pourquoi.
</description>
    </item>
    <item>
      <title>&#171; Mauvaise gestion &#187; et licenciements : c&#8217;est la faillite pour ce partenaire prometteur de Stellantis</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2948361_mauvaise-gestion-et-licenciements-cest-la-faillite-pour-ce-partenaire-prometteur-de-stellantis</link>
      <pubDate>Tue, 20 Jan 2026 09:45:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2948361_mauvaise-gestion-et-licenciements-cest-la-faillite-pour-ce-partenaire-prometteur-de-stellantis</guid>
      <description>
Apr&#232;s avoir lanc&#233; son syst&#232;me d'&#233;change de batteries pour les voitures &#233;lectriques aux &#201;tats-Unis et en Espagne en partenariat avec Stellantis, la soci&#233;t&#233; Ample est officiellement en faillite apr&#232;s seulement six mois d&#8217;activit&#233;.
</description>
    </item>
  </channel>
</rss>
