<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 18 Feb 2026 14:51:02 GMT</lastBuildDate>
    <item>
      <title>Real-Life Pok&#233;mon Pinball Is the Most Visceral Way to Catch &#8216;Em All</title>
      <link>https://gizmodo.com/real-life-pokemon-pinball-is-the-most-visceral-way-to-catch-em-all-2000723147</link>
      <pubDate>Wed, 18 Feb 2026 14:45:03 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000723147</guid>
      <description>You'll have to pay a hefty chunk of change for Stern Pinball's version of the classic Game Boy game.</description>
    </item>
    <item>
      <title>Qarabag vs Newcastle Free Streams: How to watch Champions League 2025/26 1st leg from anywhere in the world</title>
      <link>https://www.techradar.com/how-to-watch/football/qarabag-vs-newcastle-champions-league-2025-26-1st-leg-free</link>
      <pubDate>Wed, 18 Feb 2026 14:45:00 +0000</pubDate>
      <guid isPermaLink="false">sMCnQGv9HkJt3f3b3wLWQe</guid>
      <description>All the ways to watch Qarabag vs Newcastle live streams from anywhere and for free, as the minnows look to upset the Magpies in this Champions League 1st leg match.</description>
    </item>
    <item>
      <title>Microsoft says Office bug exposed customers&#8217; confidential emails to Copilot AI</title>
      <link>https://techcrunch.com/2026/02/18/microsoft-says-office-bug-exposed-customers-confidential-emails-to-copilot-ai/</link>
      <pubDate>Wed, 18 Feb 2026 14:44:28 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3093970</guid>
      <description>Microsoft said the bug meant that its Copilot AI chatbot was reading and summarizing paying customers' confidential emails, bypassing data protection policies.</description>
    </item>
    <item>
      <title>Resident Evil Requiem sort tr&#232;s bient&#244;t et voici o&#249; le pr&#233;commander au plus bas prix sur PS5</title>
      <link>https://www.frandroid.com/bons-plans/2981673_resident-evil-requiem-sort-tres-bientot-et-voici-ou-le-precommander-au-plus-bas-prix-sur-ps5</link>
      <pubDate>Wed, 18 Feb 2026 14:42:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2981673_resident-evil-requiem-sort-tres-bientot-et-voici-ou-le-precommander-au-plus-bas-prix-sur-ps5</guid>
      <description>
Resident Evil Requiem est le 9e opus canonique de la c&#233;l&#232;bre franchise horrifique de Capcom. Disponible sur toutes les plateformes &#224; partir du 27 f&#233;vrier 2026, vous pouvez le pr&#233;commander d&#232;s aujourd'hui pour 53,72 euros au lieu de 79,99 euros.
</description>
    </item>
    <item>
      <title>Polestar unveils a station wagon version of the 4</title>
      <link>https://www.engadget.com/transportation/evs/polestar-unveils-a-station-wagon-version-of-the-4-144025505.html?src=rss</link>
      <pubDate>Wed, 18 Feb 2026 14:40:25 +0000</pubDate>
      <guid isPermaLink="false">b30c6d43-2393-4345-83ac-682f43464047</guid>
      <description>Polestar is gearing up to launch three new models in the next two years, including a station wagon (estate or shooting brake) version of the Polestar 4 that harkens back to the company's Volvo roots. The Geely-owned Swedish company sold a record 61,000 EVs in 2025, but hopes that the new models will help it take an even bigger bite out of the market. "We want to get more volume out of a bigger cake," CEO Michael Lohscheller said.&#160;
Polestar currently offers two models in the US, the Polestar 3 and Polestar 4, both SUVs. However, the new Polestar 4 will come in two variants, one a traditional SU...</description>
    </item>
    <item>
      <title>Nothing Phone (4a) : une mauvaise nouvelle &#224; en croire cette fuite</title>
      <link>https://www.frandroid.com/marques/nothing/2981775_nothing-phone-4a-une-mauvaise-nouvelle-a-en-croire-cette-fuite</link>
      <pubDate>Wed, 18 Feb 2026 14:33:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nothing/2981775_nothing-phone-4a-une-mauvaise-nouvelle-a-en-croire-cette-fuite</guid>
      <description>
Nothing pr&#233;sentera tr&#232;s prochainement son Nothing Phone (4a). Malheureusement, la facture serait plus sal&#233;e cette ann&#233;e.
</description>
    </item>
    <item>
      <title>OpenAI pushes into higher education as India seeks to scale AI skills</title>
      <link>https://techcrunch.com/2026/02/18/openai-pushes-into-higher-education-as-india-seeks-to-scale-ai-skills/</link>
      <pubDate>Wed, 18 Feb 2026 14:32:42 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3093899</guid>
      <description>OpenAI says its India education partnerships aim to reach more than 100,000 students, faculty and staff over the next year.</description>
    </item>
    <item>
      <title>'A spectacularly bad idea' &#8212; Digital rights advocates call on Wisconsin lawmakers to reject VPN ban bill</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/a-spectacularly-bad-idea-digital-rights-advocates-call-on-wisconsin-lawmakers-to-reject-vpn-ban-bill</link>
      <pubDate>Wed, 18 Feb 2026 14:29:47 +0000</pubDate>
      <guid isPermaLink="false">hdup6Fz5bqqXC6GUJU8gtB</guid>
      <description>Wisconsin's controversial age verification proposal is expected to be discussed today (February 18). The Electronic Frontier Foundation warns that provisions to block VPN users are "unworkable."</description>
    </item>
    <item>
      <title>Les secrets de la Chine pour produire ses voitures 40 % moins cher qu&#8217;en Europe r&#233;v&#233;l&#233; par ce rapport officiel</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2981555_les-secrets-de-la-chine-pour-produire-ses-voitures-40-moins-cher-quen-europe-revele-par-ce-rapport-officiel</link>
      <pubDate>Wed, 18 Feb 2026 14:26:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2981555_les-secrets-de-la-chine-pour-produire-ses-voitures-40-moins-cher-quen-europe-revele-par-ce-rapport-officiel</guid>
      <description>
C&#8217;est un document qui a l&#8217;effet d&#8217;une douche froide pour l'Europe. Un rapport officiel fran&#231;ais met des chiffres pr&#233;cis sur ce que tout le monde pressentait : la Chine produit ses voitures &#233;lectriques &#224; des co&#251;ts qui d&#233;fient toute concurrence occidentale. Et on sait d&#233;sormais comment cela est possible, et ce qu'il faut faire pour s'en prot&#233;ger.
</description>
    </item>
    <item>
      <title>Les Nothing Phone (4a) et (4a) Pro seraient un peu mieux &#233;quip&#233;s, mais ils co&#251;teraient aussi beaucoup plus cher</title>
      <link>https://www.01net.com/actualites/les-nothing-phone-4a-et-4a-pro-seraient-un-peu-mieux-equipes-mais-ils-couteraient-aussi-beaucoup-plus-cher.html</link>
      <pubDate>Wed, 18 Feb 2026 14:17:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326701</guid>
      <description>Chose promise, chose due (h&#233;las) : les futurs smartphones de Nothing subiront bien une hausse de leurs prix, d'apr&#232;s un fuiteur tr&#232;s fiable. Pas de surprise ici puisque Carl Pei, le patron du constructeur, avait pr&#233;par&#233; les esprits d&#233;but janvier.</description>
    </item>
    <item>
      <title>A simple hack gave the owner of a brand-new DJI Romo access to a global army of robovacs</title>
      <link>https://www.techradar.com/home/robot-vacuums/a-simple-hack-gave-the-owner-of-a-brand-new-dji-romo-access-to-a-global-army-of-robovacs</link>
      <pubDate>Wed, 18 Feb 2026 14:16:31 +0000</pubDate>
      <guid isPermaLink="false">NKsazjm4mqf7YdUYDt2k94</guid>
      <description>Robovac user gets a lot more than he bargained for after connecting his PS5 controller to a DJI Romo.</description>
    </item>
    <item>
      <title>Votre montre Garmin va s&#8217;am&#233;liorer : cette mise &#224; jour majeure d&#233;ploie de nouvelles fonctionnalit&#233;s tr&#232;s attendues</title>
      <link>https://www.frandroid.com/marques/garmin/2981325_votre-montre-garmin-va-sameliorer-cette-mise-a-jour-majeure-deploie-de-nouvelles-fonctionnalites-tres-attendues</link>
      <pubDate>Wed, 18 Feb 2026 14:12:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/garmin/2981325_votre-montre-garmin-va-sameliorer-cette-mise-a-jour-majeure-deploie-de-nouvelles-fonctionnalites-tres-attendues</guid>
      <description>
Garmin a lanc&#233; le d&#233;ploiement d'une mise &#224; jour cons&#233;quente pour ses montres haut de gamme Fenix 8, Fenix 8 Pro, Enduro 3 et Fenix E, avec de nouvelles fonctions li&#233;es au poids, &#224; la batterie ou &#224; l'heure de coucher. 
</description>
    </item>
    <item>
      <title>iOS 26.4 will bring these 5 upgrades to your iPhone, but there&#8217;s still no sign of the new Siri</title>
      <link>https://www.techradar.com/phones/ios/ios-26-4-will-bring-these-5-upgrades-to-your-iphone-but-theres-still-no-sign-of-the-new-siri</link>
      <pubDate>Wed, 18 Feb 2026 14:08:34 +0000</pubDate>
      <guid isPermaLink="false">s89Hr3Eh4yJqVV23AMR6e8</guid>
      <description>The iOS 26.4 beta has plenty of new features, but the new Apple Intelligence-powered Siri isn&#8217;t one of them.</description>
    </item>
    <item>
      <title>A worrying Dell zero-day flaw has reportedly gone unpatched for nearly two years - and Chinese hackers are taking advantage</title>
      <link>https://www.techradar.com/pro/security/a-dell-zero-day-flaw-has-reportedly-gone-unpatched-for-nearly-two-years-and-chinese-hackers-are-taking-advantage</link>
      <pubDate>Wed, 18 Feb 2026 14:05:00 +0000</pubDate>
      <guid isPermaLink="false">UPsFZ5xukW4CU4HKgxRMEC</guid>
      <description>Login credentials were left hardcoded in a tool, which went undetected for more than a year.</description>
    </item>
    <item>
      <title>NordVPN deal: Get two years of the Complete plan for 70 percent off</title>
      <link>https://www.engadget.com/deals/nordvpn-deal-get-two-years-of-the-complete-plan-for-70-percent-off-123000517.html?src=rss</link>
      <pubDate>Wed, 18 Feb 2026 14:05:00 +0000</pubDate>
      <guid isPermaLink="false">7a83093a-241d-4ab0-89f9-72538e1530fc</guid>
      <description>NordVPN is offering a significant discount on its two-year plans, with 70 percent off its Complete tier and up to 74 percent off overall. For the Complete tier, the deal brings the total cost down to $130 for 24 months.
NordVPN regularly appears on Engadget&#8217;s list of the best VPN services thanks to its wide server network, strong security tools and consistent performance across devices. NordVPN&#8217;s latest promotion puts one of its most comprehensive plans at a price that undercuts many competing premium VPN subscriptions.


The Complete tier includes full access to NordVPN&#8217;s core VPN service, wh...</description>
    </item>
    <item>
      <title>Chris Hemsworth Has High Hopes for Thor&#8217;s MCU Future</title>
      <link>https://gizmodo.com/chris-hemsworth-thor-marvel-future-avengers-doomsday-2000722991</link>
      <pubDate>Wed, 18 Feb 2026 14:00:29 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000722991</guid>
      <description>Plus, Keith David promises his presidential 'Rick and Morty' spinoff is still coming this year.</description>
    </item>
    <item>
      <title>Canva gets to $4B in revenue as LLM referral traffic rises</title>
      <link>https://techcrunch.com/2026/02/18/canva-gets-to-4b-in-revenue-as-llm-referral-traffic-rises/</link>
      <pubDate>Wed, 18 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3090294</guid>
      <description>The creative company's monthly active users increased 20%, growth that was partially propelled by adoption of its AI tools.</description>
    </item>
    <item>
      <title>World Labs lands $200M from Autodesk to bring world models into 3D workflows</title>
      <link>https://techcrunch.com/2026/02/18/world-labs-lands-200m-from-autodesk-to-bring-world-models-into-3d-workflows/</link>
      <pubDate>Wed, 18 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3093950</guid>
      <description>The partnership will see the two companies exploring how World Labs&#8217; models can work alongside Autodesk&#8217;s tools, and vice versa, starting with a focus on entertainment use cases.</description>
    </item>
    <item>
      <title>I tested GHD's pricey new hair dryer against Dyson's Supersonic &#8211; and for ultra-fast drying, there was one clear winner</title>
      <link>https://www.techradar.com/home/hair-care/ghd-speed-vs-dyson-supersonic-nural-dryer</link>
      <pubDate>Wed, 18 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">awepEe6Qxp3q8zFyrx5hWW</guid>
      <description>If you want to splash out on a premium hair dryer, Dyson and GHD are both well worth considering. Here's how their top models compare.</description>
    </item>
    <item>
      <title>How to Make a Killing review: Glen Powell stars in A24s eat-the-rich comedy</title>
      <link>https://mashable.com/article/how-to-make-a-killing-review</link>
      <pubDate>Wed, 18 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">01Hw7zjhc93yNeSOzNj03pz</guid>
      <description>Margaret Qualley, Jessica Henwick, and Ed Harris co-star in John Patton Ford's follow-up to "Emily the Criminal," "How to Make a Killing" with Glen Powell. Review.</description>
    </item>
    <item>
      <title>Bo&#238;te de r&#233;ception | TikTok l&#8217;addictif, l&#8217;itin&#233;rance s&#233;curis&#233;e et l&#8217;IA pour vos finances</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-02-18/boite-de-reception/tiktok-l-addictif-l-itinerance-securisee-et-l-ia-pour-vos-finances.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 18 Feb 2026 09:00:00 -0500</pubDate>
      <guid isPermaLink="false">acea2d3bbdfe3696974d69a6b4d4ca9e</guid>
      <description>Chaque mercredi, notre journaliste r&#233;pond &#224; vos questions en lien avec le num&#233;rique et les nouvelles technologies. Cette semaine, on se penche sur la d&#233;pendance cr&#233;&#233;e par TikTok, on compare WiFi et cellulaire en itin&#233;rance, et on se demande si l&#8217;IA est un bon conseiller financier.</description>
    </item>
    <item>
      <title>Can't wait for the God of War Trilogy remake? Me neither &#8212; here are the best books, games, and merch to help tide you over</title>
      <link>https://www.techradar.com/gaming/cant-wait-for-the-god-of-war-trilogy-remake-me-neither-here-are-the-best-books-games-and-merch-to-help-tide-you-over</link>
      <pubDate>Wed, 18 Feb 2026 13:58:55 +0000</pubDate>
      <guid isPermaLink="false">KfAGtAEDUrCf5eEMAyE3ZT</guid>
      <description>If the God of War Trilogy remake announcement has got you thirsty for more from the series, then these God of War games, books, and bits of merch will hit the spot.</description>
    </item>
    <item>
      <title>LG Gram 17 Ultra 7 : -250 &#8364; sur ce laptop poids plume avec un &#233;cran g&#233;ant de 17 pouces</title>
      <link>https://www.frandroid.com/bons-plans/2981079_lg-gram-17-ultra-7-250-e-sur-ce-laptop-poids-plume-avec-un-ecran-geant-de-17-pouces</link>
      <pubDate>Wed, 18 Feb 2026 13:50:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2981079_lg-gram-17-ultra-7-250-e-sur-ce-laptop-poids-plume-avec-un-ecran-geant-de-17-pouces</guid>
      <description>
Un laptop fin et l&#233;ger, sans pour autant sacrifier les performances, voil&#224; ce que propose LG avec son laptop Gram 17Z90S. Il embarque un processeur Intel Core Ultra 7 solide et efficace pour les t&#226;ches du quotidien et se trouve en ce moment en promotion &#224; 1 099 euros contre 1 399 euros de base. 
</description>
    </item>
    <item>
      <title>&#171; Nous sommes trop proches du but pour renoncer &#187; : face &#224; la crise, ACC brise le silence et avoue les probl&#232;mes de production</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2981051_nous-sommes-trop-proches-du-but-pour-renoncer-face-a-la-crise-acc-brise-le-silence-et-avoue-les-problemes-de-production</link>
      <pubDate>Wed, 18 Feb 2026 13:49:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2981051_nous-sommes-trop-proches-du-but-pour-renoncer-face-a-la-crise-acc-brise-le-silence-et-avoue-les-problemes-de-production</guid>
      <description>
Alors qu&#8217;il traverse une p&#233;riode particuli&#232;rement difficile, le g&#233;ant tricolore des batteries ACC s&#8217;exprime sur le sujet. Et il rappelle l&#8217;importance d&#8217;une production europ&#233;enne pour les voitures &#233;lectriques.
</description>
    </item>
    <item>
      <title>Grab 8 Pokemon TCG: Phantasmal Flames booster packs at a new low price on Amazon &#8212; save $20</title>
      <link>https://mashable.com/article/feb-18-pokemon-tcg-phantasmal-flames-booster-pack-lot-deal</link>
      <pubDate>Wed, 18 Feb 2026 13:47:22 +0000</pubDate>
      <guid isPermaLink="false">01gF9spNLXZmXveDUJVO8RD</guid>
      <description>Eight-pack Pok&#233;mon TCG: Phantasmal Flames boosters fall to $69.98 at Amazon, just $8.74 per pack after a 22% discount.</description>
    </item>
    <item>
      <title>Fiverr stock price is collapsing today as the freelancer platform tries to put a positive spin on AI disruption</title>
      <link>https://www.fastcompany.com/91494489/fiverr-stock-price-is-collapsing-today-as-the-freelancer-platform-tries-to-put-a-positive-spin-on-ai-disruption</link>
      <pubDate>2026-02-18T13:41:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91494489/fiverr-stock-price-is-collapsing-today-as-the-freelancer-platform-tries-to-put-a-positive-spin-on-ai-disruption</guid>
      <description>CEO Micha Kaufman argues that the company is in a unique position to capitalize on AI transformation. Investors seem to disagree.  
Shares of Fiverr International Ltd. (NYSE: FVRR) are dropping significantly this morning after the freelance marketplace platform reported its Q4 2025 financial results. </description>
    </item>
    <item>
      <title>Get $80 off Sonos Ace headphones at Amazon &#8212; act fast to score this limited-time discount</title>
      <link>https://mashable.com/article/feb-18-sonos-ace-headphones-deal-1</link>
      <pubDate>Wed, 18 Feb 2026 13:38:39 +0000</pubDate>
      <guid isPermaLink="false">062Tm6ZFqMRNS9pvw1uJfRP</guid>
      <description>As of Feb. 18, the black Sonos Ace headphones have dropped to $319 at Amazon, 20% off their list price of $399.</description>
    </item>
    <item>
      <title>No, the Final Fantasy 9 Remake hasn't been officially announced &#8212; but don't give up hope just yet</title>
      <link>https://www.techradar.com/gaming/no-the-final-fantasy-9-remake-hasnt-been-officially-announced-but-dont-give-up-hope-just-yet</link>
      <pubDate>Wed, 18 Feb 2026 13:32:52 +0000</pubDate>
      <guid isPermaLink="false">UyxBBhgCi9kxEF75GnC8q6</guid>
      <description>Despite the online rumors, there's no Final Fantasy 9 Remake news &#8212; but I remain optimistic.</description>
    </item>
    <item>
      <title>Snakes Resort to Cannibalism When the Opportunity Strikes, Study Shows</title>
      <link>https://gizmodo.com/snakes-practice-cannibalism-when-the-opportunity-strikes-study-shows-2000722993</link>
      <pubDate>Wed, 18 Feb 2026 13:30:15 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000722993</guid>
      <description>It's a snake-eat-snake world.</description>
    </item>
    <item>
      <title>Audible&#8217;s Read and Listen feature is a handy and accessible new audiobook tool, but it comes with a catch that&#8217;s quite back-handed for book lovers</title>
      <link>https://www.techradar.com/audio/audiobooks/audibles-read-and-listen-feature-is-a-handy-and-accessible-new-audiobook-tool-on-paper-but-it-comes-with-a-catch-thats-quite-back-handed-for-book-lovers</link>
      <pubDate>Wed, 18 Feb 2026 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">vbVndtr2YjUVB5WdJUXSMi</guid>
      <description>Audible's new Read and Listen tool lets you follow your favorite audiobooks using synchronized text.</description>
    </item>
    <item>
      <title>Audible launches Read &amp; Listen, allowing you to follow along with your audiobook</title>
      <link>https://mashable.com/article/audible-read-and-listen-feature</link>
      <pubDate>Wed, 18 Feb 2026 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">065C5T33bTO6mKJqE5NTeSn</guid>
      <description>On Feb. 18, 2026, Audible launches the Read &amp; Listen mode within its app. Previously available in the Kindle app, Read &amp; Listen lets you follow the text while listening to the audiobook.</description>
    </item>
    <item>
      <title>How to watch Love Island: All Stars online for free</title>
      <link>https://mashable.com/article/love-island-all-stars-2026-live-stream-for-free</link>
      <pubDate>Wed, 18 Feb 2026 13:29:17 +0000</pubDate>
      <guid isPermaLink="false">00RCOsIX4Py7DEAmq6se65E</guid>
      <description>How to watch Love Island: All Stars for free. Live stream Love Island: All Stars in 2026 for free from anywhere in the world.</description>
    </item>
    <item>
      <title>New users can get one year of access to Monarch Money for 50 percent off</title>
      <link>https://www.engadget.com/deals/new-users-can-get-one-year-of-access-to-monarch-money-for-50-percent-off-120000143.html?src=rss</link>
      <pubDate>Wed, 18 Feb 2026 13:25:17 +0000</pubDate>
      <guid isPermaLink="false">cdb5dc60-4d5b-4ea6-ab0e-4cd9b4317487</guid>
      <description>A good budgeting app can make it much easier to see where your money is actually going, and one of our top picks is 50 percent off right now. Monarch Money is running a deal for new users that cuts the price of its annual plan in half. With the code MONARCHVIP, you&#8217;ll pay $50 for one year of access instead of the usual $100.
We&#8217;ve recommended Monarch before for its deep customization options and robust financial planning tools. It supports unlimited account connections, investment tracking and shared budgets, making it a solid option if you want a detailed look at your finances or plan alongsi...</description>
    </item>
    <item>
      <title>Liquid Web vs ScalaHosting: VPS hosting compared</title>
      <link>https://www.techradar.com/pro/website-hosting/liquid-web-vs-scalahosting-vps-hosting-compared</link>
      <pubDate>Wed, 18 Feb 2026 13:24:13 +0000</pubDate>
      <guid isPermaLink="false">dzJkyXsZCVLTFkYGLPHqoQ</guid>
      <description>Liquid Web vs ScalaHosting: VPS hosting compared</description>
    </item>
    <item>
      <title>Il n&#8217;y aura finalement pas de pub dans Perplexity</title>
      <link>https://www.01net.com/actualites/il-ny-aura-finalement-pas-de-pub-dans-perplexity.html</link>
      <pubDate>Wed, 18 Feb 2026 13:23:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326667</guid>
      <description>Il n'y aura pas de pub dans les r&#233;sultats de Perplexity. L'assistant de recherche avait pourtant lanc&#233; tr&#232;s t&#244;t, d&#232;s 2024, un programme pilote pour tester l'affichage de bandeaux de publicit&#233;. Mais il est d&#233;sormais &#224; l'abandon : une question de confiance avec les utilisateurs, tranche la start-up. Transmis &#224; OpenAI, qui vient de lancer la r&#233;clame dans ChatGPT&#8230;...</description>
    </item>
    <item>
      <title>Quels sont les meilleurs smartphones pas chers (&#224; moins de 200 &#8364;) en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/smartphones/275349_quel-smartphone-choisir-moins-de-200-euros</link>
      <pubDate>Wed, 18 Feb 2026 13:11:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/smartphones/275349_quel-smartphone-choisir-moins-de-200-euros</guid>
      <description>
Vous &#234;tes &#224; la recherche d'un t&#233;l&#233;phone &#224; moins de 200 euros ? Sur Frandroid, nous testons des smartphones de toutes sortes &#224; tous les prix : voici donc nos recommandations des meilleurs t&#233;l&#233;phones portables pas chers, &#224; moins de 200 euros. 
</description>
    </item>
    <item>
      <title>How to watch Canada vs. Czechia in mens ice hockey online for free</title>
      <link>https://mashable.com/article/canada-czechia-winter-ice-hockey-2026-live-stream-for-free</link>
      <pubDate>Wed, 18 Feb 2026 13:09:12 +0000</pubDate>
      <guid isPermaLink="false">00VequtQIjIxop6FUoVHXz5</guid>
      <description>How to watch ice hockey for free. Live stream Canada vs. Czechia in men's ice hockey for free from anywhere in the world.</description>
    </item>
    <item>
      <title>'AI is making us able to develop software at the speed of light': Mistral CEO claims more than 50% of enterprise software could soon switch to AI</title>
      <link>https://www.techradar.com/pro/ai-is-making-us-able-to-develop-software-at-the-speed-of-light-mistral-ceo-claims-more-than-50-percent-of-enterprise-software-could-switch-to-ai</link>
      <pubDate>Wed, 18 Feb 2026 13:05:00 +0000</pubDate>
      <guid isPermaLink="false">MUMEh7wnKHqqyAuFiY7nBJ</guid>
      <description>Traditional apps could be replaced by AI, but only if enterprises have the "right infrastructure in place" first.</description>
    </item>
    <item>
      <title>India&#8217;s Sarvam wants to bring its AI models to feature phones, cars and smart glasses</title>
      <link>https://techcrunch.com/2026/02/18/indias-sarvam-wants-to-bring-its-ai-models-to-feature-phones-cars-and-smart-glasses/</link>
      <pubDate>Wed, 18 Feb 2026 13:01:04 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3093888</guid>
      <description>The company is using edge models that take up only megabytes of space, can run on most phones with existing processors, and can work offline.</description>
    </item>
    <item>
      <title>Proton VPN kills OpenVPN support on Android &#8212; here&#8217;s why that&#8217;s a good thing</title>
      <link>https://www.techradar.com/vpn/vpn-services/proton-vpn-kills-openvpn-support-on-android-heres-why-thats-a-good-thing</link>
      <pubDate>Wed, 18 Feb 2026 13:00:41 +0000</pubDate>
      <guid isPermaLink="false">Cyj75bduRoxLvczwHUpWzf</guid>
      <description>Proton VPN has officially removed the OpenVPN protocol from its Android app, citing "bloat" and superior alternatives like WireGuard. Here is what you need to know.</description>
    </item>
    <item>
      <title>&#8216;Badlands&#8217; Almost Had Even Bigger Links to the Other &#8216;Predator&#8217; and &#8216;Alien&#8217; Movies</title>
      <link>https://gizmodo.com/badlands-almost-had-even-bigger-links-to-the-other-predator-and-alien-movies-2000723206</link>
      <pubDate>Wed, 18 Feb 2026 13:00:37 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000723206</guid>
      <description>There's a sly cameo from Naru from 'Prey,' but originally it didn't stop there.</description>
    </item>
    <item>
      <title>Mark Zuckerberg is taking the stand as social media goes on trial</title>
      <link>https://www.theverge.com/policy/880375/meta-ceo-mark-zuckerberg-testimony-los-angeles-social-media-addiction-trial</link>
      <pubDate>2026-02-18T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=880375</guid>
      <description>Lori Schott didn't care what it took to haul her way from her small town in Eastern Colorado to show up to a Los Angeles courtroom where Meta CEO Mark Zuckerberg is set to testify Wednesday. "I don't care if I had to hire a pack mule to get me here, I was going to [&#8230;]</description>
    </item>
    <item>
      <title>Heron Power raises $140M to ramp production of grid-altering tech</title>
      <link>https://techcrunch.com/2026/02/18/heron-power-raises-140m-to-ramp-production-of-grid-altering-tech/</link>
      <pubDate>Wed, 18 Feb 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3093811</guid>
      <description>Tesla alumni Drew Baglino raises a large round to build a giga-scale factory, this time at his own startup.</description>
    </item>
    <item>
      <title>Vie num&#233;rique | Comment l&#8217;IA peut lib&#233;rer votre g&#233;nie musical</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-02-18/vie-numerique/comment-l-ia-peut-liberer-votre-genie-musical.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 18 Feb 2026 08:00:00 -0500</pubDate>
      <guid isPermaLink="false">12f7888c09e533818655b3a855af3b39</guid>
      <description>L&#8217;intelligence artificielle (IA) g&#233;n&#233;rative signe-t-elle le d&#233;but de la fin de la cr&#233;ativit&#233; humaine dans le secteur musical&#160;? Des sites comme Suno et Udio font craindre le pire&#160;: ils peuvent g&#233;n&#233;rer des chansons enti&#232;res &#224; partir d&#8217;une simple phrase descriptive. Mais l&#8217;IA peut aussi aider les amateurs de musique &#224; devenir plus cr&#233;atifs. Il suffit de trouver les bons outils....</description>
    </item>
    <item>
      <title>J&#8217;ai essay&#233; la nouvelle Dacia Spring : la voiture &#233;lectrique la moins ch&#232;re de France est-elle toujours trop ch&#232;re pour ce qu&#8217;elle propose ?</title>
      <link>https://www.frandroid.com/marques/dacia/2979841_jai-essaye-la-nouvelle-dacia-spring-la-voiture-electrique-la-moins-chere-de-france-est-elle-toujours-trop-chere-pour-ce-quelle-propose</link>
      <pubDate>Wed, 18 Feb 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dacia/2979841_jai-essaye-la-nouvelle-dacia-spring-la-voiture-electrique-la-moins-chere-de-france-est-elle-toujours-trop-chere-pour-ce-quelle-propose</guid>
      <description>
Nouveau moteur, nouvelle batterie et toujours la voiture &#233;lectrique la moins ch&#232;re de France en prix de fa&#231;ade avec la Leapmotor T03 qui singe ses tarifs. Voici ce que propose Dacia avec le mill&#233;sime 2026 de la Spring. Face &#224; une concurrence plus polyvalente et qui se rapproche dangereusement de ses prix, la citadine franco-roumaine doit se remettre &#224; la page pour ne pas &#234;tre finalement trop ch&#232;re par rapport &#224; ce qu'elle propose. Pari r&#233;ussi ?
...</description>
    </item>
    <item>
      <title>Indian AI lab Sarvam&#8217;s new models are a major bet on the viability of open-source AI</title>
      <link>https://techcrunch.com/2026/02/18/indian-ai-lab-sarvams-new-models-are-a-major-bet-on-the-viability-of-open-source-ai/</link>
      <pubDate>Wed, 18 Feb 2026 12:55:20 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3093889</guid>
      <description>The new lineup includes 30-billion and 105-billion parameter models; a text-to-speech model; a speech-to-text model; and a vision model to parse documents.</description>
    </item>
  </channel>
</rss>
