<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 12 Jan 2026 13:48:29 GMT</lastBuildDate>
    <item>
      <title>Les soldes, c&#8217;est le bon moment pour changer son smartphone : voici le TOP 12 des deals &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2931029_les-soldes-cest-le-bon-moment-pour-changer-son-smartphone-voici-le-top-12-des-deals-a-retenir</link>
      <pubDate>Mon, 12 Jan 2026 13:40:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931029_les-soldes-cest-le-bon-moment-pour-changer-son-smartphone-voici-le-top-12-des-deals-a-retenir</guid>
      <description>
Si vous attendiez les soldes pour changer de smartphones, vous avez bien fait ! Durant cette p&#233;riode, on trouve de belles offres du c&#244;t&#233; des Galaxy S de Samsung, des Pixel de Google et appareils Xiaomi, et m&#234;me des iPhone d'Apple. D&#233;couvrez les meilleures offres : il y en a pour tous les budgets.
</description>
    </item>
    <item>
      <title>Get Apple's 25W MagSafe charger for only $30 right now</title>
      <link>https://www.engadget.com/deals/get-apples-25w-magsafe-charger-for-only-30-right-now-141707104.html?src=rss</link>
      <pubDate>Mon, 12 Jan 2026 13:36:26 +0000</pubDate>
      <guid isPermaLink="false">2ce1496f-1e48-428a-bb64-aefda025bc79</guid>
      <description>One way you can reduce the number of cables you have to deal with on the regular is by investing in a few wireless chargers. Those with iPhones should consider Apple's own MagSafe charger not only because of its sleek and effective design, but also because it's on sale right now at Amazon. The Qi2.2-rated MagSafe charger is down to $30 for the one-meter version, or $40 for the two-meter version.


If you have an iPhone 16, iPhone 17 or iPhone Air, this cable can charge your device at 25W as long as it's connected to a 30W power adapter on the other end. While you'll need a more recent iPhone t...</description>
    </item>
    <item>
      <title>Insta360 X5 : cette excellente action cam de 2025 perd une grosse partie de son prix pour les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2650005_insta360-x5-cette-excellente-action-cam-de-2025-perd-une-grosse-partie-de-son-prix-pour-les-soldes</link>
      <pubDate>Mon, 12 Jan 2026 13:36:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2650005_insta360-x5-cette-excellente-action-cam-de-2025-perd-une-grosse-partie-de-son-prix-pour-les-soldes</guid>
      <description>
L'Insta360 X5 a int&#233;gr&#233; le catalogue de la marque sp&#233;cialis&#233;e dans la vid&#233;o en 2025. Cette r&#233;cente cam&#233;ra d'action b&#233;n&#233;ficie de pas mal d'am&#233;liorations par rapport au mod&#232;le pr&#233;c&#233;dent et est d'ores et d&#233;j&#224; bien moins ch&#232;re qu'&#224; son lancement.
</description>
    </item>
    <item>
      <title>On pensait avoir touch&#233; le fond avec le Rabbit R1 et l&#8217;Humane Pin, mais l&#8217;industrie tech est pleine de ressources</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2939301_on-pensait-avoir-touche-le-fond-avec-le-rabbit-r1-et-lhumane-pin-mais-lindustrie-tech-est-pleine-de-ressources</link>
      <pubDate>Mon, 12 Jan 2026 13:34:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2939301_on-pensait-avoir-touche-le-fond-avec-le-rabbit-r1-et-lhumane-pin-mais-lindustrie-tech-est-pleine-de-ressources</guid>
      <description>
Meizu vient de pr&#233;senter le 22 Next. C'est un carr&#233;, &#231;a a un &#233;cran de 4 pouces, &#231;a vous fait des sourires, et &#231;a promet de r&#233;volutionner votre vie.
</description>
    </item>
    <item>
      <title>A Lego version of the original iMac G3 could be in the works &#8211; and it looks like 90s nostalgia gold</title>
      <link>https://www.techradar.com/computing/a-lego-version-of-the-original-imac-g3-could-be-in-the-works-and-it-looks-like-90s-nostalgia-gold</link>
      <pubDate>Mon, 12 Jan 2026 13:31:14 +0000</pubDate>
      <guid isPermaLink="false">x2dVQzdV5eXe3SrYHgXXb5</guid>
      <description>iMac and Lego &#8211; the perfect combination? New concept set for Apple's original iMac G3 looks stunning.</description>
    </item>
    <item>
      <title>De &#171;&#160;l&#8217;IA souveraine&#160;&#187; au sein des syst&#232;mes de combat a&#233;rien&#160;: Dassault Aviation s&#8217;associe &#224; la p&#233;pite fran&#231;aise Harmattan AI</title>
      <link>https://www.01net.com/actualites/de-lia-souveraine-au-sein-des-systemes-de-combat-aerien-dassault-aviation-sassocie-a-la-pepite-francaise-harmattan-ai.html</link>
      <pubDate>Mon, 12 Jan 2026 13:21:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319394</guid>
      <description>Le g&#233;ant fran&#231;ais de l'industrie de la d&#233;fense, Dassault Aviation, a annonc&#233; avoir particip&#233; &#224; une lev&#233;e de fonds de la soci&#233;t&#233; Harmattan AI, une start-up fran&#231;aise qui con&#231;oit et industrialise des drones et des solutions d'IA militaires.</description>
    </item>
    <item>
      <title>&#171; Vous pouvez recharger en 12 minutes &#187; : c&#8217;est officiel, Xpeng s&#8217;attaque &#224; l&#8217;atout ma&#238;tre de Tesla en Europe</title>
      <link>https://www.frandroid.com/marques/xpeng/2939145_vous-pouvez-recharger-en-12-minutes-cest-officiel-xpeng-sattaque-a-latout-maitre-de-tesla-en-europe</link>
      <pubDate>Mon, 12 Jan 2026 13:16:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2939145_vous-pouvez-recharger-en-12-minutes-cest-officiel-xpeng-sattaque-a-latout-maitre-de-tesla-en-europe</guid>
      <description>
Xpeng continue son d&#233;veloppement en Europe. Pour accompagner ses voitures &#233;lectriques capables de se recharger en 12 minutes, la marque chinoise nous a confirm&#233; l'arriv&#233;e de ses bornes ultra-rapides en Europe en 2026. De quoi r&#233;pondre aux Superchargeurs de Tesla et aux imminentes stations Megawatt de BYD ?
</description>
    </item>
    <item>
      <title>Walmart is planning to expand a popular service. It means new delivery options from Los Angeles to Miami</title>
      <link>https://www.fastcompany.com/91472414/walmart-is-planning-to-expand-a-popular-service-it-means-new-delivery-options-from-los-angeles-to-miami</link>
      <pubDate>2026-01-12T13:15:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91472414/walmart-is-planning-to-expand-a-popular-service-it-means-new-delivery-options-from-los-angeles-to-miami</guid>
      <description>The retail giant&#8217;s multi-year partnership with drone delivery company Wing has proven successful. It will be in 270 locations around the U.S. in 2027.
It&#8217;s a bird. It&#8217;s a plane. It&#8217;s the next phase of expansion planned by Walmart and drone company Wing.</description>
    </item>
    <item>
      <title>This ElevationLabs 10-year extended battery case for AirTags is on sale for only $16</title>
      <link>https://www.engadget.com/deals/this-elevationlabs-10-year-extended-battery-case-for-airtags-is-on-sale-for-only-16-162308983.html?src=rss</link>
      <pubDate>Mon, 12 Jan 2026 13:14:15 +0000</pubDate>
      <guid isPermaLink="false">12d3fe53-c0b1-4919-880c-16749c440b85</guid>
      <description>ElevationLab makes a battery case for your AirTag that can power it for 10 years and the accessory is on sale now for 30 percent off. Normally retailing for $23, you can pick one up for $16.
The TimeCapsule case uses two AA batteries to offer up to 14 times the lifespan of the CR2032 battery that powers an AirTag. The company based those estimates on Energizer Ultimate Lithium batteries, so your mileage may vary. Once an AirTag is seated inside the case, which is a compact 4.45 x 1.57 inches, it is sealed shut with four screws at the corners. The case is fiber-reinforced, according to Elevatio...</description>
    </item>
    <item>
      <title>Perte de poids, nouvelle interface et conseils par IA : les secrets d&#8217;Apple pour r&#233;volutionner l&#8217;application Sant&#233;</title>
      <link>https://www.frandroid.com/marques/apple/2939175_perte-de-poids-nouvelle-interface-et-conseils-par-ia-les-secrets-dapple-pour-revolutionner-lapplication-sante</link>
      <pubDate>Mon, 12 Jan 2026 13:02:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2939175_perte-de-poids-nouvelle-interface-et-conseils-par-ia-les-secrets-dapple-pour-revolutionner-lapplication-sante</guid>
      <description>
Apple devrait lancer cette ann&#233;e une refonte de son application Apple Sant&#233;, avec en prime un nouvel abonnement Health+. Voici les principales nouveaut&#233;s attendues. 
</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : voici les meilleures offres en DIRECT avant la fin de la premi&#232;re d&#233;marque</title>
      <link>https://www.frandroid.com/bons-plans/2931731_soldes-dhiver-2026-voici-les-meilleures-offres-en-direct-avant-la-fin-de-la-premiere-demarque</link>
      <pubDate>Mon, 12 Jan 2026 13:02:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931731_soldes-dhiver-2026-voici-les-meilleures-offres-en-direct-avant-la-fin-de-la-premiere-demarque</guid>
      <description>
Les soldes d'hiver 2026 ont d&#233;but&#233; la semaine derni&#232;re et les offres continuent de tomber sur Amazon, Fnac, Darty ou encore Cdiscount et Boulanger. Smartphones, PC portables, t&#233;l&#233;viseurs, tablettes ou encore casques et &#233;couteurs sans fil&#8230; Voici les meilleures offres Tech s&#233;lectionn&#233;es par la r&#233;daction pour l'occasion.
</description>
    </item>
    <item>
      <title>Meta closes 550,000 accounts to comply with Australia's kids social media ban</title>
      <link>https://www.engadget.com/social-media/meta-closes-550000-accounts-to-comply-with-australias-kids-social-media-ban-130041356.html?src=rss</link>
      <pubDate>Mon, 12 Jan 2026 13:00:41 +0000</pubDate>
      <guid isPermaLink="false">546a5d9d-3b71-47aa-9419-ffa9f5462180</guid>
      <description>To comply with Australia's under-16 social media ban, Meta said on Medium that it has shut down nearly 550,00 accounts. That number includes 330,000 Instagram, 173,000 Facebook and 40,000 Threads accounts deemed to belong to children. "Ongoing compliance with the law will be a multi-layered process that we will continue to refine, though our concerns about determining age online without an industry standard remain," the company wrote.&#160;
Australia's minimum age social media ban, the first of its kind in the world for a democracy, went into effect on December 10. The ten platforms affected, inclu...</description>
    </item>
    <item>
      <title>Nvidia has finally done the one AI thing I've been dreading &#8212; and PC gaming might never be the same</title>
      <link>https://www.techradar.com/tech-events/nvidia-has-finally-done-the-one-ai-thing-ive-been-dreading-and-pc-gaming-might-never-be-the-same</link>
      <pubDate>Mon, 12 Jan 2026 13:00:36 +0000</pubDate>
      <guid isPermaLink="false">wxGbuRJ78Mx8NXpDqy6vNb</guid>
      <description>'Depth and complexity are hallmarks of PC gaming' says Nvidia, then immediately reveals a plan to obliterate any depth and complexity in PC gaming.</description>
    </item>
    <item>
      <title>The Golden Globes Belonged to &#8216;KPop Demon Hunters&#8217; and &#8216;Sinners&#8217;</title>
      <link>https://gizmodo.com/the-golden-globes-belonged-to-kpop-demon-hunters-and-sinners-2000708843</link>
      <pubDate>Mon, 12 Jan 2026 13:00:04 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000708843</guid>
      <description>Not a wide spread of genre wins at the 2026 Golden Globes, but Netflix and Warner Bros.' respective hits got two wins each, and 'Pluribus' landed one.</description>
    </item>
    <item>
      <title>Nearly lost, this famed sculpture gets a new life inside GM&#8217;s headquarters</title>
      <link>https://www.fastcompany.com/91470069/famed-bertoia-sculpture-gets-a-new-life-inside-gms-headquarters</link>
      <pubDate>2026-01-12T13:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91470069/famed-bertoia-sculpture-gets-a-new-life-inside-gms-headquarters</guid>
      <description>A monumental metal sculpture by artist Harry Bertoia was thought lost in a mall demolition, but has been restored and reinstalled.
Almost lost and nearly forgotten, a sculpture by one of the most noted mid-century modernist designers has been given a meticulous restoration and a starring place in the new headquarters of General Motors in downtown Detroit....</description>
    </item>
    <item>
      <title>Boost Mobile Offers $10/Month for 3 Months, Then Locks You In at $25 Forever for One of the Cheapest Unlimited Plans</title>
      <link>https://gizmodo.com/boost-mobile-offers-10-month-for-3-months-then-locks-you-in-at-25-forever-for-one-of-the-cheapest-unlimited-plans-2000708478</link>
      <pubDate>Mon, 12 Jan 2026 12:58:46 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000708478</guid>
      <description>If you need a new phone service, this offer will definitely be for you.</description>
    </item>
    <item>
      <title>Baldur's Gate 3 might not come to Switch 2 as Larian CEO says a port 'wasn't our decision to make'</title>
      <link>https://www.techradar.com/gaming/nintendo/baldurs-gate-3-might-not-come-to-switch-2-as-larian-ceo-says-a-port-wasnt-our-decision-to-make</link>
      <pubDate>Mon, 12 Jan 2026 12:48:38 +0000</pubDate>
      <guid isPermaLink="false">uHZmnphXynp554FK2hTTxg</guid>
      <description>Nintendo Switch 2's first Christmas sales fall short of the original Switch by 35% in the US, showing markedly less of an appetite over the Holidays.</description>
    </item>
    <item>
      <title>I tried to improve my sleep using expert advice for 4 weeks and recorded it all on my Oura Ring &#8211; and it worked</title>
      <link>https://www.techradar.com/health-fitness/i-tried-to-improve-my-sleep-using-expert-advice-for-4-weeks-and-recorded-it-all-on-my-oura-ring-and-it-worked</link>
      <pubDate>Mon, 12 Jan 2026 12:47:13 +0000</pubDate>
      <guid isPermaLink="false">uPvdqkAxvhreitydwpZxyK</guid>
      <description>Is better sleep really about biohacks and perfect scores, or simply discipline and consistency? I tracked what genuinely changed and what didn&#8217;t</description>
    </item>
    <item>
      <title>Voici le Xiaomi 17 Air&#160;: des photos du smartphone abandonn&#233; sortent</title>
      <link>https://www.01net.com/actualites/voici-le-xiaomi-17-air-des-photos-du-smartphone-abandonne-sortent.html</link>
      <pubDate>Mon, 12 Jan 2026 12:46:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319424</guid>
      <description>Alors qu&#8217;Apple et Samsung ont r&#233;cemment tent&#233; l&#8217;aventure des smartphones ultrafins, Xiaomi semble avoir pr&#233;f&#233;r&#233; s&#8217;abstenir. Une d&#233;cision prudente, &#224; en croire les fuites autour d&#8217;un myst&#233;rieux Xiaomi 17 Air, prototype jamais commercialis&#233;. Trop risqu&#233;, pas assez rentable ou simplement d&#233;pass&#233;&#8239;? Le pari de la finesse extr&#234;me semble avoir perdu de son attrait dans le haut de gamme....</description>
    </item>
    <item>
      <title>Google brings buy buttons to Gemini and AI search</title>
      <link>https://www.theverge.com/news/860446/google-ai-shopping-standard-buy-button-gemini</link>
      <pubDate>2026-01-12T07:44:24-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=860446</guid>
      <description>Google turned up the heat in the AI shopping wars this weekend, announcing plans to turn Gemini into a merchant and launching an open-source standard built together with major retailers including Shopify, Walmart, and Target. The move comes as companies like OpenAI, Amazon, and Perplexity jostle for power and influence at the heart of a [&#8230;]</description>
    </item>
    <item>
      <title>KPop Demon Hunters wins best song at Golden Globes, Ejae gives moving speech</title>
      <link>https://mashable.com/video/golden-globes-kpop-demon-hunters</link>
      <pubDate>Mon, 12 Jan 2026 12:33:45 +0000</pubDate>
      <guid isPermaLink="false">00plpuwc0iSXV27wvPE5BgA</guid>
      <description>"KPop Demon Hunters" took home Golden Globes for Best Animated Feature Film and Best Original Song for eternal banger "Golden."</description>
    </item>
    <item>
      <title>This world-first bird feeder cam with 360-degree view sees all in 6K, and I can't wait to try it in my backyard</title>
      <link>https://www.techradar.com/cameras/this-world-first-bird-feeder-cam-with-360-degree-view-sees-all-in-6k-and-i-cant-wait-to-try-it-in-my-backyard</link>
      <pubDate>Mon, 12 Jan 2026 12:30:24 +0000</pubDate>
      <guid isPermaLink="false">2F9fEvSGJgHgtUdpzBkC</guid>
      <description>Birdfy revealed three new bird feeder cameras at CES 2026, including the world's first 360-degree model &#8211; plus a huge update to its app with natural language interactions.</description>
    </item>
    <item>
      <title>Ryan Coogler thanks Sinners audiences for showing up in Golden Globes speech</title>
      <link>https://mashable.com/video/golden-globes-ryan-coogler-speech-sinners</link>
      <pubDate>Mon, 12 Jan 2026 12:22:11 +0000</pubDate>
      <guid isPermaLink="false">05i9mCLU52fZfgeMuwDsp8s</guid>
      <description>'Sinners' directors Ryan Coogler thanked audiences during his Golden Globes speech.</description>
    </item>
    <item>
      <title>Les Soldes continuent avec -43% sur ce laptop Samsung &#224; &#233;cran AMOLED tactile 120 Hz 14&#8243; ultraportable et l&#233;ger au possible</title>
      <link>https://www.frandroid.com/marques/2938699_les-soldes-continuent-avec-43-sur-ce-laptop-samsung-a-ecran-amoled-tactile-120-hz-14-ultraportable-et-leger-au-possible</link>
      <pubDate>Mon, 12 Jan 2026 12:22:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2938699_les-soldes-continuent-avec-43-sur-ce-laptop-samsung-a-ecran-amoled-tactile-120-hz-14-ultraportable-et-leger-au-possible</guid>
      <description>
Pour les Soldes sur Darty, vous pouvez commander le Samsung Galaxy Book4 Pro 14" pour 849,99 euros au lieu de 1499,99 euros au lancement.
</description>
    </item>
    <item>
      <title>AI haters be warned &#8211; Windows 11's folders could get a large dose of Copilot AI</title>
      <link>https://www.techradar.com/computing/windows/ai-haters-be-warned-windows-11s-folders-could-get-a-large-dose-of-copilot-ai</link>
      <pubDate>Mon, 12 Jan 2026 12:17:49 +0000</pubDate>
      <guid isPermaLink="false">AczTVkeCfV7burS5ZtLhnQ</guid>
      <description>Microsoft could put Copilot in Windows 11's File Explorer in a far more in-your-face way than the AI is right now.</description>
    </item>
    <item>
      <title>Hack your streaming in 2026 &#8212; get $30 off the Fire TV Cube at Amazon</title>
      <link>https://mashable.com/article/jan-12-fire-tv-cube-deal</link>
      <pubDate>Mon, 12 Jan 2026 12:16:47 +0000</pubDate>
      <guid isPermaLink="false">05jM6gMUVFcSDBiavAAck4A</guid>
      <description>As of Jan. 12, Amazon has dropped the Fire TV Cube to $109.99, 21% off its list price of $139.99.</description>
    </item>
    <item>
      <title>The latest rumored Steam Machine prices aren't anywhere near as bad as I thought &#8211; but I'm still fearing the worst</title>
      <link>https://www.techradar.com/gaming/consoles-pc/the-latest-rumored-steam-machine-prices-arent-anywhere-near-as-bad-as-i-thought-but-im-still-fearing-the-worst</link>
      <pubDate>Mon, 12 Jan 2026 12:12:12 +0000</pubDate>
      <guid isPermaLink="false">V3K5eTuNnhCn6p2Vugg9PW</guid>
      <description>If these purported Steam Machine prices are somewhat accurate, consumers should be happy considering what prices are expected to be.</description>
    </item>
    <item>
      <title>Steam Machine : le prix aurait fuit&#233; et il risque de piquer bien plus que pr&#233;vu</title>
      <link>https://www.frandroid.com/marques/valve/2938735_bien-plus-chere-quune-console-le-prix-de-la-steam-machine-de-valve-aurait-fuite</link>
      <pubDate>Mon, 12 Jan 2026 12:03:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/valve/2938735_bien-plus-chere-quune-console-le-prix-de-la-steam-machine-de-valve-aurait-fuite</guid>
      <description>
Un revendeur tch&#232;que aurait fait fuiter le prix des deux mod&#232;les de Steam Machine attendus pour ce d&#233;but d'ann&#233;e. On fait le point.
</description>
    </item>
    <item>
      <title>Samsung Galaxy S26 Ultra&#160;: cette nouveaut&#233; photo inspir&#233;e de l&#8217;iPhone pourrait changer la donne</title>
      <link>https://www.01net.com/actualites/samsung-galaxy-s26-ultra-cette-nouveaute-photo-inspiree-de-liphone-pourrait-changer-la-donne.html</link>
      <pubDate>Mon, 12 Jan 2026 12:03:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319435</guid>
      <description>Le Samsung Galaxy S26 Ultra pourrait h&#233;riter de l'une des derni&#232;res am&#233;liorations apport&#233;es &#224; l'iPhone avec des photos en 24 m&#233;gapixels pour un piqu&#233; sup&#233;rieur. Une option cach&#233;e qui promet beaucoup, mais qui impose un compromis sur la vitesse.</description>
    </item>
    <item>
      <title>The Magic: The Gathering Avatar The Last Airbender Jumpstart Booster Box is close to market value on Amazon</title>
      <link>https://mashable.com/article/jan-12-magic-the-gathering-avatar-the-last-airbender-jumpstart-booster</link>
      <pubDate>Mon, 12 Jan 2026 12:01:09 +0000</pubDate>
      <guid isPermaLink="false">02gTaD3eJLywrPJGwZDjrIg</guid>
      <description>Buy 24 packs from MTG's Avatar: The Last Airbender expansion at 37% off for a huge $63 price cut.</description>
    </item>
    <item>
      <title>&#8216;Avatar: Fire and Ash&#8217; Fends Off &#8216;Primate&#8217; At the Box Office</title>
      <link>https://gizmodo.com/avatar-fire-and-ash-fends-off-primate-at-the-box-office-2000708835</link>
      <pubDate>Mon, 12 Jan 2026 12:00:47 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000708835</guid>
      <description>Audiences went a little bananas for 'Primate,' but James Cameron continues to rule over the winter box office.</description>
    </item>
    <item>
      <title>Former Assassin's Creed director discusses the folly of ballooning development budgets: 'You need to have people to coordinate the people coordinating'</title>
      <link>https://www.techradar.com/gaming/former-assassins-creed-director-discusses-the-folly-of-ballooning-development-budgets-you-need-to-have-people-to-coordinate-the-people-coordinating</link>
      <pubDate>Mon, 12 Jan 2026 12:00:23 +0000</pubDate>
      <guid isPermaLink="false">HK2ssRDYYRWBYfgmd9fXCG</guid>
      <description>Former Assassin's Creed director Alexandre Amancio says AAA studios 'mistakenly' try to 'solve a problem by throwing people at it'.</description>
    </item>
    <item>
      <title>Best Travel Cameras (2026), Tested and Reviewed</title>
      <link>https://www.wired.com/gallery/best-travel-cameras/</link>
      <pubDate>Mon, 12 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">68af39ecdc2b7c62afa16f5f</guid>
      <description>We&#8217;ve found the best travel cameras&#8212;from point-and-shoot to full-frame&#8212;to help you bring home the perfect vacation photos.</description>
    </item>
    <item>
      <title>Malaysia and Indonesia are the first to block Grok following CSAM scandal</title>
      <link>https://www.engadget.com/big-tech/malaysia-and-indonesia-are-the-first-to-block-grok-following-csam-scandal-120000534.html?src=rss</link>
      <pubDate>Mon, 12 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">9b058520-a3d0-4d01-849e-de2a3adb84f6</guid>
      <description>Malaysia and Indonesia are the first countries to block Grok, claiming that X&#8217;s chatbot does not have sufficient safeguards in place to prevent explicit AI-generated deepfakes of women and children from being created and disseminated on X. Indonesia temporarily blocked access to Grok on Saturday, as did Malaysia on Sunday, the Associated Press reports.&#160;Meanwhile, UK media regulator Ofcom has opened a formal investigation into X under the Online Safety Act. "The government sees non-consensual sexual deepfakes as a serious violation of human rights, dignity and the safety of citizens in the digi...</description>
    </item>
    <item>
      <title>Bold predictions and book recommendations from you, our readers</title>
      <link>https://www.fastcompany.com/91471422/bold-predictions-and-book-recommendations-from-you-our-readers</link>
      <pubDate>2026-01-12T12:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91471422/bold-predictions-and-book-recommendations-from-you-our-readers</guid>
      <description>We asked, and readers didn&#8217;t hold back. Here are their insights about what&#8217;s coming in 2026 and must-read books.
Hello and welcome to Modern CEO! I&#8217;m Stephanie Mehta, CEO and chief content officer of Mansueto Ventures. Each week this newsletter explores inclusive approaches to leadership drawn from conversations with executives and entrepreneurs, and from the pages of Inc. and Fast Company. If you received this newsletter from a friend, you can sign up to get it yourself every Monday morning....</description>
    </item>
    <item>
      <title>R&#233;seaux sociaux interdits aux moins de 16&#160;ans | Meta exhorte l&#8217;Australie &#224; revenir sur sa loi</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-01-12/reseaux-sociaux-interdits-aux-moins-de-16-ans/meta-exhorte-l-australie-a-revenir-sur-sa-loi.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Mon, 12 Jan 2026 06:59:04 -0500</pubDate>
      <guid isPermaLink="false">7560d522a1193684b7d26c06f87da447</guid>
      <description>Le g&#233;ant am&#233;ricain de la technologie Meta a appel&#233; lundi l&#8217;Australie &#224; reconsid&#233;rer son interdiction des r&#233;seaux sociaux pour les moins de 16&#160;ans, tout en signalant avoir bloqu&#233; plus de 544&#160;000&#160;comptes en vertu de la nouvelle loi.</description>
    </item>
    <item>
      <title>When is Stuff Your Kindle Day? Get ready to restock your TBR.</title>
      <link>https://mashable.com/article/when-is-stuff-your-kindle-day</link>
      <pubDate>Mon, 12 Jan 2026 11:54:42 +0000</pubDate>
      <guid isPermaLink="false">07z2oJ3iNeEWBLUu6SsIn6e</guid>
      <description>Stuff Your Kindle Day presents the opportunity to fill your e-reader's library with hundreds of free or discounted e-books. So when's the next event? This is what we know about the next Stuff Your Kindle Day event.</description>
    </item>
  </channel>
</rss>
