<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 30 Jan 2026 15:40:03 GMT</lastBuildDate>
    <item>
      <title>Sony Knows You Want a True PlayStation Handheld, Even Though it May Take a While</title>
      <link>https://gizmodo.com/sony-knows-you-want-a-true-playstation-handheld-even-though-it-may-take-a-while-2000715977</link>
      <pubDate>Fri, 30 Jan 2026 15:35:24 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715977</guid>
      <description>Will a PlayStation Portal with an OLED screen tide you over?</description>
    </item>
    <item>
      <title>The lonely promise of cute robots</title>
      <link>https://www.theverge.com/column/870438/optimizer-mirumi-loneliness-social-companion-robots</link>
      <pubDate>2026-01-30T10:33:24-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=870438</guid>
      <description>This is Optimizer, a weekly newsletter sent every Friday from Verge senior reviewer Victoria Song that dissects and discusses the latest gizmos and potions that swear they're going to change your life. Optimizer arrives in our subscribers' inboxes at 10AM ET. Opt in for Optimizer here. Unboxing Mirumi is like traveling back in time. It's [&#8230;]</description>
    </item>
    <item>
      <title>The Samsung Galaxy Z TriFold is now available to buy at the official Samsung Store with a price tag that will make your bank account cry</title>
      <link>https://www.techradar.com/phones/samsung-galaxy-phones/the-samsung-galaxy-z-trifold-is-now-available-to-buy-at-the-official-samsung-store-with-a-price-tag-that-will-make-your-bank-account-cry</link>
      <pubDate>Fri, 30 Jan 2026 15:30:24 +0000</pubDate>
      <guid isPermaLink="false">khtARmpdFMAgVvdkB9cTMG</guid>
      <description>There's no escaping the financial blow if you want this stunning device</description>
    </item>
    <item>
      <title>Ligue 1+ pourrait diffuser toute la Coupe du Monde de football 2026, voici ce que &#231;a implique</title>
      <link>https://www.frandroid.com/services/2961685_ligue-1-pourrait-diffuser-toute-la-coupe-du-monde-de-football-2026-voici-ce-que-ca-implique</link>
      <pubDate>Fri, 30 Jan 2026 15:30:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/2961685_ligue-1-pourrait-diffuser-toute-la-coupe-du-monde-de-football-2026-voici-ce-que-ca-implique</guid>
      <description>
Un accord de diffusion de la prochaine Coupe du Monde de football est en bonne voie. C'est la cha&#238;ne Ligue 1+ qui raflerait le contrat.
</description>
    </item>
    <item>
      <title>Nvidia, Microsoft et Amazon voudraient investir 60 milliards de dollars dans OpenAI, pour quoi faire ?</title>
      <link>https://www.frandroid.com/marques/openai/2961573_nvidia-microsoft-et-amazon-voudraient-investir-60-milliards-de-dollars-dans-openai-pour-quoi-faire</link>
      <pubDate>Fri, 30 Jan 2026 15:29:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/openai/2961573_nvidia-microsoft-et-amazon-voudraient-investir-60-milliards-de-dollars-dans-openai-pour-quoi-faire</guid>
      <description>
Selon des sources proches du dossier, des discussions sont en cours entre les 4 g&#233;ants de la Tech. &#192; quoi pourrait servir une telle somme ?
</description>
    </item>
    <item>
      <title>Data sovereignty creates an illusion of security: the real battle is software integrity</title>
      <link>https://www.techradar.com/pro/data-sovereignty-creates-an-illusion-of-security-the-real-battle-is-software-integrity</link>
      <pubDate>Fri, 30 Jan 2026 15:20:08 +0000</pubDate>
      <guid isPermaLink="false">8J7sddkwDqoTULxytsGKkb</guid>
      <description>The consequences of neglecting software integrity are severe and more visible than ever.</description>
    </item>
    <item>
      <title>Windows + barre des t&#226;ches fa&#231;on macOS&#160;: l&#8217;arme secr&#232;te de Microsoft pour enfin rendre son OS sexy</title>
      <link>https://www.01net.com/actualites/windows-barre-des-taches-facon-macos-larme-secrete-de-microsoft-pour-enfin-rendre-son-os-sexy.html</link>
      <pubDate>Fri, 30 Jan 2026 15:15:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323502</guid>
      <description>Microsoft s&#8217;appr&#234;te &#224; piquer le secret de macOS : une barre de menu universel ultra-personnalisable arrive dans Windows 11 via PowerToys ! Baptis&#233; Command Palette Dock, ce concept modulable (fixable partout et bourr&#233; d&#8217;extensions) veut fluidifier votre quotidien et d&#233;fier Apple sur son terrain. Reste &#224; savoir si le nom &#171;&#8201;Dock&#8201;&#187; survivra aux d&#233;bats qu'il risque de g&#233;n&#233;rer....</description>
    </item>
    <item>
      <title>Is 'Shadow AI' a threat to your business? Report claims workers are increasingly more willing to cut corners and take risks</title>
      <link>https://www.techradar.com/pro/security/is-shadow-ai-a-threat-to-your-business-report-claims-workers-are-increasingly-more-willing-to-cut-corners-and-take-risks</link>
      <pubDate>Fri, 30 Jan 2026 15:15:00 +0000</pubDate>
      <guid isPermaLink="false">ZXx9EyiYWxtRyy8bqrzRGd</guid>
      <description>Workers and managers are all using unapproved AI tools at work, putting their sensitive company information at risk.</description>
    </item>
    <item>
      <title>M&#234;me Apple n&#8217;y croit plus : la fin silencieuse de la 5G millim&#233;trique en France</title>
      <link>https://www.frandroid.com/services/operateurs-mobiles/2961739_meme-apple-ny-croit-plus-la-fin-silencieuse-de-la-5g-millimetrique-en-france</link>
      <pubDate>Fri, 30 Jan 2026 15:14:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/operateurs-mobiles/2961739_meme-apple-ny-croit-plus-la-fin-silencieuse-de-la-5g-millimetrique-en-france</guid>
      <description>
On nous l'avait vendue comme le &#171; vrai &#187; futur de la connectivit&#233; mobile, capable de d&#233;bits hallucinants. Pourtant, la 5G millim&#233;trique semble avoir totalement disparu des radars dans l'Hexagone. Entre des contraintes techniques r&#233;dhibitoires et des op&#233;rateurs frileux, cette technologie fait un flop monumental, au point que m&#234;me Apple commence &#224; retirer les composants n&#233;cessaires de ses iPhone.
...</description>
    </item>
    <item>
      <title>How context-aware agents and open protocols drive real-world success in enterprise AI</title>
      <link>https://www.techradar.com/pro/how-context-aware-agents-and-open-protocols-drive-real-world-success-in-enterprise-ai</link>
      <pubDate>Fri, 30 Jan 2026 15:12:06 +0000</pubDate>
      <guid isPermaLink="false">pN9u7Vh2m8p37uwHLcxGqg</guid>
      <description>As enterprises push AI into production, they're encountering a fundamental constraint: general-purpose models lack the real-time operational context that enterprise decisions require.</description>
    </item>
    <item>
      <title>Super Bowl 2026 TV deals: The best sales on OLEDs and other smart TVs ahead of kickoff</title>
      <link>https://www.engadget.com/deals/super-bowl-2026-tv-deals-the-best-sales-on-oleds-and-other-smart-tvs-ahead-of-kickoff-160000929.html?src=rss</link>
      <pubDate>Fri, 30 Jan 2026 15:10:17 +0000</pubDate>
      <guid isPermaLink="false">19a8ed95-5057-4f9e-952b-502d925814e1</guid>
      <description>Whether you&#8217;re having people over to watch the Patriots and the Seahawks battle it out in Super Bowl 2026, or you&#8217;re more interested in the Bad Bunny halftime show, your TV will be an important part of the puzzle of putting together an excellent big-game party. If you&#8217;ve been thinking about upgrading your current TV, now&#8217;s a decent time to do it. The weeks leading up to the Super Bowl are typically awash with TV deals to consider.Generally, TV prices steadily decrease after a new model comes out. Some 2026 TV models were announced at CES and are forthcoming things year, making now a good time ...</description>
    </item>
    <item>
      <title>LG reportedly stops making 8K OLED panels, as world is surprised to learn that was still an option</title>
      <link>https://www.techradar.com/televisions/lg-reportedly-stops-making-8k-oled-panels-as-world-is-surprised-to-learn-that-was-still-an-option</link>
      <pubDate>Fri, 30 Jan 2026 15:01:35 +0000</pubDate>
      <guid isPermaLink="false">jGKNGgLVFZsgCoHa8Eo6J7</guid>
      <description>LG is reportedly exiting the 8K TV business unless market conditions improve. Is 8K dead?</description>
    </item>
    <item>
      <title>Colin Farrell&#8217;s Detective Show &#8216;Sugar&#8217; Will Finally Have to Address that Wild Twist This Summer</title>
      <link>https://gizmodo.com/colin-farrells-detective-show-sugar-will-finally-have-to-address-that-wild-twist-this-summer-2000715869</link>
      <pubDate>Fri, 30 Jan 2026 15:00:49 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715869</guid>
      <description>Apple TV's neo-noir drama about a private eye with a big secret returns for season two June 19.</description>
    </item>
    <item>
      <title>How to watch the 2026 Grammy Awards: TV channel, start time, where to stream, nominations list and more</title>
      <link>https://www.engadget.com/entertainment/streaming/how-to-watch-the-2026-grammy-awards-tv-channel-start-time-where-to-stream-nominations-list-and-more-150015179.html?src=rss</link>
      <pubDate>Fri, 30 Jan 2026 15:00:15 +0000</pubDate>
      <guid isPermaLink="false">7aa9a65c-d585-4e36-87b2-009a04f2bf1d</guid>
      <description>


  Grammy winner Bad Bunny, seen here accepting his award for Best M&#250;sica Urbana Album for &#8220;Un Verano Sin Ti&#8221; in 2023, is nominated again this year. (Timothy Norris/FilmMagic)
 

  Timothy Norris via Getty Images
 

The 2026 Grammy Awards honor music's biggest achievements of the year, and some of the biggest stars on the planet are nominated this year. Kendrick Lamar leads the way with nine nominations, including for Record and Song of the Year for "luther," his collaboration with SZA. Other top nominees this year include Lady Gaga, Jack Antonoff, and Cirkut with seven nominations apiece, a...</description>
    </item>
    <item>
      <title>Who&#8217;s afraid of the new TikTok?</title>
      <link>https://www.theverge.com/tech/870543/tiktok-us-ownership-oracle-algorithm-trust</link>
      <pubDate>2026-01-30T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=870543</guid>
      <description>The significant problems with the TikTok app last weekend were, according to the company, because of a technical issue stemming from a power outage at a "US data center partner." Users could not upload new videos and view counts were all out of whack, with few answers or explanations. For TikTok, the timing was unfortunate. [&#8230;]</description>
    </item>
    <item>
      <title>Apple&#8217;s sci-fi detective show Sugar is coming back in June</title>
      <link>https://www.theverge.com/streaming/870721/sugar-season-2-apple-tv-date</link>
      <pubDate>2026-01-30T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=870721</guid>
      <description>Apple TV continues to flesh out its streaming lineup for 2026, this time by announcing that Sugar will be back in the summer. The show's second season will premiere on June 19th and run for eight episodes. Sugar first premiered in 2024. And while it's a noir detective story at its core, thanks to a [&#8230;]</description>
    </item>
    <item>
      <title>Last&#160;24 hours&#160;to grab your +1 pass at 50% off to TechCrunch Disrupt 2026</title>
      <link>https://techcrunch.com/2026/01/30/last-24-hours-to-grab-your-1-pass-at-50-off-to-techcrunch-disrupt-2026/</link>
      <pubDate>Fri, 30 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3088146</guid>
      <description>Today is the last day to lock in a +1 pass at 50% off to TechCrunch Disrupt 2026, happening on October 13-15 in San Francisco. Register here.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Saturday, January 31 (game #965)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-31-january-2026</link>
      <pubDate>Fri, 30 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">wrAFASEp6sApFJSFCjWhtT</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Saturday, January 31 (game #1468)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-31-january-2026</link>
      <pubDate>Fri, 30 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">WUwxd7zD3fFqbUPvzTVoDN</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Saturday, January 31 (game #699)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-31-january-2026</link>
      <pubDate>Fri, 30 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">XZXu5GXk6rtRzfTvFMQHXR</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>7 new movies and TV shows to watch on Netflix, Prime Video, HBO Max and more this weekend (January 30)</title>
      <link>https://www.techradar.com/streaming/7-new-movies-and-tv-shows-to-watch-on-netflix-prime-video-hbo-max-and-more-this-weekend-january-30</link>
      <pubDate>Fri, 30 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">VQSpc83jcAogG9R9zeTcPF</guid>
      <description>From Bridgerton's return and 2026's first MCU TV show, to Jason Momoa and Dave Bautista's new movie, there's lots to be excited about this weekend.</description>
    </item>
    <item>
      <title>&#171;&#160;Les VPN, c&#8217;est le prochain sujet sur ma liste&#160;&#187; : apr&#232;s les r&#233;seaux sociaux, le gouvernement a une nouvelle cible</title>
      <link>https://www.frandroid.com/culture-tech/politique/2961635_les-vpn-cest-le-prochain-sujet-sur-ma-liste-apres-les-reseaux-sociaux-le-gouvernement-a-une-nouvelle-cible</link>
      <pubDate>Fri, 30 Jan 2026 14:55:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/politique/2961635_les-vpn-cest-le-prochain-sujet-sur-ma-liste-apres-les-reseaux-sociaux-le-gouvernement-a-une-nouvelle-cible</guid>
      <description>
Apr&#232;s l'interdiction des r&#233;seaux sociaux aux moins de 15 ans, le gouvernement veut se concentrer sur les VPN, pour &#233;viter tout contournement de la loi.
</description>
    </item>
    <item>
      <title>Panne mondiale chez Garmin : pourquoi des milliers d&#8217;utilisateurs ont perdu leurs donn&#233;es</title>
      <link>https://www.frandroid.com/marques/garmin/2960913_panne-majeure-chez-garmin-pourquoi-des-milliers-dutilisateurs-diphone-nont-plus-acces-a-leurs-donnees</link>
      <pubDate>Fri, 30 Jan 2026 14:55:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/garmin/2960913_panne-majeure-chez-garmin-pourquoi-des-milliers-dutilisateurs-diphone-nont-plus-acces-a-leurs-donnees</guid>
      <description>
Ce jeudi soir, une mise &#224; jour de l'application Garmin Connect sur iPhone a emp&#234;ch&#233; de nombreux utilisateurs de connecter leur montre &#224; leur t&#233;l&#233;phone. 
</description>
    </item>
    <item>
      <title>Pas vraiment une montre connect&#233;e, pas vraiment une bague&#8230; ce produit hybride vient casser les codes</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/bagues-connectees/2961027_cette-montre-connectee-se-porte-a-votre-doigt-comme-une-bague-connectee</link>
      <pubDate>Fri, 30 Jan 2026 14:54:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/bagues-connectees/2961027_cette-montre-connectee-se-porte-a-votre-doigt-comme-une-bague-connectee</guid>
      <description>
La marque Rogbid a pr&#233;sent&#233; une bague connect&#233;e tr&#232;s originale, aux allures de montre connect&#233;e avec un &#233;cran et un bracelet ajustable. 
</description>
    </item>
    <item>
      <title>Les meilleures tablettes tactiles n&#8217;&#233;chappent pas aux soldes d&#8217;hiver. Voici les 11 meilleurs bons plans de la derni&#232;re d&#233;marque</title>
      <link>https://www.frandroid.com/bons-plans/2941463_les-meilleures-tablettes-tactiles-nechappent-pas-aux-soldes-dhiver-voici-les-11-meilleurs-bons-plans-de-la-derniere-demarque</link>
      <pubDate>Fri, 30 Jan 2026 14:52:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2941463_les-meilleures-tablettes-tactiles-nechappent-pas-aux-soldes-dhiver-voici-les-11-meilleurs-bons-plans-de-la-derniere-demarque</guid>
      <description>
Pour la derni&#232;re d&#233;marque des soldes d'hiver, les tablettes tactiles se mettent le mieux possible en avant avec des r&#233;ductions sans commune mesure. Boud&#233;s il n'y a pas si longtemps encore, ces appareils ont maintenant les faveurs des consommateurs, notamment pendant les soldes d'hiver.
</description>
    </item>
    <item>
      <title>Le salon n&#176;1 du v&#233;lo Eurobike perd (encore) un des plus gros acteurs mondiaux : Schwalbe</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2961693_le-salon-n1-du-velo-eurobike-perd-encore-un-des-plus-gros-acteurs-mondiaux-schwalbe</link>
      <pubDate>Fri, 30 Jan 2026 14:45:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2961693_le-salon-n1-du-velo-eurobike-perd-encore-un-des-plus-gros-acteurs-mondiaux-schwalbe</guid>
      <description>
Apr&#232;s Bosch, les pneus Schwalbe ou les antivols Abus, le salon Eurobike 2026 voit le retrait de Shimano, qui n&#8217;y pr&#233;sentera pas ses nouveaut&#233;s transmissions, freins et moteurs de v&#233;los &#233;lectriques.
</description>
    </item>
    <item>
      <title>Bonne surprise pour la Pixel Tablet qui b&#233;n&#233;ficie de plus de mises &#224; jour que pr&#233;vu</title>
      <link>https://www.01net.com/actualites/bonne-surprise-pour-la-pixel-tablet-qui-beneficie-de-plus-de-mises-a-jour-que-prevu.html</link>
      <pubDate>Fri, 30 Jan 2026 14:43:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323515</guid>
      <description>Les bonnes nouvelles sont rares pour les utilisateurs de tablettes Pixel, alors autant se r&#233;jouir de celle-ci : Google &#233;tend la dur&#233;e du support logiciel jusqu'en juin 2028, pour un total de cinq ans de mises &#224; jour de s&#233;curit&#233; et pour Android. &#192; l'origine, le support &#233;tait de trois ans seulement.</description>
    </item>
    <item>
      <title>Prix divis&#233;s par deux, dur&#233;e de vie doubl&#233;e : voici &#224; quoi ressembleront les panneaux solaires dans quelques ann&#233;es</title>
      <link>https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2961031_prix-divises-par-deux-duree-de-vie-doublee-voici-a-quoi-ressembleront-les-panneaux-solaires-dans-quelques-annees</link>
      <pubDate>Fri, 30 Jan 2026 14:39:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2961031_prix-divises-par-deux-duree-de-vie-doublee-voici-a-quoi-ressembleront-les-panneaux-solaires-dans-quelques-annees</guid>
      <description>
Nous sommes &#224; l&#8217;aube d&#8217;une nouvelle &#232;re pour le solaire. Selon une nouvelle recherche, le futur de la fili&#232;re sera marqu&#233; par l&#8217;arriv&#233;e de g&#233;n&#233;rations de panneaux beaucoup plus performants. D&#8217;ailleurs, ce qui constitue aujourd&#8217;hui un record pourrait bien devenir un standard du march&#233;.
</description>
    </item>
    <item>
      <title>Kindle Colorsoft : Amazon brade &#224; -26 % sa liseuse dot&#233;e d&#8217;un &#233;cran couleur pendant les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2767511_kindle-colorsoft-amazon-brade-a-26-sa-liseuse-dotee-dun-ecran-couleur-pendant-les-soldes</link>
      <pubDate>Fri, 30 Jan 2026 14:39:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2767511_kindle-colorsoft-amazon-brade-a-26-sa-liseuse-dotee-dun-ecran-couleur-pendant-les-soldes</guid>
      <description>
Amazon a lanc&#233; en juillet dernier une Kindle Colorsoft dot&#233;e d'un stockage de 16 Go, et non de 32 Go comme la premi&#232;re version. Si son prix de d&#233;part &#233;tait d&#233;j&#224; moins &#233;lev&#233; que le mod&#232;le pr&#233;c&#233;dent, il est encore plus bas actuellement pendant les soldes : 199,99 euros au lieu de 269,99 euros.
</description>
    </item>
    <item>
      <title>Engadget Podcast: What do prediction markets like Kalshi cost us?</title>
      <link>https://www.engadget.com/general/engadget-podcast-what-do-prediction-markets-like-kalshi-cost-us-143113799.html?src=rss</link>
      <pubDate>Fri, 30 Jan 2026 14:31:13 +0000</pubDate>
      <guid isPermaLink="false">9da64da2-5287-4bf5-a212-50110286f857</guid>
      <description>Somehow, we live in a world where people can bet on practically anything using sites like Polymarket and Kalshi. In this episode, Devindra and Engadget Senior Reporter Karissa Bell dive into the world of prediction markets. How did we get here? And is endless betting having an effect on the real world? Also, we chat about the new American version of TikTok, which stumbled during its first weekend with a litany of errors and reported censorship.Subscribe!iTunesSpotifyPocket CastsStitcherGoogle PodcastsTopicsWho&#8217;s going to buy the Samsung Galaxy Z Tri-fold for $2900? &#8211; 1:18Tesla is killing off t...</description>
    </item>
    <item>
      <title>6 Best Beard Trimmers (2026): Full Beards, Hair, Stubble</title>
      <link>https://www.wired.com/gallery/best-beard-trimmers/</link>
      <pubDate>Fri, 30 Jan 2026 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">648b15244a854832b16fd1ff</guid>
      <description>WIRED has been testing beard trimmers for six years. Our favorite is compact, reliable, ridiculously adjustable, and offers a five-year warranty.</description>
    </item>
    <item>
      <title>I&#8217;ve found three laptop deals for creatives and professionals that are way too good for this early in the year &#8212; huge savings on portable powerhouses from MSI, HP, and Acer (but they won&#8217;t stay this price for long)</title>
      <link>https://www.techradar.com/pro/ive-found-three-laptop-deals-for-creatives-and-professionals-that-are-way-too-good-for-this-early-in-the-year-huge-savings-on-portable-powerhouses-from-msi-hp-and-acer-but-they-wont-stay-this-cheap-for-long</link>
      <pubDate>Fri, 30 Jan 2026 14:29:08 +0000</pubDate>
      <guid isPermaLink="false">yckVFqGDhiSkDbsKtNsW4e</guid>
      <description>These three high-end creator laptops from MSI, Acer, and HP are massively discounted right now, with RTX GPUs, Core Ultra CPUs, and serious specs.</description>
    </item>
    <item>
      <title>Blackview Triple Laptop Screen Extender will make you feel like you work for NASA, and it's priced under $250 right now</title>
      <link>https://www.techradar.com/pro/blackview-triple-laptop-screen-extender-will-make-you-feel-like-you-work-for-nasa-and-its-priced-under-usd250-right-now</link>
      <pubDate>Fri, 30 Jan 2026 14:28:53 +0000</pubDate>
      <guid isPermaLink="false">t4L4BQdFHnAAjsNCLfSDAW</guid>
      <description>The Blackview triple laptop screen extender adds two 14-inch 1080p IPS displays to your existing laptop and is 38% off right now.</description>
    </item>
    <item>
      <title>What a deal! Samsung&#8217;s 27-inch 4K monitor with an adjustable stand and 3-year warranty is under $200 &#8212; but this price won&#8217;t last long</title>
      <link>https://www.techradar.com/pro/what-a-deal-samsungs-27-inch-4k-monitor-with-an-adjustable-stand-and-3-year-warranty-is-under-usd200-but-this-price-wont-last-long</link>
      <pubDate>Fri, 30 Jan 2026 14:28:22 +0000</pubDate>
      <guid isPermaLink="false">wEEezMZpHVKviDgVgBrpwK</guid>
      <description>Samsung's 27-inch ViewFinity S8 monitor delivers a sharp 4K display with a fully adjustable stand and it's just got a $220 discount.</description>
    </item>
    <item>
      <title>Microsoft Teams will now let your company add its own branded reactions, and I can't possibly foresee this going wrong at all</title>
      <link>https://www.techradar.com/pro/microsoft-teams-will-now-let-your-company-add-its-own-branded-reactions-and-i-cant-possibly-foresee-this-going-wrong-at-all</link>
      <pubDate>Fri, 30 Jan 2026 14:25:00 +0000</pubDate>
      <guid isPermaLink="false">nP3WRJRRgATjDyvKKRBTiQ</guid>
      <description>'Branded Meeting Reactions' are coming to Microsoft Teams soon, so get ready for that.</description>
    </item>
    <item>
      <title>JBL just gave one of world's most legendary stereo speakers a refresh &#8212; but still in the same awesome &#8217;70s design</title>
      <link>https://www.techradar.com/audio/speakers/jbl-just-gave-one-of-worlds-most-legendary-stereo-speakers-a-refresh-but-still-in-the-same-awesome-70s-design</link>
      <pubDate>Fri, 30 Jan 2026 14:21:22 +0000</pubDate>
      <guid isPermaLink="false">h4Ujgia2mXZKU8A4Y46gTB</guid>
      <description>JBL's much-loved hi-fi speakers are back in a strictly limited edition</description>
    </item>
    <item>
      <title>I&#8217;ve covered Super Bowl TV sales for 8 years &#8212; these are the deals I&#8217;d actually buy on 4K, QLED, and OLED displays</title>
      <link>https://www.techradar.com/live/news/best-super-bowl-tv-deals-2026</link>
      <pubDate>Fri, 30 Jan 2026 14:11:35 +0000</pubDate>
      <guid isPermaLink="false">2mPHSxtNLZQrPjtrTZAuf8</guid>
      <description>This is my 8th year covering Super Bowl TV sales, and you can shop my top recommendations to watch the game from brands like Samsung, LG, Sony, and more.</description>
    </item>
    <item>
      <title>The Currys New Year sale is about to end &#8212; I've found the 14 best deals worth buying before next week</title>
      <link>https://www.techradar.com/seasonal-sales/the-currys-new-year-sale-is-about-to-end-ive-found-the-14-best-deals-worth-buying-before-next-week</link>
      <pubDate>Fri, 30 Jan 2026 14:07:01 +0000</pubDate>
      <guid isPermaLink="false">reSVgZC5yiZoQVzVjbFhNP</guid>
      <description>I've taken one last look through the Currys New Year sale and hand-picked the 14 best deals that I'd buy before it ends next week.</description>
    </item>
    <item>
      <title>Moon phase today: What the Moon will look like on January 30</title>
      <link>https://mashable.com/article/moon-phase-today-jan-30</link>
      <pubDate>Fri, 30 Jan 2026 14:06:44 +0000</pubDate>
      <guid isPermaLink="false">00tS8D71c4PyzxRllbyy6m6</guid>
      <description>See the Moon phase expected for January 30, 2025 as well as when the next Full Moon is expected.</description>
    </item>
    <item>
      <title>Pick up this Samsung microSD Express card while it's on sale for $40 off</title>
      <link>https://www.engadget.com/deals/pick-up-this-samsung-microsd-express-card-while-its-on-sale-for-40-off-143849979.html?src=rss</link>
      <pubDate>Fri, 30 Jan 2026 14:05:35 +0000</pubDate>
      <guid isPermaLink="false">b7c1c9b1-8762-4b3b-bd34-558e13eba66f</guid>
      <description>If you're looking to expand the storage on your Switch 2, the 512GB Samsung P9 microSD Express card is on sale right now for 33 percent off, marked down to $80 from $120. With component prices skyrocketing these days, it's getting increasingly rare to see good storage on sale, and 512GB for $80 is a much better deal than you'll currently find directly from Nintendo.


The P9 boasts transfer speeds of up to 800MB/s, making moving games to the card that much faster. As for load times, in our testing we found that any microSD Express, the standard the Switch 2 requires, will offer roughly the sam...</description>
    </item>
    <item>
      <title>The Best Soundbars We&#8217;ve Tested: Sonos, Sony, Bose, and More</title>
      <link>https://www.wired.com/gallery/best-soundbars/</link>
      <pubDate>Fri, 30 Jan 2026 14:04:00 +0000</pubDate>
      <guid isPermaLink="false">5ba9532c0f3ae02cf6c58ef4</guid>
      <description>Every television deserves a row of speakers to call its own. These are our favorite soundbars from Samsung, Yamaha, Bose, and more.</description>
    </item>
    <item>
      <title>NordVPN blocks 92% malicious sites in independent phishing test</title>
      <link>https://www.techradar.com/vpn/vpn-services/nordvpn-blocks-92-percent-malicious-sites-in-independent-phishing-test</link>
      <pubDate>Fri, 30 Jan 2026 14:03:38 +0000</pubDate>
      <guid isPermaLink="false">zwkSgafPCUBAXD2uvxLLi</guid>
      <description>NordVPN's Threat Protection Pro has once again earned top marks in a phishing test conducted by AV-Comparatives, after receiving its first certificate of approval in 2024.</description>
    </item>
    <item>
      <title>Amazon&#8217;s &#8216;God of War&#8217; Show Finds Itself Some More Norse Gods</title>
      <link>https://gizmodo.com/amazon-god-of-war-tv-show-odin-thor-casting-2000715847</link>
      <pubDate>Fri, 30 Jan 2026 14:00:14 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715847</guid>
      <description>Plus, could the Scarlet Witch finally be getting a solo film?</description>
    </item>
    <item>
      <title>I wear lots of technology for a living, ask me anything</title>
      <link>https://www.theverge.com/column/870394/i-wear-lots-of-technology-for-a-living-ask-me-anything</link>
      <pubDate>2026-01-30T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=870394</guid>
      <description>Hello, friends. It's time for another exclusive AMA for Verge subscribers, and this time, I'll be your host. I cover everything from wearables to dystopian cursed tech like at-home urine labs and belligerent AI companions. At times, my job calls for flirting with Grok's AI girlfriend for 24 hours or coercing weird AI video apps [&#8230;]</description>
    </item>
    <item>
      <title>Parenting in ICE-occupied Minneapolis</title>
      <link>https://www.theverge.com/policy/870720/ice-minneapolis-parenting-liam-conejo-ramos</link>
      <pubDate>2026-01-30T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=870720</guid>
      <description>Last Saturday, I received an email from the Children's Theatre Company of Minnesota. They explained that they were canceling the weekend's performances of Go, Dog. Go! "for the safety of our patrons, staff, and artists." Earlier that morning, federal agents had killed Alex Pretti in the streets, about nine blocks away from the theater's doors. [&#8230;]</description>
    </item>
    <item>
      <title>What is the release date for A Knight of the Seven Kingdoms episode 3 on HBO Max?</title>
      <link>https://www.techradar.com/streaming/hbo-max/what-is-the-release-date-for-a-knight-of-the-seven-kingdoms-episode-3-on-hbo-max</link>
      <pubDate>Fri, 30 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">jPPhfaUuAn5SaMBFzfYQYe</guid>
      <description>A Knight of the Seven Kingdoms' third episode arrives very soon &#8211; and this is where and when you can watch it.</description>
    </item>
    <item>
      <title>Marquis confirms data breach, point finger of blame at SonicWall firewall</title>
      <link>https://www.techradar.com/pro/security/marquis-confirms-data-breach-point-finger-of-blame-at-sonicwall-firewall</link>
      <pubDate>Fri, 30 Jan 2026 13:58:57 +0000</pubDate>
      <guid isPermaLink="false">tN5QZv8RqNXkHsZkDF4QKJ</guid>
      <description>Marquis wants SonicWall to pay for the damages, but firewall maker asks for proof that two incidents are linked.</description>
    </item>
    <item>
      <title>Gold and silver prices fall as Trump names Kevin Warsh as his Fed Chair pick. Why are precious metals down?</title>
      <link>https://www.fastcompany.com/91484093/gold-and-silver-prices-fall-as-trump-names-kevin-warsh-as-his-fed-chair-pick-why-are-precious-metals-down</link>
      <pubDate>2026-01-30T13:58:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91484093/gold-and-silver-prices-fall-as-trump-names-kevin-warsh-as-his-fed-chair-pick-why-are-precious-metals-down</guid>
      <description>Investors have been parking their money in safe-haven assets for months. Could a stronger dollar and changes at the Fed reverse that trend?
Gold and silver have had an exceptional year, breaking record high prices on what&#8217;s felt like a daily basis. But, as the saying goes, what comes up must come down.&#160;</description>
    </item>
    <item>
      <title>Dyson, Roborock, Dreame&#8230; Les aspirateurs-robots et balais sont &#224; leur meilleur prix pendant la derni&#232;re d&#233;marque des soldes !</title>
      <link>https://www.frandroid.com/bons-plans/2941951_dyson-roborock-dreame-les-aspirateurs-robots-et-balais-sont-a-leur-meilleur-prix-pendant-la-derniere-demarque-des-soldes</link>
      <pubDate>Fri, 30 Jan 2026 13:51:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2941951_dyson-roborock-dreame-les-aspirateurs-robots-et-balais-sont-a-leur-meilleur-prix-pendant-la-derniere-demarque-des-soldes</guid>
      <description>
Dans un quotidien bien rempli, les aspirateurs-robots repr&#233;sentent un v&#233;ritable gain de temps puisque d&#233;poussi&#233;rer, aspirer et laver &#224; votre place, c'est leur rayon. Et si confier la t&#226;che &#224; un robot autonome n'est pas possible, les aspirateurs-balais se distinguent &#233;galement par leur efficacit&#233;.
</description>
    </item>
    <item>
      <title>Gold Has Been Acting More Like Bitcoin Lately</title>
      <link>https://gizmodo.com/gold-has-been-acting-more-like-bitcoin-lately-2000715946</link>
      <pubDate>Fri, 30 Jan 2026 13:50:55 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715946</guid>
      <description>Gold added more than two entire Bitcoin market caps in 72 Hours.</description>
    </item>
    <item>
      <title>Le projet Genie de Google g&#233;n&#232;re des jeux vid&#233;o en 3D, mais pour faire quoi&#160;?</title>
      <link>https://www.01net.com/actualites/le-projet-genie-de-google-genere-des-jeux-video-en-3d-mais-pour-faire-quoi.html</link>
      <pubDate>Fri, 30 Jan 2026 13:49:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323503</guid>
      <description>Google s'enfonce toujours plus profond&#233;ment dans l'&#171;&#160;AI slop&#160;&#187; avec le projet Genie, qui permet de cr&#233;er des mondes en 3D &#224; explorer, le tout &#224; partir d'une simple requ&#234;te texte. Les r&#233;sultats impressionnent, mais l'int&#233;r&#234;t demeure tout de m&#234;me tr&#232;s t&#233;nu, sans oublier les questions d&#233;licates de propri&#233;t&#233; intellectuelle.</description>
    </item>
    <item>
      <title>Apple&#8217;s iPhone sales broke a new quarterly record during the holidays, despite AI blunders</title>
      <link>https://www.fastcompany.com/91484131/apples-iphone-sales-broke-new-quarterly-record-during-holidays-despite-ai-blunders</link>
      <pubDate>2026-01-30T13:47:17</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91484131/apples-iphone-sales-broke-new-quarterly-record-during-holidays-despite-ai-blunders</guid>
      <description>Sales for the three-month stretch were their highest since the device&#8217;s launch in 2007.
Apple&#8217;s iPhone sales soared to a new quarterly record during the holiday season, despite artificial intelligence blunders that prompted the technology trendsetter to get a helping hand from Google.The October-December results announced Thursday reflect the allegiance of Apple&#8217;s fans, who eagerly snapped up the latest iPhone 17 models even though the company still hasn&#8217;t delivered on its 2024 promise to smarten up the device&#8217;s Siri assistance with AI.Apple tried to offset its AI miscues with a new &#8220;liquid gl...</description>
    </item>
    <item>
      <title>'Infinite Jest' Is Back. Maybe Litbros Should Be, Too</title>
      <link>https://www.wired.com/story/infinite-jest-is-back-if-only-litbros-were-too/</link>
      <pubDate>Fri, 30 Jan 2026 13:47:14 +0000</pubDate>
      <guid isPermaLink="false">6977a7eb0c4fac9fd209f15c</guid>
      <description>The notoriously challenging book is being re-released for its 30th anniversary. Its fandom is annoying, sure&#8212;but at least they read.</description>
    </item>
    <item>
      <title>The Disney+ and Hulu bundle is on sale for $10 for one month</title>
      <link>https://www.engadget.com/deals/the-disney-and-hulu-bundle-is-on-sale-for-10-for-one-month-192814872.html?src=rss</link>
      <pubDate>Fri, 30 Jan 2026 13:46:28 +0000</pubDate>
      <guid isPermaLink="false">c4b6e8a2-981f-4fc9-b476-d49dcaeed4ba</guid>
      <description>You have the best chance to save on streaming services during the holiday shopping season, but throughout the year, the occasional deal pops up that's worth considering. Case in point: this new Disney+ deal. New and eligible returning subscribers can sign up for the Disney+ Hulu bundle (with ads) for $10 for one month of access. That's $3 off the usual price of the bundle for one month, and more than 58 percent off if you consider the cost of each service individually (Disney+ at $12 per month and, separately, Hulu also at $12 per month).
We'd be remiss if we didn't mention that this isn't qui...</description>
    </item>
    <item>
      <title>Amazon solde &#224; un super prix le g&#233;ant TV Mini-LED 75 pouces (avec HDMI 2.1) de Xiaomi</title>
      <link>https://www.frandroid.com/bons-plans/2766823_amazon-solde-a-un-super-prix-le-geant-tv-mini-led-75-pouces-avec-hdmi-2-1-de-xiaomi</link>
      <pubDate>Fri, 30 Jan 2026 13:43:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2766823_amazon-solde-a-un-super-prix-le-geant-tv-mini-led-75-pouces-avec-hdmi-2-1-de-xiaomi</guid>
      <description>
Annonc&#233; fin 2024, le Xiaomi TV S Mini LED 75 est un t&#233;l&#233;viseur complet qui cumule les atouts : dalle 4K Mini LED, ports HDMI 2.1, support d'un taux de rafra&#238;chissement de 144 Hz... Et pourtant, son prix est assez contenu : Amazon l'affiche &#224; 799 euros au lieu de 1 099 euros pour la fin des soldes d'hiver 2026.
</description>
    </item>
  </channel>
</rss>
