<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 18 Nov 2025 16:56:17 GMT</lastBuildDate>
    <item>
      <title>The Apple Watch Series 11 has plunged to a record low price</title>
      <link>https://www.theverge.com/tech/823052/apple-watch-series-11-onn-4k-pro-deal-sale</link>
      <pubDate>2025-11-18T11:52:56-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=823052</guid>
      <description>The latest Apple Watch SE impressed us with all of its upgrades this year, but the Apple Watch Series 11 is still the better option if you&#8217;re an iPhone owner who requires more advanced health notifications. Thankfully it, like the SE,&#160; is now down to a new record-low price, starting at $349.99 ($50 off) at [&#8230;]</description>
    </item>
    <item>
      <title>Google d&#233;voile Gemini 3 et s&#8217;attaque de front &#224; ChatGPT 5.1</title>
      <link>https://www.01net.com/actualites/google-devoile-gemini-3-attaque-front-chatgpt-5-1.html</link>
      <pubDate>Tue, 18 Nov 2025 16:49:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309037</guid>
      <description>Google d&#233;voile Gemini 3, son mod&#232;le d&#8217;intelligence artificielle le plus avanc&#233; &#224; ce jour. Plus performant que jamais, il comprend mieux le texte, les images et les vid&#233;os, automatise des t&#226;ches complexes et explose tous les benchmarks.</description>
    </item>
    <item>
      <title>Analogue 3D Review: The Console Your N64 Games Deserve</title>
      <link>https://gizmodo.com/analogue-3d-review-console-your-n64-games-deserve-2000687239</link>
      <pubDate>Tue, 18 Nov 2025 16:49:15 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687239</guid>
      <description>It's the best way to play your Nintendo 64's physical back catalog without running out and buying a CRT TV.</description>
    </item>
    <item>
      <title>Google CEO Admits &#8216;Elements of Irrationality&#8217; Have Led to an AI Bubble</title>
      <link>https://gizmodo.com/google-ceo-admits-elements-of-irrationality-have-created-an-ai-bubble-2000687447</link>
      <pubDate>Tue, 18 Nov 2025 16:45:09 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687447</guid>
      <description>No company is safe, Google CEO Sundar Pichai says.</description>
    </item>
    <item>
      <title>Valve's Steam Machine could be more powerful than we think &#8211; it'll outgun 70% of gaming PCs on Steam anyway</title>
      <link>https://www.techradar.com/gaming/pc-gaming/valves-steam-machine-could-be-more-powerful-than-we-think-itll-outgun-70-percent-of-gaming-pcs-on-steam-anyway</link>
      <pubDate>Tue, 18 Nov 2025 16:42:29 +0000</pubDate>
      <guid isPermaLink="false">3E7FHaMfybQg2QdBs8eHB</guid>
      <description>From the way Valve is spinning the discussion around the specs, I'm inclined to believe this mini PC will be good enough.</description>
    </item>
    <item>
      <title>Comment essayer Gemini 3 sur Google en France d&#232;s aujourd&#8217;hui&#160;?</title>
      <link>https://www.frandroid.com/marques/google/2873739_comment-essayer-gemini-3-sur-google-en-france-des-aujourdhui</link>
      <pubDate>Tue, 18 Nov 2025 16:40:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2873739_comment-essayer-gemini-3-sur-google-en-france-des-aujourdhui</guid>
      <description>
Gemini 3 est l&#224;. Google a d&#233;voil&#233; ce mardi 18 novembre 2025 le tout nouveau mod&#232;le de son chatbot qui va notamment donner vie &#224; son moteur de recherche. Le d&#233;ploiement d&#233;bute d&#232;s maintenant, y compris sans payer d'abonnement.
</description>
    </item>
    <item>
      <title>L&#8217;iPhone 17 &#224; 849 euros : c&#8217;est simple, vous ne trouverez pas moins cher pour le Black Friday [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2871699_liphone-17-a-849-euros-cest-simple-vous-ne-trouverez-pas-moins-cher-pour-le-black-friday</link>
      <pubDate>Tue, 18 Nov 2025 16:39:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2871699_liphone-17-a-849-euros-cest-simple-vous-ne-trouverez-pas-moins-cher-pour-le-black-friday</guid>
      <description>
La p&#233;riode du Black Friday voit toujours &#233;merger de tr&#232;s belles offres. C&#8217;est par exemple le cas avec l&#8217;iPhone 17 qui est actuellement sous la barre des 850 euros. Mais pour combien de temps encore ?
</description>
    </item>
    <item>
      <title>PS5 Slim ou PS5 Pro&#160;: quelle PS5 choisir&#8201;?</title>
      <link>https://www.frandroid.com/marques/sony/767530_ps5-ou-ps5-digital-edition-quel-modele-choisir</link>
      <pubDate>Tue, 18 Nov 2025 16:38:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/767530_ps5-ou-ps5-digital-edition-quel-modele-choisir</guid>
      <description>
Sony propose &#224; pr&#233;sent deux mod&#232;les de consoles de jeu, la PS5 Slim, venue remplacer le mod&#232;le originel, et la PS5 Pro. Quelles sont les diff&#233;rences&#8201;? Quelle console PlayStation 5 choisir, pour vous ou pour offrir ? On fait le point dans ce comparatif.
</description>
    </item>
    <item>
      <title>WhatsApp&#160;: une &#233;norme faille expose 3,5 milliards de num&#233;ros de mobile, dont le v&#244;tre</title>
      <link>https://www.01net.com/actualites/whatsapp-une-enorme-faille-expose-35-milliards-de-numeros-de-mobile-dont-le-votre.html</link>
      <pubDate>Tue, 18 Nov 2025 16:37:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309062</guid>
      <description>Des chercheurs en s&#233;curit&#233; ont mis au jour une faille b&#233;ante qui leur a permis d&#8217;extraire quelque 3,5 milliards de num&#233;ros de t&#233;l&#233;phone d&#8217;utilisateurs de WhatsApp.</description>
    </item>
    <item>
      <title>Looking for powerful Web Hosting software? Cloudways could be your answer this Black Friday</title>
      <link>https://www.techradar.com/pro/looking-for-powerful-web-hosting-software-cloudways-could-be-your-answer-this-black-friday</link>
      <pubDate>Tue, 18 Nov 2025 16:37:00 +0000</pubDate>
      <guid isPermaLink="false">efJJmd9fScy7wDQwswNoui</guid>
      <description>Enjoy half-off Cloudways for Black Friday</description>
    </item>
    <item>
      <title>Roblox&#160;: tous les utilisateurs, y compris les enfants, devront scanner leur visage pour pouvoir discuter</title>
      <link>https://www.01net.com/actualites/roblox-tous-les-utilisateurs-y-compris-les-enfants-devront-scanner-leur-visage-pour-pouvoir-discuter.html</link>
      <pubDate>Tue, 18 Nov 2025 16:35:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309064</guid>
      <description>Pour pouvoir discuter dans Roblox, il va falloir montrer patte blanche. La plateforme de jeux et de communication va en effet v&#233;rifier l'&#226;ge des utilisateurs pour acc&#233;der aux fonctions de discussion, qui est une de ses principales fonctionnalit&#233;s. Cela va passer par un selfie vid&#233;o.</description>
    </item>
    <item>
      <title>Black Friday smartphones pas chers : les Google Pixel et Galaxy S25 tombent sous la barre des 500 euros</title>
      <link>https://www.frandroid.com/bons-plans/2856691_meilleurs-deals-smartphones-pas-chers-500-euros</link>
      <pubDate>Tue, 18 Nov 2025 16:35:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2856691_meilleurs-deals-smartphones-pas-chers-500-euros</guid>
      <description>
Le Black Friday approche. La rubrique bons plans de Frandroid ne d&#233;semplit pas face aux vagues de promotions sur les smartphones. Il n'a jamais &#233;t&#233; aussi ais&#233; de trouv&#233; un smartphone, m&#234;me haut de gamme, &#224; moins de 500 euros. Pour vous en convaincre, voici le top des offres.
</description>
    </item>
    <item>
      <title>Get a touchscreen Windows laptop for under $400 with this excellent Black Friday deal</title>
      <link>https://www.techradar.com/computing/get-a-touchscreen-windows-laptop-for-under-usd400-with-this-excellent-black-friday-deal</link>
      <pubDate>Tue, 18 Nov 2025 16:32:55 +0000</pubDate>
      <guid isPermaLink="false">RgzzYisFgsBNpWe8eFkwf3</guid>
      <description>The HP Laptop 15 has had a 20% price cut, letting you get one for just $400.</description>
    </item>
    <item>
      <title>The Echo Aviation Controller puts a flight simulator in your hands</title>
      <link>https://www.theverge.com/news/823018/honeycomb-aeronautical-echo-aviation-controller-gamepad-pc-flight-simulator</link>
      <pubDate>2025-11-18T11:32:01-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=823018</guid>
      <description>Honeycomb Aeronautical, a company that makes flight simulator accessories like flight sticks&#160; and pedals that can turn your desk into a cockpit, has announced a compact alternative for PC pilots with limited room. Its upcoming Echo Aviation Controller is about the size of a console gamepad but squeezes standard features like joysticks and buttons to [&#8230;]...</description>
    </item>
    <item>
      <title>01net Awards&#160;: les votes du public sont lanc&#233;s, &#233;lisez vos meilleurs produits tech 2025</title>
      <link>https://www.01net.com/actualites/votes-01net-awards-2025-prix-lecteurs.html</link>
      <pubDate>Tue, 18 Nov 2025 16:31:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308976</guid>
      <description>C'est le moment de voter pour les produits qui vous ont marqu&#233; en 2025 !</description>
    </item>
    <item>
      <title>13 offres PC portables immanquables du pr&#233; Black Friday : MSI, Apple, HP, Asus &amp; Co sont au rendez-vous</title>
      <link>https://www.frandroid.com/bons-plans/2848587_black-friday-pc-portable-la-selection-des-11-meilleures-offres-sur-les-laptops-bureautiques-et-gaming-dapple-msi-lenovo</link>
      <pubDate>Tue, 18 Nov 2025 16:31:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848587_black-friday-pc-portable-la-selection-des-11-meilleures-offres-sur-les-laptops-bureautiques-et-gaming-dapple-msi-lenovo</guid>
      <description>
Besoin d&#8217;un nouveau PC portable ? Que vous recherchiez un ordinateur bureautique ou un mod&#232;le taill&#233; pour le gaming, il y en a pour tous les go&#251;ts durant l&#8217;avant-premi&#232;re du Black Friday. Les marques phares comme Apple, Asus, HP, Lenovo ou encore MSI affichent d&#233;j&#224; de belles r&#233;ductions, pour tous les budgets et tous les usages.
</description>
    </item>
    <item>
      <title>One of the best cheap Bluetooth speaker makers just revealed a rival to the JBL Go 4 &#8211; here's why it caught our eye</title>
      <link>https://www.techradar.com/audio/wireless-bluetooth-speakers/one-of-the-best-cheap-bluetooth-speaker-makers-just-revealed-a-rival-to-the-jbl-go-4-heres-why-it-caught-our-eye</link>
      <pubDate>Tue, 18 Nov 2025 16:30:00 +0000</pubDate>
      <guid isPermaLink="false">SManmC4mxci5mqEVTc8thM</guid>
      <description>The TRIBIT PocketGo brings you a compact Bluetooth speaker with 'mighty sound', for not much money at all.</description>
    </item>
    <item>
      <title>Ce smartphone en promo &#224; moins de 300 &#8364; pour le pr&#233;-Black Friday a tout pour plaire (&#233;cran Oled 120 Hz, 3 capteurs photo&#8230;)</title>
      <link>https://www.frandroid.com/bons-plans/2873693_ce-smartphone-en-promo-a-moins-de-300-e-pour-le-pre-black-friday-a-tout-pour-plaire-ecran-oled-120-hz-3-capteurs-photo</link>
      <pubDate>Tue, 18 Nov 2025 16:22:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2873693_ce-smartphone-en-promo-a-moins-de-300-e-pour-le-pre-black-friday-a-tout-pour-plaire-ecran-oled-120-hz-3-capteurs-photo</guid>
      <description>
Si vous cherchez un bon smartphone au form factor fin, le Motorola Edge pourrait &#234;tre le candidat id&#233;al. Surtout avec la r&#233;duction du pr&#233;-Black Friday qui le fait passer de 499 euros &#224; 299 euros sur Amazon.
</description>
    </item>
    <item>
      <title>This is not a drill &#8211; the best gaming monitor I've ever tested has hit a lowest-ever price for Black Friday</title>
      <link>https://www.techradar.com/gaming/this-is-not-a-drill-the-best-gaming-monitor-ive-ever-tested-has-hit-a-lowest-ever-price-for-black-friday</link>
      <pubDate>Tue, 18 Nov 2025 16:18:50 +0000</pubDate>
      <guid isPermaLink="false">5zUJ7Cvoj2Ru5DwHmZi7WH</guid>
      <description>The Sony Inzone M10S has had its price slashed for Black Friday.</description>
    </item>
    <item>
      <title>Nintendo Switch 2 Pro Controller vs Nintendo Switch Pro Controller - which should you buy this Black Friday?</title>
      <link>https://www.techradar.com/gaming/nintendo-switch-2-pro-controller-vs-nintendo-switch-pro-controller</link>
      <pubDate>Tue, 18 Nov 2025 16:14:48 +0000</pubDate>
      <guid isPermaLink="false">Dqr2uTacQFP5UH7rwq7sj6</guid>
      <description>Learn the pros and cons of each Nintendo Switch Pro Controller in our handy guide.</description>
    </item>
    <item>
      <title>Sony announces its Black Friday PlayStation deals which include savings across PS5 consoles, DualSense controllers, PlayStation Portal, a host of games, and PlayStation Plus</title>
      <link>https://www.techradar.com/gaming/sony-announces-its-black-friday-playstation-deals-which-include-savings-across-ps5-consoles-dualsense-controllers-playstation-portal-a-host-of-games-and-playstation-plus</link>
      <pubDate>Tue, 18 Nov 2025 16:10:39 +0000</pubDate>
      <guid isPermaLink="false">qCCY9FbEhfafCZXmB37uaW</guid>
      <description>Sony's annual Black Friday sale has been announced, and this year, PS5 consoles, software, and more PlayStation hardware will see a significant price cut.</description>
    </item>
    <item>
      <title>Google Antigravity : ce n&#8217;est pas un OS pour d&#233;veloppeurs, mais &#231;a y ressemble furieusement</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2873689_google-antigravity-ce-nest-pas-un-os-pour-developpeurs-mais-ca-y-ressemble-furieusement</link>
      <pubDate>Tue, 18 Nov 2025 16:10:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2873689_google-antigravity-ce-nest-pas-un-os-pour-developpeurs-mais-ca-y-ressemble-furieusement</guid>
      <description>
Tout le monde regarde Gemini 3 et ses scores d&#233;lirants sur les benchmarks. C'est une erreur. La v&#233;ritable annonce de Google aujourd'hui s'appelle Antigravity. Ce n'est plus un chatbot, c'est un environnement o&#249; l'IA a les mains libres sur votre terminal et votre navigateur. Et &#231;a change tout.
</description>
    </item>
    <item>
      <title>Mauvaise nouvelle pour l&#8217;Apple Watch, les prochains mod&#232;les n&#8217;auront pas droit &#224; cette nouveaut&#233;</title>
      <link>https://www.frandroid.com/marques/apple/2874261_mauvaise-nouvelle-pour-lapple-watch-les-prochains-modeles-nauront-pas-droit-a-cette-nouveaute</link>
      <pubDate>Tue, 18 Nov 2025 16:09:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2874261_mauvaise-nouvelle-pour-lapple-watch-les-prochains-modeles-nauront-pas-droit-a-cette-nouveaute</guid>
      <description>
Les amateurs d&#8217;Apple Watch qui esp&#233;raient d&#233;couvrir une montre radicalement diff&#233;rente dans les prochaines ann&#233;es vont devoir s&#8217;armer de patience. Selon une r&#233;cente fuite, la prochaine vraie r&#233;volution esth&#233;tique n&#8217;arriverait qu&#8217;en 2028.
</description>
    </item>
    <item>
      <title>Hank Green&#8217;s Focus Friend is Google Play&#8217;s app of the year</title>
      <link>https://techcrunch.com/2025/11/18/hank-greens-focus-friend-is-google-plays-app-of-the-year/</link>
      <pubDate>Tue, 18 Nov 2025 16:05:06 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068755</guid>
      <description>In a year that again saw AI assistants and tools climb the app store charts over and over, it's interesting to see a timer that helps you disconnect from your tech winning Google's highest app award.</description>
    </item>
    <item>
      <title>Meta&#8217;s AI spending spree has even the most bullish stock analysts wondering: How much capex is too much?</title>
      <link>https://www.fastcompany.com/91444071/meta-ai-spending-stock-analysts-cut-price-target-capex-too-high</link>
      <pubDate>2025-11-18T16:05:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444071/meta-ai-spending-stock-analysts-cut-price-target-capex-too-high</guid>
      <description>The Facebook and Instagram parent is &#8220;trying to punch above its weight&#8221; as it races to compete with its fellow tech giants, says one Wall Street analyst firm.
Meta Platforms has been spending too aggressively on artificial intelligence (AI) infrastructure and that will affect the tech giant&#8217;s profitability, according to a new investor note from Wall Street analyst firm MoffettNathanson....</description>
    </item>
    <item>
      <title>Gemini 3 is here &#8211; 3 things to know about the major AI update</title>
      <link>https://www.techradar.com/ai-platforms-assistants/gemini/gemini-3-is-here-3-things-to-know-about-the-major-ai-update</link>
      <pubDate>Tue, 18 Nov 2025 16:04:31 +0000</pubDate>
      <guid isPermaLink="false">ZCS8hEVEzY79gMkNUG8UfY</guid>
      <description>Gemini 3 brings major upgrades to Google's AI models and the platforms using Gemini to become more useful.</description>
    </item>
    <item>
      <title>Microsoft says Azure was hit with a massive DDoS attack launched from over 500,000 IP addresses</title>
      <link>https://www.techradar.com/pro/security/microsoft-says-azure-was-hit-with-a-massive-ddos-attack-launched-from-over-500-000-ip-addresses</link>
      <pubDate>Tue, 18 Nov 2025 16:04:00 +0000</pubDate>
      <guid isPermaLink="false">sHtyHs2i4Ug77MiX8AjN7d</guid>
      <description>Aisuru mounts another record-breaking DDoS attack, with Microsoft Azure the target this time.</description>
    </item>
    <item>
      <title>Microsoft is turning Windows into an &amp;#8216;agentic OS,&amp;#8217; starting with the taskbar</title>
      <link>https://www.theverge.com/news/821948/microsoft-windows-11-ai-agents-taskbar-integration</link>
      <pubDate>2025-11-18T11:00:34-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=821948</guid>
      <description>Microsoft is trying to transform Windows into a &#8220;canvas for AI,&#8221; with new AI agents integrated into the Windows 11 taskbar. These new taskbar capabilities are designed to make AI agents feel like an assistant in Windows that can go off and control your PC and do tasks for you at the click of a [&#8230;]</description>
    </item>
    <item>
      <title>The &#8216;Daredevil: Born Again&#8217; Reset Means Season 2 Can Dream Big</title>
      <link>https://gizmodo.com/daredevil-born-again-season-2-plans-jessica-jones-marvel-2000687460</link>
      <pubDate>Tue, 18 Nov 2025 16:00:18 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687460</guid>
      <description>Now that it's gotten it's gotten its growing pains out of the way, 'Daredevil: Born Again' can be its best self.</description>
    </item>
    <item>
      <title>Microsoft&#8217;s Agent 365 Tries to Be the AI Bot Boss</title>
      <link>https://www.wired.com/story/microsoft-ai-agent-365/</link>
      <pubDate>Tue, 18 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">691b5dca8f60aa2f043a7082</guid>
      <description>Microsoft still sees AI agents as the future of work, and the enterprise software giant wants companies to be able to manage those agents just like human employees.</description>
    </item>
    <item>
      <title>Gemini 3 Is Here&#8212;and Google Says It Will Make Search Smarter</title>
      <link>https://www.wired.com/story/google-launches-gemini-3-ai-bubble-search/</link>
      <pubDate>Tue, 18 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">69176b11f9cf281e6cc09128</guid>
      <description>Gemini 3 is skilled at reasoning, generating video, and writing code. Amid talk of an AI bubble, Google notes the new model could help increase search revenue too.</description>
    </item>
    <item>
      <title>Best Binoculars (2025): Zeiss, Swarovski, Leica</title>
      <link>https://www.wired.com/story/best-binoculars/</link>
      <pubDate>Tue, 18 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">6204259203dd42ee498c4973</guid>
      <description>Whether for bird-watching or baseball-spotting, we break down prices and specs to find the best pair for you.</description>
    </item>
    <item>
      <title>Microsoft Agent 365 lets businesses manage AI agents like they do people</title>
      <link>https://www.theverge.com/news/822035/microsoft-agent-365-businesses-control-security</link>
      <pubDate>2025-11-18T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=822035</guid>
      <description>Microsoft is racing towards building an AI &#8220;agent factory&#8221; that lets businesses build and manage their own AI agents. While Microsoft was founded on the idea of being a software factory, it&#8217;s quickly being transformed into an era where AI agents will increasingly take on more human work. Now, Microsoft is launching Agent 365 as [&#8230;]</description>
    </item>
    <item>
      <title>Microsoft&#8217;s Office apps are getting even more free AI features</title>
      <link>https://www.theverge.com/news/822789/microsoft-copilot-chat-outlook-word-excel-powerpoint</link>
      <pubDate>2025-11-18T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=822789</guid>
      <description>Microsoft is adding even more AI features to Outlook, Word, Excel, and PowerPoint. While the software maker has been adding plenty of features to its paid Microsoft 365 Copilot over the past year, a range of free additions are coming to its Office apps in early 2026 that don&#8217;t require the $30 per month, per [&#8230;]</description>
    </item>
    <item>
      <title>Google Antigravity is an &#8216;agent-first&#8217; coding tool built for Gemini 3</title>
      <link>https://www.theverge.com/news/822833/google-antigravity-ide-coding-agent-gemini-3-pro</link>
      <pubDate>2025-11-18T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=822833</guid>
      <description>Alongside today&#8217;s announcement of Gemini 3 Pro, Google has revealed Antigravity, a development tool that uses Gemini 3 Pro, along with other third-party models. Google says that Antigravity, which supports multiple agents and gives them direct access to the editor, terminal, and browser, is designed for an &#8220;agent-first future.&#8221; One of the key components of [&#8230;]...</description>
    </item>
    <item>
      <title>The Analogue 3D is the perfect console for N64 collectors</title>
      <link>https://www.theverge.com/games/822849/analogue-3d-review-n64</link>
      <pubDate>2025-11-18T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=822849</guid>
      <description>I've developed a sixth sense for old video game cartridges. I can spot them at flea markets and thrift stores, spy them hidden behind stacks in used book stores. It happened after I first bought an Analogue Pocket, when the hunt for new and interesting Game Boy games became as important as actually playing them. [&#8230;]</description>
    </item>
    <item>
      <title>Google is launching Gemini 3, its &amp;#8216;most intelligent&amp;#8217; AI model yet</title>
      <link>https://www.theverge.com/news/822977/gemini-3-google-ai-model-launch</link>
      <pubDate>2025-11-18T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=822977</guid>
      <description>Google is beginning to launch Gemini 3 today, a new series of models the company says is its &#8220;most intelligent&#8221; and &#8220;factually accurate&#8221; AI systems yet. They&#8217;re also a chance for Google to leap ahead of OpenAI following the rocky launch of GPT-5, potentially putting the company at the forefront of consumer-focused AI models. For [&#8230;]</description>
    </item>
    <item>
      <title>Google launches Gemini 3 with new coding app and record benchmark scores</title>
      <link>https://techcrunch.com/2025/11/18/google-launches-gemini-3-with-new-coding-app-and-record-benchmark-scores/</link>
      <pubDate>Tue, 18 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068733</guid>
      <description>Google released Gemini 3, its latest and most advanced foundation model, to be made immediately available through the Gemini app and AI search interface.</description>
    </item>
    <item>
      <title>Your favorite Microsoft 365 apps are getting a load more Copilot AI Agents - Word, Excel, Outlook, PowerPoint all get a boost</title>
      <link>https://www.techradar.com/pro/your-favorite-microsoft-365-apps-are-getting-a-load-more-copilot-ai-agents-word-excel-outlook-powerpoint-all-get-a-boost</link>
      <pubDate>Tue, 18 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">rTv9PFXjBCPeFoCuRYGB4A</guid>
      <description>Copilot is bringing a host of new AI agents to Microsoft Word, Excel and PowerPoint.</description>
    </item>
    <item>
      <title>Microsoft reveals Agent 365 - the new and (hopefully) easy way to get a handle on all these new AI agents at work</title>
      <link>https://www.techradar.com/pro/microsoft-reveals-agent-365-the-new-and-hopefully-easy-way-to-get-a-handle-on-all-these-new-ai-agents-at-work</link>
      <pubDate>Tue, 18 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">yXGwfzHG4U5DQnaxbQpYE7</guid>
      <description>Microsoft Agent 365 will help organizations govern agents responsibly and at scale.</description>
    </item>
    <item>
      <title>We love bargain hunting on Black Friday &#8212; and the FlexiSpot home office sale doesn't disappoint</title>
      <link>https://www.techradar.com/pro/we-love-bargain-hunting-on-black-friday-and-the-flexispot-home-office-sale-doesnt-disappoint</link>
      <pubDate>Tue, 18 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">68YBcnK8hFx7t7xPSHw6XY</guid>
      <description>Standing desks and chairs aren't a natural pairing - but these Black Friday deals go well together.</description>
    </item>
    <item>
      <title>Writer's AI agents can actually do your work&#8212;not just chat about it</title>
      <link>https://venturebeat.com/ai/writers-ai-agents-can-actually-do-your-work-not-just-chat-about-it</link>
      <pubDate>Tue, 18 Nov 2025 16:00:00 GMT</pubDate>
      <guid isPermaLink="false">3mxgihnTX7TLzqVAeotD9P</guid>
      <description>Writer, a San Francisco-based artificial intelligence startup, is launching a unified AI agent platform designed to let any employee automate complex business workflows without writing code &#8212; a capability the company says distinguishes it from consumer-oriented tools like Microsoft Copilot and ChatGPT.The platform, called Writer Agent, combines chat-based assistance with autonomous task execution in a single interface. Starting Tuesday, enterprise customers can use natural language to instruct the AI to create presentations, analyze financial data, generate marketing campaigns, or coordinate a...</description>
    </item>
    <item>
      <title>Microsoft's Fabric IQ teaches AI agents to understand business operations, not just data patterns</title>
      <link>https://venturebeat.com/data-infrastructure/microsofts-fabric-iq-teaches-ai-agents-to-understand-business-operations-not</link>
      <pubDate>Tue, 18 Nov 2025 16:00:00 GMT</pubDate>
      <guid isPermaLink="false">3Yarji4B6RdNl7AqyCYIOv</guid>
      <description>Semantic intelligence is a critical element of actually understanding what data means and how it can be used.Microsoft is now deeply integrating semantics and ontologies into its &#160;Fabric data platform with its new Fabric IQ technology that it debuted at the Microsoft Ignite conference Tuesday.Fabric IQ is a semantic intelligence layer designed to address a fundamental problem with enterprise AI agents: Effectiveness depends not just on dataset size but on how well data reflects actual business operations. The new technology creates a shared semantic structure that maps datasets to real-world e...</description>
    </item>
    <item>
      <title>Microsoft remakes Windows for an era of autonomous AI agents</title>
      <link>https://venturebeat.com/ai/microsoft-remakes-windows-for-an-era-of-autonomous-ai-agents</link>
      <pubDate>Tue, 18 Nov 2025 16:00:00 GMT</pubDate>
      <guid isPermaLink="false">44Qas65eNfAhKoqVwNxn2W</guid>
      <description>Microsoft is fundamentally restructuring its Windows operating system to become what executives call the first "agentic OS," embedding the infrastructure needed for autonomous AI agents to operate securely at enterprise scale &#8212; a watershed moment in the evolution of personal computing that positions the 40-year-old platform as the foundation for a new era of human-machine collaboration.The company announced Tuesday at its Ignite conference that it is introducing native agent infrastructure directly into Windows 11, allowing AI agents &#8212; autonomous software programs that can perform complex, mul...</description>
    </item>
    <item>
      <title>Google unveils Gemini 3 claiming the lead in math, science, multimodal and agentic AI benchmarks</title>
      <link>https://venturebeat.com/ai/google-unveils-gemini-3-claiming-the-lead-in-math-science-multimodal-and</link>
      <pubDate>Tue, 18 Nov 2025 16:00:00 GMT</pubDate>
      <guid isPermaLink="false">55WI5lHroR5npTe0t4WepF</guid>
      <description>After more than a month of rumors and feverish speculation &#8212; including Polymarket wagering on the release date &#8212; Google today unveiled Gemini 3, its newest proprietary frontier model family and the company&#8217;s most comprehensive AI release since the Gemini line debuted in 2023. The models are proprietary (closed-source), available exclusively through Google products, developer platforms, and paid APIs, including Google AI Studio, Vertex AI, the Gemini CLI, and third-party integrations across the broader IDE ecosystem.Gemini 3 arrives as a full portfolio, including:Gemini 3 Pro: the flagship fron...</description>
    </item>
    <item>
      <title>Microsoft says these new AI tools will help coders avoid tedious tasks and burnout</title>
      <link>https://www.fastcompany.com/91443389/microsoft-artificial-intelligence-burnout-ignite-github</link>
      <pubDate>2025-11-18T16:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91443389/microsoft-artificial-intelligence-burnout-ignite-github</guid>
      <description>New AI features can help developers quickly address security issues and migrate aging software to the cloud.&#160;
At Microsoft&#8217;s Ignite conference on November 18, the company unveiled new AI-powered software features designed to make coders&#8217; lives easier&#8212;including a tool to automatically fix security issues as new vulnerabilities are discovered.&#160;</description>
    </item>
    <item>
      <title>Klarna&#160;beats third-quarter revenue estimates in first earnings report after IPO</title>
      <link>https://www.fastcompany.com/91444105/klarna-earnings-third-quarter-revenue-after-ipo</link>
      <pubDate>2025-11-18T16:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444105/klarna-earnings-third-quarter-revenue-after-ipo</guid>
      <description>The buy now, pay later lender reported revenue of $903 million, beating analysts&#8217; expectations of $882 million.
Growth in U.S. markets helped Swedish fintech firm Klarna to achieve a 26% jump in third-quarter revenue, beating expectations in its first report as a public company and forecasting revenue above $1 billion in the current quarter, the company said on Tuesday....</description>
    </item>
    <item>
      <title>Stock market slips again as Nvidia, bitcoin, and other stars keep falling</title>
      <link>https://www.fastcompany.com/91444143/stock-market-slips-nvidia-bitcoin</link>
      <pubDate>2025-11-18T16:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444143/stock-market-slips-nvidia-bitcoin</guid>
      <description>The struggles are a sharp turnaround from the months of relentless rallying for the U.S. stock market since April.
The U.S. stock market is&#160;slipping again&#160;on Tuesday, following a global sell-off, as&#160;Nvidia, bitcoin and other Wall Street stars keep falling on worries that their prices shot too high. Home Depot is also dragging the market lower after saying it made less in profit during the summer than analysts expected....</description>
    </item>
    <item>
      <title>How to watch Scotland vs. Denmark online for free</title>
      <link>https://mashable.com/article/scotland-denmark-world-cup-qualifiers-2025-live-stream-for-free</link>
      <pubDate>Tue, 18 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">03SRYoFfFibPXxYdDgBXCRd</guid>
      <description>How to watch World Cup qualifiers for free. Live stream Scotland vs. Denmark in World Cup qualifiers for free.</description>
    </item>
    <item>
      <title>Gemini&#160;3 | L&#8217;IA de Google promet d&#8217;enfin comprendre ce que vous voulez dire</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-11-18/gemini-3/l-ia-de-google-promet-d-enfin-comprendre-ce-que-vous-voulez-dire.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Tue, 18 Nov 2025 11:00:00 -0500</pubDate>
      <guid isPermaLink="false">c3d0f22058b43191904e608420f0276a</guid>
      <description>Google franchit une nouvelle &#233;tape dans la course &#224; l&#8217;intelligence artificielle. L&#8217;entreprise lance aujourd&#8217;hui Gemini&#160;3, son mod&#232;le le plus avanc&#233; d&#8217;IA g&#233;n&#233;rative. La nouvelle venue promet de d&#233;passer la simple r&#233;ponse factuelle et d&#8217;agir comme un v&#233;ritable &#171;&#160;partenaire de r&#233;flexion&#160;&#187;, capable de saisir la nuance et le contexte.</description>
    </item>
    <item>
      <title>Gemini 3 explose les records : Google affirme avoir doubl&#233; GPT-5 et Claude Sonnet 4.5</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2874017_gemini-3-explose-les-records-google-affirme-avoir-double-gpt-5-et-claude-sonnet-4-5</link>
      <pubDate>Tue, 18 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2874017_gemini-3-explose-les-records-google-affirme-avoir-double-gpt-5-et-claude-sonnet-4-5</guid>
      <description>
Gemini 3 est d&#233;sormais disponible et Google d&#233;ploie tous les arguments possibles pour vous convaincre qu'il s'agit du meilleur mod&#232;le IA jamais con&#231;u.
</description>
    </item>
    <item>
      <title>DJI Osmo Action 6&#160;: la promesse de filmer dans n&#8217;importe quel sens et en 4K</title>
      <link>https://www.01net.com/actualites/dji-osmo-action-6-la-promesse-de-filmer-dans-nimporte-quel-sens-et-en-4k.html</link>
      <pubDate>Tue, 18 Nov 2025 15:56:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308897</guid>
      <description>DJI d&#233;voile l'Osmo Action 6, une cam&#233;ra d'action qui int&#232;gre un capteur carr&#233; et une ouverture variable, une premi&#232;re dans cette cat&#233;gorie. Elle est disponible d&#232;s aujourd'hui &#224; partir de 379 &#8364;.</description>
    </item>
    <item>
      <title>Black Friday audio : les &#233;couteurs Bluetooth, casques, barres de son et enceintes montent le volume et baissent leur prix dans ce top des offres</title>
      <link>https://www.frandroid.com/bons-plans/2849763_black-friday-ecouteurs-sans-fil-les-meilleures-offres-sur-tous-les-produits-audio</link>
      <pubDate>Tue, 18 Nov 2025 15:52:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849763_black-friday-ecouteurs-sans-fil-les-meilleures-offres-sur-tous-les-produits-audio</guid>
      <description>
&#201;couteurs Bluetooth, casques audio sans-fil, enceintes Bluetooth, plusieurs produits audio regroupent cette cat&#233;gorie. Nous avons s&#233;lectionn&#233; les meilleures offres du secteur. Vous y trouverez des AirPods, des produits JBL ou encore des casques de chez Sony.
</description>
    </item>
    <item>
      <title>What is Cloudflare?</title>
      <link>https://mashable.com/article/what-is-cloudflare-internet-infrastructure-company</link>
      <pubDate>Tue, 18 Nov 2025 15:51:42 +0000</pubDate>
      <guid isPermaLink="false">06lXzkrlKNTQdE5UlnhD9GW</guid>
      <description>What is Cloudflare?</description>
    </item>
    <item>
      <title>Botulism Outbreak Linked to Baby Formula Just Got Even Bigger&#8212;Now in 13 States</title>
      <link>https://gizmodo.com/botulism-outbreak-linked-to-baby-formula-just-got-even-bigger-now-in-13-states-2000687503</link>
      <pubDate>Tue, 18 Nov 2025 15:50:57 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687503</guid>
      <description>Federal health officials have identified eight new cases since last week.</description>
    </item>
    <item>
      <title>Snag the best NFL Sunday Ticket deal of the season: just $12/month</title>
      <link>https://mashable.com/article/nov-18-nfl-sunday-ticket-deal</link>
      <pubDate>Tue, 18 Nov 2025 15:48:35 +0000</pubDate>
      <guid isPermaLink="false">07tTYihbR2CCTXezQWh89on</guid>
      <description>NFL Sunday Ticket is on sale for just $48 for the rest of the season. That's 68% cheaper than its current list price.</description>
    </item>
    <item>
      <title>Snapchat rolls out &#8216;Topic Chats&#8217; for public conversations</title>
      <link>https://techcrunch.com/2025/11/18/snapchat-rolls-out-topic-chats-for-public-conversations/</link>
      <pubDate>Tue, 18 Nov 2025 15:46:03 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068758</guid>
      <description>The social network says the new feature will let users chat about what&#8217;s happening in the world and across various communities, from Formula 1 to the reality TV show "Below Deck."</description>
    </item>
    <item>
      <title>The 55+ best early Black Friday deals: Get big savings on MacBooks, Nintendo Switch 2, Keurig, and Samsung gear</title>
      <link>https://mashable.com/article/best-early-black-friday-deals-2025</link>
      <pubDate>Tue, 18 Nov 2025 15:42:50 +0000</pubDate>
      <guid isPermaLink="false">02qcRU5kEQhykGdtbnTdwiW</guid>
      <description>We found the latest early Black Friday deals on Apple products, robot vacuums, headphones, power stations, Legos, and tons more goodies.</description>
    </item>
    <item>
      <title>Prime members: Save $450 on the Narwal Freo Z10 robot vacuum and mop at Amazon before Black Friday hits</title>
      <link>https://mashable.com/article/nov-18-narwal-freo-z10-deal</link>
      <pubDate>Tue, 18 Nov 2025 15:37:28 +0000</pubDate>
      <guid isPermaLink="false">06gtISMNcMkfMKOy7UFjPJH</guid>
      <description>The Narwal Freo Z10 robot vacuum and mop combo is on sale at Amazon for $649.99, down from the normal price of $1,099.99. That's a 41% discount.</description>
    </item>
    <item>
      <title>Physics Wallah enjoys a rosy IPO day, bucking the broader slowdown in Indian edtech</title>
      <link>https://techcrunch.com/2025/11/18/physics-wallah-enjoys-a-rosy-ipo-day-bucking-the-broader-slowdown-in-indian-edtech/</link>
      <pubDate>Tue, 18 Nov 2025 15:36:09 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068704</guid>
      <description>The Indian edtech startup ended its first day as a public company on a high, with its shares closing 44% higher than they were listed for, indicating that the country's edtech sector may still recover after years of gloom.</description>
    </item>
    <item>
      <title>Cloudflare down: What we know about the outage so far</title>
      <link>https://mashable.com/article/cloudflare-down-outage-november-18</link>
      <pubDate>Tue, 18 Nov 2025 15:35:02 +0000</pubDate>
      <guid isPermaLink="false">07ocPQ9SQmUgxJXvORQblJw</guid>
      <description>Cloudflare is experiencing global issues, the service confirmed on Tuesday morning.</description>
    </item>
    <item>
      <title>Roamless review</title>
      <link>https://www.techradar.com/pro/roamless-review</link>
      <pubDate>Tue, 18 Nov 2025 15:33:41 +0000</pubDate>
      <guid isPermaLink="false">TebjXmBDBGgnFssR8mg4Re</guid>
      <description>A detailed review of Roamless, its eSIM plans, pros &amp; cons, and whether it&#8217;s your best choice when traveling.</description>
    </item>
    <item>
      <title>8 of the best Shark bargains in the early Black Friday sales &#8211; big deals on multi-stylers, steam cleaners, dust-busters, and more</title>
      <link>https://www.techradar.com/seasonal-sales/shark-black-friday-deals-2025</link>
      <pubDate>Tue, 18 Nov 2025 15:32:03 +0000</pubDate>
      <guid isPermaLink="false">ZVfhYTP6fmbqUyhqNrzx3f</guid>
      <description>It's not even Black Friday yet, but there are Shark bargains galore.</description>
    </item>
    <item>
      <title>Cloudflare blames massive internet outage on &#8216;latent bug&#8217;</title>
      <link>https://techcrunch.com/2025/11/18/cloudflare-blames-massive-internet-outage-on-latent-bug/</link>
      <pubDate>Tue, 18 Nov 2025 15:32:01 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068760</guid>
      <description>An outage at internet infrastructure giant Cloudflare took down several big websites and services, including ChatGPT, Claude, Spotify, and X.</description>
    </item>
    <item>
      <title>Roblox to require age verification and age-based chats following lawsuits</title>
      <link>https://www.fastcompany.com/91444099/roblox-age-verification-group-chats-child-safety</link>
      <pubDate>2025-11-18T15:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444099/roblox-age-verification-group-chats-child-safety</guid>
      <description>Players will have to take a video selfie that will be used to estimate their age.
Roblox is stepping up its age verification system for users who want to privately message other players and implementing age-based chats so kids, teens, and adults will only be able to message people around their own age.</description>
    </item>
    <item>
      <title>Best Early Black Friday Mattress Deals 2025</title>
      <link>https://www.wired.com/story/best-early-black-friday-mattress-deals-2025/</link>
      <pubDate>Tue, 18 Nov 2025 15:29:40 +0000</pubDate>
      <guid isPermaLink="false">691b76ae86e69565af2a4958</guid>
      <description>Some of the best sales of the year are happening right now&#8212;rest up before the holiday rush with a new bed.</description>
    </item>
    <item>
      <title>Organizations must own the right to their cloud compute, or innovation will suffer</title>
      <link>https://www.techradar.com/pro/organizations-must-own-the-right-to-their-cloud-compute-or-innovation-will-suffer</link>
      <pubDate>Tue, 18 Nov 2025 15:27:26 +0000</pubDate>
      <guid isPermaLink="false">3uYYJWP2Kw8jsFYHhct3pb</guid>
      <description>The future of digital sovereignty and responsible AI use depends on infrastructure autonomy.</description>
    </item>
    <item>
      <title>Voici les 16 produits Tech pas chers pour se faire plaisir &#224; petit prix lors du pr&#233;-Black Friday : la s&#233;lection &#224; moins de 100 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2866283_voici-les-14-produits-tech-pas-chers-pour-se-faire-plaisir-a-petit-prix-lors-du-pre-black-friday-la-selection-a-moins-de-100</link>
      <pubDate>Tue, 18 Nov 2025 15:26:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2866283_voici-les-14-produits-tech-pas-chers-pour-se-faire-plaisir-a-petit-prix-lors-du-pre-black-friday-la-selection-a-moins-de-100</guid>
      <description>
Le v&#233;ritable Black Friday approche et parmi les nombreuses offres d&#233;j&#224; disponibles, il est possible de se faire plaisir m&#234;me avec un budget qui ne d&#233;passe pas les 100 euros. Avis aux petits budgets,&#160;voici les meilleures offres qui valent le coup.&#160;
</description>
    </item>
    <item>
      <title>The Criterion Collection is having a 50% off sale at Amazon for Black Friday &#8211; here are my 9 closet picks from the deals</title>
      <link>https://www.techradar.com/televisions/the-criterion-collection-is-having-a-50-percent-off-sale-at-amazon-for-black-friday-here-are-my-9-closet-picks-from-the-deals</link>
      <pubDate>Tue, 18 Nov 2025 15:24:18 +0000</pubDate>
      <guid isPermaLink="false">qXqrhcFuoQzNRBKuUDmypC</guid>
      <description>The Criterion Collection has knocked 50% off tons of its 4K Blu-rays, so there's no better time to add to your shelves!</description>
    </item>
    <item>
      <title>This new Razer headset is perfect for PC gaming and is already at its lowest-ever price for Black Friday</title>
      <link>https://www.techradar.com/gaming/this-new-razer-headset-is-perfect-for-pc-gaming-and-is-already-at-its-lowest-ever-price-for-black-friday</link>
      <pubDate>Tue, 18 Nov 2025 15:24:16 +0000</pubDate>
      <guid isPermaLink="false">qKx6tTmKTKJduCG22ZmR9W</guid>
      <description>The Razer BlackShark V3 Wireless is at a massive discount for Black Friday.</description>
    </item>
    <item>
      <title>Panne mondiale d&#8217;Internet&#160;: Cloudflare est en train de r&#233;soudre le probl&#232;me</title>
      <link>https://www.01net.com/actualites/panne-mondiale-dinternet-cloudflare-rencontre-un-gros-probleme.html</link>
      <pubDate>Tue, 18 Nov 2025 15:24:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308960</guid>
      <description>Une panne massive de Cloudflare secoue Internet. Une montagne de sites web s'est retrouv&#233;e inaccessible pendant plusieurs heures. Cloudflare est finalement parvenu &#224; localiser et &#224; r&#233;soudre la panne. Un &#171; correctif a &#233;t&#233; d&#233;ploy&#233; et nous pensons que l'incident est d&#233;sormais r&#233;solu &#187;, explique Cloudflare.</description>
    </item>
    <item>
      <title>M&#234;me d&#233;branch&#233;s des serveurs, les vieux thermostats Nest continuent d&#8217;envoyer des donn&#233;es &#224; Google</title>
      <link>https://www.01net.com/actualites/meme-debranches-des-serveurs-les-vieux-thermostats-nest-continuent-denvoyer-des-donnees-a-google.html</link>
      <pubDate>Tue, 18 Nov 2025 15:21:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309013</guid>
      <description>Google a beau avoir d&#233;branch&#233; les premiers thermostats Nest, ces appareils continuent d&#8217;envoyer des donn&#233;es vers les serveurs de l&#8217;entreprise. Un chercheur en s&#233;curit&#233; a d&#233;couvert que des journaux d&#8217;activit&#233; &#8212; parfois tr&#232;s d&#233;taill&#233;s &#8212; circulent toujours en arri&#232;re-plan, malgr&#233; la fin officielle du support.</description>
    </item>
    <item>
      <title>Waymo removes safety drivers in Miami ahead of 2026 launch</title>
      <link>https://techcrunch.com/2025/11/18/waymo-removes-safety-drivers-in-miami-ahead-of-2026-launch/</link>
      <pubDate>Tue, 18 Nov 2025 15:21:12 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068734</guid>
      <description>Waymo said it will do the same in Dallas, Houston, San Antonio, and Orlando in the coming weeks -- the latest steps in the company's continued expansion across the U.S.</description>
    </item>
    <item>
      <title>Smartphones Samsung, Apple, Google, Nothing&#8230; la s&#233;lection des offres les plus all&#233;chantes sur ce pr&#233; Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2848295_black-friday-en-avance-les-smartphones-premium-sont-a-leur-meilleur-prix-le-top-deals-sur-les-modeles-samsung-apple-google-nothing</link>
      <pubDate>Tue, 18 Nov 2025 15:20:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848295_black-friday-en-avance-les-smartphones-premium-sont-a-leur-meilleur-prix-le-top-deals-sur-les-modeles-samsung-apple-google-nothing</guid>
      <description>
La Black Week approche &#224; grands pas ! Mais cela fait d&#233;j&#224; depuis le d&#233;but du mois que smartphones sont &#224; prix cass&#233;s. Les &#233;tals des e-commer&#231;ants ne d&#233;semplissent pas de r&#233;ductions en tout genre. Nous avons rassembl&#233; ici les offres les plus int&#233;ressantes sur les smartphones premium.
</description>
    </item>
    <item>
      <title>Microsoft&amp;#8217;s new Anthropic partnership brings Claude AI models to Azure</title>
      <link>https://www.theverge.com/news/822988/microsoft-anthropic-partnership-claude-models-azure-investment-nvidia</link>
      <pubDate>2025-11-18T10:20:17-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=822988</guid>
      <description>Microsoft is announcing a strategic partnership with Anthropic today that will bring the AI startup&#8217;s models to Microsoft Foundry for the first time. As part of the deal, Anthropic is also committing to purchasing $30 billion of Azure compute capacity and &#8220;to contract&#160;additional&#160;compute capacity up to one gigawatt.&#8221; Microsoft Foundry customers will now be able [&#8230;]...</description>
    </item>
    <item>
      <title>Vibe coding to vibe hacking: securing software in the AI era</title>
      <link>https://www.techradar.com/pro/vibe-coding-to-vibe-hacking-securing-software-in-the-ai-era</link>
      <pubDate>Tue, 18 Nov 2025 15:18:47 +0000</pubDate>
      <guid isPermaLink="false">8BktuefyhKTbKnd6zHH9mH</guid>
      <description>Vibe coding's speed risks vulnerabilities without human accountability and scrutiny.</description>
    </item>
    <item>
      <title>Snag the creator-favorite DJI Mic Mini for its lowest price yet</title>
      <link>https://mashable.com/article/nov-18-dji-mic-mini-deal</link>
      <pubDate>Tue, 18 Nov 2025 15:17:18 +0000</pubDate>
      <guid isPermaLink="false">06gh5bPEiWFHsVix7vHvYtk</guid>
      <description>As of Nov. 18, get the DJI Mic Mini for its lowest price yet.</description>
    </item>
    <item>
      <title>Xiaomi n&#8217;&#233;pargne aucun de ses produits durant le pr&#233;-Black Friday : le TOP 16 des offres</title>
      <link>https://www.frandroid.com/bons-plans/2858733_xiaomi-profite-du-pre-black-friday-pour-brader-ses-produits-les-plus-populaires-les-8-offres-a-saisir</link>
      <pubDate>Tue, 18 Nov 2025 15:15:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2858733_xiaomi-profite-du-pre-black-friday-pour-brader-ses-produits-les-plus-populaires-les-8-offres-a-saisir</guid>
      <description>
Xiaomi multiplie les offres avant le v&#233;ritable Black Friday, y compris sur ses derniers mod&#232;les. Plusieurs r&#233;f&#233;rences r&#233;centes sont propos&#233;es &#224; prix r&#233;duit, assurant un excellent rapport qualit&#233;-prix. Voici les produits de la marque que l'on recommande sans h&#233;siter.
</description>
    </item>
    <item>
      <title>The New &#8216;Project Hail Mary&#8217; Trailer Shows What the Movie Is Really About</title>
      <link>https://gizmodo.com/new-project-hail-mary-trailer-ryan-gosling-2000687175</link>
      <pubDate>Tue, 18 Nov 2025 15:15:46 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687175</guid>
      <description>Ryan Gosling stars in the new sci-fi film from directors Phil Lord and Chris Miller, out March 20, 2026.</description>
    </item>
    <item>
      <title>This notorious Russian surveillance tech maker has been hacked - could it be the end for Protei?</title>
      <link>https://www.techradar.com/pro/security/this-notorious-russian-surveillance-tech-maker-has-been-hacked-could-it-be-the-end-for-protei</link>
      <pubDate>Tue, 18 Nov 2025 15:14:00 +0000</pubDate>
      <guid isPermaLink="false">uYm2ieTAFsffoc7uKnqTS</guid>
      <description>Someone defaced the Protei website and stole gigabytes of data including emails dating back years.</description>
    </item>
    <item>
      <title>The sovereignty shift: how UK and Irish SMEs can regain control of their data</title>
      <link>https://www.techradar.com/pro/the-sovereignty-shift-how-uk-and-irish-smes-can-regain-control-of-their-data</link>
      <pubDate>Tue, 18 Nov 2025 15:11:26 +0000</pubDate>
      <guid isPermaLink="false">fqyDHfpfPPKoiPaHT6t2wC</guid>
      <description>Amid rising data concerns, UK and Irish SMEs are urged to reclaim control through digital sovereignty.</description>
    </item>
    <item>
      <title>Quand acheter un nouvel iPhone ? Les offres du Black Friday commencent &#224; tomber</title>
      <link>https://www.frandroid.com/guide-dachat/2062062_quand-acheter-un-iphone-nos-conseils-pour-choisir-le-meilleur-moment</link>
      <pubDate>Tue, 18 Nov 2025 15:10:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2062062_quand-acheter-un-iphone-nos-conseils-pour-choisir-le-meilleur-moment</guid>
      <description>
La question du timing pour l'achat d'un iPhone est primordiale. Vous souhaitez acqu&#233;rir un iPhone ou une autre d&#233;clinaison de la gamme ? L'&#233;quipe Guide d'achat vous le d&#233;conseille &#224; cette p&#233;riode pr&#233;cise de l'ann&#233;e et on vous explique pourquoi.
</description>
    </item>
    <item>
      <title>P&#233;nurie de m&#233;moire, Nvidia et AMD vont stopper des cartes graphiques, c&#8217;est le moment ou jamais d&#8217;acheter avant que le march&#233; ne cr&#232;ve le plafond</title>
      <link>https://www.frandroid.com/marques/nvidia/2873829_penurie-de-memoire-nvidia-et-amd-vont-stopper-des-cartes-graphiques-cest-le-moment-ou-jamais-dacheter-avant-que-le-marche-ne-creve-le-plafond</link>
      <pubDate>Tue, 18 Nov 2025 15:10:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2873829_penurie-de-memoire-nvidia-et-amd-vont-stopper-des-cartes-graphiques-cest-le-moment-ou-jamais-dacheter-avant-que-le-marche-ne-creve-le-plafond</guid>
      <description>
Le spectre de la &#171; memoryflation &#187; plane sur l'industrie. Alors que les prix de la RAM et du stockage s'envolent, les constructeurs de cartes graphiques et de PC envisagent des mesures drastiques : suppression de mod&#232;les, report de lancements et hausse g&#233;n&#233;ralis&#233;e des tarifs.
</description>
    </item>
    <item>
      <title>The 26 Best Advent Calendars (2025): We Opened Every Door</title>
      <link>https://www.wired.com/gallery/best-advent-calendar/</link>
      <pubDate>Tue, 18 Nov 2025 15:09:00 +0000</pubDate>
      <guid isPermaLink="false">638f964b258cc1f5b2da9dac</guid>
      <description>Treat yourself or someone else to days of little gifts, ranging from sweet treats and savory beverages to beauty products and toys. We found a tiny door for everyone.</description>
    </item>
    <item>
      <title>I have a new favorite VR headset and it's all thanks to Black Friday</title>
      <link>https://www.techradar.com/seasonal-sales/i-have-a-new-favorite-vr-headset-and-its-all-thanks-to-black-friday</link>
      <pubDate>Tue, 18 Nov 2025 15:05:40 +0000</pubDate>
      <guid isPermaLink="false">bPFNTdh9MFZ5CFL4eGTrNf</guid>
      <description>The Meta Quest 3 is my usual go-to VR headset, but this Black Friday there's a new king in town.</description>
    </item>
    <item>
      <title>5 Black Friday security software deals you can't afford to miss: quality savings on all your security essentials</title>
      <link>https://www.techradar.com/pro/5-black-friday-security-software-deals-you-cant-afford-to-miss-quality-savings-on-all-your-security-essentials</link>
      <pubDate>Tue, 18 Nov 2025 15:04:04 +0000</pubDate>
      <guid isPermaLink="false">K8L2VGWdGy79LUmUhHQqAH</guid>
      <description>Keep your data and devices protected this Black Friday with my roundup of the best discounts that are half price or more.</description>
    </item>
    <item>
      <title>Welp, Smart Earrings Are a Thing Now</title>
      <link>https://gizmodo.com/lumia-smart-earring-2-health-tracking-price-release-date-2000687118</link>
      <pubDate>Tue, 18 Nov 2025 15:00:51 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687118</guid>
      <description>Lumia is ready to release its health-tracking smart earrings to the masses.</description>
    </item>
    <item>
      <title>The best Christmas gifts for gamers and movie lovers</title>
      <link>https://www.theverge.com/gadgets/780850/gaming-entertainment-gifts-ideas-2025</link>
      <pubDate>2025-11-18T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=780850</guid>
      <description>Most of us in the Northern Hemisphere spend the holidays indoors, but you can only watch so many TikToks about cute cats and cooking hacks before the need for something a little more substantive kicks in. Choosing the right game or movie to gift is tough, though, especially if you don't have an exact read [&#8230;]</description>
    </item>
    <item>
      <title>Quordle hints and answers for Wednesday, November 19 (game #1395)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-19-november-2025</link>
      <pubDate>Tue, 18 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">AZUvQM4vYBSS7bjxFXNoLj</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Wednesday, November 19 (game #892)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-19-november-2025</link>
      <pubDate>Tue, 18 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">zEy9dt3D8kFUbvKeviRSSS</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Wednesday, November 19 (game #626)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-19-november-2025</link>
      <pubDate>Tue, 18 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">frcYUCi5hMVNrHaYMc6vBZ</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Home Depot misses third-quarter earnings expectations, cuts outlook</title>
      <link>https://www.fastcompany.com/91444092/home-depot-earnings-third-quarter</link>
      <pubDate>2025-11-18T15:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444092/home-depot-earnings-third-quarter</guid>
      <description>The company attributed the missed earnings to less storm damage and more anxious shoppers.
Home Depot&#8216;s third-quarter was mixed with fewer violent storms reaching shore, more anxiety among U.S. consumers, and a housing market that is in a deep funk.</description>
    </item>
    <item>
      <title>Cloudflare Outage Takes Down Huge Chunk of the Internet, Slowly Coming Back Online</title>
      <link>https://gizmodo.com/cloudflare-outage-takes-down-huge-chunk-of-the-internet-slowly-coming-back-online-2000687459</link>
      <pubDate>Tue, 18 Nov 2025 14:56:59 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687459</guid>
      <description>Amazon, X, Spotify, ChatGPT, Grindr, Canva, and many more are struggling to stay online.</description>
    </item>
  </channel>
</rss>
