<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 27 Jan 2026 10:33:57 GMT</lastBuildDate>
    <item>
      <title>Looking for More Paid Social Media Features? Meta Is Reportedly Testing Tons</title>
      <link>https://gizmodo.com/are-you-looking-for-more-paid-social-media-features-meta-is-reportedly-testing-tons-2000714295</link>
      <pubDate>Tue, 27 Jan 2026 10:30:33 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000714295</guid>
      <description>If you love giving money to WhatsApp, Facebook, and Instagram, get excited.</description>
    </item>
    <item>
      <title>TikTok accus&#233; de censurer des messages anti-Trump aux &#201;tats-Unis</title>
      <link>https://www.01net.com/actualites/tiktok-accuse-de-censurer-des-messages-anti-trump-aux-etats-unis.html</link>
      <pubDate>Tue, 27 Jan 2026 10:30:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322657</guid>
      <description>La plateforme chinoise, qui vient de passer entre les mains d'un consortium d'investisseurs am&#233;ricains proches de Donald Trump, est accus&#233;e de censurer certains contenus critiquant le pr&#233;sident am&#233;ricain. Le gouverneur d&#233;mocrate de Californie a d&#233;cid&#233; d'ouvrir une enqu&#234;te sur le sujet. De son c&#244;t&#233;, TikTok souligne que ses r&#232;gles de mod&#233;ration de contenu n'ont pas &#233;volu&#233;es depuis son passage sous pavillon am&#233;ricain....</description>
    </item>
    <item>
      <title>Where Tech Leaders and Students Really Think AI Is Going</title>
      <link>https://www.wired.com/story/for-future-reference-ai-technology/</link>
      <pubDate>Tue, 27 Jan 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">6972630b4b5c4357c285d558</guid>
      <description>We asked tech CEOs, journalists, entertainers, students, and more about the promise and peril of artificial intelligence. Here&#8217;s what they said.</description>
    </item>
    <item>
      <title>Northwood Space secures a $100M Series B and a $50M Space Force contract</title>
      <link>https://techcrunch.com/2026/01/27/northwood-space-secures-a-100m-series-b-and-a-50m-space-force-contract/</link>
      <pubDate>Tue, 27 Jan 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3086332</guid>
      <description>This is the El Segundo, California-based startup's second raise in less than a year.</description>
    </item>
    <item>
      <title>Voici la puce qui pourrait &#171; tuer le monopole de 4 000 milliards de dollars de Nvidia &#187;</title>
      <link>https://www.frandroid.com/marques/microsoft/2956295_voici-la-puce-qui-pourrait-tuer-le-monopole-de-4-000-milliards-de-dollars-de-nvidia</link>
      <pubDate>Tue, 27 Jan 2026 10:27:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2956295_voici-la-puce-qui-pourrait-tuer-le-monopole-de-4-000-milliards-de-dollars-de-nvidia</guid>
      <description>
Maia 200, c'est le nom de la nouvelle puce d&#233;voil&#233;e par Microsoft. Elle s'annonce surpuissante pour les calculs li&#233;s &#224; l'IA dans le cloud.
</description>
    </item>
    <item>
      <title>Strava and Komoot finally bring offline maps to Apple Watch</title>
      <link>https://www.theverge.com/news/868418/strava-and-komoot-finally-bring-offline-maps-to-apple-watch</link>
      <pubDate>2026-01-27T05:25:57-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=868418</guid>
      <description>Strava and Komoot - two of the most popular apps for cyclists, hikers, and runners - are each bringing offline maps to the Apple Watch, ending a major source of frustration for many. Now you can easily see routes and record your workouts all in your preferred app, without having to bring along a relatively [&#8230;]</description>
    </item>
    <item>
      <title>Skyrim, Cyberpunk 2077&#8230; Modder vos jeux sur Steam Deck sera bient&#244;t radicalement plus simple</title>
      <link>https://www.frandroid.com/produits-android/console/2956225_skyrim-cyberpunk-2077-modder-vos-jeux-sur-steam-deck-sera-bientot-radicalement-plus-simple</link>
      <pubDate>Tue, 27 Jan 2026 10:23:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2956225_skyrim-cyberpunk-2077-modder-vos-jeux-sur-steam-deck-sera-bientot-radicalement-plus-simple</guid>
      <description>
Nexus Mods vient d'annoncer le futur support de son application Vortex aux machines tournant sur SteamOS. De quoi faciliter grandement le modding sur Steam Deck et la future Steam Machine.
</description>
    </item>
    <item>
      <title>Samsung Galaxy Z TriFold&#160;: son prix et sa date de sortie fuitent (et &#231;a pique)</title>
      <link>https://www.01net.com/actualites/samsung-galaxy-z-trifold-son-prix-et-sa-date-de-sortie-fuitent-et-ca-pique.html</link>
      <pubDate>Tue, 27 Jan 2026 10:14:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322645</guid>
      <description>Le puzzle se compl&#232;te enfin pour le Galaxy Z TriFold. Apr&#232;s notre prise en main de ce monstre de technologie, de nouvelles indiscr&#233;tions viennent d&#233;voiler l'addition et le calendrier de lancement. Pr&#233;parez-vous, la facture s'annonce particuli&#232;rement sal&#233;e.</description>
    </item>
    <item>
      <title>Gemini's new Google Calendar tool might finally help me get through the pain of organizing my meetings</title>
      <link>https://www.techradar.com/pro/geminis-new-google-calendar-tool-might-finally-help-me-get-through-the-pain-of-organizing-my-meetings</link>
      <pubDate>Tue, 27 Jan 2026 10:14:12 +0000</pubDate>
      <guid isPermaLink="false">n65d6E2KPsi4D6wqB4GhT9</guid>
      <description>Gemini feature in Google Calendar can find a meeting time which works for everyone.</description>
    </item>
    <item>
      <title>Mix &#233;lectrique de l&#8217;UE&#160;: le solaire et l&#8217;&#233;olien d&#233;passent les &#233;nergies fossiles pour la premi&#232;re fois</title>
      <link>https://www.frandroid.com/survoltes/2956035_mix-electrique-de-lue-le-solaire-et-leolien-depassent-les-energies-fossiles-pour-la-premiere-fois</link>
      <pubDate>Tue, 27 Jan 2026 10:10:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2956035_mix-electrique-de-lue-le-solaire-et-leolien-depassent-les-energies-fossiles-pour-la-premiere-fois</guid>
      <description>
D&#233;sormais, seuls 29&#160;% de la production d&#8217;&#233;lectricit&#233; de l&#8217;Union europ&#233;enne proviennent encore des combustibles fossiles, les &#201;tats membres poursuivant progressivement la sortie du charbon. De plus, en comparaison avec les autres grandes puissances mondiales, l&#8217;UE semble faire figure de bon &#233;l&#232;ve.
</description>
    </item>
    <item>
      <title>2025 a &#233;t&#233; une excellente ann&#233;e pour les voitures &#233;lectriques en Europe et ces chiffres le prouvent</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2956091_2025-a-ete-une-excellente-annee-pour-les-voitures-electriques-en-europe-et-ces-chiffres-le-prouvent</link>
      <pubDate>Tue, 27 Jan 2026 10:06:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2956091_2025-a-ete-une-excellente-annee-pour-les-voitures-electriques-en-europe-et-ces-chiffres-le-prouvent</guid>
      <description>
Contre toute attente, les ventes de voitures &#233;lectriques se sont envol&#233;es en Europe en 2025.&#160;Les immatriculations ont grimp&#233; de 51&#160;% en d&#233;cembre, avec une belle hausse en France.
</description>
    </item>
    <item>
      <title>&#171; Windows 11 est sans doute dans le pire &#233;tat de son histoire &#187; : pourquoi Microsoft g&#226;che la sortie des nouvelles puces Intel Panther Lake</title>
      <link>https://www.frandroid.com/marques/2956085_windows-11-est-sans-doute-dans-le-pire-etat-de-son-histoire-pourquoi-microsoft-risque-de-gacher-la-sortie-de-nouveaux-pc-en-2026</link>
      <pubDate>Tue, 27 Jan 2026 10:02:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2956085_windows-11-est-sans-doute-dans-le-pire-etat-de-son-histoire-pourquoi-microsoft-risque-de-gacher-la-sortie-de-nouveaux-pc-en-2026</guid>
      <description>
Et si le principal ennemi du PC &#233;tait Windows 11 ? L'&#233;tat d&#233;sastreux de l'OS de Microsoft pourrait bien entacher le lancement de nouveaux PC en ce d&#233;but d'ann&#233;e 2026.
</description>
    </item>
    <item>
      <title>The best Apple Watch accessories for 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-apple-watch-accessories-133025270.html?src=rss</link>
      <pubDate>Tue, 27 Jan 2026 10:00:36 +0000</pubDate>
      <guid isPermaLink="false">48532940-d569-34f0-b4cb-0a5a6d1277db</guid>
      <description>The right accessories can transform your Apple Watch into the best workout companion, a stylish timepiece and everything in between. Whether you&#8217;re looking to upgrade its style, recharge its battery quickly or make it even more convenient to use on the go, there&#8217;s an accessory out there that can help. From a stylish sport loop that keeps things comfortable during workouts to a sturdy charging stand for your bedside, there are plenty of ways to enhance your experience.Apple has a few Watches at this point: the flagship model, the Ultra 2 and the Watch SE, and you can find accessories for any an...</description>
    </item>
    <item>
      <title>Study Documents Real World Downside of EV Fast Charging. But There&#8217;s Good News Too</title>
      <link>https://gizmodo.com/study-documents-real-world-downside-of-ev-fast-charging-but-theres-good-news-too-2000714235</link>
      <pubDate>Tue, 27 Jan 2026 10:00:22 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000714235</guid>
      <description>The conventional wisdom on caring for your battery is still true, but battery life is also more durable than expected.</description>
    </item>
    <item>
      <title>Southwest Airlines Says Bye to Open Seating&#8212;and Hello to Boarding Complexity</title>
      <link>https://www.wired.com/story/southwest-airlines-ends-open-seating/</link>
      <pubDate>Tue, 27 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">6977a927b75ceb1047d8997a</guid>
      <description>An airline&#8217;s boarding policy shake-up shows the limits of efficiency. (Spoiler: It&#8217;s money.)</description>
    </item>
    <item>
      <title>&#8216;Among the worst we&#8217;ve seen&#8217;: report slams xAI&#8217;s Grok over child safety failures</title>
      <link>https://techcrunch.com/2026/01/27/among-the-worst-weve-seen-report-slams-xais-grok-over-child-safety-failures/</link>
      <pubDate>Tue, 27 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3086437</guid>
      <description>&#8220;We assess a lot of AI chatbots at Common Sense Media, and they all have risks, but Grok is among the worst we&#8217;ve seen,&#8221; Robbie Torney of Common Sense Media said.</description>
    </item>
    <item>
      <title>How AI-induced cultural stagnation is already happening</title>
      <link>https://www.fastcompany.com/91479514/how-ai-induced-cultural-stagnation-is-already-happening</link>
      <pubDate>2026-01-27T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91479514/how-ai-induced-cultural-stagnation-is-already-happening</guid>
      <description>AI-mediated culture is already being filtered in ways that favor the familiar, the describable, and the conventional.
Generative AI was trained on centuries of art and writing produced by humans.</description>
    </item>
    <item>
      <title>Disruptive innovation is key to building world-changing companies, but it needs a moral compass in the age of AI</title>
      <link>https://www.fastcompany.com/91480458/disruptive-innovation-ai-moral-compass</link>
      <pubDate>2026-01-27T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480458/disruptive-innovation-ai-moral-compass</guid>
      <description>The theory that explains how industries rise and fall is offering us a warning sign&#8212;and could help us prevent technical progress from stealing our humanity.
At the Consumer Electronics Show in early January, Razer made waves by unveiling a small jar containing a holographic anime bot designed to accompany gamers not just during gameplay, but in daily life. The lava-lamp-turned-girlfriend is undeniably bizarre&#8212;but Razer&#8217;s vision of constant, sometimes sexualized companionship is hardly an outlier in the AI market....</description>
    </item>
    <item>
      <title>Anthropic cofounder Daniela Amodei says trusted enterprise AI will transcend the hype cycle</title>
      <link>https://www.fastcompany.com/91480487/anthropic-cofounder-daniela-amodei-says-that-ai-entreprise-business-can-trust-will-transcend-the-hype-cycle</link>
      <pubDate>2026-01-27T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480487/anthropic-cofounder-daniela-amodei-says-that-ai-entreprise-business-can-trust-will-transcend-the-hype-cycle</guid>
      <description>Anthropic is positioning Claude as the invisible infrastructure for regulated industries and enterprises, where &#8216;work is hard and stakes are real.&#8217;
While Silicon Valley argues over bubbles, benchmarks, and who has the smartest model, Anthropic has been focused on solving problems that rarely generate hype but ultimately determine adoption: whether AI can be trusted to operate inside the world&#8217;s most sensitive systems....</description>
    </item>
    <item>
      <title>Toyota et Tesla doubl&#233;s ? Ce g&#233;ant chinois annonce ses batteries solides bien avant la concurrence</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2955989_toyota-et-tesla-doubles-ce-geant-chinois-annonce-ses-batteries-solides-bien-avant-la-concurrence</link>
      <pubDate>Tue, 27 Jan 2026 09:58:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2955989_toyota-et-tesla-doubles-ce-geant-chinois-annonce-ses-batteries-solides-bien-avant-la-concurrence</guid>
      <description>
Le groupe chinois Geely serait pr&#234;t &#224; produire des batteries solides dans le courant de l&#8217;ann&#233;e 2026. Et on sait d&#233;j&#224; quelles voitures &#233;lectriques pourraient y avoir droit.
</description>
    </item>
    <item>
      <title>Le Xbox Cloud Gaming fait peau neuve ! Voici comment tester la nouvelle interface en avant-premi&#232;re</title>
      <link>https://www.frandroid.com/marques/microsoft/2956059_le-xbox-cloud-gaming-fait-peau-neuve-voici-comment-tester-la-nouvelle-interface-en-avant-premiere</link>
      <pubDate>Tue, 27 Jan 2026 09:56:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2956059_le-xbox-cloud-gaming-fait-peau-neuve-voici-comment-tester-la-nouvelle-interface-en-avant-premiere</guid>
      <description>
Il est d&#233;j&#224; possible de tester la toute nouvelle interface du Xbox Cloud Gaming avant son d&#233;ploiement. Une version b&#234;ta est accessible aux joueurs du service qui souhaiteraient d&#233;couvrir le design rafra&#238;chi et les nouvelles features du service.
</description>
    </item>
    <item>
      <title>Le Galaxy A57 aussi fin que le Galaxy S26&#160;? Les premi&#232;res images fuitent</title>
      <link>https://www.01net.com/actualites/galaxy-a57-aussi-fin-galaxy-s26-premieres-images-fuitent.html</link>
      <pubDate>Tue, 27 Jan 2026 09:50:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322634</guid>
      <description>Cette ann&#233;e, le Galaxy A57 pourrait bien faire du bruit. C'est du moins ce que laisse entendre cette nouvelle fuite qui montre le design incroyablement fin du nouveau smartphone milieu de gamme de Samsung.</description>
    </item>
    <item>
      <title>How applying cognitive diversity to LLMs could transform the user experience</title>
      <link>https://www.techradar.com/pro/how-applying-cognitive-diversity-to-llms-could-transform-the-user-experience</link>
      <pubDate>Tue, 27 Jan 2026 09:50:20 +0000</pubDate>
      <guid isPermaLink="false">8oVbthQeny87RrYPAPJXnU</guid>
      <description>Exploring how to get the answers and information we want from LLMs, in the way that we need.</description>
    </item>
    <item>
      <title>I spent days testing Acer&#8217;s new 16-inch laptop &#8212; and sadly AI remains just a gimmick</title>
      <link>https://www.techradar.com/computing/windows-laptops/acer-aspire-16-ai-review</link>
      <pubDate>Tue, 27 Jan 2026 09:50:19 +0000</pubDate>
      <guid isPermaLink="false">Exjp7gbqNoE6AmtrX5y94j</guid>
      <description>The Acer Aspire 16 AI certainly looks like a premium laptop &#8212; but how does it perform?</description>
    </item>
    <item>
      <title>OnePlus 15R : ce r&#233;cent smartphone premium abordable baisse d&#233;j&#224; son prix gr&#226;ce aux soldes</title>
      <link>https://www.frandroid.com/bons-plans/2915187_oneplus-15r-ce-recent-smartphone-premium-abordable-baisse-deja-son-prix-grace-aux-soldes</link>
      <pubDate>Tue, 27 Jan 2026 09:49:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2915187_oneplus-15r-ce-recent-smartphone-premium-abordable-baisse-deja-son-prix-grace-aux-soldes</guid>
      <description>
Le nouveau flagship killer de OnePlus, le 15R, a &#224; peine pos&#233; un pied sur le march&#233; qu&#8217;une promotion vient d&#233;j&#224; s&#8217;inviter lors des soldes. La version 12/512 Go s&#8217;affiche &#224; 729 euros au lieu de 829 euros, directement sur le site de la marque. 
</description>
    </item>
    <item>
      <title>Un bouton cam&#233;ra sur les Galaxy S26, Samsung y a pens&#233;</title>
      <link>https://www.frandroid.com/marques/samsung/2956141_un-bouton-camera-sur-les-galaxy-s26-samsung-y-a-pense</link>
      <pubDate>Tue, 27 Jan 2026 09:48:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2956141_un-bouton-camera-sur-les-galaxy-s26-samsung-y-a-pense</guid>
      <description>
Alors qu'Apple a introduit son bouton &#171; Commande de l'appareil photo &#187; sur les iPhone 16, Samsung semblait pr&#234;t &#224; suivre la tendance pour ses futurs Galaxy S26. 
</description>
    </item>
    <item>
      <title>Cyberattaque russe sur Chrome&#160;: ce malware astucieux est capable de pi&#233;ger les internautes les plus vigilants</title>
      <link>https://www.01net.com/actualites/cyberattaque-russe-chrome-malware-astucieux-capable-pieger-internautes-plus-vigilants.html</link>
      <pubDate>Tue, 27 Jan 2026 09:44:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322632</guid>
      <description>Un nouveau malware russe s'attaque &#224; Chrome. Ce logiciel malveillant, baptis&#233; Stanley, est capable de pi&#233;ger les utilisateurs les plus prudents. Le virus cherche &#224; voler vos identifiants et mots de passe.</description>
    </item>
    <item>
      <title>Le meilleur robot-tondeuse de l&#8217;ann&#233;e a d&#233;j&#224; un successeur</title>
      <link>https://www.01net.com/actualites/le-meilleur-robot-tondeuse-de-lannee-a-deja-un-successeur.html</link>
      <pubDate>Tue, 27 Jan 2026 09:42:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322655</guid>
      <description>Ce n&#8217;est pas encore le printemps mais les nouveaux robots tondeuses sont l&#224;. Mova, r&#233;f&#233;rence du secteur voit grand avec 8 mod&#232;les pour tous types de jardins et des surfaces allant de 250 m2 &#224; 2 000 m2.</description>
    </item>
    <item>
      <title>Courroie, capteur de couple et poids plume : &#224; 2 300 &#8364;, le v&#233;lo &#233;lectrique compact Reany C1 coche beaucoup de cases</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2955813_courroie-capteur-de-couple-et-poids-plume-a-2-300-e-le-velo-electrique-compact-reany-c1-coche-beaucoup-de-cases</link>
      <pubDate>Tue, 27 Jan 2026 09:35:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2955813_courroie-capteur-de-couple-et-poids-plume-a-2-300-e-le-velo-electrique-compact-reany-c1-coche-beaucoup-de-cases</guid>
      <description>
Avec moins de 18 kg sur la balance, le Reany C1 est la preuve qu&#8217;il est possible de concevoir un v&#233;lo &#233;lectrique compact (20 pouces), avec un design soign&#233;, tout en &#233;tant bien &#233;quip&#233;.
</description>
    </item>
    <item>
      <title>Marre de Windows 11 ? Ce d&#233;veloppeur ressuscite Windows 7 et Vista avec des mises &#224; jour de 2026</title>
      <link>https://www.frandroid.com/marques/microsoft/2955967_windows-7-et-vista-font-leur-retour-inattendu-en-2026</link>
      <pubDate>Tue, 27 Jan 2026 09:33:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2955967_windows-7-et-vista-font-leur-retour-inattendu-en-2026</guid>
      <description>
Les utilisateurs nostalgiques d&#8217;un Windows sans fioritures pourraient se laisser tenter par ces anciens syst&#232;mes d&#8217;exploitation ramen&#233;s &#224; la vie et mis &#224; jour par un moddeur.
</description>
    </item>
    <item>
      <title>A neuroscientist&#8217;s 10 signs you&#8217;re doing better in life than you think</title>
      <link>https://www.fastcompany.com/91480344/a-neuroscientists-10-signs-youre-doing-better-than-you-think-in-life</link>
      <pubDate>2026-01-27T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480344/a-neuroscientists-10-signs-youre-doing-better-than-you-think-in-life</guid>
      <description>What you need isn&#8217;t to achieve more but to recognize your achievements more.
Many people spend an incredible amount of time worrying about how to be more successful in life. But what if that&#8217;s the wrong question? What if the real struggle for lots of us isn&#8217;t how to be successful, but how to actually feel successful?</description>
    </item>
    <item>
      <title>Apple d&#233;ploie une mise &#224; jour surprise pour un iPhone vieux de 12&#160;ans</title>
      <link>https://www.frandroid.com/marques/apple/2955991_apple-deploie-une-mise-a-jour-surprise-pour-un-iphone-vieux-de-12-ans</link>
      <pubDate>Tue, 27 Jan 2026 09:28:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2955991_apple-deploie-une-mise-a-jour-surprise-pour-un-iphone-vieux-de-12-ans</guid>
      <description>
Les propri&#233;taires d&#8217;iPhone 5s et 6 ont re&#231;u un petit cadeau de bonne ann&#233;e de la part d&#8217;Apple sous la forme d&#8217;une mise &#224; jour &#233;tendant la prise en charge d&#8217;iMessage et de FaceTime.
</description>
    </item>
    <item>
      <title>Toyota et Honda expliquent pourquoi la r&#233;volution promise des batteries solides va prendre plus de temps que pr&#233;vu</title>
      <link>https://www.frandroid.com/marques/2955957_toyota-et-honda-expliquent-pourquoi-la-revolution-promise-des-batteries-solides-va-prendre-plus-de-temps-que-prevu</link>
      <pubDate>Tue, 27 Jan 2026 09:25:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2955957_toyota-et-honda-expliquent-pourquoi-la-revolution-promise-des-batteries-solides-va-prendre-plus-de-temps-que-prevu</guid>
      <description>
Si les batteries solides sont tr&#232;s attendues, il faudra &#234;tre patient avant de les voir arriver sur nos voitures &#233;lectriques. Toyota et Honda, qui travaillent dessus depuis des ann&#233;es, nous expliquent les raisons.
</description>
    </item>
    <item>
      <title>L&#8217;Apple Watch rattrape son plus gros retard face aux montres de sport gr&#226;ce &#224; ces deux applications</title>
      <link>https://www.frandroid.com/marques/apple/2956033_lapple-watch-rattrape-son-plus-gros-retard-face-aux-montres-de-sport-grace-a-ces-deux-applications</link>
      <pubDate>Tue, 27 Jan 2026 09:22:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2956033_lapple-watch-rattrape-son-plus-gros-retard-face-aux-montres-de-sport-grace-a-ces-deux-applications</guid>
      <description>
Ce sont deux applications sp&#233;cialis&#233;es dans l'outdoor et l'activit&#233; sportive qui se sont enrichies cette semaine sur Apple Watch avec la possibilit&#233; de suivre des trac&#233;s directement dans les applications Strava et Komoot. 
</description>
    </item>
    <item>
      <title>De 1,65 milliard &#224; 13,2 millions de dollars : la chute folle de Rad Power Bikes, tout juste sauv&#233;e de la faillite</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2956081_de-165-milliard-a-132-millions-de-dollars-la-chute-folle-de-rad-power-bikes-tout-juste-sauvee-de-la-faillite</link>
      <pubDate>Tue, 27 Jan 2026 09:19:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2956081_de-165-milliard-a-132-millions-de-dollars-la-chute-folle-de-rad-power-bikes-tout-juste-sauvee-de-la-faillite</guid>
      <description>
Plac&#233;e en faillite mi-d&#233;cembre avec 73 millions de dollars de dette, Rad Power Bikes a trouv&#233; un repreneur &#224; l&#8217;issue d&#8217;une vente aux ench&#232;res de ses actifs. Le fabricant am&#233;ricain de v&#233;los &#233;lectriques doit &#234;tre rachet&#233; pour 13,2 millions de dollars par Life Electric Vehicle Holdings, sous r&#233;serve de l&#8217;approbation du tribunal.
</description>
    </item>
    <item>
      <title>Sign up for The Farmers Dog and get 60% off the first box for your furry friend</title>
      <link>https://mashable.com/article/jan-26-the-farmers-dog-deal</link>
      <pubDate>Tue, 27 Jan 2026 09:10:04 +0000</pubDate>
      <guid isPermaLink="false">06aof8CqFB5SP0PSRcK3OOC</guid>
      <description>As of Jan. 26, The Farmer's Dog is offering 60% off the first box when you sign up for one of their plans today.</description>
    </item>
    <item>
      <title>Just got a new Android tablet? Heres how to set it up.</title>
      <link>https://mashable.com/article/how-to-set-up-android-tablet</link>
      <pubDate>Tue, 27 Jan 2026 09:05:49 +0000</pubDate>
      <guid isPermaLink="false">04YMub0CGjDTVbyHXMFXZxR</guid>
      <description>Just got a new Android tablet? Whether it's from Samsung, Lenovo, Google, or OnePlus, the setup will always be the same. Here's how to set up an Android tablet.</description>
    </item>
    <item>
      <title>Pixel&#160;: la derni&#232;re mise &#224; jour casse le Wi-Fi et le Bluetooth sur certains appareils</title>
      <link>https://www.01net.com/actualites/pixel-la-derniere-mise-a-jour-casse-le-wi-fi-et-le-bluetooth-sur-certains-appareils.html</link>
      <pubDate>Tue, 27 Jan 2026 09:00:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322638</guid>
      <description>Apr&#232;s la mise &#224; jour du mois de janvier, certains possesseurs de smartphones Pixel se plaignent de ne plus pouvoir utiliser les connexions sans fil sur leur appareil.</description>
    </item>
    <item>
      <title>Is detoxing worth the&#160;hype?</title>
      <link>https://www.fastcompany.com/91478616/is-detoxing-worth-the-hype</link>
      <pubDate>2026-01-27T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91478616/is-detoxing-worth-the-hype</guid>
      <description>Social media is full of juice cleanses, detox teas, charcoal pills, and more promising to purge the body of mysterious toxins and return it to a purer state.
January arrives with a familiar hangover. Too much food. Too much drink. Too much screen time. And suddenly social media is full of green juices, charcoal supplements, foot patches, and seven-day &#8220;liver resets,&#8221; all promising to purge the body of mysterious toxins and return it to a purer state....</description>
    </item>
    <item>
      <title>How the Grammys are adapting in a world of AI music, &#8216;KPop Demon Hunters,&#8217; and a changing music marketplace</title>
      <link>https://www.fastcompany.com/91480465/how-the-grammys-are-adapting-in-a-world-of-ai-music-kpop-demon-hunters-and-a-changing-music-marketplace</link>
      <pubDate>2026-01-27T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480465/how-the-grammys-are-adapting-in-a-world-of-ai-music-kpop-demon-hunters-and-a-changing-music-marketplace</guid>
      <description>The Recording Academy CEO Harvey Mason Jr. on what distinguishes the Grammy Awards in the age of AI.
The Grammy Awards return February 1 at a pivotal moment for the music industry, one shaped by trending Latin artists, resurgent rock legends, and even charting AI acts. To unpack what will make this year&#8217;s broadcast distinctive, the Recording Academy CEO Harvey Mason Jr. shares how Grammy winners are chosen, and how music both reflects and influences the broader business marketplace....</description>
    </item>
  </channel>
</rss>
