<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 03 Feb 2026 15:54:53 GMT</lastBuildDate>
    <item>
      <title>Fitbit founders launch AI platform to help families monitor their health</title>
      <link>https://techcrunch.com/2026/02/03/fitbit-founders-launch-ai-platform-to-help-families-monitor-their-health/</link>
      <pubDate>Tue, 03 Feb 2026 15:53:36 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3089083</guid>
      <description>Luffu uses AI in the background to gather and organize family information, learn day-to-day patterns, and flag notable changes so families can stay aligned and address potential wellbeing issues.</description>
    </item>
    <item>
      <title>Soldes PC portables : voici l&#8217;ultime s&#233;lection des meilleures promotions sur les laptops bureautiques et gaming</title>
      <link>https://www.frandroid.com/bons-plans/2935325_soldes-pc-portables-voici-lultime-selection-des-meilleures-promotions-sur-les-laptops-bureautiques-et-gaming</link>
      <pubDate>Tue, 03 Feb 2026 15:49:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2935325_soldes-pc-portables-voici-lultime-selection-des-meilleures-promotions-sur-les-laptops-bureautiques-et-gaming</guid>
      <description>
Configuration gaming, bureautique, avec carte graphique Nvidia ou non, processeur AMD, Intel ou Qualcomm, &#233;cran IPS ou OLED... Nombre de PC portables sont en promotion lors de la derni&#232;re d&#233;marque des soldes d'hiver mais seuls quelques-uns m&#233;ritent vraiment de figurer dans cette s&#233;lection.
</description>
    </item>
    <item>
      <title>Apple&#8217;s tiny but mighty iPad Mini is $100 off in every storage configuration</title>
      <link>https://www.theverge.com/gadgets/872788/apple-ipad-mini-amazfit-active-2-fitness-tracker-deal-sale</link>
      <pubDate>2026-02-03T10:48:45-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=872788</guid>
      <description>If your phone feels too small but most tablets feel too big, Apple&#8217;s latest iPad Mini functions as a nice in-between. Thankfully, if you&#8217;ve been waiting for a discount, the base model with Wi-Fi and 128GB of storage is on sale at Amazon and Best Buy for $399 ($100 off), which is $50 shy of [&#8230;]</description>
    </item>
    <item>
      <title>Alerte Play Store&#160;: le malware Anatsa a pirat&#233; 50&#160;000 smartphones Android, d&#233;sinstallez vite cette app</title>
      <link>https://www.01net.com/actualites/alerte-play-store-malware-anatsa-pirate-50-000-smartphones-android-desinstallez-vite-cette-app.html</link>
      <pubDate>Tue, 03 Feb 2026 15:46:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323948</guid>
      <description>Un faux &#171; lecteur de documents &#187; a &#233;t&#233; d&#233;busqu&#233; sur le Play Store. Cette application cache le cheval de Troie bancaire Anatsa, taill&#233; pour siphonner l'argent de votre compte.</description>
    </item>
    <item>
      <title>Samsung Galaxy S26 Ultra : design, &#233;cran, fen&#234;tre de sortie, prix&#8230; Tout ce qu&#8217;on sait sur le futur smartphone</title>
      <link>https://www.frandroid.com/marques/samsung/2849839_samsung-galaxy-s26-ultra-design-ecran-fenetre-de-sortie-prix-tout-ce-quon-sait-sur-le-futur-smartphone</link>
      <pubDate>Tue, 03 Feb 2026 15:45:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2849839_samsung-galaxy-s26-ultra-design-ecran-fenetre-de-sortie-prix-tout-ce-quon-sait-sur-le-futur-smartphone</guid>
      <description>
Le Samsung Galaxy S26 Ultra approche petit &#224; petit, voici tout ce que l'on sait d&#233;j&#224; &#224; son sujet (fen&#234;tre de sortie, design, &#233;cran, performances, etc.).
</description>
    </item>
    <item>
      <title>Le Nothing Phone (3a) et son design transparent si particulier d&#233;j&#224; avec 40 % de remise</title>
      <link>https://www.frandroid.com/bons-plans/2964635_le-nothing-phone-3a-et-son-design-transparent-si-particulier-deja-avec-40-de-remise</link>
      <pubDate>Tue, 03 Feb 2026 15:45:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2964635_le-nothing-phone-3a-et-son-design-transparent-si-particulier-deja-avec-40-de-remise</guid>
      <description>
Entre son design transparent et son syst&#232;me de glyph, le Nothing Phone (3a) saura vous surprendre. Pour vous attirer encore plus, AliExpress retire presque 40 % de son prix de base et le fait tomber &#224; seulement 214,46 euros avec un code promo.
</description>
    </item>
    <item>
      <title>Abonn&#233;s Crunchyroll, il y a une mauvaise nouvelle pour vous</title>
      <link>https://www.frandroid.com/marques/sony/2964733_abonnes-crunchyroll-il-y-a-une-mauvaise-nouvelle-pour-vous</link>
      <pubDate>Tue, 03 Feb 2026 15:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2964733_abonnes-crunchyroll-il-y-a-une-mauvaise-nouvelle-pour-vous</guid>
      <description>
La plateforme de streaming d'animation Crunchyroll d&#233;marre l'ann&#233;e 2026 avec un changement dont les utilisateurs se seraient bien pass&#233;s.
</description>
    </item>
    <item>
      <title>L&#8217;empire de Musk vaut maintenant 1 250 milliards&#8230; mais repose sur une faille majeure</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronautique-empire-musk-vaut-maintenant-1-250-milliards-mais-repose-faille-majeure-130866/#xtor%3DRSS-8</link>
      <pubDate>Tue, 03 Feb 2026 16:43:00 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronautique-empire-musk-vaut-maintenant-1-250-milliards-mais-repose-faille-majeure-130866/#xtor%3DRSS-8</guid>
      <description>Dans une nouvelle op&#233;ration commerciale, Elon Musk a r&#233;uni X et xAI&#160;dans un seul groupe, le tout, d&#233;sormais sous la coupe de SpaceX. Ce qui en fait aujourd'hui l'entreprise non cot&#233;e en Bourse la plus ch&#232;re du monde. Mais pourquoi tout ce fracas ?</description>
    </item>
    <item>
      <title>Pourquoi la Chine dit non aux poign&#233;es de portes &#233;lectriques des voitures</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2964425_pourquoi-la-chine-dit-non-aux-poignees-de-portes-electriques-des-voitures</link>
      <pubDate>Tue, 03 Feb 2026 15:40:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2964425_pourquoi-la-chine-dit-non-aux-poignees-de-portes-electriques-des-voitures</guid>
      <description>
Pourtant tr&#232;s populaires sur les voitures &#233;lectriques, la Chine vient d&#8217;acter l&#8217;interdiction des poign&#233;es de porte uniquement &#233;lectriques. Une d&#233;marche visant &#224; accro&#238;tre la s&#233;curit&#233; &#224; bord des v&#233;hicules, mais qui ne devrait pas plaire &#224; tout le monde !
</description>
    </item>
    <item>
      <title>YouTube siffle la fin de la r&#233;cr&#233; pour ceux qui ne veulent pas payer la lecture en arri&#232;re-plan</title>
      <link>https://www.01net.com/actualites/youtube-semble-bloquer-lecture-videos-arriere-plan-navigateurs.html</link>
      <pubDate>Tue, 03 Feb 2026 15:40:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323079</guid>
      <description>YouTube serait peut-&#234;tre en train de d&#233;sactiver la lecture en arri&#232;re-plan sur plusieurs navigateurs mobiles tiers, une fonction pris&#233;e pour ne pas avoir &#224; payer d'abonnement Premium.</description>
    </item>
    <item>
      <title>The year of the AI agents? More outages? Here&#8217;s what lies ahead for IT teams in 2026</title>
      <link>https://www.techradar.com/pro/the-year-of-the-ai-agents-more-outages-heres-what-lies-ahead-for-it-teams-in-2026</link>
      <pubDate>Tue, 03 Feb 2026 15:39:39 +0000</pubDate>
      <guid isPermaLink="false">YNG7BjDBkU5hcQAefBWY6j</guid>
      <description>In 2026, AI agents, chaos engineering, and multi-cloud strategies will redefine IT resilience and risk management.</description>
    </item>
    <item>
      <title>Ce n&#8217;est pas une panne, Ubisoft a coup&#233; ses serveurs</title>
      <link>https://www.frandroid.com/produits-android/console/2964897_ce-nest-pas-une-panne-ubisoft-a-coupe-ses-serveurs</link>
      <pubDate>Tue, 03 Feb 2026 15:36:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2964897_ce-nest-pas-une-panne-ubisoft-a-coupe-ses-serveurs</guid>
      <description>
Ubisoft proc&#232;de &#224; une maintenance &#224; la fois inattendue et d'envergure. L'&#233;diteur fran&#231;ais a coup&#233; ses serveurs pendant plusieurs heures.
</description>
    </item>
    <item>
      <title>Quelle est la voiture &#233;lectrique avec la meilleure autonomie en 2026 ?</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/724697_voitures-electriques-plus-grande-autonomie-batterie</link>
      <pubDate>Tue, 03 Feb 2026 15:35:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/724697_voitures-electriques-plus-grande-autonomie-batterie</guid>
      <description>
D&#233;couvrez notre comparatif des meilleures autonomies pour une voiture &#233;lectrique. Des citadines, aux berlines en passant par les SUV, voici une s&#233;lection des voitures &#233;lectriques &#224; la meilleure autonomie sur la route.
</description>
    </item>
    <item>
      <title>Crise du smartphone en 2026 ? Pas pour Google qui pourrait rafler la mise avec ses Pixel</title>
      <link>https://www.frandroid.com/marques/google/2964863_crise-du-smartphone-en-2026-pas-pour-google-qui-pourrait-rafler-la-mise-avec-ses-pixel</link>
      <pubDate>Tue, 03 Feb 2026 15:32:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2964863_crise-du-smartphone-en-2026-pas-pour-google-qui-pourrait-rafler-la-mise-avec-ses-pixel</guid>
      <description>
Le march&#233; du mobile tire la langue, asphyxi&#233; par le co&#251;t des composants et une demande mondiale en berne. Pourtant, au milieu de la temp&#234;te, un acteur que l'on n'attendait pas forc&#233;ment &#224; ce niveau semble avoir trouv&#233; la formule magique : Google. Les pr&#233;visions pour 2026 sont excellentes pour la gamme Pixel, et on vous explique pourquoi.
</description>
    </item>
    <item>
      <title>Notepad++ says it was hijacked by Chinese state-sponsored hackers</title>
      <link>https://www.engadget.com/apps/notepad-says-it-was-hijacked-by-chinese-state-sponsored-hackers-153000268.html?src=rss</link>
      <pubDate>Tue, 03 Feb 2026 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">dca5e1a3-bfbe-47ac-aee6-d7a5f262db35</guid>
      <description>Last year, the creator of Notepad++ rolled out an update for the text and source code editor after security experts reported that bad actors were hijacking its update mechanism to redirect traffic to malicious servers. It led to users downloading compromised executables that could infect their devices. Now, Don Ho has revealed that multiple security experts investigated the breach and determined that the threat actor &#8220;is likely a Chinese state-sponsored group.&#8221; He said it explained why experts observed highly selective targeting during the campaign and why only traffic from certain users were ...</description>
    </item>
    <item>
      <title>Moltbook, le r&#233;seau social o&#249; les IA discutent entre elles, inqui&#232;te de plus en plus</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2964587_moltbook-le-reseau-social-ou-les-ia-discutent-entre-elles-inquiete-de-plus-en-plus</link>
      <pubDate>Tue, 03 Feb 2026 15:27:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2964587_moltbook-le-reseau-social-ou-les-ia-discutent-entre-elles-inquiete-de-plus-en-plus</guid>
      <description>
La plateforme Moltbook est sur toutes les l&#232;vres depuis sa cr&#233;ation. Une semaine plus tard, des voix s'&#233;l&#232;vent pour alerter sur ses d&#233;rives potentielles.
</description>
    </item>
    <item>
      <title>Millions of books died so Claude could live</title>
      <link>https://www.theverge.com/podcast/872998/anthropic-claude-books-netflix-theaters-vergecast</link>
      <pubDate>2026-02-03T10:19:28-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=872998</guid>
      <description>When ChatGPT launched, in November of 2022, it started a race that almost immediately consumed the tech industry. OpenAI didn't invent the concept of AI, but most of the state-of-the-art technology was confined to research labs at companies and institutions around the world. Then, suddenly, it was everywhere. And better than anyone expected. So many [&#8230;]...</description>
    </item>
    <item>
      <title>AI as the key to overcoming retail&#8217;s next challenge: achieving operational excellence</title>
      <link>https://www.techradar.com/pro/ai-as-the-key-to-overcoming-retails-next-challenge-achieving-operational-excellence</link>
      <pubDate>Tue, 03 Feb 2026 15:16:12 +0000</pubDate>
      <guid isPermaLink="false">L4bX9VRTDXUca9Qp8nVEQL</guid>
      <description>How achieving operational brilliance can be achieved with AI to bridge the gap between the issue many retailers face -  limited resources and staffing.</description>
    </item>
    <item>
      <title>Spain set to ban social media for children under 16</title>
      <link>https://www.engadget.com/social-media/spain-set-to-ban-social-media-for-children-under-16-151546884.html?src=rss</link>
      <pubDate>Tue, 03 Feb 2026 15:15:46 +0000</pubDate>
      <guid isPermaLink="false">059cfee7-d2f6-4498-88ca-3db380e00123</guid>
      <description>Spain will join the growing list of countries banning access to social media for children, Prime Minister Pedro Sanchez announced Tuesday. The law will apply to users under 16 years of age amidst a broader push to hold social media companies accountable for hate speech, social division and illegal content.
Speaking at the World Governments Summit in Dubai, Prime Minister Sanchez excoriated social media, calling it a "failed state" where "laws are ignored and crime is endured." He spoke to the importance of digital governance for these platforms, highlighting recent incidents like X's AI chatbo...</description>
    </item>
    <item>
      <title>Trump Admin Sued For Defunding the &#8220;Most Important Infrastructure Project in the Country&#8221;</title>
      <link>https://gizmodo.com/trump-admin-sued-for-defunding-the-most-important-infrastructure-project-in-the-country-2000717187</link>
      <pubDate>Tue, 03 Feb 2026 15:15:46 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000717187</guid>
      <description>The project would improve the most heavily traveled portion of the national passenger rail system.</description>
    </item>
    <item>
      <title>Xbox Game Pass en f&#233;vrier 2026 : High on Life 2, Avatar et une tonne de p&#233;pites &#224; d&#233;couvrir !</title>
      <link>https://www.frandroid.com/marques/microsoft/2964819_game-pass-202606-2</link>
      <pubDate>Tue, 03 Feb 2026 15:12:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2964819_game-pass-202606-2</guid>
      <description>
Voici la liste de tous les jeux qui rejoignent le catalogue Xbox Game Pass en f&#233;vrier 2026.
</description>
    </item>
    <item>
      <title>Dangerous new malware targets macOS devices via OpenVSX extensions - here's how to stay safe</title>
      <link>https://www.techradar.com/pro/security/dangerous-new-malware-targets-macos-devices-via-openvsx-extensions-heres-how-to-stay-safe</link>
      <pubDate>Tue, 03 Feb 2026 15:10:00 +0000</pubDate>
      <guid isPermaLink="false">F43JV5Z9H8hA4VYKv88Fba</guid>
      <description>GlassWorm malware is expanding to open source platforms, targeting macOS users with infostealers.</description>
    </item>
    <item>
      <title>This May Be the Oldest Known Victim of a Bear Attack&#8212;and It&#8217;s Brutal</title>
      <link>https://gizmodo.com/this-may-be-the-oldest-known-victim-of-a-bear-attack-and-its-brutal-2000716962</link>
      <pubDate>Tue, 03 Feb 2026 15:05:22 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000716962</guid>
      <description>At least they had a nice burial?</description>
    </item>
    <item>
      <title>Disney&#8217;s Theme Parks Chief Is Now Running the Whole Show</title>
      <link>https://gizmodo.com/disney-ceo-josh-damaro-bob-iger-2000717207</link>
      <pubDate>Tue, 03 Feb 2026 15:00:42 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000717207</guid>
      <description>Josh D'Amaro will take over from CEO Bob Iger this year, with TV studio chief Dana Walden serving as president.</description>
    </item>
    <item>
      <title>La Switch est la console la plus vendue de l&#8217;histoire de Nintendo, devant la DS</title>
      <link>https://www.01net.com/actualites/la-switch-est-la-console-la-plus-vendue-de-lhistoire-de-nintendo-devant-la-ds.html</link>
      <pubDate>Tue, 03 Feb 2026 15:00:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323964</guid>
      <description>Malgr&#233; le lancement de la Switch 2 en juin dernier, Nintendo continue de tirer tout le jus restant des bonnes vieilles Switch de premi&#232;re g&#233;n&#233;ration (il en reste !). Des mod&#232;les qui continuent de se vendre&#8230; et qui repr&#233;sentent d&#233;sormais la gamme la plus vendue du constructeur, devant la v&#233;n&#233;rable DS.</description>
    </item>
    <item>
      <title>Amazon's Echo Show 8 and 11 are down to new all-time lows</title>
      <link>https://www.engadget.com/deals/amazons-echo-show-8-and-11-are-down-to-new-all-time-lows-150021328.html?src=rss</link>
      <pubDate>Tue, 03 Feb 2026 15:00:21 +0000</pubDate>
      <guid isPermaLink="false">6307c92a-833a-47ca-a252-21a8350e695b</guid>
      <description>Amazon is running a sale on two of its newest devices. First, there's the Echo Show 8, which is down to $150 from $180 &#8212; a 17 percent discount. Next up is the Echo Show 11, which is more or less the same device, just bigger. This model has dropped 18 percent to $180 from $220. Both deals bring the Echo Shows down to new all-time low prices.&#160;
The Echo Show 8 and 11 came out in mid-November with the main difference being screen size. The Echo Show 8 has an 8.7-inch HD screen that Amazon claims is 15 percent larger than its predecessor. Meanwhile, the Echo Show 11 is, you guessed it, an 11-inch F...</description>
    </item>
    <item>
      <title>Best Microsoft Surface Laptop (2026): Which Model to Buy or Avoid</title>
      <link>https://www.wired.com/story/microsoft-surface-buying-guide/</link>
      <pubDate>Tue, 03 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">5aa7fd9e877d8568608e9819</guid>
      <description>Surface Pro or Surface Laptop? Here's how to decide which Microsoft device is right for you.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Wednesday, February 4 (game #1472)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-4-february-2026</link>
      <pubDate>Tue, 03 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">Epswk7vX29ABJLJe3T6QnW</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Wednesday, February 4 (game #969)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-4-february-2026</link>
      <pubDate>Tue, 03 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">fGas7HmQC7zP5JdgiL4YfN</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Wednesday, February 4 (game #703)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-4-february-2026</link>
      <pubDate>Tue, 03 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">KzFQZrLiwkdKGX5Au7jaDR</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Here are my 4 most anticipated 4K Blu-rays of February 2026</title>
      <link>https://www.techradar.com/televisions/blu-ray/here-are-my-4-most-anticipated-4k-blu-rays-of-february-2026</link>
      <pubDate>Tue, 03 Feb 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">LQKwCGWVM5N5MjFNRY845m</guid>
      <description>February 2026 is another stacked month of 4K Blu-ray releases, but I've picked the 4 discs I'm itching to get into our testing lab.</description>
    </item>
    <item>
      <title>Can't wait for the Galaxy S26? The Google Pixel 10 Pro is 'one of the best smartphones you can buy' &#8211; and it's now $200 off</title>
      <link>https://www.techradar.com/phones/google-pixel-phones/cant-wait-for-the-galaxy-s26-the-google-pixel-10-pro-is-one-of-the-best-smartphones-you-can-buy-and-its-now-usd200-off</link>
      <pubDate>Tue, 03 Feb 2026 14:54:02 +0000</pubDate>
      <guid isPermaLink="false">ZeMppku9eERf36p6a76WTM</guid>
      <description>Save a massive $200 on the Google Pixel 10 Pro at Amazon</description>
    </item>
    <item>
      <title>China is banning hidden electric door handles for EVs</title>
      <link>https://www.theverge.com/transportation/873039/china-ban-hidden-tesla-door-handles-january-2027</link>
      <pubDate>2026-02-03T09:53:18-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=873039</guid>
      <description>China is banning Tesla-style concealed door handles on electric vehicles to address safety concerns regarding people getting trapped inside their cars. The ban will take effect on January 1st next year, according to the Ministry of Industry and Information Technology's announcement, and will require all vehicles sold in China to have mechanical release door handles [&#8230;]...</description>
    </item>
    <item>
      <title>Galaxy Z Flip 7 Edition Olympique : voici le smartphone qui sera offert &#224; tous les athl&#232;tes des JO d&#8217;hiver</title>
      <link>https://www.frandroid.com/marques/samsung/2964763_galaxy-z-flip-7-edition-olympique-voici-le-smartphone-qui-sera-offert-a-tous-les-athletes-des-jo-dhiver</link>
      <pubDate>Tue, 03 Feb 2026 14:51:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2964763_galaxy-z-flip-7-edition-olympique-voici-le-smartphone-qui-sera-offert-a-tous-les-athletes-des-jo-dhiver</guid>
      <description>
Samsung a d&#233;voil&#233; une nouvelle &#233;dition de son Galaxy Z Flip 7. Destin&#233; aux athl&#232;tes des JO d'hiver de Milan-Cortina, il ne sera pas disponible &#224; la vente. 
</description>
    </item>
    <item>
      <title>Clawdbot users are snapping up the Mac Mini &#8212; buy right now for under $550 at Amazon</title>
      <link>https://mashable.com/article/jan-31-apple-mac-mini-deal</link>
      <pubDate>Tue, 03 Feb 2026 14:51:09 +0000</pubDate>
      <guid isPermaLink="false">06kBGComO6QjR2zO1BHYxX1</guid>
      <description>The M4 Mac Mini is on sale at Amazon for $549, down from the normal price of $599.</description>
    </item>
    <item>
      <title>Smartphones sans prise jack : les meilleures solutions pour &#233;couter de la musique</title>
      <link>https://www.frandroid.com/guide-dachat/362501_smartphones-prise-jack-alternatives</link>
      <pubDate>Tue, 03 Feb 2026 14:49:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/362501_smartphones-prise-jack-alternatives</guid>
      <description>
Les smartphones sans prise jack sont d&#233;sormais majoritaires sur le march&#233;,&#160;que ce soit les iPhone ou les smartphones Android. Pour &#233;couter de la musique ou visionner des contenus, plusieurs solutions s'offrent &#224; vous : &#233;couteurs sans fil, adaptateurs USB-C/jack... on fait le point.
</description>
    </item>
    <item>
      <title>Derni&#232;re ligne droite pour profiter des prix cass&#233;s sur les TV 4K et les vid&#233;oprojecteurs aux derni&#232;res heures des soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2933417_derniere-ligne-droite-pour-profiter-des-prix-casses-sur-les-tv-4k-et-les-videoprojecteurs-aux-dernieres-heures-des-soldes-dhiver</link>
      <pubDate>Tue, 03 Feb 2026 14:46:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933417_derniere-ligne-droite-pour-profiter-des-prix-casses-sur-les-tv-4k-et-les-videoprojecteurs-aux-dernieres-heures-des-soldes-dhiver</guid>
      <description>
L'ultime d&#233;marque des soldes d'hiver vient de d&#233;marrer avec son cort&#232;ge d'offres sur les t&#233;l&#233;viseurs dernier cri et les vid&#233;oprojecteurs bard&#233;s de nouvelles technologies. Envie d'une image flambant neuve ? Voici notre s&#233;lection des meilleurs bons plans qui cr&#232;vent l'&#233;cran.
</description>
    </item>
    <item>
      <title>Keen cyclist? Take our survey for a chance to win a $300 / &#163;250 Amazon voucher</title>
      <link>https://www.techradar.com/tech/biketrack-survey-2026</link>
      <pubDate>Tue, 03 Feb 2026 14:44:27 +0000</pubDate>
      <guid isPermaLink="false">mr9gY2Uh3fLHeXXUgqu4Yi</guid>
      <description>Take the BikeTrack 2026 survey for a chance to win some spending money</description>
    </item>
    <item>
      <title>How these MAHA activists are forming an unlikely alliance with Lee Zeldin&#8217;s EPA</title>
      <link>https://www.fastcompany.com/91485913/how-maha-activists-teaming-up-epa-shield-americans-harmful-chemicals</link>
      <pubDate>2026-02-03T14:44:16</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91485913/how-maha-activists-teaming-up-epa-shield-americans-harmful-chemicals</guid>
      <description>With an eye on the midterms, Lee Zeldin&#8217;s EPA has been giving MAHA activists a seat at the table.
On New Year&#8217;s Eve, Lee Zeldin did something out of character for an Environmental Protection Agency leader who has been hacking away at regulations intended to protect Americans&#8217; air and water.He announced new restrictions on five chemicals commonly used in building materials, plastic products and adhesives, and he cheered it as a &#8220;MAHA win.&#8221;It was one of many signs of a fragile collaboration that&#8217;s been building between a Republican administration that&#8217;s traditionally supported big business and a...</description>
    </item>
    <item>
      <title>Geekom&#8217;s &#8220;exceptionally good&#8221; AX8 Max mini PC with Ryzen 7 8745HS, 32GB of DDR5 RAM, and a 1TB SSD is now under $650 - but it won't stay that price for long</title>
      <link>https://www.techradar.com/pro/geekoms-exceptionally-good-ax8-max-mini-pc-with-ryzen-7-8745hs-32gb-of-ddr5-ram-and-a-1tb-ssd-is-now-under-usd650-but-it-wont-stay-that-price-for-long</link>
      <pubDate>Tue, 03 Feb 2026 14:40:41 +0000</pubDate>
      <guid isPermaLink="false">dwcgBTjMhvpEW2TCu2hHpS</guid>
      <description>Geekom AX8 Max mini PC is powered by AMD&#8217;s Ryzen 7 8745HS, with 32GB of DDR5 RAM, and a 1TB SSD and it's now priced under $650.</description>
    </item>
    <item>
      <title>Independent auditors confirm NordVPN never stores your data &#8211; for the 6th time</title>
      <link>https://www.techradar.com/vpn/vpn-services/independent-auditors-confirm-nordvpn-never-stores-your-data-for-the-6th-time</link>
      <pubDate>Tue, 03 Feb 2026 14:39:14 +0000</pubDate>
      <guid isPermaLink="false">Yieh2sVs8R6PZEzWG5cXY9</guid>
      <description>NordVPN&#8217;s latest no-logs audit once again validates the company&#8217;s long-standing privacy claim: it doesn&#8217;t retain any identifying logs of its users. Here's why it matters.</description>
    </item>
    <item>
      <title>C&#8217;est le grand d&#233;stockage chez Xiaomi pour le dernier jour des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2936033_cest-le-grand-destockage-chez-xiaomi-pour-le-dernier-jour-des-soldes</link>
      <pubDate>Tue, 03 Feb 2026 14:38:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2936033_cest-le-grand-destockage-chez-xiaomi-pour-le-dernier-jour-des-soldes</guid>
      <description>
&#192; quelques heures de la fin des soldes, Xiaomi continue de proposer d&#8217;excellentes affaires sur une large s&#233;lection de produits. Si l&#8217;un des mod&#232;les Xiaomi vous fait de l&#8217;&#339;il, c&#8217;est le moment ou jamais d&#8217;en profiter avant la fin de l'&#233;v&#232;nement.
</description>
    </item>
    <item>
      <title>L&#8217;ind&#233;modable manette sans fil Xbox revient &#224; petit prix pour le dernier jour des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2964357_lindemodable-manette-sans-fil-xbox-revient-a-petit-prix-pour-le-dernier-jour-des-soldes</link>
      <pubDate>Tue, 03 Feb 2026 14:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2964357_lindemodable-manette-sans-fil-xbox-revient-a-petit-prix-pour-le-dernier-jour-des-soldes</guid>
      <description>
Microsoft a su faire son trou avec sa manette Xbox au design si efficace port&#233; par ses deux joysticks asym&#233;triques. PC Componentes vous propose de l'acqu&#233;rir pour 49,57 euros.
</description>
    </item>
    <item>
      <title>Ian McKellen May Have Revealed a Big Magneto Moment in &#8216;Avengers: Doomsday&#8217;</title>
      <link>https://gizmodo.com/avengers-doomsday-magneto-new-jersey-ian-mckellen-2000717038</link>
      <pubDate>Tue, 03 Feb 2026 14:30:41 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000717038</guid>
      <description>Plus, Maika Monroe has a hopeful update on the 'It Follows' sequel.</description>
    </item>
    <item>
      <title>Fitbit&#8217;s founders launch a new platform for monitoring your entire family&#8217;s health</title>
      <link>https://www.theverge.com/tech/872963/fitbit-james-park-eric-friedman-luffu-caregivers-family-health-app</link>
      <pubDate>2026-02-03T09:28:55-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=872963</guid>
      <description>James Park and Eric Friedman, the co-founders of Fitbit who left Google two years ago, have announced a new venture called Luffu. Described as an "intelligent family care system," Luffu collects and logs health and medical information from connected devices, other platforms like Apple Health and Fitbit, and details shared by family members through voice [&#8230;]...</description>
    </item>
    <item>
      <title>Still looking for a Samsung Galaxy Z TriFold? Here's the latest restock info and some excellent value alternatives to consider</title>
      <link>https://www.techradar.com/phones/samsung-galaxy-phones/still-looking-for-a-samsung-galaxy-z-trifold-heres-the-latest-restock-info-and-some-excellent-value-alternatives-to-consider</link>
      <pubDate>Tue, 03 Feb 2026 14:26:54 +0000</pubDate>
      <guid isPermaLink="false">J7H6VWoED9FtDkFXSkhKUK</guid>
      <description>The Samsung Galaxy Z TriFold is officially sold out &#8211; here are the latest details on restocks, plus today's best options for alternative models.</description>
    </item>
    <item>
      <title>I tested Acer Nitro 18 AI gaming laptop, and it looks like great value considering its spec &#8212; but I found some issues that might spoil your fun</title>
      <link>https://www.techradar.com/computing/gaming-laptops/acer-nitro-18-ai-review</link>
      <pubDate>Tue, 03 Feb 2026 14:23:24 +0000</pubDate>
      <guid isPermaLink="false">LDq6pXsWhmEHqEyXUgGPeC</guid>
      <description>The Acer Nitro 18 AI is large and powerful &#8211; but how does it stack up to its rivals?</description>
    </item>
    <item>
      <title>What were getting wrong about dating, according to a Kinsey scientist</title>
      <link>https://mashable.com/article/dating-advice-kinsey-institute-justin-garcia</link>
      <pubDate>Tue, 03 Feb 2026 14:18:56 +0000</pubDate>
      <guid isPermaLink="false">05JVGtjPAV6Pcv0WqSi90Ai</guid>
      <description>The Kinsey Institute's executive director, Justin Garcia, chatted with Mashable about relationships and tech.</description>
    </item>
    <item>
      <title>Well, Astronauts Won&#8217;t Be Going Back to the Moon This Month</title>
      <link>https://gizmodo.com/well-astronauts-wont-be-going-back-to-the-moon-this-month-2000717181</link>
      <pubDate>Tue, 03 Feb 2026 14:17:38 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000717181</guid>
      <description>A hydrogen leak during the wet dress rehearsal for Artemis 2 has forced NASA to forego the February launch window and work toward March instead.</description>
    </item>
    <item>
      <title>Humans are infiltrating the social network for AI bots</title>
      <link>https://www.theverge.com/ai-artificial-intelligence/872961/humans-infiltrating-moltbook-openclaw-reddit-ai-bots</link>
      <pubDate>2026-02-03T09:15:38-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=872961</guid>
      <description>Ordinary social networks face a constant onslaught of chatbots pretending to be human. A new social platform for AI agents may face the opposite problem: getting clogged up by humans pretending to post as bots. Moltbook - a website meant for conversations between agents from the platform OpenClaw - went viral this weekend for its [&#8230;]</description>
    </item>
    <item>
      <title>PayPal hires HP&#8217;s Enrique Lores as its new CEO</title>
      <link>https://techcrunch.com/2026/02/03/paypal-hires-hps-enrique-lores-as-its-new-ceo/</link>
      <pubDate>Tue, 03 Feb 2026 14:15:28 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3089045</guid>
      <description>PayPal is appointing CFO and COO Jamie Miller as interim CEO until March 1.</description>
    </item>
    <item>
      <title>Peak XV says internal disagreement led to partner exits as it doubles down on AI</title>
      <link>https://techcrunch.com/2026/02/03/peak-xv-says-internal-disagreement-led-to-partner-exits-as-it-doubles-down-on-ai/</link>
      <pubDate>Tue, 03 Feb 2026 14:14:33 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3089057</guid>
      <description>Peak XV is transitioning board roles and opening a U.S. office while continuing to view India as its largest market.</description>
    </item>
    <item>
      <title>OpenClaw is a major leap forward for AI&#8212;and a cybersecurity nightmare</title>
      <link>https://www.fastcompany.com/91485326/openclaw-is-a-major-leap-forward-for-ai-and-a-cybersecurity-nightmare</link>
      <pubDate>2026-02-03T14:14:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91485326/openclaw-is-a-major-leap-forward-for-ai-and-a-cybersecurity-nightmare</guid>
      <description>Security researchers say thousands of exposed OpenClaw gateways could let hackers read private files, emails, and messages.
Cybersecurity researchers have discovered roughly 1,000 unprotected gateways to OpenClaw, an open-source and proactive AI agent that can be controlled through text conversations with apps like WhatsApp or Telegram. The gateways were found on the open internet, allowing anyone to access users&#8217; personal information. One white hat hacker also reportedly gamed OpenClaw&#8217;s skills system, which lets users add plugins for tasks like web automation or system control, to reach the ...</description>
    </item>
    <item>
      <title>Disney says Josh D&amp;#8217;Amaro will replace Bob Iger as CEO</title>
      <link>https://www.theverge.com/news/872972/disney-ceo-bob-iger-replacement-josh-damaro</link>
      <pubDate>2026-02-03T09:13:58-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=872972</guid>
      <description>Disney has picked a successor for longtime CEO Bob Iger. On Tuesday, the entertainment giant announced that its theme parks head, Josh D'Amaro, will take over as CEO on March 18th, 2026. Rumors about Iger's replacement have been swirling for more than a year now. After a 15-year-long tenure as Disney's CEO, Iger returned from [&#8230;]</description>
    </item>
    <item>
      <title>Call of Duty tries to block XIM and Cronus cheaters again</title>
      <link>https://www.theverge.com/news/872976/call-of-duty-xim-cronus-reasnow-s1-ban-detections</link>
      <pubDate>2026-02-03T09:10:19-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=872976</guid>
      <description>Activision is trying to crack down on third-party hardware cheating devices in Call of Duty again. Both Call of Duty: Warzone and Call of Duty: Black Ops 7 have been plagued by players using devices like XIM, Cronus Zen, and ReaSnow S1 to enable unfair advantages that exploit aim assist, and now Activision is introducing [&#8230;]</description>
    </item>
    <item>
      <title>Panera Bread data breach much more serious than we thought - over 5 million customers were hit, new reports claim</title>
      <link>https://www.techradar.com/pro/security/panera-bread-data-breach-much-more-serious-than-we-thought-over-5-million-customers-were-hit-new-reports-claim</link>
      <pubDate>Tue, 03 Feb 2026 14:05:00 +0000</pubDate>
      <guid isPermaLink="false">e72XBgR6ESg53JEjZB4GNF</guid>
      <description>Panera Bread customer data leaked on the dark web, allowing researchers to determine how many people were hit.</description>
    </item>
    <item>
      <title>Nintendo&#8217;s Virtual Boy Recreation Reminds Us Gaming Doesn&#8217;t Have to Be Fun</title>
      <link>https://gizmodo.com/nintendos-virtual-boy-recreation-reminds-us-gaming-doesnt-have-to-be-fun-2000716819</link>
      <pubDate>Tue, 03 Feb 2026 14:00:56 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000716819</guid>
      <description>You'll enjoy Nintendo's $100 Virtual Boy Switch 2 accessory if you look at it like a gaming archaeologist.</description>
    </item>
    <item>
      <title>&#8216;The Muppet Show&#8217; Returns for a Cute and Nostalgic Special</title>
      <link>https://gizmodo.com/muppet-show-50th-review-disney-sabrina-carpenter-2000713495</link>
      <pubDate>Tue, 03 Feb 2026 14:00:30 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000713495</guid>
      <description>The one-off episode celebrates the series&#8217; 50th anniversary with special guest (and Miss Piggy superfan) Sabrina Carpenter.</description>
    </item>
    <item>
      <title>Nintendo&#8217;s 2026 Games Lineup Is Odd, but Not as Odd as the Wonder Flower</title>
      <link>https://gizmodo.com/nintendos-2026-games-lineup-is-odd-but-not-as-odd-as-the-wonder-flower-2000716958</link>
      <pubDate>Tue, 03 Feb 2026 14:00:07 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000716958</guid>
      <description>The Wonder Flower has infiltrated every party game Nintendo has made, even the upcoming 'Mario Tennis Fever.'</description>
    </item>
    <item>
      <title>Nintendo&#8217;s Virtual Boy Is a Silly but Fun Blast From the Past</title>
      <link>https://www.wired.com/story/nintendo-virtual-boy-switch-accessory/</link>
      <pubDate>Tue, 03 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">697e905494f7f00091cf02b7</guid>
      <description>This $100 accessory adds a little bit of that Nintendo quirkiness to the otherwise no-nonsense Switch 2.</description>
    </item>
    <item>
      <title>Fortnite is about to get a lot more gaming crossovers</title>
      <link>https://www.theverge.com/games/872769/epic-games-store-fortnite-year-in-review-2025</link>
      <pubDate>2026-02-03T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=872769</guid>
      <description>Fortnite is going to be getting a lot more crossovers featuring characters from video games. As part of the Epic Games Store's year in review for 2025, Epic shared details about its official program for developers that will give people who purchase their game on the Epic Games Store a related cosmetic they can use [&#8230;]</description>
    </item>
    <item>
      <title>I watched The Muppet Show on Disney+ and found it charming but old-fashioned &#8211;luckily, Sabrina Carpenter mostly saves the day</title>
      <link>https://www.techradar.com/streaming/disney-plus/the-muppet-show-review</link>
      <pubDate>Tue, 03 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">NFAE3TiTHcrgh3PXH5gsjR</guid>
      <description>Disney+ is, with The Studio's Seth Rogen's help, relaunching The Muppet show &#8211; but this revival, while charming, may be too much like the original.</description>
    </item>
    <item>
      <title>I played a demo of Pragmata on the Nintendo Switch 2, and it just went from my least highly anticipated game this year to one of the most exciting releases coming soon</title>
      <link>https://www.techradar.com/gaming/pragmata-demo-on-nintendo-switch-2</link>
      <pubDate>Tue, 03 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">EWg2yyKSRmunETFZMjJJG4</guid>
      <description>Pragmata might be the sleeper hit of the year, and it feels right at home on the Switch 2</description>
    </item>
    <item>
      <title>Resident Evil Requiem runs so smoothly on Nintendo Switch 2 that I blasphemed in a room full of my peers</title>
      <link>https://www.techradar.com/gaming/resident-evil-requiem-runs-so-smoothly-on-nintendo-switch-2-that-i-blasphemed-in-a-room-full-of-my-peers</link>
      <pubDate>Tue, 03 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">ondmSq2HeYJDpXA8gWZap5</guid>
      <description>Capcom is flexing its superior optimization skills with its upcoming Resident Evil Requiem release, and it might make you reconsider the platform you first play it on...</description>
    </item>
    <item>
      <title>Mario Tennis Fever preview: A racket-smashing blast</title>
      <link>https://www.engadget.com/gaming/nintendo/mario-tennis-fever-preview-a-racket-smashing-blast-140000408.html?src=rss</link>
      <pubDate>Tue, 03 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">6c3c5f1a-65ac-4ba8-997c-43a2355db5da</guid>
      <description>New Mario sports games typically only come around once in a generation. So to get a fresh installment of tennis featuring a deep roster of characters this early in the Switch 2's lifecycle is rather exciting. And after getting a chance to play Mario Tennis Fever prior to its official release on February 12, the best entry to the franchise yet might only be a couple of weeks away.
Once again, Mario Tennis Fever relies on the series' familiar mix of topspin, slice and flat (power) shots used in previous games. The big new mechanic for this title is that instead of Zone Shots from Mario Tennis Ac...</description>
    </item>
    <item>
      <title>The Switch 2's Virtual Boy is a tribute to Nintendo's wackiest console</title>
      <link>https://www.engadget.com/gaming/nintendo/the-switch-2s-virtual-boy-is-a-tribute-to-nintendos-wackiest-console-140000003.html?src=rss</link>
      <pubDate>Tue, 03 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">95fea825-ee25-4884-a4e4-0b330d30fc2f</guid>
      <description>Even in 2026, VR still feels like tech that isn't quite ready for prime time. When Nintendo released the original Virtual Boy way back in 1995, it was hard for my 10-year-old brain to comprehend a 3D console with a bipod, a facemask and a monochrome red display. Then, when you factor in weak sales that led to the system being discontinued after only a year, you end up with a gadget that felt more like a mythical creature than something you could actually buy. But that's changing later this month when the Virtual Boy returns as an add-on for the Switch 2. After getting an early demo of Nintendo...</description>
    </item>
    <item>
      <title>NASA moves Artemis 2 launch to March after hydrogen leak during testing</title>
      <link>https://www.engadget.com/science/space/nasa-moves-artemis-2-launch-to-march-after-hydrogen-leak-during-testing-140000351.html?src=rss</link>
      <pubDate>Tue, 03 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">cf3003b5-8cd1-4398-a9f6-aa75818691a6</guid>
      <description>NASA started making the final preparations for the Artemis 2 mission in early January, with the hopes of opening its launch window as soon as February 6. After issues showed up during the mission&#8217;s wet dress rehearsal in the early hours of February 3, however, the agency had to push back its earliest launch opportunity to March. &#8220;With more than three years between SLS launches, we fully anticipated encountering challenges. That is precisely why we conduct a wet dress rehearsal. These tests are designed to surface issues before flight and set up launch day with the highest probability of succes...</description>
    </item>
    <item>
      <title>This &#8216;chemical sponge&#8217; sucks up the valuable minerals in polluted water</title>
      <link>https://www.fastcompany.com/91485140/this-chemical-sponge-sucks-up-the-valuable-minerals-in-polluted-water</link>
      <pubDate>2026-02-03T14:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91485140/this-chemical-sponge-sucks-up-the-valuable-minerals-in-polluted-water</guid>
      <description>Supra, a UT Austin spinout, makes 3D printed cartridges that could help build a new supply chain for rare earth elements in the U.S.&#8212;and clean up the environment.
So-called rare earth elements aren&#8217;t actually rare. It&#8217;s just difficult to refine them into the purified forms that are needed for making things like electronics or clean energy tech. The standard processes are also toxic, which is one reason that the world has outsourced production to China....</description>
    </item>
    <item>
      <title>Change the game: How sports can drive social impact</title>
      <link>https://www.fastcompany.com/91485323/change-the-game-how-sports-can-drive-social-impact</link>
      <pubDate>2026-02-03T14:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91485323/change-the-game-how-sports-can-drive-social-impact</guid>
      <description>Multiple major events in 2026 highlight the need for youth sports access and mentoring.
</description>
    </item>
    <item>
      <title>The new Nintendo Switch Virtual Boy has the same problem it did in 1995. Thats a good thing</title>
      <link>https://mashable.com/article/nintendo-switch-virtual-boy-hands-on-preview</link>
      <pubDate>Tue, 03 Feb 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">043bJlcpO0dZbRxH4XnC70P</guid>
      <description>I got to try the $100 Virtual Boy peripheral for Nintendo Switch and it's what I always imagined Virtual Boy to be.</description>
    </item>
    <item>
      <title>Elon Musk fusionne SpaceX et xAi pour &#171;&#160;acc&#233;l&#233;rer l&#8217;avenir de l&#8217;humanit&#233;&#160;&#187;</title>
      <link>https://www.01net.com/actualites/elon-musk-fusionne-spacex-xai-pour-accelerer-avenir-humanite.html</link>
      <pubDate>Tue, 03 Feb 2026 13:59:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323933</guid>
      <description>Elon Musk fusionne SpaceX et xAI pour b&#226;tir un g&#233;ant de la tech spatiale et de l&#8217;intelligence artificielle. Selon lui, c'est la premi&#232;re brique d'un empire futuriste intitul&#233; &#171; Sentient Sun &#187;.</description>
    </item>
    <item>
      <title>Raspberry Pi augmente encore ses prix, plomb&#233; par la flamb&#233;e du co&#251;t de la m&#233;moire</title>
      <link>https://www.01net.com/actualites/raspberry-pi-augmente-encore-ses-prix-plombe-par-la-flambee-du-cout-de-la-memoire.html</link>
      <pubDate>Tue, 03 Feb 2026 13:59:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323949</guid>
      <description>Deuxi&#232;me hausse des prix en deux mois : Raspberry Pi est une fois de plus forc&#233; d'augmenter les &#233;tiquettes de plusieurs de ses ordinateurs en raison de la flamb&#233;e des co&#251;ts de la m&#233;moire.</description>
    </item>
    <item>
      <title>Bad Bunny and the threat of ICE: The 2026 Super Bowl comes at a flashpoint in U.S. politics</title>
      <link>https://www.fastcompany.com/91485878/bad-bunny-threat-ice-2026-super-bowl-comes-flashpoint-u-s-politics</link>
      <pubDate>2026-02-03T13:56:42</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91485878/bad-bunny-threat-ice-2026-super-bowl-comes-flashpoint-u-s-politics</guid>
      <description>As the DHS threatens to send ICE agents to the game, over 184,000 people have signed a petition in protest.
Don&#8217;t tune into the Super Bowl hoping for a break from the tumultuous politics gripping the U.S.The NFL is facing pressure ahead of Sunday&#8217;s game between the Seattle Seahawks and the New England Patriots to take a more explicit stance against the Trump administration&#8217;s aggressive immigration enforcement. More than 184,000 people have signed a petition calling on the league to denounce the potential presence of Immigration and Customs Enforcement at the Super Bowl, which is being held at ...</description>
    </item>
  </channel>
</rss>
