<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 05 Dec 2025 13:35:11 GMT</lastBuildDate>
    <item>
      <title>&#171; M&#234;me si on code grossi&#232;rement, &#231;a marche &#187; : pourquoi des consoles comme la PS5 Pro co&#251;tent en r&#233;alit&#233; moins cher aux cr&#233;ateurs de jeux</title>
      <link>https://www.frandroid.com/produits-android/2900247_meme-si-on-code-grossierement-ca-marche-pourquoi-des-consoles-comme-la-ps5-pro-coutent-en-realite-moins-cher-aux-createurs-de-jeux</link>
      <pubDate>Fri, 05 Dec 2025 13:31:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2900247_meme-si-on-code-grossierement-ca-marche-pourquoi-des-consoles-comme-la-ps5-pro-coutent-en-realite-moins-cher-aux-createurs-de-jeux</guid>
      <description>
Alors que certains jugent inutile la course &#224; la puissance dans le monde des consoles, un d&#233;veloppeur japonais affirme que des machines plus performantes permettent paradoxalement de r&#233;duire les d&#233;penses li&#233;es &#224; la cr&#233;ation de jeux vid&#233;o.
</description>
    </item>
    <item>
      <title>Pluribus turns a &#8216;caloric deficit&#8217; into a nightmare</title>
      <link>https://www.theverge.com/streaming/838256/pluribus-episode-6-recap-discussion</link>
      <pubDate>2025-12-05T08:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=838256</guid>
      <description>Every week since Pluribus' premiere, I've presented a handful of burning questions I have about what's coming next. And most of the time I really want to know the answer. This is a show where mysteries are baked into the premise, with a slow-burn structure that can make it very satisfying when the answers start [&#8230;]</description>
    </item>
    <item>
      <title>On a cr&#233;&#233; l&#8217;outil qui tue les fausses promos : installez notre extension navigateur</title>
      <link>https://www.frandroid.com/humanoid/2877567_on-a-cree-loutil-qui-tue-les-fausses-promos-du-black-friday</link>
      <pubDate>Fri, 05 Dec 2025 13:23:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/2877567_on-a-cree-loutil-qui-tue-les-fausses-promos-du-black-friday</guid>
      <description>
Les bons plans, c'est bien, mais avec eux, un lot de fausses promotions et de produits douteux. On a d&#233;cid&#233; d'agir. Voici Frandroid Check, notre extension navigateur maison. L'extension s'affiche directement sur les sites marchands pour vous donner le test du produit et son vrai prix. C'est gratuit, et &#231;a change tout.
</description>
    </item>
    <item>
      <title>Sony's best Inzone gaming headsets are significantly discounted at Best Buy right now &#8211; and so are the Inzone Buds</title>
      <link>https://www.techradar.com/gaming/sonys-best-inzone-gaming-headsets-are-significantly-discounted-at-best-buy-right-now-and-so-are-the-inzone-buds</link>
      <pubDate>Fri, 05 Dec 2025 13:20:17 +0000</pubDate>
      <guid isPermaLink="false">aTmmHgRqVesVSDkTgRHVQK</guid>
      <description>Sony Inzone gaming headsets just got massive price drops at Best Buy &#8211; save up to $132!</description>
    </item>
    <item>
      <title>Les Ray-Ban Meta (Gen 1), toujours aussi styl&#233;es, sont de retour &#224; un super prix</title>
      <link>https://www.frandroid.com/bons-plans/2900047_les-ray-ban-meta-gen-1-toujours-aussi-stylees-sont-de-retour-a-un-super-prix</link>
      <pubDate>Fri, 05 Dec 2025 13:19:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2900047_les-ray-ban-meta-gen-1-toujours-aussi-stylees-sont-de-retour-a-un-super-prix</guid>
      <description>
M&#234;me si Meta a r&#233;cemment d&#233;voil&#233; la deuxi&#232;me g&#233;n&#233;ration de ses Ray-Ban connect&#233;es, les premi&#232;res, r&#233;v&#233;l&#233;es il y a deux ans, restent toujours aussi int&#233;ressantes. Les Ray-Ban Meta Gen 1 sont en plus propos&#233;es &#224; 247 euros au lieu de 359 euros &#224; la Fnac et chez Boulanger.
</description>
    </item>
    <item>
      <title>Netflix is buying Warner Bros. for $83 billion</title>
      <link>https://www.theverge.com/news/838781/netflix-warner-bros-discover-bids-buyout</link>
      <pubDate>2025-12-05T08:16:16-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=838781</guid>
      <description>Netflix has announced that it&#8217;s struck a deal to acquire Warner Bros. for $82.7 billion. The purchase will go through after Warner Bros.&#8217; planned split from Discovery, now expected to take place in Q3 2026. It will see the streamer acquire the Warner studio, both HBO and HBO Max, and access to IP including Harry [&#8230;]</description>
    </item>
    <item>
      <title>The far right is mobilizing against Trump AI czar David Sacks</title>
      <link>https://www.theverge.com/ai-artificial-intelligence/838776/maga-ai-executive-order-david-sacks</link>
      <pubDate>2025-12-05T08:15:21-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=838776</guid>
      <description>Washington lawmakers had barely finished processing the news that Congress would not put a state AI law ban into the National Defense Authorization Act (NDAA) when a new rumor began trickling out of the White House on Wednesday: President Donald Trump would, indeed, sign an executive order that would ostensibly assign the federal government the [&#8230;]</description>
    </item>
    <item>
      <title>Une premi&#232;re&#160;: l&#8217;Europe condamne X/Twitter &#224; 120 millions d&#8217;euros pour manque de transparence</title>
      <link>https://www.01net.com/actualites/une-premiere-leurope-condamne-x-twitter-a-120-millions-deuros-pour-manque-de-transparence.html</link>
      <pubDate>Fri, 05 Dec 2025 13:12:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313985</guid>
      <description>X, anciennement Twitter, est la premi&#232;re plateforme &#224; &#233;coper d'une sanction financi&#232;re pour avoir enfreint le r&#232;glement europ&#233;en sur les services num&#233;riques (DSA). L'amende est relativement modeste, mais le r&#233;seau social d'Elon Musk n'est pas au bout de ses peines.</description>
    </item>
    <item>
      <title>Tesla launches cheaper Model 3 in Europe</title>
      <link>https://mashable.com/article/tesla-cheaper-model-3-europe</link>
      <pubDate>Fri, 05 Dec 2025 13:07:48 +0000</pubDate>
      <guid isPermaLink="false">024oGklYpHa5G23VmRkC1be</guid>
      <description>Tesla has launched a stripped-down, cheaper variant of its Model 3 in Europe.</description>
    </item>
    <item>
      <title>01net Awards&#160;: la meilleure tablette de l&#8217;ann&#233;e est&#8230;</title>
      <link>https://www.01net.com/actualites/01net-awards-la-meilleure-tablette-de-lannee-est.html</link>
      <pubDate>Fri, 05 Dec 2025 13:05:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313862</guid>
      <description>La r&#233;daction de 01net.com d&#233;signe les meilleurs produits de l&#8217;ann&#233;e. D&#233;couvrez tous les jours les vainqueurs de chaque cat&#233;gorie jusqu&#8217;&#224; la remise des prix le 10 d&#233;cembre, en live s&#8217;il vous plait !</description>
    </item>
    <item>
      <title>Bobs Burgers creator Loren Bouchard credits early fans for the shows success</title>
      <link>https://mashable.com/video/loren-bouchard-bobs-burgers-say-more</link>
      <pubDate>Fri, 05 Dec 2025 13:04:53 +0000</pubDate>
      <guid isPermaLink="false">04ZD7C7D7Fp1Ad0in03e8JY</guid>
      <description>The animated family sitcom "Bob's Burgers" sparked love in season one. Interview with show creator Loren Bouchard.</description>
    </item>
    <item>
      <title>Au Cern, l&#8217;IA traque des traces de minitrous noirs : voil&#224; ce que les chercheurs commencent &#224; voir</title>
      <link>https://www.futura-sciences.com/sciences/actualites/physique-cern-ia-traque-traces-minitrous-noirs-voila-ce-chercheurs-commencent-voir-128210/#xtor%3DRSS-8</link>
      <pubDate>Fri, 05 Dec 2025 14:03:20 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/physique-cern-ia-traque-traces-minitrous-noirs-voila-ce-chercheurs-commencent-voir-128210/#xtor%3DRSS-8</guid>
      <description>Les membres de la collaboration derri&#232;re l'exp&#233;rience CMS,&#160;l'un des d&#233;tecteurs g&#233;ants du Grand collisionneur de Hadrons du Cern (LHC),&#160;utilisent des techniques d'apprentissage automatique de pointe pour rechercher des trous noirs quantiques microscopiques et d'autres objets exotiques qui...</description>
    </item>
    <item>
      <title>Cloud Gaming Is Looking More Attractive Than Ever for All the Wrong Reasons</title>
      <link>https://gizmodo.com/cloud-gaming-is-looking-more-attractive-than-ever-for-all-the-wrong-reasons-2000695920</link>
      <pubDate>Fri, 05 Dec 2025 13:00:02 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000695920</guid>
      <description>With prices for PC parts skyrocketing, maybe streaming your games isn't so bad... if you can stomach the subscription.</description>
    </item>
    <item>
      <title>After Neuralink, Max Hodak is building something stranger</title>
      <link>https://techcrunch.com/2025/12/05/after-neuralink-max-hodak-is-building-something-stranger/</link>
      <pubDate>Fri, 05 Dec 2025 12:56:47 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3073238</guid>
      <description>"You could really, in a very fundamental sense, talk about redrawing the border around a brain," Hodak says, "possibly to include four hemispheres, or a device, or a whole group of people."</description>
    </item>
    <item>
      <title>Ofcom wants to double down on file monitoring in 2026</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/ofcom-wants-to-double-down-on-file-monitoring-in-2026</link>
      <pubDate>Fri, 05 Dec 2025 12:42:50 +0000</pubDate>
      <guid isPermaLink="false">n3nSJ4frobcJvNh3ZvX6EZ</guid>
      <description>Experts are concerned about the precedent it may set for users' privacy, despite Ofcom ensuring that measures should not break "end-to-end encryption."</description>
    </item>
    <item>
      <title>This tiny new DAC gives your phone, laptop or games console the audio skills of the world's best hi-res music player</title>
      <link>https://www.techradar.com/audio/dacs/this-tiny-new-dac-gives-your-phone-laptop-or-games-console-the-audio-skills-of-the-worlds-best-hi-res-music-player</link>
      <pubDate>Fri, 05 Dec 2025 12:38:28 +0000</pubDate>
      <guid isPermaLink="false">dcmKwVCGq8TZJcBhY8Qu5J</guid>
      <description>It's the size of a lighter but the HC5 is a delighter &#8211;and A&amp;K's new earbuds are pretty special too</description>
    </item>
    <item>
      <title>Leclerc f&#234;te No&#235;l en avance et vous fait &#233;conomiser 200 &#8364; sur ce laptop HP performant (Ryzen AI 5, 24 Go RAM et 512 Go SSD)</title>
      <link>https://www.frandroid.com/bons-plans/2900067_leclerc-fete-noel-en-avance-et-vous-fait-economiser-200-e-sur-ce-laptop-hp-performant-ryzen-ai-5-24-go-ram-et-512-go-ssd</link>
      <pubDate>Fri, 05 Dec 2025 12:36:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2900067_leclerc-fete-noel-en-avance-et-vous-fait-economiser-200-e-sur-ce-laptop-hp-performant-ryzen-ai-5-24-go-ram-et-512-go-ssd</guid>
      <description>
Gr&#226;ce &#224; son Ryzen AI 5, cet HP Omnibook 3 peut devenir un v&#233;ritable alli&#233; que vous soyez &#233;tudiant ou professionnel et bonne nouvelle : son prix tombe &#224; 599 euros au lieu de 799 euros &#224; Leclerc.
</description>
    </item>
    <item>
      <title>AI Is Getting Better at Hacking Crypto&#8217;s Smart Contracts</title>
      <link>https://gizmodo.com/ai-is-getting-better-at-hacking-cryptos-smart-contracts-2000695877</link>
      <pubDate>Fri, 05 Dec 2025 12:30:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000695877</guid>
      <description>And the arguments have already started.</description>
    </item>
    <item>
      <title>ChatGPT&#8217;s AI lead may be more fragile than we thought</title>
      <link>https://www.fastcompany.com/91454222/chatgpt-vs-gemini</link>
      <pubDate>2025-12-05T12:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91454222/chatgpt-vs-gemini</guid>
      <description>Suddenly Google&#8217;s Gemini is looking a whole lot more formidable, especially since it&#8217;s remarkably easy to hop from one AI chatbot to another.
Greetings, and welcome back to Fast Company&#8217;s Plugged In.</description>
    </item>
    <item>
      <title>Netflix rach&#232;te officiellement Warner Bros pour 82 milliards de dollars&#160;: que va-t-il se passer pour le prix des abonnements&#160;?</title>
      <link>https://www.01net.com/actualites/netflix-pret-racheter-warner-bros-abonnements-vont-ils-couter-plus-cher.html</link>
      <pubDate>Fri, 05 Dec 2025 12:28:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313886</guid>
      <description>Netflix vient d'acqu&#233;rir Warner Bros Discovery et HBO Max pour 82,7 milliards de dollars. Une op&#233;ration qui devrait bouleverser l&#8217;&#233;quilibre d&#8217;Hollywood et avoir des effets concrets sur le prix des abonnements.</description>
    </item>
    <item>
      <title>Netflix agrees $82.7 billion deal to buy Warner Bros. Discovery &#8211; and claims it&#8217;ll result in 'more choice and greater value for consumers'</title>
      <link>https://www.techradar.com/streaming/netflix/its-official-netflix-is-buying-warner-bros-discovery-claiming-the-deal-means-more-choice-and-greater-value-for-consumers</link>
      <pubDate>Fri, 05 Dec 2025 12:19:34 +0000</pubDate>
      <guid isPermaLink="false">kZdMeNkyBEkKobG9oNTvNa</guid>
      <description>A giant entertainment deal is agreed for over $80 billion, but it'll face opposition</description>
    </item>
    <item>
      <title>Panne momentan&#233;e sur plusieurs sites li&#233;e au fournisseur Cloudflare</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-12-05/panne-momentanee-sur-plusieurs-sites-liee-au-fournisseur-cloudflare.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Fri, 05 Dec 2025 07:16:38 -0500</pubDate>
      <guid isPermaLink="false">fa81b079304c3bea9322a9fa79e3e8c0</guid>
      <description>Une panne a touch&#233; vendredi plusieurs sites internet, dont le r&#233;seau social du pr&#233;sident am&#233;ricain Truth&#160;Social, et les sites Canva et Doctolib, en raison d&#8217;un probl&#232;me identifi&#233; par le fournisseur am&#233;ricain de services en ligne Cloudflare.</description>
    </item>
    <item>
      <title>&#8216;A solution looking for a problem that doesn&#8217;t exist&#8217;: Logitech CEO blasts AI gadgets &#8211; and most people think that&#8217;s being generous</title>
      <link>https://www.techradar.com/ai-platforms-assistants/a-solution-looking-for-a-problem-that-doesnt-exist-logitech-ceo-blasts-ai-gadgets-and-most-people-think-thats-being-generous</link>
      <pubDate>Fri, 05 Dec 2025 12:14:31 +0000</pubDate>
      <guid isPermaLink="false">qtmLNhJG5Cr7DTPxoaNJG</guid>
      <description>Logitech&#8217;s CEO has called AI gadgets &#8220;solutions looking for a problem,&#8221; and judging by the online backlash, most people think even that&#8217;s putting it politely.</description>
    </item>
    <item>
      <title>The Best Meal Replacement Shakes for Total Life Optimization (2025)</title>
      <link>https://www.wired.com/gallery/best-liquid-meal-replacements/</link>
      <pubDate>Fri, 05 Dec 2025 12:07:00 +0000</pubDate>
      <guid isPermaLink="false">686c06eadb668d05757c9664</guid>
      <description>Solve the problem of cooking and chewing food with these full-meal replacement drinks.</description>
    </item>
    <item>
      <title>EU fines X $140 million over &#8216;deceptive&#8217; blue checkmarks</title>
      <link>https://www.theverge.com/news/645154/eu-fines-x-dsa-violations-xai-elon-musk</link>
      <pubDate>2025-12-05T07:04:35-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=645154</guid>
      <description>The European Union has served Elon Musk&#8217;s X with a &#8364;120 million (about $140 million) penalty for violating the bloc&#8217;s digital service rulebook, in part for the &#8220;deceptive design&#8221; of its blue checkmark. Today&#8217;s announcement marks the first time that a company has been fined under the landmark Digital Services Act (DSA) law for curbing [&#8230;]</description>
    </item>
    <item>
      <title>The Vin Diesel &#8216;Rock &#8216;Em, Sock &#8216;Em Robots&#8217; Movie Has a New Writer: Vin Diesel</title>
      <link>https://gizmodo.com/vin-diesel-rock-em-sock-em-robot-movie-2000695990</link>
      <pubDate>Fri, 05 Dec 2025 12:00:55 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000695990</guid>
      <description>The 'Fast &amp; Furious' star is now attached to write, headline, and produce the Mattel adaptation.</description>
    </item>
    <item>
      <title>AI Slop Is Ruining Reddit for Everyone</title>
      <link>https://www.wired.com/story/ai-slop-is-ruining-reddit-for-everyone/</link>
      <pubDate>Fri, 05 Dec 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">6927426ce72c44e59c338701</guid>
      <description>Reddit is considered one of the most human spaces left on the internet, but mods and users are overwhelmed with slop posts in the most popular subreddits.</description>
    </item>
    <item>
      <title>What is the release date for Robin Hood episode 7 on MGM+?</title>
      <link>https://www.techradar.com/streaming/entertainment/robin-hood-episode-7-release-date-time-mgm-plus</link>
      <pubDate>Fri, 05 Dec 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">52NQLppaTyCC7ySmhfajwN</guid>
      <description>With four episodes left to go, Rob's revenge is getting closer by the minute. But when can we watch Robin Hood episode 7 on MGM+?</description>
    </item>
    <item>
      <title>Windows 11's Run prompt is getting a makeover and a handy extra power &#8211; but already there are worries Microsoft will ruin it</title>
      <link>https://www.techradar.com/computing/windows/windows-11s-run-prompt-is-getting-a-makeover-and-a-handy-extra-power-but-already-there-are-worries-microsoft-will-ruin-it</link>
      <pubDate>Fri, 05 Dec 2025 11:46:22 +0000</pubDate>
      <guid isPermaLink="false">ierbZA26yNr4HzKCPbatKh</guid>
      <description>An ancient part of Windows 11 is seemingly getting a makeover &#8211; but people are scared Microsoft's going to somehow make it sluggish.</description>
    </item>
    <item>
      <title>Nvidia : je peux enfin rejouer &#224; certains de mes jeux cultes avec cette mise &#224; jour</title>
      <link>https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2899961_nvidia-je-peux-enfin-rejouer-a-certains-de-mes-jeux-cultes-avec-cette-mise-a-jour</link>
      <pubDate>Fri, 05 Dec 2025 11:35:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/cartes-graphiques/2899961_nvidia-je-peux-enfin-rejouer-a-certains-de-mes-jeux-cultes-avec-cette-mise-a-jour</guid>
      <description>
L'abandon malencontreux de la technologie PhysX par les derni&#232;res cartes graphiques RTX 5000 de Nvidia avait eu pour cons&#233;quence de limiter cruellement les performances de certains jeux cultes d'ancienne g&#233;n&#233;ration. Une mise &#224; jour va tout changer (et me permettre de rejouer dignement &#224; Mirror's Edge).
</description>
    </item>
  </channel>
</rss>
