<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 03 Feb 2026 07:49:24 GMT</lastBuildDate>
    <item>
      <title>Aussi bien que Brompton &#233;lectrique &#224; moins de 1000 euros&#160;? Le Zip veut tout casser chez les v&#233;los &#233;lectriques pliants</title>
      <link>https://www.01net.com/actualites/aussi-bien-que-brompton-electrique-a-moins-de-1000-euros-le-zip-veut-tout-casser-chez-les-velos-electriques-pliants.html</link>
      <pubDate>Tue, 03 Feb 2026 07:46:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323730</guid>
      <description>Engwe lance le Zip un v&#233;lo pliant &#233;lectrique styl&#233; compact et l&#233;ger &#224; moins de 1 000 euros. Avec une fiche technique s&#233;rieuse et un prix canon, ce VAE chinois veut bousculer le march&#233;.</description>
    </item>
    <item>
      <title>iPhone Fold : Apple s&#8217;appr&#234;te &#224; bousculer 17 ans d&#8217;habitudes avec ce changement de design</title>
      <link>https://www.frandroid.com/marques/apple/2963769_iphone-fold-apple-sapprete-a-bousculer-17-ans-dhabitudes-avec-ce-changement-de-design</link>
      <pubDate>Tue, 03 Feb 2026 07:46:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2963769_iphone-fold-apple-sapprete-a-bousculer-17-ans-dhabitudes-avec-ce-changement-de-design</guid>
      <description>
Alors que l'iPhone Fold, premier smartphone pliant d'Apple, est attendu pour le mois de septembre prochain, de nouveaux d&#233;tails ont &#233;merg&#233; &#224; propos de la disposition des boutons de l'appareil.
</description>
    </item>
    <item>
      <title>Firefox va vous permettre de bloquer toutes les fonctionnalit&#233;s d&#8217;IA&#160;: voici comment</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/2963781_firefox-va-vous-permettre-de-bloquer-toutes-les-fonctionnalites-dia-voici-comment</link>
      <pubDate>Tue, 03 Feb 2026 07:46:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/2963781_firefox-va-vous-permettre-de-bloquer-toutes-les-fonctionnalites-dia-voici-comment</guid>
      <description>
Conscient que l&#8217;intelligence artificielle g&#233;n&#233;rative est rejet&#233;e en bloc par une partie de son public, Mozilla va offrir un moyen simple de s&#8217;en d&#233;barrasser au sein de Firefox.
</description>
    </item>
    <item>
      <title>Notepad++ a &#233;t&#233; pirat&#233; durant plusieurs mois pour espionner certains utilisateurs</title>
      <link>https://www.01net.com/actualites/notepad-a-ete-pirate-durant-plusieurs-mois-pour-espionner-certains-utilisateurs.html</link>
      <pubDate>Tue, 03 Feb 2026 07:39:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323866</guid>
      <description>L&#8217;&#233;diteur de texte NotePad++ a &#233;t&#233; victime d&#8217;une attaque sophistiqu&#233;e. Pendant plusieurs mois, des hackers ont compromis les serveurs de mise &#224; jour du logiciel pour rediriger les utilisateurs vers des mises &#224; jour malveillantes.</description>
    </item>
    <item>
      <title>Fuite des prix fran&#231;ais des Galaxy Buds 4 et Galaxy 4 Pro avant leur lancement officiel</title>
      <link>https://www.frandroid.com/marques/samsung/2963729_fuite-des-prix-francais-des-galaxy-buds-4-et-galaxy-4-pro-avant-leur-lancement-officiel</link>
      <pubDate>Tue, 03 Feb 2026 07:30:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2963729_fuite-des-prix-francais-des-galaxy-buds-4-et-galaxy-4-pro-avant-leur-lancement-officiel</guid>
      <description>
Les nouveaux &#233;couteurs sans fil de Samsung arriveront fin f&#233;vrier 2026 des prix similaires &#224; leurs successeurs si on en croit la fuite r&#233;cente dont ils ont fait l&#8217;objet.
</description>
    </item>
    <item>
      <title>Firefox&#160;: un bouton pour couper compl&#232;tement les fonctions d&#8217;IA g&#233;n&#233;rative</title>
      <link>https://www.01net.com/actualites/firefox-un-bouton-pour-couper-completement-les-fonctions-dia-generative.html</link>
      <pubDate>Tue, 03 Feb 2026 07:30:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323839</guid>
      <description>Tout le monde n'aime pas forc&#233;ment l'IA g&#233;n&#233;rative, m&#234;me s'il est bien difficile d'y &#233;chapper ! La fondation Mozilla, qui peut difficilement faire l'impasse sur cette technologie, veut tout de m&#234;me donner la possibilit&#233; aux utilisateurs de son navigateur Firefox de bloquer compl&#232;tement les fonctions d'IA.</description>
    </item>
    <item>
      <title>Google TV Streamer 4K : le prix du rempla&#231;ant du Chromecast fond l&#233;g&#232;rement sur le site officiel</title>
      <link>https://www.frandroid.com/bons-plans/2963337_google-tv-streamer-4k-le-prix-du-remplacant-du-chromecast-fond-legerement-sur-le-site-officiel</link>
      <pubDate>Tue, 03 Feb 2026 07:25:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2963337_google-tv-streamer-4k-le-prix-du-remplacant-du-chromecast-fond-legerement-sur-le-site-officiel</guid>
      <description>
Le Google TV Streamer 4K a pris la place du Chromecast il y a plus d'un an. Ce bo&#238;tier multim&#233;dia ambitieux, qui vous permet aussi de piloter votre maison connect&#233;e, est propos&#233;, en cette fin de soldes d'hiver, &#224; 99 euros au lieu de 119 euros sur le Google Store.
</description>
    </item>
    <item>
      <title>The Switch is now Nintendo&#8217;s best-selling console of all time</title>
      <link>https://www.theverge.com/games/872768/nintendo-earnings-switch-best-selling-console-ds</link>
      <pubDate>2026-02-03T02:05:22-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=872768</guid>
      <description>The original Switch is officially Nintendo's best-selling console of all time after surpassing the DS handheld in lifetime sales. In its latest earnings release, Nintendo reports that the Nintendo Switch has, as of December 31, 2025, sold 155.37 million units since its launch in 2017, compared to 154.02 million units for the 2004 Nintendo DS. [&#8230;]</description>
    </item>
    <item>
      <title>Il voulait d&#233;tr&#244;ner Bosch : le g&#233;ant allemand ZF suspend finalement ses activit&#233;s dans le v&#233;lo &#233;lectrique</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2963143_il-voulait-detroner-bosch-le-geant-allemand-zf-suspend-finalement-ses-activites-dans-le-velo-electrique</link>
      <pubDate>Tue, 03 Feb 2026 07:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2963143_il-voulait-detroner-bosch-le-geant-allemand-zf-suspend-finalement-ses-activites-dans-le-velo-electrique</guid>
      <description>
L&#8217;&#233;quipementier allemand ZF, qui avait pr&#233;sent&#233; le moteur ZF CentriX en 2024 pour rivaliser avec Bosch et Shimano, a suspendu ses projets dans le v&#233;lo &#233;lectrique, et ferm&#233; sa division de v&#233;hicules &#233;lectriques.
</description>
    </item>
    <item>
      <title>Google T&#233;l&#233;phone&#160;: fini le calvaire, la mise &#224; jour que tout le monde attendait est enfin l&#224;</title>
      <link>https://www.01net.com/actualites/google-telephone-fini-calvaire-mise-a-jour-tout-monde-attendait-enfin-la.html</link>
      <pubDate>Tue, 03 Feb 2026 07:01:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323855</guid>
      <description>Google met fin &#224; des mois de confusion en d&#233;ployant enfin pour tout le monde l&#8217;option qui permet de verrouiller l'application T&#233;l&#233;phone en mode portrait.</description>
    </item>
    <item>
      <title>Pourquoi Nvidia n&#8217;a toujours pas l&#8217;intention de renouveler la Shield TV</title>
      <link>https://www.01net.com/actualites/pourquoi-nvidia-na-toujours-pas-lintention-de-renouveler-la-shield-tv.html</link>
      <pubDate>Tue, 03 Feb 2026 07:00:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323828</guid>
      <description>Depuis 2019 et le lancement de deux nouveaux mod&#232;les, la gamme Shield TV de Nvidia n'a pas &#233;volu&#233; &#8212; sur le plan mat&#233;riel du moins, car le constructeur a multipli&#233; les mises &#224; jour logicielles. Et cela ne devrait pas changer de si t&#244;t.</description>
    </item>
    <item>
      <title>Porsche Cayenne &#233;lectrique&#160;: les secrets de la batterie qui offre 640 km d&#8217;autonomie &#224; un SUV de 2,6 tonnes</title>
      <link>https://www.01net.com/actualites/porsche-cayenne-electrique-les-secrets-de-la-batterie-qui-offre-640-km-dautonomie-a-un-suv-de-26-tonnes.html</link>
      <pubDate>Tue, 03 Feb 2026 06:57:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323797</guid>
      <description>Comment Porsche fabrique-t-il la batterie de son Cayenne &#233;lectrique ? Et pourquoi est-elle unique. Pour le savoir, on est all&#233;s en Slovaquie dans l&#8217;usine de fabrication des nouvelles batteries de Porsche.</description>
    </item>
    <item>
      <title>Sony WF-1000XM6 : une fuite massive d&#233;voile un design totalement repens&#233; et un nouveau bo&#238;tier</title>
      <link>https://www.frandroid.com/marques/sony/2963717_sony-wf-1000xm6-une-fuite-massive-devoile-un-design-totalement-repense-et-un-nouveau-boitier</link>
      <pubDate>Tue, 03 Feb 2026 06:57:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2963717_sony-wf-1000xm6-une-fuite-massive-devoile-un-design-totalement-repense-et-un-nouveau-boitier</guid>
      <description>
Attendus dans les prochaines semaines, les WF-1000XM6, prochains &#233;couteurs haut de gamme de Sony, ont d&#233;j&#224; fait l'objet d'une fuite importante avec l'apparition d'une page produit chez un revendeur tha&#239;landais.
</description>
    </item>
    <item>
      <title>En fusionnant SpaceX et xAI, Elon Musk joue son va-tout</title>
      <link>https://www.frandroid.com/marques/spacex/2963719_en-fusionnant-spacex-et-xai-elon-musk-joue-son-va-tout</link>
      <pubDate>Tue, 03 Feb 2026 06:54:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/spacex/2963719_en-fusionnant-spacex-et-xai-elon-musk-joue-son-va-tout</guid>
      <description>
Une entreprise &#224; mille milliards de dollars, des centres de donn&#233;es dans l&#8217;espace et la conqu&#234;te de Mars. La fusion de xAi et de SpaceX tout juste annonc&#233; par Elon Musk d&#233;borde de promesses plus ou moins r&#233;alistes.
</description>
    </item>
    <item>
      <title>La technologie Nvidia G-SYNC compatible avec les TV Samsung OLED 2026 et certains moniteurs</title>
      <link>https://www.frandroid.com/marques/samsung/2963723_la-technologie-nvidia-g-sync-compatible-avec-les-tv-samsung-oled-2026-et-certains-moniteurs</link>
      <pubDate>Tue, 03 Feb 2026 06:42:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2963723_la-technologie-nvidia-g-sync-compatible-avec-les-tv-samsung-oled-2026-et-certains-moniteurs</guid>
      <description>
Samsung Electronics vient d'annoncer que l'ensemble de sa gamme de t&#233;l&#233;viseurs OLED pour 2026 sera compatible avec la technologie Nvidia G-SYNC. Cette certification concerne les mod&#232;les S95H, S90H et S85H, ainsi que les nouveaux moniteurs gaming Odyssey G6 pour une exp&#233;rience de jeu plus fluide.
</description>
    </item>
    <item>
      <title>Pourquoi ce forfait &#224; 5,49 euros devient soudainement l&#8217;un des plus int&#233;ressants du march&#233; ?</title>
      <link>https://www.frandroid.com/bons-plans/2963447_pourquoi-ce-forfait-a-549-euros-devient-soudainement-lun-des-plus-interessants-du-marche</link>
      <pubDate>Tue, 03 Feb 2026 06:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2963447_pourquoi-ce-forfait-a-549-euros-devient-soudainement-lun-des-plus-interessants-du-marche</guid>
      <description>
NRJ Mobile d&#233;cide de muscler son jeu sur l'entr&#233;e de gamme. L'op&#233;rateur virtuel ajoute gratuitement 10 Go &#224; son offre la plus accessible, qui passe ainsi &#224; 30 Go pour moins de 6 euros par mois.
</description>
    </item>
    <item>
      <title>01net morning&#160;: test de l&#8217;enceinte Ikea &#224; 5&#160;euros, les t&#233;l&#233;viseurs 8K en voie d&#8217;extinction, massacre chez les cryptos</title>
      <link>https://www.01net.com/actualites/01net-morning-test-de-lenceinte-ikea-a-5-euros-les-televiseurs-8k-en-voie-dextinction-massacre-chez-les-cryptos.html</link>
      <pubDate>Tue, 03 Feb 2026 06:29:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323806</guid>
      <description>Bonjour &#224; tous, voici la matinale de 01net ! Qu&#8217;avez-vous manqu&#233; hier ? Retrouvez toute l&#8217;actu &#224; connaitre pour d&#233;marrer la journ&#233;e du bon pied !</description>
    </item>
    <item>
      <title>Dyson just brought out a new hard-floor cleaner, and I'm sorry, but I prefer the old one &#8211; here's why</title>
      <link>https://www.techradar.com/home/vacuums/dyson-clean-wash-hygiene-vs-washg1</link>
      <pubDate>Tue, 03 Feb 2026 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">WnqGGxrBmeCJYg9oZXEMh7</guid>
      <description>In 'improving' its WashG1 hard floor cleaner, Dyson got rid of everything that made it great.</description>
    </item>
    <item>
      <title>This 3-part framework can help you land your dream job</title>
      <link>https://www.fastcompany.com/91480187/this-three-part-framework-can-help-you-land-your-dream-job</link>
      <pubDate>2026-02-03T06:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480187/this-three-part-framework-can-help-you-land-your-dream-job</guid>
      <description>Getting your dream job requires more than just talent. Here&#8217;s what else you need to focus on.
For two decades, I&#8217;ve mentored professionals at every career stage: first as a high school teacher and administrator, and presently as a university professor and corporate consultant. One pattern emerges across every career pathway&#8212;the people who find strong fits for their talents aren&#8217;t the ones with the most impressive single credential. They&#8217;re the ones who understand how three things work together: Skills. Credentials. Network....</description>
    </item>
    <item>
      <title>3 ways to attract employees who will love their jobs</title>
      <link>https://www.fastcompany.com/91481135/3-ways-to-attract-employees-who-will-love-their-jobs</link>
      <pubDate>2026-02-03T06:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91481135/3-ways-to-attract-employees-who-will-love-their-jobs</guid>
      <description>Employees who love their jobs can make a company&#8212;here&#8217;s how you can find them.
If you&#8217;re a CEO, entrepreneur, recruiter, or hiring manager, you know how important it is to hire the right people for the right roles. But hiring the right people for the right roles goes way beyond simply attracting &#8220;the best and brightest&#8221; of your industry. Just because someone is highly qualified, great at what they do and has impressive experience, doesn&#8217;t mean they are a good fit for your organization or your culture. If you want your business to thrive in the marketplace, you need to filter out potential empl...</description>
    </item>
  </channel>
</rss>
