<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 03 Feb 2026 08:45:08 GMT</lastBuildDate>
    <item>
      <title>Cette tache solaire grandit &#224; une vitesse folle&#8230; et vient de d&#233;clencher l&#8217;une des plus puissantes &#233;ruptions du cycle</title>
      <link>https://www.futura-sciences.com/sciences/actualites/eruption-solaire-cette-tache-solaire-grandit-vitesse-folle-vient-declencher-plus-puissantes-eruptions-cycle-130847/#xtor%3DRSS-8</link>
      <pubDate>Tue, 03 Feb 2026 09:43:40 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/eruption-solaire-cette-tache-solaire-grandit-vitesse-folle-vient-declencher-plus-puissantes-eruptions-cycle-130847/#xtor%3DRSS-8</guid>
      <description>Sur notre Soleil, une nouvelle tache s&#8217;est brutalement r&#233;veill&#233;e. Ces derni&#232;res heures, elle est entr&#233;e plusieurs fois en &#233;ruption. Et une fois d&#233;j&#224;, de mani&#232;re spectaculaire.&#160;De quoi esp&#233;rer &#8211; ou redouter &#8211; une nouvelle temp&#234;te solaire m&#233;morable dans les jours &#224; venir.</description>
    </item>
    <item>
      <title>The Switch just surpassed the DS as Nintendo's best-selling console ever</title>
      <link>https://www.engadget.com/gaming/nintendo/the-switch-just-surpassed-the-ds-as-nintendos-best-selling-console-ever-083700901.html?src=rss</link>
      <pubDate>Tue, 03 Feb 2026 08:37:00 +0000</pubDate>
      <guid isPermaLink="false">4bb11cfd-c37c-46ab-b89a-12ca88c0c657</guid>
      <description>The original Switch just became Nintendo&#8217;s best-selling console ever with 155.37 million units as of December 31, 2025, overtaking the DS which sold 154.02 million units from 2004-2011. It was part of a holiday surge that saw the company move 7.01 million Switch 2s (and 17.37 million through Q3 of its fiscal year), making it the &#8220;fastest-selling dedicated video platform released by Nintendo to date,&#8221; the company said in its earnings report. Despite being supplanted by the Switch 2, the Switch keeps selling decently (1.36 million units in Q3 fiscal 2026), due to its relatively cheap price. Nint...</description>
    </item>
    <item>
      <title>La Nintendo Switch marque l&#8217;histoire : elle devient officiellement la console la plus vendue de la marque</title>
      <link>https://www.frandroid.com/actualites-generales/2963799_la-nintendo-switch-marque-lhistoire-elle-devient-officiellement-la-console-la-plus-vendue-de-la-marque</link>
      <pubDate>Tue, 03 Feb 2026 08:35:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2963799_la-nintendo-switch-marque-lhistoire-elle-devient-officiellement-la-console-la-plus-vendue-de-la-marque</guid>
      <description>
Nintendo a d&#233;voil&#233; les chiffres de vente de sa Switch. Lanc&#233;e en 2017, la console a d&#233;sormais d&#233;pass&#233; les chiffres de vente de la Nintendo DS et devient la console la plus vendue de l'histoire du constructeur. 
</description>
    </item>
    <item>
      <title>Copilot partout, satisfaction nulle part&#160;: Microsoft r&#233;duirait enfin la voilure sur l&#8217;IA dans Windows 11</title>
      <link>https://www.01net.com/actualites/copilot-partout-satisfaction-nulle-part-microsoft-reduirait-enfin-la-voilure-sur-lia-dans-windows-11.html</link>
      <pubDate>Tue, 03 Feb 2026 08:29:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323846</guid>
      <description>Microsoft a pass&#233; la majeure partie de ces derniers mois (ann&#233;es ?) &#224; int&#233;grer de l'IA g&#233;n&#233;rative au chausse-pied dans Windows 11. Certaines fonctions de Copilot sont probablement utiles, d'autres sont redondantes, n'ont aucun int&#233;r&#234;t, ou ne sont l&#224; que pour faire joli. Il semble que les innombrables critiques des utilisateurs aient fini par porter leurs fruits....</description>
    </item>
    <item>
      <title>Amazon brade &#224; -25 % cette batterie externe de 20 000 mAh capable de recharger 3 appareils et devient un indispensable</title>
      <link>https://www.frandroid.com/marques/2963569_amazon-brade-a-25-cette-batterie-externe-de-20-000-mah-capable-de-recharger-3-appareils-et-devient-un-indispensable</link>
      <pubDate>Tue, 03 Feb 2026 08:12:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2963569_amazon-brade-a-25-cette-batterie-externe-de-20-000-mah-capable-de-recharger-3-appareils-et-devient-un-indispensable</guid>
      <description>
&#192; la recherche d'une batterie externe efficace pour recharger plusieurs de vos appareils ? Celle propos&#233;e par Ugreen avec 20 000 mAh, deux ports USB-C et un port USB-A semble toute trouv&#233;e : bonne nouvelle, elle est brad&#233;e &#224; -25 % sur Amazon. 
</description>
    </item>
    <item>
      <title>Ce que le nouveau NFC va changer pour vous</title>
      <link>https://www.01net.com/actualites/ce-que-le-nouveau-nfc-va-changer-pour-vous.html</link>
      <pubDate>Tue, 03 Feb 2026 08:01:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323843</guid>
      <description>Port&#233;e plus grande, recharge plus g&#233;n&#233;reuse, d&#233;bits multipli&#233;s : avec sa &#171; release 15 &#187;, le NFC Forum promet une &#233;volution profonde de la technologie sans contact. Toutes ces innovations ne verront pas imm&#233;diatement le jour, mais elle annonce des changements importants pour tous les utilisateurs.</description>
    </item>
    <item>
      <title>The best Bluetooth trackers for 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-bluetooth-tracker-140028377.html?src=rss</link>
      <pubDate>Tue, 03 Feb 2026 08:00:35 +0000</pubDate>
      <guid isPermaLink="false">63b124f8-265d-49a7-9d11-52e671bec0c6</guid>
      <description>Most people think of AirTags when they picture a Bluetooth tracker. And indeed, Apple&#8217;s little white discs were once the only capable option, relying on a vast finding network of nearby iPhones to pinpoint lost tags. But now Google has a finding network of its own, and third party brands like Chipolo, Hyper and Pebblebee have trackers that pair with your choice of Google or Apple&#8217;s network. That means you&#8217;ve got a lot of options for tagging and tracking your keys, backpacks, luggage and more. We tested the major brands out there to see how well they work, how loud they are and how they look to...</description>
    </item>
    <item>
      <title>Aussi bien que Brompton &#233;lectrique &#224; moins de 1000 euros&#160;? Le Zip veut tout casser chez les v&#233;los &#233;lectriques pliants</title>
      <link>https://www.01net.com/actualites/aussi-bien-que-brompton-electrique-a-moins-de-1000-euros-le-zip-veut-tout-casser-chez-les-velos-electriques-pliants.html</link>
      <pubDate>Tue, 03 Feb 2026 07:46:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323730</guid>
      <description>Engwe lance le Zip un v&#233;lo pliant &#233;lectrique styl&#233; compact et l&#233;ger &#224; moins de 1 000 euros. Avec une fiche technique s&#233;rieuse et un prix canon, ce VAE chinois veut bousculer le march&#233;.</description>
    </item>
    <item>
      <title>iPhone Fold : Apple s&#8217;appr&#234;te &#224; bousculer 17 ans d&#8217;habitudes avec ce changement de design</title>
      <link>https://www.frandroid.com/marques/apple/2963769_iphone-fold-apple-sapprete-a-bousculer-17-ans-dhabitudes-avec-ce-changement-de-design</link>
      <pubDate>Tue, 03 Feb 2026 07:46:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2963769_iphone-fold-apple-sapprete-a-bousculer-17-ans-dhabitudes-avec-ce-changement-de-design</guid>
      <description>
Alors que l'iPhone Fold, premier smartphone pliant d'Apple, est attendu pour le mois de septembre prochain, de nouveaux d&#233;tails ont &#233;merg&#233; &#224; propos de la disposition des boutons de l'appareil.
</description>
    </item>
    <item>
      <title>Firefox va vous permettre de bloquer toutes les fonctionnalit&#233;s d&#8217;IA&#160;: voici comment</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/2963781_firefox-va-vous-permettre-de-bloquer-toutes-les-fonctionnalites-dia-voici-comment</link>
      <pubDate>Tue, 03 Feb 2026 07:46:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/2963781_firefox-va-vous-permettre-de-bloquer-toutes-les-fonctionnalites-dia-voici-comment</guid>
      <description>
Conscient que l&#8217;intelligence artificielle g&#233;n&#233;rative est rejet&#233;e en bloc par une partie de son public, Mozilla va offrir un moyen simple de s&#8217;en d&#233;barrasser au sein de Firefox.
</description>
    </item>
    <item>
      <title>Notepad++ a &#233;t&#233; pirat&#233; durant plusieurs mois pour espionner certains utilisateurs</title>
      <link>https://www.01net.com/actualites/notepad-a-ete-pirate-durant-plusieurs-mois-pour-espionner-certains-utilisateurs.html</link>
      <pubDate>Tue, 03 Feb 2026 07:39:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323866</guid>
      <description>L&#8217;&#233;diteur de texte NotePad++ a &#233;t&#233; victime d&#8217;une attaque sophistiqu&#233;e. Pendant plusieurs mois, des hackers ont compromis les serveurs de mise &#224; jour du logiciel pour rediriger les utilisateurs vers des mises &#224; jour malveillantes.</description>
    </item>
    <item>
      <title>Fuite des prix fran&#231;ais des Galaxy Buds 4 et Galaxy 4 Pro avant leur lancement officiel</title>
      <link>https://www.frandroid.com/marques/samsung/2963729_fuite-des-prix-francais-des-galaxy-buds-4-et-galaxy-4-pro-avant-leur-lancement-officiel</link>
      <pubDate>Tue, 03 Feb 2026 07:30:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2963729_fuite-des-prix-francais-des-galaxy-buds-4-et-galaxy-4-pro-avant-leur-lancement-officiel</guid>
      <description>
Les nouveaux &#233;couteurs sans fil de Samsung arriveront fin f&#233;vrier 2026 des prix similaires &#224; leurs successeurs si on en croit la fuite r&#233;cente dont ils ont fait l&#8217;objet.
</description>
    </item>
    <item>
      <title>Firefox&#160;: un bouton pour couper compl&#232;tement les fonctions d&#8217;IA g&#233;n&#233;rative</title>
      <link>https://www.01net.com/actualites/firefox-un-bouton-pour-couper-completement-les-fonctions-dia-generative.html</link>
      <pubDate>Tue, 03 Feb 2026 07:30:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323839</guid>
      <description>Tout le monde n'aime pas forc&#233;ment l'IA g&#233;n&#233;rative, m&#234;me s'il est bien difficile d'y &#233;chapper ! La fondation Mozilla, qui peut difficilement faire l'impasse sur cette technologie, veut tout de m&#234;me donner la possibilit&#233; aux utilisateurs de son navigateur Firefox de bloquer compl&#232;tement les fonctions d'IA.</description>
    </item>
    <item>
      <title>Google TV Streamer 4K : le prix du rempla&#231;ant du Chromecast fond l&#233;g&#232;rement sur le site officiel</title>
      <link>https://www.frandroid.com/bons-plans/2963337_google-tv-streamer-4k-le-prix-du-remplacant-du-chromecast-fond-legerement-sur-le-site-officiel</link>
      <pubDate>Tue, 03 Feb 2026 07:25:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2963337_google-tv-streamer-4k-le-prix-du-remplacant-du-chromecast-fond-legerement-sur-le-site-officiel</guid>
      <description>
Le Google TV Streamer 4K a pris la place du Chromecast il y a plus d'un an. Ce bo&#238;tier multim&#233;dia ambitieux, qui vous permet aussi de piloter votre maison connect&#233;e, est propos&#233;, en cette fin de soldes d'hiver, &#224; 99 euros au lieu de 119 euros sur le Google Store.
</description>
    </item>
    <item>
      <title>The Switch is now Nintendo&#8217;s best-selling console of all time</title>
      <link>https://www.theverge.com/games/872768/nintendo-earnings-switch-best-selling-console-ds</link>
      <pubDate>2026-02-03T02:05:22-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=872768</guid>
      <description>The original Switch is officially Nintendo's best-selling console of all time after surpassing the DS handheld in lifetime sales. In its latest earnings release, Nintendo reports that the Nintendo Switch has, as of December 31, 2025, sold 155.37 million units since its launch in 2017, compared to 154.02 million units for the 2004 Nintendo DS. [&#8230;]</description>
    </item>
    <item>
      <title>Il voulait d&#233;tr&#244;ner Bosch : le g&#233;ant allemand ZF suspend finalement ses activit&#233;s dans le v&#233;lo &#233;lectrique</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2963143_il-voulait-detroner-bosch-le-geant-allemand-zf-suspend-finalement-ses-activites-dans-le-velo-electrique</link>
      <pubDate>Tue, 03 Feb 2026 07:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2963143_il-voulait-detroner-bosch-le-geant-allemand-zf-suspend-finalement-ses-activites-dans-le-velo-electrique</guid>
      <description>
L&#8217;&#233;quipementier allemand ZF, qui avait pr&#233;sent&#233; le moteur ZF CentriX en 2024 pour rivaliser avec Bosch et Shimano, a suspendu ses projets dans le v&#233;lo &#233;lectrique, et ferm&#233; sa division de v&#233;hicules &#233;lectriques.
</description>
    </item>
    <item>
      <title>Google T&#233;l&#233;phone&#160;: fini le calvaire, la mise &#224; jour que tout le monde attendait est enfin l&#224;</title>
      <link>https://www.01net.com/actualites/google-telephone-fini-calvaire-mise-a-jour-tout-monde-attendait-enfin-la.html</link>
      <pubDate>Tue, 03 Feb 2026 07:01:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323855</guid>
      <description>Google met fin &#224; des mois de confusion en d&#233;ployant enfin pour tout le monde l&#8217;option qui permet de verrouiller l'application T&#233;l&#233;phone en mode portrait.</description>
    </item>
    <item>
      <title>Pourquoi Nvidia n&#8217;a toujours pas l&#8217;intention de renouveler la Shield TV</title>
      <link>https://www.01net.com/actualites/pourquoi-nvidia-na-toujours-pas-lintention-de-renouveler-la-shield-tv.html</link>
      <pubDate>Tue, 03 Feb 2026 07:00:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323828</guid>
      <description>Depuis 2019 et le lancement de deux nouveaux mod&#232;les, la gamme Shield TV de Nvidia n'a pas &#233;volu&#233; &#8212; sur le plan mat&#233;riel du moins, car le constructeur a multipli&#233; les mises &#224; jour logicielles. Et cela ne devrait pas changer de si t&#244;t.</description>
    </item>
    <item>
      <title>Porsche Cayenne &#233;lectrique&#160;: les secrets de la batterie qui offre 640 km d&#8217;autonomie &#224; un SUV de 2,6 tonnes</title>
      <link>https://www.01net.com/actualites/porsche-cayenne-electrique-les-secrets-de-la-batterie-qui-offre-640-km-dautonomie-a-un-suv-de-26-tonnes.html</link>
      <pubDate>Tue, 03 Feb 2026 06:57:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323797</guid>
      <description>Comment Porsche fabrique-t-il la batterie de son Cayenne &#233;lectrique ? Et pourquoi est-elle unique. Pour le savoir, on est all&#233;s en Slovaquie dans l&#8217;usine de fabrication des nouvelles batteries de Porsche.</description>
    </item>
    <item>
      <title>Sony WF-1000XM6 : une fuite massive d&#233;voile un design totalement repens&#233; et un nouveau bo&#238;tier</title>
      <link>https://www.frandroid.com/marques/sony/2963717_sony-wf-1000xm6-une-fuite-massive-devoile-un-design-totalement-repense-et-un-nouveau-boitier</link>
      <pubDate>Tue, 03 Feb 2026 06:57:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2963717_sony-wf-1000xm6-une-fuite-massive-devoile-un-design-totalement-repense-et-un-nouveau-boitier</guid>
      <description>
Attendus dans les prochaines semaines, les WF-1000XM6, prochains &#233;couteurs haut de gamme de Sony, ont d&#233;j&#224; fait l'objet d'une fuite importante avec l'apparition d'une page produit chez un revendeur tha&#239;landais.
</description>
    </item>
    <item>
      <title>En fusionnant SpaceX et xAI, Elon Musk joue son va-tout</title>
      <link>https://www.frandroid.com/marques/spacex/2963719_en-fusionnant-spacex-et-xai-elon-musk-joue-son-va-tout</link>
      <pubDate>Tue, 03 Feb 2026 06:54:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/spacex/2963719_en-fusionnant-spacex-et-xai-elon-musk-joue-son-va-tout</guid>
      <description>
Une entreprise &#224; mille milliards de dollars, des centres de donn&#233;es dans l&#8217;espace et la conqu&#234;te de Mars. La fusion de xAi et de SpaceX tout juste annonc&#233; par Elon Musk d&#233;borde de promesses plus ou moins r&#233;alistes.
</description>
    </item>
  </channel>
</rss>
