<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 10 Feb 2026 09:01:24 GMT</lastBuildDate>
    <item>
      <title>Vous vous pensiez &#224; l&#8217;abri avec votre Ryzen 9000 ? Ces processeurs AMD planteraient en fait autant que les mod&#232;les Intel</title>
      <link>https://www.frandroid.com/marques/amd/2971681_vous-vous-pensiez-a-labri-avec-votre-ryzen-9000-ces-processeurs-amd-planteraient-en-fait-autant-que-les-modeles-intel</link>
      <pubDate>Tue, 10 Feb 2026 08:46:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amd/2971681_vous-vous-pensiez-a-labri-avec-votre-ryzen-9000-ces-processeurs-amd-planteraient-en-fait-autant-que-les-modeles-intel</guid>
      <description>
Des donn&#233;es partag&#233;es par Puget Systems mettent en &#233;vidence un nombre de d&#233;faillances critiques finalement &#233;quivalent entre la derni&#232;re g&#233;n&#233;ration de processeurs de bureau AMD et la gamme de puces Intel Arrow Lake-S.
</description>
    </item>
    <item>
      <title>Pire que Temu et Shein : Tesla s&#8217;effondre en Europe avec &#171; la plus forte baisse de r&#233;putation que nous ayons observ&#233;e &#187;</title>
      <link>https://www.frandroid.com/marques/tesla/2971763_pire-que-temu-et-shein-tesla-seffondre-en-europe-avec-la-plus-forte-baisse-de-reputation-que-nous-ayons-observee</link>
      <pubDate>Tue, 10 Feb 2026 08:44:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2971763_pire-que-temu-et-shein-tesla-seffondre-en-europe-avec-la-plus-forte-baisse-de-reputation-que-nous-ayons-observee</guid>
      <description>
Selon une r&#233;cente &#233;tude, Tesla est &#224; la derni&#232;re place du classement sur la r&#233;putation des marques dans certains pays d&#8217;Europe. Et la faute n&#8217;est pas seulement &#224; imputer &#224; ses voitures &#233;lectriques.
</description>
    </item>
    <item>
      <title>Ville ou tout-chemin ? Avec ses 18 versions sous Bosch, ce nouveau v&#233;lo &#233;lectrique Trek ne choisit pas</title>
      <link>https://www.frandroid.com/marques/trek/2970633_ville-ou-tout-chemin-avec-ses-18-versions-sous-bosch-ce-nouveau-velo-electrique-trek-ne-choisit-pas</link>
      <pubDate>Tue, 10 Feb 2026 08:41:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/trek/2970633_ville-ou-tout-chemin-avec-ses-18-versions-sous-bosch-ce-nouveau-velo-electrique-trek-ne-choisit-pas</guid>
      <description>
Malgr&#233; un contexte difficile, Trek d&#233;voile son nouveau v&#233;lo &#233;lectrique pour une utilisation en ville comme en tout-chemin en variante Trail, le tout anim&#233; par une assistance Bosch.
</description>
    </item>
    <item>
      <title>Leboncoin fait son entr&#233;e sur ChatGPT&#160;: comment l&#8217;IA recherche les petites annonces &#224; votre place</title>
      <link>https://www.01net.com/actualites/leboncoin-fait-entree-chatgpt-ia-recherche-petites-annonces-place.html</link>
      <pubDate>Tue, 10 Feb 2026 08:41:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325015</guid>
      <description>Leboncoin d&#233;barque dans ChatGPT. On peut maintenant demander &#224; l'IA de parcourir les petites annonces &#224; notre place pour nous aider &#224; trouver la perle rare. On vous explique comment &#231;a marche.</description>
    </item>
    <item>
      <title>La MG4 &#233;lectrique chinoise arrive en Europe avec cette version Urban encore moins cher que l&#8217;ancienne</title>
      <link>https://www.frandroid.com/marques/mg/2971741_la-mg4-electrique-chinoise-arrive-en-europe-avec-cette-version-urban-encore-moins-cher-que-lancienne</link>
      <pubDate>Tue, 10 Feb 2026 08:25:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/mg/2971741_la-mg4-electrique-chinoise-arrive-en-europe-avec-cette-version-urban-encore-moins-cher-que-lancienne</guid>
      <description>
D&#233;voil&#233;e en Chine d&#233;but 2025, la nouvelle MG4 Urban d&#233;barque enfin en Europe, et plus pr&#233;cis&#233;ment au Royaume-Uni. La nouvelle voiture &#233;lectrique est disponible pour moins de 27 000 euros. Elle devrait bient&#244;t arriver en France.
</description>
    </item>
    <item>
      <title>Pens&#233;s pour le sport, les &#233;couteurs Sennheiser Sport True Wireless brad&#233;s &#224; -48% vous accompagnent dans vos entra&#238;nements</title>
      <link>https://www.frandroid.com/bons-plans/2970317_penses-pour-le-sport-les-ecouteurs-sennheiser-sport-true-wireless-brades-a-48-vous-accompagnent-dans-vos-entrainements</link>
      <pubDate>Tue, 10 Feb 2026 08:23:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2970317_penses-pour-le-sport-les-ecouteurs-sennheiser-sport-true-wireless-brades-a-48-vous-accompagnent-dans-vos-entrainements</guid>
      <description>
Avec ses Sport True Wireless, Sennheiser propose des &#233;couteurs intra-auriculaires ouverts con&#231;us pour rester dans vos oreilles pendant vos entra&#238;nements les plus intenses, disponibles pour 72,99 euros au lieu de 139,90 euros.
</description>
    </item>
    <item>
      <title>Avec l&#8217;IA, on ne travaille pas moins&#8230; on travaille plus, selon une nouvelle &#233;tude</title>
      <link>https://www.01net.com/actualites/avec-lia-on-ne-travaille-pas-moins-on-travaille-plus.html</link>
      <pubDate>Tue, 10 Feb 2026 08:17:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324992</guid>
      <description>L'IA g&#233;n&#233;rative n'est pas la panac&#233;e pour booster la productivit&#233; des entreprises. Bien au contraire, elle a tendance &#224; intensifier la charge de travail au risque d'&#233;puiser les salari&#233;s, comme l'explique une nouvelle &#233;tude.</description>
    </item>
    <item>
      <title>Test Logitech G Pro X2 Superstrike : le rapid trigger au creux de la mains</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/peripheriques-pc/souris/2969913_test-logitech-g-pro-x2-superstrike-le-rapid-trigger-au-creux-de-la-mains</link>
      <pubDate>Tue, 10 Feb 2026 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/peripheriques-pc/souris/2969913_test-logitech-g-pro-x2-superstrike-le-rapid-trigger-au-creux-de-la-mains</guid>
      <description>
Apr&#232;s l&#8217;effet Hall sur les claviers, place au syst&#232;me HITS pour les souris. Logitech d&#233;voile la G Pro X2 Superstrike et d&#233;priorise la course aux DPI, pour se concentrer sur l&#8217;optimisation du clic. Enfin une vraie nouveaut&#233; pour les souris d&#233;di&#233;es &#224; l&#8217;esport ?
</description>
    </item>
    <item>
      <title>Zendure lance sa nouvelle gamme SolarFlow&#160;: l&#8217;ind&#233;pendance &#233;nerg&#233;tique change d&#8217;&#233;chelle</title>
      <link>https://www.01net.com/actualites/zendure-lance-sa-nouvelle-gamme-solarflow-lindependance-energetique-change-dechelle.html</link>
      <pubDate>Tue, 10 Feb 2026 08:00:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324998</guid>
      <description>Avec sa s&#233;rie SolarFlow lanc&#233;e ce 10 f&#233;vrier, Zendure ne veut plus seulement effacer votre talon de consommation, mais piloter toute votre maison gr&#226;ce &#224; l'IA.</description>
    </item>
    <item>
      <title>The best E Ink tablets for 2026</title>
      <link>https://www.engadget.com/mobile/tablets/best-e-ink-tablet-130037939.html?src=rss</link>
      <pubDate>Tue, 10 Feb 2026 08:00:36 +0000</pubDate>
      <guid isPermaLink="false">57f41413-eec2-4d90-9c25-26d144b737b8</guid>
      <description>I&#8217;m a longtime lover of pen and paper, so E Ink tablets have been intriguing to me ever since they started becoming more widely available. After having hundreds of half-filled notebooks over the years, I, at some point, turned to digital tools instead because it was just easier to store everything on my phone or laptop so I always had my most important information at my fingertips.E-Ink tablets seem to provide the best of both worlds: the tactile satisfaction of regular notebooks with many of the conveniences found in digital tools, plus easy-on-the-eyes E-Ink screens. These devices have come ...</description>
    </item>
    <item>
      <title>How to watch Marty Supreme: When is Timoth&#233;e Chalamet&#8217;s Oscar-nominated film streaming?</title>
      <link>https://mashable.com/article/how-to-watch-marty-supreme</link>
      <pubDate>Tue, 10 Feb 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">03uOnfGiCfKVip4k5Mrv1oq</guid>
      <description>Is "Marty Supreme" streaming yet? Find out how to watch Timoth&#233;e Chalamet&#8217;s new movie at home.</description>
    </item>
    <item>
      <title>Logitech supprime les interrupteurs de sa souris &#171;&#160;Superstrike&#160;&#187; : pourquoi c&#8217;est une petite r&#233;volution</title>
      <link>https://www.frandroid.com/marques/logitech/2971341_logitech-supprime-les-interrupteurs-de-sa-souris-superstrike-pourquoi-cest-une-petite-revolution</link>
      <pubDate>Tue, 10 Feb 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/logitech/2971341_logitech-supprime-les-interrupteurs-de-sa-souris-superstrike-pourquoi-cest-une-petite-revolution</guid>
      <description>
La Logitech Pro X2 Superstrike est la premi&#232;re du genre &#224; &#234;tre &#233;quip&#233;e de nouveaux boutons qui offrent des performances, mais aussi un ressenti, encore jamais vus sur une souris. On vous explique tout sur cette technologie qui s&#8217;inspire grandement des claviers m&#233;caniques modernes.
</description>
    </item>
    <item>
      <title>Apple lancerait bient&#244;t le Studio Display 2, que faut-il attendre du nouvel &#233;cran pour le Mac&#160;?</title>
      <link>https://www.01net.com/actualites/apple-lancerait-bientot-studio-display-2-que-faut-attendre-nouvel-ecran-mac.html</link>
      <pubDate>Tue, 10 Feb 2026 07:44:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325007</guid>
      <description>Apple s'appr&#234;terait &#224; lancer un nouveau Studio Display. Au programme de la nouvelle g&#233;n&#233;ration, on trouve un design inchang&#233;, un &#233;cran am&#233;lior&#233; avec une fr&#233;quence de rafraichissement revue &#224; la hausse et une puce plus puissante.</description>
    </item>
    <item>
      <title>Bluesky finally has drafts</title>
      <link>https://mashable.com/article/bluesky-drafts-update</link>
      <pubDate>Tue, 10 Feb 2026 07:42:54 +0000</pubDate>
      <guid isPermaLink="false">063x9KzaVtN3HS4opC2SMBj</guid>
      <description>Bluesky has added drafts, a feature that has long been available on competitors X and Threads.</description>
    </item>
    <item>
      <title>WhatsApp d&#233;ploie les appels audio et vid&#233;o sur le Web</title>
      <link>https://www.01net.com/actualites/whatsapp-deploie-les-appels-audio-et-video-sur-le-web.html</link>
      <pubDate>Tue, 10 Feb 2026 07:30:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325011</guid>
      <description>La version web du client de messagerie prend d&#233;sormais en charge les appels audio et vid&#233;o.</description>
    </item>
    <item>
      <title>Semi-conducteurs&#160;: quand le monde d&#233;pend aussi de l&#8217;Europe</title>
      <link>https://www.01net.com/actualites/semi-conducteurs-quand-le-monde-depend-aussi-de-leurope.html</link>
      <pubDate>Tue, 10 Feb 2026 07:29:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324987</guid>
      <description>Certes, l'Europe est d&#233;pendante des technologies am&#233;ricaines et chinoises&#8230; mais le reste du monde est tout aussi d&#233;pendant de l'Europe ! Sans les machines du groupe n&#233;erlandais ASML, personne ne pourrait produire les puces &#233;lectroniques les plus avanc&#233;es. Un message que l'on va entendre beaucoup.</description>
    </item>
    <item>
      <title>Sony&#160;WF-1000XM6&#160;: deux jours avant leur officialisation, les &#233;couteurs se d&#233;voilent int&#233;gralement</title>
      <link>https://www.frandroid.com/marques/sony/2971739_sony-wf-1000xm6-deux-jours-avant-leur-officialisation-les-ecouteurs-se-devoilent-integralement</link>
      <pubDate>Tue, 10 Feb 2026 07:24:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2971739_sony-wf-1000xm6-deux-jours-avant-leur-officialisation-les-ecouteurs-se-devoilent-integralement</guid>
      <description>
Le design, la date et le prix &#233;taient d&#233;j&#224; connus, restaient plus que la fiche technique. Les WF-1000XM6 de Sony, &#233;couteurs sans fil tr&#232;s attendus, ont fait l&#8217;objet d&#8217;une nouvelle fuite d&#233;voilant leurs caract&#233;ristiques.
</description>
    </item>
    <item>
      <title>Gaming sous Linux : pourquoi Linux 7.0 va faire du bien &#224; vos FPS</title>
      <link>https://www.frandroid.com/os/gnu-linux/2971729_gaming-sous-linux-pourquoi-linux-7-0-va-faire-du-bien-a-vos-fps</link>
      <pubDate>Tue, 10 Feb 2026 07:21:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/gnu-linux/2971729_gaming-sous-linux-pourquoi-linux-7-0-va-faire-du-bien-a-vos-fps</guid>
      <description>
Avec la sortie de Linux 6.19, Linus Torvalds cl&#244;ture le cycle 6.x pour ouvrir la voie &#224; Linux 7.0. Ce n'est pas seulement un changement de nom pour le plaisir des chiffres ronds, mais l'acte de naissance d'un noyau qui assume enfin l'h&#233;ritage de Rust et booste s&#233;rieusement le gaming.
</description>
    </item>
    <item>
      <title>&#192; -20 %, ce laptop avec Ryzen AI 7 + 32 Go RAM est le super deal &#224; saisir avant la hausse des prix PC</title>
      <link>https://www.frandroid.com/bons-plans/2971243_a-20-ce-laptop-avec-ryzen-ai-7-32-go-ram-est-le-super-deal-a-saisir-avant-la-hausse-des-prix-pc</link>
      <pubDate>Tue, 10 Feb 2026 07:05:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2971243_a-20-ce-laptop-avec-ryzen-ai-7-32-go-ram-est-le-super-deal-a-saisir-avant-la-hausse-des-prix-pc</guid>
      <description>
Si vous &#234;tes &#224; la recherche d'un laptop bien &#233;quip&#233;, le Lenovo IdeaPad Slim 5 14AKP10 avec Ryzen AI 7, 32 Go de RAM et 1 To SSD voit son prix passer de 1 149 &#8364; &#224; 919 &#8364; chez Darty, un rabais qui le rend plus recommandable.&#160;
</description>
    </item>
    <item>
      <title>Premi&#232;res pubs dans ChatGPT&#160;: pour les arr&#234;ter, il faut payer</title>
      <link>https://www.01net.com/actualites/les-premieres-publicites-apparaissent-dans-chatgpt.html</link>
      <pubDate>Tue, 10 Feb 2026 07:02:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324984</guid>
      <description>OpenAI lance le bulldozer publicitaire dans ChatGPT. Les premiers bandeaux de r&#233;clame ont commenc&#233; &#224; apparaitre, d'abord  aux &#201;tats-Unis dans le cadre d'un test. L'exp&#233;rimentation servira &#224; ajuster le tir si besoin&#160;; ensuite, nul doute que le reste du monde passera &#224; la casserole.</description>
    </item>
  </channel>
</rss>
