<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 26 Jan 2026 16:40:00 GMT</lastBuildDate>
    <item>
      <title>The best TVs for sound: from Sony, Panasonic, Hisense and more.</title>
      <link>https://www.techradar.com/televisions/the-best-tvs-for-sound-from-sony-panasonic-hisense-and-more</link>
      <pubDate>Mon, 26 Jan 2026 16:35:27 +0000</pubDate>
      <guid isPermaLink="false">SPjbXAYHgVVo3mUSZgarrR</guid>
      <description>The best TVs for sound bring you theater-style audio to match their picture performance without adding soundbars or the hassle of a surround system.</description>
    </item>
    <item>
      <title>Huawei FreeClip 2 : ces nouveaux &#233;couteurs-bijoux qui ne s&#8217;ins&#232;rent pas dans l&#8217;oreille promettent un son premium [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/2948635_huawei-freeclip-2-ces-nouveaux-ecouteurs-bijoux-qui-ne-sinserent-pas-dans-loreille-promettent-un-son-premium</link>
      <pubDate>Mon, 26 Jan 2026 16:34:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2948635_huawei-freeclip-2-ces-nouveaux-ecouteurs-bijoux-qui-ne-sinserent-pas-dans-loreille-promettent-un-son-premium</guid>
      <description>
Avec les Huawei FreeClip 2, le constructeur renouvelle ses &#233;couteurs ouverts au look unique en les dotant d'un son encore meilleur. Lanc&#233;s &#224; 199,99 euros, ils sont en ce moment affich&#233;s avec 30 euros de remise gr&#226;ce &#224; un coupon. 
</description>
    </item>
    <item>
      <title>Best portable projector of 2025: Tested for streaming and presenting on the go.</title>
      <link>https://www.techradar.com/pro/best-portable-projector-of-2025-tested-for-streaming-and-presenting-on-the-go</link>
      <pubDate>Mon, 26 Jan 2026 16:33:38 +0000</pubDate>
      <guid isPermaLink="false">7oHjKQ3AAGb9hAjFyEAx2j</guid>
      <description>Want to stream or present anywhere - then these are the best mini and handheld projectors we've reviewed.</description>
    </item>
    <item>
      <title>OpenAI is working out how much to charge for ChatGPT ads</title>
      <link>https://www.theverge.com/news/867898/openai-chatgpt-ad-pricing</link>
      <pubDate>2026-01-26T11:33:11-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=867898</guid>
      <description>OpenAI is reportedly asking a high price to advertise on ChatGPT, around $60 per 1,000 views, or triple what ads on Meta's platform usually cost, according to The Information. Despite the higher price, OpenAI won't be offering advertisers the same level of detailed information that Google and Meta do, such as whether users took any [&#8230;]</description>
    </item>
    <item>
      <title>Payment processors were against CSAM until Grok started making it</title>
      <link>https://www.theverge.com/ai-artificial-intelligence/867874/stripe-visa-mastercard-amex-csam-grok</link>
      <pubDate>2026-01-26T11:32:17-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=867874</guid>
      <description>For many years, credit card companies and other payment methods were aggressive about policing child sexual abuse material. Then, Elon Musk's Grok started undressing children on X. The Center for Countering Digital Hate found 101 sexualized images of children as part of its sample of 20,000 images made by Grok from December 29th to January [&#8230;]</description>
    </item>
    <item>
      <title>Le gouvernement veut contraindre TikTok, Snapchat et Instagram &#224; v&#233;rifier l&#8217;&#226;ge de tous les utilisateurs &#224; partir de l&#8217;ann&#233;e prochaine</title>
      <link>https://www.01net.com/actualites/le-gouvernement-veut-contraindre-tiktok-snapchat-et-instagram-a-verifier-lage-de-tous-les-utilisateurs-a-partir-de-lannee-prochaine.html</link>
      <pubDate>Mon, 26 Jan 2026 16:31:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322454</guid>
      <description>Interdire les r&#233;seaux sociaux aux moins de 15 ans&#160;: le gouvernement s&#8217;est saisi de la proposition de loi de la d&#233;put&#233;e macroniste Laure Miller pour interdire aux mineurs d&#8217;acc&#233;der aux r&#233;seaux sociaux.  Le texte est examin&#233; en s&#233;ance publique ce lundi 26 janvier.</description>
    </item>
    <item>
      <title>JBL&#8217;s New Speakers Use AI to Silence Your Favorite Song&#8217;s Worst Guitar Solo</title>
      <link>https://gizmodo.com/jbls-new-speakers-use-ai-to-silence-your-favorite-songs-worst-guitar-solo-2000713951</link>
      <pubDate>Mon, 26 Jan 2026 16:30:27 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000713951</guid>
      <description>New BandBox speakers can remove parts from your favorite songs so you can play along.</description>
    </item>
    <item>
      <title>The best soundbars for all budgets, all tested by us.</title>
      <link>https://www.techradar.com/televisions/soundbars/the-best-soundbars-for-all-budgets-all-tested-by-us</link>
      <pubDate>Mon, 26 Jan 2026 16:28:11 +0000</pubDate>
      <guid isPermaLink="false">YvgEMfvuwXBYtzdqB9ee6</guid>
      <description>From budget-friendly bars to Dolby Atmos wonders, the best soundbars make it easy to get a serious TV audio upgrade.</description>
    </item>
    <item>
      <title>Comment d&#233;synchroniser Google Photos de son smartphone ?</title>
      <link>https://www.frandroid.com/comment-faire/2887187_comment-desynchroniser-google-photos-de-son-smartphone</link>
      <pubDate>Mon, 26 Jan 2026 16:27:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/comment-faire/2887187_comment-desynchroniser-google-photos-de-son-smartphone</guid>
      <description>
Sur la plupart des smartphones Android, Google Photos est l'application par d&#233;faut pour le stockage. Voici comment d&#233;synchroniser le logiciel de votre t&#233;l&#233;phone.
</description>
    </item>
    <item>
      <title>650 miles from one charge &#8211; Volvo's parent company beats Tesla to the punch with first production-ready solid-state battery</title>
      <link>https://www.techradar.com/vehicle-tech/hybrid-electric-vehicles/650-miles-from-one-charge-volvos-parent-company-beats-tesla-to-the-punch-with-first-production-ready-solid-state-battery</link>
      <pubDate>Mon, 26 Jan 2026 16:27:11 +0000</pubDate>
      <guid isPermaLink="false">QgwMpyeMTFMmgHpkNP7tAc</guid>
      <description>Geely will commence production of its debut solid-state battery pack this year, edging closer to a 650-mile electric range.</description>
    </item>
    <item>
      <title>Tech workers call for CEOs to speak up against ICE after the killing of Alex Pretti</title>
      <link>https://techcrunch.com/2026/01/26/tech-workers-call-for-ceos-to-speak-up-against-ice-after-the-killing-of-alex-pretti/</link>
      <pubDate>Mon, 26 Jan 2026 16:26:49 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3086000</guid>
      <description>More than 450 tech workers from companies like Google, Meta, OpenAI, Amazon, and Salesforce have signed a letter urging their CEOs to call the White House and demand ICE leave our cities.</description>
    </item>
    <item>
      <title>How to watch T20 World Cup 2026 from anywhere in the world with this VPN deal</title>
      <link>https://www.techradar.com/how-to-watch/cricket/t20-world-cup-2026-free</link>
      <pubDate>Mon, 26 Jan 2026 16:22:56 +0000</pubDate>
      <guid isPermaLink="false">feo8fzjNUZXmKDtrNoV6XE</guid>
      <description>Here's how to watch the T20 World Cup 2026 from anywhere in the world for free with this mega VPN deal.</description>
    </item>
    <item>
      <title>TikTok blames its US problems on a power outage</title>
      <link>https://www.theverge.com/news/867873/tiktok-down-outage-us-data-center-power-outage</link>
      <pubDate>2026-01-26T11:20:32-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=867873</guid>
      <description>TikTok says a power outage is causing ongoing issues and outages that started in the US early Sunday morning. In an email to The Verge, TikTok USDS spokesperson Jamie Favazza pointed to a statement posted to the joint venture's newly-created X account, which says the company has been "working to restore our services following a [&#8230;]</description>
    </item>
    <item>
      <title>Monarch Money's budgeting app is 50 percent off for new users right now</title>
      <link>https://www.engadget.com/apps/monarch-moneys-budgeting-app-is-50-percent-off-for-new-users-right-now-204507443.html?src=rss</link>
      <pubDate>Mon, 26 Jan 2026 16:15:36 +0000</pubDate>
      <guid isPermaLink="false">1764214b-3509-4628-8631-8692fa12e904</guid>
      <description>The start of the new year is a great time to get your finances in order, and a good budgeting app can help with that. Instead of laboring over a spreadsheet, you can try one of our favorite budgeting apps for less than usual. Monarch Money is running a sale that gives new users 50 percent off one year of the service, bringing the final cost down to just $50. Just use the code NEWYEAR2026 at checkout to get the discount.
Monarch Money makes for a capable and detailed budgeting companion. You can use the service via apps for iOS, Android, iPadOS or the web, and Monarch also offers a Chrome exten...</description>
    </item>
    <item>
      <title>Does Dreame Want to Be the Next DJI? It Sure Seems Like It</title>
      <link>https://gizmodo.com/does-dreame-want-to-be-the-next-dji-it-sure-seems-like-it-2000713977</link>
      <pubDate>Mon, 26 Jan 2026 16:10:31 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000713977</guid>
      <description>The smart home company's first action camera is coming for DJI and GoPro's lunch.</description>
    </item>
    <item>
      <title>A powerful AMD gaming desktop is hundreds off at Costco</title>
      <link>https://www.theverge.com/gadgets/867754/asus-desktop-pc-stream-deck-lg-oled-animal-crossing-deal-sale</link>
      <pubDate>2026-01-26T11:00:53-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=867754</guid>
      <description>Given that RAM has become so expensive to buy recently, you might have considered buying a prebuilt desktop computer. If so, and you&#8217;re leaning toward a high-end gaming model, Costco has a model that&#8217;s an impressive value at $1,999.99 ($300 off) for members through February 8th. It&#8217;s an all-AMD, liquid-cooled machine built into Asus&#8217; ROG [&#8230;]</description>
    </item>
    <item>
      <title>&#8216;Zootopia 2&#8217; Slithers Home Tomorrow</title>
      <link>https://gizmodo.com/zootopia-2-home-release-date-streaming-blu-ray-2000713970</link>
      <pubDate>Mon, 26 Jan 2026 16:00:30 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000713970</guid>
      <description>Disney's finally taking 'Zootopia 2' out of the theaters and into your home with special features and deleted scenes for you and your kids to pore over.</description>
    </item>
    <item>
      <title>Microsoft&#8217;s latest AI chip goes head-to-head with Amazon and Google</title>
      <link>https://www.theverge.com/news/867670/microsoft-maia-200-ai-chip-announcement</link>
      <pubDate>2026-01-26T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=867670</guid>
      <description>Microsoft is announcing a successor to its first in-house AI chip today, the Maia 200. Built on TSMC's 3nm process, Microsoft says its Maia 200 AI accelerator "delivers 3 times the FP4 performance of the third generation Amazon Trainium, and FP8 performance above Google's seventh generation TPU." Each Maia 200 chip has more than 100 [&#8230;]</description>
    </item>
    <item>
      <title>Microsoft announces powerful new chip for AI inference</title>
      <link>https://techcrunch.com/2026/01/26/microsoft-announces-powerful-new-chip-for-ai-inference/</link>
      <pubDate>Mon, 26 Jan 2026 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3085536</guid>
      <description>Maia comes equipped with over 100 billion transistors, delivering over 10 petaflops in 4-bit precision and approximately 5 petaflops of 8-bit performance &#8212; a substantial increase over its predecessor.</description>
    </item>
    <item>
      <title>Microsoft unveils Maia 200, its 'powerhouse' accelerator looking to unlock the power of large-scale AI</title>
      <link>https://www.techradar.com/pro/microsoft-unveils-maia-200-its-powerhouse-accelerator-looking-to-unlock-the-power-of-large-scale-ai</link>
      <pubDate>Mon, 26 Jan 2026 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">q8XtczAd4mLF5ePU3BoRnd</guid>
      <description>With over 100 billion transistors, Maia 200 offers "powerhouse" AI inferencing possibilites, Microsoft says.</description>
    </item>
    <item>
      <title>I tested the world's fastest 12mm lens &#8211; should you buy the Sigma 12mm f/1.4 DC | C lens?</title>
      <link>https://www.techradar.com/cameras/camera-lenses/sigma-12mm-f-1-4-dc-c-review</link>
      <pubDate>Mon, 26 Jan 2026 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">44nPEykXeuNEzDsx8SPweG</guid>
      <description>The Sigma 12mm f/1.4 DC | Contemporary is the only mirrorless APS-C lens to simultaneously boast a wide 12mm focal length and bright f/1.4 maximum aperture &#8211; all wrapped up in a light and portable package.</description>
    </item>
    <item>
      <title>Elegoo d&#233;voile la Centauri Carbon 2 : une imprimante 3D pens&#233;e pour le foyer</title>
      <link>https://www.frandroid.com/produits-android/2952891_elegoo-devoile-la-centauri-carbon-2-une-imprimante-3d-pensee-pour-le-foyer</link>
      <pubDate>Mon, 26 Jan 2026 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2952891_elegoo-devoile-la-centauri-carbon-2-une-imprimante-3d-pensee-pour-le-foyer</guid>
      <description>
L'impression 3D prend un second souffle avec l'arriv&#233;e des constructeurs chinois. Elegoo avec sa nouvelle Centauri Carbon 2 vise un usage plus domestique. 
</description>
    </item>
    <item>
      <title>La France d&#233;ploie Visio, son outil cens&#233; remplacer Microsoft Teams et Google Meet</title>
      <link>https://www.frandroid.com/culture-tech/web/2955393_la-france-deploie-visio-son-outil-cense-remplacer-microsoft-teams-et-google-meet</link>
      <pubDate>Mon, 26 Jan 2026 15:59:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/web/2955393_la-france-deploie-visio-son-outil-cense-remplacer-microsoft-teams-et-google-meet</guid>
      <description>
Apr&#232;s un an d'exp&#233;rimentation, le gouvernement g&#233;n&#233;ralise Visio, son logiciel de visioconf&#233;rence. Objectif : se passer de Google, Microsoft et consorts.
</description>
    </item>
    <item>
      <title>Animal Crossing : New Horizons propose sa version Switch 2 au meilleur prix pendant les Soldes</title>
      <link>https://www.frandroid.com/bons-plans/2955345_animal-crossing-new-horizons-propose-sa-version-switch-2-au-meilleur-prix-pendant-les-soldes</link>
      <pubDate>Mon, 26 Jan 2026 15:54:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2955345_animal-crossing-new-horizons-propose-sa-version-switch-2-au-meilleur-prix-pendant-les-soldes</guid>
      <description>
Animal Crossing : New Horizons a incontestablement &#233;t&#233; le jeu du premier confinement. En proposant un univers mignon sur une &#238;le color&#233;e, il a permis au monde entier de s'&#233;vader. Sa version Switch 2 est actuellement disponible pour 47,89 euros au lieu de 64,99 euros.
</description>
    </item>
    <item>
      <title>Nvidia invests $2B to help debt-ridden CoreWeave add 5GW of AI compute</title>
      <link>https://techcrunch.com/2026/01/26/nvidia-invests-2b-to-help-debt-ridden-coreweave-add-5gw-of-ai-compute/</link>
      <pubDate>Mon, 26 Jan 2026 15:52:55 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3085958</guid>
      <description>CoreWeave will also integrate Nvidia's products across its platform, including the new Rubin chip architecture.</description>
    </item>
    <item>
      <title>Blizzard lines up WoW, Overwatch, Hearthstone and Diablo showcases</title>
      <link>https://www.engadget.com/gaming/blizzard-lines-up-wow-overwatch-hearthstone-and-diablo-showcases-154912932.html?src=rss</link>
      <pubDate>Mon, 26 Jan 2026 15:49:12 +0000</pubDate>
      <guid isPermaLink="false">962b03a6-ad40-409a-8843-aad3a124a66e</guid>
      <description>While we got a peek at a few Xbox Game Studios projects during last week&#8217;s Developer Direct event, neither Bethesda nor Activision Blizzard made appearances. Fans of several Blizzard franchises won&#8217;t need to wait too long to find out what&#8217;s next for their favorite games, though, as the publisher has lined up several showcases to help mark its 35th anniversary.The developer-led streams will include &#8220;major game announcements,&#8221; according to Blizzard. They&#8217;ll all air over the next few weeks. Here&#8217;s where and when you can watch each stream:January 29. 12PM ET&#160;&#8212; World of&#160;Warcraft State of Azeroth (Y...</description>
    </item>
    <item>
      <title>WhatsApp va devoir respecter les r&#232;gles de transparence en Europe, mais uniquement pour ses cha&#238;nes publiques</title>
      <link>https://www.01net.com/actualites/whatsapp-va-devoir-respecter-les-regles-de-transparence-en-europe-mais-uniquement-pour-ses-chaines-publiques.html</link>
      <pubDate>Mon, 26 Jan 2026 15:46:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322540</guid>
      <description>WhatsApp fait maintenant partie du club du r&#232;glement europ&#233;en sur les services num&#233;riques : les tr&#232;s grandes plateformes en ligne &#233;pingl&#233;es ont des obligations suppl&#233;mentaires en termes de transparence et de mod&#233;ration. Dans le cas de la messagerie, elles ne s'appliquent qu'aux cha&#238;nes publiques, pas aux conversations priv&#233;es.</description>
    </item>
    <item>
      <title>Sony change ses plans : pourquoi vous allez garder votre PS5 beaucoup plus longtemps</title>
      <link>https://www.frandroid.com/marques/sony/2955495_sony-change-ses-plans-pourquoi-vous-allez-garder-votre-ps5-beaucoup-plus-longtemps</link>
      <pubDate>Mon, 26 Jan 2026 15:45:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2955495_sony-change-ses-plans-pourquoi-vous-allez-garder-votre-ps5-beaucoup-plus-longtemps</guid>
      <description>
Les rumeurs allaient bon train, mais un analyste r&#233;put&#233; vient calmer les ardeurs des technophiles press&#233;s. Si vous &#233;conomisiez d&#233;j&#224; pour la PlayStation 6, vous pouvez rel&#226;cher la pression : Sony semble bien d&#233;cid&#233; &#224; &#233;tirer la carri&#232;re de sa console actuelle plus longtemps que pr&#233;vu.
</description>
    </item>
    <item>
      <title>Android 17 : Google pr&#233;pare un effet de flou g&#233;n&#233;ralis&#233; inspir&#233; d&#8217;Apple</title>
      <link>https://www.frandroid.com/marques/google/2955151_android-17-google-prepare-un-effet-de-flou-generalise-inspire-dapple</link>
      <pubDate>Mon, 26 Jan 2026 15:44:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2955151_android-17-google-prepare-un-effet-de-flou-generalise-inspire-dapple</guid>
      <description>
Google travaillerait sur l&#8217;int&#233;gration g&#233;n&#233;ralis&#233;e d&#8217;effets de flou sur Android, une esth&#233;tique qui rappelle fortement les choix de design d'Apple avec son Liquid Glass.
</description>
    </item>
    <item>
      <title>Bonne nouvelle chez Free qui propose de belles &#233;volutions pour ce forfait 5G &#224; destination des pros</title>
      <link>https://www.frandroid.com/marques/free/2955453_bonne-nouvelle-chez-free-qui-propose-de-belles-evolutions-pour-ce-forfait-5g-a-destination-des-pros</link>
      <pubDate>Mon, 26 Jan 2026 15:44:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2955453_bonne-nouvelle-chez-free-qui-propose-de-belles-evolutions-pour-ce-forfait-5g-a-destination-des-pros</guid>
      <description>
Free propose quelques am&#233;liorations bienvenues pour son forfait 5G &#224; destination des professionnels. Voici ce qu'il faut retenir.
</description>
    </item>
    <item>
      <title>These NYC real estate brokers are facing a sex-trafficking trial that could send them to prison for life</title>
      <link>https://www.fastcompany.com/91481003/these-nyc-real-estate-brokers-facing-sex-trafficking-trial-could-send-prison-life</link>
      <pubDate>2026-01-26T15:40:52</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91481003/these-nyc-real-estate-brokers-facing-sex-trafficking-trial-could-send-prison-life</guid>
      <description>Prosecutors say Tal, Oren and Alon Alexander sexually assaulted, trafficked and raped dozens of women from 2008 to 2021.
The brothers operated in the glitz and glamour of the Hamptons and South Beach. Two were high-end real estate brokers dubbed &#8220;The A Team.&#8221; The third went to law school and ran their family&#8217;s private security firm, which caters to heads of state and the rich and famous.They frequented nightclubs, cruised on yachts and flew on private jets. One lived alongside celebrities and corporate titans on Manhattan&#8217;s Billionaires&#8217; Row. The others had multimillion-dollar waterfront mansi...</description>
    </item>
    <item>
      <title>Selon AMD, la vitesse de votre RAM n&#8217;a (presque) plus d&#8217;impact sur vos FPS</title>
      <link>https://www.frandroid.com/marques/amd/2955445_selon-amd-la-vitesse-de-votre-ram-na-presque-plus-dimpact-sur-vos-fps</link>
      <pubDate>Mon, 26 Jan 2026 15:39:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amd/2955445_selon-amd-la-vitesse-de-votre-ram-na-presque-plus-dimpact-sur-vos-fps</guid>
      <description>
AMD d&#233;clare que la vitesse de votre RAM n'a finalement que peu d'incidence sur les performances en jeu.
</description>
    </item>
    <item>
      <title>TikTok USA is broken</title>
      <link>https://www.theverge.com/news/867625/tiktok-down-weekend-broke-fyp-video-uploads-review</link>
      <pubDate>2026-01-26T10:37:49-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=867625</guid>
      <description>TikTok has suffered from extensive problems on its first weekend after completing a transaction that changed the ownership of its US arm. According to Downdetector, the issues initially spiked in the early hours of Sunday morning, but many users, including editors here at The Verge, are still reporting errors. On Monday morning, TikTok USDS head [&#8230;]...</description>
    </item>
    <item>
      <title>Government by AI? Trump Admin Plans to Write Regulations Using Artificial Intelligence</title>
      <link>https://gizmodo.com/government-by-ai-trump-admin-plans-to-write-regulations-using-artificial-intelligence-2000713978</link>
      <pubDate>Mon, 26 Jan 2026 15:35:21 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000713978</guid>
      <description>Cutting out the middle man?</description>
    </item>
    <item>
      <title>Hackers are using LLMs to build the next generation of phishing attacks - here's what to look out for</title>
      <link>https://www.techradar.com/pro/security/hackers-are-using-llms-to-build-the-next-generation-of-phishing-attacks-heres-what-to-look-out-for</link>
      <pubDate>Mon, 26 Jan 2026 15:35:00 +0000</pubDate>
      <guid isPermaLink="false">AWnYnDPS9RzkLu9A2z2XcW</guid>
      <description>What if a phishing page was generated on the spot, with no visible malicious code or payload?</description>
    </item>
    <item>
      <title>2026 is the year of social media&#8217;s legal reckoning</title>
      <link>https://www.theverge.com/policy/867830/social-media-trials-product-liability-school-districts</link>
      <pubDate>2026-01-26T10:31:25-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=867830</guid>
      <description>Over the next year, top social media executives are expected to take the witness stand to defend their companies from an avalanche of claims about their failure to protect kids. The first of many trials is set to begin this month in California, when Meta, TikTok, and YouTube face claims that tech addiction harmed a [&#8230;]</description>
    </item>
    <item>
      <title>Les 10 smartphones les plus populaires de la semaine sur Frandroid : la gamme des Redmi Note 15 fait toujours sensation</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2491986_les-10-smartphones-les-plus-populaires-de-la-semaine-sur-frandroid-la-gamme-des-redmi-note-15-fait-toujours-sensation</link>
      <pubDate>Mon, 26 Jan 2026 15:29:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2491986_les-10-smartphones-les-plus-populaires-de-la-semaine-sur-frandroid-la-gamme-des-redmi-note-15-fait-toujours-sensation</guid>
      <description>
Pour notre top 10 des smartphones les plus populaires de la semaine sur Frandroid, la nouvelle gamme des Redmi Note 15 est pl&#233;biscit&#233; notamment pour son rapport qualit&#233;/prix.
</description>
    </item>
    <item>
      <title>Samsung liquide ses stocks avant la derni&#232;re d&#233;marque des soldes : les 17 offres &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2939747_samsung-liquide-ses-stocks-avant-la-derniere-demarque-des-soldes-les-17-offres-a-retenir</link>
      <pubDate>Mon, 26 Jan 2026 15:29:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2939747_samsung-liquide-ses-stocks-avant-la-derniere-demarque-des-soldes-les-17-offres-a-retenir</guid>
      <description>
Une nouvelle semaine de soldes d&#233;marre et chez Samsung, les r&#233;ductions continuent de faire r&#234;ver avant la derni&#232;re d&#233;marque&#8239;: smartphones pliables comme le Galaxy Z&#8239;Flip&#8239;7, TV&#8239;OLED haut de gamme &#224; prix cass&#233;... C&#8217;est le moment id&#233;al pour se faire plaisir sans d&#233;passer son budget, avant que les meilleures offres ne disparaissent d&#233;finitivement.
</description>
    </item>
    <item>
      <title>3 risks hindering enterprise-ready AI &#8212; and how low-code workflows help</title>
      <link>https://www.techradar.com/pro/3-risks-hindering-enterprise-ready-ai-and-how-low-code-workflows-help</link>
      <pubDate>Mon, 26 Jan 2026 15:27:47 +0000</pubDate>
      <guid isPermaLink="false">QwwCNNSCZrpJtYhLfMQADh</guid>
      <description>Agentic AI promises autonomy, but enterprises need transparency, control, and governance to trust it.</description>
    </item>
    <item>
      <title>Apple's next-generation AirTags promise better range and a louder voice &#8212; maybe this is how I never lose anything again</title>
      <link>https://www.techradar.com/phones/iphone/apples-next-generation-airtags-promise-better-range-and-a-louder-voice-maybe-this-is-how-i-never-lose-anything-again</link>
      <pubDate>Mon, 26 Jan 2026 15:17:06 +0000</pubDate>
      <guid isPermaLink="false">LnYm68WWi5QUiJvawERPHi</guid>
      <description>Apple finally updates its Apple AirTags with new components for better range, sound, and findability.</description>
    </item>
    <item>
      <title>SpaceX eyes mid-March for first test of upgraded Starship rocket</title>
      <link>https://techcrunch.com/2026/01/26/spacex-eyes-mid-march-for-first-test-of-upgraded-starship-rocket/</link>
      <pubDate>Mon, 26 Jan 2026 15:16:49 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3085966</guid>
      <description>The launch date had been up in the air after the rocket's booster stage suffered an explosion during testing in November.</description>
    </item>
    <item>
      <title>Netflix en f&#233;vrier 2026 : The Night Agent reprend du service ! Voici les films, s&#233;ries et documentaires &#224; ne pas manquer</title>
      <link>https://www.frandroid.com/services/svod/2955215_netflix-en-fevrier-2026-the-night-agent-reprend-du-service-voici-les-films-series-et-documentaires-a-ne-pas-manquer</link>
      <pubDate>Mon, 26 Jan 2026 15:12:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2955215_netflix-en-fevrier-2026-the-night-agent-reprend-du-service-voici-les-films-series-et-documentaires-a-ne-pas-manquer</guid>
      <description>
Netflix a d&#233;voil&#233; son programme de f&#233;vrier ! Voici les films, s&#233;ries et documentaires &#224; voir lors des prochaines semaines.
</description>
    </item>
    <item>
      <title>Dans les coulisses du grand d&#233;part de Sophie Adenot vers la Station spatiale</title>
      <link>https://www.futura-sciences.com/sciences/actualites/sophie-adenot-coulisses-grand-depart-sophie-adenot-vers-station-spatiale-130244/#xtor%3DRSS-8</link>
      <pubDate>Mon, 26 Jan 2026 16:08:10 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/sophie-adenot-coulisses-grand-depart-sophie-adenot-vers-station-spatiale-130244/#xtor%3DRSS-8</guid>
      <description>L'astronaute fran&#231;aise Sophie Adenot doit partir &#224; destination de l'ISS d'ici moins d'un mois, avec un planning toujours quelque peu incertain. Mais ce qui est s&#251;r, c'est que ses&#160;jours sur Terre avant le d&#233;part ne seront pas de tout repos.</description>
    </item>
    <item>
      <title>AI projects worldwide are failing in businesses because of this simple reason</title>
      <link>https://www.techradar.com/pro/ai-projects-worldwide-are-failing-in-businesses-because-of-this-simple-reason</link>
      <pubDate>Mon, 26 Jan 2026 15:07:33 +0000</pubDate>
      <guid isPermaLink="false">vb3UdYwLc8G3JjgHY8YMNS</guid>
      <description>Bridging the expectation gap begins with creating a shared language for discussing AI.</description>
    </item>
    <item>
      <title>Why the European Union is launching a probe into Elon Musk&#8217;s Grok chatbot</title>
      <link>https://www.fastcompany.com/91480970/why-european-union-launching-probe-elon-musks-grok-ai-chatbot</link>
      <pubDate>2026-01-26T15:06:19</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480970/why-european-union-launching-probe-elon-musks-grok-ai-chatbot</guid>
      <description>Regulators are investigating Grok after the chatbot enabled users to generate sexualized deepfake images of women.
The European Union opened a formal investigation into Elon Musk&#8217;s social media platform X on Monday after his artificial intelligence chatbot Grok spewed nonconsensual sexualized deepfake images on the platform.European regulators also widened a separate, ongoing investigation into X&#8217;s recommendation systems after the platform said it would switch to Grok&#8217;s AI system to choose which posts users see.The scrutiny from Brussels comes after Grok sparked a global backlash by allowing u...</description>
    </item>
    <item>
      <title>Apple's new AirTag still doesn't have a keyring hole</title>
      <link>https://www.engadget.com/wearables/apples-new-airtag-still-doesnt-have-a-keyring-hole-150540254.html?src=rss</link>
      <pubDate>Mon, 26 Jan 2026 15:05:40 +0000</pubDate>
      <guid isPermaLink="false">8a69a787-277c-4401-8e22-7cb791d6eb0d</guid>
      <description>Apple has launched its next-generation AirTag for $29 and brought a slew of new features along with it. But, first, it's important to get this out of the way: The new AirTag still doesn't have a keyring hole, so you'll still need a case or secure pocket.
Once you get over that, the new Apple AirTag does offer some nice improvements. For starters, it's now powered by Apple's second-generation Ultra Wideband chip &#8212; the same one used in the iPhone 17 lineup and for the Apple Watch Ultra 3. It also uses Precision Finding to reach items up to 50 percent further away than the previous AirTag model. ...</description>
    </item>
    <item>
      <title>The DJI Mini 5 Pro Fly More Combo is down to a record-low price at Amazon &#8212; save $500</title>
      <link>https://mashable.com/article/jan-26-dji-mini-5-pro-combo-deal</link>
      <pubDate>Mon, 26 Jan 2026 15:01:39 +0000</pubDate>
      <guid isPermaLink="false">02tOAd0475Q3YGK8jmaOpGG</guid>
      <description>The DJI Mini 5 Pro Fly More Combo is on sale at Amazon for $1,099, down from the normal price of $1,599. That's a 31% discount.</description>
    </item>
    <item>
      <title>DDR5, DDR4 : quelles sont les meilleures barrettes de RAM pour PC en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-hardware/1218287_quelles-sont-les-meilleures-barrettes-de-ram</link>
      <pubDate>Mon, 26 Jan 2026 15:01:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-hardware/1218287_quelles-sont-les-meilleures-barrettes-de-ram</guid>
      <description>
Besoin de m&#233;moire vive&#8201;pour votre PC ? N&#8217;allez pas plus loin&#8201;! Nous avons choisi pour vous les meilleures barrettes de RAM. DDR4, DDR5, SO-DIMM&#8230; Suivez le guide.
</description>
    </item>
    <item>
      <title>&#8216;A Knight of the Seven Kingdoms&#8217; Sees a Determined Dunk Inch Closer to His Destiny</title>
      <link>https://gizmodo.com/knight-fo-the-seven-kingdoms-episode-2-recap-review-baelor-tanselle-2000712252</link>
      <pubDate>Mon, 26 Jan 2026 15:00:19 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000712252</guid>
      <description>Nobody can stand between a man and his dream, for better or worse, in the latest episode of HBO's 'Game of Thrones' spin-off.</description>
    </item>
    <item>
      <title>Experian&#8217;s tech chief defends credit scores: &#8216;We&#8217;re not Palantir&#8217;</title>
      <link>https://www.theverge.com/podcast/866751/experian-ceo-alex-lintner-credit-scores-ai-privacy-interview</link>
      <pubDate>2026-01-26T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=866751</guid>
      <description>Today, I&#8217;m talking with Alex Lintner, who is the CEO of technology and software solutions at Experian, the credit reporting company. Experian is one of those multinationals that&#8217;s so big and convoluted that it has multiple CEOs all over the world, so Alex and I spent quite a lot of time talking through the Decoder [&#8230;]</description>
    </item>
    <item>
      <title>Only 5 days left: Over half of the first 500 TechCrunch Disrupt 2026 +1 passes at 50% off are already gone</title>
      <link>https://techcrunch.com/2026/01/26/only-5-days-left-over-half-of-the-first-500-techcrunch-disrupt-2026-1-passes-at-50-off-are-already-gone/</link>
      <pubDate>Mon, 26 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3085933</guid>
      <description>Register now&#160;to&#160;save&#160;up to $680 on your TechCrunch Disrupt 2026 pass&#160;and get a +1 ticket at&#160;50% off. Offer&#160;ends&#160;this Friday, January 30.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Tuesday, January 27 (game #1464)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-27-january-2026</link>
      <pubDate>Mon, 26 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">6APQKi5CyPNFbQvNipLC7Z</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Tuesday, January 27 (game #961)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-27-january-2026</link>
      <pubDate>Mon, 26 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">VJFYYKaA85JCvqvdCZgBdb</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Tuesday, January 27 (game #695)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-27-january-2026</link>
      <pubDate>Mon, 26 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">FcCzmbLbpiBNPf6yc6o7uY</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>A sublime blend of masterful combat and hair-raising horror&#8217; &#8212; why four hours with Resident Evil Requiem has sold me on its dual protagonist premise</title>
      <link>https://www.techradar.com/gaming/resident-evil-requiem-grace-and-leon-preview</link>
      <pubDate>Mon, 26 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">f589UJrfk4ytrxZS95aQ9Q</guid>
      <description>I&#8217;ve played more than four hours of Resident Evil Requiem and its compelling blend of intense third-person action and terrifying first-person horror means that it&#8217;s shaping up to offer the best of both worlds.</description>
    </item>
    <item>
      <title>Resident Evil Requiem gives series fans the best of both action and survival horror</title>
      <link>https://www.engadget.com/gaming/resident-evil-requiem-preview-150000849.html?src=rss</link>
      <pubDate>Mon, 26 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">959847f3-1f51-4f7d-97d3-912cdd9c73b1</guid>
      <description>The ninth mainline Resident Evil is trying to split the difference between the series&#8217; action-heavy entries and the stress-inducing hide-and-seek episodes. During a four-hour playthrough of some early parts of Resident Evil Requiem, I spent time with both of the two main characters, Grace and series mainstay Leon. They offer distinctly different playstyles, talents, strengths, and weaknesses. While it isn't an entirely new premise for the survival horror series (in the original, playing as Chris Redfield offered  more challenge than playing as Jill Valentine) it&#8217;s never been this pronounced.&#160;I...</description>
    </item>
    <item>
      <title>Gold just hit a major milestone. Is silver next?</title>
      <link>https://www.fastcompany.com/91480895/gold-price-silver-just-hit-major-milestone-how-high-will-it-go</link>
      <pubDate>2026-01-26T15:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480895/gold-price-silver-just-hit-major-milestone-how-high-will-it-go</guid>
      <description>Here&#8217;s why the price of precious metals is rising&#8212;and why it might be a bad sign for the broader markets.
On Sunday, the price of gold hit a major milestone: it surpassed the $5,000-per-ounce mark for the first time in history. But while gold&#8217;s price rise is a good thing for investors in the precious metal, it may also signal broader investor anxiety about the markets&#8212;and the world. Here&#8217;s what you need to know about gold&#8217;s surge....</description>
    </item>
    <item>
      <title>Resident Evil: Requiem might actually get to have its cake and eat it too</title>
      <link>https://mashable.com/article/resident-evil-requiem-hands-on-impressions-preview</link>
      <pubDate>Mon, 26 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">023a1HUUdYjDjI7Z8p6iAfU</guid>
      <description>The newest entry in the venerable 'Resident Evil' series seems like a good mix of sweaty panic and violent catharsis.</description>
    </item>
    <item>
      <title>Amazon Kindle : mauvaise nouvelle si vous utilisez cette fonction gratuite, elle va devenir payante</title>
      <link>https://www.frandroid.com/marques/amazon/2955237_amazon-kindle-mauvaise-nouvelle-si-vous-utilisez-cette-fonction-gratuite-elle-va-devenir-payante</link>
      <pubDate>Mon, 26 Jan 2026 14:56:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazon/2955237_amazon-kindle-mauvaise-nouvelle-si-vous-utilisez-cette-fonction-gratuite-elle-va-devenir-payante</guid>
      <description>
Apr&#232;s la suppression d'une option sur les liseuses Kindle, voici celle pour laquelle il faudra payer d&#233;sormais.
</description>
    </item>
    <item>
      <title>Apple announces new AirTag with higher range, louder speaker</title>
      <link>https://mashable.com/article/apple-airtag-new-2026</link>
      <pubDate>Mon, 26 Jan 2026 14:56:17 +0000</pubDate>
      <guid isPermaLink="false">066lEVl66FNu85dJcEskPYH</guid>
      <description>One of Apple's most useful accessories got an upgrade, with AirTags getting a nice refresh to start 2026.</description>
    </item>
    <item>
      <title>N&#8217;essayez de jouer &#224; 12 &#224; Animal Crossing New Horizons sur Switch 2 : c&#8217;est un cauchemar</title>
      <link>https://www.frandroid.com/marques/2955329_nessayez-de-jouer-a-12-a-animal-crossing-new-horizons-sur-switch-2-cest-un-cauchemar</link>
      <pubDate>Mon, 26 Jan 2026 14:52:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2955329_nessayez-de-jouer-a-12-a-animal-crossing-new-horizons-sur-switch-2-cest-un-cauchemar</guid>
      <description>
Une personne courageuse a voulu tester l'une des nouvelles fonctionnalit&#233;s introduites avec la mise &#224; jour 3.0 d'Animal Crossing New Horizons : accueillir 12 personnes sur son &#238;le.
</description>
    </item>
    <item>
      <title>After 5 Years, Apple Finally Upgrades the AirTag</title>
      <link>https://www.wired.com/story/apple-second-generation-airtag-2026/</link>
      <pubDate>Mon, 26 Jan 2026 14:50:32 +0000</pubDate>
      <guid isPermaLink="false">6977745865684b6a8b3deeeb</guid>
      <description>The second-generation AirTag features Apple&#8217;s newer Ultra Wideband chip and has a louder speaker and better range.</description>
    </item>
    <item>
      <title>What is the release date for The Pitt season 2 episode 4 on HBO Max?</title>
      <link>https://www.techradar.com/streaming/hbo-max/the-pitt-season-2-episode-4-release-date-time</link>
      <pubDate>Mon, 26 Jan 2026 14:47:05 +0000</pubDate>
      <guid isPermaLink="false">HaRvGJRo99WT6vMtcoczZH</guid>
      <description>After a fairly quiet hour of our Fourth of July shift last week, what does The Pitt season 2 episode 4 have in store &#8211; and when does it drop on HBO Max?</description>
    </item>
    <item>
      <title>Apple&#8217;s new AirTag is louder and can be found across longer distances</title>
      <link>https://techcrunch.com/2026/01/26/apples-new-airtag-is-louder-and-can-be-found-across-longer-distances/</link>
      <pubDate>Mon, 26 Jan 2026 14:46:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3085962</guid>
      <description>Apple's new AirTag is louder and supports better finding at longer distances.</description>
    </item>
    <item>
      <title>'After years of waiting, iPhone users deserve nothing less': 5 things Gemini-powered Siri needs to do to save Apple from AI irrelevance</title>
      <link>https://www.techradar.com/ai-platforms-assistants/apple-intelligence/after-years-of-waiting-iphone-users-deserve-nothing-less-5-things-gemini-powered-siri-needs-to-do-to-save-apple-from-ai-irrelevance</link>
      <pubDate>Mon, 26 Jan 2026 14:45:12 +0000</pubDate>
      <guid isPermaLink="false">UiJzyJAZbymkF9VrJKNKtL</guid>
      <description>Siri has been the iPhone&#8217;s biggest frustration for years, but a massive new partnership between Apple and Google is about to change that.</description>
    </item>
    <item>
      <title>This screenless &#8216;Thought Catcher&#8217; uses a Raspberry Pi and Notion to capture your flashes of inspiration &#8211; and it&#8217;s an AI gadget I actually want</title>
      <link>https://www.techradar.com/phones/this-screenless-thought-catcher-uses-a-raspberry-pi-and-notion-to-capture-your-flashes-of-inspiration-and-its-an-ai-gadget-i-actually-want</link>
      <pubDate>Mon, 26 Jan 2026 14:42:52 +0000</pubDate>
      <guid isPermaLink="false">Z5jXzMJcDB5LAxhYsQJ6hd</guid>
      <description>The 'Thought Catcher' could replace your phone on your bedside table, leading to fewer distractions keeping you awake.</description>
    </item>
  </channel>
</rss>
