<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 21 Jan 2026 10:34:56 GMT</lastBuildDate>
    <item>
      <title>Document Disclosures Reveal Microsoft&#8217;s Influence as OpenAI Became a Revenue-Crazed Behemoth</title>
      <link>https://gizmodo.com/document-disclosures-reveal-microsofts-influence-as-openai-became-a-revenue-crazed-behemoth-2000712308</link>
      <pubDate>Wed, 21 Jan 2026 10:30:23 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000712308</guid>
      <description>A peek inside OpenAI as it changed from do-gooder computer lab to...whatever it is now.</description>
    </item>
    <item>
      <title>Meta Seeks to Bar Mentions of Mental Health&#8212;and Zuckerberg&#8217;s Harvard Past&#8212;From Child Safety Trial</title>
      <link>https://www.wired.com/story/meta-child-safety-trial-ask-judge-bar-mental-health-harvard/</link>
      <pubDate>Wed, 21 Jan 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">695ff61d1a2c4556c7acb2af</guid>
      <description>The trial starts soon in New Mexico&#8217;s case against Meta&#8212;and the company is pulling out all the stops to protect its reputation.</description>
    </item>
    <item>
      <title>50&#160;000 sites web en danger&#160;: une faille d&#8217;un plugin WordPress populaire a &#233;t&#233; d&#233;couverte</title>
      <link>https://www.01net.com/actualites/50-000-sites-web-danger-faille-plugin-wordpress-populaire-decouverte.html</link>
      <pubDate>Wed, 21 Jan 2026 10:28:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321461</guid>
      <description>Une faille critique a &#233;t&#233; d&#233;busqu&#233;e dans un plugin Wordpress install&#233; sur 100 000 sites web. Elle permet &#224; un pirate de se cr&#233;er un compte administrateur sur le site et d&#8217;en prendre le contr&#244;le total. La moiti&#233; des sites sont toujours vuln&#233;rables, bien qu'une mise &#224; jour a &#233;t&#233; d&#233;ploy&#233;e.</description>
    </item>
    <item>
      <title>The Brave and the Bold's writer has seemingly been named &#8212; and Batman fans aren't pleased with who's been picked to pen the DCU movie</title>
      <link>https://www.techradar.com/streaming/entertainment/the-brave-and-the-bolds-writer-has-seemingly-been-named-and-batman-fans-arent-pleased-with-whos-been-picked-to-pen-the-dcu-movie</link>
      <pubDate>Wed, 21 Jan 2026 10:26:58 +0000</pubDate>
      <guid isPermaLink="false">g3yUBHm5y523gviTQ8Ecq6</guid>
      <description>The DCU Batman film's writer has reportedly been revealed &#8212; and it's the same person who penned box office bomb The Flash.</description>
    </item>
    <item>
      <title>Formovie Xming Page Two : un vid&#233;oprojecteur LCD compact certifi&#233; Netflix et Google TV</title>
      <link>https://www.frandroid.com/marques/formovie/2950091_formovie-xming-page-two-un-videoprojecteur-lcd-compact-certifie-netflix-et-google-tv</link>
      <pubDate>Wed, 21 Jan 2026 10:26:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/formovie/2950091_formovie-xming-page-two-un-videoprojecteur-lcd-compact-certifie-netflix-et-google-tv</guid>
      <description>
Formovie &#233;largit sa gamme de vid&#233;oprojecteurs portables avec le Xming Page Two, un mod&#232;le Full HD &#224; technologie LCD int&#233;grant Google TV et une certification Netflix.
</description>
    </item>
    <item>
      <title>&#171; Le rythme de production initial sera atrocement lent &#187; : l&#8217;aveu d&#8217;Elon Musk sur la nouvelle Tesla</title>
      <link>https://www.frandroid.com/marques/tesla/2949809_le-rythme-de-production-initial-sera-atrocement-lent-laveu-delon-musk-sur-la-nouvelle-tesla</link>
      <pubDate>Wed, 21 Jan 2026 10:25:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2949809_le-rythme-de-production-initial-sera-atrocement-lent-laveu-delon-musk-sur-la-nouvelle-tesla</guid>
      <description>
D&#233;voil&#233; en 2024, le Tesla Cybercab nous donne de ses nouvelles. D'apr&#232;s Elon Musk, la voiture &#233;lectrique autonome du constructeur devrait mettre un peu de temps &#224; acc&#233;l&#233;rer sa cadence de production. Et voici la raison.
</description>
    </item>
    <item>
      <title>ChatGPT is using age prediction to restrict what minors see</title>
      <link>https://www.theverge.com/news/864784/openai-chatgpt-age-prediction-restrictions-rollout</link>
      <pubDate>2026-01-21T05:23:14-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=864784</guid>
      <description>OpenAI has added age prediction features to ChatGPT, meant to identify and bolster protections for underage users. These age detection plans were announced in December alongside updated guidelines for interacting with teens, and follow a rise in similar age-gating efforts from online platforms, including Instagram, YouTube, TikTok, and Roblox. ChatGPT's age prediction model works by [&#8230;]...</description>
    </item>
    <item>
      <title>CEOs want to spend more on AI - but they aren't seeing any big returns just yet</title>
      <link>https://www.techradar.com/pro/ceos-want-to-spend-more-on-ai-but-they-arent-seeing-any-big-returns-just-yet</link>
      <pubDate>Wed, 21 Jan 2026 10:22:39 +0000</pubDate>
      <guid isPermaLink="false">NprKKAKtMpkBJGgNWZWejL</guid>
      <description>Revenue growth is still pretty low, but businesses continue to invest in AI and explore next-gen agentic models.</description>
    </item>
    <item>
      <title>New Arc Raiders update appears to address some notorious out-of-bounds glitches, but players aren't convinced</title>
      <link>https://www.techradar.com/gaming/new-arc-raiders-update-appears-to-address-some-notorious-out-of-bounds-glitches-but-players-arent-convinced</link>
      <pubDate>Wed, 21 Jan 2026 10:22:05 +0000</pubDate>
      <guid isPermaLink="false">6Vm5h9qncFFA5SenPzUT2f</guid>
      <description>Arc Raiders' Stella Montis map still seems to be overrun with cheaters despite a new patch trying to address exactly that.</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver : la 3e d&#233;marque d&#233;marre fort, voici les offres qui m&#233;ritent votre argent</title>
      <link>https://www.frandroid.com/bons-plans/2949895_soldes-dhiver-3e-demarque-meilleures-offres-en-direct</link>
      <pubDate>Wed, 21 Jan 2026 10:18:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2949895_soldes-dhiver-3e-demarque-meilleures-offres-en-direct</guid>
      <description>
Cela fait d&#233;j&#224; deux semaines que les soldes d'hiver ont commenc&#233; en France et que les e-commer&#231;ants tels qu'Amazon, Fnac, Darty, Boulanger ou encore Cdiscount partagent des offres. Aujourd'hui, c'est la 3e d&#233;marque et les promotions se multiplient. 
</description>
    </item>
    <item>
      <title>In a move absolutely no one saw coming, The Office could be added to Fortnite soon &#8211; here&#8217;s what we know about the teaser so far</title>
      <link>https://www.techradar.com/gaming/in-a-move-absolutely-no-one-saw-coming-the-office-could-be-added-to-fortnite-soon-heres-what-we-know-about-the-teaser-so-far</link>
      <pubDate>Wed, 21 Jan 2026 10:13:18 +0000</pubDate>
      <guid isPermaLink="false">mBjx2vRKFAYU5aXMiSMLXT</guid>
      <description>The next Fortnite crossover seems to be The Office, as Epic Games teases an upcoming tie-in. Here's what we know so far.</description>
    </item>
    <item>
      <title>3 millions d&#8217;euros d&#8217;argent public ont &#233;t&#233; d&#233;tourn&#233;s &#224; cause d&#8217;une n&#233;gligence de cybers&#233;curit&#233;</title>
      <link>https://www.01net.com/actualites/3-millions-euros-argent-public-detournes-cause-negligence-cybersecurite.html</link>
      <pubDate>Wed, 21 Jan 2026 10:03:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321442</guid>
      <description>Un agent municipal a r&#233;ussi &#224; d&#233;tourner plus de trois millions d&#8217;euros en profitant d'un ordinateur laiss&#233; ouvert, et sans surveillance, pendant la pause d&#233;jeuner d'un coll&#232;gue. L'affaire d&#233;montre qu'une simple n&#233;gligence de s&#233;curit&#233; informatique peut avoir de s&#233;rieuses cons&#233;quences...</description>
    </item>
    <item>
      <title>The best robot vacuum for 2026</title>
      <link>https://www.engadget.com/home/smart-home/best-robot-vacuums-130010426.html?src=rss</link>
      <pubDate>Wed, 21 Jan 2026 10:02:26 +0000</pubDate>
      <guid isPermaLink="false">34d85207-dd69-4011-9786-cd94e2fbea9d</guid>
      <description>Looking to keep your home clean without having to vacuum and mop every day, pick up dirt, the dinner your child threw on the floor or your furry friend&#8217;s endless pet hair? Join the club. Smart home gadgets have come a long way over the years, and that includes robot vacuums. With newer technology including voice controls, object detection and more automation features, investing in a robot vacuum cleaner makes more sense now than ever before. Some of the best robot vacuum cleaners even have mopping capabilities, roller brush options and self-emptying bases, too, and there are plenty that don't ...</description>
    </item>
    <item>
      <title>Trump Family Makes $1.4 Billion Off Crypto in 2025, Offsetting Losses Elsewhere</title>
      <link>https://gizmodo.com/trump-family-makes-1-4-billion-off-crypto-in-2025-offsetting-losses-elsewhere-2000711770</link>
      <pubDate>Wed, 21 Jan 2026 10:00:44 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000711770</guid>
      <description>Crypto is now said to account for roughly 20% of the family&#8217;s $6.8 billion fortune.</description>
    </item>
    <item>
      <title>The AI Boom Will Increase US Carbon Emissions&#8212;but It Doesn&#8217;t Have To</title>
      <link>https://www.wired.com/story/the-ai-boom-will-increase-us-carbon-emissions-but-it-doesnt-have-to/</link>
      <pubDate>Wed, 21 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">696a5bca21fa35fbff688f13</guid>
      <description>A new analysis finds that data centers&#8217; energy demands will drastically increase power plant emissions over the next decade. Renewables, though, could cut them while helping keep prices from rising.</description>
    </item>
    <item>
      <title>Ces 24 disques de d&#233;bris qui r&#233;v&#232;lent un cha&#238;non manquant de la formation des plan&#232;tes</title>
      <link>https://www.futura-sciences.com/sciences/actualites/formation-planetes-ces-24-disques-debris-revelent-chainon-manquant-formation-planetes-130362/#xtor%3DRSS-8</link>
      <pubDate>Wed, 21 Jan 2026 10:57:57 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/formation-planetes-ces-24-disques-debris-revelent-chainon-manquant-formation-planetes-130362/#xtor%3DRSS-8</guid>
      <description>Des astronomes ont capt&#233; des syst&#232;mes plan&#233;taires &#224; un stade rarement vu de leur d&#233;veloppement. Extr&#234;mement jeunes, il s'agit de disques de d&#233;bris constitu&#233;s de poussi&#232;re qui repr&#233;sentent une &#233;tape capitale et encore mal connue dans la formation des plan&#232;tes.</description>
    </item>
    <item>
      <title>Ne jetez pas vos vieilles enceintes Marshall : ce nouveau produit leur offre le streaming et vient concurrencer Sonos</title>
      <link>https://www.frandroid.com/marques/marshall/2949975_ne-jetez-pas-vos-vieilles-enceintes-marshall-ce-nouveau-produit-leur-offre-le-streaming-et-vient-concurrencer-sonos</link>
      <pubDate>Wed, 21 Jan 2026 09:54:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/marshall/2949975_ne-jetez-pas-vos-vieilles-enceintes-marshall-ce-nouveau-produit-leur-offre-le-streaming-et-vient-concurrencer-sonos</guid>
      <description>
Avec Heddon, Marshall pr&#233;sente un hub de streaming musical d&#233;di&#233;, capable de diffuser un son coh&#233;rent dans plusieurs pi&#232;ces via le Wi-Fi et Auracast, tout en r&#233;introduisant le vinyle au centre d&#8217;un syst&#232;me audio domestique connect&#233;.
</description>
    </item>
    <item>
      <title>D&#233;fauts techniques et commandes annul&#233;es : la gal&#232;re des batteries fran&#231;aises d&#8217;ACC se poursuit</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2949761_defauts-techniques-et-commandes-annulees-la-galere-des-batteries-francaises-dacc-se-poursuit</link>
      <pubDate>Wed, 21 Jan 2026 09:52:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2949761_defauts-techniques-et-commandes-annulees-la-galere-des-batteries-francaises-dacc-se-poursuit</guid>
      <description>
Fond&#233;e en 2020, la firme tricolore ACC commence tout doucement &#224; monter en rythme. Tout est cependant loin d'&#234;tre r&#233;gl&#233; pour ses batteries pour voitures &#233;lectriques, qui rencontrent encore de nombreuses difficult&#233;s.
</description>
    </item>
    <item>
      <title>&#171;&#160;C&#8217;est faux&#160;&#187; : OnePlus d&#233;ment son d&#233;mant&#232;lement, mais le doute persiste</title>
      <link>https://www.01net.com/actualites/cest-faux-oneplus-dement-son-demantelement-mais-le-doute-persiste.html</link>
      <pubDate>Wed, 21 Jan 2026 09:48:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321432</guid>
      <description>Face &#224; la temp&#234;te m&#233;diatique annon&#231;ant sa disparition programm&#233;e, OnePlus r&#233;agit. La direction qualifie les rumeurs de &#171; fausses &#187;, mais le silence des branches am&#233;ricaine et europ&#233;enne laisse encore planer le doute.</description>
    </item>
    <item>
      <title>MacBook Pro M5 Max : pourquoi les chiffres alarmants de l&#8217;actuelle puce M4 Max font craindre la surchauffe</title>
      <link>https://www.frandroid.com/marques/apple/2949713_macbook-pro-m5-max-pourquoi-les-chiffres-alarmants-de-lactuelle-puce-m4-max-font-craindre-la-surchauffe</link>
      <pubDate>Wed, 21 Jan 2026 09:43:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2949713_macbook-pro-m5-max-pourquoi-les-chiffres-alarmants-de-lactuelle-puce-m4-max-font-craindre-la-surchauffe</guid>
      <description>
Un redditeur a mis en &#233;vidence quelques-unes des sorties de piste pr&#233;occupantes de sa puce M4 Max en termes de ma&#238;trise &#233;nerg&#233;tique, d&#233;montrant que derri&#232;re la sobri&#233;t&#233; habituelle des solutions d'Apple, des flamb&#233;es de consommation spectaculaires sont tout de m&#234;me &#224; pointer du doigt. 
</description>
    </item>
    <item>
      <title>Just ordered a MacBook Pro M4 Max? You might face a long wait to get it &#8212; but it's not because of the RAM crisis</title>
      <link>https://www.techradar.com/computing/macbooks/apple-macbook-pro-m4-max-buyers-beware-you-might-face-huge-delays-getting-your-laptop-but-its-not-because-of-the-ram-crisis</link>
      <pubDate>Wed, 21 Jan 2026 09:37:04 +0000</pubDate>
      <guid isPermaLink="false">aQ92J8htpEq3UMBrYKgQhh</guid>
      <description>Apple is expected to announce its M5 Pro and M5 Max chips at some point &#8211; and it could be sooner than we thought.</description>
    </item>
    <item>
      <title>Adieu la panne de batterie ? Le Motorola Edge 70 Fusion mise tout sur l&#8217;autonomie</title>
      <link>https://www.frandroid.com/marques/motorola/2949829_adieu-la-panne-de-batterie-le-motorola-edge-70-fusion-mise-tout-sur-lautonomie</link>
      <pubDate>Wed, 21 Jan 2026 09:36:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/motorola/2949829_adieu-la-panne-de-batterie-le-motorola-edge-70-fusion-mise-tout-sur-lautonomie</guid>
      <description>
Le Motorola Edge 70 Fusion se d&#233;voile avant l'heure avec une grosse batterie et un accent mis sur la robustesse.
</description>
    </item>
    <item>
      <title>Marathon : excellente nouvelle pour votre PC, le nouveau jeu de Bungie tournera sur des GPU vieux de 10 ans</title>
      <link>https://www.frandroid.com/produits-android/console/2949795_marathon-excellente-nouvelle-pour-votre-pc-le-nouveau-jeu-de-bungie-tournera-sur-des-gpu-vieux-de-10-ans</link>
      <pubDate>Wed, 21 Jan 2026 09:35:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2949795_marathon-excellente-nouvelle-pour-votre-pc-le-nouveau-jeu-de-bungie-tournera-sur-des-gpu-vieux-de-10-ans</guid>
      <description>
Marathon, le nouveau FPS des cr&#233;ateurs de Halo et Destiny, se relance le 5 mars prochain. Le studio a d&#233;voil&#233; les configurations recommand&#233;es de ce nouvel extraction shooter, une excellente nouvelle pour de nombreux joueurs PC.
</description>
    </item>
    <item>
      <title>Amazon profite de la 3e d&#233;marque des soldes pour d&#233;stocker &#224; petit prix de nombreux produits Tech</title>
      <link>https://www.frandroid.com/bons-plans/2933045_amazon-profite-de-la-3e-demarque-des-soldes-pour-destocker-a-petit-prix-de-nombreux-produits-tech</link>
      <pubDate>Wed, 21 Jan 2026 09:35:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933045_amazon-profite-de-la-3e-demarque-des-soldes-pour-destocker-a-petit-prix-de-nombreux-produits-tech</guid>
      <description>
Le top d&#233;part de la 3&#7497; d&#233;marque est lanc&#233; ! Les soldes d&#8217;hiver se poursuivent avec des offres toujours aussi attractives chez Amazon, accessibles &#224; tous, m&#234;me sans abonnement Prime. Mieux encore, certains produits Tech r&#233;cents voient leurs prix chuter &#224; cette occasion &#8212; &#224; l&#8217;image du tout nouveau OnePlus&#8201;15, d&#233;j&#224; affich&#233; &#224; prix r&#233;duit.
</description>
    </item>
    <item>
      <title>ChatGPT pr&#233;dit d&#233;sormais l&#8217;&#226;ge des utilisateurs pour identifier les mineurs</title>
      <link>https://www.01net.com/actualites/chatgpt-predit-desormais-age-utilisateurs-identifier-mineurs.html</link>
      <pubDate>Wed, 21 Jan 2026 09:31:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321417</guid>
      <description>ChatGPT se met d&#233;sormais &#224; pr&#233;dire l'&#226;ge de ses utilisateurs. Pour identifier les adolescents, OpenAI utilise un algorithme qui s'attarde sur les signaux comportementaux laiss&#233;s par les usagers. En cas d'erreur, la start-up r&#233;clame un selfie pour lever les restrictions.</description>
    </item>
    <item>
      <title>Lenovo Legion Go S : cette excellente console portable PC revient &#224; un super prix pour les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2723773_lenovo-legion-go-s-cette-excellente-console-portable-pc-revient-a-un-super-prix-pour-les-soldes</link>
      <pubDate>Wed, 21 Jan 2026 09:20:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2723773_lenovo-legion-go-s-cette-excellente-console-portable-pc-revient-a-un-super-prix-pour-les-soldes</guid>
      <description>
Le prix de la Lenovo Legion Go S baisse une nouvelle fois gr&#226;ce aux promotions de la 3e d&#233;marque des soldes d'hiver : 449,99 euros au lieu de 629,99 euros. 
</description>
    </item>
    <item>
      <title>Faillite d&#8217;un pionnier : &#171; Je ne vois pas comment l&#8217;hydrog&#232;ne pourrait concurrencer les v&#233;hicules &#233;lectriques &#187;</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/voiture-hydrogene/2949745_faillite-dun-pionnier-je-ne-vois-pas-comment-lhydrogene-pourrait-concurrencer-les-vehicules-electriques</link>
      <pubDate>Wed, 21 Jan 2026 09:16:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/voiture-hydrogene/2949745_faillite-dun-pionnier-je-ne-vois-pas-comment-lhydrogene-pourrait-concurrencer-les-vehicules-electriques</guid>
      <description>
Sp&#233;cialis&#233;e dans le d&#233;ploiement de stations de ravitaillement en hydrog&#232;ne, la firme norv&#233;gienne Hynion vient de d&#233;poser le bilan. La faute, selon elle, &#224; une trop faible demande, tandis que son patron admet plut&#244;t croire &#224; la voiture &#233;lectrique.
</description>
    </item>
    <item>
      <title>Huawei WiFi Mesh X3 Pro&#160;: le routeur Wi-Fi 7 qu&#8217;on n&#8217;a plus besoin de cacher</title>
      <link>https://www.01net.com/actualites/huawei-wifi-mesh-x3-pro-le-routeur-wi-fi-7-quon-na-plus-besoin-de-cacher.html</link>
      <pubDate>Wed, 21 Jan 2026 09:03:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321281</guid>
      <description>Huawei profite de son actualit&#233; charg&#233;e pour d&#233;poussi&#233;rer un objet souvent mal-aim&#233; de nos int&#233;rieurs : le routeur Wi-Fi. Avec le WiFi Mesh X3 Pro, le constructeur chinois parie sur la nouvelle norme Wi-Fi 7 et sur un design transparent audacieux pour s'inviter au centre de votre salon.</description>
    </item>
    <item>
      <title>Netflix va radicalement transformer son application, et vous n&#8217;&#234;tes pas pr&#234;t</title>
      <link>https://www.01net.com/actualites/netflix-radicalement-transformer-application-vous-netes-pas-pret.html</link>
      <pubDate>Wed, 21 Jan 2026 09:02:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1321436</guid>
      <description>Pour contrer TikTok et YouTube, Netflix a de grands plans pour son application mobile en 2026. Un virage strat&#233;gique qui ne va s&#251;rement pas plaire &#224; tous les utilisateurs.</description>
    </item>
    <item>
      <title>India vs New Zealand T20I Series Live Streams: TV Channels, Schedule and Squads</title>
      <link>https://www.techradar.com/how-to-watch/cricket/india-vs-new-zealand-t20i-series</link>
      <pubDate>Wed, 21 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">zuCFNth4L2sAKH7PE3gzj8</guid>
      <description>All the ways to watch the India vs New Zealand T20I series from anywhere in the world as the world's top two men's 20-over side clash in the sub-continent.</description>
    </item>
    <item>
      <title>Inconnue il y a 5 ans, la batterie sans nickel inonde le march&#233; et c&#8217;est une bonne nouvelle pour vous</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2949715_inconnue-il-y-a-5-ans-la-batterie-sans-nickel-inonde-le-marche-et-cest-une-bonne-nouvelle-pour-vous</link>
      <pubDate>Wed, 21 Jan 2026 08:58:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2949715_inconnue-il-y-a-5-ans-la-batterie-sans-nickel-inonde-le-marche-et-cest-une-bonne-nouvelle-pour-vous</guid>
      <description>
Selon une r&#233;cente &#233;tude, les batteries LFP sont d&#233;sormais les plus pr&#233;sentes sur les voitures &#233;lectriques dans le monde, alors qu'elles &#233;taient quasiment inconnues il y a cinq ans. C&#8217;est le cas en Chine, mais &#233;galement en Europe. Et voici pourquoi.
</description>
    </item>
    <item>
      <title>Google Maps va am&#233;liorer sa prise en charge des transports en commun</title>
      <link>https://www.frandroid.com/marques/google/2949747_google-maps-va-ameliorer-sa-prise-en-charge-des-transports-en-commun</link>
      <pubDate>Wed, 21 Jan 2026 08:53:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2949747_google-maps-va-ameliorer-sa-prise-en-charge-des-transports-en-commun</guid>
      <description>
D&#233;j&#224; tr&#232;s solide pour la navigation en voiture, Google Maps pr&#233;pare une grosse mise &#224; jour pour faciliter la vie de celles et ceux qui prennent les transports en commun.
</description>
    </item>
    <item>
      <title>Le Honor Magic 8 Lite devient notre r&#233;f&#233;rence du guide d&#8217;achat des smartphones &#224; la meilleure autonomie</title>
      <link>https://www.frandroid.com/produits-android/2949395_le-honor-magic-8-lite-devient-notre-reference-du-guide-dachat-des-smartphones-a-la-meilleure-autonomie</link>
      <pubDate>Wed, 21 Jan 2026 08:39:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2949395_le-honor-magic-8-lite-devient-notre-reference-du-guide-dachat-des-smartphones-a-la-meilleure-autonomie</guid>
      <description>
Le Honor Magic 8 Lite int&#232;gre notre s&#233;lection des smartphones avec la meilleure autonomie en 2026. Ce mod&#232;le milieu de gamme se distingue par sa capacit&#233; &#224; tenir trois journ&#233;es compl&#232;tes sans recharge.
</description>
    </item>
  </channel>
</rss>
