<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 07 Jan 2026 13:43:07 GMT</lastBuildDate>
    <item>
      <title>Lego Smart Play hands-on: Using technology to get kids to play together</title>
      <link>https://www.engadget.com/entertainment/lego-smart-play-hands-on-using-technology-to-get-kids-to-play-together-133000436.html?src=rss</link>
      <pubDate>Wed, 07 Jan 2026 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">27c066b4-5f4b-4b62-9099-8412c652c6c9</guid>
      <description>Lego&#8217;s new Smart Play system, announced at CES earlier this week, is an embrace of digital technology the likes of which we haven&#8217;t seen from the company before. And while the demonstration it gave on Monday was a good start towards showing just what Lego&#8217;s Smart Brick is capable of, there&#8217;s no substitute for seeing it in person. Fortunately, an extended demo answered a lot of my questions on how the system will work once kids and adults get their hands on the first round of sets with Smart Play.As I detailed yesterday, the Smart Play system contains three elements. The Smart Brick is packed w...</description>
    </item>
    <item>
      <title>Maybe We Should Pump the Brakes on the Idea That Robotaxis Are Safer</title>
      <link>https://gizmodo.com/maybe-we-should-pump-the-brakes-on-the-idea-that-robotaxis-are-safer-2000706339</link>
      <pubDate>Wed, 07 Jan 2026 13:27:01 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000706339</guid>
      <description>The evidence is sparse.</description>
    </item>
    <item>
      <title>Black Ops 7 Season One Reloaded brings some beautiful new maps to the game &#8212; here are its official release times</title>
      <link>https://www.techradar.com/gaming/black-ops-7-season-one-reloaded-brings-some-beautiful-new-maps-to-the-game-here-are-its-official-release-times</link>
      <pubDate>Wed, 07 Jan 2026 13:22:36 +0000</pubDate>
      <guid isPermaLink="false">6DYxagUod4TPRLruCLmWyk</guid>
      <description>Call of Duty: Black Ops 7 Season One Reloaded is almost here, so here are the official release times and some of its biggest inclusions.</description>
    </item>
    <item>
      <title>Honor ne savait pas qui copier entre Apple et Google, alors ils ont fait les deux et c&#8217;est pas mal</title>
      <link>https://www.frandroid.com/marques/honor/2933419_honor-ne-savait-pas-qui-copier-entre-apple-et-google-alors-ils-ont-fait-les-deux-et-cest-pas-mal</link>
      <pubDate>Wed, 07 Jan 2026 13:19:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/honor/2933419_honor-ne-savait-pas-qui-copier-entre-apple-et-google-alors-ils-ont-fait-les-deux-et-cest-pas-mal</guid>
      <description>
C'est un m&#233;lange bizarre entre un Google Pixel et un iPhone Air. Mais ne vous arr&#234;tez pas au design. Le Honor Magic 8 Air affiche une fiche technique int&#233;ressante pour un format "Slim". Avec ses 158 grammes et sa puce haut de gamme, Honor semble avoir trouv&#233; la formule magique que Apple cherche encore.
</description>
    </item>
    <item>
      <title>Votre MacBook devient enfin tactile : cet accessoire g&#233;nial devance Apple de quasiment un an</title>
      <link>https://www.frandroid.com/marques/apple/2932901_transformer-son-mac-en-ipad-geant-cest-possible-avec-cet-accessoire</link>
      <pubDate>Wed, 07 Jan 2026 13:17:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2932901_transformer-son-mac-en-ipad-geant-cest-possible-avec-cet-accessoire</guid>
      <description>
Transformer son MacBook en &#233;cran tactile, c'est bient&#244;t possible avec l'accessoire Magic Screen. Bient&#244;t lanc&#233; sur Kickstarter, le produit d&#233;bloque de nouvelles utilisations dignes d'un iPad sur l'&#233;cran de votre MacBook.
</description>
    </item>
    <item>
      <title>Les plus grosses nouveaut&#233;s &#233;lectriques du CES 2026 sont &#224; d&#233;couvrir dans notre &#233;mission Survolt&#233;s du jour : il va y en avoir pour tout le monde</title>
      <link>https://www.frandroid.com/survoltes/2932709_les-plus-grosses-nouveautes-electriques-du-ces-2026-sont-a-decouvrir-dans-notre-emission-survoltes-du-jour-il-va-y-en-avoir-pour-tout-le-monde</link>
      <pubDate>Wed, 07 Jan 2026 13:17:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2932709_les-plus-grosses-nouveautes-electriques-du-ces-2026-sont-a-decouvrir-dans-notre-emission-survoltes-du-jour-il-va-y-en-avoir-pour-tout-le-monde</guid>
      <description>
L&#8217;&#233;quipe Survolt&#233;s (Frandroid) et Vroom (Numerama) vous donnent rendez-vous ce mercredi 7 janvier, d&#232;s 18h, pour une &#233;mission sp&#233;ciale CES 2026. Au menu du jour : des nouveaut&#233;s &#233;lectriques tr&#232;s excitantes et un duplex en direct de Las Vegas.
</description>
    </item>
    <item>
      <title>Everything announced at CES 2026</title>
      <link>https://www.engadget.com/general/everything-announced-at-ces-2026-130124802.html?src=rss</link>
      <pubDate>Wed, 07 Jan 2026 13:15:46 +0000</pubDate>
      <guid isPermaLink="false">fd3b4bbf-1b78-4e34-9914-70a2e6f85389</guid>
      <description>It's the first week of a new year and there's no time for the tech world to slowly ease back into things following the holidays. That's because CES 2026 is in full swing, with all manner of companies descending on Las Vegas to reveal their latest innovations and what they're planning to bring your way in the near future.&#160;Many of the Engadget crew are on the ground to check out as much of the new tech as possible. Of course, we're keeping tabs on all of the major CES press conferences too. Samsung held its First Look presentation, which focuses on home products, while LG has shown off a wide ar...</description>
    </item>
    <item>
      <title>The best tech announced at CES 2026 so far</title>
      <link>https://www.theverge.com/tech/854159/ces-2026-best-tech-gadgets-smartphones-appliances-robots-tvs-ai-smart-home</link>
      <pubDate>2026-01-07T08:13:25-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=854159</guid>
      <description>The CES show floor officially opened its doors yesterday and along with it came a deluge of more announcements and reveals. If you're struggling to stay on top of all the new tech, gadgets, concepts, and AI-powered devices as day two gets underway, we've rounded up some of the best hardware and upgrades that have [&#8230;]</description>
    </item>
    <item>
      <title>Oubliez le Wi-Fi 7&#160;: le Wi-Fi 8 s&#8217;invite par surprise au CES 2026</title>
      <link>https://www.01net.com/actualites/oubliez-le-wi-fi-7-le-wi-fi-8-sinvite-par-surprise-au-ces-2026.html</link>
      <pubDate>Wed, 07 Jan 2026 13:12:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318568</guid>
      <description>Le CES 2026 cr&#233;e la surprise : alors que le Wi-Fi 7 s'installe &#224; peine, le Wi-Fi 8 d&#233;barque d&#233;j&#224;. Asus et MediaTek d&#233;voilent les premiers routeurs, mais vous encore le temps avant de vous &#233;quiper.</description>
    </item>
    <item>
      <title>La fin du double &#233;cran ? Ce PC portable Lenovo cache une fonctionnalit&#233; g&#233;niale</title>
      <link>https://www.frandroid.com/marques/lenovo/2932653_on-a-vu-lecran-de-ce-pc-portable-sagrandir-tout-seul-voici-le-nouveau-concept-bluffant-de-lenovo</link>
      <pubDate>Wed, 07 Jan 2026 13:04:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lenovo/2932653_on-a-vu-lecran-de-ce-pc-portable-sagrandir-tout-seul-voici-le-nouveau-concept-bluffant-de-lenovo</guid>
      <description>
Lors du CES 2026 de Las Vegas, Lenovo a d&#233;voil&#233; le Legion Pro Rollable Concept, un PC portable dont l'&#233;cran peut s'&#233;tirer physiquement pour atteindre une diagonale de 24 pouces. 
</description>
    </item>
    <item>
      <title>Your Ring doorbell and cameras are getting a huge upgrade with AI-powered warnings when something looks unusual</title>
      <link>https://www.techradar.com/tech-events/your-ring-doorbell-and-cameras-are-getting-a-huge-upgrade-with-ai-powered-warnings-when-something-looks-unusual</link>
      <pubDate>Wed, 07 Jan 2026 13:02:45 +0000</pubDate>
      <guid isPermaLink="false">4FHSrBACkwjAXELeiB8AjE</guid>
      <description>Ring launches new AI alerts, plus a collection of sensors to detect break-ins, floods, carbon monoxide, and much more.</description>
    </item>
    <item>
      <title>Je n&#8217;ai aucun style, mais je porte des lunettes de natation connect&#233;es</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/lunettes-intelligentes/2932401_je-nai-aucun-style-mais-je-porte-des-lunettes-de-natation-connectees</link>
      <pubDate>Wed, 07 Jan 2026 13:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/lunettes-intelligentes/2932401_je-nai-aucun-style-mais-je-porte-des-lunettes-de-natation-connectees</guid>
      <description>
J'ignorais totalement qu'il existait des lunettes de piscine connect&#233;es, puis j'ai d&#233;couvert les Holoswim 2 Pro.
</description>
    </item>
    <item>
      <title>What is the release date for Spartacus: House of Ashur episode 7 on Starz?</title>
      <link>https://www.techradar.com/streaming/entertainment/spartacus-house-of-ashur-episode-7-release-date-time-starz</link>
      <pubDate>Wed, 07 Jan 2026 13:01:53 +0000</pubDate>
      <guid isPermaLink="false">jBLDmhRkoqNrTDemMrkXLY</guid>
      <description>With Opiter's shock death at the end of episode 6, all hell is about to break loose. But when does Spartacus: House of Ashur episode 7 drop on Starz?</description>
    </item>
    <item>
      <title>Mia Goth Declares &#8216;The Odyssey&#8217; Better Than &#8216;Star Wars,&#8217; Sorta</title>
      <link>https://gizmodo.com/mia-goth-the-odyssey-star-wars-2000706501</link>
      <pubDate>Wed, 07 Jan 2026 13:00:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000706501</guid>
      <description>The 'Pearl' and 'Frankenstein' star has slightly different levels of compliments for both upcoming films.</description>
    </item>
    <item>
      <title>Don&#8217;t like Spotify Messages? These two big upgrades could soon change your mind</title>
      <link>https://www.techradar.com/audio/spotify/dont-like-spotify-messages-these-two-big-upgrades-could-soon-change-your-mind</link>
      <pubDate>Wed, 07 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">HTjpGHdhxd9mWmQUw9viiU</guid>
      <description>You can now see your friends' listening activity in real time, and send Jam requests with Spotify Messages.</description>
    </item>
    <item>
      <title>Klipsch Atlas HP-1 hands-on: A return to hi-fi headphones at CES 2026</title>
      <link>https://www.engadget.com/audio/headphones/klipsch-atlas-hp-1-hands-on-a-return-to-hi-fi-headphones-at-ces-2026-130000415.html?src=rss</link>
      <pubDate>Wed, 07 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">b12f6ceb-4be5-4f5f-9b8c-8f655579a77d</guid>
      <description>Klipsch hasn&#8217;t debuted new headphones in years, but that&#8217;s going to change in 2026. At CES, Klipsch announced the upcoming Atlas hi-fi series that includes wireless and both closed and semi-open back models. All three are expected to arrive this summer, but the company hasn&#8217;t announced pricing or many details on any of them just yet. However, I was able to listen to the Atlas HP-1, the wireless model with active noise cancelation (ANC). Without going into specifics, Klipsch says the HP-1 is designed for both daily wear and travel. This is thanks to the combination of light weight, comfort and ...</description>
    </item>
    <item>
      <title>Vie num&#233;rique | Comment prot&#233;ger son t&#233;l&#233;phone des douaniers am&#233;ricains</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-01-07/vie-numerique/comment-proteger-son-telephone-des-douaniers-americains.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 07 Jan 2026 08:00:00 -0500</pubDate>
      <guid isPermaLink="false">557c9af7eb7d3008b2294d146c131f27</guid>
      <description>En mars dernier, lorsque la douane am&#233;ricaine a refoul&#233; un scientifique fran&#231;ais apr&#232;s avoir fouill&#233; son t&#233;l&#233;phone, les autorit&#233;s fran&#231;aises ont cri&#233; au scandale&#160;: des commentaires critiquant les politiques de Donald Trump, lus dans son t&#233;l&#233;phone, avaient motiv&#233; cette d&#233;cision, a d&#233;nonc&#233; Paris. Des responsables am&#233;ricains ont ni&#233; cette interpr&#233;tation, mais depuis, bien des voyageurs se demandent si ces fouilles sont l&#233;gales....</description>
    </item>
    <item>
      <title>Roblox, Call of Duty, and Fortnite head up last year's most played games &#8212; and yes, that's the same as 2024</title>
      <link>https://www.techradar.com/gaming/gaming-industry/roblox-call-of-duty-and-fortnite-head-up-last-years-most-played-games-and-yes-thats-the-same-as-2024</link>
      <pubDate>Wed, 07 Jan 2026 12:55:56 +0000</pubDate>
      <guid isPermaLink="false">9jEMoZaLSKXbS2NSqrkGym</guid>
      <description>The top five most-played games of 2025 absolutely will not shock you, with usual suspects GTA, Fortnite, and Roblox heading up the list.</description>
    </item>
    <item>
      <title>The Magic: The Gathering Tarkir Dragonstorm Booster Box is below market value at Amazon</title>
      <link>https://mashable.com/article/jan-7-magic-the-gathering-tarkir-dragonstorm-play-booster-deal</link>
      <pubDate>Wed, 07 Jan 2026 12:55:18 +0000</pubDate>
      <guid isPermaLink="false">02w4vZpHZUhkMf38mhuJJIq</guid>
      <description>The Magic: The Gathering Tarkir Dragonstorm Play Booster Box is on sale for $98.68 at Amazon. That's below market value.</description>
    </item>
    <item>
      <title>Lenovo IdeaPad Pro 5 : taill&#233; pour les cr&#233;atifs, cet ultrabook avec RTX 4050 est 1 000 &#8364; moins cher pendant les soldes d&#8217;hiver (et une carte cadeau est offerte)</title>
      <link>https://www.frandroid.com/bons-plans/2932983_lenovo-ideapad-pro-5-taille-pour-les-creatifs-cet-ultrabook-avec-rtx-4050-est-1-000-e-moins-cher-pendant-les-soldes-dhiver-et-une-carte-cadeau-est-offerte</link>
      <pubDate>Wed, 07 Jan 2026 12:54:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2932983_lenovo-ideapad-pro-5-taille-pour-les-creatifs-cet-ultrabook-avec-rtx-4050-est-1-000-e-moins-cher-pendant-les-soldes-dhiver-et-une-carte-cadeau-est-offerte</guid>
      <description>
Avec son &#233;cran OLED bien fluide et sa carte graphique RTX 4050, le Lenovo IdeaPad Pro 5 est un ultraportable qui peut tout &#224; fait accompagner les cr&#233;ateurs de contenu et les joueurs occasionnels. Pendant les soldes, Darty fait en plus chuter son prix, qui passe de 1 799,99 euros &#224; 779,99 euros.
</description>
    </item>
    <item>
      <title>YouTube Music users are furious about AI slop songs &#8211;and as a recording musician, I'm angry too</title>
      <link>https://www.techradar.com/audio/audio-streaming/youtube-music-users-are-furious-about-ai-slop-songs-and-as-a-recording-musician-im-angry-too</link>
      <pubDate>Wed, 07 Jan 2026 12:46:54 +0000</pubDate>
      <guid isPermaLink="false">zya7d3QF2A4WGefAhPkFb9</guid>
      <description>AI slop isn't made to be listened to: it's there to trick you &#8211; and as a recording musician, I'm angry it's dominating YouTube Music recommendations</description>
    </item>
    <item>
      <title>Google annonce une transformation majeure pour Snapseed sur Android</title>
      <link>https://www.frandroid.com/marques/google/2933139_google-annonce-une-transformation-majeure-pour-snapseed-sur-android</link>
      <pubDate>Wed, 07 Jan 2026 12:41:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2933139_google-annonce-une-transformation-majeure-pour-snapseed-sur-android</guid>
      <description>
L&#8217;application de retouche photo de Google, Snapseed, va profiter d&#8217;une modernisation sur Android plusieurs mois apr&#232;s l&#8217;arriv&#233;e de la version 3.0 sur iPhone.
</description>
    </item>
    <item>
      <title>The weirdest tech we&amp;#8217;ve seen at CES 2026</title>
      <link>https://www.theverge.com/tech/855460/ces-2026-weirdest-announcements</link>
      <pubDate>2026-01-07T07:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=855460</guid>
      <description>There's never a shortage of exciting and innovative tech at CES. A superthin TV and tri-folding phone are cool and all, but sometimes the weirdest gadgets are the ones that make us go "huh." Luckily, there was plenty of wacky stuff on the show floor this year, and we've rounded up some of the most [&#8230;]</description>
    </item>
    <item>
      <title>Ce TV Panasonic dot&#233; d&#8217;une dalle OLED de 55 pouces passe sous les 1 000 euros chez Boulanger pour les soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2933057_ce-tv-panasonic-dote-dune-dalle-oled-de-55-pouces-passe-sous-les-1-000-euros-chez-boulanger-pour-les-soldes-dhiver</link>
      <pubDate>Wed, 07 Jan 2026 12:29:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933057_ce-tv-panasonic-dote-dune-dalle-oled-de-55-pouces-passe-sous-les-1-000-euros-chez-boulanger-pour-les-soldes-dhiver</guid>
      <description>
Entre sa dalle OLED de 55 pouces et son taux de rafra&#238;chissement de 144 Hz, ce Panasonic 55Z90BE6 a &#233;t&#233; pens&#233; pour convenir &#224; tout le monde. Pour les soldes d'hiver, il perd 800 euros chez Boulanger et tombe &#224; 999 euros.
</description>
    </item>
    <item>
      <title>The Lego Botanicals Orchid is one of our favorite sets, and its currently over $10 off at Amazon</title>
      <link>https://mashable.com/article/jan-7-lego-botanicals-orchid-deal</link>
      <pubDate>Wed, 07 Jan 2026 12:28:27 +0000</pubDate>
      <guid isPermaLink="false">03pNvYHjR5a80jOrBMhzIii</guid>
      <description>As of Jan. 7, the Lego Botanicals Orchid is discounted at Amazon to $39.98, 20% off its list price of $49.99.</description>
    </item>
    <item>
      <title>The Pok&#233;mon TCG: Mega Evolution Phantasmal Flames Elite Trainer Box is close to market value at Amazon</title>
      <link>https://mashable.com/article/jan-7-pokemon-tcg-mega-evolution-phantasmal-flames-elite-trainer-box-deal</link>
      <pubDate>Wed, 07 Jan 2026 12:23:42 +0000</pubDate>
      <guid isPermaLink="false">01umR6c36J4CK4ZuL6eFSpA</guid>
      <description>The Pok&#233;mon TCG: Mega Evolution Phantasmal Flames Elite Trainer Box is on sale for $88.30 at Amazon.</description>
    </item>
    <item>
      <title>I love that Lenovo has finally chosen SteamOS for the Legion Go 2, but it's kidding itself with that price tag</title>
      <link>https://www.techradar.com/computing/gaming-pcs/i-love-that-lenovo-has-finally-chosen-steamos-for-the-legion-go-2-but-its-kidding-itself-with-that-price-tag</link>
      <pubDate>Wed, 07 Jan 2026 12:21:27 +0000</pubDate>
      <guid isPermaLink="false">FqZdAfF22XfBRVGqHCkaxj</guid>
      <description>Lenovo, thanks for supporting SteamOS with the Legion Go 2, but the price tag is too extreme, and I don't think most consumers will consider this.</description>
    </item>
    <item>
      <title>I tried Lego Star Wars Smart Play sets at CES &#8212; and the tech fades into the background when play begins</title>
      <link>https://www.techradar.com/streaming/entertainment/i-tried-lego-star-wars-smart-play-sets-at-ces-and-the-tech-fades-into-the-background-when-play-begins</link>
      <pubDate>Wed, 07 Jan 2026 12:18:00 +0000</pubDate>
      <guid isPermaLink="false">zSTh4uZesZAZJEprsvnNGA</guid>
      <description>Lego's Smart Play system is the biggest change to the Lego brick in years, and at CES I went hands-on with the new Star Wars sets arriving in March.</description>
    </item>
    <item>
      <title>The excellent Razer Wolverine V3 Pro is back on sale &#8212; and one is at a lowest-ever price</title>
      <link>https://www.techradar.com/gaming/the-excellent-razer-wolverine-v3-pro-is-back-on-sale-and-one-is-at-a-lowest-ever-price</link>
      <pubDate>Wed, 07 Jan 2026 12:14:11 +0000</pubDate>
      <guid isPermaLink="false">DkuJCKT6mdasktcshQmc4Q</guid>
      <description>Here's some more discounts for the Razer Wolverine V3 Pro &#8212; including a lowest-ever 20% off its white colorway.</description>
    </item>
    <item>
      <title>Logitech caused its mice to freak out by not renewing a certificate</title>
      <link>https://www.theverge.com/news/857377/logitech-macos-logi-options-mouse-certification-fix</link>
      <pubDate>2026-01-07T07:10:34-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=857377</guid>
      <description>If you're among the macOS users experiencing some weird issues with your Logitech mouse, then good news: Logitech has now released a fix. This comes after multiple Reddit users reported yesterday that Logi Options Plus - the app required to manage and configure the controls on Logitech accessories - had stopped working, preventing them from [&#8230;]</description>
    </item>
    <item>
      <title>CES 2026 live updates: See the latest news, surprises, and strange tech from LG, Samsung, Lego, and new startups</title>
      <link>https://mashable.com/live/ces-2026-news-live-updates</link>
      <pubDate>Wed, 07 Jan 2026 12:08:15 +0000</pubDate>
      <guid isPermaLink="false">00HdPGMgSorg1E6HI6usOJ2</guid>
      <description>CES 2026 is finally here, and Mashable reporters are on the ground looking for the best in show. Get live updates from the showroom floor and behind the scenes.</description>
    </item>
    <item>
      <title>En ces soldes d&#8217;hiver, la JBL Boombox 4 &#233;quip&#233;e d&#8217;une autonomie de 34 heures pense &#224; l&#8217;&#233;t&#233; et perd 100 &#8364; chez Boulanger</title>
      <link>https://www.frandroid.com/bons-plans/2932647_en-ces-soldes-dhiver-la-jbl-boombox-4-equipee-dune-autonomie-de-34-heures-pense-a-lete-et-perd-100-e-chez-boulanger</link>
      <pubDate>Wed, 07 Jan 2026 12:08:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2932647_en-ces-soldes-dhiver-la-jbl-boombox-4-equipee-dune-autonomie-de-34-heures-pense-a-lete-et-perd-100-e-chez-boulanger</guid>
      <description>
La JBL Boombox 4 peut compter sur son design imposant pour d&#233;livrer un son puissant, mais chez Boulanger, elle s'all&#232;ge de 100 euros &#224; l'occasion des soldes d'hiver.
</description>
    </item>
    <item>
      <title>Kentucky just launched Digital ID on iPhones &#8212; and it&#8217;s coming to Apple Wallet soon</title>
      <link>https://www.techradar.com/phones/kentucky-just-launched-digital-id-on-iphones-and-its-coming-to-apple-wallet-soon</link>
      <pubDate>Wed, 07 Jan 2026 12:01:34 +0000</pubDate>
      <guid isPermaLink="false">wtTwW3eRRdCoi4ezRi4awi</guid>
      <description>Kentucky has launched an app to store your digital ID documents on your phone.</description>
    </item>
    <item>
      <title>Emma Stone Is Indignant You Would Think She Dared to Play Miss Piggy in the New &#8216;Muppets&#8217; Movie</title>
      <link>https://gizmodo.com/emma-stone-miss-piggy-movie-casting-jennifer-lawrence-muppets-2000706421</link>
      <pubDate>Wed, 07 Jan 2026 12:00:26 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000706421</guid>
      <description>The two-time Oscar winner had the exact right answer when asked about her new project with Jennifer Lawrence.</description>
    </item>
    <item>
      <title>Home Pilates Equipment for Studio-Quality Workouts (2026)</title>
      <link>https://www.wired.com/story/the-best-pilates-at-home-equipment/</link>
      <pubDate>Wed, 07 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">693f39d99a651f3adca0d716</guid>
      <description>Here&#8217;s everything that you should buy, skip, or splurge on for your at-home Pilates workout.</description>
    </item>
    <item>
      <title>I played with the Lego Smart Brick</title>
      <link>https://www.theverge.com/tech/855520/i-played-with-the-lego-smart-brick</link>
      <pubDate>2026-01-07T07:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=855520</guid>
      <description>When The Lego Group announced that its biggest innovation since 1978 would be a tiny proprietary computer brick, the reactions were divided. I heard from people concerned this was the death of imagination from a company that's all about imagination - and from people who thought it sounded pretty cool! Personally, I walked in skeptical. [&#8230;]</description>
    </item>
    <item>
      <title>Roblox now requires an age check if you want to chat</title>
      <link>https://www.theverge.com/news/856696/roblox-age-check-estimation-chat</link>
      <pubDate>2026-01-07T07:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=856696</guid>
      <description>Roblox is rolling out its previously announced requirement for all users to go through an age estimation process to be able to use the platform's chat features. The policy was announced in November 2025 and was rolled out to Australia, New Zealand, and the Netherlands in December, but now users will be prompted to complete [&#8230;]</description>
    </item>
    <item>
      <title>Roblox now requires all users globally to complete age checks to access chat</title>
      <link>https://techcrunch.com/2026/01/07/roblox-now-requires-all-users-globally-to-complete-age-checks-to-access-chat/</link>
      <pubDate>Wed, 07 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3080436</guid>
      <description>Once users complete an age check, they can access age-based chat, which means they can only communicate with others in a similar age group.</description>
    </item>
    <item>
      <title>Intel spinout Articul8 raises more than half of $70M round at $500M valuation</title>
      <link>https://techcrunch.com/2026/01/07/intel-spin-off-articul8-is-halfway-to-70m-ai-funding-round-at-500m-valuation/</link>
      <pubDate>Wed, 07 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3080536</guid>
      <description>Articul8's valuation for its current funding round marks a roughly fivefold increase since its Series A.</description>
    </item>
    <item>
      <title>MTV Rewind is a developer's tribute to 24/7 music video channels</title>
      <link>https://www.engadget.com/entertainment/music/mtv-rewind-is-a-developers-tribute-to-247-music-video-channels-120000424.html?src=rss</link>
      <pubDate>Wed, 07 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">7e850745-fdf9-4750-b932-a238f30e782f</guid>
      <description>MTV shut down its remaining 24/7 music channels in several countries, including the UK and Australia, at the end of 2025. The main MTV network shifted its focus to reality shows long ago and it occasionally dips back into music with things like the Video Music Awards, but this shutdown felt like the end of an era. If you yearn for the days when MTV actually played music videos, though, you might be in luck. A developer who goes by the name of Flexasaurus Rex has paid tribute to the MTV of old with a web app that has several channels of non-stop streaming music.&#160;MTV Rewind has 11 channels at th...</description>
    </item>
    <item>
      <title>Roblox rolls out mandatory age checks for all users</title>
      <link>https://mashable.com/article/roblox-mandatory-global-age-verification</link>
      <pubDate>Wed, 07 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">00r6e4yBbfQsDUJA6Kj1rKw</guid>
      <description>Roblox expands its platform-wide age verification plans with mandatory age checks for any user wanting to chat online.</description>
    </item>
    <item>
      <title>Bo&#238;te de r&#233;ception | Vieille imprimante, Revenu Canada et num&#233;ros d&#8217;assurance sociale</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-01-07/boite-de-reception/vieille-imprimante-revenu-canada-et-numeros-d-assurance-sociale.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 07 Jan 2026 07:00:00 -0500</pubDate>
      <guid isPermaLink="false">982af137d6543d5798604ca7f871db4e</guid>
      <description>Chaque mercredi, notre journaliste r&#233;pond &#224; vos questions en lien avec le num&#233;rique et les nouvelles technologies. Cette semaine, on se branche &#224; une vieille imprimante, on revisite l&#8217;acc&#232;s au site de l&#8217;ARC et on d&#233;mystifie le num&#233;ro d&#8217;assurance sociale.</description>
    </item>
    <item>
      <title>This Ninja Crispi is down to a record-low price &#8212; now even cheaper than Black Friday</title>
      <link>https://www.techradar.com/home/air-fryers/this-ninja-crispi-is-down-to-a-record-low-price-now-even-cheaper-than-black-friday</link>
      <pubDate>Wed, 07 Jan 2026 11:58:51 +0000</pubDate>
      <guid isPermaLink="false">4abceyUsow4UgBifuDkmBT</guid>
      <description>The Ninja Crispi has all the advantages of a Ninja air fryer while being far more portable &#8212; and it's on sale now for a record low price at Amazon.</description>
    </item>
    <item>
      <title>The Soundcore Space Q45 headphones are on sale for under $100 at Amazon &#8212; save $50 right now</title>
      <link>https://mashable.com/article/jan-7-soundcore-anker-space-q45-headphones-deal</link>
      <pubDate>Wed, 07 Jan 2026 11:53:35 +0000</pubDate>
      <guid isPermaLink="false">069jm4cmsEdSGIyeZS7niSv</guid>
      <description>As of Jan. 7, the Soundcore by Anker Space Q45 headphones are on sale at Amazon for $99.99, 33% off their retail price of $149.99.</description>
    </item>
    <item>
      <title>Ces 2 extensions Chrome espionnent vos conversations avec ChatGPT et votre historique</title>
      <link>https://www.01net.com/actualites/2-extensions-chrome-espionnent-conversations-avec-chatgpt.html</link>
      <pubDate>Wed, 07 Jan 2026 11:51:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318554</guid>
      <description>Deux extensions Chrome tr&#232;s populaires ont espionn&#233; en douce les conversations de plus de 900 000 utilisateurs avec ChatGPT, DeepSeek ou Claude. L'une des extensions &#233;tait m&#234;me mise en avant par Google sur son Chrome Web Store. Il s'agit d'une vaste op&#233;ration d'espionnage visant &#224; d&#233;rober des secrets d'entreprises.</description>
    </item>
    <item>
      <title>Jimmy Kimmel recaps Trumps latest unhinged speech with 57-second montage</title>
      <link>https://mashable.com/video/jimmy-kimmel-trump-speech-montage</link>
      <pubDate>Wed, 07 Jan 2026 11:50:56 +0000</pubDate>
      <guid isPermaLink="false">07EU1MkVENMRtxxFUNMYcJR</guid>
      <description>Jimmy Kimmel has recapped Trump's latest speech to Republicans with a montage of the lowlights.</description>
    </item>
  </channel>
</rss>
