<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 17 Feb 2026 09:55:26 GMT</lastBuildDate>
    <item>
      <title>C&#226;bles sous-marins&#160;: avec 347 millions d&#8217;euros d&#8217;investissements, l&#8217;Europe peut-elle sortir la t&#234;te de l&#8217;eau&#160;?</title>
      <link>https://www.01net.com/actualites/cables-sous-marins-avec-347-millions-deuros-dinvestissements-leurope-peut-elle-sortir-la-tete-de-leau.html</link>
      <pubDate>Tue, 17 Feb 2026 09:46:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326172</guid>
      <description>Apr&#232;s une s&#233;rie de sabotage notamment en mer Baltique, l'Union europ&#233;enne a annonc&#233; investir 347 millions d'euros qui seront fl&#233;ch&#233;s vers de nouveaux c&#226;bles jug&#233;s prioritaires, le renforcement de nos capacit&#233;s de r&#233;paration, et l'achat d'outils de surveillance des fonds marins. Ces mesures, attendues, seront-elles suffisantes face aux &#171;&#160;menaces &#187; qui p&#232;sent sur &#171; ces infrastructures critiques, essentielles &#224; notre souverainet&#233; technologique &#187; ?...</description>
    </item>
    <item>
      <title>Tesla Model Y : comment le SUV &#233;lectrique tombe sous les 30 000 &#8364; gr&#226;ce &#224; cette nouvelle offre</title>
      <link>https://www.frandroid.com/marques/tesla/2979513_tesla-model-y-comment-le-suv-electrique-tombe-sous-les-30-000-e-grace-a-cette-nouvelle-offre</link>
      <pubDate>Tue, 17 Feb 2026 09:43:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2979513_tesla-model-y-comment-le-suv-electrique-tombe-sous-les-30-000-e-grace-a-cette-nouvelle-offre</guid>
      <description>
Tesla veut relancer les ventes de sa Model Y et propose une offre tr&#232;s all&#233;chante. La voiture &#233;lectrique est d&#233;sormais accessible &#224; moins de 30 000 euros, gr&#226;ce &#224; une offre de reprise g&#233;n&#233;reuse.
</description>
    </item>
    <item>
      <title>Bonne nouvelle, France Identit&#233; va fonctionner dans les a&#233;roports</title>
      <link>https://www.frandroid.com/culture-tech/2979557_bonne-nouvelle-france-identite-va-fonctionner-dans-les-aeroports</link>
      <pubDate>Tue, 17 Feb 2026 09:40:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/2979557_bonne-nouvelle-france-identite-va-fonctionner-dans-les-aeroports</guid>
      <description>
L'application France Identit&#233; continue son d&#233;ploiement comme remplacement num&#233;rique de votre carte d'identit&#233;. Elle sera accept&#233;e et reconnue &#224; l'a&#233;roport d&#232;s cet &#233;t&#233;.
</description>
    </item>
    <item>
      <title>Windows 11 : Microsoft bloque discr&#232;tement cet outil appr&#233;ci&#233; par de nombreux utilisateurs</title>
      <link>https://www.frandroid.com/marques/microsoft/2979459_windows-11-microsoft-bloque-discretement-cet-outil-apprecie-par-de-nombreux-utilisateurs</link>
      <pubDate>Tue, 17 Feb 2026 09:39:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2979459_windows-11-microsoft-bloque-discretement-cet-outil-apprecie-par-de-nombreux-utilisateurs</guid>
      <description>
Rufus, l&#8217;outil de cr&#233;ation de cl&#233;s USB bootables, ne permet plus de t&#233;l&#233;charger d&#8217;ISO de Windows 11 Insider. Une restriction qui proviendrait directement de la firme de Redmond.
</description>
    </item>
    <item>
      <title>Vous ne voyez plus les commentaires YouTube&#8201;? C&#8217;est sans doute (gr&#226;ce &#224;&#8201;?) votre bloqueur de pub</title>
      <link>https://www.frandroid.com/marques/google/2979423_vous-ne-voyez-plus-les-commentaires-youtube-cest-sans-doute-grace-a-votre-bloqueur-de-pub</link>
      <pubDate>Tue, 17 Feb 2026 09:35:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2979423_vous-ne-voyez-plus-les-commentaires-youtube-cest-sans-doute-grace-a-votre-bloqueur-de-pub</guid>
      <description>
Un bug &#233;trange semble toucher pas mal d&#8217;internautes surfant sur YouTube r&#233;cemment&#160;: la disparition des commentaires et des descriptions de vid&#233;os. Il se pourrait bien que ce soit Google qui r&#233;plique (encore) contre les bloqueurs de pubs.
</description>
    </item>
    <item>
      <title>La voiture &#233;lectrique pourrait sauver l&#8217;emploi en France contrairement au thermique : ce graphique ne laisse pas de doute</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2979401_la-voiture-electrique-pourrait-sauver-lemploi-en-france-contrairement-au-thermique-ce-graphique-ne-laisse-pas-de-doute</link>
      <pubDate>Tue, 17 Feb 2026 09:34:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2979401_la-voiture-electrique-pourrait-sauver-lemploi-en-france-contrairement-au-thermique-ce-graphique-ne-laisse-pas-de-doute</guid>
      <description>
L&#8217;organisation Transport &amp; Environment dresse un bilan de la voiture &#233;lectrique en 2025. Et il y a eu de tr&#232;s bonnes nouvelles, notamment sur le made in France et les flottes d&#8217;entreprises.
</description>
    </item>
    <item>
      <title>Prix modeste, capteur de couple et compact : Tenways lance un nouveau v&#233;lo &#233;lectrique attrayant</title>
      <link>https://www.frandroid.com/marques/tenways/2979555_prix-modeste-capteur-de-couple-et-compact-tenways-lance-un-nouveau-velo-electrique-attrayant</link>
      <pubDate>Tue, 17 Feb 2026 09:27:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tenways/2979555_prix-modeste-capteur-de-couple-et-compact-tenways-lance-un-nouveau-velo-electrique-attrayant</guid>
      <description>
Tenways &#233;toffe son catalogue avec le CGO Compact, un v&#233;lo &#233;lectrique de 20 pouces &#233;quip&#233; d&#8217;un moteur arri&#232;re de 250 W et d&#8217;une batterie de 504 Wh, affich&#233; &#224; 1 999 euros.
</description>
    </item>
    <item>
      <title>macOS 26.4 : l&#8217;option cach&#233;e qui va prolonger la vie de votre Mac</title>
      <link>https://www.frandroid.com/marques/apple/2979501_macos-26-4-loption-cachee-qui-va-prolonger-la-vie-de-votre-mac</link>
      <pubDate>Tue, 17 Feb 2026 09:26:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2979501_macos-26-4-loption-cachee-qui-va-prolonger-la-vie-de-votre-mac</guid>
      <description>
macOS se dote enfin de la fonctionnalit&#233; de limite de charge import&#233;e de l&#8217;iPhone, pour pr&#233;server la long&#233;vit&#233; de votre batterie sur Mac, surtout si vous le laissez branch&#233; en permanence.
</description>
    </item>
    <item>
      <title>Trop ch&#232;re et peu utile, Mercedes enterre une technologie plus &#233;volu&#233;e que celle de Tesla</title>
      <link>https://www.frandroid.com/marques/mercedes-benz/2979439_trop-chere-et-peu-utile-mercedes-enterre-une-technologie-plus-evoluee-que-celle-de-tesla</link>
      <pubDate>Tue, 17 Feb 2026 09:23:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/mercedes-benz/2979439_trop-chere-et-peu-utile-mercedes-enterre-une-technologie-plus-evoluee-que-celle-de-tesla</guid>
      <description>
Lanc&#233; en 2022 par Mercedes, le syst&#232;me Drive Pilot fait ses adieux. Offrant une conduite autonome de niveau 3, celui-ci est d&#233;sormais remplac&#233; par une technologie de niveau 2++. Mais pourquoi&#160;?
</description>
    </item>
    <item>
      <title>Samsung Odyssey G9 : l&#8217;&#233;cran XXL de 49 pouces qui veut remplacer deux moniteurs gaming est &#224; prix cass&#233;</title>
      <link>https://www.frandroid.com/bons-plans/2653421_samsung-odyssey-g9-lecran-xxl-de-49-pouces-qui-veut-remplacer-deux-moniteurs-gaming-est-a-prix-casse</link>
      <pubDate>Tue, 17 Feb 2026 09:16:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2653421_samsung-odyssey-g9-lecran-xxl-de-49-pouces-qui-veut-remplacer-deux-moniteurs-gaming-est-a-prix-casse</guid>
      <description>
Avec son format 32:9 ultra-immersif, ce moniteur Samsung XXL de 49 pouces transforme n'importe quel bureau en simulateur de course, cockpit ou studio de production. Il en met plein la vue et se trouve actuellement en promotion &#224; 669 euros contre 899 euros de base.
</description>
    </item>
    <item>
      <title>Poncer son bo&#238;tier d&#8217;AirPods Pro pour obtenir une finition mate, est-ce vraiment une bonne id&#233;e&#160;?</title>
      <link>https://www.frandroid.com/marques/apple/2979463_poncez-son-boitier-dairpods-pro-pour-obtenir-une-finition-mate-est-ce-vraiment-une-bonne-idee</link>
      <pubDate>Tue, 17 Feb 2026 09:01:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2979463_poncez-son-boitier-dairpods-pro-pour-obtenir-une-finition-mate-est-ce-vraiment-une-bonne-idee</guid>
      <description>
Face aux empreintes digitales et aux rayures qui s'accumulent rapidement sur le bo&#238;tier brillant des AirPods Pro, certains utilisateurs ont trouv&#233; une solution radicale&#160;: poncer la surface pour obtenir une finition mate plus r&#233;sistante aux traces. Mais est-ce vraiment la meilleure chose &#224; faire&#160;?
</description>
    </item>
    <item>
      <title>Cohere launches a family of open multilingual models</title>
      <link>https://techcrunch.com/2026/02/17/cohere-launches-a-family-of-open-multilingual-models/</link>
      <pubDate>Tue, 17 Feb 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3093327</guid>
      <description>Cohere's Tiny Aya models support over 70 langauges</description>
    </item>
    <item>
      <title>I became a master of stealth in Styx: Blades of Greed and finished my playthrough with hundreds of guards kicked off cliffs, countless coins pilfered, and a full arsenal of magical abilities</title>
      <link>https://www.techradar.com/gaming/styx-blades-of-greed-review</link>
      <pubDate>Tue, 17 Feb 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">LAibfpkRRBpBVsGL63hwjf</guid>
      <description>Styx: Blades of Greed isn&#8217;t perfect, but its excellent stealth foundations make it well worth playing.</description>
    </item>
    <item>
      <title>The &#8216;Menopause Penalty.&#8217; When biology meets broken work systems</title>
      <link>https://www.fastcompany.com/91486866/menopause-penalty-when-biology-meets-broken-work-systems</link>
      <pubDate>2026-02-17T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91486866/menopause-penalty-when-biology-meets-broken-work-systems</guid>
      <description>Menopause doesn&#8217;t create inequalities. It amplifies those that already exist.
After 50, too many women reduce their working hours, become trapped in lower-quality jobs, or exit the labor market altogether. Part-time employment becomes more prevalent as women age. The gender gap widens. For women, this means lower lifetime earnings and significantly smaller pensions. Many are calling this phenomenon the &#8220;menopause penalty&#8221;&#8212;a midlife equivalent of the motherhood penalty. And indeed, research suggests that women&#8217;s earnings drop in the years following a menopause diagnosis....</description>
    </item>
    <item>
      <title>Android Auto 16.3&#160;: Google pr&#233;pare l&#8217;arriv&#233;e d&#8217;une fonction tr&#232;s attendue dans votre voiture</title>
      <link>https://www.01net.com/actualites/android-auto-16-3-google-prepare-larrivee-dune-fonction-tres-attendue-dans-votre-voiture.html</link>
      <pubDate>Tue, 17 Feb 2026 08:52:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326274</guid>
      <description>La derni&#232;re b&#234;ta d'Android Auto (16.3) cache de belles surprises. Dans ses lignes de code, Google confirme l'arriv&#233;e imminente des applications vid&#233;o.</description>
    </item>
    <item>
      <title>Fin du diesel ? Ce test de recharge en plein hiver confirme les performances des camions &#233;lectriques</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2979379_fin-du-diesel-ce-test-de-recharge-en-plein-hiver-confirme-les-performances-des-camions-electriques</link>
      <pubDate>Tue, 17 Feb 2026 08:51:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2979379_fin-du-diesel-ce-test-de-recharge-en-plein-hiver-confirme-les-performances-des-camions-electriques</guid>
      <description>
MAN a r&#233;alis&#233; un test tr&#232;s concluant de la charge M&#233;gawatt avec son camion &#233;lectrique, le eTGX, par des temp&#233;ratures n&#233;gatives. Pour cela, le constructeur a utilis&#233; les bornes de l&#8217;entreprise Kempower, capable de d&#233;livrer jusqu&#8217;&#224; 1 200 kW.
</description>
    </item>
    <item>
      <title>Une nouvelle fuite de donn&#233;es touche le Service Public, des informations pr&#233;cises ont &#233;t&#233; pirat&#233;es</title>
      <link>https://www.01net.com/actualites/nouvelle-fuite-donnees-touche-service-public-informations-precises-piratees.html</link>
      <pubDate>Tue, 17 Feb 2026 08:15:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326276</guid>
      <description>Le service public vient de subir une nouvelle cyberattaque. Les donn&#233;es de 377 418 Fran&#231;ais ont &#233;t&#233; vol&#233;es durant l'intrusion. Ces informations ont rapidement apparu sur le dark web... C'est d&#233;j&#224; la deuxi&#232;me fuite de l'ann&#233;e pour le service public.</description>
    </item>
    <item>
      <title>Pourquoi ce TV QLED de 65 pouces (144 Hz) brad&#233; &#224; moins de 500 &#8364; m&#233;rite votre attention ?</title>
      <link>https://www.frandroid.com/bons-plans/2978923_pourquoi-ce-tv-qled-de-65-pouces-144-hz-brade-a-moins-de-500-e-merite-votre-attention</link>
      <pubDate>Tue, 17 Feb 2026 08:08:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2978923_pourquoi-ce-tv-qled-de-65-pouces-144-hz-brade-a-moins-de-500-e-merite-votre-attention</guid>
      <description>
Un grand TV de 65 pouces fait toujours envie, alors quand en plus ce dernier profite de la technologie QLED et d'un taux de rafra&#238;chissement &#224; 144 Hz, il est le parfait compagnon. C'est le cas du Thomson 65QG7C14 qui ne co&#251;te pas plus de 500 euros gr&#226;ce &#224; cette offre. 
</description>
    </item>
    <item>
      <title>Huawei Band 11 : ce petit changement technique qui va tout changer pour les sportifs</title>
      <link>https://www.frandroid.com/marques/huawei/2979377_huawei-band-11-ce-petit-changement-technique-qui-va-tout-changer-pour-les-sportifs</link>
      <pubDate>Tue, 17 Feb 2026 08:02:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/huawei/2979377_huawei-band-11-ce-petit-changement-technique-qui-va-tout-changer-pour-les-sportifs</guid>
      <description>
&#192; l'approche de sa pr&#233;sentation officielle, le Huawei Band 11 fait l'objet de nouvelles fuites. Cette fois, c'est le site WinFuture qui a mis la main sur ses caract&#233;ristiques. 
</description>
    </item>
    <item>
      <title>macOS 26.4 pourra bient&#244;t limiter la charge de la batterie de votre Mac pour la pr&#233;server</title>
      <link>https://www.01net.com/actualites/macos-26-4-pourra-bientot-limiter-la-charge-de-la-batterie-de-votre-mac-pour-la-preserver.html</link>
      <pubDate>Tue, 17 Feb 2026 08:01:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326286</guid>
      <description>Apr&#232;s l&#8217;avoir introduite sur iOS et iPadOS, Apple pr&#233;pare l&#8217;arriv&#233;e d&#8217;une fonction permettant de limiter la charge maximale de la batterie des Mac pour prolonger leur dur&#233;e de vie.</description>
    </item>
    <item>
      <title>The best Apple Watch in 2026</title>
      <link>https://www.engadget.com/wearables/best-apple-watch-160005462.html?src=rss</link>
      <pubDate>Tue, 17 Feb 2026 08:00:36 +0000</pubDate>
      <guid isPermaLink="false">8775e6de-d7c2-4b43-a8c2-7ec2f62a6d73</guid>
      <description>There are just three models of Apple Watch &#8212; and $500 separates the most affordable from the premium model, with the flagship landing somewhere in between. Before the launch of the overhauled Apple Watch SE 3 in late 2025, it was pretty easy to direct most people to the Apple Watch Series 11. But with its new display and faster charging, the budget model makes a lot more sense now. There&#8217;s also a case for recommending the refreshed Apple Watch Ultra 3 to diehard adventurers and outdoor enthusiasts. Here, we spell out just what differentiates the models as well as what you get when you buy any ...</description>
    </item>
  </channel>
</rss>
