<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 08 Dec 2025 08:36:51 GMT</lastBuildDate>
    <item>
      <title>Boulanger vous fait &#233;conomiser jusqu&#8217;&#224; 400 &#8364; sur ce laptop avec  &#233;cran OLED et Ultra 5</title>
      <link>https://www.frandroid.com/bons-plans/2900965_boulanger-vous-fait-economiser-jusqua-400-e-sur-ce-laptop-avec-ecran-oled-et-ultra-5</link>
      <pubDate>Mon, 08 Dec 2025 08:29:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2900965_boulanger-vous-fait-economiser-jusqua-400-e-sur-ce-laptop-avec-ecran-oled-et-ultra-5</guid>
      <description>
Avec son &#233;cran OLED 14" et ses 16 Go de RAM, ce Yoga Slim 7 de Lenovo saura r&#233;pondre &#224; tous vos besoins et Boulanger fait chuter son prix de 400 euros puisqu'avec le bonus de reprise, on peut le retrouver &#224; 609,99 euros au lieu de 999,99 euros.
</description>
    </item>
    <item>
      <title>Voici la toute nouvelle voiture &#233;lectrique d&#8217;Audi : un SUV sans les anneaux</title>
      <link>https://www.frandroid.com/marques/audi/2901439_voici-la-toute-nouvelle-voiture-electrique-daudi-un-suv-sans-les-anneaux</link>
      <pubDate>Mon, 08 Dec 2025 08:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/audi/2901439_voici-la-toute-nouvelle-voiture-electrique-daudi-un-suv-sans-les-anneaux</guid>
      <description>
D&#233;riv&#233; du concept Audi E, le nouvel E7X de s&#233;rie se d&#233;voile peu &#224; peu. Prenant la forme d&#8217;un SUV, cette nouvelle voiture &#233;lectrique sera destin&#233;e dans un premier temps au march&#233; chinois et sera lanc&#233;e au premier semestre 2026.
</description>
    </item>
    <item>
      <title>Voici la nouvelle GLB &#233;lectrique et hybride de Mercedes : 7 places et taill&#233;e pour les d&#233;parts en vacances</title>
      <link>https://www.frandroid.com/marques/mercedes-benz/2900591_voici-la-nouvelle-glb-electrique-et-hybride-de-mercedes-7-places-et-taillee-pour-les-departs-en-vacances</link>
      <pubDate>Mon, 08 Dec 2025 08:20:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/mercedes-benz/2900591_voici-la-nouvelle-glb-electrique-et-hybride-de-mercedes-7-places-et-taillee-pour-les-departs-en-vacances</guid>
      <description>
Mercedes-Benz d&#233;voile le nouveau GLB, &#233;lectrique et hybride. Un SUV compact familial disponible en 5 ou 7 places pour viser frontalement les amateurs de Tesla Model Y. Avec jusqu'&#224; 631 km d'autonomie et une recharge rapide, les gros rouleurs habitu&#233;s au diesel l'appr&#233;cieront.
</description>
    </item>
    <item>
      <title>D&#233;missions en s&#233;rie chez Apple&#160;: le patron des puces Silicon &#171;&#160;envisage s&#233;rieusement&#160;&#187; de partir</title>
      <link>https://www.01net.com/actualites/demissions-serie-chez-apple-patron-puces-silicon-envisage-serieusement-partir.html</link>
      <pubDate>Mon, 08 Dec 2025 08:01:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314160</guid>
      <description>Apple est en train de vivre le plus grand remaniement de direction depuis la mort de Steve Jobs. Des figures cl&#233;s comme Jeff Williams, Luca Maestri, Alan Dye ou encore John Giannandrea, ont abandonn&#233; leur poste. Le strat&#232;ge des puces Apple Silicon, Johny Srouji, envisagerait aussi de partir, afin de rejoindre un autre groupe. Tim Cook tenterait de le retenir....</description>
    </item>
    <item>
      <title>Le design des Samsung Galaxy S26 et une charge plus rapide d&#233;voil&#233;s par One UI 8.5 lui-m&#234;me</title>
      <link>https://www.frandroid.com/marques/samsung/2901477_le-design-des-samsung-galaxy-s26-et-une-charge-plus-rapide-devoiles-par-one-ui-8-5-lui-meme</link>
      <pubDate>Mon, 08 Dec 2025 07:57:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2901477_le-design-des-samsung-galaxy-s26-et-une-charge-plus-rapide-devoiles-par-one-ui-8-5-lui-meme</guid>
      <description>
Des rendus sch&#233;matiques int&#233;gr&#233;s dans une version en d&#233;veloppement de One UI 8.5 r&#233;v&#232;lent le design des Galaxy S26, S26 Plus et S26 Ultra et &#233;voquent une mont&#233;e en puissance des vitesses filaire et sans fil, en attendant la pr&#233;sentation officielle de Samsung.&#8203;
</description>
    </item>
    <item>
      <title>&#171;&#8201;Si Apple tra&#238;ne des pieds, c&#8217;est une excellente nouvelle pour nous&#8201;&#187;&#160;: comment les vendeurs chinois capitalisent sur les d&#233;boires de l&#8217;iPhone</title>
      <link>https://www.frandroid.com/marques/apple/2901471_si-apple-traine-des-pieds-cest-une-excellente-nouvelle-pour-nous-comment-les-vendeurs-chinois-capitalisent-sur-les-deboires-de-liphone</link>
      <pubDate>Mon, 08 Dec 2025 07:51:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2901471_si-apple-traine-des-pieds-cest-une-excellente-nouvelle-pour-nous-comment-les-vendeurs-chinois-capitalisent-sur-les-deboires-de-liphone</guid>
      <description>
En Chine, de nombreux fabricants locaux de smartphones tentent de convaincre la population d&#8217;abandonner les iPhone d&#8217;Apple pour des mobiles Android suppos&#233;ment plus innovants.
</description>
    </item>
    <item>
      <title>01net Awards&#160;: la meilleure console de jeu de l&#8217;ann&#233;e est&#8230;</title>
      <link>https://www.01net.com/actualites/01net-awards-la-meilleure-console-de-jeu-de-lannee-est.html</link>
      <pubDate>Mon, 08 Dec 2025 07:40:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314130</guid>
      <description>La r&#233;daction de 01net.com d&#233;signe les meilleurs produits de l&#8217;ann&#233;e. D&#233;couvrez tous les jours les vainqueurs de chaque cat&#233;gorie jusqu&#8217;&#224; la remise des prix le 10 d&#233;cembre, en live s&#8217;il vous plait !</description>
    </item>
    <item>
      <title>Le nouveau Oppo Find X9 est d&#233;j&#224; moins cher gr&#226;ce &#224; une pluie de r&#233;ductions</title>
      <link>https://www.frandroid.com/bons-plans/2900561_le-nouveau-oppo-find-x9-est-deja-moins-cher-grace-a-une-pluie-de-reductions</link>
      <pubDate>Mon, 08 Dec 2025 07:32:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2900561_le-nouveau-oppo-find-x9-est-deja-moins-cher-grace-a-une-pluie-de-reductions</guid>
      <description>
L'Oppo Find X9 a &#233;t&#233; r&#233;cemment officialis&#233; par la marque, et il faut dire qu'il cumule les atouts : capteurs photos co-con&#231;us avec Hasselblad, performances de haut vol, fonctions IA int&#233;gr&#233;es... La bonne nouvelle, c'est qu'&#224; peine sorti, le Find X9 peut d&#233;j&#224; vous revenir &#224; 789,99 euros au lieu de 989 euros chez Boulanger.
</description>
    </item>
    <item>
      <title>JMGO O3, l&#8217;ultra-courte focale en version compacte</title>
      <link>https://www.frandroid.com/marques/jmgo/2901433_jmgo-o3-lultra-courte-focale-en-version-compacte</link>
      <pubDate>Mon, 08 Dec 2025 07:22:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/jmgo/2901433_jmgo-o3-lultra-courte-focale-en-version-compacte</guid>
      <description>
Le fabricant chinois JMGO vient d'annoncer le lancement de son nouveau projecteur &#224; focale ultra-courte O3 sur le march&#233; asiatique. Cet appareil Full HD a la particularit&#233; d&#8217;&#234;tre extr&#234;mement compact se basant sur les dimensions d&#8217;un mod&#232;le que nous connaissons en France, le O2S Ultra.
</description>
    </item>
    <item>
      <title>Google Wallet active un nouveau genre de notifications qui peut vous &#233;viter pas mal de gal&#232;res</title>
      <link>https://www.01net.com/actualites/google-wallet-active-nouveau-genre-notifications-eviter-galeres.html</link>
      <pubDate>Mon, 08 Dec 2025 07:03:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314145</guid>
      <description>Google Wallet commence &#224; proposer un nouveau genre de notifications tr&#232;s pratiques li&#233;es aux cartes enregistr&#233;es dans l&#8217;application.</description>
    </item>
    <item>
      <title>Want to future-proof your job? Start protecting your focus time</title>
      <link>https://www.fastcompany.com/91452719/want-to-future-proof-your-job-start-protecting-your-focus-time</link>
      <pubDate>2025-12-08T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91452719/want-to-future-proof-your-job-start-protecting-your-focus-time</guid>
      <description>The most productive meetings on your calendar might not include anyone else.
The next big meeting on your calendar might not have any other attendees&#8212;it might just be you. A growing number of high-performing leaders, including managers at Google and other Fortune 100 companies, are carving out protected &#8220;focus blocks&#8221; and treating them like mission-critical meetings....</description>
    </item>
    <item>
      <title>Apr&#232;s l&#8217;amende de 120&#160;millions, X suspend un des comptes de l&#8217;Union europ&#233;enne</title>
      <link>https://www.frandroid.com/culture-tech/politique/2901415_apres-lamende-de-120-millions-x-suspend-un-des-comptes-de-lunion-europeenne</link>
      <pubDate>Mon, 08 Dec 2025 06:49:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/politique/2901415_apres-lamende-de-120-millions-x-suspend-un-des-comptes-de-lunion-europeenne</guid>
      <description>
Exasp&#233;r&#233; par l&#8217;amende symbolique inflig&#233;e par l&#8217;Union europ&#233;enne au r&#233;seau social X, Elon Musk a profit&#233; du week-end pour relayer des tas de messages hostiles &#224; l&#8217;adresse de la Commission europ&#233;enne. Au m&#234;me moment, un des comptes li&#233;s &#224; l&#8217;institution bruxelloise &#233;tait suspendu.
</description>
    </item>
  </channel>
</rss>
