<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 16 Dec 2025 11:24:35 GMT</lastBuildDate>
    <item>
      <title>Acheter un smartphone en 2026&#160;? Une mauvaise surprise se profile</title>
      <link>https://www.01net.com/actualites/acheter-smartphone-2026-mauvaise-surprise-se-profile.html</link>
      <pubDate>Tue, 16 Dec 2025 11:04:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315535</guid>
      <description>Acheter un nouveau smartphone en 2026 pourrait r&#233;server de mauvaises surprises. Les prochains mod&#232;les risquent en effet de co&#251;ter plus cher, tout en &#233;tant moins bien &#233;quip&#233;s.</description>
    </item>
    <item>
      <title>Voici la meilleure offre pour glisser L&#233;gendes Pok&#233;mon Z-A sur Switch 2 sous le sapin de No&#235;l</title>
      <link>https://www.frandroid.com/bons-plans/2911371_voici-la-meilleure-offre-pour-glisser-legendes-pokemon-z-a-sur-switch-2-sous-le-sapin-de-noel</link>
      <pubDate>Tue, 16 Dec 2025 11:01:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2911371_voici-la-meilleure-offre-pour-glisser-legendes-pokemon-z-a-sur-switch-2-sous-le-sapin-de-noel</guid>
      <description>
L&#233;gendes Pok&#233;mon Z-A est la derni&#232;re aventure en date de la fameuse franchise, &#224; retrouver pour 47,99 euros au lieu de 69,99 euros sur Nintendo Switch 2.
</description>
    </item>
    <item>
      <title>Mise &#224; jour Volvo : un gros retard qui cache une inqui&#233;tude sur nos vieux processeurs</title>
      <link>https://www.frandroid.com/marques/volvo/2911535_mise-a-jour-volvo-un-gros-retard-qui-cache-une-inquietude-sur-nos-vieux-processeurs</link>
      <pubDate>Tue, 16 Dec 2025 11:00:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volvo/2911535_mise-a-jour-volvo-un-gros-retard-qui-cache-une-inquietude-sur-nos-vieux-processeurs</guid>
      <description>
Il va falloir prendre votre mal en patience. Alors que Volvo promettait une refonte totale de son interface pour la fin 2025, le constructeur vient d'annoncer un report de derni&#232;re minute. Les 2,5 millions de voitures concern&#233;es ne verront pas la couleur du nouveau logiciel avant l'ann&#233;e prochaine.
</description>
    </item>
    <item>
      <title>Adam Scott&#8217;s &#8216;Hokum&#8217; Teaser Is the Freakiest 40 Seconds You&#8217;ll See All Day</title>
      <link>https://gizmodo.com/adam-scotts-hokum-teaser-is-the-freakiest-40-seconds-youll-see-all-day-2000699884</link>
      <pubDate>Tue, 16 Dec 2025 11:00:03 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000699884</guid>
      <description>The 'Severance' star dives into supernatural horror in the next film from 'Oddity' director Damien McCarthy; it hits theaters May 1.</description>
    </item>
    <item>
      <title>Solo VC and Lovable investor Neil Murray raises third Nordic-focused fund</title>
      <link>https://techcrunch.com/2025/12/16/solo-gp-neil-murray-closes-6m-fund-iii-to-back-nordic-founders/</link>
      <pubDate>Tue, 16 Dec 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3076014</guid>
      <description>The Nordic Web closes $6M Fund III.</description>
    </item>
    <item>
      <title>This week's camera deals are even better than Black Friday &#8212; Nikon, Sony, Canon, and others are at record-low prices</title>
      <link>https://www.techradar.com/cameras/mirrorless-cameras/this-weeks-camera-deals-are-even-better-than-black-friday-nikon-sony-canon-and-others-are-at-record-low-prices</link>
      <pubDate>Tue, 16 Dec 2025 10:48:46 +0000</pubDate>
      <guid isPermaLink="false">8QghcGDwAb7nXQJK2cQhF3</guid>
      <description>B&amp;H Photo and Adorama have excellent last-minute camera deals this week, including prices that are even lower than Black Friday &#8211; in some cases.</description>
    </item>
    <item>
      <title>Volkswagen r&#233;pond au Tesla Cybercab : sa voiture &#233;lectrique sans volant est d&#233;j&#224; sur la route</title>
      <link>https://www.frandroid.com/marques/volkswagen/2911223_volkswagen-repond-au-tesla-cybercab-sa-voiture-electrique-sans-volant-est-deja-sur-la-route</link>
      <pubDate>Tue, 16 Dec 2025 10:45:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2911223_volkswagen-repond-au-tesla-cybercab-sa-voiture-electrique-sans-volant-est-deja-sur-la-route</guid>
      <description>
Apr&#232;s le Tesla Cybercab, Volkswagen d&#233;marre officiellement les essais routiers pour son premier taxi autonome. Baptis&#233; Gen.Urban, ce dernier circule actuellement dans les rues de Wolfsburg, afin de tester le ressenti des passagers &#224; bord.
</description>
    </item>
    <item>
      <title>&#171;&#160;Nous avons pirat&#233; le minist&#232;re de l&#8217;Int&#233;rieur&#160;&#187; : des hackers menacent de divulguer le casier judicaire de 16 millions de personnes</title>
      <link>https://www.01net.com/actualites/nous-avons-pirate-ministere-interieur-hackers-menacent-divulguer-casier-judiciaire-16-millions-individus.html</link>
      <pubDate>Tue, 16 Dec 2025 10:44:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315514</guid>
      <description>Le minist&#232;re de l&#8217;Int&#233;rieur a &#233;t&#233; pirat&#233;. Des hackers pr&#233;tendent avoir mis la main sur le casier judiciaire de 16 millions de personnes, ainsi que sur d'autres informations de police. Ils donnent une semaine &#224; la France pour n&#233;gocier.</description>
    </item>
    <item>
      <title>Aura Frame Sale (2025): From Aura Carver to Aura Ink</title>
      <link>https://www.wired.com/story/aura-frame-sale-december-2025/</link>
      <pubDate>Tue, 16 Dec 2025 10:32:00 +0000</pubDate>
      <guid isPermaLink="false">693c6b9088bd6c3b48f58163</guid>
      <description>Aura&#8217;s digital photo frames outshine the competition left and right, and you can score them on sale this holiday season.</description>
    </item>
    <item>
      <title>Is OpenAI Entering Its Acquisition Era?</title>
      <link>https://gizmodo.com/is-openai-entering-its-acquisition-era-2000699888</link>
      <pubDate>Tue, 16 Dec 2025 10:30:12 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000699888</guid>
      <description>The company just announced a major corporate development hire.</description>
    </item>
    <item>
      <title>French government hit by cyberattack - Interior Ministry confirms email systems hit</title>
      <link>https://www.techradar.com/pro/security/french-government-hit-by-cyberattack-interior-ministry-confirms-email-systems-hit</link>
      <pubDate>Tue, 16 Dec 2025 10:26:52 +0000</pubDate>
      <guid isPermaLink="false">wkzn8gB9fiJ4xRy9GV5MHk</guid>
      <description>Speculation rises over the identity and motives of unknown hackers.</description>
    </item>
    <item>
      <title>Netflix-Warner : le g&#233;ant de la SVoD annonce ne pas rench&#233;rir face &#224; Paramount et garde une confiance aveugle dans son deal</title>
      <link>https://www.frandroid.com/services/svod/2911207_netflix-warner-le-geant-de-la-svod-annonce-ne-pas-rencherir-face-a-paramount-et-garde-une-confiance-aveugle-dans-son-deal</link>
      <pubDate>Tue, 16 Dec 2025 10:24:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2911207_netflix-warner-le-geant-de-la-svod-annonce-ne-pas-rencherir-face-a-paramount-et-garde-une-confiance-aveugle-dans-son-deal</guid>
      <description>
Non, Netflix ne bougera pas face &#224; l'OPA de Paramount. C'est ce que Greg Peters et Ted Sarandos, les co-directeurs de la plateforme de streaming, ont annonc&#233; dans une lettre &#224; leurs employ&#233;s. Une tentative qui pourrait passer pour une d&#233;monstration d'exc&#232;s de confiance.
</description>
    </item>
    <item>
      <title>How to watch Australia vs England on Sling TV: live stream Ashes 3rd Test cricket</title>
      <link>https://www.techradar.com/how-to-watch/cricket/australia-vs-england-sling-tv-ashes-3rd-test</link>
      <pubDate>Tue, 16 Dec 2025 10:24:03 +0000</pubDate>
      <guid isPermaLink="false">VEUrHz7ng4UnN55R2pQGKi</guid>
      <description>All the ways to watch the 3rd Ashes Test at Adelaide on Sling from anywhere in the world as England face a must-win match against Australia in the cricket.</description>
    </item>
    <item>
      <title>The Amazon Fire TV Stick HD is under $20 &#8212; act fast to save $16</title>
      <link>https://mashable.com/article/dec-16-fire-stick-hd-deal</link>
      <pubDate>Tue, 16 Dec 2025 10:19:30 +0000</pubDate>
      <guid isPermaLink="false">05yahyEcxM5RScsLDawa4ch</guid>
      <description>Get the best streaming stick deal at Amazon. Save 46% on the Amazon Fire TV Stick HD.</description>
    </item>
    <item>
      <title>Save $40 on the Amazon Fire TV 2-Series ahead of Christmas</title>
      <link>https://mashable.com/article/dec-16-fire-tv-deal</link>
      <pubDate>Tue, 16 Dec 2025 10:17:08 +0000</pubDate>
      <guid isPermaLink="false">007uT7yVg1suzFCRTJhfZ3H</guid>
      <description>Get the best TV deal ahead of Christmas. Save 27% on the Amazon Fire TV 2-Series.</description>
    </item>
    <item>
      <title>How to watch The Life of Chuck: One of our top movies of the year is now streaming</title>
      <link>https://mashable.com/article/how-to-watch-the-life-of-chuck</link>
      <pubDate>Tue, 16 Dec 2025 10:17:00 +0000</pubDate>
      <guid isPermaLink="false">03YotyDSM8t2Al9omBulHGT</guid>
      <description>'The Life of Chuck' is now available to watch at home on video on demand. It will also be streaming on Hulu at a later date.</description>
    </item>
    <item>
      <title>The Shokz OpenRun Pro 2 earbuds just got a $40 discount at Amazon</title>
      <link>https://mashable.com/article/dec-16-shokz-openrun-pro-2-deal</link>
      <pubDate>Tue, 16 Dec 2025 10:14:48 +0000</pubDate>
      <guid isPermaLink="false">01wuBmbDMdzVh3YJik8me2a</guid>
      <description>Find the best running earbuds at Amazon. Save 22% on the Shokz OpenRun Pro 2 at Amazon.</description>
    </item>
    <item>
      <title>Test Xiaomi BW400 Pro : une cam&#233;ra de surveillance efficace et endurante</title>
      <link>https://www.frandroid.com/marques/xiaomi/2837737_test-xiaomi-bw400-pro-une-camera-de-surveillance-efficace-et-endurante</link>
      <pubDate>Tue, 16 Dec 2025 10:10:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2837737_test-xiaomi-bw400-pro-une-camera-de-surveillance-efficace-et-endurante</guid>
      <description>
La Xiaomi BW400 Pro compl&#232;te une offre de cam&#233;ras de s&#233;curit&#233; connect&#233;es d&#233;j&#224; pl&#233;thorique chez le constructeur chinois. Toutefois, entre les promesses li&#233;es &#224; l&#8217;IA, le design et un panneau solaire int&#233;gr&#233; pour l&#8217;endurance, ce mod&#232;le a tout pour intriguer et s&#233;duire.
</description>
    </item>
    <item>
      <title>CarPlay : ces deux nouvelles fonctionnalit&#233;s vont changer vos trajets en voiture</title>
      <link>https://www.frandroid.com/os/ios/2911351_carplay-ces-deux-nouvelles-fonctionnalites-vont-changer-vos-trajets-en-voiture</link>
      <pubDate>Tue, 16 Dec 2025 10:09:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/ios/2911351_carplay-ces-deux-nouvelles-fonctionnalites-vont-changer-vos-trajets-en-voiture</guid>
      <description>
Vous pensiez que CarPlay prenait la poussi&#232;re ? C'est faux. Alors que tout le monde a les yeux riv&#233;s sur le futur "CarPlay Ultra", Apple d&#233;ploie discr&#232;tement deux fonctionnalit&#233;s tr&#232;s attendues dans sa derni&#232;re mise &#224; jour iOS 26.2.
</description>
    </item>
    <item>
      <title>Un bon laptop gaming pas cher pour No&#235;l ? Ce HP Victus 15 avec une RTX 4060 est &#224; un super prix chez Boulanger</title>
      <link>https://www.frandroid.com/bons-plans/2911143_un-bon-laptop-gaming-pas-cher-pour-noel-ce-hp-victus-15-avec-une-rtx-4060-est-a-un-super-prix-chez-boulanger</link>
      <pubDate>Tue, 16 Dec 2025 10:03:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2911143_un-bon-laptop-gaming-pas-cher-pour-noel-ce-hp-victus-15-avec-une-rtx-4060-est-a-un-super-prix-chez-boulanger</guid>
      <description>
Le HP Victus 15-fa1016nf est un PC gaming milieu de gamme avec une solide configuration que vous retrouvez sur Boulanger pour 649,99 euros au lieu de 899,99 euros.
</description>
    </item>
    <item>
      <title>Apple Watch chez Free&#160;: l&#8217;option eSIM est enfin l&#224; (et il y a une surprise)</title>
      <link>https://www.01net.com/actualites/apple-watch-chez-free-loption-esim-est-enfin-la-et-il-y-a-une-surprise.html</link>
      <pubDate>Tue, 16 Dec 2025 10:02:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315526</guid>
      <description>C&#8217;est officiel : Free Mobile lance l&#8217;eSIM pour Apple Watch et, contrairement &#224; la concurrence, l&#8217;option est incluse sans surco&#251;t dans les forfaits.</description>
    </item>
    <item>
      <title>The best mobile microphones for 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-mobile-microphones-for-recording-with-a-phone-154536629.html?src=rss</link>
      <pubDate>Tue, 16 Dec 2025 10:01:25 +0000</pubDate>
      <guid isPermaLink="false">07c9467f-8fa0-4b32-9633-399c841713e5</guid>
      <description>There&#8217;s nothing more frustrating than shooting the perfect reel only to realize that the audio sounds like garbage. For budding creators, it&#8217;s a frustration; for those looking to make more professional content, it&#8217;s a dealbreaker. Fortunately, the world of mobile-specific (or phone-friendly) microphones has exploded with great options in the last few years. Whether you&#8217;ve been tasked with recording candid moments at a relative&#8217;s wedding, shooting a friend&#8217;s dance moves or are a journalist out in the field traveling light &#8212; there&#8217;s an option out there that will be perfect for you.We&#8217;ve tested a...</description>
    </item>
    <item>
      <title>CEOs Want to Keep Pouring Money Into AI, Despite Weak Returns: Survey</title>
      <link>https://gizmodo.com/ceos-want-to-keep-pouring-money-into-ai-despite-weak-returns-survey-2000700007</link>
      <pubDate>Tue, 16 Dec 2025 10:00:38 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000700007</guid>
      <description>Most executives say their AI projects aren&#8217;t delivering returns, but nearly 70% still plan to spend more next year.</description>
    </item>
    <item>
      <title>Voici nos 4 voitures &#233;lectriques pr&#233;f&#233;r&#233;es de l&#8217;ann&#233;e 2025 parmi 31 mod&#232;les</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2910461_voici-nos-4-voitures-electriques-preferees-de-lannee-2025-parmi-31-modeles</link>
      <pubDate>Tue, 16 Dec 2025 10:00:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2910461_voici-nos-4-voitures-electriques-preferees-de-lannee-2025-parmi-31-modeles</guid>
      <description>
Lors de notre &#233;mission Twitch Survolt&#233;s sp&#233;ciale fin d&#8217;ann&#233;e, nous avons d&#233;voil&#233; nos 4 voitures &#233;lectriques pr&#233;f&#233;r&#233;es de 2025. Nous avons &#233;galement class&#233; 31 voitures &#233;lectriques test&#233;es ou lanc&#233;es au cours de ce mill&#233;sime. Voici la liste compl&#232;te.
</description>
    </item>
    <item>
      <title>Inside the evolving role of philanthropy in a time of uncertainty and crisis</title>
      <link>https://www.fastcompany.com/91459949/inside-the-evolving-role-of-philanthropy-in-a-time-of-uncertainty-and-crisis</link>
      <pubDate>2025-12-16T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91459949/inside-the-evolving-role-of-philanthropy-in-a-time-of-uncertainty-and-crisis</guid>
      <description>Knight Foundation President and CEO Maribel P&#233;rez Wadsworth on why philanthropic organizations must learn to move at the speed of the news cycle.&#160;
When the U.S. government cut funding for local news stations, the Knight Foundation moved quickly to help stabilize a rapidly eroding industry. President and CEO Maribel P&#233;rez Wadsworth unpacks the evolving roles of philanthropy and government, and why philanthropic organizations must learn to move at the speed of the news cycle.&#160;...</description>
    </item>
    <item>
      <title>AI isn&#8217;t delivering returns&#8212;but that&#8217;s not stopping CEOs from throwing money at it</title>
      <link>https://www.fastcompany.com/91460540/ai-productivity-gains-efficiency</link>
      <pubDate>2025-12-16T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91460540/ai-productivity-gains-efficiency</guid>
      <description>A survey by Teneo delivers some surprising truths about the efficiency gains derived from these new technologies.
An increasing number of companies are finding the much-promised financial gains of implementing artificial intelligence in the workplace have been slow to materialize. But that isn&#8217;t stopping many CEOs from spending even more on AI in the coming year....</description>
    </item>
    <item>
      <title>Trump wants tiny cars in America. Do drivers?</title>
      <link>https://www.fastcompany.com/91460703/trump-wants-tiny-cars-in-america-do-drivers</link>
      <pubDate>2025-12-16T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91460703/trump-wants-tiny-cars-in-america-do-drivers</guid>
      <description>Trump says he loves &#8220;cute&#8221; Japanese kei cars, Fiat plans to bring its tiny Topolino to the U.S., and there&#8217;s signs of growing consumer demand. Are Americans actually ready to shrink their cars?
The tiny Fiat Topolino&#8212;about the length of a cargo bike and half as long as an American SUV or pickup&#8212;is the kind of car tourists stop to photograph as a cute curiosity in Rome or Milan. The electric car only travels 28 miles an hour, and it&#8217;s designed for dense European cities. But it also only costs around $10,000, and Fiat is now betting that Americans are ready for something this tiny....</description>
    </item>
    <item>
      <title>How to watch Knicks vs. Spurs in the NBA Cup final online for free</title>
      <link>https://mashable.com/article/knicks-spurs-nba-cup-final-2025-live-stream-for-free</link>
      <pubDate>Tue, 16 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">019vcjrkgdY0pH1TKO0deXI</guid>
      <description>How to watch NBA for free. Live stream New York Knicks vs. San Antonio Spurs in the NBA Cup final for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Scientists suspect this scorched alien planet with a sunlike star has air</title>
      <link>https://mashable.com/article/james-webb-space-telescope-exoplanet-sunlike-star-potential-atmosphere</link>
      <pubDate>Tue, 16 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">05HFdst96IuNPrhRljZj43m</guid>
      <description>Exoplanet TOI-561 b, which orbits a star similar to the sun, may still have an atmosphere, despite orbiting extremely close to its host.</description>
    </item>
    <item>
      <title>Save on refurbished Apple and gaming tech in Back Markets 72-hour flash sale</title>
      <link>https://mashable.com/article/dec-16-back-market-flash-sale</link>
      <pubDate>Tue, 16 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">03KMy5CdvGpUnqYwIzNX9UR</guid>
      <description>From Dec. 16-18, Back Market is running a 72-hour flash sale on refurbushed tech. Mashable readers can enjoy limited promo codes on select refurbished Apple and gaming devices.</description>
    </item>
    <item>
      <title>Show your PC some love with this $30 Microsoft Office license</title>
      <link>https://mashable.com/article/dec-16-microsoft-office-professional-plus-2019-for-windows</link>
      <pubDate>Tue, 16 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">07raWERzeNyx90PYuui9Fux</guid>
      <description>Spoil your PC this holiday season with this Microsoft Office Professional Plus 2019 for Windows license, now just $29.97 (reg. $229).</description>
    </item>
    <item>
      <title>This AI tool is a content creator&#8217;s best friend, and now it&#8217;s just $60 for life</title>
      <link>https://mashable.com/article/dec-16-ai-magicx-rune-plan-lifetime-subscription</link>
      <pubDate>Tue, 16 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">05tRGDgluhnhSYkcgEum759</guid>
      <description>Creatives can get a leg up with this lifetime subscription to the AI Magicx Rune Plan, not just $59.97 (reg. $972) through Jan. 11.</description>
    </item>
    <item>
      <title>How to watch Troy vs. Jackson State online for free</title>
      <link>https://mashable.com/article/troy-jackson-state-college-football-2025-live-stream-for-free</link>
      <pubDate>Tue, 16 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">004fXLY5u38wDAzbz2CVxt3</guid>
      <description>How to watch college football for free. Live stream Troy vs. Jackson State in 2025 without cable.</description>
    </item>
    <item>
      <title>How to watch the 2025-26 Ashes online for free</title>
      <link>https://mashable.com/article/the-ashes-live-stream-for-free</link>
      <pubDate>Tue, 16 Dec 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00Yaq6FSTrq39LbcVl2eVzs</guid>
      <description>How to watch The Ashes for free. Live stream the 2025-26 Ashes series for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Jimmy Kimmel slams Trump for his response to the death of Rob Reiner</title>
      <link>https://mashable.com/video/jimmy-kimmel-trump-rob-reiner</link>
      <pubDate>Tue, 16 Dec 2025 09:59:53 +0000</pubDate>
      <guid isPermaLink="false">03sIJRPnyVd8vBIBrjo7bJF</guid>
      <description>Jimmy Kimmel has responded to Trump's Truth Social post about the death of Rob Reiner and his wife Michele.</description>
    </item>
    <item>
      <title>Team Cherry details Hollow Knight: Silksong expansion and a Switch 2 Edition of the original Hollow Knight</title>
      <link>https://www.techradar.com/gaming/team-cherry-details-hollow-knight-silksong-expansion-and-a-switch-2-edition-of-the-original-hollow-knight</link>
      <pubDate>Tue, 16 Dec 2025 09:54:50 +0000</pubDate>
      <guid isPermaLink="false">ukMLeiryQSCGf4Bkvy7bzk</guid>
      <description>Hollow Knight: Silksong's first expansion &#8212; Sea of Sorrow &#8212; is coming next year alongside a Switch 2 Edition of the original game. Here's what you need to know.</description>
    </item>
    <item>
      <title>Review: The Beats Powerbeats Fit are mid-range buds unconvincingly disguised as high-end buds</title>
      <link>https://mashable.com/review/beats-powerbeats-fit</link>
      <pubDate>Tue, 16 Dec 2025 09:53:37 +0000</pubDate>
      <guid isPermaLink="false">03zgjszXS2orFasJ0JIKmMp</guid>
      <description>Beats' Powerbeats Fit earbuds are a confusing new model that falls short in key areas. They're decent earbuds, but not upgrade-worthy.</description>
    </item>
    <item>
      <title>Our 15 favorite Lego sets, sourced from actual Lego fans</title>
      <link>https://mashable.com/article/favorite-lego-sets-2025</link>
      <pubDate>Tue, 16 Dec 2025 09:51:13 +0000</pubDate>
      <guid isPermaLink="false">01dt0sm5QYnm0Bda4P5ECWj</guid>
      <description>Looking for a new Lego set for adults, kids, or adults who still feel like kids? Let our favorite building kits from actual Lego enthusiasts guide the way.</description>
    </item>
    <item>
      <title>&#171; C&#8217;est la douche froide &#187; : la r&#233;vision de sa voiture &#233;lectrique lui co&#251;te 1 200 &#8364;, c&#8217;est deux fois plus cher que dans une autre concession</title>
      <link>https://www.frandroid.com/marques/smart/2911133_cest-la-douche-froide-la-revision-de-sa-voiture-electrique-lui-coute-1-200-e-cest-deux-fois-plus-cher-que-dans-une-autre-concession</link>
      <pubDate>Tue, 16 Dec 2025 09:50:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/smart/2911133_cest-la-douche-froide-la-revision-de-sa-voiture-electrique-lui-coute-1-200-e-cest-deux-fois-plus-cher-que-dans-une-autre-concession</guid>
      <description>
Un propri&#233;taire de Smart #1 a re&#231;u un devis &#224; plus de 1 200 euros pour la r&#233;vision de sa voiture &#233;lectrique. Un tarif hallucinant, qui varie cependant en fonction des concessions.
</description>
    </item>
    <item>
      <title>L&#226;ch&#233; par Volvo, c&#8217;est la faillite pour ce fabricant d&#8217;un capteur qu&#8217;Elon Musk d&#233;teste : bient&#244;t la fin des LiDAR ?</title>
      <link>https://www.frandroid.com/marques/volvo/2911085_lache-par-volvo-cest-la-faillite-pour-ce-fabricant-dun-capteur-quelon-musk-deteste-bientot-la-fin-des-lidar</link>
      <pubDate>Tue, 16 Dec 2025 09:47:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volvo/2911085_lache-par-volvo-cest-la-faillite-pour-ce-fabricant-dun-capteur-quelon-musk-deteste-bientot-la-fin-des-lidar</guid>
      <description>
L'entreprise Luminar, qui fournissait des LiDAR pour la conduite semi-autonome des voitures &#233;lectriques de Volvo, vient de se placer en faillite apr&#232;s avoir perdu le contrat avec la marque su&#233;doise. De quoi se questionner sur l'utilit&#233; de cet &#233;quipement, ha&#239; par Elon Musk ?
</description>
    </item>
    <item>
      <title>The OnePlus Turbo has been teased &#8211; and it might include an astonishingly big battery</title>
      <link>https://www.techradar.com/phones/oneplus-phones/the-oneplus-turbo-has-been-teased-and-it-might-include-an-astonishingly-big-battery</link>
      <pubDate>Tue, 16 Dec 2025 09:44:59 +0000</pubDate>
      <guid isPermaLink="false">noQjoS3iGwz8K9b38hrqJZ</guid>
      <description>OnePlus has announced the OnePlus Turbo line, highlighting strong performance and battery life.</description>
    </item>
    <item>
      <title>HBO Max copie la t&#233;l&#233; : cette nouvelle fonction veut changer vos soir&#233;es zapping</title>
      <link>https://www.frandroid.com/services/svod/2911101_hbo-max-copie-la-tele-cette-nouvelle-fonction-veut-changer-vos-soirees-zapping</link>
      <pubDate>Tue, 16 Dec 2025 09:38:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2911101_hbo-max-copie-la-tele-cette-nouvelle-fonction-veut-changer-vos-soirees-zapping</guid>
      <description>
HBO Max lance des cha&#238;nes th&#233;matiques, une nouvelle mani&#232;re d'acc&#233;der rapidement &#224; un programme sans avoir &#224; faire d&#233;filer l'ensemble du catalogue. 
</description>
    </item>
    <item>
      <title>Facebook Messenger ne fonctionne plus sur ces appareils</title>
      <link>https://www.01net.com/actualites/facebook-messenger-fonctionne-plus-sur-ces-appareils.html</link>
      <pubDate>Tue, 16 Dec 2025 09:37:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315496</guid>
      <description>Facebook Messenger ne fonctionne d&#233;sormais plus sur certains appareils. Meta a mis fin &#224; des applications utilis&#233;es depuis des ann&#233;es, apr&#232;s avoir pr&#233;venu les utilisateurs en amont.</description>
    </item>
    <item>
      <title>What&#8217;s the strategic logic of the Netflix-Warner Bros. deal?</title>
      <link>https://www.fastcompany.com/91460634/warner-bros-netflix-deal-strategic-logic</link>
      <pubDate>2025-12-16T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91460634/warner-bros-netflix-deal-strategic-logic</guid>
      <description>Not another trainwreck, but hardly an unalloyed good.
Here we go again! For the third time within a quarter century, the Warner Bros. studio assets have been acquired for more than $70 billion. Since I commented very sharply on the first two, lots of people are asking me my thoughts on the just-announced purchase of Warner Bros. by Netflix. I provide my response in this Playing to Win/Practitioner Insights (PTW/PI) piece. And as always, you can find all the previous PTW/PI here....</description>
    </item>
    <item>
      <title>Samsung arr&#234;te-t-il vraiment les SSD grand public au profit de l&#8217;IA ? Le constructeur brise le silence</title>
      <link>https://www.frandroid.com/marques/samsung/2911231_samsung-arrete-t-il-vraiment-les-ssd-grand-public-au-profit-de-lia-le-constructeur-brise-le-silence</link>
      <pubDate>Tue, 16 Dec 2025 09:28:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2911231_samsung-arrete-t-il-vraiment-les-ssd-grand-public-au-profit-de-lia-le-constructeur-brise-le-silence</guid>
      <description>
Samsung d&#233;ment l'arr&#234;t de production des SSD pour le grand public apr&#232;s qu'une rumeur insistante a fait le tour d'internet ces derniers jours.
</description>
    </item>
    <item>
      <title>Bonne nouvelle pour l&#8217;autonomie r&#233;elle du moins cher des Tesla Model Y</title>
      <link>https://www.frandroid.com/marques/tesla/2911091_bonne-nouvelle-pour-lautonomie-reelle-du-moins-cher-des-tesla-model-y</link>
      <pubDate>Tue, 16 Dec 2025 09:25:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2911091_bonne-nouvelle-pour-lautonomie-reelle-du-moins-cher-des-tesla-model-y</guid>
      <description>
D&#233;voil&#233;e en octobre 2025, la Tesla Model Y standard a r&#233;cemment &#233;t&#233; test&#233;e par un site am&#233;ricain. Et bonne nouvelle, l&#8217;autonomie s&#8217;est r&#233;v&#233;l&#233;e sup&#233;rieure &#224; celle ayant &#233;t&#233; annonc&#233;e par le constructeur pour la voiture &#233;lectrique abordable.
</description>
    </item>
  </channel>
</rss>
