<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 02 Dec 2025 16:58:43 GMT</lastBuildDate>
    <item>
      <title>OpenAI&#8217;s &#8216;Code Red&#8217; Crisis Memo Teases New Model and Ads in ChatGPT</title>
      <link>https://gizmodo.com/openais-code-red-crisis-memo-teases-new-model-and-ads-in-chatgpt-2000694482</link>
      <pubDate>Tue, 02 Dec 2025 16:55:39 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000694482</guid>
      <description>Sam Altman is scared.</description>
    </item>
    <item>
      <title>Apple Music Replay 2025 is back with new listening stats</title>
      <link>https://www.theverge.com/news/836613/apple-music-replay-2025-listening-stats-launch</link>
      <pubDate>2025-12-02T11:48:11-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=836613</guid>
      <description>Apple Music is getting ahead of Spotify Wrapped with the launch of its yearly recaps. This year&#8217;s Apple Music Replay is available natively within the app and comes packed with even more listening stats, allowing you to review all the new artists you listened to, which ones you kept returning to, and who made a [&#8230;]</description>
    </item>
    <item>
      <title>Voici la premi&#232;re station-service sans pompe &#224; essence en France, et c&#8217;est une petite r&#233;volution</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2895815_voici-la-premiere-station-service-sans-pompe-a-essence-en-france-et-cest-une-petite-revolution</link>
      <pubDate>Tue, 02 Dec 2025 16:48:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2895815_voici-la-premiere-station-service-sans-pompe-a-essence-en-france-et-cest-une-petite-revolution</guid>
      <description>
En Bretagne, l'entreprise n&#233;erlandaise Fastned va inaugurer en 2026 une station-service d'un nouveau genre : sans une goutte d'essence et uniquement r&#233;serv&#233;e aux voitures &#233;lectriques avec la pr&#233;sence de bornes de recharge.
</description>
    </item>
    <item>
      <title>Get your Christmas shopping done early with these cheap stocking filler gifts for gamers</title>
      <link>https://www.techradar.com/gaming/get-your-christmas-shopping-done-early-with-these-cheap-stocking-filler-gifts-for-gamers</link>
      <pubDate>Tue, 02 Dec 2025 16:44:12 +0000</pubDate>
      <guid isPermaLink="false">AV4gGQGmXhDqE7Z6KP4qSm</guid>
      <description>Load up your Christmas stockings with these excellent deals on gifts for gamers.</description>
    </item>
    <item>
      <title>3 new Apple TV movies and shows to watch in December 2025</title>
      <link>https://www.techradar.com/streaming/apple-tv-plus/new-apple-tv-movies-and-shows-in-december-2025</link>
      <pubDate>Tue, 02 Dec 2025 16:43:46 +0000</pubDate>
      <guid isPermaLink="false">NF9jtqD3WyyKsiLFK2tLHX</guid>
      <description>From the streaming debut of a blockbuster hit to the cutest nature docuseries ever, here are the three new Apple TV movies and shows releasing in December 2025.</description>
    </item>
    <item>
      <title>OpenAI slammed for app suggestions that looked like ads</title>
      <link>https://techcrunch.com/2025/12/02/openai-slammed-for-app-suggestions-that-looked-like-ads/</link>
      <pubDate>Tue, 02 Dec 2025 16:43:21 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3071740</guid>
      <description>OpenAI said the app suggestion was only a test and not a paid ad.</description>
    </item>
    <item>
      <title>Discord users can now buy in-game items without leaving the platform</title>
      <link>https://techcrunch.com/2025/12/02/discord-users-can-now-buy-in-game-items-without-leaving-the-platform/</link>
      <pubDate>Tue, 02 Dec 2025 16:42:31 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3071764</guid>
      <description>Discord users can now purchase digital game items directly within the platform, create wishlists, and send gifts through DMs.</description>
    </item>
    <item>
      <title>I&#8217;ve picked the best Cyber Monday TV deals still going, including some of the top TVs I&#8217;ve personally tested this year</title>
      <link>https://www.techradar.com/televisions/ive-picked-the-best-cyber-monday-tv-deals-still-going-including-some-of-the-top-tvs-ive-personally-tested-this-year</link>
      <pubDate>Tue, 02 Dec 2025 16:39:54 +0000</pubDate>
      <guid isPermaLink="false">xNi2DYPG5eEdHb9b3YxJLU</guid>
      <description>Cyber Monday is done, but some of the best TVs I've tested still have great deals.</description>
    </item>
    <item>
      <title>Android sur SteamOS et Linux : Valve sort l&#8217;artillerie lourde avec le projet Lepton</title>
      <link>https://www.frandroid.com/android/2896131_android-sur-steamos-et-linux-valve-sort-lartillerie-lourde-avec-le-projet-lepton</link>
      <pubDate>Tue, 02 Dec 2025 16:38:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/2896131_android-sur-steamos-et-linux-valve-sort-lartillerie-lourde-avec-le-projet-lepton</guid>
      <description>
Vous connaissez Proton, l'outil magique qui fait tourner Cyberpunk 2077 sur votre Steam Deck ? Pr&#233;parez-vous &#224; accueillir Lepton. Valve adapte la technologie Waydroid pour int&#233;grer l'&#233;cosyst&#232;me Android directement dans Steam. Une grenouille en logo, des fichiers de configuration rep&#233;r&#233;s : le plan de Valve se dessine.
</description>
    </item>
    <item>
      <title>Les voitures &#233;lectriques de Huawei sont pr&#234;tes pour arriver en Europe : la preuve avec cette photo vol&#233;e</title>
      <link>https://www.frandroid.com/marques/aito/2895881_les-voitures-electriques-de-huawei-sont-pretes-pour-arriver-en-europe-la-preuve-avec-cette-photo-volee</link>
      <pubDate>Tue, 02 Dec 2025 16:38:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/aito/2895881_les-voitures-electriques-de-huawei-sont-pretes-pour-arriver-en-europe-la-preuve-avec-cette-photo-volee</guid>
      <description>
Des images espion r&#233;cemment apparues sur la toile l&#232;vent le voile sur la version internationale du syst&#232;me d'infodivertissement du nouvel Aito M9. Au-del&#224; d&#8217;un simple changement de langue, Huawei semble avoir profond&#233;ment repens&#233; son &#233;cosyst&#232;me num&#233;rique pour r&#233;pondre aux normes, aux habitudes et aux services attendus hors de Chine.
</description>
    </item>
    <item>
      <title>Anker&#8217;s new desktop docking station has a removable USB-C hub you can take with you</title>
      <link>https://www.theverge.com/news/836550/anker-nano-docking-station-removable-hub-usb-c-hdmi-displayport</link>
      <pubDate>2025-12-02T11:37:27-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=836550</guid>
      <description>Anker has released a new docking station that eliminates the&#160; problem of having to choose between portability and a plethora of ports. The 13-in-1 Anker Nano Docking Station includes various USB and video ports so you can quickly connect a laptop to multiple monitors, but its most useful feature is a small, portable USB-C hub [&#8230;]</description>
    </item>
    <item>
      <title>The Switch 2 is still on sale at Walmart if you missed out during Cyber Monday</title>
      <link>https://www.theverge.com/gadgets/836519/nintendo-switch-2-mario-kart-world-bundle-walmart-deal</link>
      <pubDate>2025-12-02T11:37:20-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=836519</guid>
      <description>One of the biggest surprises of Cyber Monday was the excellent discount we saw on the Nintendo Switch 2 + Mario Kart World bundle, which dropped the price of Nintendo&#8217;s latest console by $50. We expected the price to return to normal once the shopping holiday ended, but &#8212; surprise, surprise &#8212; it&#8217;s still going [&#8230;]</description>
    </item>
    <item>
      <title>YouTube releases its first-ever recap of videos you&#8217;ve watched</title>
      <link>https://techcrunch.com/2025/12/02/youtube-releases-its-first-ever-recap-of-videos-youve-watched/</link>
      <pubDate>Tue, 02 Dec 2025 16:35:05 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3071727</guid>
      <description>YouTube Recap features a set of up to 12 different cards that highlight a user's top channels, interests, the evolution of their viewing habits, and which personality type they fall into based on the videos they loved to watch.</description>
    </item>
    <item>
      <title>I've fallen in love with the GoChess smart chess board, and it's currently on sale</title>
      <link>https://www.techradar.com/tech/ive-fallen-in-love-with-the-gochess-smart-chess-board-and-its-currently-on-sale</link>
      <pubDate>Tue, 02 Dec 2025 16:33:43 +0000</pubDate>
      <guid isPermaLink="false">B8L3RJ2vpNr279daUcvD3P</guid>
      <description>This smart chess set is helping me improve my chess game, and it's still on sale after Cyber Monday.</description>
    </item>
    <item>
      <title>Cyberespionnage sur Chrome&#160;: des extensions malveillantes ont pirat&#233; 4,3 millions d&#8217;internautes &#224; l&#8217;insu de Google</title>
      <link>https://www.01net.com/actualites/cyberespionnage-chrome-extensions-malveillantes-pirate-43-millions-internautes-insu-google.html</link>
      <pubDate>Tue, 02 Dec 2025 16:33:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313140</guid>
      <description>Pendant sept ans, une entit&#233; pirate intitul&#233;e ShadyPanda a transform&#233; 145 extensions Chrome et Edge en v&#233;ritables logiciels espions. Au terme de leur mutation, les extensions &#233;taient capables de siphonner l'historique, les cookies et les recherches des internautes.</description>
    </item>
    <item>
      <title>A data breach at analytics giant Mixpanel leaves a lot of open questions</title>
      <link>https://techcrunch.com/2025/12/02/a-data-breach-at-analytics-giant-mixpanel-leaves-a-lot-of-open-questions/</link>
      <pubDate>Tue, 02 Dec 2025 16:30:52 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3071743</guid>
      <description>We sent over a dozen questions to Mixpanel's CEO about the company's data breach. Here's what we want to know.</description>
    </item>
    <item>
      <title>Ugreen Nexode 130 W : cette petite batterie &#224; -38 %, parfaite pour les baroudeurs, vous suivra partout avec ses 20 000 mAh</title>
      <link>https://www.frandroid.com/bons-plans/2895825_ugreen-nexode-130-w-cette-petite-batterie-a-38-parfaite-pour-les-baroudeurs-vous-suivra-partout-avec-ses-20-000-mah</link>
      <pubDate>Tue, 02 Dec 2025 16:29:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2895825_ugreen-nexode-130-w-cette-petite-batterie-a-38-parfaite-pour-les-baroudeurs-vous-suivra-partout-avec-ses-20-000-mah</guid>
      <description>
La Ugreen Nexode c'est le genre de batterie externe qui fait office d'investissement, elle est pratique, mobile et permet de recharger avec une charge rapide plusieurs appareils. Sur Amazon, elle s'affiche &#224; 49,99 euros au lieu de 79,99 euros.
</description>
    </item>
    <item>
      <title>AWS re:Invent 2025: How to watch and follow along live</title>
      <link>https://techcrunch.com/2025/12/02/aws-reinvent-2025-how-to-watch-and-follow-along-live/</link>
      <pubDate>Tue, 02 Dec 2025 16:24:51 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3071552</guid>
      <description>Amazon Web Services&#8217; big annual event, re:Invent 2025, is getting into full swing in Las Vegas this week, and you can follow the keynotes live right here.</description>
    </item>
    <item>
      <title>YouTube s&#8217;inspire enfin de la meilleure id&#233;e de Spotify avec YouTube Recap : comment y acc&#233;der</title>
      <link>https://www.frandroid.com/marques/google/2896099_youtube-sinspire-enfin-de-la-meilleure-idee-de-spotify-avec-youtube-recap-comment-y-acceder</link>
      <pubDate>Tue, 02 Dec 2025 16:24:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2896099_youtube-sinspire-enfin-de-la-meilleure-idee-de-spotify-avec-youtube-recap-comment-y-acceder</guid>
      <description>
YouTube propose enfin un r&#233;sum&#233; de son ann&#233;e sur la plateforme. Un r&#233;cap demand&#233; depuis longtemps par les fans. 
</description>
    </item>
    <item>
      <title>Ninja kitchen appliances are going cheap post-Cyber Monday &#8211; great deals on the Creami, Crispi, and more</title>
      <link>https://www.techradar.com/home/small-appliances/ninja-kitchen-appliances-are-going-cheap-post-cyber-monday-great-deals-on-the-creami-crispi-and-more</link>
      <pubDate>Tue, 02 Dec 2025 16:24:14 +0000</pubDate>
      <guid isPermaLink="false">hy7kGdZVRKSrmu2BC8V5nY</guid>
      <description>There are still record-breaking deals on Ninja appliances, and some prices are even better now than they were on Black Friday.</description>
    </item>
    <item>
      <title>Amazon starts testing &#8216;ultra-fast&#8217; 30-minute deliveries</title>
      <link>https://techcrunch.com/2025/12/02/amazon-starts-testing-ultra-fast-30-minute-deliveries/</link>
      <pubDate>Tue, 02 Dec 2025 16:20:26 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3071738</guid>
      <description>The new "ultra-fast" delivery option will allow Amazon to better compete with services like DoorDash, Uber Eats, and Instacart.</description>
    </item>
    <item>
      <title>Personne n&#8217;a r&#233;ussi &#224; copier WeChat hors de Chine : pourquoi Elon Musk pense y arriver avec X</title>
      <link>https://www.frandroid.com/culture-tech/economie/2896097_personne-na-reussi-a-copier-wechat-hors-de-chine-pourquoi-elon-musk-pense-y-arriver-avec-x</link>
      <pubDate>Tue, 02 Dec 2025 16:15:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/economie/2896097_personne-na-reussi-a-copier-wechat-hors-de-chine-pourquoi-elon-musk-pense-y-arriver-avec-x</guid>
      <description>
Dans une interview r&#233;cente, Elon Musk a r&#233;affirm&#233; son objectif final : transformer X en une copie am&#233;lior&#233;e de WeChat. Il veut recr&#233;er le succ&#232;s ph&#233;nom&#233;nal de l'application chinoise &#224; l'&#233;chelle mondiale. Sauf que copier une anomalie culturelle chinoise pour l'imposer &#224; l'Occident, c'est un d&#233;fi que personne n'a relev&#233;.
</description>
    </item>
    <item>
      <title>How to watch Dancing With The Holidays on Fubo (it's free)</title>
      <link>https://www.techradar.com/how-to-watch/how-to-watch-dancing-with-the-holidays-on-fubo-its-free</link>
      <pubDate>Tue, 02 Dec 2025 16:10:40 +0000</pubDate>
      <guid isPermaLink="false">4AK3Srsao5F9iL2qZd5gvV</guid>
      <description>Here's how to watch Dancing With The Holidays online, from anywhere and for free on Fubo as the DWTS Christmas special airs on ABC in the US.</description>
    </item>
    <item>
      <title>#FrandroidOffreMoi un super trio Xbox (casque, manette et 3 mois Game Pass Ultimate)</title>
      <link>https://www.frandroid.com/humanoid/concours/2893107_frandroidoffremoi-un-super-trio-xbox-casque-manette-et-3-mois-game-pass-ultimate</link>
      <pubDate>Tue, 02 Dec 2025 16:05:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/concours/2893107_frandroidoffremoi-un-super-trio-xbox-casque-manette-et-3-mois-game-pass-ultimate</guid>
      <description>
On est au deuxi&#232;me jour du calendrier de l'Avent 2025 de Frandroid. Dans le cadre du concours, vous pouvez remporter un joli lot Xbox avec une manette en &#233;dition sp&#233;ciale, un casque sans fil et 3 mois au Game Pass Ultimate.
</description>
    </item>
    <item>
      <title>Cyber Monday may be over, but the best value Garmin deal of all is still live right now</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/cyber-monday-may-be-over-but-the-best-value-garmin-deal-of-all-is-still-live-right-now</link>
      <pubDate>Tue, 02 Dec 2025 16:04:07 +0000</pubDate>
      <guid isPermaLink="false">fmemHqZzXfj9rQuXk7FoKV</guid>
      <description>The Garmin Epix Pro (Gen 2) is actually the best value Garmin Watch you can buy, and it's still on offer for Cyber Monday.</description>
    </item>
    <item>
      <title>Vous ne devinerez jamais &#224; quoi sert ce nouvel accessoire Kobo</title>
      <link>https://www.01net.com/actualites/vous-ne-devinerez-jamais-a-quoi-sert-ce-nouvel-accessoire-kobo.html</link>
      <pubDate>Tue, 02 Dec 2025 16:03:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313185</guid>
      <description>Kobo pr&#233;sente une t&#233;l&#233;commande Bluetooth sobre et ergonomique pour liseuses.
Elle permet de tourner les pages sans effort, pour une lecture confortable m&#234;me allong&#233;. Elle co&#251;te la bagatelle de 29,99 euros.</description>
    </item>
    <item>
      <title>DC Comics&#8217; Festive &#8216;Sweater Weather&#8217; Covers Are a Real Winter Warmer (Exclusive)</title>
      <link>https://gizmodo.com/dc-comics-sweater-weather-variant-covers-batman-nightwing-superman-wonder-woman-2000694494</link>
      <pubDate>Tue, 02 Dec 2025 16:00:24 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000694494</guid>
      <description>Feeling the chill of the season? io9's got your first look at DC's steamy seasonal comics covers to get you nice and cozy.</description>
    </item>
    <item>
      <title>Diseased Baby Ants Ask Their Nestmates to Poison Them With Acid to Protect the Colony, Study Finds</title>
      <link>https://gizmodo.com/diseased-baby-ants-ask-their-nestmates-to-poison-them-with-acid-to-protect-the-colony-study-finds-raised_hands-1-2000694317</link>
      <pubDate>Tue, 02 Dec 2025 16:00:12 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000694317</guid>
      <description>Ant pupae might be less selfish than most humans.</description>
    </item>
    <item>
      <title>Amazon Has New Frontier AI Models&#8212;and a Way for Customers to Build Their Own</title>
      <link>https://www.wired.com/story/amazon-nova-forge-ai-models/</link>
      <pubDate>Tue, 02 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">692dd68d13bd25f2902b8cd9</guid>
      <description>Nova Forge lets Amazon&#8217;s customers train frontier models for different tasks&#8212;a potential breakthrough in making AI actually useful for businesses.</description>
    </item>
    <item>
      <title>AWS CEO Matt Garman Wants to Reassert Amazon&#8217;s Cloud Dominance in the AI Era</title>
      <link>https://www.wired.com/story/amazon-aws-ceo-matt-garman-ai-agents/</link>
      <pubDate>Tue, 02 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">6925f839df1bdf320c333823</guid>
      <description>As Google and Microsoft continue to surge, the AWS chief lays out his pitch: cheaper, reliable AI delivered at hyperscale.</description>
    </item>
    <item>
      <title>The best thing I bought this year: a Zippo-sized rechargeable flashlight</title>
      <link>https://www.theverge.com/gadgets/835300/wuben-g5-rechargeable-edc-flashlight-favorite</link>
      <pubDate>2025-12-02T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=835300</guid>
      <description>I was never a Boy Scout, but I have always embraced their &#8220;be prepared&#8221; motto. When I leave the house it&#8217;s never without my everyday carry kit that, among other things, includes wireless earbuds, a small battery, extra glasses &#8212; and a flashlight. In fact, I&#8217;ve long been on the hunt for what I consider [&#8230;]</description>
    </item>
    <item>
      <title>Simular&#8217;s AI agent wants to run your Mac, Windows PC for you</title>
      <link>https://techcrunch.com/2025/12/02/simular-releases-mac-os-ai-agent-raises-21-5m-from-felicis-with-windows-coming-soon/</link>
      <pubDate>Tue, 02 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3071062</guid>
      <description>Simular, a startup building AI agents for Mac OS and Windows, has solved the AI hallucination problem in a compelling way.</description>
    </item>
    <item>
      <title>Amazon releases an impressive new AI chip and teases an Nvidia-friendly roadmap</title>
      <link>https://techcrunch.com/2025/12/02/amazon-releases-an-impressive-new-ai-chip-and-teases-a-nvidia-friendly-roadmap/</link>
      <pubDate>Tue, 02 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3071625</guid>
      <description>AWS has been building its own AI chips &#8211; and systems &#8211; for years now. It just released its third version, known as Trainium3 with some impressive specs.</description>
    </item>
    <item>
      <title>AWS announces new capabilities for its AI agent builder</title>
      <link>https://techcrunch.com/2025/12/02/aws-announces-new-capabilities-for-its-ai-agent-builder/</link>
      <pubDate>Tue, 02 Dec 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3071721</guid>
      <description>AWS is introducing new capabilities for its AI agent building platform, including memory and evaluation tools.</description>
    </item>
    <item>
      <title>La Google Pixel Watch 4 profite de la fin du Black Friday pour baisser de prix</title>
      <link>https://www.frandroid.com/bons-plans/2893591_la-google-pixel-watch-4-profite-de-la-fin-du-black-friday-pour-baisser-de-prix</link>
      <pubDate>Tue, 02 Dec 2025 15:58:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2893591_la-google-pixel-watch-4-profite-de-la-fin-du-black-friday-pour-baisser-de-prix</guid>
      <description>
D&#233;voil&#233;e cet &#233;t&#233;, la Google Pixel Watch 4 est une montre connect&#233;e premium pr&#233;cise, compl&#232;te et qui a m&#234;me b&#233;n&#233;fici&#233; de quelques am&#233;liorations. Et elle affiche enfin un prix r&#233;duit : Amazon et Darty la proposent &#224; 329 euros au lieu de 399 euros.
</description>
    </item>
    <item>
      <title>RAM Costs Have Already Come for the Beloved Raspberry Pi</title>
      <link>https://gizmodo.com/raspberry-pi-price-increase-ram-costs-to-blame-2000694527</link>
      <pubDate>Tue, 02 Dec 2025 15:57:57 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000694527</guid>
      <description>Every single computer, including DIY boards like the Raspberry Pi, will cost more, and it's only going to get worse.</description>
    </item>
    <item>
      <title>OpenAI d&#233;clare l&#8217;alerte rouge : ChatGPT menac&#233; par la mont&#233;e en puissance de Google Gemini</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2896017_openai-declare-lalerte-rouge-chatgpt-menace-par-la-montee-en-puissance-de-google-gemini</link>
      <pubDate>Tue, 02 Dec 2025 15:56:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2896017_openai-declare-lalerte-rouge-chatgpt-menace-par-la-montee-en-puissance-de-google-gemini</guid>
      <description>
L'histoire a le sens de l'ironie. Il y a trois ans, Google d&#233;clenchait une alerte g&#233;n&#233;rale &#224; la sortie de ChatGPT. Aujourd'hui ? C'est l'inverse. Sam Altman vient de d&#233;clarer un "Code Rouge" chez OpenAI. La cause est simple : Gemini 3 Pro est devenu trop dangereux.
</description>
    </item>
    <item>
      <title>Google voudrait afficher le num&#233;ro IMEI de votre smartphone sur l&#8217;&#233;cran de verrouillage, mais pourquoi ?</title>
      <link>https://www.frandroid.com/android/2895757_google-voudrait-afficher-le-numero-imei-de-votre-smartphone-sur-lecran-de-verrouillage-mais-pourquoi</link>
      <pubDate>Tue, 02 Dec 2025 15:50:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/2895757_google-voudrait-afficher-le-numero-imei-de-votre-smartphone-sur-lecran-de-verrouillage-mais-pourquoi</guid>
      <description>
Les smartphones Android pourraient bient&#244;t afficher leur num&#233;ro IMEI directement sur l'&#233;cran de verrouillage. Il y a une logique derri&#232;re ce choix &#233;tonnant.
</description>
    </item>
    <item>
      <title>Windows 11 : la mise &#224; jour qui am&#233;liore le mode sombre fait finalement buguer le mode sombre</title>
      <link>https://www.frandroid.com/marques/microsoft/2895859_windows-11-la-mise-a-jour-qui-ameliore-le-mode-sombre-fait-finalement-buguer-le-mode-sombre</link>
      <pubDate>Tue, 02 Dec 2025 15:50:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2895859_windows-11-la-mise-a-jour-qui-ameliore-le-mode-sombre-fait-finalement-buguer-le-mode-sombre</guid>
      <description>
La derni&#232;re mise &#224; jour de Windows 11 est cens&#233;e am&#233;liorer significativement le mode sombre dans l'Explorateur de fichiers. Probl&#232;me : elle provoque un bug d'affichage du mode sombre dans ce m&#234;me Explorateur.
</description>
    </item>
    <item>
      <title>Tropical Storms Drenched Mars for Millions of Years, Strange Pale Rocks Suggest</title>
      <link>https://gizmodo.com/tropical-storms-drenched-mars-for-millions-of-years-strange-pale-rocks-suggest-2000694536</link>
      <pubDate>Tue, 02 Dec 2025 15:42:29 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000694536</guid>
      <description>NASA's Perseverance rover found rocks on Mars that on Earth usually form in tropical environments.</description>
    </item>
    <item>
      <title>Instagram CEO issues full-time return to office order</title>
      <link>https://www.techradar.com/pro/instagram-ceo-issues-full-time-return-to-office-order</link>
      <pubDate>Tue, 02 Dec 2025 15:39:00 +0000</pubDate>
      <guid isPermaLink="false">f44TvLo2zSiFZk398VxVsJ</guid>
      <description>Instagram workers given a February 2026 deadline to return to the office five days per week.</description>
    </item>
    <item>
      <title>Realme Buds Clip : des &#233;couteurs &#224; clip ouverts pour allier musique et conscience de l&#8217;environnement</title>
      <link>https://www.frandroid.com/marques/realme/2895923_realme-buds-clip-des-ecouteurs-a-clip-ouverts-pour-allier-musique-et-conscience-de-lenvironnement</link>
      <pubDate>Tue, 02 Dec 2025 15:38:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/realme/2895923_realme-buds-clip-des-ecouteurs-a-clip-ouverts-pour-allier-musique-et-conscience-de-lenvironnement</guid>
      <description>
La marque realme enrichit son catalogue audio avec les Buds Clip, ses premiers &#233;couteurs &#224; conception ouverte adoptant un design &#224; clip in&#233;dit pour le fabricant mais d&#233;j&#224; vu chez d&#8217;autres. En voici tous les d&#233;tails.
</description>
    </item>
    <item>
      <title>Some of our favorite Cyber Monday deals are still kicking</title>
      <link>https://www.theverge.com/gadgets/835113/best-cyber-monday-deals-still-available-2025</link>
      <pubDate>2025-12-02T10:37:18-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=835113</guid>
      <description>Here&#8217;s a sad, yet predictable truth: most Black Friday and Cyber Monday deals are gone. But, not all of them have disappeared. In fact, some of the most popular deals, like the discounts on the Oura Ring 4, AirPods 4, and Nintendo Switch 2 are still sitting at their Cyber Monday prices. Although, given the [&#8230;]</description>
    </item>
    <item>
      <title>Mistral closes in on Big AI rivals with new open-weight frontier and small models</title>
      <link>https://techcrunch.com/2025/12/02/mistral-closes-in-on-big-ai-rivals-with-mistral-3-open-weight-frontier-and-small-models/</link>
      <pubDate>Tue, 02 Dec 2025 15:37:07 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3071728</guid>
      <description>Mistral unveils its Mistral 3 lineup, including a frontier model and efficient small models designed for offline, customizable enterprise use&#8212;aiming to prove small, fine-tuned AI can beat closed-source giants.</description>
    </item>
    <item>
      <title>Samsung&#8217;s Galaxy Z TriFold Is Launching in the U.S. in Just a Few Months</title>
      <link>https://gizmodo.com/samsungs-galaxy-z-trifold-us-launch-display-cameras-battery-2000694470</link>
      <pubDate>Tue, 02 Dec 2025 15:35:22 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000694470</guid>
      <description>The 6.5-inch foldable phone, which is also a 10-inch tablet when unfolded, won't be cheap.</description>
    </item>
    <item>
      <title>Cyber week sales are live &#8211; over 100 extended deals from Amazon, Walmart, Best Buy, and more</title>
      <link>https://www.techradar.com/seasonal-sales/cyber-week-sales-are-live-over-100-extended-deals-from-amazon-walmart-best-buy-and-more</link>
      <pubDate>Tue, 02 Dec 2025 15:31:53 +0000</pubDate>
      <guid isPermaLink="false">SkYinSkkVuHxmGZhu2oXT4</guid>
      <description>Black Friday and Cyber Monday might be over, but Cyber Week lives on, and I have all the best deals still available from Amazon, Walmart, Best Buy, and more.</description>
    </item>
    <item>
      <title>Titan OS raises $58 million from Highland Europe for its smart TV OS</title>
      <link>https://techcrunch.com/2025/12/02/titan-os-raises-58-million-from-highland-europe-for-its-smart-tv-os/</link>
      <pubDate>Tue, 02 Dec 2025 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3071691</guid>
      <description>Titan OS aims to expand its independent TV operating system in Europe and Latin America.</description>
    </item>
    <item>
      <title>Why supply chains are the weakest link in today&#8217;s cyber defenses</title>
      <link>https://www.techradar.com/pro/why-supply-chains-are-the-weakest-link-in-todays-cyber-defenses</link>
      <pubDate>Tue, 02 Dec 2025 15:26:35 +0000</pubDate>
      <guid isPermaLink="false">h6uSJMGtKE5ZmTfsus5uja</guid>
      <description>Supply chain security remains one of the most fragile and underestimated aspects of cyber security.</description>
    </item>
    <item>
      <title>Galaxy Tab A11 : d&#233;j&#224; &#224; petit prix, cette nouvelle tablette Samsung avec &#233;cran 90 Hz tombe &#224; seulement 119 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2895531_galaxy-tab-a11-deja-a-petit-prix-cette-nouvelle-tablette-samsung-avec-ecran-90-hz-tombe-a-seulement-119-e</link>
      <pubDate>Tue, 02 Dec 2025 15:26:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2895531_galaxy-tab-a11-deja-a-petit-prix-cette-nouvelle-tablette-samsung-avec-ecran-90-hz-tombe-a-seulement-119-e</guid>
      <description>
La Samsung Galaxy Tab A11 vient de sortir, mais cette tablette au design &#233;pur&#233; et &#224; l'&#233;cran bien fluide a d&#233;j&#224; b&#233;n&#233;fici&#233; de plusieurs promotions depuis. C'est d'ailleurs en ce moment que son prix est vraiment int&#233;ressant : sur Amazon, la version 64 Go peut vous revenir &#224; 119,90 euros au lieu de 179,90 euros.
</description>
    </item>
    <item>
      <title>Apple AirTag, Galaxy SmartTag, Tile&#8230; quel porte-cl&#233; connect&#233; choisir en 2025&#8201;?</title>
      <link>https://www.frandroid.com/guide-dachat/guide-objets-connectes/931077_airtag-galaxy-smarttag-tile-quel-porte-cles-connecte-choisir</link>
      <pubDate>Tue, 02 Dec 2025 15:16:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-objets-connectes/931077_airtag-galaxy-smarttag-tile-quel-porte-cles-connecte-choisir</guid>
      <description>
Les porte-cl&#233;s connect&#233;s sont arriv&#233;s via Apple et Samsung. d'autres marques s'y sont ensuite mises. D&#233;couvrez les meilleurs trackers connect&#233;s pour ne plus rien perdre.
</description>
    </item>
    <item>
      <title>Streaming, IPTV, VPN&#160;: l&#8217;Arcom r&#233;clame le blocage automatis&#233; et imm&#233;diat</title>
      <link>https://www.01net.com/actualites/streaming-iptv-vpn-larcom-reclame-le-blocage-automatise-et-immediat.html</link>
      <pubDate>Tue, 02 Dec 2025 15:14:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313085</guid>
      <description>Face &#224; un manque &#224; gagner colossal de 1,5 milliard d'euros, le r&#233;gulateur juge ses outils actuels d&#233;pass&#233;s. Dans un rapport explosif remis &#224; l'Assembl&#233;e, l'Arcom r&#233;clame l'automatisation des blocages pour le sport et s'attaque aux VPN.</description>
    </item>
    <item>
      <title>It&amp;#8217;s their job to keep AI from destroying everything</title>
      <link>https://www.theverge.com/ai-artificial-intelligence/836335/anthropic-societal-impacts-team-ai-claude-effects</link>
      <pubDate>2025-12-02T10:11:21-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=836335</guid>
      <description>One night in May 2020, during the height of lockdown, Deep Ganguli was worried. Ganguli, then research director at the Stanford Institute for Human-Centered AI, had just been alerted to OpenAI's new paper on GPT-3, its latest large language model. This new AI model was potentially 10 times more advanced than any other of its [&#8230;]</description>
    </item>
    <item>
      <title>Free open-world RPG Where Winds Meet finally hits mobile next week after a successful PC and PS5 launch</title>
      <link>https://www.techradar.com/gaming/mobile-gaming/free-open-world-rpg-where-winds-meet-finally-hits-mobile-next-week-after-a-successful-pc-and-ps5-launch</link>
      <pubDate>Tue, 02 Dec 2025 15:10:31 +0000</pubDate>
      <guid isPermaLink="false">i5jpBiebDBzd4jqzxYY2xj</guid>
      <description>Where Winds Meet launches on mobile next week after a successful PC and console debut.</description>
    </item>
    <item>
      <title>The new paradigm: a concentration of data in AI demands greater vigilance</title>
      <link>https://www.techradar.com/pro/the-new-paradigm-a-concentration-of-data-in-ai-demands-greater-vigilance</link>
      <pubDate>Tue, 02 Dec 2025 15:09:21 +0000</pubDate>
      <guid isPermaLink="false">bpWSrNxVwJXguUn3SycGhf</guid>
      <description>In the age of AI, the most dangerous gap for enterprises lies with data in use &#8212; the moment it is loaded into memory for processing.</description>
    </item>
    <item>
      <title>Apple gadgets, ranked</title>
      <link>https://www.theverge.com/podcast/836441/best-apple-gadgets-vergecast</link>
      <pubDate>2025-12-02T10:07:24-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=836441</guid>
      <description>Apple makes a lot of gadgets. Most of them are very good! You'd frankly be hard-pressed to find a company with a better track record, especially across so many categories. But only one Apple gadget can be the best Apple gadget, and it's time for us to decide which one it is. On this episode [&#8230;]</description>
    </item>
    <item>
      <title>Total car control, simplified! Get 30% off OBDeleven digital subscriptions</title>
      <link>https://www.techradar.com/vehicle-tech/total-car-control-simplified-get-30-percent-off-obdeleven-digital-subscriptions</link>
      <pubDate>Tue, 02 Dec 2025 15:06:17 +0000</pubDate>
      <guid isPermaLink="false">X7iWS3LffrQCZ5dw4vJb7f</guid>
      <description>Get car diagnostic ready thanks to this Cyber Deal at OBDeleven</description>
    </item>
    <item>
      <title>5 tips from financial experts to finish 2025 strong</title>
      <link>https://www.fastcompany.com/91452137/5-expert-tips-financial-experts-finish-2025-strong</link>
      <pubDate>2025-12-02T15:03:04</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91452137/5-expert-tips-financial-experts-finish-2025-strong</guid>
      <description>Christine Benz of Morningstar outlines key financial strategies.
As 2025 winds down, here are some moves to help you finish the year strong financially. Morningstar&#8217;s director of personal finance and retirement planning, Christine Benz, discusses strategies.This interview has been edited for length and clarity.</description>
    </item>
    <item>
      <title>The Perfect Holiday Gifts for Your Festive Fandom</title>
      <link>https://gizmodo.com/best-nerdy-christmas-gifts-2025-decorations-clothing-2000685545</link>
      <pubDate>Tue, 02 Dec 2025 15:00:23 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000685545</guid>
      <description>'Tis the season to be jolly, and you can get into the geeky spirit with these must-have gifts and decorations for the festive nerd in your life.</description>
    </item>
    <item>
      <title>30 practical smart home gifts that make everyday life a little easier</title>
      <link>https://www.theverge.com/gadgets/800449/best-practical-smart-home-gift-ideas-2025</link>
      <pubDate>2025-12-02T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=800449</guid>
      <description>Smart home products are all about making everyday life a little easier, which is why they're some of the best and most thoughtful gifts you can give. Some people go all out building a multi-gadget IoT kingdom (like our resident smart home expert, Jen Pattison Tuohy), but a smart home is whatever your recipient wants [&#8230;]</description>
    </item>
    <item>
      <title>Metroid Prime 4 excels when it&amp;#8217;s actually being Metroid</title>
      <link>https://www.theverge.com/games/835325/metroid-prime-4-review-nintendo-switch</link>
      <pubDate>2025-12-02T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=835325</guid>
      <description>When Metroid Prime 4: Beyond is good, it's good. The latest in Nintendo's sci-fi exploration franchise, and the first since Metroid Dread in 2021, Beyond captures the moody sense of isolation and discovery that has been so core to Metroid since it debuted in 1986. Those quiet moments truly make you feel all alone on [&#8230;]</description>
    </item>
    <item>
      <title>How to watch Newcastle vs Tottenham: live streams, TV channels and preview for this Premier League encounter</title>
      <link>https://www.techradar.com/how-to-watch/football/newcastle-vs-tottenham-hostpur-premier-league-2025-26</link>
      <pubDate>Tue, 02 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">dsyzYKGEmTck6uFR6hWTVQ</guid>
      <description>We'll show you all the ways to watch Newcastle vs Tottenham in the Premier League from anywhere in the world.</description>
    </item>
    <item>
      <title>Metroid Prime 4: Beyond was worth the wait &#8211; even if it occasionally gets lost in the desert</title>
      <link>https://www.techradar.com/gaming/metroid-prime-4-beyond-review</link>
      <pubDate>Tue, 02 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">yhG7cnn9eBuqmeZfCukBg7</guid>
      <description>Metroid Prime 4: Beyond is a stunning visual treat on Switch 2, but how does it stack up against the series' best?</description>
    </item>
    <item>
      <title>Backbone is launching a limited-edition Backbone Pro controller with a new transparent design just in time for the holidays</title>
      <link>https://www.techradar.com/gaming/backbone-is-launching-a-limited-edition-backbone-pro-controller-with-a-new-transparent-design-just-in-time-for-the-holidays</link>
      <pubDate>Tue, 02 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">3aesre7hnhseeCScXzH6u8</guid>
      <description>Backbone has announced that it will be releasing a limited-edition Backbone Pro controller in collaboration with Kith.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Wednesday, December 3 (game #906)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-3-december-2025</link>
      <pubDate>Tue, 02 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">FJMv6D9B7cSxLS67VNdhFT</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Wednesday, December 3 (game #640)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-3-december-2025</link>
      <pubDate>Tue, 02 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">XZAN9mBSb6mZj7oX5aBvgL</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Wednesday, December 3 (game #1409)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-3-december-2025</link>
      <pubDate>Tue, 02 Dec 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">j6PPdEzBdTwia7zGqbxFSE</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>Apple pourrait faire face &#224; d&#8217;autres proc&#233;dures collectives en Europe, apr&#232;s cet arr&#234;t de la cour europ&#233;enne</title>
      <link>https://www.01net.com/actualites/apple-pourrait-faire-face-a-dautres-procedures-collectives-en-europe-apres-cet-arret-de-la-cour-europeenne.html</link>
      <pubDate>Tue, 02 Dec 2025 14:59:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313013</guid>
      <description>La cour de justice de l'UE a estim&#233;, dans un arr&#234;t du mardi 2 d&#233;cembre, que les utilisateurs de l'App Store n&#233;erlandais pouvaient bien intenter une action collective aux Pays-Bas pour r&#233;clamer une indemnisation due aux commissions d'Apple. Cet arr&#234;t pourrait ouvrir la voie &#224; d'autres proc&#233;dures collectives initi&#233;es en Europe.</description>
    </item>
  </channel>
</rss>
