<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 02 Jan 2026 10:27:08 GMT</lastBuildDate>
    <item>
      <title>iPhone 18 Pro et 18 Pro Max : Dynamic Island revisit&#233;, puce A20 Pro, nouveaut&#233;s photo&#8230; Tout ce que l&#8217;on sait d&#233;j&#224; sur le futurs smartphones</title>
      <link>https://www.frandroid.com/marques/apple/2921851_iphone-18-pro-rumeurs-design-nouveautes</link>
      <pubDate>Fri, 02 Jan 2026 10:19:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2921851_iphone-18-pro-rumeurs-design-nouveautes</guid>
      <description>
Voici un premier &#233;tat des lieux des informations de plus en plus nombreuses sur les iPhone 18 Pro et iPhone 18 Pro Max pr&#233;vus en 2026 par Apple.
</description>
    </item>
    <item>
      <title>007 First Light is no longer releasing in March following a delay &#8211; &#8216;these additional two months will allow us to further polish and refine the experience&#8217;</title>
      <link>https://www.techradar.com/gaming/007-first-light-is-no-longer-releasing-in-march-following-a-delay-these-additional-two-months-will-allow-us-to-further-polish-and-refine-the-experience</link>
      <pubDate>Fri, 02 Jan 2026 10:18:18 +0000</pubDate>
      <guid isPermaLink="false">2b7JrRkkak7eKMtWNPxa5i</guid>
      <description>IO Interactive has delayed 007 First Light, with the upcoming spy action thriller now releasing in May. This marks a two month delay, with more updates coming early 2026.</description>
    </item>
    <item>
      <title>&#171;&#160;Les concurrents n&#8217;auront rien &#224; copier&#160;&#187;&#160;: la d&#233;claration provocante du patron de BYD sur les voitures &#233;lectrique</title>
      <link>https://www.frandroid.com/marques/byd/2925271_les-concurrents-nauront-rien-a-copier-la-declaration-provocante-du-patron-de-byd-sur-les-voitures-electrique</link>
      <pubDate>Fri, 02 Jan 2026 10:17:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2925271_les-concurrents-nauront-rien-a-copier-la-declaration-provocante-du-patron-de-byd-sur-les-voitures-electrique</guid>
      <description>
L&#8217;un des patrons de BYD estime qu&#8217;il est important pour le leader de la voiture &#233;lectrique de continuer &#224; innover. Et cela afin de stimuler la concurrence et de faire &#233;voluer l&#8217;industrie. Tout en faisant en sorte de rester num&#233;ro 1.
</description>
    </item>
    <item>
      <title>The best rice cooker for 2026</title>
      <link>https://www.engadget.com/home/kitchen-tech/best-rice-cooker-120015478.html?src=rss</link>
      <pubDate>Fri, 02 Jan 2026 10:01:27 +0000</pubDate>
      <guid isPermaLink="false">89b2e8b1-0f28-484e-bd38-34e417490852</guid>
      <description>A great rice cooker can change the way you handle weeknight meals. Instead of watching the pot or dealing with uneven results, you get fluffy, consistent rice with almost no effort. Modern rice cookers can do a lot more than white rice, too. Many handle brown rice, oatmeal and grains, and some function like mini multi-cookers for soups or stews.With so many options available, the best rice cooker for you depends on how often you cook, how much counter space you have and which features matter most. We tested a range of models to find the best rice cookers for everything from small kitchens to b...</description>
    </item>
    <item>
      <title>What Is the &#8216;Super Flu&#8217; That Is Spreading in Europe and the United States?</title>
      <link>https://www.wired.com/story/what-is-super-flu-spreading-in-united-states-europe/</link>
      <pubDate>Fri, 02 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">6945749e4658d4c55deda2d6</guid>
      <description>The &#8220;super flu&#8221; behind outbreaks in the US and UK is a new variant of influenza A H3N2, subclade K. Existing vaccines appear to be insufficiently effective against the virus.</description>
    </item>
    <item>
      <title>'Zombie subscriptions&#8217; are a silent killer &#8211; here are 3 ways to fix them for 2026 in minutes</title>
      <link>https://www.techradar.com/tech/zombie-subscriptions-are-a-silent-killer-here-are-3-ways-to-fix-them-for-2026-in-minutes</link>
      <pubDate>Fri, 02 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">uPng4fsCfYsovroPQYiwNc</guid>
      <description>Track down those subscriptions you aren't making use of and save yourself some money over the next 12 months.</description>
    </item>
    <item>
      <title>What to expect from Samsung at CES 2026</title>
      <link>https://mashable.com/article/samsung-ces-2026-what-to-expect</link>
      <pubDate>Fri, 02 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00uML3eAejx32LvUX2b19mY</guid>
      <description>Samsung is bringing a ton of new tech to this year's CES.</description>
    </item>
    <item>
      <title>How to watch Warriors vs. Thunder online for free</title>
      <link>https://mashable.com/article/warriors-thunder-nba-2025-live-stream-for-free</link>
      <pubDate>Fri, 02 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">05s96mMOkCZ8iKT3M7CjKBA</guid>
      <description>How to watch NBA for free. Watch Golden State Warriors vs. Oklahoma City Thunder in the NBA for free from anywhere in the world.</description>
    </item>
    <item>
      <title>How to watch Knicks vs. Hawks online for free</title>
      <link>https://mashable.com/article/knicks-hawks-nba-2025-live-stream-for-free</link>
      <pubDate>Fri, 02 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">03nrBNsrmeK4AMuj4PBkR4I</guid>
      <description>How to watch NBA for free. Watch New York Knicks vs. Atlanta Hawks in the NBA for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Get Microsoft&#8217;s best apps for life for a one-time $30 payment</title>
      <link>https://mashable.com/article/jan-2-microsoft-office-home-business-2019-for-mac</link>
      <pubDate>Fri, 02 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01KMXqEtz4IHjbCrq0QuFZq</guid>
      <description>Get a lifetime license to Microsoft Office Home &amp; Business 2019 for Mac for just $29.97.</description>
    </item>
    <item>
      <title>Upgrade your online security in 2026 with this portable VPN router</title>
      <link>https://mashable.com/article/jan-2-deeper-connect-air-portable-vpn-travel-router</link>
      <pubDate>Fri, 02 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01ePlt21aJT5gICmXgrgHGD</guid>
      <description>Browse the web with peace of mind thanks to this Deeper Connect Air Portable Decentralized VPN Travel Router, on sale now for $159.97 (reg. $219) through Jan. 11.</description>
    </item>
    <item>
      <title>L&#8217;objet interstellaire 3I/Atlas a-t-il tent&#233; de communiquer par radio selon le Seti comme le ferait une sonde E.T ?</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-objet-interstellaire-3i-atlas-t-il-tente-communiquer-radio-selon-seti-comme-ferait-sonde-et-129664/#xtor%3DRSS-8</link>
      <pubDate>Fri, 02 Jan 2026 10:59:00 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-objet-interstellaire-3i-atlas-t-il-tente-communiquer-radio-selon-seti-comme-ferait-sonde-et-129664/#xtor%3DRSS-8</guid>
      <description>Depuis longtemps, les scientifiques imaginent que nos &#233;missions radio dans la Voie lact&#233;e pourraient avoir attir&#233; l'attention&#160;de civilisations extraterrestres suffisamment avanc&#233;es pour avoir construit des sondes robotis&#233;es voyageant &#224; une fraction notable de la vitesse de la lumi&#232;re, et ce, il...</description>
    </item>
    <item>
      <title>Stranger Things fans are furious about the finale. Heres why.</title>
      <link>https://mashable.com/article/stranger-things-finale-reactions-did-eleven-die</link>
      <pubDate>Fri, 02 Jan 2026 09:56:43 +0000</pubDate>
      <guid isPermaLink="false">01ur5x9bAaeRlzlauETIhH5</guid>
      <description>'Stranger Things' fans have reacted to the series' grand finale, expressing anger and unhappiness at Eleven's ultimate fate.</description>
    </item>
    <item>
      <title>SpaceX will lower Starlink satellites to reduce collision risk</title>
      <link>https://www.theverge.com/news/852570/spacex-will-lower-starlink-satellites-to-reduce-collision-risk</link>
      <pubDate>2026-01-02T04:52:07-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=852570</guid>
      <description>After one of its Starlink satellites exploded and another narrowly avoided colliding with a Chinese satellite, SpaceX says it will lower the orbit of thousands of Starlink satellites to increase safety. Of the over 9,000 Starlink satellites currently operating in low Earth orbit, SpaceX says it'll lower about 4,400 from 550km above the Earth's surface [&#8230;]...</description>
    </item>
    <item>
      <title>BYD change de strat&#233;gie gr&#226;ce &#224; l&#8217;hybride : le plan du g&#233;ant chinois pour contourner les taxes et inonder l&#8217;Europe</title>
      <link>https://www.frandroid.com/marques/byd/2925201_byd-change-de-strategie-grace-a-lhybride-le-plan-du-geant-chinois-pour-contourner-les-taxes-et-inonder-leurope</link>
      <pubDate>Fri, 02 Jan 2026 09:48:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2925201_byd-change-de-strategie-grace-a-lhybride-le-plan-du-geant-chinois-pour-contourner-les-taxes-et-inonder-leurope</guid>
      <description>
D&#233;j&#224; leader mondial de la voiture &#233;lectrique, BYD veut d&#233;sormais aussi se faire une place au sommet sur l&#8217;hybride. Et pour cela, le constructeur mise notamment sur ses prix.
</description>
    </item>
    <item>
      <title>The Freestyle+&#160;: le petit vid&#233;oprojecteur de Samsung &#233;volue, c&#8217;est l&#8217;IA qui r&#232;gle l&#8217;image pour vous</title>
      <link>https://www.01net.com/actualites/the-freestyle-le-petit-projecteur-de-samsung-evolue-cest-lia-qui-regle-limage-pour-vous.html</link>
      <pubDate>Fri, 02 Jan 2026 09:35:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317793</guid>
      <description>La nouvelle version de The Freestyle corrige le principal point faible de la pr&#233;c&#233;dente et int&#232;gre une surprise de taille : une fonctionnalit&#233; d&#8217;optimisation de l&#8217;image par IA.</description>
    </item>
    <item>
      <title>Nothing CMF Buds Pro 2 : ces &#233;couteurs avec ANC sont &#224; prix cass&#233; sur Amazon (-34%)</title>
      <link>https://www.frandroid.com/bons-plans/2557733_nothing-cmf-buds-pro-2-ces-ecouteurs-avec-anc-sont-a-prix-casse-sur-amazon-34</link>
      <pubDate>Fri, 02 Jan 2026 09:10:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2557733_nothing-cmf-buds-pro-2-ces-ecouteurs-avec-anc-sont-a-prix-casse-sur-amazon-34</guid>
      <description>
Les CMF Buds Pro 2 de Nothing sont des &#233;couteurs sans fil &#224; r&#233;duction de bruit active qui affichent un excellent rapport qualit&#233;-prix, mais ils deviennent carr&#233;ment imbattables avec cette promo Amazon : ils passent &#224; 42 euros au lieu de 64 euros, une belle ristourne pour s&#8217;offrir une paire d'&#233;couteurs avec ANC sans se ruiner. 
</description>
    </item>
    <item>
      <title>Samsung adds much needed brightness to its Freestyle projector</title>
      <link>https://www.theverge.com/news/852545/samsung-adds-much-needed-brightness-to-its-freestyle-projector</link>
      <pubDate>2026-01-02T03:30:17-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=852545</guid>
      <description>The Freestyle Plus all-in-one portable projector features 430 ISO Lumens, or "nearly twice the brightness of the previous generation," according to Samsung. Great! But also a little strange since both the original and second generation Freestyle projectors listed "550 lumens" on their respective spec sheets. See, projector makers are notorious for playing fast and loose [&#8230;]...</description>
    </item>
    <item>
      <title>Les 18 voitures &#233;lectriques qu&#8217;on attend le plus en 2026 : des citadines aux berlines &#224; 800 km d&#8217;autonomie</title>
      <link>https://www.frandroid.com/survoltes/2923619_les-18-voitures-electriques-quon-attend-le-plus-en-2026-des-citadines-aux-berlines-a-800-km-dautonomie</link>
      <pubDate>Fri, 02 Jan 2026 08:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2923619_les-18-voitures-electriques-quon-attend-le-plus-en-2026-des-citadines-aux-berlines-a-800-km-dautonomie</guid>
      <description>
Voici les 18 voitures &#233;lectriques les plus attendues de 2026. De la Polo de Volkswagen &#224; la Ferrari Elettrica en passant par la Dacia Spring sur base Twingo, on a list&#233; les mod&#232;les qui devraient apporter du renouveau dans de nombreux segments.
</description>
    </item>
  </channel>
</rss>
