<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 18 Nov 2025 15:44:27 GMT</lastBuildDate>
    <item>
      <title>Physics Wallah enjoys a rosy IPO day, bucking the broader slowdown in Indian edtech</title>
      <link>https://techcrunch.com/2025/11/18/physics-wallah-enjoys-a-rosy-ipo-day-bucking-the-broader-slowdown-in-indian-edtech/</link>
      <pubDate>Tue, 18 Nov 2025 15:36:09 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068704</guid>
      <description>The Indian edtech startup ended its first day as a public company on a high, with its shares closing 44% higher than they were listed for, indicating that the country's edtech sector may still recover after years of gloom.</description>
    </item>
    <item>
      <title>Cloudflare blames massive internet outage on &#8216;latent bug&#8217;</title>
      <link>https://techcrunch.com/2025/11/18/cloudflare-blames-massive-internet-outage-on-latent-bug/</link>
      <pubDate>Tue, 18 Nov 2025 15:32:01 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068760</guid>
      <description>An outage at internet infrastructure giant Cloudflare took down several big websites and services, including ChatGPT, Claude, Spotify, and X.</description>
    </item>
    <item>
      <title>Best Early Black Friday Mattress Deals 2025</title>
      <link>https://www.wired.com/story/best-early-black-friday-mattress-deals-2025/</link>
      <pubDate>Tue, 18 Nov 2025 15:29:40 +0000</pubDate>
      <guid isPermaLink="false">691b76ae86e69565af2a4958</guid>
      <description>Some of the best sales of the year are happening right now&#8212;rest up before the holiday rush with a new bed.</description>
    </item>
    <item>
      <title>Organizations must own the right to their cloud compute, or innovation will suffer</title>
      <link>https://www.techradar.com/pro/organizations-must-own-the-right-to-their-cloud-compute-or-innovation-will-suffer</link>
      <pubDate>Tue, 18 Nov 2025 15:27:26 +0000</pubDate>
      <guid isPermaLink="false">3uYYJWP2Kw8jsFYHhct3pb</guid>
      <description>The future of digital sovereignty and responsible AI use depends on infrastructure autonomy.</description>
    </item>
    <item>
      <title>Voici les 16 produits Tech pas chers pour se faire plaisir &#224; petit prix lors du pr&#233;-Black Friday : la s&#233;lection &#224; moins de 100 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2866283_voici-les-14-produits-tech-pas-chers-pour-se-faire-plaisir-a-petit-prix-lors-du-pre-black-friday-la-selection-a-moins-de-100</link>
      <pubDate>Tue, 18 Nov 2025 15:26:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2866283_voici-les-14-produits-tech-pas-chers-pour-se-faire-plaisir-a-petit-prix-lors-du-pre-black-friday-la-selection-a-moins-de-100</guid>
      <description>
Le v&#233;ritable Black Friday approche et parmi les nombreuses offres d&#233;j&#224; disponibles, il est possible de se faire plaisir m&#234;me avec un budget qui ne d&#233;passe pas les 100 euros. Avis aux petits budgets,&#160;voici les meilleures offres qui valent le coup.&#160;
</description>
    </item>
    <item>
      <title>The Criterion Collection is having a 50% off sale at Amazon for Black Friday &#8211; here are my 9 closet picks from the deals</title>
      <link>https://www.techradar.com/televisions/the-criterion-collection-is-having-a-50-percent-off-sale-at-amazon-for-black-friday-here-are-my-9-closet-picks-from-the-deals</link>
      <pubDate>Tue, 18 Nov 2025 15:24:18 +0000</pubDate>
      <guid isPermaLink="false">qXqrhcFuoQzNRBKuUDmypC</guid>
      <description>The Criterion Collection has knocked 50% off tons of its 4K Blu-rays, so there's no better time to add to your shelves!</description>
    </item>
    <item>
      <title>This new Razer headset is perfect for PC gaming and is already at its lowest-ever price for Black Friday</title>
      <link>https://www.techradar.com/gaming/this-new-razer-headset-is-perfect-for-pc-gaming-and-is-already-at-its-lowest-ever-price-for-black-friday</link>
      <pubDate>Tue, 18 Nov 2025 15:24:16 +0000</pubDate>
      <guid isPermaLink="false">qKx6tTmKTKJduCG22ZmR9W</guid>
      <description>The Razer BlackShark V3 Wireless is at a massive discount for Black Friday.</description>
    </item>
    <item>
      <title>Panne mondiale d&#8217;Internet&#160;: Cloudflare est en train de r&#233;soudre le probl&#232;me</title>
      <link>https://www.01net.com/actualites/panne-mondiale-dinternet-cloudflare-rencontre-un-gros-probleme.html</link>
      <pubDate>Tue, 18 Nov 2025 15:24:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308960</guid>
      <description>Une panne massive de Cloudflare secoue Internet. Une montagne de sites web s'est retrouv&#233;e inaccessible pendant plusieurs heures. Cloudflare est finalement parvenu &#224; localiser et &#224; r&#233;soudre la panne. Un &#171; correctif a &#233;t&#233; d&#233;ploy&#233; et nous pensons que l'incident est d&#233;sormais r&#233;solu &#187;, explique Cloudflare.</description>
    </item>
    <item>
      <title>M&#234;me d&#233;branch&#233;s des serveurs, les vieux thermostats Nest continuent d&#8217;envoyer des donn&#233;es &#224; Google</title>
      <link>https://www.01net.com/actualites/meme-debranches-des-serveurs-les-vieux-thermostats-nest-continuent-denvoyer-des-donnees-a-google.html</link>
      <pubDate>Tue, 18 Nov 2025 15:21:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309013</guid>
      <description>Google a beau avoir d&#233;branch&#233; les premiers thermostats Nest, ces appareils continuent d&#8217;envoyer des donn&#233;es vers les serveurs de l&#8217;entreprise. Un chercheur en s&#233;curit&#233; a d&#233;couvert que des journaux d&#8217;activit&#233; &#8212; parfois tr&#232;s d&#233;taill&#233;s &#8212; circulent toujours en arri&#232;re-plan, malgr&#233; la fin officielle du support.</description>
    </item>
    <item>
      <title>Waymo removes safety drivers in Miami ahead of 2026 launch</title>
      <link>https://techcrunch.com/2025/11/18/waymo-removes-safety-drivers-in-miami-ahead-of-2026-launch/</link>
      <pubDate>Tue, 18 Nov 2025 15:21:12 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068734</guid>
      <description>Waymo said it will do the same in Dallas, Houston, San Antonio, and Orlando in the coming weeks -- the latest steps in the company's continued expansion across the U.S.</description>
    </item>
    <item>
      <title>Smartphones Samsung, Apple, Google, Nothing&#8230; la s&#233;lection des offres les plus all&#233;chantes sur ce pr&#233; Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2848295_black-friday-en-avance-les-smartphones-premium-sont-a-leur-meilleur-prix-le-top-deals-sur-les-modeles-samsung-apple-google-nothing</link>
      <pubDate>Tue, 18 Nov 2025 15:20:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848295_black-friday-en-avance-les-smartphones-premium-sont-a-leur-meilleur-prix-le-top-deals-sur-les-modeles-samsung-apple-google-nothing</guid>
      <description>
La Black Week approche &#224; grands pas ! Mais cela fait d&#233;j&#224; depuis le d&#233;but du mois que smartphones sont &#224; prix cass&#233;s. Les &#233;tals des e-commer&#231;ants ne d&#233;semplissent pas de r&#233;ductions en tout genre. Nous avons rassembl&#233; ici les offres les plus int&#233;ressantes sur les smartphones premium.
</description>
    </item>
    <item>
      <title>Microsoft&amp;#8217;s new Anthropic partnership brings Claude AI models to Azure</title>
      <link>https://www.theverge.com/news/822988/microsoft-anthropic-partnership-claude-models-azure-investment-nvidia</link>
      <pubDate>2025-11-18T10:20:17-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=822988</guid>
      <description>Microsoft is announcing a strategic partnership with Anthropic today that will bring the AI startup&#8217;s models to Microsoft Foundry for the first time. As part of the deal, Anthropic is also committing to purchasing $30 billion of Azure compute capacity and &#8220;to contract&#160;additional&#160;compute capacity up to one gigawatt.&#8221; Microsoft Foundry customers will now be able [&#8230;]...</description>
    </item>
    <item>
      <title>Vibe coding to vibe hacking: securing software in the AI era</title>
      <link>https://www.techradar.com/pro/vibe-coding-to-vibe-hacking-securing-software-in-the-ai-era</link>
      <pubDate>Tue, 18 Nov 2025 15:18:47 +0000</pubDate>
      <guid isPermaLink="false">8BktuefyhKTbKnd6zHH9mH</guid>
      <description>Vibe coding's speed risks vulnerabilities without human accountability and scrutiny.</description>
    </item>
    <item>
      <title>Xiaomi n&#8217;&#233;pargne aucun de ses produits durant le pr&#233;-Black Friday : le TOP 16 des offres</title>
      <link>https://www.frandroid.com/bons-plans/2858733_xiaomi-profite-du-pre-black-friday-pour-brader-ses-produits-les-plus-populaires-les-8-offres-a-saisir</link>
      <pubDate>Tue, 18 Nov 2025 15:15:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2858733_xiaomi-profite-du-pre-black-friday-pour-brader-ses-produits-les-plus-populaires-les-8-offres-a-saisir</guid>
      <description>
Xiaomi multiplie les offres avant le v&#233;ritable Black Friday, y compris sur ses derniers mod&#232;les. Plusieurs r&#233;f&#233;rences r&#233;centes sont propos&#233;es &#224; prix r&#233;duit, assurant un excellent rapport qualit&#233;-prix. Voici les produits de la marque que l'on recommande sans h&#233;siter.
</description>
    </item>
    <item>
      <title>The New &#8216;Project Hail Mary&#8217; Trailer Shows What the Movie Is Really About</title>
      <link>https://gizmodo.com/new-project-hail-mary-trailer-ryan-gosling-2000687175</link>
      <pubDate>Tue, 18 Nov 2025 15:15:46 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687175</guid>
      <description>Ryan Gosling stars in the new sci-fi film from directors Phil Lord and Chris Miller, out March 20, 2026.</description>
    </item>
    <item>
      <title>This notorious Russian surveillance tech maker has been hacked - could it be the end for Protei?</title>
      <link>https://www.techradar.com/pro/security/this-notorious-russian-surveillance-tech-maker-has-been-hacked-could-it-be-the-end-for-protei</link>
      <pubDate>Tue, 18 Nov 2025 15:14:00 +0000</pubDate>
      <guid isPermaLink="false">uYm2ieTAFsffoc7uKnqTS</guid>
      <description>Someone defaced the Protei website and stole gigabytes of data including emails dating back years.</description>
    </item>
    <item>
      <title>The sovereignty shift: how UK and Irish SMEs can regain control of their data</title>
      <link>https://www.techradar.com/pro/the-sovereignty-shift-how-uk-and-irish-smes-can-regain-control-of-their-data</link>
      <pubDate>Tue, 18 Nov 2025 15:11:26 +0000</pubDate>
      <guid isPermaLink="false">fqyDHfpfPPKoiPaHT6t2wC</guid>
      <description>Amid rising data concerns, UK and Irish SMEs are urged to reclaim control through digital sovereignty.</description>
    </item>
    <item>
      <title>P&#233;nurie de m&#233;moire, Nvidia et AMD vont stopper des cartes graphiques, c&#8217;est le moment ou jamais d&#8217;acheter avant que le march&#233; ne cr&#232;ve le plafond</title>
      <link>https://www.frandroid.com/marques/nvidia/2873829_penurie-de-memoire-nvidia-et-amd-vont-stopper-des-cartes-graphiques-cest-le-moment-ou-jamais-dacheter-avant-que-le-marche-ne-creve-le-plafond</link>
      <pubDate>Tue, 18 Nov 2025 15:10:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2873829_penurie-de-memoire-nvidia-et-amd-vont-stopper-des-cartes-graphiques-cest-le-moment-ou-jamais-dacheter-avant-que-le-marche-ne-creve-le-plafond</guid>
      <description>
Le spectre de la &#171; memoryflation &#187; plane sur l'industrie. Alors que les prix de la RAM et du stockage s'envolent, les constructeurs de cartes graphiques et de PC envisagent des mesures drastiques : suppression de mod&#232;les, report de lancements et hausse g&#233;n&#233;ralis&#233;e des tarifs.
</description>
    </item>
    <item>
      <title>Comparatif : quelles sont les meilleures enceintes Bluetooth en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guide-audio/722626_guide-meilleures-enceintes-portables</link>
      <pubDate>Tue, 18 Nov 2025 15:09:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-audio/722626_guide-meilleures-enceintes-portables</guid>
      <description>
Pratique, compacte, l'enceinte Bluetooth sans fil nous accompagne autant &#224; la maison qu'en d&#233;placement ou en vacances. On vous propose ici une s&#233;lection pointue des meilleures enceintes Bluetooth que nous avons pu tester.
</description>
    </item>
    <item>
      <title>Orange lance le premier forfait mobile par satellite, mais pas pour tout le monde</title>
      <link>https://www.frandroid.com/marques/orange/2873857_orange-lance-le-premier-forfait-mobile-par-satellite-mais-pas-pour-tout-le-monde</link>
      <pubDate>Tue, 18 Nov 2025 15:09:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/orange/2873857_orange-lance-le-premier-forfait-mobile-par-satellite-mais-pas-pour-tout-le-monde</guid>
      <description>
L'op&#233;rateur Orange devient le premier d'Europe &#224; proposer un abonnement pour envoyer des SMS par satellite. Voici ce qu'il faut savoir.
</description>
    </item>
    <item>
      <title>The 26 Best Advent Calendars (2025): We Opened Every Door</title>
      <link>https://www.wired.com/gallery/best-advent-calendar/</link>
      <pubDate>Tue, 18 Nov 2025 15:09:00 +0000</pubDate>
      <guid isPermaLink="false">638f964b258cc1f5b2da9dac</guid>
      <description>Treat yourself or someone else to days of little gifts, ranging from sweet treats and savory beverages to beauty products and toys. We found a tiny door for everyone.</description>
    </item>
    <item>
      <title>I have a new favorite VR headset and it's all thanks to Black Friday</title>
      <link>https://www.techradar.com/seasonal-sales/i-have-a-new-favorite-vr-headset-and-its-all-thanks-to-black-friday</link>
      <pubDate>Tue, 18 Nov 2025 15:05:40 +0000</pubDate>
      <guid isPermaLink="false">bPFNTdh9MFZ5CFL4eGTrNf</guid>
      <description>The Meta Quest 3 is my usual go-to VR headset, but this Black Friday there's a new king in town.</description>
    </item>
    <item>
      <title>5 Black Friday security software deals you can't afford to miss: quality savings on all your security essentials</title>
      <link>https://www.techradar.com/pro/5-black-friday-security-software-deals-you-cant-afford-to-miss-quality-savings-on-all-your-security-essentials</link>
      <pubDate>Tue, 18 Nov 2025 15:04:04 +0000</pubDate>
      <guid isPermaLink="false">K8L2VGWdGy79LUmUhHQqAH</guid>
      <description>Keep your data and devices protected this Black Friday with my roundup of the best discounts that are half price or more.</description>
    </item>
    <item>
      <title>Welp, Smart Earrings Are a Thing Now</title>
      <link>https://gizmodo.com/lumia-smart-earring-2-health-tracking-price-release-date-2000687118</link>
      <pubDate>Tue, 18 Nov 2025 15:00:51 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687118</guid>
      <description>Lumia is ready to release its health-tracking smart earrings to the masses.</description>
    </item>
    <item>
      <title>The best Christmas gifts for gamers and movie lovers</title>
      <link>https://www.theverge.com/gadgets/780850/gaming-entertainment-gifts-ideas-2025</link>
      <pubDate>2025-11-18T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=780850</guid>
      <description>Most of us in the Northern Hemisphere spend the holidays indoors, but you can only watch so many TikToks about cute cats and cooking hacks before the need for something a little more substantive kicks in. Choosing the right game or movie to gift is tough, though, especially if you don't have an exact read [&#8230;]</description>
    </item>
    <item>
      <title>Quordle hints and answers for Wednesday, November 19 (game #1395)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-19-november-2025</link>
      <pubDate>Tue, 18 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">AZUvQM4vYBSS7bjxFXNoLj</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Wednesday, November 19 (game #892)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-19-november-2025</link>
      <pubDate>Tue, 18 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">zEy9dt3D8kFUbvKeviRSSS</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Wednesday, November 19 (game #626)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-19-november-2025</link>
      <pubDate>Tue, 18 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">frcYUCi5hMVNrHaYMc6vBZ</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Home Depot misses third-quarter earnings expectations, cuts outlook</title>
      <link>https://www.fastcompany.com/91444092/home-depot-earnings-third-quarter</link>
      <pubDate>2025-11-18T15:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444092/home-depot-earnings-third-quarter</guid>
      <description>The company attributed the missed earnings to less storm damage and more anxious shoppers.
Home Depot&#8216;s third-quarter was mixed with fewer violent storms reaching shore, more anxiety among U.S. consumers, and a housing market that is in a deep funk.</description>
    </item>
    <item>
      <title>Cloudflare Outage Takes Down Huge Chunk of the Internet, Slowly Coming Back Online</title>
      <link>https://gizmodo.com/cloudflare-outage-takes-down-huge-chunk-of-the-internet-slowly-coming-back-online-2000687459</link>
      <pubDate>Tue, 18 Nov 2025 14:56:59 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687459</guid>
      <description>Amazon, X, Spotify, ChatGPT, Grindr, Canva, and many more are struggling to stay online.</description>
    </item>
    <item>
      <title>One of the best dual-zone air fryers has a record-low price &#8211; this early Black Friday deal might be Thanksgiving prep boost you need</title>
      <link>https://www.techradar.com/seasonal-sales/one-of-the-best-dual-zone-air-fryers-has-a-record-low-price-this-early-black-friday-deal-might-be-thanksgiving-prep-boost-you-need</link>
      <pubDate>Tue, 18 Nov 2025 14:55:28 +0000</pubDate>
      <guid isPermaLink="false">PsVNUgdJhybZSBeUm8T9ZK</guid>
      <description>The spacious and versatile Ninja Foodi Max dual-zone air fryer gets a big price drop ahead of Black Friday</description>
    </item>
    <item>
      <title>I tested 15 cases for the Switch 2 and these are the best</title>
      <link>https://www.theverge.com/reviews/691319/best-switch-2-cases</link>
      <pubDate>2025-11-18T09:52:10-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=691319</guid>
      <description>Editor&#8217;s note:&#160;Black Friday doesn&#8217;t officially take place until Friday, November 28th; however, if you want to shop ahead of time, we&#8217;ve rounded up the&#160;best early Black Friday deals&#160;you can already get. You might find it kind of sad to put your hard-earned Switch 2 into a protective case. To me, it&#8217;s freeing. Using a case [&#8230;]</description>
    </item>
    <item>
      <title>Pourquoi la moiti&#233; du web ne r&#233;pond plus : voil&#224; &#224; quoi sert Cloudflare</title>
      <link>https://www.frandroid.com/culture-tech/web/2874001_pourquoi-la-moitie-du-web-ne-repond-plus-voila-a-quoi-sert-cloudflare</link>
      <pubDate>Tue, 18 Nov 2025 14:49:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/web/2874001_pourquoi-la-moitie-du-web-ne-repond-plus-voila-a-quoi-sert-cloudflare</guid>
      <description>
Bon. Vous avez sans doute pass&#233; un mauvais moment ce midi. Impossible d'acc&#233;der &#224; ChatGPT, des images qui ne chargent pas sur X, et m&#234;me Frandroid aux abonn&#233;s absents. Le coupable s'appelle Cloudflare. 
</description>
    </item>
    <item>
      <title>Cloudflare outage cause revealed: This is what happened.</title>
      <link>https://mashable.com/article/cloudflare-outage-cause-revealed-what-happened-why</link>
      <pubDate>Tue, 18 Nov 2025 14:46:43 +0000</pubDate>
      <guid isPermaLink="false">01z3M0gws18NfFQ348wYoBL</guid>
      <description>We're starting to get answers about what happened to bring down Cloudflare and large portions of the internet.</description>
    </item>
    <item>
      <title>Orange lance &#8220;Message Satellite&#8221;, le premier abonnement mobile par satellite en France</title>
      <link>https://www.01net.com/actualites/orange-lance-message-satellite-le-premier-abonnement-mobile-par-satellite-en-france.html</link>
      <pubDate>Tue, 18 Nov 2025 14:46:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308982</guid>
      <description>L&#8217;op&#233;rateur fran&#231;ais vient de d&#233;voiler l&#8217;arriv&#233;e de &#171; Message Satellite &#187;, la premi&#232;re offre europ&#233;enne permettant d&#8217;envoyer des SMS par satellite depuis votre smartphone, dans les zones blanches.</description>
    </item>
    <item>
      <title>James Cameron Promises Blood for an &#8216;Alita: Battle Angel&#8217; Sequel</title>
      <link>https://gizmodo.com/james-cameron-alita-battle-angel-2-blood-oath-2000687256</link>
      <pubDate>Tue, 18 Nov 2025 14:45:13 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000687256</guid>
      <description>Plus, Russell T Davies says 'Doctor Who' has something to prove with its new spinoff, 'The War Between the Land and the Sea'.</description>
    </item>
    <item>
      <title>PS5, Xbox Series, Nintendo Switch 2&#8230; quelle console de jeux choisir en 2025&#8201;?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-gaming/466481_guide-dachat-quelle-console-de-jeu-choisir-en-2017</link>
      <pubDate>Tue, 18 Nov 2025 14:45:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-gaming/466481_guide-dachat-quelle-console-de-jeu-choisir-en-2017</guid>
      <description>
PlayStation&#160;5 ou 5 Pro, Xbox Series X|S, Nintendo Switch 2, Steam Deck, ROG Ally&#8230; voici notre comparatif des&#160;meilleures consoles de jeux en 2025, de salon ou portable. Amis gamers, amies gameuses, d&#233;couvrez laquelle est faite pour vous.
</description>
    </item>
    <item>
      <title>Larry Summers to step back from public commitments after Epstein emails</title>
      <link>https://www.fastcompany.com/91444088/larry-summers-epstein-step-back-public-commitments</link>
      <pubDate>2025-11-18T14:45:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444088/larry-summers-epstein-step-back-public-commitments</guid>
      <description>The released documents showed personal correspondence between Summers and Epstein.
Former U.S. Treasury Secretary Larry Summers said on Monday he will step back from all public commitments, days after President Donald Trump ordered the Justice Department to investigate his and other prominent Democrats&#8217; ties to convicted sex offender Jeffrey Epstein....</description>
    </item>
    <item>
      <title>Aspirateurs robots, air fryer, lumi&#232;res connect&#233;es&#8230; Le Black Friday en avance a de belles promotions sur la maison connect&#233;e</title>
      <link>https://www.frandroid.com/bons-plans/2858095_black-friday-meilleures-promotions-maison-connectee-aspirateurs-robots</link>
      <pubDate>Tue, 18 Nov 2025 14:42:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2858095_black-friday-meilleures-promotions-maison-connectee-aspirateurs-robots</guid>
      <description>
Robot aspirateur, friteuse sans huile, ampoules intelligentes, cam&#233;ras de s&#233;curit&#233;... Les indispensables de la maison connect&#233;e sont d&#233;j&#224; en promotion &#224; l'occasion des offres anticip&#233;es du Black Friday. C'est le moment id&#233;al pour se lancer dans la domotique ou compl&#233;ter son installation avec notre s&#233;lection des meilleures offres disponibles.
</description>
    </item>
    <item>
      <title>L&#8217;&#233;clatement de la bulle IA n&#8217;&#233;pargnera personne, pr&#233;vient le patron de Google</title>
      <link>https://www.01net.com/actualites/leclatement-de-la-bulle-ia-nepargnera-personne-previent-le-patron-de-google.html</link>
      <pubDate>Tue, 18 Nov 2025 14:38:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308977</guid>
      <description>Pour certains investisseurs, ce n'est pas tellement une question de si mais de quand la bulle IA explosera. Et lorsque cela arrivera, quelles seront les entreprises les plus touch&#233;es ? Le patron de Google a une petite id&#233;e sur la question.</description>
    </item>
    <item>
      <title>14 Best Housewarming Gifts We Can't Stop Using (2025): Coasters, Blenders, Sheets</title>
      <link>https://www.wired.com/gallery/best-housewarming-gifts-for-any-new-home-2025/</link>
      <pubDate>Tue, 18 Nov 2025 14:32:00 +0000</pubDate>
      <guid isPermaLink="false">67195132362f1871bc36ca5b</guid>
      <description>Make a house into a home with these gifts, whether your recipient is moving into their first house or a great new apartment.</description>
    </item>
    <item>
      <title>Grindr and other gay dating apps down</title>
      <link>https://mashable.com/article/grindr-sniffies-gay-dating-apps-down-cloudflare-outage</link>
      <pubDate>Tue, 18 Nov 2025 14:31:39 +0000</pubDate>
      <guid isPermaLink="false">03aDSdRa6iit5fTwlSyuHpH</guid>
      <description>Grindr and Sniffies, and potentially other gay dating apps are currently down.</description>
    </item>
    <item>
      <title>Amazon is almost giving away the Fire TV Stick 4K Select ahead of Black Friday</title>
      <link>https://mashable.com/article/nov-18-amazon-fire-tv-stick-4k-select-deal</link>
      <pubDate>Tue, 18 Nov 2025 14:31:12 +0000</pubDate>
      <guid isPermaLink="false">02P5XqUM1fmJr8AurDuZoca</guid>
      <description>The Amazon Fire TV Stick 4K Select is only $9.99 at Amazon ahead of Black Friday for select customers. That's a 75% discount.</description>
    </item>
    <item>
      <title>Samsung frappe fort &#224; lors du pr&#233;-Black Friday avec ses 20 bonnes affaires &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2852851_samsung-frappe-fort-a-lors-du-pre-black-friday-avec-ses-20-bonnes-affaires-a-saisir</link>
      <pubDate>Tue, 18 Nov 2025 14:28:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2852851_samsung-frappe-fort-a-lors-du-pre-black-friday-avec-ses-20-bonnes-affaires-a-saisir</guid>
      <description>
Samsung fait partie de ces constructeurs proposant tout un tas de produits Tech. Et, pour en profiter aux meilleurs prix, quoi de mieux que le pr&#233;-Black Friday ? De nombreuses r&#233;f&#233;rences du constructeur sont en promotion, mais nous avons s&#233;lectionn&#233; uniquement les meilleures offres.
</description>
    </item>
    <item>
      <title>Cloudflare down: What we know about the outage so far</title>
      <link>https://mashable.com/article/cloudflare-down-outage-november-18</link>
      <pubDate>Tue, 18 Nov 2025 14:20:20 +0000</pubDate>
      <guid isPermaLink="false">07ocPQ9SQmUgxJXvORQblJw</guid>
      <description>Cloudflare is experiencing global issues, the service confirmed on Tuesday morning.</description>
    </item>
    <item>
      <title>Windscribe's entire VPN network gets a next-gen speed and stability boost</title>
      <link>https://www.techradar.com/vpn/vpn-services/windscribes-entire-vpn-network-gets-a-next-gen-speed-and-stability-boost</link>
      <pubDate>Tue, 18 Nov 2025 14:18:05 +0000</pubDate>
      <guid isPermaLink="false">GkdWeZeBU2gPsCzXdJ2Lfj</guid>
      <description>It's a huge day for Windscribe users as "FreshScribe," a year-long project to overhaul its entire server network, is now live for everyone.</description>
    </item>
    <item>
      <title>It&amp;#8217;s not your job to fix the internet</title>
      <link>https://www.theverge.com/podcast/822822/enshittification-cory-doctorow-interview-vergecast</link>
      <pubDate>2025-11-18T09:14:55-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=822822</guid>
      <description>The concept of enshittification, as coined by the author and activist Cory Doctorow, just feels right. Whether you're searching on Google, shopping on Amazon, or scrolling on Facebook, large platforms often feel like they're not trying to bring us value so much as extract every bit of value they can out of us. It wasn't [&#8230;]</description>
    </item>
    <item>
      <title>Lego's official Black Friday sale is less than two weeks away, but here are 6 early deals I'd buy right now</title>
      <link>https://www.techradar.com/seasonal-sales/legos-official-black-friday-sale-is-less-than-two-weeks-away-but-here-are-6-early-deals-id-buy-right-now</link>
      <pubDate>Tue, 18 Nov 2025 14:09:43 +0000</pubDate>
      <guid isPermaLink="false">5LGZudE2FKFGvoBR5C8L76</guid>
      <description>With less than two weeks until Black Friday, Lego's confirmed it's now an annual sale and is teasing some impressive discounts across major themes.</description>
    </item>
    <item>
      <title>Princeton University data breach hits students, alumni - here's what we know</title>
      <link>https://www.techradar.com/pro/security/princeton-university-data-breach-hits-students-alumni-heres-what-we-know</link>
      <pubDate>Tue, 18 Nov 2025 14:05:00 +0000</pubDate>
      <guid isPermaLink="false">XbuVXbyV6m2vZSiX5wgmYd</guid>
      <description>Names, email addresses, and postal addresses were taken, but Princeton says financial information remains secure.</description>
    </item>
    <item>
      <title>A Simple WhatsApp Security Flaw Exposed 3.5 Billion Phone Numbers</title>
      <link>https://www.wired.com/story/a-simple-whatsapp-security-flaw-exposed-billions-phone-numbers/</link>
      <pubDate>Tue, 18 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">69138c8af757bec53ccf780a</guid>
      <description>By plugging tens of billions of phone numbers into WhatsApp&#8217;s contact discovery tool, researchers found &#8220;the most extensive exposure of phone numbers&#8221; ever&#8212;along with profile photos and more.</description>
    </item>
    <item>
      <title>Zoox will let public riders use its robotaxis in San Francisco</title>
      <link>https://www.theverge.com/news/822096/zoox-robotaxi-sf-waitlist-rides</link>
      <pubDate>2025-11-18T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=822096</guid>
      <description>Zoox is getting closer to a full launch of its robotaxi service in San Francisco. Last month, the Amazon-owned company started allowing select riders to hail its toaster-shaped, four-passenger vehicles for the first time. And today, Zoox is finally inviting members off its public waitlist, which it calls &#8220;Zoox Explorers,&#8221; to do the same. The [&#8230;]</description>
    </item>
    <item>
      <title>Wyze&#8217;s budget-friendly smart lock gets a Wi-Fi upgrade without a price increase</title>
      <link>https://www.theverge.com/news/822276/wyze-lock-bolt-v2-wifi-bluetooth-smart-door-lock</link>
      <pubDate>2025-11-18T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=822276</guid>
      <description>Wyze has announced a new version of its electronic door lock that features Wi-Fi, allowing it to be controlled remotely from anywhere using a mobile app or voice commands through Amazon Alexa or Google Assistant. The original Wyze Lock Bolt is currently featured in our smart lock buyer&#8217;s guide as the &#8220;best budget smart(ish) lock,&#8221; [&#8230;]</description>
    </item>
    <item>
      <title>Agentio secures $40 million from Forerunner as it scales its creator marketplace beyond YouTube</title>
      <link>https://techcrunch.com/2025/11/18/agentio-secures-40-million-from-forerunner-as-it-scales-its-creator-marketplace-beyond-youtube/</link>
      <pubDate>Tue, 18 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068291</guid>
      <description>Agentio, which matches creators with brands, is expanding beyond YouTube and testing Meta platforms to facilitate sponsored content.</description>
    </item>
    <item>
      <title>Boop&#8217;s new app turns social recommendations into bookable itineraries</title>
      <link>https://techcrunch.com/2025/11/18/boops-new-app-turns-social-recommendations-into-bookable-itineraries/</link>
      <pubDate>Tue, 18 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068493</guid>
      <description>Instead of getting an AI-generated travel plan, Boop aims to give users access to itineraries from real people who went on real trips.</description>
    </item>
    <item>
      <title>Stack Overflow is remaking itself into an AI data provider</title>
      <link>https://techcrunch.com/2025/11/18/stack-overflow-is-remaking-itself-into-an-ai-data-provider/</link>
      <pubDate>Tue, 18 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068567</guid>
      <description>Stack Overflow wants to remake its classic problem-solving forum into a tool for translating human expertise into an AI-accessible format.</description>
    </item>
    <item>
      <title>Zoox to begin offering robotaxi rides to public in San Francisco</title>
      <link>https://techcrunch.com/2025/11/18/zoox-to-begin-offering-robotaxi-rides-to-public-in-san-francisco/</link>
      <pubDate>Tue, 18 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068591</guid>
      <description>This is not a large-scale public launch, nor a commercial one. But it brings the Amazon-owned company one step closer to competing with Waymo.</description>
    </item>
    <item>
      <title>Zap Energy ramps up the pressure in its latest fusion device</title>
      <link>https://techcrunch.com/2025/11/18/zap-energy-ramps-up-the-pressure-in-its-latest-fusion-device/</link>
      <pubDate>Tue, 18 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068596</guid>
      <description>Zap Energy's Fuze-3 device has generated record plasma pressures for the startup's unique approach to fusion power.</description>
    </item>
    <item>
      <title>Creator Tayla Cannon recieves $1.1 million investment from Slow Ventures&#8217; creator fund to build PT software</title>
      <link>https://techcrunch.com/2025/11/18/pt-software-rebuildr-recieves-1-1-million-investment-from-slow-ventures-creator-fund/</link>
      <pubDate>Tue, 18 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068712</guid>
      <description>Tayla&#160;Cannon's Rebuildr receives $1.1 million investment from Slow Ventures</description>
    </item>
    <item>
      <title>Bose's 5-star QuietComfort Ultra Earbuds (2nd Gen) just dropped to their lowest ever price &#8211; run to grab these!</title>
      <link>https://www.techradar.com/seasonal-sales/boses-5-star-quietcomfort-ultra-earbuds-2nd-gen-just-dropped-to-their-lowest-ever-price-run</link>
      <pubDate>Tue, 18 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">CDk4bMKwi8NXYY5W7TWv7N</guid>
      <description>Bose's 2025-release noise-nixing earbuds just dropped to their lowest ever price and for this money, I say buy now!</description>
    </item>
    <item>
      <title>The 30 most bike-friendly cities in the world</title>
      <link>https://www.fastcompany.com/91442963/the-30-most-bike-friendly-cities-in-the-world</link>
      <pubDate>2025-11-18T14:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91442963/the-30-most-bike-friendly-cities-in-the-world</guid>
      <description>The 2025 Copenhagenize Index shows which cities have done the most&#8212;from redesigning streets to growing bike share systems and building bike storage&#8212;to make it easy to get around on two wheels.
Over the last decade, dozens of cities have reshaped streets around cycling and slower, safer, healthier travel. Take Paris: at rush hour, boulevards that were once packed with cars are now filled with thousands of people on bikes, newly planted trees, and cleaner air....</description>
    </item>
    <item>
      <title>Waymo is bringing fully autonomous driving to five more cities</title>
      <link>https://www.fastcompany.com/91443871/waymo-fully-autonomous-miami-orlando-dallas-houston-san-antonio</link>
      <pubDate>2025-11-18T14:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91443871/waymo-fully-autonomous-miami-orlando-dallas-houston-san-antonio</guid>
      <description>The robotaxi company is removing the human driver from its pilot programs across two states&#8212;the latest sign of its increasing ability to scale.
Before Waymo was Waymo, it was Google&#8217;s self-driving car project. Starting in 2009, the effort spent many years in test mode&#8212;with humans in the driver&#8217;s seats ready to take over, just in case&#8212;that its vision of vehicular autonomy often felt far from practical reality....</description>
    </item>
    <item>
      <title>Impression 3D : Bambu Lab d&#233;voile la H2C avec changement automatique de t&#234;tes</title>
      <link>https://www.frandroid.com/marques/bambu-lab/2872409_impression-3d-bambu-lab-devoile-le-h2c-avec-changement-automatique-de-tetes</link>
      <pubDate>Tue, 18 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bambu-lab/2872409_impression-3d-bambu-lab-devoile-le-h2c-avec-changement-automatique-de-tetes</guid>
      <description>
Vous connaissez le "poop" en impression 3D ? Ces montagnes de filament gaspill&#233; quand on change de couleur, cette tour de purge qui consomme parfois plus de plastique que l'objet lui-m&#234;me. Bambu Lab promet d'y mettre fin avec le H2C, une imprimante qui change de t&#234;te d'impression au lieu de nettoyer la buse.
</description>
    </item>
    <item>
      <title>Cloudflare outage takes down X one month after Musk mocked AWS customers</title>
      <link>https://techcrunch.com/2025/11/18/cloudflare-outage-takes-down-x-one-month-after-musk-mocked-aws-customers/</link>
      <pubDate>Tue, 18 Nov 2025 13:59:31 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068717</guid>
      <description>The infrastructure service Cloudflare faced massive outages on Tuesday morning, cutting off access to ChatGPT, Claude, Spotify, X, and other platforms.</description>
    </item>
    <item>
      <title>I've spent the past month testing the Bambu Lab H2C 3D printer and it's not what I was expecting - it's actually much better</title>
      <link>https://www.techradar.com/pro/bambulab-h2c-3d-printer-review</link>
      <pubDate>Tue, 18 Nov 2025 13:59:00 +0000</pubDate>
      <guid isPermaLink="false">vDjfqVcSVjgXMEZG4gBHHh</guid>
      <description>The H2C is one of the most anticipated machines for a long time, featuring not only a dual head but the Vortek Hot-end Change System. It features six mechanically mounted hot ends that are inductively heated to enable up to 7 colours/materials straight out of the box, and most importantly, a design that creates less waste than previous multifilament machines....</description>
    </item>
    <item>
      <title>Une grande partie d&#8217;Internet est en panne : que se passe-t-il avec Cloudflare ?</title>
      <link>https://www.frandroid.com/culture-tech/2873477_une-partie-dinternet-est-en-panne-que-se-passe-t-il</link>
      <pubDate>Tue, 18 Nov 2025 13:56:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/2873477_une-partie-dinternet-est-en-panne-que-se-passe-t-il</guid>
      <description>
De nombreux internautes constatent des probl&#232;mes d'acc&#232;s sur des services comme X(Twitter) ou des sites li&#233;s &#224; Cloudflare. Une panne est en cours.
</description>
    </item>
    <item>
      <title>Le jeu vid&#233;o Roblox commence &#224; contr&#244;ler l&#8217;&#226;ge de ses utilisateurs</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-11-18/le-jeu-video-roblox-commence-a-controler-l-age-de-ses-utilisateurs.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Tue, 18 Nov 2025 08:54:50 -0500</pubDate>
      <guid isPermaLink="false">b7e0c50644de30d3b36ad6b12e4b8381</guid>
      <description>L&#8217;&#233;diteur du jeu vid&#233;o am&#233;ricain Roblox, r&#233;guli&#232;rement accus&#233; de ne pas suffisamment prot&#233;ger ses plus jeunes joueurs, a d&#233;ploy&#233; mardi un syst&#232;me de v&#233;rification d&#8217;&#226;ge, a-t-il annonc&#233; dans un communiqu&#233;.</description>
    </item>
    <item>
      <title>Pico 4 Ultra : le casque VR rival du Meta Quest 3 s&#8217;immerge dans le Black Friday avec 200 &#8364; de r&#233;duction</title>
      <link>https://www.frandroid.com/bons-plans/2866407_pico-4-ultra-le-casque-vr-rival-du-meta-quest-3-simmerge-dans-le-black-friday-avec-200-euros-de-reduction</link>
      <pubDate>Tue, 18 Nov 2025 13:54:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2866407_pico-4-ultra-le-casque-vr-rival-du-meta-quest-3-simmerge-dans-le-black-friday-avec-200-euros-de-reduction</guid>
      <description>
Un casque VR premium sous la barre des 400 euros ? C&#8217;est le Pico 4 Ultra qui profite du Singles Day pour afficher son prix &#224; 399 euros au lieu de 599 euros sur Amazon.
</description>
    </item>
    <item>
      <title>Panne de Cloudflare | Voici pourquoi une partie du web est inaccessible</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-11-18/panne-de-cloudflare/voici-pourquoi-une-partie-du-web-est-inaccessible.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Tue, 18 Nov 2025 08:46:46 -0500</pubDate>
      <guid isPermaLink="false">a6d6e82b17bc3de9b2e5f440eed17e3e</guid>
      <description>Une panne majeure affecte une partie de l&#8217;infrastructure internet mardi matin. Le g&#233;ant am&#233;ricain Cloudflare rencontre des difficult&#233;s techniques qui paralysent l&#8217;acc&#232;s &#224; de nombreux services populaires, dont ChatGPT et le r&#233;seau social X.</description>
    </item>
  </channel>
</rss>
