<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 03 Dec 2025 08:58:21 GMT</lastBuildDate>
    <item>
      <title>Cette BYD vendue en France est un succ&#232;s mondial, comme le prouve cette &#233;tape importante</title>
      <link>https://www.frandroid.com/marques/byd/2896367_cette-byd-vendue-en-france-est-un-succes-mondial-comme-le-prouve-cette-etape-importante</link>
      <pubDate>Wed, 03 Dec 2025 08:56:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2896367_cette-byd-vendue-en-france-est-un-succes-mondial-comme-le-prouve-cette-etape-importante</guid>
      <description>
Lanc&#233;e en 2021, la BYD Dolphin vient officiellement de d&#233;passer la barre du million d&#8217;exemplaires vendus dans le monde. Pour m&#233;moire, la petite voiture &#233;lectrique chinoise est aussi commercialis&#233;e en France.
</description>
    </item>
    <item>
      <title>Les voitures &#233;lectriques seront plus s&#251;res en Europe gr&#226;ce &#224; ce nouveau crash-test&#8230; qui n&#8217;est pas obligatoire</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2896391_les-voitures-electriques-seront-plus-sures-en-europe-grace-a-ce-nouveau-crash-test-qui-nest-pas-obligatoire</link>
      <pubDate>Wed, 03 Dec 2025 08:54:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2896391_les-voitures-electriques-seront-plus-sures-en-europe-grace-a-ce-nouveau-crash-test-qui-nest-pas-obligatoire</guid>
      <description>
L&#8217;EuroNCAP annonce la mise en place d&#8217;un nouveau protocole pour les crash-tests. L&#8217;organisme veut notamment s&#8217;adapter &#224; l&#8217;&#233;volution des voitures et int&#232;gre notamment de nouveaux sc&#233;narios lors des examens.
</description>
    </item>
    <item>
      <title>Qui est UMA ? Le futur robot fran&#231;ais financ&#233; par Xavier Niel qui veut rivaliser avec Tesla et Xpeng</title>
      <link>https://www.frandroid.com/produits-android/2896421_qui-est-uma-le-futur-robot-francais-finance-par-xavier-niel-qui-veut-rivaliser-avec-tesla-et-xpeng</link>
      <pubDate>Wed, 03 Dec 2025 08:41:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2896421_qui-est-uma-le-futur-robot-francais-finance-par-xavier-niel-qui-veut-rivaliser-avec-tesla-et-xpeng</guid>
      <description>
La soci&#233;t&#233; UMA a &#233;t&#233; fond&#233;e &#224; Paris avec pour seul objectif de cr&#233;er le robot humano&#239;de europ&#233;en qui pourra faire face aux g&#233;ants am&#233;ricains et chinois. 
</description>
    </item>
    <item>
      <title>Au revoir lithium ? Cette batterie au sel r&#233;siste au froid et pourrait tout changer</title>
      <link>https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2896329_au-revoir-lithium-cette-batterie-au-sel-resiste-au-froid-et-pourrait-tout-changer</link>
      <pubDate>Wed, 03 Dec 2025 08:36:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/batteries-et-panneaux-solaires/2896329_au-revoir-lithium-cette-batterie-au-sel-resiste-au-froid-et-pourrait-tout-changer</guid>
      <description>
Alors que la course au stockage d&#8217;&#233;nergie s&#8217;intensifie, des scientifiques am&#233;ricains ont d&#233;velopp&#233; une nouvelle technologie de batterie qui pourrait conduire &#224; des syst&#232;mes plus s&#251;rs, plus efficaces, et surtout, fiables par temps froid.
</description>
    </item>
    <item>
      <title>Ce laptop gamer Lenovo embarque un Ryzen 9, une RTX 5070, et 32 Go de RAM avec un &#233;cran de 16&#8243; (IPS 240 Hz), le tout &#224; -42 %</title>
      <link>https://www.frandroid.com/bons-plans/2895527_ce-laptop-gamer-lenovo-embarque-un-ryzen-9-une-rtx-5070-et-32-go-de-ram-avec-un-ecran-de-16-ips-240-hz-le-tout-a-42</link>
      <pubDate>Wed, 03 Dec 2025 08:34:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2895527_ce-laptop-gamer-lenovo-embarque-un-ryzen-9-une-rtx-5070-et-32-go-de-ram-avec-un-ecran-de-16-ips-240-hz-le-tout-a-42</guid>
      <description>
Le Legion Pro 5 de Lenovo ne tremble pas d&#232;s qu'un nouveau AAA pointe le bout de son nez. Avec une fiche technique impressionnante entre RTX 5070, 32 Go de RAM et un processeur Ryzen 9, il a tout pour prendre vos soir&#233;es. M&#234;me son prix devient int&#233;ressant, il passe de 2 599 euros &#224; 1 499 euros.
</description>
    </item>
    <item>
      <title>Ce nouveau smartphone pliable veut tuer le Samsung Galaxy Z Flip avec son prix</title>
      <link>https://www.frandroid.com/marques/nubia/2896471_ce-nouveau-smartphone-pliable-veut-tuer-le-samsung-galaxy-z-flip-avec-son-prix</link>
      <pubDate>Wed, 03 Dec 2025 08:30:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nubia/2896471_ce-nouveau-smartphone-pliable-veut-tuer-le-samsung-galaxy-z-flip-avec-son-prix</guid>
      <description>
Vous h&#233;sitiez &#224; passer au pliable &#224; cause du prix ? Le Nubia Flip 3 pourrait vous faire changer d'avis. Successeur d'un mod&#232;le d&#233;j&#224; tr&#232;s abordable, cette nouvelle version corrige le tir l&#224; o&#249; &#231;a compte : l'&#233;cran externe devient gigantesque. Mais attention, &#224; ce prix-l&#224;, il y a forc&#233;ment des compromis.
</description>
    </item>
    <item>
      <title>Gr&#226;ce aux iPhone 17, Apple va battre un record de ventes</title>
      <link>https://www.01net.com/actualites/grace-iphone-17-apple-battre-record-ventes.html</link>
      <pubDate>Wed, 03 Dec 2025 08:23:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313292</guid>
      <description>Le carton des iPhone 17 d&#233;passe les pr&#233;visions. Sur tous les march&#233;s, y compris la Chine, le nouvel iPhone rencontre un succ&#232;s colossal. Gr&#226;ce &#224; sa gamme, Apple devrait vendre plus de 247 millions d&#8217;iPhone en 2025, marquant un nouveau record de ventes.</description>
    </item>
    <item>
      <title>Mistral Large 3 et Ministral : la r&#233;ponse fran&#231;aise &#224; GPT-5.1 et Gemini 3 Pro est open source et multimodale</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2896427_mistral-large-3-et-ministral-la-reponse-francaise-a-gpt-5-1-et-gemini-3-pro-est-open-source-et-multimodale</link>
      <pubDate>Wed, 03 Dec 2025 08:23:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2896427_mistral-large-3-et-ministral-la-reponse-francaise-a-gpt-5-1-et-gemini-3-pro-est-open-source-et-multimodale</guid>
      <description>
La course &#224; la taille est termin&#233;e, place &#224; l'efficacit&#233;. Alors que la Silicon Valley s'&#233;charpe pour construire des data centers nucl&#233;aires, Mistral AI prend le contrepied total. La startup fran&#231;aise vient d'annoncer Mistral 3, une famille de mod&#232;les con&#231;us pour tourner partout, de votre smartphone &#224; un robot d'usine, sans la moindre connexion internet.
...</description>
    </item>
    <item>
      <title>&#171;&#160;Un taux de panne extr&#234;mement &#233;lev&#233; et une dur&#233;e de vie plus courte&#160;&#187; : ces batteries Tesla produites en Chine point&#233;es du doigt</title>
      <link>https://www.frandroid.com/marques/tesla/2896327_un-taux-de-panne-extremement-eleve-et-une-duree-de-vie-plus-courte-ces-batteries-tesla-produites-en-chine-pointees-du-doigt</link>
      <pubDate>Wed, 03 Dec 2025 08:17:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2896327_un-taux-de-panne-extremement-eleve-et-une-duree-de-vie-plus-courte-ces-batteries-tesla-produites-en-chine-pointees-du-doigt</guid>
      <description>
Tesla &#233;quipe certaines de ses voitures &#233;lectriques vendues en Europe de batteries fournies par LG. Probl&#232;me, ces derni&#232;res affichent une fiabilit&#233; tr&#232;s moyenne, avec un taux de d&#233;gradation particuli&#232;rement &#233;lev&#233;.
</description>
    </item>
    <item>
      <title>Android 16 permet d&#8217;&#233;pingler des onglets dans Chrome</title>
      <link>https://www.01net.com/actualites/android-16-permet-depingler-des-onglets-dans-chrome.html</link>
      <pubDate>Wed, 03 Dec 2025 08:01:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313266</guid>
      <description>Vous avez ador&#233; les nouveaut&#233;s du jour pour les Pixel ? Vous adorerez celles pour Android 16 que Google a livr&#233;es en parall&#232;le. Au menu : des outils de s&#233;curit&#233; dop&#233;s &#224; l&#8217;IA, des fonctions d&#8217;accessibilit&#233; plus pouss&#233;es, des appels marqu&#233;s comme &#171; urgents &#187;, des sous-titres capables d&#8217;exprimer les &#233;motions&#8230; et m&#234;me la possibilit&#233; d&#8217;&#233;pingler des onglets dans Chrome sur mobile....</description>
    </item>
    <item>
      <title>Can&#8217;t wait for Virgin River season 7? Watch new Netflix Christmas movie My Secret Santa &#8211; you won&#8217;t be disappointed</title>
      <link>https://www.techradar.com/streaming/netflix/my-secret-santa-christmas-movie-review</link>
      <pubDate>Wed, 03 Dec 2025 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">UdJtm7qN25LTgvJNE7WZT7</guid>
      <description>I can&#8217;t believe I&#8217;m impressed by a Netflix Christmas movie, but My Secret Santa is the best of the year.</description>
    </item>
    <item>
      <title>I&#8217;m hungry like the wolf for this Duran Duran-themed jewel-encrusted Walkman</title>
      <link>https://www.techradar.com/audio/audio-streaming/im-hungry-like-the-wolf-for-this-duran-duran-themed-jewel-encrusted-walkman</link>
      <pubDate>Wed, 03 Dec 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">iW9HsdmeFhyiGhsh9te9fm</guid>
      <description>Wild boys (wild boys!) never lose it &#8211; and by 'it', I do mean this super-sparkly Duran Duran Walkman</description>
    </item>
    <item>
      <title>Finally, I have fast office Wi-Fi over a cellular network, thanks to the Devolo Wi-Fi 6 router - here's my experience testing it</title>
      <link>https://www.techradar.com/computing/devolo-wifi-6-router-3600-5g-lte-review</link>
      <pubDate>Wed, 03 Dec 2025 07:47:00 +0000</pubDate>
      <guid isPermaLink="false">4j6kTwXkN3ZrpZjzEtg745</guid>
      <description>The Devolo WiFi 6 Router 3600 5G LTE is a network-enabled router that makes it possible to connect to either a standard broadband connection or, with a SIM installed, use a mobile for internet connection. This means that as long as you have AC power, you can use this powerful dual-band WiFi 6 router in almost any location.</description>
    </item>
    <item>
      <title>Les virements bancaires seront bloqu&#233;s &#224; No&#235;l ? Pas exactement</title>
      <link>https://www.frandroid.com/services/banque-en-ligne/2896371_les-virements-bancaires-seront-bloques-a-noel-pas-exactement</link>
      <pubDate>Wed, 03 Dec 2025 07:43:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/banque-en-ligne/2896371_les-virements-bancaires-seront-bloques-a-noel-pas-exactement</guid>
      <description>
En raison d'une fermeture d'un syst&#232;me europ&#233;en, les anciens virements seront bloqu&#233;s pendant plusieurs jours. Il sera toujours possible de faire des virements instantan&#233;s.
</description>
    </item>
    <item>
      <title>&#171;&#8201;Nous avons &#233;cout&#233;, silencieusement&#8201;&#187;&#160;: Samsung promet de rattraper le tir avec la future puce des Galaxy&#160;S26</title>
      <link>https://www.frandroid.com/marques/samsung/2896373_nous-avons-ecoute-silencieusement-samsung-promet-de-rattraper-le-tir-avec-la-future-puce-des-galaxy-s26</link>
      <pubDate>Wed, 03 Dec 2025 07:39:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2896373_nous-avons-ecoute-silencieusement-samsung-promet-de-rattraper-le-tir-avec-la-future-puce-des-galaxy-s26</guid>
      <description>
Comme &#224; son habitude, Samsung a commenc&#233; &#224; donner des informations parcellaires sur sa prochaine puce mobile, la Exynos&#160;2600. Et le constructeur cor&#233;en fait, d&#8217;abord et avant tout, un curieux exercice de contrition.
</description>
    </item>
    <item>
      <title>V&#233;ligo&#160;: le service de location de v&#233;los &#233;lectriques d&#233;voile ses nouveaux VAE</title>
      <link>https://www.01net.com/actualites/veligo-le-service-de-location-de-velos-electriques-devoile-ses-nouveaux-vae.html</link>
      <pubDate>Wed, 03 Dec 2025 07:38:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313205</guid>
      <description>Le syst&#232;me de location de v&#233;los aux particuliers V&#233;ligo se r&#233;invente en 2026 et introduit une nouvelle g&#233;n&#233;ration de produits con&#231;us pour r&#233;pondre plus largement aux besoins des usagers.</description>
    </item>
    <item>
      <title>Et si vos jeux Steam tournaient bient&#244;t sur smartphone&#160;?</title>
      <link>https://www.01net.com/actualites/et-si-vos-jeux-steam-tournaient-bientot-sur-smartphone.html</link>
      <pubDate>Wed, 03 Dec 2025 07:30:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313263</guid>
      <description>Et si les jeux Steam pouvaient un jour tourner en local sur un smartphone ? L'hypoth&#232;se, farfelue il y a quelques ann&#233;es, devient un peu plus cr&#233;dible aujourd'hui : Valve travaille en effet &#224; l'adaptation de SteamOS aux processeurs Arm.</description>
    </item>
    <item>
      <title>Le tout r&#233;cent OnePlus 15 perd d&#233;j&#224; 100 &#8364; sur sa version 16/512 Go avec un cadeau en prime</title>
      <link>https://www.frandroid.com/bons-plans/2895271_le-tout-recent-oneplus-15-perd-deja-100-e-sur-sa-version-16-512-go-avec-un-cadeau-en-prime</link>
      <pubDate>Wed, 03 Dec 2025 07:19:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2895271_le-tout-recent-oneplus-15-perd-deja-100-e-sur-sa-version-16-512-go-avec-un-cadeau-en-prime</guid>
      <description>
OnePlus change sa fa&#231;on d'aborder le march&#233; avec sa nouvelle monture num&#233;rot&#233; 15. Cette nouvelle it&#233;ration est pens&#233;e comme une console portable, une b&#234;te de calcul et un &#233;cran qui s'oriente sur la performance. Sortie il y a peu de temps, il b&#233;n&#233;ficie d&#233;j&#224; d'une belle baisse de prix sur OnePlus : de 1 129 euros &#224; 1029 euros sur le site de la marque.
...</description>
    </item>
    <item>
      <title>Google Pixel&#160;: la mise &#224; jour qu&#8217;on attendait est enfin l&#224;</title>
      <link>https://www.01net.com/actualites/google-pixel-mise-a-jour-attendait-enfin-la.html</link>
      <pubDate>Wed, 03 Dec 2025 07:16:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313147</guid>
      <description>&#171; L'autre &#187; mise &#224; jour de d&#233;cembre pour les Google Pixel corrige pas moins de 33 probl&#232;mes, parfois tr&#232;s g&#234;nants. On fait le point.</description>
    </item>
    <item>
      <title>Google Lens d&#233;tecte les arnaques dans vos messages</title>
      <link>https://www.01net.com/actualites/google-lens-detecte-les-arnaques-dans-vos-messages.html</link>
      <pubDate>Wed, 03 Dec 2025 07:13:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313296</guid>
      <description>Le module de recherche visuelle de Google ajoute une nouvelle corde &#224; son arc. Vous pouvez d&#233;sormais soumettre les messages que vous recevez &#224; Google Lens pour identifier les arnaques.</description>
    </item>
    <item>
      <title>Amazon removes AI-generated anime dubs after uproar</title>
      <link>https://mashable.com/article/amazon-ai-dub-anime-banana-fish</link>
      <pubDate>Wed, 03 Dec 2025 07:03:48 +0000</pubDate>
      <guid isPermaLink="false">00pDOmeYhVFs98y9pFCGlKJ</guid>
      <description>Amazon removed AI-generated English dubs for anime "Banana Fish," "No Game No Life: Zero," and "Vinland Saga" after ridicule.</description>
    </item>
    <item>
      <title>Healthify upgrades its AI assistant Ria with real-time conversation capabilities</title>
      <link>https://techcrunch.com/2025/12/02/healthify-upgrades-its-ai-assistant-ria-with-real-time-conversation-capabilities/</link>
      <pubDate>Wed, 03 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3071712</guid>
      <description>Healtify is adding live conversation capabilities to its AI assistant, powered by OpenAI's realtime APIs</description>
    </item>
    <item>
      <title>The simple mindset shift that makes teams more creative</title>
      <link>https://www.fastcompany.com/91451197/the-simple-mindset-shift-that-makes-teams-more-creative</link>
      <pubDate>2025-12-03T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91451197/the-simple-mindset-shift-that-makes-teams-more-creative</guid>
      <description>Pessimism can quietly drain your business. A simple mindset shift&#8212;&#8217;Yes, and&#8217;&#8212;can help teams stay positive and engaged.
During college, a friend convinced me to take an improv comedy class. An introvert by nature, I was way out of my depth. On the first day, I was so nervous I thought I might faint. But I ended up loving it&#8212;and learning a lot. In addition to silly warm-ups to get rid of inhibitions (zip, zap, zop, anyone?), I discovered the magic of &#8220;Yes, and . . .&#8221;...</description>
    </item>
  </channel>
</rss>
