<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 09 Jan 2026 11:23:31 GMT</lastBuildDate>
    <item>
      <title>Marre des Shorts ? YouTube d&#233;ploie un nouveau filtre pour faire le m&#233;nage</title>
      <link>https://www.frandroid.com/marques/google/2936993_marre-des-shorts-youtube-deploie-un-nouveau-filtre-pour-faire-le-menage</link>
      <pubDate>Fri, 09 Jan 2026 11:22:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2936993_marre-des-shorts-youtube-deploie-un-nouveau-filtre-pour-faire-le-menage</guid>
      <description>
YouTube r&#233;pond enfin &#224; l'une des critiques les plus r&#233;currentes de ses utilisateurs. La plateforme d&#233;ploie actuellement une mise &#224; jour de son moteur de recherche int&#233;grant des filtres permettant d'exclure ou d'isoler sp&#233;cifiquement les Shorts.
</description>
    </item>
    <item>
      <title>Kia d&#233;voile l&#8217;EV2, son arme contre les Renault &#233;lectriques pas ch&#232;res</title>
      <link>https://www.01net.com/actualites/kia-devoile-lev2-son-arme-contre-les-renault-electriques-pas-cheres.html</link>
      <pubDate>Fri, 09 Jan 2026 11:21:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319019</guid>
      <description>Au tour de Kia de d&#233;voiler sa citadine &#233;lectrique pas ch&#232;re. Cousine de l&#8217;Inster chez Hyundai, cette EV2 avance avec ses arguments dont un imparable : con&#231;ue en Europe, elle b&#233;n&#233;ficiera du bonus &#233;cologique.</description>
    </item>
    <item>
      <title>Grand Theft Auto 6 might not release this year after all as the game is reportedly 'not content complete'</title>
      <link>https://www.techradar.com/gaming/consoles-pc/grand-theft-auto-6-might-not-release-this-year-after-all-as-the-game-is-reportedly-not-content-complete</link>
      <pubDate>Fri, 09 Jan 2026 11:16:02 +0000</pubDate>
      <guid isPermaLink="false">nbZVBjo7ufd2NqseKAREqR</guid>
      <description>Could we be looking at another GTA 6 delay? A reliable reporter claims that the game is not quite finished.</description>
    </item>
    <item>
      <title>D&#233;j&#224; abordable, la Xiaomi Electric Scooter 5 Max chute sous les 500 &#8364; pendant les soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2930255_deja-abordable-la-xiaomi-electric-scooter-5-max-chute-sous-les-500-e-pendant-les-soldes-dhiver</link>
      <pubDate>Fri, 09 Jan 2026 11:16:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930255_deja-abordable-la-xiaomi-electric-scooter-5-max-chute-sous-les-500-e-pendant-les-soldes-dhiver</guid>
      <description>
Lanc&#233;e l'an dernier, la Xiaomi Electric Scooter 5 Max figure encore aujourd'hui parmi les meilleures trottinettes haut de gamme du moment. Elle compte aussi parmi les moins ch&#232;res, et pendant les soldes d'hiver, on la trouve &#224; 499,99 euros au lieu de 609,99 euros &#224; la Fnac. 
</description>
    </item>
    <item>
      <title>The Nintendo Switch 2 may have been the fastest-selling console at launch, but its first Christmas sales disappoint</title>
      <link>https://www.techradar.com/gaming/the-nintendo-switch-2-may-have-been-the-fastest-selling-console-at-launch-but-its-first-christmas-sales-disappoint</link>
      <pubDate>Fri, 09 Jan 2026 11:13:11 +0000</pubDate>
      <guid isPermaLink="false">Y2WBuP5JaMLRw64tjMDwCH</guid>
      <description>Nintendo Switch 2's first Christmas sales fall short of the original Switch by 35% in the US, showing markedly less of an appetite over the Holidays.</description>
    </item>
    <item>
      <title>Je suis mont&#233; &#224; bord de la Leapmotor B05, et je pense que cette voiture &#233;lectrique chinoise pourrait faire mal &#224; la Peugeot 308</title>
      <link>https://www.frandroid.com/marques/leapmotor/2936781_je-suis-monte-a-bord-de-la-leapmotor-b05-et-je-pense-que-cette-voiture-electrique-chinoise-pourrait-faire-mal-a-la-peugeot-308</link>
      <pubDate>Fri, 09 Jan 2026 11:12:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/leapmotor/2936781_je-suis-monte-a-bord-de-la-leapmotor-b05-et-je-pense-que-cette-voiture-electrique-chinoise-pourrait-faire-mal-a-la-peugeot-308</guid>
      <description>
D&#233;voil&#233;e en septembre 2025, la Leapmotor B05 fait son arriv&#233;e officielle en Europe. Nous avons pu monter &#224; bord de cette voiture &#233;lectrique rivale des Renault M&#233;gane E-Tech et Peugeot E-308, l'occasion de voir qu'elle ne manquait pas d'arguments.
</description>
    </item>
    <item>
      <title>All the tech and gadgets announced at CES 2026</title>
      <link>https://www.engadget.com/general/all-the-tech-and-gadgets-announced-at-ces-2026-130124023.html?src=rss</link>
      <pubDate>Fri, 09 Jan 2026 11:11:04 +0000</pubDate>
      <guid isPermaLink="false">fd3b4bbf-1b78-4e34-9914-70a2e6f85389</guid>
      <description>It's the first week of a new year and there's no time for the tech world to slowly ease back into things following the holidays. That's because CES 2026 is in full swing, with all manner of companies descending on Las Vegas to reveal their latest innovations and what they're planning to bring your way in the near future.&#160;Many of the Engadget crew are on the ground to check out as much of the new tech as possible. Of course, we're keeping tabs on all of the major CES press conferences too. Samsung held its First Look presentation, which focuses on home products, while LG has shown off a wide ar...</description>
    </item>
    <item>
      <title>Bose shows Sonos and Spotify how it's done &#8212; shutting down servers won't shut down your old SoundTouch speakers</title>
      <link>https://www.techradar.com/audio/wireless-bluetooth-speakers/bose-shows-sonos-and-spotify-how-its-done-shutting-down-servers-wont-shut-down-your-old-soundtouch-speakers</link>
      <pubDate>Fri, 09 Jan 2026 11:07:02 +0000</pubDate>
      <guid isPermaLink="false">YgnyubCGUxFLZMYst7B7RV</guid>
      <description>Sonos take note: Bose is shutting down its older SoundTouch speakers' servers, but rather than brick them, the audio giant wants to help you keep using them</description>
    </item>
    <item>
      <title>Burtran Nano-Oxy Smart Air Purifier: Safe Sleep?</title>
      <link>https://www.wired.com/review/burtran-nano-oxy-hepa-14-air-purifier/</link>
      <pubDate>Fri, 09 Jan 2026 11:02:00 +0000</pubDate>
      <guid isPermaLink="false">695bdafb014012a3ee521124</guid>
      <description>This negative-oxygen-ion-generating purifier claims to create a &#8220;forestlike atmosphere&#8221; in your bedroom.</description>
    </item>
    <item>
      <title>Cyberattaques&#160;: la France rel&#226;che le basketteur russe soup&#231;onn&#233; d&#8217;extorsion par ransomware</title>
      <link>https://www.01net.com/actualites/cyberattaques-france-relache-basketteur-russe-soupconne-extorsion-ransomware.html</link>
      <pubDate>Fri, 09 Jan 2026 11:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319054</guid>
      <description>Le basketteur russe Daniil Kasatkin a &#233;t&#233; lib&#233;r&#233; par la France. Les autorit&#233;s fran&#231;aises ont accept&#233; de rel&#226;cher l'athl&#232;te, soup&#231;onn&#233; de complicit&#233; dans 900 attaques par ransomware, en &#233;change d'un chercheur fran&#231;ais, Laurent Vinatier.</description>
    </item>
    <item>
      <title>Crispr Pioneer Launches Startup to Make Tailored Gene-Editing Treatments</title>
      <link>https://www.wired.com/story/crispr-pioneer-launches-startup-to-make-tailored-gene-editing-treatments/</link>
      <pubDate>Fri, 09 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">695e76d54e793bb818c7d36a</guid>
      <description>Aurora Therapeutics, cofounded by Nobel Prize&#8211;winning scientist Jennifer Doudna, plans to use gene editing and a new FDA regulatory pathway to commercialize treatments for rare diseases.</description>
    </item>
    <item>
      <title>TechRadar Pro, Residential Systems, and TWICE announce CES Picks 2026 winners</title>
      <link>https://www.techradar.com/pro/techradar-pro-residential-systems-and-twice-announce-ces-picks-2026-winners</link>
      <pubDate>Fri, 09 Jan 2026 10:58:14 +0000</pubDate>
      <guid isPermaLink="false">rXhiXjjdDTxrn9aj9HXPs4</guid>
      <description>See which companies took home this year's awards!</description>
    </item>
    <item>
      <title>Microsoft&#160;is making it much easier to add hyperlinks in Word docs</title>
      <link>https://www.theverge.com/news/859288/microsoft-word-hyperlinks-new-shortcut</link>
      <pubDate>2026-01-09T05:58:11-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=859288</guid>
      <description>Microsoft is making it a lot faster and easier to add links to text inside Word documents. Instead of having to open a menu item to insert a link or use the CTRL + K keyboard shortcut, you can now simply paste a link on top of the text you want to hyperlink. This new [&#8230;]</description>
    </item>
    <item>
      <title>La Nasa envisage un retour d&#8217;urgence de 4 astronautes &#224; bord de la Station spatiale : ce que l&#8217;on sait (et ce qui inqui&#232;te)</title>
      <link>https://www.futura-sciences.com/sciences/actualites/nasa-nasa-envisage-retour-urgence-4-astronautes-bord-station-spatiale-ce-on-sait-et-ce-inquiete-129975/#xtor%3DRSS-8</link>
      <pubDate>Fri, 09 Jan 2026 11:57:33 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/nasa-nasa-envisage-retour-urgence-4-astronautes-bord-station-spatiale-ce-on-sait-et-ce-inquiete-129975/#xtor%3DRSS-8</guid>
      <description>La Nasa pourrait &#234;tre contrainte &#224; un rapatriement d'urgence de l'&#233;quipage du Crew-11, actuellement &#224; bord de la Station spatiale internationale, en raison d'un probl&#232;me m&#233;dical pr&#233;occupant. Alors qu'un des astronautes pourrait faire face &#224; une maladie ou une blessure suffisamment grave pour...</description>
    </item>
    <item>
      <title>Voiture de l&#8217;ann&#233;e 2026 : voici le mod&#232;le qui succ&#232;de &#224; la Renault 5 E-Tech</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2936485_voiture-de-lannee-2026-voici-le-modele-qui-succede-a-la-renault-5-e-tech</link>
      <pubDate>Fri, 09 Jan 2026 10:54:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2936485_voiture-de-lannee-2026-voici-le-modele-qui-succede-a-la-renault-5-e-tech</guid>
      <description>
C'est tomb&#233; avant midi au Salon de Bruxelles. Apr&#232;s la Renault 5 l'an dernier, le prestigieux troph&#233;e europ&#233;en de la Voiture de l'ann&#233;e 2026 a &#233;t&#233; d&#233;cern&#233; &#224; la Mercedes-Benz CLA. Elle s'impose face &#224; six autres finalistes dans un contexte o&#249; l'industrie cherche encore ses rep&#232;res.
</description>
    </item>
    <item>
      <title>Amazon frappe fort pour le d&#233;but des soldes d&#8217;hiver : les 12 deals Tech &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2933045_amazon-frappe-fort-pour-le-debut-des-soldes-dhiver-les-10-deals-tech-a-retenir</link>
      <pubDate>Fri, 09 Jan 2026 10:49:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933045_amazon-frappe-fort-pour-le-debut-des-soldes-dhiver-les-10-deals-tech-a-retenir</guid>
      <description>
Les soldes d&#8217;hiver battent leur plein, et m&#234;me si Amazon ne communique pas officiellement sur sa participation, de nombreuses offres et remises sont en ligne pour le week-end. C&#8217;est le moment id&#233;al pour profiter de ces offres Tech &#224; prix r&#233;duit et bien commencer l&#8217;ann&#233;e 2026.
</description>
    </item>
    <item>
      <title>Nvidia aurait-il l&#226;ch&#233; l&#8217;affaire avec les RTX 50 Super ? Une nouvelle fuite semble le confirmer</title>
      <link>https://www.frandroid.com/marques/nvidia/2936749_nvidia-aurait-il-lache-laffaire-avec-les-rtx-50-super-une-nouvelle-fuite-semble-le-confirmer</link>
      <pubDate>Fri, 09 Jan 2026 10:36:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2936749_nvidia-aurait-il-lache-laffaire-avec-les-rtx-50-super-une-nouvelle-fuite-semble-le-confirmer</guid>
      <description>
La sortie des GeForce RTX 50 Super semble compromise alors que Nvidia aurait indiqu&#233; &#224; ses partenaires que la gamme a &#233;t&#233; "ind&#233;finiement" retard&#233;e.
</description>
    </item>
    <item>
      <title>&#171; L&#8217;ann&#233;e pass&#233;e a &#233;t&#233; brutale &#187; : nouvelle faillite dans le v&#233;lo, un acteur belge sombre cette fois-ci</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2936675_lannee-passee-a-ete-brutale-nouvelle-faillite-dans-le-velo-un-acteur-belge-sombre-cette-fois-ci</link>
      <pubDate>Fri, 09 Jan 2026 10:26:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2936675_lannee-passee-a-ete-brutale-nouvelle-faillite-dans-le-velo-un-acteur-belge-sombre-cette-fois-ci</guid>
      <description>
La soci&#233;t&#233; belge Rein4ced, sp&#233;cialis&#233;e dans les mat&#233;riaux composites et notamment connue pour ses cadres de v&#233;los en carbone, a &#233;t&#233; d&#233;clar&#233;e en faillite, comme l&#8217;a annonc&#233; son PDG et cofondateur, Micha&#235;l Callens.
</description>
    </item>
    <item>
      <title>&#171;&#160;Pour la premi&#232;re fois en 25 ans&#160;&#187; : la NASA rapatrie un &#233;quipage de l&#8217;ISS pour raison m&#233;dicale</title>
      <link>https://www.01net.com/actualites/pour-la-premiere-fois-en-25-ans-la-nasa-rapatrie-un-equipage-de-liss-pour-raison-medicale.html</link>
      <pubDate>Fri, 09 Jan 2026 10:26:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319018</guid>
      <description>C&#8217;est une premi&#232;re dans les 25 ans d&#8217;histoire de la Station spatiale internationale. La NASA a ordonn&#233; le retour anticip&#233; de la mission Crew-11 pour soigner un astronaute. L'identit&#233; du malade reste secr&#232;te.</description>
    </item>
    <item>
      <title>iOS 26 adoption on iPhones is staggeringly low &#8211; here are 3 reasons why</title>
      <link>https://www.techradar.com/phones/ios/ios-26-adoption-on-iphones-is-staggeringly-low-here-are-3-reasons-why</link>
      <pubDate>Fri, 09 Jan 2026 10:21:27 +0000</pubDate>
      <guid isPermaLink="false">DiC94mRZQoAroCsywTGyDR</guid>
      <description>iOS 26 is seemingly proving very unpopular, and Liquid Glass could be a big part of the reason why.</description>
    </item>
    <item>
      <title>The Kindle Colorsoft Kids is $50 off at Amazon right now</title>
      <link>https://mashable.com/article/jan-9-kindle-colorsoft-kids-deal</link>
      <pubDate>Fri, 09 Jan 2026 10:21:23 +0000</pubDate>
      <guid isPermaLink="false">01AaehUjoupEkqLvNTIhrX7</guid>
      <description>As of Jan. 9, the Kindle Colorsoft Kids (16GB) is on sale at Amazon for $219.99, 19% off its list price of $269.99.</description>
    </item>
    <item>
      <title>The Apple Magic Keyboard is at its lowest price in over a year &#8212; save $60 right now</title>
      <link>https://mashable.com/article/jan-9-apple-keyboard-deal</link>
      <pubDate>Fri, 09 Jan 2026 10:16:05 +0000</pubDate>
      <guid isPermaLink="false">06a0KdLI8TZO2aMCMel5lFl</guid>
      <description>Find the best Apple deal. Save 24% on the Apple Magic Keyboard at Amazon.</description>
    </item>
    <item>
      <title>The Daily Show reacts to Trumps ICE shooting response</title>
      <link>https://mashable.com/video/the-daily-show-ice-shooting-ronny-chieng-renee-good</link>
      <pubDate>Fri, 09 Jan 2026 10:16:02 +0000</pubDate>
      <guid isPermaLink="false">01FfO3xIjW0J0k0IVWw6McJ</guid>
      <description>"The Daily Show" host Ronny Chieng reacted to claims by Donald Trump about the killing of Renee Good by an ICE agent in Minneapolis.</description>
    </item>
    <item>
      <title>NYT Connections Sports Edition today: Hints and answers for January 9, 2026</title>
      <link>https://mashable.com/article/nyt-connections-sports-edition-hint-answer-today-january-9-2026</link>
      <pubDate>Fri, 09 Jan 2026 10:11:31 +0000</pubDate>
      <guid isPermaLink="false">03PDJIcbKIlThRDrebdLbUg</guid>
      <description>Connections: Sports Edition is a New York Times word game about finding common sports threads between words. How to solve the day's puzzle.</description>
    </item>
    <item>
      <title>Le nouveau MacBook Pro 14 M5 succombe aux soldes et se trouve d&#233;j&#224; en promotion</title>
      <link>https://www.frandroid.com/bons-plans/2895989_le-nouveau-macbook-pro-14-m5-succombe-aux-soldes-et-se-trouve-deja-en-promotion</link>
      <pubDate>Fri, 09 Jan 2026 10:11:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2895989_le-nouveau-macbook-pro-14-m5-succombe-aux-soldes-et-se-trouve-deja-en-promotion</guid>
      <description>
Le MacBook Pro M5 fait encore des merveilles avec des performances en nette hausse &#224; tous les niveaux. Son &#233;cran reste une r&#233;f&#233;rence sur le march&#233; et son autonomie en fait toujours un bon compagnon. Pendant les soldes, il perd 100 euros et devient encore plus recommandable.&#160;
</description>
    </item>
    <item>
      <title>Strava lance enfin la fonctionnalit&#233; que tous les coureurs attendaient pour progresser</title>
      <link>https://www.frandroid.com/android/applications/2936593_strava-lance-enfin-la-fonctionnalite-que-tous-les-coureurs-attendaient-pour-progresser</link>
      <pubDate>Fri, 09 Jan 2026 10:09:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/applications/2936593_strava-lance-enfin-la-fonctionnalite-que-tous-les-coureurs-attendaient-pour-progresser</guid>
      <description>
Strava a ajout&#233; une corde importante &#224; son arc. L'application pl&#233;biscit&#233;e pour le partage des entra&#238;nements sportifs int&#232;gre d&#233;sormais des s&#233;ances d'entra&#238;nements instantan&#233;s. 
</description>
    </item>
    <item>
      <title>The Waterpik Cordless Pulse is $10 off at Amazon</title>
      <link>https://mashable.com/article/jan-9-water-flosser-deal</link>
      <pubDate>Fri, 09 Jan 2026 10:08:43 +0000</pubDate>
      <guid isPermaLink="false">01EmgxddstfpKCOf7SOGX9U</guid>
      <description>Get the best water flosser deal at Amazon. Save 20% on the Waterpik Cordless at Amazon.</description>
    </item>
    <item>
      <title>The Jackery Explorer 2000 v2 power station is over $1,000 off at Amazon &#8212; bag the best-ever price now</title>
      <link>https://mashable.com/article/jan-9-jackery-power-station-deal</link>
      <pubDate>Fri, 09 Jan 2026 10:06:54 +0000</pubDate>
      <guid isPermaLink="false">07Gqq4GGgarBexzwM97Qp7Q</guid>
      <description>Find the best power station deal on Amazon. Save 52% on the Jackery Explorer 2000 v2 at Amazon.</description>
    </item>
    <item>
      <title>Les anciens Pixel aussi auront le droit &#224; la compatibilit&#233; AirDrop</title>
      <link>https://www.frandroid.com/android/2936471_les-anciens-pixel-aussi-auront-le-droit-a-la-compatibilite-airdrop</link>
      <pubDate>Fri, 09 Jan 2026 10:04:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/2936471_les-anciens-pixel-aussi-auront-le-droit-a-la-compatibilite-airdrop</guid>
      <description>
Des nouvelles lignes de code pr&#233;sentes dans les derni&#232;res versions b&#234;ta d&#8217;Android laissent penser que la toute nouvelle compatibilit&#233; AirDrop pourrait s&#8217;&#233;tendre au-del&#224; du Pixel&#160;10.
</description>
    </item>
    <item>
      <title>NYT Mini crossword answers, hints for January 9, 2026</title>
      <link>https://mashable.com/article/nyt-mini-crossword-answers-hints-january-9-2026</link>
      <pubDate>Fri, 09 Jan 2026 10:02:34 +0000</pubDate>
      <guid isPermaLink="false">05Ss4Ewr3zsaEdcPSJUPB80</guid>
      <description>Answers to each clue for the January 9, 2026 edition of NYT's The Mini crossword puzzle.</description>
    </item>
    <item>
      <title>The Marshall Monitor III headphones made me realize that mid-range headphones dont get enough love</title>
      <link>https://mashable.com/article/marshall-monitor-iii-headphones-review</link>
      <pubDate>Fri, 09 Jan 2026 10:00:58 +0000</pubDate>
      <guid isPermaLink="false">069djT3TXtpFcRf90vONyrF</guid>
      <description>Our headphones expert spent a few weeks with the Marshall Monitor III headphones, and they're some of her new favorite headphones.</description>
    </item>
    <item>
      <title>Une arnaque &#224; la carte bancaire vise votre smartphone&#160;: des pirates chinois ont trouv&#233; le moyen de vider votre compte</title>
      <link>https://www.01net.com/actualites/arnaque-carte-bancaire-vise-votre-smartphone-pirates-chinois-trouve-moyen-vider-compte.html</link>
      <pubDate>Fri, 09 Jan 2026 10:00:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319013</guid>
      <description>Une arnaque &#224; la carte bancaire s&#233;vit actuellement sur les smartphones Android. Des cybercriminels chinois ont en effet trouv&#233; le moyen de siphonner votre compte bancaire en toute impunit&#233;. Plus de 54 variantes de cette attaque &#171;&#8239;Ghost Tapped&#8239;&#187; ont &#233;t&#233; enregistr&#233;es entre 2024 et 2025.</description>
    </item>
    <item>
      <title>This 'ZombieAgent' zero click vulnerability allows for silent account takeover - here's what we know</title>
      <link>https://www.techradar.com/pro/security/this-zombieagent-zero-click-vulnerability-allows-for-silent-account-takeover-heres-what-we-know</link>
      <pubDate>Fri, 09 Jan 2026 10:00:43 +0000</pubDate>
      <guid isPermaLink="false">vSFL5mrPqLAKRuERerqZnJ</guid>
      <description>ChatGPT was vulnerable to prompt injection, but OpenAI apparently fixed it.</description>
    </item>
    <item>
      <title>The 7 best cordless vacuums for 2026</title>
      <link>https://www.engadget.com/home/smart-home/best-cordless-vacuum-130007125.html?src=rss</link>
      <pubDate>Fri, 09 Jan 2026 10:00:36 +0000</pubDate>
      <guid isPermaLink="false">a05e054c-6375-4b7d-a26a-4eb4c914105a</guid>
      <description>Old-school, upright vacuums left a lot to be desired, and cordless models are here to right many of those wrongs. These types of vacuums tend to be thinner, lighter and easy to maneuver around a home, and you don&#8217;t really have to sacrifice suction power anymore to get those benefits. Dyson isn&#8217;t your only option anymore either &#8212; like the robot vacuum space, there are dozens of cordless vacuums to choose from today. Variety is great, but it can also lead to decision fatigue and confusion.We at Engadget can help make that decision a bit easier. After testing a bunch of the best cordless stick va...</description>
    </item>
    <item>
      <title>New movies: the most exciting films coming to theaters in January 2026</title>
      <link>https://www.techradar.com/streaming/entertainment/new-movies-2026-guide</link>
      <pubDate>Fri, 09 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">bPeqrzJCF2cAbj2qCGU2i8</guid>
      <description>New movies are going to arrive weekly throughout 2026 &#8211; these are the biggest ones to look out for.</description>
    </item>
    <item>
      <title>Satya Nadella wants the internet to keep an open mind about AI. The internet isn&#8217;t having it</title>
      <link>https://www.fastcompany.com/91471196/satya-nadella-microsoft-microslop-ai</link>
      <pubDate>2026-01-09T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91471196/satya-nadella-microsoft-microslop-ai</guid>
      <description>&#8216;I will hereby be referring to Microsoft as MicroSlop for the rest of 2026.&#8217;
A new insult for artificial intelligence just dropped thanks to Microsoft&#8217;s CEO.&#160;</description>
    </item>
    <item>
      <title>New discovery just broke the record for fastest-spinning large asteroid</title>
      <link>https://mashable.com/article/fastest-spinning-large-asteroid</link>
      <pubDate>Fri, 09 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00ZUckRyE6vnynMneqSTeho</guid>
      <description>The Vera C. Rubin Observatory has discovered the fastest-spinning large asteroid so far, completing a turn in under two minutes.</description>
    </item>
    <item>
      <title>Greenland 2: Migration review: Gerard Butler returns to be the dad we need</title>
      <link>https://mashable.com/article/greenland-2-migration-review</link>
      <pubDate>Fri, 09 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00I67QP1ovAinCnpY7Rr21H</guid>
      <description>Gerard Butler returns to be the dad we need in "Greenland 2: Migration."</description>
    </item>
    <item>
      <title>How to watch Oregon vs. Indiana online for free</title>
      <link>https://mashable.com/article/oregon-indiana-college-football-2026-live-stream-for-free</link>
      <pubDate>Fri, 09 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">05DELama6qFkWFLYB78T13Y</guid>
      <description>How to watch college football for free. Live stream Oregon vs. Indiana in 2026 without cable.</description>
    </item>
    <item>
      <title>Turn your thoughts into art for a single $35 payment</title>
      <link>https://mashable.com/article/jan-9-imagiyo-ai-image-generator-standard-plan-lifetime-subscription</link>
      <pubDate>Fri, 09 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00MlToc7p9wDZ7hjx7BFTiJ</guid>
      <description>Unlock lifetime access to Imagiyo&#8217;s powerful AI image generator for just $34.97 and create anything your imagination can dream up.</description>
    </item>
    <item>
      <title>How to watch the 2025 Africa Cup of Nations online for free</title>
      <link>https://mashable.com/article/africa-cup-of-nations-2025-live-stream-for-free</link>
      <pubDate>Fri, 09 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01x6w2GJ5DTY19LQCP9NGqI</guid>
      <description>How to watch Africa Cup of Nations for free. Live stream the 2025 Africa Cup of Nations for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Is This Thing On? review: Will Arnett and Bradley Cooper flop on stand-up comedy</title>
      <link>https://mashable.com/article/is-this-thing-on-bradley-cooper-review</link>
      <pubDate>Fri, 09 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">001uXg2ecPMqoliQFUEFMBi</guid>
      <description>Laura Dern deserves better from the New York Film Festival's closing night film, "Is This Thing On?" Review.</description>
    </item>
    <item>
      <title>NYT Pips hints, answers for January 9, 2026</title>
      <link>https://mashable.com/article/pips-nyt-games-hints-answers-easy-medium-hard-january-9-2026</link>
      <pubDate>Fri, 09 Jan 2026 09:55:06 +0000</pubDate>
      <guid isPermaLink="false">03hNhbi0QjMxhPbMLXDXpOI</guid>
      <description>The New York Times' latest game, Pips, brings domino fun to your desktop. How to play Pips as well as hints in case you get stuck.</description>
    </item>
    <item>
      <title>+11 % en un an : pourquoi la facture d&#8217;assurance des voitures &#233;lectriques a fortement augment&#233;</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2936591_11-en-un-an-pourquoi-la-facture-dassurance-des-voitures-electriques-a-fortement-augmente</link>
      <pubDate>Fri, 09 Jan 2026 09:51:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2936591_11-en-un-an-pourquoi-la-facture-dassurance-des-voitures-electriques-a-fortement-augmente</guid>
      <description>
Si les Fran&#231;ais se tournent de plus en plus vers les motorisations &#233;lectrifi&#233;es en 2025, avec une explosion des demandes d'assurance, ils doivent composer avec une facture qui grimpe dangereusement.
</description>
    </item>
    <item>
      <title>Forget &#8216;the UK&#8217;s answer to Rocky&#8217; &#8212; new Pierce Brosnan movie Giant is the Billy Elliot of boxing</title>
      <link>https://www.techradar.com/streaming/entertainment/forget-the-uks-answer-to-rocky-new-pierce-brosnan-movie-giant-is-the-billy-elliot-of-boxing</link>
      <pubDate>Fri, 09 Jan 2026 09:45:35 +0000</pubDate>
      <guid isPermaLink="false">RgMY7nJZcVwMbohdtjMGqY</guid>
      <description>If you've seen a poster for the new boxing movie Giant, you'll have seen it marketed as 'the UK's answer to Rocky' &#8211; but the label is doing it a disservice.</description>
    </item>
    <item>
      <title>Xiaomi&#160;: ces 11 smartphones et tablettes seront priv&#233;s d&#8217;Android 17</title>
      <link>https://www.01net.com/actualites/xiaomi-11-smartphones-tablettes-seront-prives-android-17.html</link>
      <pubDate>Fri, 09 Jan 2026 09:43:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319014</guid>
      <description>C&#8217;est d&#233;j&#224; la fin du voyage pour plusieurs smartphones Xiaomi qui ne verront jamais Android 17.</description>
    </item>
    <item>
      <title>I tried headphones that twist into a Bluetooth speaker &#8212; and I can't believe I actually loved the idea</title>
      <link>https://www.techradar.com/audio/wireless-headphones/i-tried-headphones-that-twist-into-a-bluetooth-speaker-and-i-cant-believe-i-actually-loved-the-idea</link>
      <pubDate>Fri, 09 Jan 2026 09:41:52 +0000</pubDate>
      <guid isPermaLink="false">HntYgtW83DkPcRhgeobMBU</guid>
      <description>It's all about the execution with the TDM Neo &#8212; and the 200-hour battery life doesn't hurt either</description>
    </item>
    <item>
      <title>Voici le Kia EV2 : pourquoi la Renault 4 E-Tech a du souci &#224; se faire face &#224; cette voiture &#233;lectrique abordable</title>
      <link>https://www.frandroid.com/marques/kia/2935801_voici-le-kia-ev2-pourquoi-la-renault-4-e-tech-a-du-souci-a-se-faire-face-a-cette-voiture-electrique-abordable</link>
      <pubDate>Fri, 09 Jan 2026 09:40:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/kia/2935801_voici-le-kia-ev2-pourquoi-la-renault-4-e-tech-a-du-souci-a-se-faire-face-a-cette-voiture-electrique-abordable</guid>
      <description>
Voici le Kia EV2, la nouvelle petite voiture &#233;lectrique de la marque. Face aux autres SUV urbains, il veut proposer un tarif abordable tout en multipliant technologies et astuces pratiques. Suffisant pour inqui&#233;ter les Renault 4 E-Tech ou Peugeot 2008 ?
</description>
    </item>
    <item>
      <title>I tried Fender's new Bluetooth speakers and &#8212; as you'd hope &#8212; they absolutely rock</title>
      <link>https://www.techradar.com/audio/wireless-bluetooth-speakers/i-tried-fenders-new-bluetooth-speakers-and-as-youd-hope-they-absolutely-rock</link>
      <pubDate>Fri, 09 Jan 2026 09:38:54 +0000</pubDate>
      <guid isPermaLink="false">N78AyPcaJULPwUZwx5AxW7</guid>
      <description>Fender Audio's first wireless speakers are built for bass, in a great way</description>
    </item>
    <item>
      <title>Segway Navimow has finally created a compact robot mower that'll treat your lawn with the meticulous care it deserves</title>
      <link>https://www.techradar.com/home/smart-home/segway-navimow-has-finally-created-a-compact-robot-mower-thatll-treat-your-lawn-with-the-meticulous-care-it-deserves</link>
      <pubDate>Fri, 09 Jan 2026 09:31:12 +0000</pubDate>
      <guid isPermaLink="false">6L9dT4ufMLeoCjcwiV8CdG</guid>
      <description>Segway Navimow claims its new bot can create perfect stripes without ever getting stuck or churning up your lawn.</description>
    </item>
    <item>
      <title>Bose refuse de tuer ses vieilles enceintes et r&#233;alise un geste rare</title>
      <link>https://www.01net.com/actualites/bose-refuse-de-tuer-ses-vieilles-enceintes-et-realise-un-geste-rare.html</link>
      <pubDate>Fri, 09 Jan 2026 09:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319008</guid>
      <description>Au lieu de transformer ses anciennes enceintes SoundTouch en d&#233;chets &#233;lectroniques, Bose fait un geste rare. La marque repousse la fin du support &#224; mai 2026 et ouvre sa documentation technique pour que la communaut&#233; puisse prendre le relais.</description>
    </item>
    <item>
      <title>Gigastamping&#160;: c&#8217;est quoi cette nouvelle technique de production qui pourrait rendre les voitures &#233;lectriques encore moins ch&#232;res</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2936423_gigastamping-cest-quoi-cette-nouvelle-technique-de-production-qui-pourrait-rendre-les-voitures-electriques-encore-moins-cheres</link>
      <pubDate>Fri, 09 Jan 2026 09:26:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2936423_gigastamping-cest-quoi-cette-nouvelle-technique-de-production-qui-pourrait-rendre-les-voitures-electriques-encore-moins-cheres</guid>
      <description>
Si Tesla ne jure que par le Gigacasting pour produire ses voitures &#233;lectriques, les marques europ&#233;ennes optent pour une autre m&#233;thode&#160;: le Gigastamping. De quoi s&#8217;agit-il&#160;?
</description>
    </item>
  </channel>
</rss>
