<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 04 Jan 2026 23:23:59 GMT</lastBuildDate>
    <item>
      <title>On est mont&#233;s &#224; bord du MG S6 EV : la MG4 devient un SUV beaucoup plus int&#233;ressante, &#224; un d&#233;tail pr&#232;s</title>
      <link>https://www.frandroid.com/marques/mg/2925707_on-est-montes-a-bord-du-mg-s6-ev-la-mg4-devient-un-suv-beaucoup-plus-interessante-a-un-detail-pres</link>
      <pubDate>Sun, 04 Jan 2026 23:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/mg/2925707_on-est-montes-a-bord-du-mg-s6-ev-la-mg4-devient-un-suv-beaucoup-plus-interessante-a-un-detail-pres</guid>
      <description>
MG m&#8217;a convi&#233; au Royaume-Uni pour d&#233;couvrir en avant-premi&#232;re le S6 EV, son nouveau SUV &#233;lectrique familial qui s'attaque au Tesla Model Y. Voici mes premi&#232;res impressions.
</description>
    </item>
    <item>
      <title>Une Tesla Model S au prix d&#8217;une Model 3 ? Voici les prix de la Xpeng P7+ en France</title>
      <link>https://www.frandroid.com/marques/xpeng/2925943_xpeng-p7-prix-france</link>
      <pubDate>Sun, 04 Jan 2026 23:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2925943_xpeng-p7-prix-france</guid>
      <description>
Xpeng vient enfin d'officialiser les prix de la nouvelle P7+ &#233;lectrique en France. Pour r&#233;sumer : une Tesla Model S au prix d'une Tesla Model 3. Cerise sur le g&#226;teau : c'est la voiture &#233;lectrique qui se recharge le plus rapidement du march&#233;.
</description>
    </item>
    <item>
      <title>How to watch the AMD CES 2026 keynote with CEO Lisa Su live</title>
      <link>https://www.engadget.com/computing/how-to-watch-the-amd-ces-2026-keynote-with-ceo-lisa-su-live-190012438.html?src=rss</link>
      <pubDate>Sun, 04 Jan 2026 22:43:56 +0000</pubDate>
      <guid isPermaLink="false">c864a817-a6e7-423f-ab33-fb69dbcbdab4</guid>
      <description>AMD is kicking off CES 2026 on Monday, where it'll cover its latest AI developments and perhaps show off its newest Ryzen chips. The company will outline the full scope of its vision for AI implementations across the full spectrum of consumer and enterprise applications. The presentation &#8212; which is the lead keynote for CES 2026 &#8212; will be led by CEO Dr. Lisa Su.
We'll tell you how to tune in to the livestream and what else you can expect to see.
How to watch AMD's keynote live
Dr. Su will deliver a keynote speech from the Palazzo Ballroom at the Venetian on Monday, January 5 at 9:30PM ET (6:30P...</description>
    </item>
    <item>
      <title>A Week Later, Rainbow Six Siege Is Apparently Under Attack Again, This Time with Brainrot</title>
      <link>https://gizmodo.com/a-week-later-rainbow-six-siege-is-apparently-under-attack-again-this-time-with-brainrot-2000705226</link>
      <pubDate>Sun, 04 Jan 2026 22:09:47 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705226</guid>
      <description>The outage and service degradation is accompanied by a bunch of "67" jokes (if you can call them "jokes").</description>
    </item>
    <item>
      <title>Test du Polti RollySteam : que vaut le balai laveur vapeur de la marque embl&#233;matique italienne ?</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/aspirateurs-balais-sans-fil/aspirateur-laveur/2923885_test-du-polti-rollysteam-que-vaut-le-balai-laveur-vapeur-de-la-marque-emblematique-italienne</link>
      <pubDate>Sun, 04 Jan 2026 22:03:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/aspirateurs-balais-sans-fil/aspirateur-laveur/2923885_test-du-polti-rollysteam-que-vaut-le-balai-laveur-vapeur-de-la-marque-emblematique-italienne</guid>
      <description>
Polti, figure embl&#233;matique du nettoyage &#224; la vapeur, tente de se faire une place sur le march&#233; ultra-concurrentiel des aspirateurs balais laveurs. Avec le RollySteam, la marque italienne promet d'allier l'agilit&#233; d'un balai sans-fil &#224; la puissance hygi&#233;nique de la vapeur. Une promesse s&#233;duisante sur le papier, mais que vaut-elle face &#224; la concurrence de plus en plus pr&#233;sente ? R&#233;ponse dans ce test complet.
...</description>
    </item>
    <item>
      <title>Belkin announces a wireless HDMI dongle that doesn't need Wi-Fi access</title>
      <link>https://www.engadget.com/computing/accessories/belkin-announces-a-wireless-hdmi-dongle-that-doesnt-need-wi-fi-access-215513179.html?src=rss</link>
      <pubDate>Sun, 04 Jan 2026 21:55:13 +0000</pubDate>
      <guid isPermaLink="false">7bd118a0-f209-4678-9ab1-27be0c006e77</guid>
      <description>Belkin has announced a plug-and-play casting system at CES 2026 that allows for screen sharing from a laptop, tablet or smartphone to another display without Wi-Fi or Bluetooth. The $150 ConnectAir Wireless HDMI Display Adapter comes with a USB-C transmitter dongle and a USB-A to HDMI receiver that can be connected to a TV, monitor or projector to wirelessly cast over a range of up to 131 feet (40 meters).&#160;Belkin's ConnectAir Wireless USB-C transmitter and HDMI receiverBelkinThe ConnectAir Wireless casts in 1080p at 60Hz, with latency under 80ms according to Belkin. It's compatible with USB-C ...</description>
    </item>
    <item>
      <title>LG reveals its laundry-folding robot at CES 2026</title>
      <link>https://www.engadget.com/home/smart-home/lg-reveals-its-laundry-folding-robot-at-ces-2026-215121021.html?src=rss</link>
      <pubDate>Sun, 04 Jan 2026 21:51:21 +0000</pubDate>
      <guid isPermaLink="false">4290a65d-014e-45bc-8214-f56182cc455e</guid>
      <description>LG has unveiled its humanoid robot that can handle household chores. After teasing the CLOiD last week, the company has offered its first look at the AI-powered robot it claims can fold laundry, unload the dishwasher, serve food and help out with other tasks.&#160;The CLOiD has a surprisingly cute "head unit" that's equipped with a display, speakers, cameras and other sensors. "Collectively, these elements allow the robot to communicate with humans through spoken language and 'facial expressions,' learn the living environments and lifestyle patterns of its users and control connected home appliance...</description>
    </item>
    <item>
      <title>Can a social app fix the &#8216;terrible devastation&#8217; of social media?</title>
      <link>https://techcrunch.com/2026/01/04/can-a-social-app-fix-the-terrible-devastation-of-social-media/</link>
      <pubDate>Sun, 04 Jan 2026 21:39:23 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3079543</guid>
      <description>Twitter co-founder Biz Stone and Pinterest co-founder Evan Sharp have raised new funding for a social media app that helps users "plan with intention."</description>
    </item>
    <item>
      <title>Voici le Tineco Floor One i7 Fold : il r&#232;gle un des plus gros d&#233;fauts des aspirateurs laveurs</title>
      <link>https://www.frandroid.com/marques/tineco/2926777_voici-le-tineco-floor-one-i7-fold-il-regle-un-des-plus-gros-defauts-des-aspirateurs-laveurs</link>
      <pubDate>Sun, 04 Jan 2026 21:33:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tineco/2926777_voici-le-tineco-floor-one-i7-fold-il-regle-un-des-plus-gros-defauts-des-aspirateurs-laveurs</guid>
      <description>
C'est un des probl&#232;mes des aspirateurs laveurs depuis cinq ans : essayez de les pencher pour nettoyer sous un lit, et le moteur boit la tasse. Tineco arrive au CES 2026 avec une solution radicale. Le Floor One i7 Fold promet de se coucher totalement &#224; plat. 
</description>
    </item>
  </channel>
</rss>
