<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 13 Feb 2026 09:52:06 GMT</lastBuildDate>
    <item>
      <title>Audi fait d&#233;j&#224; rouler sa nouvelle voiture &#233;lectrique sans anneaux et &#224; l&#8217;autonomie XXL</title>
      <link>https://www.frandroid.com/marques/audi/2976321_audi-fait-deja-rouler-sa-nouvelle-voiture-electrique-sans-anneaux-et-a-lautonomie-xxl</link>
      <pubDate>Fri, 13 Feb 2026 09:51:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/audi/2976321_audi-fait-deja-rouler-sa-nouvelle-voiture-electrique-sans-anneaux-et-a-lautonomie-xxl</guid>
      <description>
D&#233;voil&#233; &#224; la fin de l&#8217;ann&#233;e 2025, le nouvel AUDI E7X se rapproche de la commercialisation. Destin&#233;e au march&#233; chinois, la voiture &#233;lectrique vient d&#8217;&#234;tre aper&#231;ue en libert&#233; lors de tests par grand froid. L&#8217;occasion d&#8217;en savoir plus &#224; son sujet.
</description>
    </item>
    <item>
      <title>PS Plus Extra et Premium en f&#233;vrier 2026 : voici les 9 jeux offerts aux abonn&#233;s ce mois-ci !</title>
      <link>https://www.frandroid.com/marques/sony/2974089_ps-plus-extra-et-premium-en-fevrier-2026-voici-les-9-jeux-offerts-aux-abonnes-ce-mois-ci</link>
      <pubDate>Fri, 13 Feb 2026 09:41:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2974089_ps-plus-extra-et-premium-en-fevrier-2026-voici-les-9-jeux-offerts-aux-abonnes-ce-mois-ci</guid>
      <description>
Sony vient de d&#233;voiler le nouveau catalogue du PlayStation Plus pour les abonn&#233;s Extra et Premium lors de son dernier States of Play avec le dernier jeu Spider-Man en vedette ! Entre jeux AAA et ind&#233;s, voici ce qui est pr&#233;vu au programme !
</description>
    </item>
    <item>
      <title>Comment Steam veut am&#233;liorer l&#8217;optimisation des jeux gr&#226;ce &#224; vos donn&#233;es</title>
      <link>https://www.frandroid.com/marques/valve/2976325_comment-steam-veut-ameliorer-loptimisation-des-jeux-grace-a-vos-donnees</link>
      <pubDate>Fri, 13 Feb 2026 09:39:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/valve/2976325_comment-steam-veut-ameliorer-loptimisation-des-jeux-grace-a-vos-donnees</guid>
      <description>
Dans la version b&#234;ta de son client, Steam souhaite d&#233;sormais r&#233;colter les donn&#233;es de performances des joueurs. L'objectif serait d'am&#233;liorer la compatibilit&#233; des jeux, notamment avec SteamOS.
</description>
    </item>
    <item>
      <title>Steam : comment la plateforme va vous aider &#224; savoir si un jeu tournera sur VOTRE PC</title>
      <link>https://www.frandroid.com/marques/2976399_steam-comment-la-plateforme-va-vous-aider-a-savoir-si-un-jeu-tournera-sur-votre-pc</link>
      <pubDate>Fri, 13 Feb 2026 09:38:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2976399_steam-comment-la-plateforme-va-vous-aider-a-savoir-si-un-jeu-tournera-sur-votre-pc</guid>
      <description>
Steam va permettre aux joueurs de joindre les caract&#233;ristiques techniques de leur PC &#224; leur avis laiss&#233; sur un jeu. Une information utile pour juger de l'optimisation d'un titre.
</description>
    </item>
    <item>
      <title>Pourquoi assurer une voiture &#233;lectrique co&#251;te d&#233;sormais plus cher qu&#8217;une thermique</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2976165_pourquoi-assurer-une-voiture-electrique-coute-desormais-plus-cher-quune-thermique</link>
      <pubDate>Fri, 13 Feb 2026 09:33:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2976165_pourquoi-assurer-une-voiture-electrique-coute-desormais-plus-cher-quune-thermique</guid>
      <description>
Mauvaise nouvelle pour les propri&#233;taires de voitures &#233;lectriques, le prix l&#8217;assurance continue sa hausse. La cotisation moyenne a flamb&#233; de 45 % entre 2023 et 2025. Mais de nombreux &#233;l&#233;ments expliquent cette hausse et la diff&#233;rence avec les mod&#232;les thermiques.
</description>
    </item>
    <item>
      <title>300&#160;000 utilisateurs Chrome ont &#233;t&#233; pi&#233;g&#233;s par 30 fausses extensions IA</title>
      <link>https://www.01net.com/actualites/300-000-utilisateurs-chrome-ont-ete-pieges-par-de-fausses-extensions-ia.html</link>
      <pubDate>Fri, 13 Feb 2026 09:27:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325820</guid>
      <description>Une vaste op&#233;ration d'espionnage vise Chrome. Par le biais d'une trentaine d'extensions malveillantes d&#233;guis&#233;es en assistants IA populaires, des pirates ont infect&#233; 300 000 navigateurs pour voler des donn&#233;es sensibles. Mots de passe, emails, informations bancaires... Toutes ces donn&#233;es sont aspir&#233;es par les cybercriminels. Google a supprim&#233; la majorit&#233; des extensions, mais 7 d'entre elles demeurent en ligne....</description>
    </item>
    <item>
      <title>La nouvelle victoire de Xiaomi contre Tesla : le Model Y d&#233;tr&#244;n&#233; par son plus grand concurrent en Chine</title>
      <link>https://www.frandroid.com/marques/xiaomi/2976149_le-tesla-model-y-detrone-comment-le-suv-electrique-de-xiaomi-a-tout-rafle-en-chine</link>
      <pubDate>Fri, 13 Feb 2026 09:27:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2976149_le-tesla-model-y-detrone-comment-le-suv-electrique-de-xiaomi-a-tout-rafle-en-chine</guid>
      <description>
C&#8217;est officiel, le Xiaomi YU7 a &#233;t&#233; la voiture &#233;lectrique la plus vendue en Chine au mois de janvier 2026. Le SUV est enfin pass&#233; devant la Tesla Model Y, qui se positionnait jusqu&#8217;&#224; pr&#233;sent en t&#234;te du classement.
</description>
    </item>
    <item>
      <title>Ce laptop Dell 15,6&#8243; (120 Hz) avec un Ryzen 5 est en promo &#224; moins de 400 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2751933_ce-laptop-dell-156-120-hz-avec-un-ryzen-5-est-en-promo-a-moins-de-400-euros</link>
      <pubDate>Fri, 13 Feb 2026 09:26:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2751933_ce-laptop-dell-156-120-hz-avec-un-ryzen-5-est-en-promo-a-moins-de-400-euros</guid>
      <description>
Grand &#233;cran fluide, configuration solide, format pratique... Le PC portable Dell 15 DC15255 pourra tout &#224; fait accompagner les travailleurs et les &#233;tudiants en 2026. En plus, la marque le propose &#224; 399 euros au lieu de 499 euros sur son site.
</description>
    </item>
    <item>
      <title>Ecovacs lance le Deebot T80S Omni, un robot aspirateur laveur &#224; rouleau &#224; moins de 650 euros</title>
      <link>https://www.frandroid.com/marques/ecovacs/2975237_ecovacs-lance-le-deebot-t80s-omni-un-robot-aspirateur-laveur-a-rouleau-a-moins-de-650-euros</link>
      <pubDate>Fri, 13 Feb 2026 09:21:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/ecovacs/2975237_ecovacs-lance-le-deebot-t80s-omni-un-robot-aspirateur-laveur-a-rouleau-a-moins-de-650-euros</guid>
      <description>
Dans l'ombre de la nouvelle gamme T90, Ecovacs renouvelle un de ses best-sellers, notamment avec une aspiration de 24 800 Pa et des am&#233;liorations technologiques.
</description>
    </item>
    <item>
      <title>Pourquoi BYD veut envahir l&#8217;Europe avec des voitures hybrides et pas forc&#233;ment &#233;lectriques</title>
      <link>https://www.frandroid.com/marques/byd/2976249_pourquoi-byd-veut-envahir-leurope-avec-des-voitures-hybrides-et-pas-forcement-electriques</link>
      <pubDate>Fri, 13 Feb 2026 09:18:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2976249_pourquoi-byd-veut-envahir-leurope-avec-des-voitures-hybrides-et-pas-forcement-electriques</guid>
      <description>
D&#233;j&#224; leader de la voiture &#233;lectrique dans le monde, BYD s&#8217;int&#233;resse d&#233;sormais tr&#232;s fortement au segment des hybrides en Europe. Et cela n&#8217;est pas innocent.
</description>
    </item>
    <item>
      <title>Apple confirme la sortie de Siri 2.0 pour 2026, mais pas en un seul morceau</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/apple-intelligence/2976343_apple-confirme-la-sortie-de-siri-2-0-pour-2026-mais-pas-en-un-seul-morceau</link>
      <pubDate>Fri, 13 Feb 2026 09:14:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/apple-intelligence/2976343_apple-confirme-la-sortie-de-siri-2-0-pour-2026-mais-pas-en-un-seul-morceau</guid>
      <description>
Apr&#232;s des rumeurs de report qui ont bouscul&#233; le titre en bourse, Apple sort du silence. La refonte majeure de Siri arrivera bien en 2026. Mais attention, tout ne sera pas disponible d&#232;s le premier jour.
</description>
    </item>
    <item>
      <title>Why world models will become a platform capability, not a corporate superpower</title>
      <link>https://www.fastcompany.com/91488707/why-world-models-will-become-a-platform-capability-not-a-corporate-superpower</link>
      <pubDate>2026-02-13T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91488707/why-world-models-will-become-a-platform-capability-not-a-corporate-superpower</guid>
      <description>Companies compete not on who owns the hardware, but on how well their models reflect reality.
For the past two years, artificial intelligence has felt oddly flat.</description>
    </item>
    <item>
      <title>Ecovacs GOAT : la nouvelle gamme 2026 sonne la fin des balises et du coupe-bordure manuel</title>
      <link>https://www.frandroid.com/marques/ecovacs/2975385_ecovacs-goat-la-nouvelle-gamme-2026-sonne-la-fin-des-balises-et-du-coupe-bordure-manuel</link>
      <pubDate>Fri, 13 Feb 2026 08:55:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/ecovacs/2975385_ecovacs-goat-la-nouvelle-gamme-2026-sonne-la-fin-des-balises-et-du-coupe-bordure-manuel</guid>
      <description>
Pour 2026, Ecovacs fait &#233;voluer ses s&#233;ries GOAT A et O avec un objectif clair : supprimer les accessoires de navigation encombrants et int&#233;grer un v&#233;ritable coupe-bordure physique pour &#233;liminer les derni&#232;res corv&#233;es manuelles.
</description>
    </item>
    <item>
      <title>Google Docs&#160;: plus besoin de lire les documents, Gemini le fait &#224; votre place</title>
      <link>https://www.01net.com/actualites/google-docs-plus-besoin-lire-documents-gemini-fait-votre-place.html</link>
      <pubDate>Fri, 13 Feb 2026 08:33:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325801</guid>
      <description>Gemini peut maintenant all&#233;ger votre peine en vous lisant un r&#233;sum&#233; audio d'un long fichier Google Docs. Voici comment cela fonctionne.</description>
    </item>
    <item>
      <title>Les cyberattaques sign&#233;es Lumma Stealer se multiplient, le malware russe est de retour en force</title>
      <link>https://www.01net.com/actualites/cyberattaques-signees-lumma-stealer-multiplient-malware-russe-retour-force.html</link>
      <pubDate>Fri, 13 Feb 2026 08:20:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325802</guid>
      <description>D&#233;mantel&#233; par Europol et Microsoft en mai 2025, le malware russe Lumma Stealer a rapidement refait surface avec une infrastructure renforc&#233;e. Selon une nouvelle &#233;tude de Bitdefender, ce voleur de donn&#233;es conna&#238;t une recrudescence spectaculaire depuis d&#233;cembre 2025.</description>
    </item>
    <item>
      <title>Quelles sont les diff&#233;rences entre les &#233;couteurs Sony WF-1000XM6 et les WF-1000XM5 ?</title>
      <link>https://www.frandroid.com/produits-android/audio/ecouteurs-true-wireless/2976179_quelles-differences-entre-les-ecouteurs-sony-wf-1000xm6-et-les-wf-1000xm5</link>
      <pubDate>Fri, 13 Feb 2026 08:20:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/audio/ecouteurs-true-wireless/2976179_quelles-differences-entre-les-ecouteurs-sony-wf-1000xm6-et-les-wf-1000xm5</guid>
      <description>
Sony vient d&#8217;annoncer la commercialisation de la nouvelle g&#233;n&#233;ration d'&#233;couteurs sans fil avec les WF-1000XM6. Ils apportent des am&#233;liorations substantielles par rapport aux WF-1000XM5, notamment en mati&#232;re de r&#233;duction de bruit et de qualit&#233; audio, bien que le design adopte une direction surprenante. On fait le point.
</description>
    </item>
    <item>
      <title>The God of War trilogy is getting a remake</title>
      <link>https://mashable.com/article/god-of-war-remake-trilogy-announcement</link>
      <pubDate>Fri, 13 Feb 2026 08:14:11 +0000</pubDate>
      <guid isPermaLink="false">06m1pumWwQzTkV91nSBWJZl</guid>
      <description>The original "God of War" trilogy is getting a remake, with Santa Monica Studio announcing it during PlayStation's State of Play.</description>
    </item>
    <item>
      <title>A Neva prequel is arriving next week</title>
      <link>https://www.engadget.com/gaming/a-neva-prequel-is-arriving-next-week-081239628.html?src=rss</link>
      <pubDate>Fri, 13 Feb 2026 08:12:39 +0000</pubDate>
      <guid isPermaLink="false">eca49771-52e9-4244-9c37-3dedf29e7850</guid>
      <description>At Sony's State of Play yesterday, developer Nomada Studio revealed a DLC prequel to its gorgeous and award-winning puzzle platformer Neva. Entitled simply Neva: Prologue, it tells the story of how Alba and her wolf companion Neva met, while introducing new gameplay mechanics, locales and challenges.&#160;
"In Neva: Prologue, players follow Alba as she chases a trail of white butterflies deep into the corrupted swamps, only to discover a frightened wolf cub, lost and alone," Nomada writes. "To survive, Alba must earn the cub&#8217;s trust and guide them both through the blighted wetlands and the dark for...</description>
    </item>
    <item>
      <title>Eufy Omni E25 : notre coup de c&#339;ur not&#233; 8/10 rivalise avec les plus grands, surtout avec 310 &#8364; de remise</title>
      <link>https://www.frandroid.com/bons-plans/2975303_eufy-omni-e25-notre-coup-de-coeur-note-8-10-rivalise-avec-les-plus-grands-surtout-avec-310-e-de-remise</link>
      <pubDate>Fri, 13 Feb 2026 08:08:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2975303_eufy-omni-e25-notre-coup-de-coeur-note-8-10-rivalise-avec-les-plus-grands-surtout-avec-310-e-de-remise</guid>
      <description>
Avec ses 20 000 Pa d&#8217;aspiration et son syst&#232;me HydroJet qui permet de laver les sols, l'Eufy Omni E25 est un robot aspirateur qui assure un nettoyage complet. Et si jusqu'ici, il co&#251;tait 899 euros, aujourd'hui il est en promotion &#224; 589 euros. 
</description>
    </item>
    <item>
      <title>Pourquoi Amazon est oblig&#233; de compter sur l&#8217;Europe (et son Ariane 64) pour ne pas couler face &#224; Elon Musk</title>
      <link>https://www.frandroid.com/culture-tech/espace/2976213_pourquoi-amazon-est-oblige-de-compter-sur-leurope-et-son-ariane-64-pour-ne-pas-couler-face-a-elon-musk</link>
      <pubDate>Fri, 13 Feb 2026 08:05:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/espace/2976213_pourquoi-amazon-est-oblige-de-compter-sur-leurope-et-son-ariane-64-pour-ne-pas-couler-face-a-elon-musk</guid>
      <description>
Jeff Bezos a un probl&#232;me : ses propres fus&#233;es ne sont pas pr&#234;tes et ses partenaires am&#233;ricains patinent. La solution est venue de Kourou. Ce jeudi, le premier vol de l'Ariane 64 a &#233;t&#233; un succ&#232;s total, et cela prouve l'Europe a encore son mot &#224; dire face &#224; l'h&#233;g&#233;monie de SpaceX.
</description>
    </item>
    <item>
      <title>The 7 best air fryers for 2026, tested and reviewed</title>
      <link>https://www.engadget.com/home/kitchen-tech/best-air-fryers-133047180.html?src=rss</link>
      <pubDate>Fri, 13 Feb 2026 08:00:38 +0000</pubDate>
      <guid isPermaLink="false">8dfb0e35-0d59-41ac-a6cd-b9af5a4bdad8</guid>
      <description>Air fryers have gone from novelty appliances to everyday kitchen staples surprisingly fast. They&#8217;re quick to heat up, easy to use and well suited to everything from frozen snacks to roasted vegetables and simple desserts. For many people, they&#8217;ve replaced the oven for smaller meals, cutting down on cook time without adding extra cleanup.The category has also expanded well beyond basic basket-style models. Some air fryers are designed for small kitchens or single servings, while others offer larger capacities and preset cooking modes for roasting, reheating or dehydrating. After testing a wide ...</description>
    </item>
    <item>
      <title>Tenways&#8217; compact e-bike twists and folds to go flat</title>
      <link>https://www.theverge.com/transportation/877796/tenways-cgo-compact-e-bike-twists-folds-flat</link>
      <pubDate>2026-02-13T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=877796</guid>
      <description>Tenways just launched its new CGO Compact electric bike in Europe that's designed to fit into tight spaces like car trunks, apartment hallways, and train compartments. To achieve this, the CGO Compact is fitted with small 20-inch wheels, folding pedals, and a handlebar fitted with a twistable stem to create a slim, wall-hugging profile. The [&#8230;]</description>
    </item>
    <item>
      <title>Only one NASA astronaut is in space right now. Help is on the way.</title>
      <link>https://mashable.com/article/crew-12-launch-date-livestream-info</link>
      <pubDate>Fri, 13 Feb 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">04LQE0ydZ3y4TlPUldBkqpa</guid>
      <description>After a month as the only NASA astronaut on the International Space Station, relief is coming. Here's how to watch Crew-12 launch.</description>
    </item>
    <item>
      <title>Ce kit Honor Magic 8 Pro transforme votre smartphone en bo&#238;tier pro</title>
      <link>https://www.frandroid.com/produits-android/photo/appareil-photo/2976159_ce-kit-honor-magic-8-pro-transforme-votre-smartphone-en-boitier-pro</link>
      <pubDate>Fri, 13 Feb 2026 07:53:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/photo/appareil-photo/2976159_ce-kit-honor-magic-8-pro-transforme-votre-smartphone-en-boitier-pro</guid>
      <description>
Honor s'associe &#224; l'accessoiriste Telesin pour lancer un kit de photographie professionnelle d&#233;di&#233; au Magic 8 Pro. Cet ensemble modulaire comprend un grip magn&#233;tique, une coque compatible avec des filtres de 67 mm et un t&#233;l&#233;convertisseur de 200 mm.
</description>
    </item>
  </channel>
</rss>
