<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 15 Dec 2025 09:37:12 GMT</lastBuildDate>
    <item>
      <title>Clap de fin pour le cr&#233;ateur du Roomba : iRobot passe sous pavillon chinois</title>
      <link>https://www.frandroid.com/marques/irobot/2909821_clap-de-fin-pour-le-createur-du-roomba-irobot-passe-sous-pavillon-chinois</link>
      <pubDate>Mon, 15 Dec 2025 09:33:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/irobot/2909821_clap-de-fin-pour-le-createur-du-roomba-irobot-passe-sous-pavillon-chinois</guid>
      <description>
C'est d'une tristesse absolue, mais c'&#233;tait pr&#233;visible. iRobot, la bo&#238;te qui a litt&#233;ralement invent&#233; l'aspirateur robot avec son Roomba, a d&#233;pos&#233; le bilan ce dimanche. L'entreprise du MIT, l&#226;ch&#233;e par Amazon et bouff&#233;e par la concurrence chinoise, finit... rachet&#233;e par son fournisseur chinois. La boucle est boucl&#233;e.
</description>
    </item>
    <item>
      <title>La recharge des voitures &#233;lectriques en 12 minutes devient r&#233;alit&#233; en Europe gr&#226;ce &#224; ces nouvelles bornes</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2909691_la-recharge-des-voitures-electriques-en-12-minutes-devient-realite-en-europe-grace-a-ces-nouvelles-bornes</link>
      <pubDate>Mon, 15 Dec 2025 09:31:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2909691_la-recharge-des-voitures-electriques-en-12-minutes-devient-realite-en-europe-grace-a-ces-nouvelles-bornes</guid>
      <description>
L&#8217;op&#233;rateur Ionity vient d&#8217;inaugurer de nouvelles bornes de charge capables de d&#233;livrer jusqu&#8217;&#224; 500 kW en Norv&#232;ge. Si tr&#232;s peu de voitures &#233;lectriques peuvent aujourd'hui accepter une telle puissance en Europe, c'est de bon augure pour l'avenir et la recharge en 10 minutes.
</description>
    </item>
    <item>
      <title>NotebookLM dans Gemini&#160;: Google m&#233;lange ses deux outils IA les plus puissants</title>
      <link>https://www.01net.com/actualites/notebooklm-dans-gemini-google-melange-outils-ia-plus-puissants.html</link>
      <pubDate>Mon, 15 Dec 2025 09:24:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315309</guid>
      <description>Google commence &#224; int&#233;grer NotebookLM directement dans Gemini. Un combo qui permet d'exploiter vos documents encore plus efficacement.</description>
    </item>
    <item>
      <title>Kindle : bonne nouvelle, Amazon fait marche arri&#232;re sur une restriction majeure de ses liseuses</title>
      <link>https://www.frandroid.com/marques/amazon/2909653_kindle-bonne-nouvelle-amazon-fait-marche-arriere-sur-une-restriction-majeure-de-ses-liseuses</link>
      <pubDate>Mon, 15 Dec 2025 09:24:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazon/2909653_kindle-bonne-nouvelle-amazon-fait-marche-arriere-sur-une-restriction-majeure-de-ses-liseuses</guid>
      <description>
Les possesseurs de Kindle peuvent se r&#233;jouir. Amazon va de nouveau ouvrir la porte aux t&#233;l&#233;chargements directs de livres.  
</description>
    </item>
    <item>
      <title>iRobot d&#233;clare faillite&#160;: votre aspirateur robot Romba va-t-il cesser de fonctionner&#160;?</title>
      <link>https://www.01net.com/actualites/irobot-declare-faillite-le-fabricant-des-aspirateurs-robots-roomba-est-rachete-par-un-groupe-chinois.html</link>
      <pubDate>Mon, 15 Dec 2025 09:23:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315312</guid>
      <description>Asphyxi&#233; par la concurrence chinoise, iRobot rend les armes. La soci&#233;t&#233; am&#233;ricaine d&#233;clare faillite et pr&#233;voit d'&#234;tre rachet&#233;e par un groupe chinois. Pour l&#8217;instant, la marque promet que rien ne change pour ses utilisateurs actuels.</description>
    </item>
    <item>
      <title>Dreame's new Matrix10 Ultra takes robovac smarts to the next level</title>
      <link>https://www.techradar.com/home/robot-vacuums/dreame-matrix10-ultra-review-australia</link>
      <pubDate>Mon, 15 Dec 2025 09:18:55 +0000</pubDate>
      <guid isPermaLink="false">LFq5tZCsukMwH3fPhysAeA</guid>
      <description>The Dreame Matrix10 Ultra takes robovac smarts to the next level, plus it has unique features you won't find anywhere else.</description>
    </item>
    <item>
      <title>The best Secret Santa gift ideas for 2025: Affordable gifts you can still get from Lego, Apple, Yeti and more</title>
      <link>https://www.engadget.com/the-best-secret-santa-gift-ideas-for-2025-affordable-gifts-you-can-still-get-from-lego-apple-yeti-and-more-130014284.html?src=rss</link>
      <pubDate>Mon, 15 Dec 2025 09:17:20 +0000</pubDate>
      <guid isPermaLink="false">d3419426-0b76-49ed-9322-bfc6839435ec</guid>
      <description>Secret Santa gift exchanges can be chaotic in the best way. One minute you&#8217;re drawing a name from a hat, the next you&#8217;re scrambling to figure out what they&#8217;d actually like. The trick is finding something that&#8217;s thoughtful, gets a laugh or feels useful without going over budget. Luckily there are plenty of gifts that do exactly that, whether you&#8217;re shopping for the office exchange, a family swap or a friend group tradition. From clever gadgets to playful desk toys and little luxuries, these ideas prove you can spend less than $50 and still land the perfect Secret Santa present.
Best Secret Sant...</description>
    </item>
    <item>
      <title>Google Traduction : comment vos &#233;couteurs deviennent des traducteurs en temps r&#233;el</title>
      <link>https://www.frandroid.com/produits-android/audio/ecouteurs-true-wireless/2909779_google-traduction-comment-vos-ecouteurs-deviennent-des-traducteurs-en-temps-reel</link>
      <pubDate>Mon, 15 Dec 2025 09:17:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/audio/ecouteurs-true-wireless/2909779_google-traduction-comment-vos-ecouteurs-deviennent-des-traducteurs-en-temps-reel</guid>
      <description>
Google ne l&#226;che rien sur l'IA. La firme de Mountain View d&#233;ploie une mise &#224; jour majeure pour Google Traduction qui int&#232;gre enfin la puissance de Gemini. Au menu : des traductions qui comprennent l'argot et surtout, un mode d'&#233;coute en temps r&#233;el pour tous les &#233;couteurs. M&#234;me ceux &#224; 5 euros.
</description>
    </item>
    <item>
      <title>iRobot has filed for bankruptcy and may be taken over by its primary supplier</title>
      <link>https://www.engadget.com/home/irobot-has-filed-for-bankruptcy-and-may-be-taken-over-by-its-primary-supplier-091602257.html?src=rss</link>
      <pubDate>Mon, 15 Dec 2025 09:16:02 +0000</pubDate>
      <guid isPermaLink="false">769aef18-4dd6-4cc4-afce-67e885b609e9</guid>
      <description>iRobot, which brought robotic vacuum cleaners to the masses with its iconic Roomba models, has filed for Chapter 11 bankruptcy. The Massachusetts-based company plans to sell all assets to its primary supplier, a Chinese company known as Picea Robotics. If approved by a bankruptcy court, the move would allow iRobot to "continue&#160;operating in the ordinary course, pursue its product development roadmap, and maintain its global footprint," iRobot wrote in a press release.
The company expects the deal to close in February 2026, but says it will continue to operate "with no anticipated disruption to ...</description>
    </item>
    <item>
      <title>MacBook Air, MacBook Pro, Mac Mini&#8230; quels sont les meilleurs MacBook et Mac de bureau en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-ordinateurs/981469_macbook-air-macbook-pro-macbook-m1-quel-portable-apple-choisir</link>
      <pubDate>Mon, 15 Dec 2025 09:10:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-ordinateurs/981469_macbook-air-macbook-pro-macbook-m1-quel-portable-apple-choisir</guid>
      <description>
Il existe plusieurs gammes d'ordinateurs Apple : MacBook, iMac, Mac Studio. Vous ne savez pas quel Mac choisir ? On fait le point pour vous aider &#224; choisir le meilleur MacBook (ou bien le Mac fixe) qui vous convient le mieux.
</description>
    </item>
    <item>
      <title>Quels sont les meilleurs smartphones gaming en 2025 ?</title>
      <link>https://www.frandroid.com/guide-dachat/smartphones/529525_quels-sont-les-meilleurs-smartphones-pour-jouer-a-fortnite-en-2018-notre-selection</link>
      <pubDate>Mon, 15 Dec 2025 09:10:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/smartphones/529525_quels-sont-les-meilleurs-smartphones-pour-jouer-a-fortnite-en-2018-notre-selection</guid>
      <description>
Vous &#234;tes en qu&#234;te d'un bon smartphone gaming ? Gr&#226;ce &#224; cette s&#233;lection, vous trouverez le mod&#232;le de t&#233;l&#233;phone qu'il vous faut pour jouer &#224; des jeux exigeants tels que Fortnite, PUBG ou Genshin Impact.
</description>
    </item>
    <item>
      <title>La crise de la m&#233;moire RAM force les constructeurs &#224; faire le pire choix possible</title>
      <link>https://www.frandroid.com/produits-android/hardware/memoire/2909747_la-crise-de-la-memoire-ram-force-les-constructeurs-a-faire-le-pire-choix-possible</link>
      <pubDate>Mon, 15 Dec 2025 09:04:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/memoire/2909747_la-crise-de-la-memoire-ram-force-les-constructeurs-a-faire-le-pire-choix-possible</guid>
      <description>
On pensait s'en &#234;tre d&#233;barrass&#233;, mais le cauchemar recommence. Alors que Windows 11 et l'IA demandent toujours plus de ressources, les constructeurs s'appr&#234;tent &#224; g&#233;n&#233;raliser de nouveau les 8 Go de RAM sur le milieu de gamme. La raison ? Une flamb&#233;e des prix de la m&#233;moire vive.
</description>
    </item>
    <item>
      <title>Des &#233;quipes recrut&#233;es, des v&#233;los &#233;lectriques en cours et puis plus rien : le fiasco de Porsche et de cet important acteur europ&#233;en</title>
      <link>https://www.frandroid.com/marques/porsche/2909725_des-equipes-recrutees-des-velos-electriques-en-cours-et-puis-plus-rien-le-fiasco-de-porsche-et-de-cet-important-acteur-europeen</link>
      <pubDate>Mon, 15 Dec 2025 09:02:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/porsche/2909725_des-equipes-recrutees-des-velos-electriques-en-cours-et-puis-plus-rien-le-fiasco-de-porsche-et-de-cet-important-acteur-europeen</guid>
      <description>
PON Holdings et Porsche ont mis fin &#224; leur projet commun de v&#233;los &#233;lectriques haut de gamme, port&#233; par la coentreprise P2 eBike GmbH. Plusieurs mod&#232;les &#233;taient en cours de d&#233;veloppement, mais les deux partenaires ont d&#233;cid&#233; de ne pas poursuivre cette activit&#233;, sans en pr&#233;ciser les raisons.
</description>
    </item>
    <item>
      <title>Tight jeans, oversized sweatpants, and cozy joggers: the three leadership styles that define every workplace</title>
      <link>https://www.fastcompany.com/91449544/tight-jeans-oversized-sweatpants-and-cozy-joggers-the-three-leadership-styles-that-define-every-workplace-management-leadership-advice</link>
      <pubDate>2025-12-15T09:02:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91449544/tight-jeans-oversized-sweatpants-and-cozy-joggers-the-three-leadership-styles-that-define-every-workplace-management-leadership-advice</guid>
      <description>How managers can strike the right balance between control and freedom.
What can a pair of pants tell you about leadership? Much more than you think.</description>
    </item>
    <item>
      <title>How to stand out when you&#8217;re one of two job candidates</title>
      <link>https://www.fastcompany.com/91453719/how-to-stand-out-when-youre-one-of-two-job-candidates</link>
      <pubDate>2025-12-15T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91453719/how-to-stand-out-when-youre-one-of-two-job-candidates</guid>
      <description>Some studies show that the interview process can take up to six weeks. But there are ways that might help speed up the process and get those final hiring managers to land on you as the one they offer the job to.&#160; &#160;
Some studies show that the interview process can take up to six weeks. But there are ways that might help speed up the process and get those final hiring managers to land on you as the one they offer the job to.&#160; &#160;...</description>
    </item>
    <item>
      <title>On a jamais vu un laptop gaming 16&#8243; avec une RTX 5070 &#224; un prix si bas, merci Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2898227_on-a-jamais-vu-un-laptop-gaming-16-avec-une-rtx-5070-a-un-prix-si-bas-merci-amazon</link>
      <pubDate>Mon, 15 Dec 2025 08:57:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2898227_on-a-jamais-vu-un-laptop-gaming-16-avec-une-rtx-5070-a-un-prix-si-bas-merci-amazon</guid>
      <description>
Le Black Friday a beau &#234;tre termin&#233;, les promotions continuent avec le Gigabyte Gaming A16 CWH avec une RTX 5070 affich&#233; &#224; 1 169,98 euros au lieu de 1 499 euros sur Amazon.
</description>
    </item>
    <item>
      <title>Cette vente flash Anker est votre derni&#232;re chance pour offrir des &#233;couteurs &#224; petit prix [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/audio/ecouteurs-true-wireless/2905033_cette-vente-flash-anker-est-votre-derniere-chance-pour-offrir-des-ecouteurs-a-petit-prix</link>
      <pubDate>Mon, 15 Dec 2025 08:53:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/audio/ecouteurs-true-wireless/2905033_cette-vente-flash-anker-est-votre-derniere-chance-pour-offrir-des-ecouteurs-a-petit-prix</guid>
      <description>
Vous avez rat&#233; le Black Friday et souhaitez quand m&#234;me mettre des paquets sous le sapin sans vous ruiner ? Anker pense &#224; vous avec sa marque Soundcore, qui propose jusqu&#8217;au 24 d&#233;cembre 2025 plusieurs produits tech &#224; prix s&#233;duisants.
</description>
    </item>
    <item>
      <title>Who is Picea Robotics, Roomba&#8217;s new owner?</title>
      <link>https://www.theverge.com/news/844474/who-is-picea-robotics-company-owns-irobot</link>
      <pubDate>2025-12-15T03:52:45-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=844474</guid>
      <description>iRobot, the owner of the Roomba robot vacuum, has filed for Chapter 11 bankruptcy, stating that it will be acquired by its contract manufacturer, Picea Robotics. The Chinese-based company assumed iRobot's $190 million loan earlier this month and, under the terms of iRobot's restructuring, will waive that debt, along with the $161.5 million iRobot owes [&#8230;]...</description>
    </item>
    <item>
      <title>Nintendo Switch 2 : voici notre s&#233;lection d&#8217;accessoires indispensables &#224; (s&#8217;)offrir</title>
      <link>https://www.frandroid.com/guide-dachat/2903679_quels-sont-les-meilleurs-accessoires-pour-nintendo-switch-2</link>
      <pubDate>Mon, 15 Dec 2025 08:41:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/2903679_quels-sont-les-meilleurs-accessoires-pour-nintendo-switch-2</guid>
      <description>
La Nintendo Switch 2 est sans nul doute la console vedette de cette fin d'ann&#233;e et des f&#234;tes de No&#235;l. Voici une s&#233;lection d'accessoires que nous avons test&#233;s et que nous vous recommandons. 
</description>
    </item>
    <item>
      <title>Des milliers de serveurs en danger&#160;: Google l&#232;ve le voile sur une vague de cyberattaques</title>
      <link>https://www.01net.com/actualites/milliers-serveurs-danger-google-leve-voile-vague-cyberattaques.html</link>
      <pubDate>Mon, 15 Dec 2025 08:37:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315282</guid>
      <description>Google tire la sonnette d'alarme. Une faille critique baptis&#233;e &#171; React2Shell &#187; permet &#224; des cybercriminels, dont des groupes li&#233;s &#224; la Chine, de prendre le contr&#244;le de serveurs informatiques. La faille permet aux pirates d'espionner, de pr&#233;parer des sabotages et de miner ill&#233;galement de la cryptomonnaie&#8230;</description>
    </item>
    <item>
      <title>Roomba maker iRobot has filed for bankruptcy</title>
      <link>https://mashable.com/article/roomba-irobot-bankrupt-robot-vacuum</link>
      <pubDate>Mon, 15 Dec 2025 08:26:59 +0000</pubDate>
      <guid isPermaLink="false">00q17JuVz8su9fRr8yKTzCI</guid>
      <description>The robot vacuum company had been struggling for a while.</description>
    </item>
    <item>
      <title>Citro&#235;n pr&#233;pare une &#233;lectrique &#224; moins de 15 000 &#8364;&#8230; si l&#8217;Europe le veut bien</title>
      <link>https://www.frandroid.com/marques/citroen/2909663_citroen-prepare-une-electrique-a-moins-de-15-000-e-si-leurope-le-veut-bien</link>
      <pubDate>Mon, 15 Dec 2025 08:25:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/citroen/2909663_citroen-prepare-une-electrique-a-moins-de-15-000-e-si-leurope-le-veut-bien</guid>
      <description>
Apr&#232;s la &#235;-C3, Citro&#235;n serait en train de r&#233;fl&#233;chir au lancement d&#8217;une nouvelle petite voiture &#233;lectrique. Inspir&#233;e par la C1, elle chasserait directement sur les terres de la Renault Twingo E-Tech, avec un prix sous les 15 000 euros.
</description>
    </item>
    <item>
      <title>&#171;&#160;Le rythme d&#8217;innovation en Chine est &#224; couper le souffle&#160;&#187; : Porsche d&#233;sempar&#233; face &#224; une concurrence qui va &#224; toute vitesse</title>
      <link>https://www.frandroid.com/marques/porsche/2908743_le-rythme-dinnovation-en-chine-est-a-couper-le-souffle-porsche-desempare-face-a-une-concurrence-qui-va-a-toute-vitesse</link>
      <pubDate>Mon, 15 Dec 2025 08:18:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/porsche/2908743_le-rythme-dinnovation-en-chine-est-a-couper-le-souffle-porsche-desempare-face-a-une-concurrence-qui-va-a-toute-vitesse</guid>
      <description>
Le constructeur de Stuttgart traverse une crise sans pr&#233;c&#233;dent sur le march&#233; chinois. Avec des ventes en chute libre et une concurrence locale f&#233;roce, Porsche tente un retour aux sources pour reconqu&#233;rir un empire perdu.
</description>
    </item>
    <item>
      <title>Bonne nouvelle : la Tesla Model Y L r&#233;serv&#233;e au march&#233; chinois arrive bient&#244;t en Europe</title>
      <link>https://www.frandroid.com/marques/tesla/2909631_bonne-nouvelle-la-tesla-model-y-l-reservee-au-marche-chinois-arrive-bientot-en-europe</link>
      <pubDate>Mon, 15 Dec 2025 08:09:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2909631_bonne-nouvelle-la-tesla-model-y-l-reservee-au-marche-chinois-arrive-bientot-en-europe</guid>
      <description>
D&#233;voil&#233;e quelques mois plus t&#244;t et r&#233;serv&#233;e &#224; la Chine, la Tesla Model Y L &#224; six places va bient&#244;t d&#233;barquer en Europe. L&#8217;arriv&#233;e de la voiture &#233;lectrique familiale est pr&#233;vue d&#232;s le d&#233;but de l&#8217;ann&#233;e 2026.
</description>
    </item>
    <item>
      <title>Test de la Suunto Vertical 2 : plus belle, plus lumineuse, mais toujours aussi increvable</title>
      <link>https://www.frandroid.com/marques/suunto/2907169_test-de-la-suunto-vertical-2-plus-belle-plus-lumineuse-mais-toujours-aussi-increvable</link>
      <pubDate>Mon, 15 Dec 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/suunto/2907169_test-de-la-suunto-vertical-2-plus-belle-plus-lumineuse-mais-toujours-aussi-increvable</guid>
      <description>
Plus de deux ans apr&#232;s avoir marqu&#233; son retour avec la Vertical, Suunto fait le grand virage de l'Amoled pour sa montre d&#8217;aventure ultime. La Suunto Vertical 2 a-t-elle tout de m&#234;me r&#233;ussi &#224; garder sa colossale autonomie ?
</description>
    </item>
  </channel>
</rss>
