<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 15 Jan 2026 09:32:51 GMT</lastBuildDate>
    <item>
      <title>Quand poss&#233;der tous les DLC booste vos FPS : le bug absurde d&#233;couvert dans Monster Hunter Wilds</title>
      <link>https://www.frandroid.com/produits-android/console/2943483_un-bug-absurde-decouvert-dans-monster-hunter-wilds-pourquoi-posseder-tous-les-dlc-booste-vos-fps</link>
      <pubDate>Thu, 15 Jan 2026 09:32:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2943483_un-bug-absurde-decouvert-dans-monster-hunter-wilds-pourquoi-posseder-tous-les-dlc-booste-vos-fps</guid>
      <description>
Un utilisateur a trouv&#233; un bug pour le moins &#233;trange dans Monster Hunter : Wilds : le jeu serait bien plus performant si vous poss&#233;dez tous les DLC. 
</description>
    </item>
    <item>
      <title>Microsoft taps India&#8217;s Varaha for Asia-first durable carbon removal offtake</title>
      <link>https://techcrunch.com/2026/01/15/microsoft-taps-indias-varaha-for-asia-first-durable-carbon-removal-offtake/</link>
      <pubDate>Thu, 15 Jan 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3082552</guid>
      <description>Microsoft is buying over 100,000 tons of carbon dioxide removal credits from India's Varaha over the next three years.</description>
    </item>
    <item>
      <title>Opel casse les prix de sa Corsa &#233;lectrique, qui devient plus int&#233;ressante que la Renault 5</title>
      <link>https://www.frandroid.com/marques/2943397_opel-casse-les-prix-de-sa-corsa-electrique-qui-devient-plus-interessante-que-la-renault-5</link>
      <pubDate>Thu, 15 Jan 2026 09:23:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2943397_opel-casse-les-prix-de-sa-corsa-electrique-qui-devient-plus-interessante-que-la-renault-5</guid>
      <description>
Bonne nouvelle, Opel baisse le prix de sa Corsa, avec l&#8217;arriv&#233;e d&#8217;une nouvelle finition Edition. La petite voiture &#233;lectrique est d&#233;sormais affich&#233;e sous la barre des 28 000 euros et est plus abordable que la Renault 5 E-Tech.
</description>
    </item>
    <item>
      <title>Danger sur Windows&#160;: une faille de Microsoft Copilot permet de voler toutes vos donn&#233;es</title>
      <link>https://www.01net.com/actualites/faille-microsoft-copilot-permet-voler-toutes-donnees.html</link>
      <pubDate>Thu, 15 Jan 2026 09:22:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320219</guid>
      <description>Une nouvelle menace se dessine sur Windows. Les chercheurs de Varonis ont d&#233;couvert une nouvelle faille de s&#233;curit&#233; au sein de Microsoft Copilot. Elle permet de siphonner vos donn&#233;es &#224; votre insu&#8230;</description>
    </item>
    <item>
      <title>So you watched the Euphoria season 3 trailer &#8211; here are 3 similar HBO Max shows to watch while you wait for its return</title>
      <link>https://www.techradar.com/streaming/hbo-max/so-you-watched-the-euphoria-season-3-trailer-here-are-3-similar-hbo-max-shows-to-watch-while-you-wait-for-its-return</link>
      <pubDate>Thu, 15 Jan 2026 09:22:13 +0000</pubDate>
      <guid isPermaLink="false">GgzVFNvPYNXoqEX8wqpWHR</guid>
      <description>Euphoria season 3 isn't here until April, but there's lots of similar shows to watch until then &#8211; here are my three top recommendations.</description>
    </item>
    <item>
      <title>Fnac et Darty sortent le grand jeu &#224; la 2e d&#233;marque des soldes : les 16 deals &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-sortent-le-grand-jeu-a-la-2e-demarque-des-soldes-les-16-deals-a-retenir</link>
      <pubDate>Thu, 15 Jan 2026 09:19:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-sortent-le-grand-jeu-a-la-2e-demarque-des-soldes-les-16-deals-a-retenir</guid>
      <description>
C'est le TOP d&#233;part de la deuxi&#232;me d&#233;marque des soldes ! Fnac et Darty frappent fort avec de nouvelles promos&#160;: un laptop avec doubles &#233;crans &#224; -40 %, la derni&#232;re Apple Watch &#224; prix r&#233;duit ou encore une trottinette Xiaomi en promo. C&#8217;est le moment id&#233;al pour se faire plaisir&#160;!
</description>
    </item>
    <item>
      <title>LG OLED65C5 : cet excellent TV 4K (144 Hz) de 2025 revient &#224; moiti&#233; prix pour les soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2846007_lg-oled65c5-cet-excellent-tv-4k-144-hz-de-2025-revient-a-moitie-prix-pour-les-soldes-dhiver</link>
      <pubDate>Thu, 15 Jan 2026 09:11:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2846007_lg-oled65c5-cet-excellent-tv-4k-144-hz-de-2025-revient-a-moitie-prix-pour-les-soldes-dhiver</guid>
      <description>
Le t&#233;l&#233;viseur LG de la s&#233;rie C5 en 65 pouces s&#8217;affichait &#224; un prix tr&#232;s &#233;lev&#233; au lancement, mais ce n&#8217;est plus le cas gr&#226;ce &#224; cette offre des soldes d'hiver : il revient &#224; seulement 1 195 euros contre 2 699 euros &#224; sa sortie.
</description>
    </item>
    <item>
      <title>These invisible factors are limiting the future of AI</title>
      <link>https://www.fastcompany.com/91470661/invisible-factors-limiting-ai</link>
      <pubDate>2026-01-15T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91470661/invisible-factors-limiting-ai</guid>
      <description>Why data centers and language-only models threaten the next decade of innovation.
AI is no longer just a cascade of algorithms trained on massive amounts of data. It has become a physical and infrastructural phenomenon, one whose future will be determined not by breakthroughs in benchmarks, but by the hard realities of power, geography, regulation, and the very nature of intelligence. Businesses that fail to see this will be blindsided.&#160;...</description>
    </item>
    <item>
      <title>&#171; La troisi&#232;me renaissance d&#8217;Opera One &#187; : le navigateur web europ&#233;en Opera se transforme</title>
      <link>https://www.frandroid.com/culture-tech/web/2943435_la-troisieme-renaissance-dopera-one-le-navigateur-web-europeen-opera-se-transforme</link>
      <pubDate>Thu, 15 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/web/2943435_la-troisieme-renaissance-dopera-one-le-navigateur-web-europeen-opera-se-transforme</guid>
      <description>
Opera annonce le lancement d'Opera One R3, nouvelle version majeure du navigateur con&#231;u en Norv&#232;ge.
</description>
    </item>
    <item>
      <title>Test Honor Magic 8 Lite : on a trouv&#233; le smartphone increvable et il co&#251;te 400 euros</title>
      <link>https://www.frandroid.com/marques/honor/2913735_test-honor-magic-8-lite-le-smartphone-increvable-qui-ne-craint-ni-leau-ni-les-chutes</link>
      <pubDate>Thu, 15 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/honor/2913735_test-honor-magic-8-lite-le-smartphone-increvable-qui-ne-craint-ni-leau-ni-les-chutes</guid>
      <description>
Honor renforce son offre de milieu de gamme, avec ce Magic 8 Lite, qui est d&#233;sormais totalement &#233;tanche et - surtout -  s'annonce beaucoup plus endurant, gr&#226;ce &#224; une batterie de tr&#232;s grande capacit&#233;.
</description>
    </item>
    <item>
      <title>Test Xiaomi Redmi Note 15 Pro 5G : plus d&#8217;autonomie et de puissance, mais fait-il le poids face &#224; Honor et Samsung ?</title>
      <link>https://www.frandroid.com/marques/xiaomi/2918179_test-xiaomi-redmi-note-15-pro-design-revu-performances-ameliorees-mais-du-surplace-cote-logiciel</link>
      <pubDate>Thu, 15 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2918179_test-xiaomi-redmi-note-15-pro-design-revu-performances-ameliorees-mais-du-surplace-cote-logiciel</guid>
      <description>
Outre son nouveau processeur, ce smartphone de milieu de gamme de Xiaomi se distingue de son pr&#233;d&#233;cesseur par un design remis au go&#251;t du jour et une plus grosse batterie.
</description>
    </item>
    <item>
      <title>Geely en France : voici les 5 voitures qui pourraient d&#233;barquer tr&#232;s bient&#244;t</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2943553_geely-en-france-voici-les-5-voitures-qui-pourraient-debarquer-tres-bientot</link>
      <pubDate>Thu, 15 Jan 2026 08:58:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2943553_geely-en-france-voici-les-5-voitures-qui-pourraient-debarquer-tres-bientot</guid>
      <description>
Geely, le mastodonte qui poss&#232;de d&#233;j&#224; Volvo, Lotus et Zeekr, semble enfin pr&#234;t &#224; mettre son propre nom sur des voitures en France. Le signe qui ne trompe pas ? Le recrutement de Jean-Briac Dalibard, un ancien de MG et BYD, pour g&#233;rer la presse.
</description>
    </item>
    <item>
      <title>&#201;chec en France mais record historique au Vietnam : la double r&#233;alit&#233; de VinFast</title>
      <link>https://www.frandroid.com/marques/vinfast/2943371_echec-en-france-mais-record-historique-au-vietnam-la-double-realite-de-vinfast</link>
      <pubDate>Thu, 15 Jan 2026 08:54:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/vinfast/2943371_echec-en-france-mais-record-historique-au-vietnam-la-double-realite-de-vinfast</guid>
      <description>
Arriv&#233;e en Europe en 2022, VinFast a du mal &#224; s&#8217;imposer chez nous. En revanche, la marque vietnamienne de voitures &#233;lectriques cartonne dans son pays natal et y est la plus vendue.
</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver : les meilleures offres de la 2e d&#233;marque en DIRECT avec Amazon, Fnac, Darty&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2941853_soldes-dhiver-2026-offres-immanquables-deuxieme-demarque-amazon-fnac-darty-etc</link>
      <pubDate>Thu, 15 Jan 2026 08:54:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2941853_soldes-dhiver-2026-offres-immanquables-deuxieme-demarque-amazon-fnac-darty-etc</guid>
      <description>
Les soldes d'hiver ont commenc&#233; la semaine derni&#232;re et nous voici d&#233;j&#224; &#224; la deuxi&#232;me d&#233;marque ! Au programme : encore plus d'offres pour des produits Tech &#224; prix cass&#233;s, que ce soient les smartphones, les tablettes, les t&#233;l&#233;viseurs 4K, et surtout les ordinateurs portables, gaming ou de bureautique. 
</description>
    </item>
    <item>
      <title>Aspirateur-balais Dyson : 5 erreurs qui r&#233;duisent son autonomie et tuent sa batterie</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/aspirateurs-balais-sans-fil/2943449_batterie-aspirateur-balais-dyson-5-erreurs-qui-reduisent-son-autonomie-et-tuent-sa-batterie</link>
      <pubDate>Thu, 15 Jan 2026 08:44:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/aspirateurs-balais-sans-fil/2943449_batterie-aspirateur-balais-dyson-5-erreurs-qui-reduisent-son-autonomie-et-tuent-sa-batterie</guid>
      <description>
C'est la pi&#232;ce la plus fragile de votre aspirateur balai : la batterie. Changer un bloc officiel co&#251;te entre 80 et 130 euros. &#199;a fait mal. La bonne nouvelle ? En changeant simplement cinq petites habitudes quotidiennes, vous pouvez doubler sa dur&#233;e de vie.
</description>
    </item>
    <item>
      <title>Wikipedia turns 25 and shares a glimpse into the lives of its volunteer editors</title>
      <link>https://www.theverge.com/news/861935/wikipedia-25th-anniversary-2026</link>
      <pubDate>2026-01-15T03:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=861935</guid>
      <description>It's been 25 years since the launch of Wikipedia on January 15th, 2001, and it's come a long way from housing just 100 pages to becoming a behemoth of online knowledge with more than 65 million articles that get almost 15 billion views each month. To celebrate, the Wikimedia Foundation - the nonprofit that backs [&#8230;]</description>
    </item>
    <item>
      <title>Microsoft, Meta, and Amazon are paying up for &amp;#8216;enterprise&amp;#8217; access to Wikipedia</title>
      <link>https://www.theverge.com/news/862109/wikipedia-microsoft-meta-perplexity-ai-training-wikimedia-foundation</link>
      <pubDate>2026-01-15T03:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=862109</guid>
      <description>Microsoft, Meta, Amazon, Perplexity, and Mistral AI have joined Google in paying the Wikimedia Foundation for access to its projects, including Wikipedia's vast collection of articles. The Wikimedia Foundation announced the news as part of Wikipedia's 25th anniversary on Thursday. The partnerships are part of Wikimedia Enterprise, an initiative launched in 2021 that gives large [&#8230;]...</description>
    </item>
    <item>
      <title>Airdrop sur les Pixel&#160;9, optimisation de la charge, du Wi-Fi&#160;: la derni&#232;re version b&#234;ta d&#8217;Android am&#232;ne de tr&#232;s nombreux changements</title>
      <link>https://www.frandroid.com/marques/google/2943427_airdrop-sur-les-pixel-9-optimisation-de-la-charge-du-wi-fi-la-derniere-version-beta-dandroid-amene-de-tres-nombreux-changements</link>
      <pubDate>Thu, 15 Jan 2026 08:25:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2943427_airdrop-sur-les-pixel-9-optimisation-de-la-charge-du-wi-fi-la-derniere-version-beta-dandroid-amene-de-tres-nombreux-changements</guid>
      <description>
Google continue de publier des nouvelles versions b&#234;ta d&#8217;Android&#160;16 et la derni&#232;re en date embarque de tr&#232;s nombreux changements plut&#244;t encourageants quant au futur de la plateforme mobile.
</description>
    </item>
    <item>
      <title>YouTube va (enfin) permettre de d&#233;sactiver les Shorts via le contr&#244;le parental</title>
      <link>https://www.01net.com/actualites/youtube-va-enfin-permettre-de-desactiver-les-shorts-via-le-controle-parental.html</link>
      <pubDate>Thu, 15 Jan 2026 08:14:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320231</guid>
      <description>Un nouveau param&#232;tre dans le contr&#244;le parental de YouTube permettra aux parents de d&#233;sactiver ou de limiter l&#8217;acc&#232;s aux tr&#232;s addictives vid&#233;os courtes YouTube Shorts.</description>
    </item>
    <item>
      <title>Apr&#232;s avoir snob&#233; le plus grand salon v&#233;lo d&#8217;Europe, Bosch a choisi son nouveau favori</title>
      <link>https://www.frandroid.com/marques/bosch/2943421_apres-avoir-snobe-le-plus-grand-salon-velo-deurope-bosch-a-choisi-son-nouveau-favori</link>
      <pubDate>Thu, 15 Jan 2026 08:14:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bosch/2943421_apres-avoir-snobe-le-plus-grand-salon-velo-deurope-bosch-a-choisi-son-nouveau-favori</guid>
      <description>
Le salon Cyclingworld Europe frappe fort avec une annonce importante pour son espace d&#8217;essais. L&#8217;&#233;v&#233;nement accueillera en effet Bosch eBike Systems comme partenaire officiel de Demoworld, du 20 au 22 mars 2026 &#224; D&#252;sseldorf.
</description>
    </item>
    <item>
      <title>Pour tous les nageurs, le casque OpenSwim Pro de Shokz &#224; conduction osseuse noie 65 &#8364; de son prix &#224; l&#8217;occasion des soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2942951_pour-tous-les-nageurs-le-casque-openswim-pro-de-shokz-a-conduction-osseuse-noie-65-e-de-son-prix-a-loccasion-des-soldes-dhiver</link>
      <pubDate>Thu, 15 Jan 2026 08:07:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2942951_pour-tous-les-nageurs-le-casque-openswim-pro-de-shokz-a-conduction-osseuse-noie-65-e-de-son-prix-a-loccasion-des-soldes-dhiver</guid>
      <description>
Avec le casque &#224; conduction osseuse OpenSwim Pro de Shokz, profitez de 32 Go de stockage pour pouvoir emporter votre playlist m&#234;me &#224; la piscine.
</description>
    </item>
    <item>
      <title>Agatha Christie&#8217;s Seven Dials on Netflix is a mundane mess that quickly gives away the whodunnit &#8212; so Kenneth Branagh&#8217;s mediocre Poirot movies can rest easy</title>
      <link>https://www.techradar.com/streaming/netflix/agatha-christie-seven-dials-review</link>
      <pubDate>Thu, 15 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">Xt2NYnpRcDWHJnM8KXDBb6</guid>
      <description>As a former Agatha Christie-obsessed teenager, it breaks my heart to report that Seven Dials on Netflix is a criminal adaptation of a master at work.</description>
    </item>
    <item>
      <title>After a rough year, what will will corporate impact and sustainability look like in 2026?</title>
      <link>https://www.fastcompany.com/91474881/after-a-rough-year-what-will-corporate-impact-and-sustainability-look-like-in-2026</link>
      <pubDate>2026-01-15T08:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91474881/after-a-rough-year-what-will-corporate-impact-and-sustainability-look-like-in-2026</guid>
      <description>Many companies spent last year looking to scale back (or at least stop talking about) their social impact initiatives. How will these trends evolve in 2026?
In the world of social impact and sustainability, 2025&#8217;s word of the year could have been &#8220;headwinds.&#8221; It became a euphemism for everything from political pressure and regulatory changes to economic uncertainty, AI disruption, and social upheaval.&#160;...</description>
    </item>
    <item>
      <title>Il veut d&#233;fier Bosch et DJI mais en moins cher : tr&#232;s puissant, le nouveau moteur Ananda cible tous les v&#233;los &#233;lectriques</title>
      <link>https://www.frandroid.com/marques/ananda/2943399_il-veut-defier-bosch-et-dji-mais-en-moins-cher-tres-puissant-le-nouveau-moteur-ananda-cible-tous-les-velos-electriques</link>
      <pubDate>Thu, 15 Jan 2026 07:43:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/ananda/2943399_il-veut-defier-bosch-et-dji-mais-en-moins-cher-tres-puissant-le-nouveau-moteur-ananda-cible-tous-les-velos-electriques</guid>
      <description>
Le motoriste Ananda profite du salon Velofollies, organis&#233; en Belgique du 16 au 18 janvier, pour lever le voile sur une nouvelle g&#233;n&#233;ration de moteurs pour v&#233;los &#233;lectriques. Baptis&#233;e M7000, cette s&#233;rie s'adresse autant aux VTT &#233;lectriques, VTC &#233;lectriques et v&#233;los urbains &#233;lectriques.
</description>
    </item>
  </channel>
</rss>
