<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 16 Dec 2025 08:36:20 GMT</lastBuildDate>
    <item>
      <title>Renault Twingo&#160;: le prix officiel est l&#224;, moins de 15&#160;000 euros&#160;!</title>
      <link>https://www.01net.com/actualites/renault-twingo-elle-sera-vendue-a-moins-de-15-000-euros.html</link>
      <pubDate>Tue, 16 Dec 2025 08:30:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315506</guid>
      <description>Renault a d&#233;voil&#233; les prix de sa Twingo E-Tech Electric. Le constructeur avait promis un tarif inf&#233;rieur &#224; 20 000 euros, c&#8217;est fait m&#234;me s&#8217;il faudra pour &#231;a aller chercher un bonus &#233;cologique.</description>
    </item>
    <item>
      <title>Voici les prix de la Renault Twingo &#233;lectrique en France : moins de 20 000 &#8364; confirm&#233;s !</title>
      <link>https://www.frandroid.com/marques/renault/2911127_voici-les-prix-de-la-renault-twingo-electrique-en-france-moins-de-20-000-e-confirmes</link>
      <pubDate>Tue, 16 Dec 2025 08:28:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2911127_voici-les-prix-de-la-renault-twingo-electrique-en-france-moins-de-20-000-e-confirmes</guid>
      <description>
Avec un peu d'avance, la Renault Twingo &#233;lectrique d&#233;voile ses prix pour la France. Comme pr&#233;vu, la petite voiture &#233;lectrique d&#233;marre sous les 20 000 euros, et ce hors bonus et m&#234;me en incluant la charge rapide.
</description>
    </item>
    <item>
      <title>Fuite massive de donn&#233;es chez Pornhub&#160;: l&#8217;historique des internautes a &#233;t&#233; compromis</title>
      <link>https://www.01net.com/actualites/fuite-massive-donnees-pornhub-historique-internautes-compromis.html</link>
      <pubDate>Tue, 16 Dec 2025 08:25:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315502</guid>
      <description>Les donn&#233;es de certains utilisateurs de Pornhub ont &#233;t&#233; compromises. En piratant une plateforme tierce, des pirates bien connus ont mis la main sur une grande quantit&#233; d'informations sensibles, &#224; commencer par l'historique des vid&#233;os regard&#233;es.</description>
    </item>
    <item>
      <title>Cette &#233;l&#233;gante version argent de la Huawei Watch GT 4 chute &#224; 129 &#8364; seulement</title>
      <link>https://www.frandroid.com/bons-plans/2910641_cette-elegante-version-argent-de-la-huawei-watch-gt-4-chute-a-129-e-seulement</link>
      <pubDate>Tue, 16 Dec 2025 08:23:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2910641_cette-elegante-version-argent-de-la-huawei-watch-gt-4-chute-a-129-e-seulement</guid>
      <description>
La Huawei Watch GT 4 n'est pas la plus r&#233;cente des montres connect&#233;es de la marque, mais sa version argent fait certainement partie des plus &#233;l&#233;gantes. Actuellement, Amazon l'affiche &#224; 129,99 euros au lieu de 399,99 euros au lancement.
</description>
    </item>
    <item>
      <title>Free lance enfin l&#8217;eSIM sur les montres Apple Watch dans une option gratuite !</title>
      <link>https://www.frandroid.com/marques/free/2903903_free-lance-enfin-lesim-sur-les-montres-apple-watch-dans-une-option-gratuite</link>
      <pubDate>Tue, 16 Dec 2025 08:21:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2903903_free-lance-enfin-lesim-sur-les-montres-apple-watch-dans-une-option-gratuite</guid>
      <description>
Apr&#232;s des mois d'attente, Free Mobile prend enfin en charge l'Apple Watch cellulaire &#224; l'aide d'une eSIM rattach&#233;e &#224; la ligne principale. Free devient ainsi le troisi&#232;me op&#233;rateur fran&#231;ais &#224; proposer cette option apr&#232;s Orange et SFR.
</description>
    </item>
    <item>
      <title>Dyson's new wet floor cleaner improves on the last one in these 3 big ways &#8211; I can't wait to try it properly</title>
      <link>https://www.techradar.com/home/vacuums/dysons-new-wet-floor-cleaner-improves-on-the-last-one-in-these-3-big-ways-i-cant-wait-to-try-it-properly</link>
      <pubDate>Tue, 16 Dec 2025 08:17:34 +0000</pubDate>
      <guid isPermaLink="false">4QWi4H57ZbFoAEyC4R4KVm</guid>
      <description>The Clean+Wash Hygiene might be the lightest, most hands-off cleaner on the market.</description>
    </item>
    <item>
      <title>Bondi Beach mass shooting GoFundMe campaigns raise almost $2 million</title>
      <link>https://mashable.com/article/bondi-beach-shooting-donate-gofundme-hub</link>
      <pubDate>Tue, 16 Dec 2025 08:12:09 +0000</pubDate>
      <guid isPermaLink="false">04UkjzUAOw38fklBt5FwI1h</guid>
      <description>GoFundMe has launched a hub of verified fundraisers for victims of the Bondi Beach mass shooting, Australia's deadliest in 30 years.</description>
    </item>
    <item>
      <title>Google enterre son rapport sur le dark web&#160;: pourquoi l&#8217;outil ferme d&#233;j&#224; ses portes</title>
      <link>https://www.01net.com/actualites/google-enterre-rapport-dark-web-pourquoi-outil-ferme-deja-portes.html</link>
      <pubDate>Tue, 16 Dec 2025 08:00:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315492</guid>
      <description>Google va tirer un trait sur son rapport sur le dark web&#8239;. Un an apr&#232;s l&#8217;avoir ouvert gratuitement &#224; tous les internautes, Google va d&#233;sactiver l'outil, jugeant que celui-ci n'est pas &#224; la hauteur.</description>
    </item>
    <item>
      <title>BYD veut s&#8217;attaquer &#224; Audi et Mercedes avec ces 2 nouvelles voitures &#233;lectriques qui &#171; red&#233;finiront les normes &#187;</title>
      <link>https://www.frandroid.com/marques/byd/2911065_byd-veut-sattaquer-a-audi-et-mercedes-avec-ces-2-nouvelles-voitures-electriques-qui-redefiniront-les-normes</link>
      <pubDate>Tue, 16 Dec 2025 07:59:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2911065_byd-veut-sattaquer-a-audi-et-mercedes-avec-ces-2-nouvelles-voitures-electriques-qui-redefiniront-les-normes</guid>
      <description>
BYD annonce l&#8217;arriv&#233;e de deux nouvelles voitures &#233;lectriques, &#224; savoir la berline Seal 08 et le SUV Sealion 08. Et elles pourraient tout &#224; fait finir par arriver en Europe au cours des prochaines ann&#233;es.
</description>
    </item>
    <item>
      <title>Want to run and train an LLM model locally? I found the Minisforum MS-S1 Max mini PC to be an affordable option in my tests</title>
      <link>https://www.techradar.com/computing/minisforum-ms-s1-max-mini-pc-review</link>
      <pubDate>Tue, 16 Dec 2025 07:47:00 +0000</pubDate>
      <guid isPermaLink="false">hDqhHuT7TvdZydQz5CF4eA</guid>
      <description>This is no normal mini PC, as the price highlights, but the power and expansion options offer serious potential.</description>
    </item>
    <item>
      <title>Marre des news &#171; insolites &#187; sans int&#233;r&#234;t ? Google teste une fonctionnalit&#233; pour personnaliser son fil Discover</title>
      <link>https://www.frandroid.com/marques/google/2911069_marre-des-news-insolites-sans-interet-google-teste-une-fonctionnalite-pour-personnaliser-son-fil-discover</link>
      <pubDate>Tue, 16 Dec 2025 07:36:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2911069_marre-des-news-insolites-sans-interet-google-teste-une-fonctionnalite-pour-personnaliser-son-fil-discover</guid>
      <description>
Google continue de mettre de l&#8217;IA partout. Cette fois, c&#8217;est dans son service Discover que le g&#233;ant de la recherche tente de rajouter un robot conversationnel. De quoi affiner les contenus qui vous sont propos&#233;s.
</description>
    </item>
    <item>
      <title>Voitures &#233;lectriques d&#8217;occasion : BYD vient de se doter d&#8217;une arme redoutable face &#224; Tesla et la concurrence europ&#233;enne</title>
      <link>https://www.frandroid.com/marques/byd/2911061_voitures-electriques-doccasion-byd-vient-de-se-doter-dune-arme-redoutable-face-a-tesla-et-la-concurrence-europeenne</link>
      <pubDate>Tue, 16 Dec 2025 07:25:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2911061_voitures-electriques-doccasion-byd-vient-de-se-doter-dune-arme-redoutable-face-a-tesla-et-la-concurrence-europeenne</guid>
      <description>
BYD vient d'annoncer une extension de la garantie sur les batteries de ses voitures &#233;lectriques et hybrides, passant d&#233;sormais &#224; 8 ans et 250 000 km. Une d&#233;cision r&#233;troactive pour les clients actuels.
</description>
    </item>
    <item>
      <title>Arnaque Leboncoin&#160;: n&#8217;achetez surtout pas cet appareil, c&#8217;est &#171;&#160;dur de voir la supercherie&#160;&#187;</title>
      <link>https://www.01net.com/actualites/arnaque-leboncoin-nachetez-surtout-pas-appareil-sur-site-escroqueries-multiplient.html</link>
      <pubDate>Tue, 16 Dec 2025 07:17:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315389</guid>
      <description>Leboncoin est toujours inond&#233; d'arnaques. Selon un expert de la plateforme, il existe un produit en particulier qu'il vaut mieux &#233;viter d'acheter par le biais d'une petite annonce. On vous explique pourquoi et comment limiter les risques.</description>
    </item>
    <item>
      <title>Amazon casse le prix de ce petit vid&#233;oprojecteur Full HD sur batterie avec pr&#232;s de 30% de remise</title>
      <link>https://www.frandroid.com/bons-plans/2910733_amazon-casse-le-prix-de-ce-petit-videoprojecteur-full-hd-sur-batterie-avec-pres-de-30-de-remise</link>
      <pubDate>Tue, 16 Dec 2025 07:10:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2910733_amazon-casse-le-prix-de-ce-petit-videoprojecteur-full-hd-sur-batterie-avec-pres-de-30-de-remise</guid>
      <description>
En optant pour le Dangbei Freedo Mini, vous avez un vid&#233;oprojecteur qui fonctionne sur batterie et embarque Google TV pour un maximum de divertissement chez soi ou en dehors. Bonne nouvelle : le voil&#224; en promo &#224; 369 euros au lieu de 499 euros de base. 
</description>
    </item>
    <item>
      <title>Ultra astucieuse et pratique, cette remorque v&#233;lo pliable peut facilement se fixer sur votre porte-bagages arri&#232;re</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2909851_ultra-astucieuse-et-pratique-cette-remorque-velo-pliable-peut-facilement-se-fixer-sur-votre-porte-bagages-arriere</link>
      <pubDate>Tue, 16 Dec 2025 07:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2909851_ultra-astucieuse-et-pratique-cette-remorque-velo-pliable-peut-facilement-se-fixer-sur-votre-porte-bagages-arriere</guid>
      <description>
Tr&#232;s ing&#233;nieuse avec sa structure pliable &#224; fixer &#224; l&#8217;arri&#232;re ou sur le porte-bagage, la remorque v&#233;lo Pullit est aussi compacte que pratique au quotidien, sans oublier la visibilit&#233; et une touche de personnalisation.
</description>
    </item>
    <item>
      <title>How philosophy can help with burnout</title>
      <link>https://www.fastcompany.com/91452351/how-philosophy-can-help-with-burnout</link>
      <pubDate>2025-12-16T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91452351/how-philosophy-can-help-with-burnout</guid>
      <description>Burnout can be caused by a sense that work has no meaning. Philosophical inquiry can help employees find their purpose.
One of Michael&#8217;s friends told him recently, &#8220;I&#8217;m not burned out; I&#8217;m just feeling empty.&#8221; She shows up, meets deadlines, and manages to smile in meetings. But her work feels weightless and disconnected from purpose. She&#8217;s not alone. Gallup&#8217;s 2025 State of the Global Workplace report found that only 21% of employees worldwide are engaged, and just one in three say they&#8217;re thriving. That&#8217;s not a blip&#8212;it&#8217;s a warning signal for leaders and cultures....</description>
    </item>
    <item>
      <title>ICE is spending millions on ads to recruit new agents</title>
      <link>https://www.fastcompany.com/91460777/ice-is-spending-millions-on-ads-to-recruit-new-agents</link>
      <pubDate>2025-12-16T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91460777/ice-is-spending-millions-on-ads-to-recruit-new-agents</guid>
      <description>And they&#8217;re popping up on all your favorite platforms.
The Trump administration is spending millions on advertisements aimed at recruiting new U.S. Immigration and Customs Enforcement agents. The ads are so widespread that TV viewers and social media users alike are seeing them everywhere, including on YouTube, Spotify, and LinkedIn.&#160;</description>
    </item>
    <item>
      <title>Google&#160;: c&#8217;est quoi ce nouveau bouton &#171;&#160;+&#160;&#187; sur le moteur de recherche&#160;?</title>
      <link>https://www.01net.com/actualites/google-cest-quoi-nouveau-bouton-plus-moteur-recherche.html</link>
      <pubDate>Tue, 16 Dec 2025 06:57:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315483</guid>
      <description>Google a modifi&#233; sa barre de recherche. Le changement est discret, mais il est loin d&#8217;&#234;tre anodin.</description>
    </item>
    <item>
      <title>Voici le Wheel&#8217;n Wood 2074 Cargo : bo&#238;te auto et couple monstrueux de 130 Nm pour ce v&#233;lo fran&#231;ais en bois</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2910225_voici-le-wheeln-wood-2074-cargo-boite-auto-et-couple-monstrueux-de-130-nm-pour-ce-velo-francais-en-bois</link>
      <pubDate>Tue, 16 Dec 2025 06:38:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2910225_voici-le-wheeln-wood-2074-cargo-boite-auto-et-couple-monstrueux-de-130-nm-pour-ce-velo-francais-en-bois</guid>
      <description>
Mariant sa &#171; patte bois &#187; dans le v&#233;lo &#233;lectrique et l&#8217;exp&#233;rience Ello Mobilit&#233; dans le v&#233;lo utilitaire, le biporteur Wheel&#8217;n Wood 2074 Cargo, fabriqu&#233; en France, est aussi pratique qu&#8217;unique.
</description>
    </item>
  </channel>
</rss>
