<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 18 Nov 2025 09:41:23 GMT</lastBuildDate>
    <item>
      <title>Personne ne veut des voitures &#233;lectriques &#224; 1 000 kilom&#232;tres d&#8217;autonomie : cette marque chinoise la fait dispara&#238;tre de son catalogue</title>
      <link>https://www.frandroid.com/marques/nio/2871469_personne-ne-veut-des-voitures-electriques-a-1-000-kilometres-dautonomie-cette-marque-chinoise-la-fait-disparaitre-de-son-catalogue</link>
      <pubDate>Tue, 18 Nov 2025 09:37:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nio/2871469_personne-ne-veut-des-voitures-electriques-a-1-000-kilometres-dautonomie-cette-marque-chinoise-la-fait-disparaitre-de-son-catalogue</guid>
      <description>
Le constructeur chinois Nio vient de mettre fin &#224; la production de sa batterie semi-solide permettant de parcourir 1 000 kilom&#232;tres. Une d&#233;cision prise alors que la demande n&#8217;est pas au rendez-vous pour ses voitures &#233;lectriques &#224; grande autonomie.
</description>
    </item>
    <item>
      <title>Microsoft veut transformer Windows en &#171;&#160;OS Agentique&#160;&#187; : voici ce qui change pour vous</title>
      <link>https://www.frandroid.com/marques/microsoft/2872783_microsoft-veut-transformer-windows-en-os-agentique-voici-ce-qui-change-pour-vous</link>
      <pubDate>Tue, 18 Nov 2025 09:32:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2872783_microsoft-veut-transformer-windows-en-os-agentique-voici-ce-qui-change-pour-vous</guid>
      <description>
Microsoft d&#233;voile la pr&#233;sence d'un espace de travail agentique sur Windows 11. L'occasion pour la firme d'entrer dans les d&#233;tails de sa strat&#233;gie IA. 
</description>
    </item>
    <item>
      <title>&#171;&#160;Le hardware reste au coeur&#160;&#187; : Microsoft tente de rassurer sur l&#8217;avenir de la console Xbox dans un climat d&#8217;incertitude</title>
      <link>https://www.frandroid.com/marques/microsoft/2872909_le-hardware-reste-au-coeur-microsoft-tente-de-rassurer-sur-lavenir-de-la-console-xbox-dans-un-climat-dincertitude</link>
      <pubDate>Tue, 18 Nov 2025 09:29:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2872909_le-hardware-reste-au-coeur-microsoft-tente-de-rassurer-sur-lavenir-de-la-console-xbox-dans-un-climat-dincertitude</guid>
      <description>
Malgr&#233; sa nouvelle strat&#233;gie d'expansion logicielle, Xbox r&#233;it&#232;re sa priorit&#233; de proposer une exp&#233;rience mat&#233;rielle "de nouvelle g&#233;n&#233;ration" avec sa future console.
</description>
    </item>
    <item>
      <title>Galaxy&#160;S26&#160;: le dilemme de Samsung sur la RAM</title>
      <link>https://www.frandroid.com/marques/samsung/2872939_galaxy-s26-le-dilemme-de-samsung-sur-la-ram</link>
      <pubDate>Tue, 18 Nov 2025 09:28:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2872939_galaxy-s26-le-dilemme-de-samsung-sur-la-ram</guid>
      <description>
Alors qu&#8217;il ne reste plus qu&#8217;une poign&#233;e de semaines avant la sortie pr&#233;sum&#233;e des Galaxy&#160;S26, voil&#224; que de nouvelles rumeurs nous en apprennent un peu plus sur les caract&#233;ristiques techniques des t&#233;l&#233;phones, notamment au niveau de la RAM, qui n&#8217;&#233;voluerait que peu par rapport aux derniers mod&#232;les.
</description>
    </item>
    <item>
      <title>Que signifient les chiffres sur les cartes SD et microSD (U1, U3, V30, C10, SD Express, UHS-I, UHS-II, UHS-III, SDHC, SDXC, SDUC) ?</title>
      <link>https://www.frandroid.com/comment-faire/tutoriaux/tutoriels-photo-video/2872977_que-signifient-les-chiffres-sur-les-cartes-sd-et-microsd-u1-u3-v30-c10-sd-express-uhs-i-uhs-ii-uhs-iii-sdhc-sdxc-sduc</link>
      <pubDate>Tue, 18 Nov 2025 09:23:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/comment-faire/tutoriaux/tutoriels-photo-video/2872977_que-signifient-les-chiffres-sur-les-cartes-sd-et-microsd-u1-u3-v30-c10-sd-express-uhs-i-uhs-ii-uhs-iii-sdhc-sdxc-sduc</guid>
      <description>
Vous venez d'acheter un appareil photo ou une GoPro, et on vous demande d'installer une carte SD. Probl&#232;me : sur l'emballage, vous d&#233;couvrez des symboles myst&#233;rieux comme U3, V30, C10 ou UHS-I. Pas de panique, on vous explique ce que tout cela signifie et comment choisir la bonne carte pour votre usage.
</description>
    </item>
    <item>
      <title>&#171; Une exp&#233;rience fascinante &#187; : voici les premiers avis sur le volant r&#233;volutionnaire des futures voitures &#233;lectriques de Peugeot</title>
      <link>https://www.frandroid.com/marques/peugeot/2872379_une-experience-fascinante-voici-les-premiers-avis-sur-le-volant-revolutionnaire-des-futures-voitures-electriques-de-peugeot</link>
      <pubDate>Tue, 18 Nov 2025 09:23:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/peugeot/2872379_une-experience-fascinante-voici-les-premiers-avis-sur-le-volant-revolutionnaire-des-futures-voitures-electriques-de-peugeot</guid>
      <description>
Attendu sur les prochaines voitures &#233;lectriques de Peugeot, le volant Hypersquare tient-il ses promesses&#160;? C&#8217;est ce qu&#8217;ont pu v&#233;rifier certains journalistes britanniques lors d'une prise en main en avant-premi&#232;re.
</description>
    </item>
    <item>
      <title>Android Auto teste ces nouveaux r&#233;glages pour personnaliser l&#8217;&#233;cran d&#8217;accueil</title>
      <link>https://www.01net.com/actualites/android-auto-teste-nouveaux-reglages-personnaliser-ecran-accueil.html</link>
      <pubDate>Tue, 18 Nov 2025 09:20:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308860</guid>
      <description>Android Auto continue d&#8217;avancer sur les widgets et teste aussi une nouvelle barre de navigation. On fait le point sur ces nouveaut&#233;s qui permettent de mieux personnaliser l&#8217;&#233;cran d&#8217;accueil.</description>
    </item>
    <item>
      <title>OnePlus profite du pr&#233;-Black Friday pour d&#233;stocker son r&#233;cent milieu de gamme, le Nord CE5</title>
      <link>https://www.frandroid.com/bons-plans/2736705_oneplus-profite-du-pre-black-friday-pour-destocker-son-recent-milieu-de-gamme-le-nord-ce5</link>
      <pubDate>Tue, 18 Nov 2025 09:19:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2736705_oneplus-profite-du-pre-black-friday-pour-destocker-son-recent-milieu-de-gamme-le-nord-ce5</guid>
      <description>
Le OnePlus Nord CE5 est un mod&#232;le int&#233;ressant que nous avons not&#233; 7/10 lors de notre test. Ce r&#233;cent milieu de gamme a de belles choses &#224; offrir pour satisfaire la plupart des utilisateurs. Et la bonne nouvelle,&#160;c'est qu'il se trouve en promotion &#224; 249 euros lors du pr&#233;-Black Friday, contre 369 euros &#224; sa sortie. 
</description>
    </item>
    <item>
      <title>Apr&#232;s la faillite, l&#8217;heure est &#224; la reprise pour cette marque de v&#233;los &#233;lectriques</title>
      <link>https://www.frandroid.com/actualites-generales/2872967_apres-la-faillite-lheure-est-a-la-reprise-pour-cette-marque-de-velos-electriques</link>
      <pubDate>Tue, 18 Nov 2025 09:12:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2872967_apres-la-faillite-lheure-est-a-la-reprise-pour-cette-marque-de-velos-electriques</guid>
      <description>
Secou&#233;e par des mois de turbulences financi&#232;res qui conduit &#224; des licenciements massifs et &#224; la fermeture de sa filiale am&#233;ricaine, YT Industries vient d&#8217;&#234;tre reprise par son fondateur Markus Flossmann.
</description>
    </item>
    <item>
      <title>Leapmotor pr&#233;sente sa nouvelle voiture &#233;lectrique : un petit SUV qui pourrait faire mal &#224; la Renault 4</title>
      <link>https://www.frandroid.com/marques/leapmotor/2870747_leapmotor-a10-un-petit-suv-calibre-pour-leurope</link>
      <pubDate>Tue, 18 Nov 2025 09:12:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/leapmotor/2870747_leapmotor-a10-un-petit-suv-calibre-pour-leurope</guid>
      <description>Mise &#224; jour du 18 novembre 2025 : Leapmotor vient de publier les deux premi&#232;res images officielles de son A10 sur Weibo, confirmant l&#8217;allure et les deux premi&#232;res couleurs : un vert et un beige. Rendez-vous le 21 novembre pour sa pr&#233;sentation officielle. Article initial du 17 novembre 2025 : C&#8217;&#233;tait annonc&#233;, mais &#231;a devient [&#8230;]</description>
    </item>
    <item>
      <title>Comment Apple pr&#233;pare l&#8217;apr&#232;s-Tim Cook</title>
      <link>https://www.frandroid.com/marques/apple/2872911_apple-prepare-lapres-tim-cook</link>
      <pubDate>Tue, 18 Nov 2025 09:03:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2872911_apple-prepare-lapres-tim-cook</guid>
      <description>
Tim Cook s'appr&#234;te &#224; quitter Apple. Apr&#232;s 14 ans &#224; transformer l'entreprise en g&#233;ant &#224; 4 000 milliards de dollars, le CEO pr&#233;pare son d&#233;part pour d&#233;but 2026. Le conseil d'administration acc&#233;l&#232;re les pr&#233;paratifs et John Ternus, patron de l'ing&#233;nierie hardware, est le grand favori. Le timing ? Compliqu&#233; : l'iPhone Air vient de s'effondrer commercialement et Apple n'a toujours pas de strat&#233;gie IA convaincante. Pourtant, les chiffres financiers n'ont jamais &#233;t&#233; aussi bons.
...</description>
    </item>
    <item>
      <title>Le Wand Lick 3-in-1 Review: Three Times the Pleasure</title>
      <link>https://www.wired.com/review/le-wand-lick-3-in-1/</link>
      <pubDate>Tue, 18 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">691b9c1d2d19dc17f7c6479e</guid>
      <description>This double-ended vibrator gives you a bit of everything in one unique-looking package.</description>
    </item>
    <item>
      <title>How to watch Davis Cup Finals 2025: live stream tennis online, TV channel, order of play</title>
      <link>https://www.techradar.com/how-to-watch/tennis/davis-cup-finals-2025</link>
      <pubDate>Tue, 18 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">5U5RDpUydrMCjhZdeQTyAG</guid>
      <description>Watch the 2025 Davis Cup tennis tournament as hosts Italy attempt to defend their title. Here's the schedule, TV channels, broadcasters and streams.</description>
    </item>
    <item>
      <title>Why do smart people do dumb things?</title>
      <link>https://www.fastcompany.com/91439582/why-smart-people-do-dumb-things</link>
      <pubDate>2025-11-18T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91439582/why-smart-people-do-dumb-things</guid>
      <description>IQ, EQ, and coachability all play a part.
What does it mean to be &#8220;smart&#8221; or &#8220;dumb&#8221;? Few questions are more deceptively complex.</description>
    </item>
    <item>
      <title>Black Friday 2025 : quelles sont les meilleures offres en avant-premi&#232;re sur Amazon, Fnac, Boulanger&#8230; ?</title>
      <link>https://www.frandroid.com/bons-plans/2864479_black-friday-2025-voici-les-meilleures-offres-en-avant-premiere-sur-amazon</link>
      <pubDate>Tue, 18 Nov 2025 08:54:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2864479_black-friday-2025-voici-les-meilleures-offres-en-avant-premiere-sur-amazon</guid>
      <description>
&#192; l&#8217;approche du Black Friday du 28 novembre 2025, les enseignes multiplient les promotions. Le pr&#233;-Black Friday bat son plein chez Amazon, Fnac, Darty ou Cdiscount, tandis que le Singles Day se poursuit sur AliExpress et d&#8217;autres sites. Retrouvez ici les meilleures offres issues de ces deux &#233;v&#233;nements.
</description>
    </item>
    <item>
      <title>Test du OnePlus 15 : il a tout d&#8217;un grand smartphone gaming, sauf le prix</title>
      <link>https://www.frandroid.com/marques/oneplus/2855373_test-du-oneplus-15-il-a-tout-dun-grand-smartphone-gaming-sauf-le-prix</link>
      <pubDate>Tue, 18 Nov 2025 08:45:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/oneplus/2855373_test-du-oneplus-15-il-a-tout-dun-grand-smartphone-gaming-sauf-le-prix</guid>
      <description>
Oubliez le OnePlus 13, son successeur rebat les cartes et s'inscrit sur le secteur des smartphones haut de gamme les plus performants, sans en avoir le prix.
</description>
    </item>
    <item>
      <title>Le Black Friday n&#8217;&#233;pargne pas la Switch 2 ! Voici les meilleurs deals sur les consoles, jeux, manettes et accessoires</title>
      <link>https://www.frandroid.com/bons-plans/2853043_meme-la-nintendo-switch-2-nechappe-pas-au-black-friday-voici-les-12-meilleurs-deals-sur-les-consoles-manettes-et-accessoires</link>
      <pubDate>Tue, 18 Nov 2025 08:42:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2853043_meme-la-nintendo-switch-2-nechappe-pas-au-black-friday-voici-les-12-meilleurs-deals-sur-les-consoles-manettes-et-accessoires</guid>
      <description>
L'ann&#233;e 2025 a &#233;t&#233; on ne peut plus riche pour le jeu vid&#233;o. Outre la sortie de nouveaux titres, la Nintendo Switch 2 a la part belle depuis plusieurs mois. D'autant plus qu'elle fait partie des meilleures offres dans cette s&#233;lection du pr&#233;-Black Friday, en pack avec Mario Kart World ou avec des accessoires suppl&#233;mentaires.
</description>
    </item>
    <item>
      <title>Samsung Galaxy S26 Ultra : design, &#233;cran, fen&#234;tre de sortie, prix&#8230; Tout ce qu&#8217;on sait sur le futur smartphone</title>
      <link>https://www.frandroid.com/marques/samsung/2849839_samsung-galaxy-s26-ultra-design-ecran-fenetre-de-sortie-prix-tout-ce-quon-sait-sur-le-futur-smartphone</link>
      <pubDate>Tue, 18 Nov 2025 08:41:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2849839_samsung-galaxy-s26-ultra-design-ecran-fenetre-de-sortie-prix-tout-ce-quon-sait-sur-le-futur-smartphone</guid>
      <description>
Le Samsung Galaxy S26 Ultra approche petit &#224; petit, voici tout ce que l'on sait d&#233;j&#224; &#224; son sujet (fen&#234;tre de sortie, design, &#233;cran, performances, etc.).
</description>
    </item>
    <item>
      <title>La nomination de Clair Obscur: Expedition 33 dans cette cat&#233;gorie des Game Awards est une honte</title>
      <link>https://www.frandroid.com/produits-android/console/2872829_la-nomination-de-clair-obscur-expedition-33-dans-cette-categorie-des-game-awards-est-une-honte</link>
      <pubDate>Tue, 18 Nov 2025 08:36:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2872829_la-nomination-de-clair-obscur-expedition-33-dans-cette-categorie-des-game-awards-est-une-honte</guid>
      <description>
Le jeu Clair Obscur: Expedition 33 est sur le point de tout rafler aux Game Awards 2025. Au point de d&#233;border sur des cat&#233;gories franchement peu appropri&#233;es.
</description>
    </item>
    <item>
      <title>Comme Vinted, Leboncoin et Etsy sont inond&#233;s de contenus pornographiques</title>
      <link>https://www.01net.com/actualites/comme-vinted-leboncoin-et-etsy-sont-inondes-de-contenus-pornographiques.html</link>
      <pubDate>Tue, 18 Nov 2025 08:33:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308855</guid>
      <description>Des vendeurs d&#233;tournent Etsy et Leboncoin pour promouvoir des contenus pornographiques, mettant les plateformes en infraction avec la loi fran&#231;aise. La haute-commissaire &#224; l&#8217;Enfance s'est saisie du dossier en contactant l'Arcom.</description>
    </item>
    <item>
      <title>Le bouton lat&#233;ral de l&#8217;iPhone pourra bient&#244;t lancer un autre assistant que Siri</title>
      <link>https://www.01net.com/actualites/le-bouton-lateral-de-liphone-pourra-bientot-lancer-un-autre-assistant-que-siri.html</link>
      <pubDate>Tue, 18 Nov 2025 08:02:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308823</guid>
      <description>Apple continue de peaufiner iOS 26, en ajoutant de nouvelles fonctions au fil de l'eau et des b&#234;tas. Et justement la troisi&#232;me b&#234;ta d'iOS 26.2, disponible depuis cette nuit pour les d&#233;veloppeurs, contient au moins deux nouveaut&#233;s tr&#232;s int&#233;ressantes.</description>
    </item>
    <item>
      <title>The 39 Best Shows on Apple TV, WIRED&#8217;s Picks (November 2025)</title>
      <link>https://www.wired.com/story/best-apple-tv-plus-shows/</link>
      <pubDate>Tue, 18 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">63cf1b483f042fa5827033d7</guid>
      <description>Pluribus, The Morning Show, and Slow Horses are among the best shows on Apple TV this month.</description>
    </item>
    <item>
      <title>Mastodon CEO steps down as the social network restructures</title>
      <link>https://techcrunch.com/2025/11/18/mastodon-ceo-steps-down-as-the-social-network-restructures/</link>
      <pubDate>Tue, 18 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3068367</guid>
      <description>Eugen Rochko is stepping down as CEO of decentralized social network Mastodon. Felix Hlatky will now become the Executive Director as the company become structured as a nonprofit government by a board.</description>
    </item>
    <item>
      <title>Top 10 AI chatbot do's and don&#8217;ts to help you get the most out of ChatGPT, Gemini, and more</title>
      <link>https://www.techradar.com/ai-platforms-assistants/top-10-ai-chatbot-dos-and-donts-to-help-you-get-the-most-out-of-chatgpt-gemini-and-more</link>
      <pubDate>Tue, 18 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">WToBaVSP6YHerJtjvf8R9Y</guid>
      <description>AI Chatbots aren't good at everything. Here are the top 10 do's and don't when using a chatbot.</description>
    </item>
  </channel>
</rss>
