<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 10 Dec 2025 07:26:49 GMT</lastBuildDate>
    <item>
      <title>01net Awards&#160;: le meilleur produit maison connect&#233;e de 2025 est&#8230;</title>
      <link>https://www.01net.com/actualites/01net-awards-le-meilleur-produit-maison-connectee-de-2025-est.html</link>
      <pubDate>Wed, 10 Dec 2025 07:25:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314386</guid>
      <description>La r&#233;daction de 01net.com d&#233;signe les meilleurs produits de l&#8217;ann&#233;e. D&#233;couvrez tous les jours les vainqueurs de chaque cat&#233;gorie jusqu&#8217;&#224; la remise des prix le 10 d&#233;cembre, en live s&#8217;il vous plait !</description>
    </item>
    <item>
      <title>Alexa s&#8217;invite &#224; la maison avec cette enceinte Echo Dot derni&#232;re g&#233;n&#233;ration en promo &#224; -53 %</title>
      <link>https://www.frandroid.com/bons-plans/2903589_alexa-sinvite-a-la-maison-avec-cette-enceinte-echo-dot-derniere-generation-en-promo-a-53</link>
      <pubDate>Wed, 10 Dec 2025 07:10:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2903589_alexa-sinvite-a-la-maison-avec-cette-enceinte-echo-dot-derniere-generation-en-promo-a-53</guid>
      <description>
L'Echo Dot 5 nouvelle g&#233;n&#233;ration est une enceinte connect&#233;e embarquant l'assistant vocal Alexa d'Amazon &#224; retrouver pour 29,99 euros sur Amazon et Boulanger, au lieu de 64,99 euros.
</description>
    </item>
    <item>
      <title>La bague Index 01 de Pebble ne sait faire qu&#8217;une seule chose</title>
      <link>https://www.01net.com/actualites/la-bague-index-01-de-pebble-ne-sait-faire-quune-seule-chose.html</link>
      <pubDate>Wed, 10 Dec 2025 07:00:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314640</guid>
      <description>Pebble, qui a relanc&#233; ses montres connect&#233;es &#224; l&#8217;allure geek il y a quelques mois, est de retour avec un nouveau produit tr&#232;s &#233;tonnant : une bague. Alors certes, elle aussi est connect&#233;e, mais elle ne sait faire qu&#8217;une seule chose, enregistrer des m&#233;mos vocaux de la mani&#232;re la plus simple, la plus efficace et la plus s&#233;curis&#233;e possible. Mission r&#233;ussie ?...</description>
    </item>
    <item>
      <title>Google, Microsoft, OpenAI, Anthropic et Amazon s&#8217;allient pour &#171;&#8201;standardiser&#8201;&#187; les IA de demain</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2904249_google-microsoft-openai-anthropic-et-amazon-sallient-pour-standardiser-les-ia-de-demain</link>
      <pubDate>Wed, 10 Dec 2025 06:43:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2904249_google-microsoft-openai-anthropic-et-amazon-sallient-pour-standardiser-les-ia-de-demain</guid>
      <description>
D&#233;sireux de construire la nouvelle &#232;re des IA &#171;&#8201;agentiques&#8201;&#187; sur des bases interop&#233;rables, tous les grands noms de l&#8217;IA ont cr&#233;&#233; une nouvelle structure, sous l&#8217;&#233;gide de la fondation Linux, pour piloter ce chantier.
</description>
    </item>
    <item>
      <title>Surfshark Promo Codes: 87% Off | December 2025</title>
      <link>https://www.wired.com/story/surfshark-coupon/</link>
      <pubDate>Wed, 10 Dec 2025 06:40:00 +0000</pubDate>
      <guid isPermaLink="false">67462fb5b36fe19e4f620021</guid>
      <description>Save up to 87% with a Surfshark coupon code, 3 months of VPN free today, and more December 2025 discounts from WIRED.</description>
    </item>
    <item>
      <title>01net morning&#160;: test du casque Fairphone Fairbuds XL 2, comment d&#233;sactiver l&#8217;IA de Windows 11, une nouvelle techno trop forte pour les batteries</title>
      <link>https://www.01net.com/actualites/01net-morning-test-du-casque-fairphone-fairbuds-xl-2-comment-desactiver-lia-de-windows-11-une-nouvelle-techno-trop-forte-pour-les-batteries.html</link>
      <pubDate>Wed, 10 Dec 2025 06:30:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314636</guid>
      <description>Bonjour &#224; tous, voici la matinale de 01net ! Qu&#8217;avez-vous manqu&#233; hier ? Retrouvez toute l&#8217;actu &#224; connaitre pour d&#233;marrer la journ&#233;e du bon pied !</description>
    </item>
    <item>
      <title>NordVPN Coupons and Deals: 77% Off in December 2025</title>
      <link>https://www.wired.com/story/nordvpn-coupon/</link>
      <pubDate>Wed, 10 Dec 2025 06:30:00 +0000</pubDate>
      <guid isPermaLink="false">67100c9a82459143cee93f27</guid>
      <description>Save up to 77% on 2-year plans and get 3 free months with our NordVPN discount codes.</description>
    </item>
    <item>
      <title>B&amp;You : affich&#233; &#224; tout juste 7,99 &#8364;/mois, ce copieux forfait cache un beau cadeau d&#8217;une valeur de 264 &#8364; [Sponso]</title>
      <link>https://www.frandroid.com/telecom/forfait-mobile/2902397_byou-affiche-a-tout-juste-799-e-mois-ce-copieux-forfait-cache-un-beau-cadeau-dune-valeur-de-264-e</link>
      <pubDate>Wed, 10 Dec 2025 06:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/forfait-mobile/2902397_byou-affiche-a-tout-juste-799-e-mois-ce-copieux-forfait-cache-un-beau-cadeau-dune-valeur-de-264-e</guid>
      <description>
B&amp;You c&#233;l&#232;bre No&#235;l avant l&#8217;heure et r&#233;duit exceptionnellement le prix de ses offres mobiles. Son forfait sans engagement de 90 Go avec 5G offerte tombe au prix plancher de 7,99 euros par mois.
</description>
    </item>
    <item>
      <title>LegalZoom Promo Code: Exclusive 10% Off LLC Formations</title>
      <link>https://www.wired.com/story/legalzoom-promo-code/</link>
      <pubDate>Wed, 10 Dec 2025 06:20:00 +0000</pubDate>
      <guid isPermaLink="false">67bccd2587d7d823b73305d9</guid>
      <description>Save on top services at LegalZoom, like LLC registration, incorporation, estate plans, and more with coupons and deals from WIRED.</description>
    </item>
    <item>
      <title>Besoin de beaucoup de data pour No&#235;l ? Ce forfait mobile 5G est &#224; un prix imbattable</title>
      <link>https://www.frandroid.com/bons-plans/2903837_besoin-de-beaucoup-de-data-pour-noel-ce-forfait-mobile-5g-est-a-un-prix-imbattable</link>
      <pubDate>Wed, 10 Dec 2025 06:20:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2903837_besoin-de-beaucoup-de-data-pour-noel-ce-forfait-mobile-5g-est-a-un-prix-imbattable</guid>
      <description>
Cdiscount Mobile frappe fort avant les f&#234;tes avec une enveloppe de 300 Go en 5G pour seulement 12,99 euros par mois. Une offre au rapport data-prix impressionnant qui peut servir de connexion principale, &#224; condition toutefois de garder un &#339;il sur le compteur.
</description>
    </item>
    <item>
      <title>AT&amp;T Promo Codes and Bundle Deals: Save $50 in December</title>
      <link>https://www.wired.com/story/att-promo-code/</link>
      <pubDate>Wed, 10 Dec 2025 06:10:00 +0000</pubDate>
      <guid isPermaLink="false">67bccc2de807ab74e8f0139a</guid>
      <description>Whether you&#8217;re looking to upgrade your internet or get the latest phone, we&#8217;ve got you covered with our selection of AT&amp;T coupons and deals.</description>
    </item>
    <item>
      <title>Citro&#235;n et Goodyear s&#8217;associent pour r&#233;inventer la roue avec ce pneu lumineux et connect&#233;</title>
      <link>https://www.frandroid.com/marques/citroen/2903763_citroen-et-goodyear-sassocient-pour-reinventer-la-roue-avec-ce-pneu-lumineux-et-connecte</link>
      <pubDate>Wed, 10 Dec 2025 06:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/citroen/2903763_citroen-et-goodyear-sassocient-pour-reinventer-la-roue-avec-ce-pneu-lumineux-et-connecte</guid>
      <description>
Le nouveau concept-car Citro&#235;n Elo avec Decathlon fait tourner les t&#234;tes, et pas seulement pour ses lignes. Le constructeur fran&#231;ais s'est associ&#233; &#224; Goodyear pour cr&#233;er un pneumatique qui parle, s'illumine et "red&#233;finit la relation entre le conducteur et ses roues." Rien que &#231;a.
</description>
    </item>
    <item>
      <title>Hulu Promo Codes &amp; Discounts: 20% Off December</title>
      <link>https://www.wired.com/story/hulu-promo-code/</link>
      <pubDate>Wed, 10 Dec 2025 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">67461c8e59fe5ea770ff3e9a</guid>
      <description>Students can get a Hulu plan for $1.99 per month. Get more details on this and other great deals below.</description>
    </item>
    <item>
      <title>Watch the Day of the Devs: Game Awards 2025 edition right here at 1PM ET</title>
      <link>https://www.engadget.com/gaming/watch-the-day-of-the-devs-game-awards-2025-edition-right-here-at-1pm-et-060000319.html?src=rss</link>
      <pubDate>Wed, 10 Dec 2025 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">c442f90d-810b-4851-8ff3-70c39f938773</guid>
      <description>The Game Awards 2025 edition of the Day of the Devs digital showcase goes live on Wednesday, December 10 at 1PM ET on Twitch and YouTube. That&#8217;s more than 30 hours before The Game Awards itself kicks off, which makes perfect sense. It is called Day of the Devs, after all, and if we&#8217;re judging by past appearances, the event absolutely deserves its own full 24 hours in the spotlight.This year, the Day of the Devs: The Game Awards Digital Showcase will feature 22 indie titles, including three release date announcements and six world premieres. That&#8217;s a packed show, even by Day of the Devs standar...</description>
    </item>
  </channel>
</rss>
