<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 11 Dec 2025 09:30:44 GMT</lastBuildDate>
    <item>
      <title>Comment les voitures &#233;lectriques chinoises de Xpeng ont r&#233;ussi &#224; d&#233;passer Tesla sur un point clef</title>
      <link>https://www.frandroid.com/marques/xpeng/2906067_comment-les-voitures-electriques-chinoises-de-xpeng-ont-reussi-a-depasser-tesla-sur-un-point-clef</link>
      <pubDate>Thu, 11 Dec 2025 09:22:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2906067_comment-les-voitures-electriques-chinoises-de-xpeng-ont-reussi-a-depasser-tesla-sur-un-point-clef</guid>
      <description>
Si la startup chinoise Xpeng s&#8217;est fortement inspir&#233;e des voitures &#233;lectriques de Tesla et a appris du constructeur am&#233;ricain, elle fait d&#233;sormais mieux que ce dernier, notamment sur la conduite autonome.
</description>
    </item>
    <item>
      <title>Ayaneo&#8217;s first Android phone looks like a return of the Xperia Play</title>
      <link>https://www.theverge.com/news/842243/ayaneo-pocket-play-gaming-phone-android-sony-xperia-play</link>
      <pubDate>2025-12-11T04:16:52-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=842243</guid>
      <description>Retro gaming handheld manufacturer Ayaneo has finally revealed the design of its first Android phone, which has been teased since August. Fittingly, it too is a throwback - to 2011's Sony Ericcson Xperia Play. The Pocket Play has a screen that slides up to reveal a full set of inset physical controls, including a D-pad, [&#8230;]</description>
    </item>
    <item>
      <title>Windows 11 : vos jeux plantent avec une carte graphique AMD ? Ces deux mises &#224; jour corrigent enfin le probl&#232;me</title>
      <link>https://www.frandroid.com/marques/amd/2906091_windows-11-vos-jeux-plantent-avec-une-carte-graphique-amd-ces-deux-mises-a-jour-corrigent-enfin-le-probleme</link>
      <pubDate>Thu, 11 Dec 2025 09:08:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amd/2906091_windows-11-vos-jeux-plantent-avec-une-carte-graphique-amd-ces-deux-mises-a-jour-corrigent-enfin-le-probleme</guid>
      <description>
De r&#233;centes mises &#224; jour de Windows 11 et des pilotes AMD auraient r&#233;solu de nombreux probl&#232;mes d'instabilit&#233; sur les jeux r&#233;cents.
</description>
    </item>
    <item>
      <title>Le Galaxy Z TriFold r&#233;serve une fonction bien pratique si vous travaillez sur PC</title>
      <link>https://www.frandroid.com/marques/samsung/2906079_le-galaxy-z-trifold-reserve-une-fonction-bien-pratique-si-vous-travaillez-sur-pc</link>
      <pubDate>Thu, 11 Dec 2025 09:04:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2906079_le-galaxy-z-trifold-reserve-une-fonction-bien-pratique-si-vous-travaillez-sur-pc</guid>
      <description>
Le Galaxy Z TriFold est d&#233;j&#224; parvenu &#224; capturer la curiosit&#233; du grand public avec son aspect &#224; mi-chemin entre le smartphone et la tablette. Mais le mobile embarque en plus des fonctionnalit&#233;s logicielles int&#233;ressantes, comme la possibilit&#233; de l&#8217;utiliser en tant que second &#233;cran.
</description>
    </item>
    <item>
      <title>Cyberattaque contre des &#171;&#160;dizaines de banques europ&#233;ennes&#160;&#187; : votre compte est peut-&#234;tre dans le viseur de Spiderman</title>
      <link>https://www.01net.com/actualites/cyberattaque-cours-contre-dizaines-banques-europeennes-votre-compte-peut-etre-viseur-spiderman.html</link>
      <pubDate>Thu, 11 Dec 2025 09:01:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314959</guid>
      <description>Une menace d'envergure plane sur les banques europ&#233;ennes. &#192; l'aide d'un kit de phishing baptis&#233; Spiderman, des cybercriminels cherchent actuellement &#224; s'emparer de vos donn&#233;es pour siphonner votre compte bancaire. Des dizaines de banques, et des services financiers, comme PayPal, sont vis&#233;s.</description>
    </item>
    <item>
      <title>How to watch 2026 PDC World Darts Championship online: FREE live streams, schedule, seeds, Round 1 preview and draw</title>
      <link>https://www.techradar.com/how-to-watch/sport/2026-pdc-world-darts-championship-free</link>
      <pubDate>Thu, 11 Dec 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">3dPTcs4tLz7QQrWMZpTr2Y</guid>
      <description>The world's top tungsten talent visit the Ally Pally mecca in London, here's how to watch 2026 World Darts Championship live streams online from anywhere in the world.</description>
    </item>
    <item>
      <title>Le prix du Google Pixel 9 Pro XL fond comme neige au soleil pour No&#235;l (-45 %)</title>
      <link>https://www.frandroid.com/bons-plans/2823769_le-prix-du-google-pixel-9-pro-xl-fond-comme-neige-au-soleil-pour-noel</link>
      <pubDate>Thu, 11 Dec 2025 08:58:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2823769_le-prix-du-google-pixel-9-pro-xl-fond-comme-neige-au-soleil-pour-noel</guid>
      <description>
C'est une vente flash express de No&#235;l sur Amazon, pendant laquelle le Google Pixel 9 Pro XL chute &#224; seulement 658,44 euros alors qu'il en valait 1 199 euros &#224; son lancement en 2024. Attention, les stocks sont tr&#232;s limit&#233;s !
</description>
    </item>
    <item>
      <title>P&#233;nurie de RAM : ces 3 PC bien &#233;quip&#233;s sont encore propos&#233;s &#224; bon prix (pour l&#8217;instant) [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/2903721_penurie-de-ram-ces-3-pc-bien-equipes-sont-encore-proposes-a-bon-prix-pour-linstant</link>
      <pubDate>Thu, 11 Dec 2025 08:56:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2903721_penurie-de-ram-ces-3-pc-bien-equipes-sont-encore-proposes-a-bon-prix-pour-linstant</guid>
      <description>
Vous ne pensiez pas vous (r&#233;)&#233;quiper avant au moins un an ? La p&#233;nurie de RAM va certainement bouleverser vos plans. Heureusement, il est encore temps de renouveler son mat&#233;riel &#224; prix tr&#232;s correct gr&#226;ce &#224; PcComponentes.
</description>
    </item>
    <item>
      <title>10 nouvelles voitures &#233;lectriques au crash-test : Mercedes et les chinois brillent quand Alpine d&#233;&#231;oit</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2905999_10-nouvelles-voitures-electriques-au-crash-test-mercedes-et-les-chinois-brillent-quand-alpine-decoit</link>
      <pubDate>Thu, 11 Dec 2025 08:51:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2905999_10-nouvelles-voitures-electriques-au-crash-test-mercedes-et-les-chinois-brillent-quand-alpine-decoit</guid>
      <description>
L&#8217;EuroNCAP vient de d&#233;voiler les r&#233;sultats de ses derniers crash-tests en date. Et si Mercedes brille avec sa nouvelle CLA, ce n&#8217;est pas la m&#234;me histoire pour Alpine avec sa nouvelle voiture &#233;lectrique.
</description>
    </item>
    <item>
      <title>Spotify teste une fonction pour g&#233;n&#233;rer des playlists &#224; l&#8217;aide d&#8217;un prompt</title>
      <link>https://www.01net.com/actualites/spotify-teste-une-fonction-pour-generer-des-playlists-a-laide-dun-prompt.html</link>
      <pubDate>Thu, 11 Dec 2025 08:45:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314984</guid>
      <description>La plate-forme de diffusion en streaming veut vous laisser contr&#244;ler son algorithme. Spotify est en train de tester une nouvelle fonctionnalit&#233; permettant de cr&#233;er des playlists bas&#233;es sur votre historique d&#8217;&#233;coute &#224; l&#8217;aide d&#8217;un simple prompt.</description>
    </item>
    <item>
      <title>Ces autoroutes &#233;lectriques qui permettent &#224; la France d&#8217;&#233;viter &#171;&#160;40 blackouts par an&#160;&#187;</title>
      <link>https://www.frandroid.com/survoltes/energie/2906061_ces-autoroutes-electriques-qui-permettent-a-la-france-deviter-40-blackouts-par-an</link>
      <pubDate>Thu, 11 Dec 2025 08:38:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/energie/2906061_ces-autoroutes-electriques-qui-permettent-a-la-france-deviter-40-blackouts-par-an</guid>
      <description>
Pour &#233;viter que le blackout espagnol ne se reproduise, l'Europe veut cr&#233;er huit autoroutes de l'&#233;nergie. Des autoroutes existent d&#233;j&#224;, permettant d'&#233;viter 40 blackout &#224; la France par an.
</description>
    </item>
    <item>
      <title>Google Maps : fini la gal&#232;re pour retrouver votre voiture, mais pas pour tout le monde</title>
      <link>https://www.frandroid.com/marques/google/2905991_google-maps-fini-la-galere-pour-retrouver-votre-voiture-mais-pas-pour-tout-le-monde</link>
      <pubDate>Thu, 11 Dec 2025 08:30:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2905991_google-maps-fini-la-galere-pour-retrouver-votre-voiture-mais-pas-pour-tout-le-monde</guid>
      <description>
Google d&#233;ploie une fonctionnalit&#233; permettant d'enregistrer automatiquement votre place de stationnement. Tr&#232;s attendue, cette option n'est cependant pas disponible pour tous. 
</description>
    </item>
    <item>
      <title>B&#234;ta One UI 8.5 : voici la liste officielle des smartphones Samsung compatibles</title>
      <link>https://www.frandroid.com/marques/2905943_beta-one-ui-8-5-voici-la-liste-officielle-des-smartphones-samsung-compatibles</link>
      <pubDate>Thu, 11 Dec 2025 08:25:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2905943_beta-one-ui-8-5-voici-la-liste-officielle-des-smartphones-samsung-compatibles</guid>
      <description>
Vous attendiez impatiemment de tester les nouveaut&#233;s de One UI 8.5 ? Calmez vos ardeurs. Samsung vient de d&#233;voiler la liste des appareils &#233;ligibles &#224; la b&#234;ta, et c'est une douche froide. Trois mod&#232;les, pas un de plus. 
</description>
    </item>
    <item>
      <title>Gemini arrive dans Chrome sur l&#8217;iPhone, mais pas pour tout le monde</title>
      <link>https://www.01net.com/actualites/gemini-arrive-dans-chrome-sur-liphone-mais-pas-pour-tout-le-monde.html</link>
      <pubDate>Thu, 11 Dec 2025 08:23:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314964</guid>
      <description>L&#8217;assistant vocal de Google commence &#224; faire son arriv&#233;e dans Chrome sur iOS, mais tout le monde ne pourra pas y acc&#233;der dans l&#8217;imm&#233;diat.</description>
    </item>
    <item>
      <title>Worst thing hes ever said: Kimmel slams Trump for racist immigration comments</title>
      <link>https://mashable.com/video/kimmel-trump-racist-immigration-speech-somalia</link>
      <pubDate>Thu, 11 Dec 2025 08:17:05 +0000</pubDate>
      <guid isPermaLink="false">03HacnZycaSzG2zAv6oP1IL</guid>
      <description>Jimmy Kimmel called out President Donald Trump's recent comments on immigration as potentially "the worst thing he's ever said."</description>
    </item>
    <item>
      <title>iPhone&#160;: voici les apps les plus t&#233;l&#233;charg&#233;es en 2025 par les Fran&#231;ais</title>
      <link>https://www.01net.com/actualites/iphone-apps-plus-telechargees-2025-par-francais.html</link>
      <pubDate>Thu, 11 Dec 2025 08:13:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314965</guid>
      <description>Comme chaque ann&#233;e, Apple publie son classement des applications les plus t&#233;l&#233;charg&#233;es en France. Voici le top des apps iPhone les plus populaires en 2025.</description>
    </item>
    <item>
      <title>Fin du thermique en 2035&#160;: pourquoi l&#8217;Europe panique et reporte ses annonces</title>
      <link>https://www.01net.com/actualites/fin-du-thermique-en-2035-pourquoi-leurope-panique-et-reporte-ses-annonces.html</link>
      <pubDate>Thu, 11 Dec 2025 08:02:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1314876</guid>
      <description>Bruxelles reporte au 16 d&#233;cembre ses arbitrages sur la fin du thermique. Entre l'Allemagne qui freine et la perc&#233;e chinoise, l'UE est au bord de la crise de nerfs.</description>
    </item>
    <item>
      <title>The best streaming deals: Save on MasterClass, Audible, Philo and others</title>
      <link>https://www.engadget.com/deals/best-streaming-service-deals-133028980.html?src=rss</link>
      <pubDate>Thu, 11 Dec 2025 08:01:27 +0000</pubDate>
      <guid isPermaLink="false">026fe1b5-ea22-49f6-8016-fd8686928f5c</guid>
      <description>Streaming services keep raising prices. At this point, if you subscribe to all the major services out there, you're basically paying the same price as cable &#8212; those antiquated local monopolies that streaming was supposed to save us from. But streaming still has one big advantage over the old ways: no contracts. That means you can grab a good streaming deal and then cancel without penalty.
Our advice is to sign up for a service when you see a good streaming deal (or the latest season of, say, Doctor Who, Severance, Andor and/or The Last of Us). Then, when the deal ends or you've binged whatever...</description>
    </item>
    <item>
      <title>Fuite chez Xiaomi : voici les 3 prochaines voitures &#233;lectrique (dont celle qui arrive en Europe)</title>
      <link>https://www.frandroid.com/marques/xiaomi/2905589_fuite-chez-xiaomi-voici-les-3-prochaines-voitures-electrique-dont-celle-qui-arrive-en-europe</link>
      <pubDate>Thu, 11 Dec 2025 08:00:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2905589_fuite-chez-xiaomi-voici-les-3-prochaines-voitures-electrique-dont-celle-qui-arrive-en-europe</guid>
      <description>
Un m&#233;dia chinois annonce conna&#238;tre les plans de Xiaomi pour ses futures voitures &#233;lectriques, et notamment le mod&#232;le qui arrivera en Europe en 2027.
</description>
    </item>
    <item>
      <title>What not to say to someone who just got laid off</title>
      <link>https://www.fastcompany.com/91455765/what-not-to-say-to-someone-who-just-got-laid-off</link>
      <pubDate>2025-12-11T08:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91455765/what-not-to-say-to-someone-who-just-got-laid-off</guid>
      <description>Advice from experts&#8212;and from workers who&#8217;ve been there.
In today&#8217;s workplace, layoffs are no longer rare&#8212;they&#8217;re a reality many employees have seen up close or have experienced themselves.&#160;</description>
    </item>
    <item>
      <title>L&#8217;interdiction des r&#233;seaux sociaux aux moins de 15&#160;ans sera d&#233;battue le mois prochain en France</title>
      <link>https://www.frandroid.com/culture-tech/politique/2906039_linterdiction-des-reseaux-sociaux-aux-moins-de-15-ans-sera-debattue-le-mois-prochain-en-france</link>
      <pubDate>Thu, 11 Dec 2025 07:51:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/politique/2906039_linterdiction-des-reseaux-sociaux-aux-moins-de-15-ans-sera-debattue-le-mois-prochain-en-france</guid>
      <description>
Martel&#233;e par Emmanuel Macron depuis de longs mois maintenant, l&#8217;id&#233;e d&#8217;interdire les r&#233;seaux sociaux aux moins de 15&#160;ans en France va &#234;tre d&#233;battue en janvier 2025 &#224; l&#8217;Assembl&#233;e nationale.
</description>
    </item>
    <item>
      <title>Volkswagen brise ses propres r&#232;gles gr&#226;ce &#224; la Chine : voici la voiture &#233;lectrique con&#231;ue en un temps record</title>
      <link>https://www.frandroid.com/marques/volkswagen/2905673_volkswagen-brise-ses-propres-regles-grace-a-la-chine-voici-la-voiture-electrique-concue-en-un-temps-record</link>
      <pubDate>Thu, 11 Dec 2025 07:33:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2905673_volkswagen-brise-ses-propres-regles-grace-a-la-chine-voici-la-voiture-electrique-concue-en-un-temps-record</guid>
      <description>
Volkswagen, qui est associ&#233; au constructeur XPeng en Chine, s'appr&#234;tent &#224; lancer sa nouvelle voiture &#233;lectrique, l'ID.Unyx 07, qui remet en question les m&#233;thodes traditionnelles de l'industrie automobile europ&#233;enne.
</description>
    </item>
  </channel>
</rss>
