<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 04 Dec 2025 14:26:43 GMT</lastBuildDate>
    <item>
      <title>Anthropic signs $200M deal to bring its LLMs to Snowflake&#8217;s customers</title>
      <link>https://techcrunch.com/2025/12/04/anthropic-signs-200m-deal-to-bring-its-llms-to-snowflakes-customers/</link>
      <pubDate>Thu, 04 Dec 2025 14:22:03 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3072731</guid>
      <description>AI research lab Anthropic inked a $200 million deal with Snowflake to bring its AI models to Snowflake's 12,600 customers.</description>
    </item>
    <item>
      <title>This DDoS group just smashed the previous record with a 29.7 Tbps attack</title>
      <link>https://www.techradar.com/pro/security/this-ddos-group-just-smashed-the-previous-record-with-a-29-7-tbps-attack</link>
      <pubDate>Thu, 04 Dec 2025 14:19:00 +0000</pubDate>
      <guid isPermaLink="false">pRNW73odZ7HDr8N6QgvyVf</guid>
      <description>Aisuru is back on the headlines again, breaking new DDoS records.</description>
    </item>
    <item>
      <title>Don't buy a PC until you see this &#163;315 Core Ultra 7 with 1TB SSD and 16GB RAM &#8212; MSI cuts 60% off Claw handheld gaming console amidst Cyber Monday clear-out</title>
      <link>https://www.techradar.com/pro/dont-buy-a-pc-until-you-see-this-gbp315-core-ultra-7-with-1tb-ssd-and-16gb-ram-msi-cuts-60-percent-off-claw-handheld-gaming-console-amidst-cyber-monday-clear-out</link>
      <pubDate>Thu, 04 Dec 2025 14:17:43 +0000</pubDate>
      <guid isPermaLink="false">rFxssiGn6mefCCZ9FXbxVN</guid>
      <description>This gaming handheld console is technically a mini PC and it has no rival even at twice the price</description>
    </item>
    <item>
      <title>P&#233;nurie RAM : le &#171;&#160;cartel&#160;&#187; de la m&#233;moire a d&#233;cid&#233; de vous faire payer le prix fort jusqu&#8217;en 2028</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-fixes/mini-pc/2898935_penurie-ram-le-cartel-de-la-memoire-a-decide-de-vous-faire-payer-le-prix-fort-jusquen-2028</link>
      <pubDate>Thu, 04 Dec 2025 14:15:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-fixes/mini-pc/2898935_penurie-ram-le-cartel-de-la-memoire-a-decide-de-vous-faire-payer-le-prix-fort-jusquen-2028</guid>
      <description>
C'est une douche froide pour le monde du hardware. Alors que la demande explose, les g&#233;ants de la m&#233;moire vive refusent d'augmenter la cadence. Et en plus, Micron abandonne le grand public en supprimant Crucial. L'objectif ? Tout miser sur l'IA et les data centers, au d&#233;triment de votre PC.
</description>
    </item>
    <item>
      <title>Nvidia&#8217;s new RTX 50-series GPU driver restores PhysX support for popular games</title>
      <link>https://www.theverge.com/news/838043/nvidia-rtx-50-series-physx-support-driver</link>
      <pubDate>2025-12-04T09:11:16-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=838043</guid>
      <description>Nvidia launched its first RTX 50-series graphics cards earlier this year without support for PhysX, the GPU-accelerated technology that let games realistically simulate shattering glass, moving liquids, smoke, fog, and more. Now, Nvidia is bringing back PhysX support for the RTX 50-series GPUs for top-played games like Borderlands 2, Mirror&#8217;s Edge, and Batman: Arkham City. [&#8230;]...</description>
    </item>
    <item>
      <title>Google Chrome s&#8217;inspire de Vivaldi et ajoute cette fonction attendue</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/2898927_google-chrome-sinspire-de-vivaldi-et-ajoute-cette-fonction-attendue</link>
      <pubDate>Thu, 04 Dec 2025 14:07:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/2898927_google-chrome-sinspire-de-vivaldi-et-ajoute-cette-fonction-attendue</guid>
      <description>
Il est d&#233;sormais possible d'am&#233;liorer sa productivit&#233; sur Google Chrome en affichant simultan&#233;ment deux onglets.
</description>
    </item>
    <item>
      <title>Who Is This Mysterious &#8216;South African Tech Billionaire&#8217; in Olivia Nuzzi&#8217;s New Book?</title>
      <link>https://gizmodo.com/who-is-this-mysterious-south-african-tech-billionaire-in-olivia-nuzzis-new-book-2000695319</link>
      <pubDate>Thu, 04 Dec 2025 14:05:53 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000695319</guid>
      <description>Everyone's focused on what the book says about the RFK Jr. scandal. But one of its more bizarre elements, is what it doesn't say.</description>
    </item>
    <item>
      <title>Yahoo is using AI to recap football games in real time</title>
      <link>https://www.theverge.com/ai-artificial-intelligence/837950/yahoo-sports-game-breakdowns-ai</link>
      <pubDate>2025-12-04T09:05:16-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=837950</guid>
      <description>It's about to be week 14 of the NFL season, and stakes and storylines abound across the league. In a new section of the Yahoo Sports app, Yahoo is hoping it can use AI to capture them all automatically. The company is launching a new feature called Game Breakdowns, which attempt to generate a snapshot [&#8230;]</description>
    </item>
    <item>
      <title>EU investigating Meta over policy change that bans rival AI chatbots from WhatsApp</title>
      <link>https://techcrunch.com/2025/12/04/eu-investigating-meta-over-policy-change-that-bans-rival-ai-chatbots-from-whatsapp/</link>
      <pubDate>Thu, 04 Dec 2025 14:02:28 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3072728</guid>
      <description>The European Commission is is launching an antitrust investigation into Meta's move to ban other AI companies from using WhatsApp's business tools to offer their own AI chatbots to users.</description>
    </item>
    <item>
      <title>AWS launches Kiro powers with Stripe, Figma, and Datadog integrations for AI-assisted coding</title>
      <link>https://venturebeat.com/ai/aws-launches-kiro-powers-with-stripe-figma-and-datadog-integrations-for-ai</link>
      <pubDate>Thu, 04 Dec 2025 14:02:00 GMT</pubDate>
      <guid isPermaLink="false">7H0cUA7UJWPplaTv5Mlmr7</guid>
      <description>Amazon Web Services on Wednesday introduced Kiro powers, a system that allows software developers to give their AI coding assistants instant, specialized expertise in specific tools and workflows &#8212; addressing what the company calls a fundamental bottleneck in how artificial intelligence agents operate today.AWS made the announcement at its annual re:Invent conference in Las Vegas. The capability marks a departure from how most AI coding tools work today. Typically, these tools load every possible capability into memory upfront &#8212; a process that burns through computational resources and can over...</description>
    </item>
    <item>
      <title>Antigravity A1 Review: A 360-Degree Drone</title>
      <link>https://www.wired.com/review/antigravity-a1/</link>
      <pubDate>Thu, 04 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">692f88f9ed818d3ee9d1ea21</guid>
      <description>The Antigravity A1 is fun all around, if you don&#8217;t mind the steep price or wearing goggles to control it.</description>
    </item>
    <item>
      <title>AI finds its way into Apple&#8217;s top apps of the year</title>
      <link>https://techcrunch.com/2025/12/04/ai-finds-its-way-into-apples-top-apps-of-the-year/</link>
      <pubDate>Thu, 04 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3072505</guid>
      <description>Although Apple has continued to avoid naming a dedicated AI app or AI chatbot as its app of the year, AI was showcased among this year's winners.</description>
    </item>
    <item>
      <title>Apple reveals the 17 must-download apps of 2025 &#8211; the App Store Award winners are here</title>
      <link>https://www.techradar.com/computing/websites-apps/apple-reveals-the-17-must-download-apps-of-2025-the-app-store-award-winners-are-here</link>
      <pubDate>Thu, 04 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">xvrZ6yoAKkpkon7GPfNbx7</guid>
      <description>Apple&#8217;s 2025 App Store Award Winners highlight 17 standout apps that showcase the year&#8217;s surge in AI, design, and cross-platform innovation on the iPhone, iPad, Mac, Apple Watch, Apple TV, and Apple Vision Pro.</description>
    </item>
    <item>
      <title>Sony reveals new steampunk fantasy RPG The God Slayer for PS5, Xbox, and PC as part of the company's China Hero Project</title>
      <link>https://www.techradar.com/gaming/sony-reveals-new-steampunk-fantasy-rpg-the-god-slayer-for-ps5-xbox-and-pc</link>
      <pubDate>Thu, 04 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">XJXkmUzvEkKtfMHwtyoFLE</guid>
      <description>Sony has announced The God Slayer, a new steampunk fantasy role-playing game (RPG) from the My Time at Portia studio Pathea Games.</description>
    </item>
    <item>
      <title>I tested the Antigravity 360 drone &#8211; and only a sky-high price tag brings this unique DJI rival down to earth</title>
      <link>https://www.techradar.com/cameras/drones/antigravity-a1-review</link>
      <pubDate>Thu, 04 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">LYDsU5xsw6BEGi8crCKwU9</guid>
      <description>The Antigravity A1 is an innovative 360-degree drone that uses FPV goggles and a motion controller for an immersive experience while capturing up to 8K video.</description>
    </item>
    <item>
      <title>Gong study: Sales teams using AI generate 77% more revenue per rep</title>
      <link>https://venturebeat.com/ai/gong-study-sales-teams-using-ai-generate-77-more-revenue-per-rep</link>
      <pubDate>Thu, 04 Dec 2025 14:00:00 GMT</pubDate>
      <guid isPermaLink="false">KW4Yl7YUFQsuDHi2AEnxC</guid>
      <description>The debate over whether artificial intelligence belongs in the corporate boardroom appears to be over &#8212; at least for the people responsible for generating revenue.Seven in ten enterprise revenue leaders now trust AI to regularly inform their business decisions, according to a sweeping new study released Thursday by Gong, the revenue intelligence company. The finding marks a dramatic shift from just two years ago, when most organizations treated AI as an experimental technology relegated to pilot programs and individual productivity hacks.The research, based on an analysis of 7.1 million sales ...</description>
    </item>
    <item>
      <title>Nvidia GeForce Now en d&#233;cembre 2025 : la synchronisation Battle.net arrive, avec une promotion et une trentaine de nouveaux jeux !</title>
      <link>https://www.frandroid.com/marques/nvidia/2898817_nvidia-geforce-now-en-decembre-2025-la-synchronisation-battle-net-arrive-avec-une-promotion-et-une-trentaine-de-nouveaux-jeux</link>
      <pubDate>Thu, 04 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2898817_nvidia-geforce-now-en-decembre-2025-la-synchronisation-battle-net-arrive-avec-une-promotion-et-une-trentaine-de-nouveaux-jeux</guid>
      <description>
Pour la fin de l'ann&#233;e, Nvidia GeForce Now met les petits plats dans les grands. Pour commencer, c'est un ensemble de 30 jeux qui rejoint la ludoth&#232;que de la plateforme de cloud gaming. Sans compter cette nouveaut&#233; qui facilite la vie &#224; celles et ceux qui ont un compte Battle.net.
</description>
    </item>
    <item>
      <title>Ce drone FPV 360 degr&#233;s d&#233;barque en France et filme absolument tout autour de vous</title>
      <link>https://www.frandroid.com/produits-android/photo/drones/2893013_ce-drone-fpv-360-degres-debarque-en-france-et-filme-absolument-tout-autour-de-vous</link>
      <pubDate>Thu, 04 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/photo/drones/2893013_ce-drone-fpv-360-degres-debarque-en-france-et-filme-absolument-tout-autour-de-vous</guid>
      <description>
Antigravity lance aujourd'hui son premier drone &#224; 360 degr&#233;s, l'Antigravity A1, qui se pilote gr&#226;ce &#224; un casque FPV. 
</description>
    </item>
    <item>
      <title>Voici les meilleures applications sur iPhone, iPad et Mac d&#8217;apr&#232;s Apple en 2025</title>
      <link>https://www.frandroid.com/marques/apple/2898843_voici-les-meilleures-applications-sur-iphone-ipad-et-mac-dapres-apple-en-2025</link>
      <pubDate>Thu, 04 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2898843_voici-les-meilleures-applications-sur-iphone-ipad-et-mac-dapres-apple-en-2025</guid>
      <description>
Chaque ann&#233;e, Apple d&#233;cerne des prix aux meilleures applications publi&#233;es sur son App Store. Voici les gagnants en 2025.
</description>
    </item>
    <item>
      <title>Test de l&#8217;Antigravity A1 : le drone qui filme tout, pour que vous n&#8217;ayez plus &#224; cadrer</title>
      <link>https://www.frandroid.com/marques/insta360/2897859_test-de-lantigravity-a1-le-drone-qui-filme-tout-pour-que-vous-nayez-plus-a-cadrer</link>
      <pubDate>Thu, 04 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/insta360/2897859_test-de-lantigravity-a1-le-drone-qui-filme-tout-pour-que-vous-nayez-plus-a-cadrer</guid>
      <description>
Insta360, pardon, Antigravity, se lance sur le march&#233; des drones de loisir avec l&#8217;A1, le tout premier drone &#224; filmer &#224; 360&#176;. Le fabricant grille ainsi la politesse &#224; DJI et chamboule un march&#233; innovant, mais l&#233;g&#232;rement ronronnant. Ce drone grand public offre une exp&#233;rience immersive r&#233;volutionnaire qui permet de capturer des images depuis le ciel comme jamais auparavant. 
...</description>
    </item>
    <item>
      <title>This color-changing E Ink guitar absolutely rocks, and I wish I could afford it</title>
      <link>https://www.techradar.com/audio/this-color-changing-e-ink-guitar-absolutely-rocks-and-i-wish-i-could-afford-it</link>
      <pubDate>Thu, 04 Dec 2025 13:52:25 +0000</pubDate>
      <guid isPermaLink="false">LqjaNoVh2MqYxvqTtEURFC</guid>
      <description>What do you get if you cross an electric guitar with a Kindle?</description>
    </item>
    <item>
      <title>Plus puissant et plus joli&#160;: portrait robot du futur iPhone 17e</title>
      <link>https://www.01net.com/actualites/plus-puissant-et-plus-joli-portrait-robot-du-futur-iphone-17e.html</link>
      <pubDate>Thu, 04 Dec 2025 13:52:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313766</guid>
      <description>L'iPhone 16e a plusieurs atouts en poche pour s&#233;duire les consommateurs : de la puissance &#224; revendre, un bel &#233;cran, et un rapport qualit&#233; prix relativement &#233;quilibr&#233;. Apple a manifestement trouv&#233; la bonne formule, car un iPhone 17e serait d&#233;j&#224; sur les rails pour un lancement au printemps prochain. Et le constructeur en profiterait pour rapprocher le design du futur mod&#232;le avec les versions plus haut de gamme....</description>
    </item>
    <item>
      <title>Arnaque &#224; l&#8217;investissement crypto&#160;: un r&#233;seau de fraude fait des &#171;&#160;milliers de victimes&#160;&#187; en Europe</title>
      <link>https://www.01net.com/actualites/arnaque-investissement-crypto-reseau-fraude-fait-milliers-victimes-europe.html</link>
      <pubDate>Thu, 04 Dec 2025 13:42:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313746</guid>
      <description>Un vaste r&#233;seau europ&#233;en d&#8217;arnaques &#224; l&#8217;investissement crypto vient d&#8217;&#234;tre neutralis&#233; par Europol. Apr&#232;s plusieurs coups de filet, la police a mis un terme aux activit&#233;s des escrocs.</description>
    </item>
    <item>
      <title>Hate VAR? Wait until you see how FIFA plans to use AI at the World Cup</title>
      <link>https://www.techradar.com/ai-platforms-assistants/hate-var-wait-until-you-see-how-fifa-plans-to-use-ai-at-the-world-cup</link>
      <pubDate>Thu, 04 Dec 2025 13:28:52 +0000</pubDate>
      <guid isPermaLink="false">TuqzxMJJmnCcLKvkFgEeaK</guid>
      <description>The FIFA World Cup 2026 is getting even more VAR as an AI-powered ball helps add corner kick scrutiny.</description>
    </item>
    <item>
      <title>Ce radar v&#233;lo 2-en-1 avec &#233;clairage veut rivaliser avec les r&#233;f&#233;rences Garmin</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2898359_ce-radar-velo-2-en-1-avec-eclairage-veut-rivaliser-avec-les-references-garmin</link>
      <pubDate>Thu, 04 Dec 2025 13:27:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2898359_ce-radar-velo-2-en-1-avec-eclairage-veut-rivaliser-avec-les-references-garmin</guid>
      <description>
Associant un radar d&#233;tectant 8 v&#233;hicules jusqu&#8217;&#224; 140 m&#232;tres, un &#233;clairage visible &#224; 500 m&#232;tres et une double connectivit&#233; GPS-appli, le Sigma RECO 81 Link veut &#234;tre l&#8217;alli&#233; des cyclistes au guidon de leurs v&#233;los de route.
</description>
    </item>
    <item>
      <title>01net Awards 2025&#160;: les grands gagnants</title>
      <link>https://www.01net.com/actualites/01net-awards-2025-gagnants.html</link>
      <pubDate>Thu, 04 Dec 2025 13:26:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313749</guid>
      <description>D&#233;couvrez tous les laur&#233;ats de l'&#233;dition 2025 des 01net Awards. Cet article est mis &#224; jour tous les jours jusqu'au 10 d&#233;cembre.</description>
    </item>
    <item>
      <title>Pok&#233;mon Legends: Z-A&#8217;s DLC is almost here, and the first &#8216;Z Mega Evolution&#8217; has been confirmed</title>
      <link>https://www.techradar.com/gaming/pokemon-legends-z-as-dlc-is-almost-here-and-the-first-z-mega-evolution-has-been-confirmed</link>
      <pubDate>Thu, 04 Dec 2025 13:21:48 +0000</pubDate>
      <guid isPermaLink="false">ACWB2U2ASLnD6eVKm2ies4</guid>
      <description>Game Freak has released a new trailer for Pok&#233;mon Legends: Z-A - Mega Dimension, confirming that the expansion will feature a new type of Mega Evolution.</description>
    </item>
    <item>
      <title>Philips Hue veut illuminer votre No&#235;l avec ce pack complet &#224; -50 %, parfait&#160;pour cr&#233;er une ambiance cosy</title>
      <link>https://www.frandroid.com/bons-plans/2898287_philips-hue-veut-illuminer-votre-noel-avec-ce-pack-complet-a-50-parfait-pour-creer-une-ambiance-cosy</link>
      <pubDate>Thu, 04 Dec 2025 13:21:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2898287_philips-hue-veut-illuminer-votre-noel-avec-ce-pack-complet-a-50-parfait-pour-creer-une-ambiance-cosy</guid>
      <description>
Ce bundle Philips Hue a tout du kit de d&#233;part parfait : les ampoules, les barres Hue Play et surtout le Hue Bridge, le cerveau de l&#8217;&#233;cosyst&#232;me. Un pack complet, pr&#234;t &#224; fonctionner d&#232;s la sortie de la bo&#238;te, et qui surtout fond de moiti&#233; sur la Fnac : 149,99 euros au lieu de 289,99 euros.
</description>
    </item>
    <item>
      <title>This $25 Pair of See-Through Headphones Is God-Tier &#8217;90s Nostalgia</title>
      <link>https://gizmodo.com/moondrop-old-fashioned-on-ear-wired-headphones-2000694749</link>
      <pubDate>Thu, 04 Dec 2025 13:20:32 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000694749</guid>
      <description>Screw AirPods Max.</description>
    </item>
    <item>
      <title>J&#8217;ai vu le Huawei Mate X7 et c&#8217;est tr&#232;s frustrant</title>
      <link>https://www.frandroid.com/test/prises-en-main/2898713_jai-vu-le-huawei-mate-x7-et-cest-tres-frustrant</link>
      <pubDate>Thu, 04 Dec 2025 13:18:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/test/prises-en-main/2898713_jai-vu-le-huawei-mate-x7-et-cest-tres-frustrant</guid>
      <description>
Voici quelques photos que j'ai pu prendre du Huawei Mate X7 en Chine. Un smartphone qui donne tr&#232;s envie et c'est d'autant plus frustrant.
</description>
    </item>
    <item>
      <title>Your ChatGPT chats could be less private than you thought &#8211; here&#8217;s what a new OpenAI court ruling means for you</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/your-chatgpt-chats-could-be-less-private-than-you-thought-heres-what-a-new-openai-court-ruling-means-for-you</link>
      <pubDate>Thu, 04 Dec 2025 13:16:09 +0000</pubDate>
      <guid isPermaLink="false">9jeUxTCCYBtnbNeqjfFW7c</guid>
      <description>OpenAI is being ordered to hand over ChatGPT data. This new legal ruling could set a major precedent for how your AI chats are handled.</description>
    </item>
    <item>
      <title>Shredded cheese recall update: Great Lakes Cheese responds to FDA report on metal fragments in products</title>
      <link>https://www.fastcompany.com/91454478/shredded-cheese-recall-update-great-lakes-responds-fda-metal-fragments</link>
      <pubDate>2025-12-04T13:12:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91454478/shredded-cheese-recall-update-great-lakes-responds-fda-metal-fragments</guid>
      <description>A recall issued in October is only now getting media attention. The company says impacted products have been removed from shelves.
Headlines about a shredded cheese recall affecting more than a quarter of a million cases of various products have been making the rounds for the last few days, understandably alarming consumers. </description>
    </item>
    <item>
      <title>Pourquoi vous allez bient&#244;t croiser des voitures dot&#233;es de plaques rose en France</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2898513_pourquoi-vous-allez-bientot-croiser-des-voitures-dotees-de-plaques-rose-en-france</link>
      <pubDate>Thu, 04 Dec 2025 13:11:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2898513_pourquoi-vous-allez-bientot-croiser-des-voitures-dotees-de-plaques-rose-en-france</guid>
      <description>
Pour &#233;viter la fraude aux immatriculations temporaires ou de garage, l'&#201;tat a d&#233;cid&#233; de durcir les r&#232;gles. Il n'y a pas de changement de r&#233;glementation &#224; proprement parler, mais simplement une plaque plus reconnaissable pour faciliter les contr&#244;les des forces de l'ordre. Voici les plaques &#224; fond rose.
</description>
    </item>
    <item>
      <title>Apple Final Cut Pro (2025) review</title>
      <link>https://www.techradar.com/pro/apple-final-cut-pro-review</link>
      <pubDate>Thu, 04 Dec 2025 13:04:53 +0000</pubDate>
      <guid isPermaLink="false">E7NsTVXWgvmMSiBoGsF6pk</guid>
      <description>Final Cut Pro 11.2 delivers powerful new features - but can feel like Apple's playing catch up.</description>
    </item>
    <item>
      <title>01net Awards&#160;: la meilleure montre de sport de l&#8217;ann&#233;e est&#8230;</title>
      <link>https://www.01net.com/actualites/01net-awards-la-meilleure-montre-de-sport-de-lannee-est.html</link>
      <pubDate>Thu, 04 Dec 2025 13:01:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313670</guid>
      <description>La r&#233;daction de 01net.com d&#233;signe les meilleurs produits de l&#8217;ann&#233;e. D&#233;couvrez tous les jours les vainqueurs de chaque cat&#233;gorie jusqu&#8217;&#224; la remise des prix le 10 d&#233;cembre, en live s&#8217;il vous plait !</description>
    </item>
    <item>
      <title>AI is ushering in a new era for the diagnosis and treatment of vision loss</title>
      <link>https://www.fastcompany.com/91448188/ai-is-ushering-in-a-new-era-for-the-diagnosis-and-treatment-of-vision-loss</link>
      <pubDate>2025-12-04T13:01:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448188/ai-is-ushering-in-a-new-era-for-the-diagnosis-and-treatment-of-vision-loss</guid>
      <description>Tools powered by artificial intelligence can now be used to provide a continuum of care, according to experts who spoke at the recent WCI Summit.
Artificial intelligence is radically changing how healthcare providers tackle vision loss, with tools that can be used from diagnosis to treatment and even follow-up care.</description>
    </item>
    <item>
      <title>A Startup Says It Has Found a Hidden Source of Geothermal Energy</title>
      <link>https://www.wired.com/story/startup-found-hidden-source-geothermal-energy/</link>
      <pubDate>Thu, 04 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">692089725b0de7d353c50193</guid>
      <description>Zanskar uses AI to identify hidden geothermal systems&#8212;and claims it has found one that could fuel a power plant, the first such discovery by industry in decades.</description>
    </item>
    <item>
      <title>Why new Christmas movies don&#8217;t hit the same (yet)</title>
      <link>https://mashable.com/video/why-new-christmas-movies-dont-hit-the-same-how-it-hits</link>
      <pubDate>Thu, 04 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">03T6gnnLPlLW62MxDTT3eW1</guid>
      <description>A look at why Christmas movies feel so comforting &#8212; from nostalgia and repetition to the way they shape our holiday memories.</description>
    </item>
    <item>
      <title>Updates From &#8216;Mortal Kombat 2&#8217;, &#8216;War Between the Land and the Sea&#8217;, and More</title>
      <link>https://gizmodo.com/mortal-kombat-2-fight-scenes-lewis-tan-2000695459</link>
      <pubDate>Thu, 04 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000695459</guid>
      <description>Plus, filming starts to wrap on 'Spaceballs 2'.</description>
    </item>
    <item>
      <title>Google wants to help businesses build AI agents with no prior experience</title>
      <link>https://www.techradar.com/pro/google-wants-to-help-businesses-build-ai-agents-with-no-prior-experience</link>
      <pubDate>Thu, 04 Dec 2025 12:58:00 +0000</pubDate>
      <guid isPermaLink="false">2HHyVpP5MyoFYUgYqXJbtW</guid>
      <description>Any business can now build its own AI agents with natural-language prompts, powered by Gemini 3.</description>
    </item>
    <item>
      <title>These are the 10 best Chrome extensions of 2025, according to Google &#8211; and there&#8217;s one I definitely recommend</title>
      <link>https://www.techradar.com/computing/chrome/these-are-the-10-best-chrome-extensions-of-2025-according-to-google-and-theres-one-i-definitely-recommend</link>
      <pubDate>Thu, 04 Dec 2025 12:56:22 +0000</pubDate>
      <guid isPermaLink="false">bJtjS8EvkeTsX2HnWEpPiW</guid>
      <description>These are Google's favorite Chrome extensions of the year, and there's a running theme.</description>
    </item>
    <item>
      <title>Score Sonys WH-CH520 headphones for under $40 right now at Amazon</title>
      <link>https://mashable.com/article/dec-4-sony-wh-ch520-headphones-deal</link>
      <pubDate>Thu, 04 Dec 2025 12:53:03 +0000</pubDate>
      <guid isPermaLink="false">06EtEye1lHPT28focRkgxCg</guid>
      <description>As of Dec. 4, the Sony WH-CH520 headphones are down to $38 at Amazon, a 46% discount from their list price of $69.99.</description>
    </item>
    <item>
      <title>The EU is probing Meta over WhatsApp&#8217;s AI chatbot restrictions</title>
      <link>https://www.theverge.com/news/838020/meta-whatsapp-eu-antitrust-investigation-ai-tools</link>
      <pubDate>2025-12-04T07:39:53-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=838020</guid>
      <description>The European Union has launched a formal investigation into Meta over antitrust concerns with AI restrictions in WhatsApp. The probe aims to &#8220;prevent any possible irreparable harm to competition in the AI space&#8221; according to the EU, and follows Meta announcing changes to WhatsApp&#8217;s terms for businesses in October that will prohibit companies from using [&#8230;]...</description>
    </item>
    <item>
      <title>Google Photos s&#8217;offre un bilan 2025 fa&#231;on Spotify Wrapped&#160;gr&#226;ce &#224; Gemini</title>
      <link>https://www.frandroid.com/marques/google/2898445_google-photos-soffre-un-bilan-2025-facon-spotify-wrapped-grace-a-gemini</link>
      <pubDate>Thu, 04 Dec 2025 12:35:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2898445_google-photos-soffre-un-bilan-2025-facon-spotify-wrapped-grace-a-gemini</guid>
      <description>
En int&#233;grant Google Gemini, Google Photos se dote d'un r&#233;cap de l'ann&#233;e 2025 plus personnalisable. Les utilisateurs vont pouvoir choisir avec pr&#233;cision les moments et les visages qu'ils souhaitent voir appara&#238;tre.  
</description>
    </item>
    <item>
      <title>Kalshi CEO Says He Wants to Monetize &#8216;Any Difference in Opinion&#8217;</title>
      <link>https://gizmodo.com/kalshi-ceo-says-he-wants-to-monetize-any-difference-in-opinion-2000695320</link>
      <pubDate>Thu, 04 Dec 2025 12:30:25 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000695320</guid>
      <description>Now if that isn't late-stage capitalism, I don't know what is.</description>
    </item>
    <item>
      <title>Prince Harry crashes Stephen Colberts late show to audition for a Hallmark movie</title>
      <link>https://mashable.com/video/prince-harry-stephen-colbert-hallmark-movie-audition</link>
      <pubDate>Thu, 04 Dec 2025 12:27:16 +0000</pubDate>
      <guid isPermaLink="false">07bcbevuauChb0JFWUILLbI</guid>
      <description>Stephen Colbert's holiday Hallmark movie segment on "The Late Show" featured a surprise cameo from Prince Harry.</description>
    </item>
    <item>
      <title>On a rarement vu un laptop gaming de 16&#8243; avec une RTX 5070 &#224; ce prix, merci Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2898227_on-a-rarement-vu-un-laptop-gaming-de-16-avec-une-rtx-5070-a-ce-prix-merci-amazon</link>
      <pubDate>Thu, 04 Dec 2025 12:27:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2898227_on-a-rarement-vu-un-laptop-gaming-de-16-avec-une-rtx-5070-a-ce-prix-merci-amazon</guid>
      <description>
Le Black Friday a beau &#234;tre termin&#233;, les promotions continuent avec le Gigabyte Gaming A16 CWH avec une RTX 5070 affich&#233; &#224; 1 169,98 euros au lieu de 1 499 euros sur Amazon.
</description>
    </item>
  </channel>
</rss>
