<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 09 Nov 2025 15:31:25 GMT</lastBuildDate>
    <item>
      <title>Netflix&#8217;s &#8216;Stranger Things&#8217; and &#8216;Squid Game&#8217; Experiences Hit Dallas Next Month</title>
      <link>https://gizmodo.com/netflixs-stranger-things-and-squid-game-experiences-hit-dallas-next-month-2000683426</link>
      <pubDate>Sun, 09 Nov 2025 15:30:14 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683426</guid>
      <description>If you can't get enough 'Squid Game' or 'Stranger Things' this year, Netflix House has some immersive experiences in Dallas for you.</description>
    </item>
    <item>
      <title>The tale of the Fire Phone, Amazon&#8217;s very strange smartphone</title>
      <link>https://www.theverge.com/podcast/816739/amazon-fire-phone-version-history</link>
      <pubDate>2025-11-09T10:20:24-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=816739</guid>
      <description>When Jeff Bezos decided Amazon needed to get in the smartphone game, he went all in. And the resulting device, the Fire Phone, wound up more densely packed with big ideas than just about any gadget you'll find anywhere. There was just one tiny problem: they were mostly bad ideas. The Fire Phone shipped in [&#8230;]</description>
    </item>
    <item>
      <title>I'm a Black Friday expert &#8211; here are 13 early deals worth adding to your cart right now</title>
      <link>https://www.techradar.com/seasonal-sales/im-a-black-friday-expert-here-are-13-early-deals-worth-adding-to-your-cart-right-now</link>
      <pubDate>Sun, 09 Nov 2025 15:18:32 +0000</pubDate>
      <guid isPermaLink="false">VeWP7J9iaKNcx8JbqaGpsT</guid>
      <description>While there are hundreds of early Black Friday deals, only a select few are actually worth buying, and as a deals expert, I'm rounding up my 13 favorite offers.</description>
    </item>
    <item>
      <title>Fnac et Darty se montrent bien g&#233;n&#233;reux lors du pr&#233;-Black Friday : les 18 deals qui valent le coup</title>
      <link>https://www.frandroid.com/bons-plans/2849237_fnac-et-darty-se-montrent-bien-genereux-lors-du-pre-black-friday-les-15-deals-qui-valent-le-coup</link>
      <pubDate>Sun, 09 Nov 2025 15:12:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849237_fnac-et-darty-se-montrent-bien-genereux-lors-du-pre-black-friday-les-15-deals-qui-valent-le-coup</guid>
      <description>
Pour ne pas laisser le champ libre &#224; Boulanger, la Fnac et Darty prennent aussi de l'avance sur le Black Friday et d&#233;ploient &#224; leur tour de solides offres sur de nombreux produits Tech. Nous avons fait le tri parmi toutes les offres, et voici uniquement celles qui valent le coup. 
</description>
    </item>
    <item>
      <title>La photo de la semaine : un ph&#233;nom&#232;ne c&#233;leste ultra-rare capt&#233; pile au bon moment</title>
      <link>https://www.futura-sciences.com/sciences/breves/voie-lactee-photo-semaine-phenomene-celeste-ultra-rare-capte-pile-bon-moment-10841/#xtor%3DRSS-8</link>
      <pubDate>Sun, 09 Nov 2025 16:08:52 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/breves/voie-lactee-photo-semaine-phenomene-celeste-ultra-rare-capte-pile-bon-moment-10841/#xtor%3DRSS-8</guid>
      <description>La photo de cette semaine est ind&#233;niablement de celles qui font r&#234;ver. Parce qu&#8217;&#224; la veille de l&#8217;ouverture de la COP30 &#224; Bel&#233;m (Br&#233;sil) et alors que les scientifiques des Nations unies viennent d&#8217;annoncer que nous avons perdu une premi&#232;re bataille dans notre guerre contre le r&#233;chauffement...</description>
    </item>
    <item>
      <title>6 Best Dyson Vacuums (2025): V15 Detect, Gen5 Detect, Digital Slim</title>
      <link>https://www.wired.com/gallery/best-dyson-vacuums/</link>
      <pubDate>Sun, 09 Nov 2025 15:02:00 +0000</pubDate>
      <guid isPermaLink="false">5df3c23c48e9d2000853d4fb</guid>
      <description>Feeling the pull of a new clean machine? We&#8217;ll help you make sense of Dyson&#8217;s whirlwind vacuum lineup.</description>
    </item>
    <item>
      <title>Une Porsche au prix d&#8217;une Tesla Model 3 : j&#8217;ai essay&#233; ces deux voitures &#233;lectriques et voici celle qu&#8217;il faut choisir</title>
      <link>https://www.frandroid.com/marques/porsche/2857665_une-porsche-au-prix-dune-tesla-model-3-jai-essaye-ces-deux-voitures-electriques-et-voici-celle-quil-faut-choisir</link>
      <pubDate>Sun, 09 Nov 2025 15:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/porsche/2857665_une-porsche-au-prix-dune-tesla-model-3-jai-essaye-ces-deux-voitures-electriques-et-voici-celle-quil-faut-choisir</guid>
      <description>
J'ai pu tester la Porsche Taycan &#233;lectrique sur 1 500 km. De quoi la comparer avec la Tesla Model 3. Pourquoi ? Car il est possible d'acheter une Porsche &#233;lectrique d'occasion au m&#234;me prix qu'une Tesla neuve. On compare ces deux choix, entre passion et raison.
</description>
    </item>
    <item>
      <title>Deck out your tree with ornaments of retro consoles, movie moments, and more</title>
      <link>https://www.theverge.com/tech/811614/best-christmas-ornaments-2025</link>
      <pubDate>2025-11-09T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=811614</guid>
      <description>Do the ornaments you adorn your Christmas tree with reflect you or your family&#8217;s interests? If not, maybe you should rectify that. We recently went hands on with Hallmark&#8217;s realistic Xbox 360 replica ornament, which plays a snippet of audio from Halo 3. As it turns out, there are many other ornaments available that are [&#8230;]</description>
    </item>
    <item>
      <title>What is iCloud+? And is it worth the money?</title>
      <link>https://www.techradar.com/computing/software/what-is-icloud-and-is-it-worth-the-money</link>
      <pubDate>Sun, 09 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">aTEWtd93CsYfdWhCn3C6We</guid>
      <description>Wondering if you should upgrade to a paid iCloud+ plan? Here&#8217;s everything the service has to offer.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Monday, November 10 (game #1386)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-10-november-2025</link>
      <pubDate>Sun, 09 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">sZhtS3FYuLVAT33daRZ56V</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Monday, November 10 (game #883)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-10-november-2025</link>
      <pubDate>Sun, 09 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">CKiEQEBPqWyZGQKRDkCvZE</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Monday, November 10 (game #617)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-10-november-2025</link>
      <pubDate>Sun, 09 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">L7wRY3JYXTEgyfgfKycMxL</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Avant-Black Friday smartphones &#224; moins de 500 euros : les meilleures offres sur les Samsung Galaxy, Xiaomi Redmi et Nothing Phone</title>
      <link>https://www.frandroid.com/bons-plans/2856691_le-black-month-est-la-avec-des-reductions-phares-le-top-des-meilleures-offres-de-smartphones-a-moins-de-500-e</link>
      <pubDate>Sun, 09 Nov 2025 14:34:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2856691_le-black-month-est-la-avec-des-reductions-phares-le-top-des-meilleures-offres-de-smartphones-a-moins-de-500-e</guid>
      <description>
Si le Black Friday se fera attendre jusqu'&#224; la fin du mois, les e-commer&#231;ants fran&#231;ais n'ont eux pas attendu pour lancer des offres. Les smartphones font partie des produits qui profitent de r&#233;ductions vraiment int&#233;ressantes, notamment sur l'entr&#233;e et le milieu de gamme. 
</description>
    </item>
    <item>
      <title>Why networking is still the most powerful tool in business</title>
      <link>https://www.fastcompany.com/91429832/why-networking-is-still-the-most-powerful-tool-in-business-networking</link>
      <pubDate>2025-11-09T14:33:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91429832/why-networking-is-still-the-most-powerful-tool-in-business-networking</guid>
      <description>And how to do it better.
What if I told you the single most important tool for growing your business is free? It doesn&#8217;t require fancy business cards, a corner office, or the latest app that tracks every data point in real time. It&#8217;s networking.</description>
    </item>
    <item>
      <title>I&#8217;m Sure There&#8217;s Nothing to Worry About Now That Mortgage-Backed Securities Are Driving AI</title>
      <link>https://gizmodo.com/im-sure-theres-nothing-to-worry-about-now-that-mortgage-backed-securities-are-driving-ai-2000683409</link>
      <pubDate>Sun, 09 Nov 2025 14:30:56 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683409</guid>
      <description>Right?</description>
    </item>
    <item>
      <title>It&#8217;s time to ask the big question: are you iPhone or Android?</title>
      <link>https://www.techradar.com/phones/its-time-to-ask-the-big-question-are-you-iphone-on-android</link>
      <pubDate>Sun, 09 Nov 2025 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">ovnC8tprbB2wWhTvi6u2eF</guid>
      <description>It's iPhone vs Android time: which one is the phone for you? And tell me why in the comments.</description>
    </item>
    <item>
      <title>Le Black Friday liquide les stocks de smartphones  : voici le meilleur des promos sur les iPhone d&#8217;Apple, Samsung Galaxy et Google Pixel</title>
      <link>https://www.frandroid.com/bons-plans/2848295_le-black-friday-liquide-les-stocks-de-smartphones-notre-top-10-des-promos-sur-les-iphone-dapple-samsung-galaxy-et-google-pixel</link>
      <pubDate>Sun, 09 Nov 2025 14:13:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848295_le-black-friday-liquide-les-stocks-de-smartphones-notre-top-10-des-promos-sur-les-iphone-dapple-samsung-galaxy-et-google-pixel</guid>
      <description>
Le Black Friday est bien en avance cette ann&#233;e, et de tous les produits tech, ce sont les smartphones qui en profitent le plus. Samsung Galaxy, iPhone d'Apple, Google Pixel, Xiaomi Redmi, de l'entr&#233;e au haut de gamme, voyons ce que r&#233;servent les e-commer&#231;ants en ce d&#233;but de Black November.
</description>
    </item>
    <item>
      <title>Ce purificateur d&#8217;air Dyson ventile, chauffe et baisse son prix de 20 % pendant le pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2859391_ce-purificateur-dair-dyson-ventile-chauffe-et-baisse-son-prix-de-20-pendant-le-pre-black-friday</link>
      <pubDate>Sun, 09 Nov 2025 14:11:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2859391_ce-purificateur-dair-dyson-ventile-chauffe-et-baisse-son-prix-de-20-pendant-le-pre-black-friday</guid>
      <description>
Le Dyson Hot+Cool HP2 De-NOx a une action 3-en-1 bien utile toute l'ann&#233;e : il purifie, chauffe en hiver et ventile en &#233;t&#233;. Un appareil polyvalent que vous trouvez, en ce pr&#233;-Black Friday, &#224; 649 euros au lieu de 799 euros chez Darty et &#224; la Fnac.
</description>
    </item>
    <item>
      <title>Freepik CEO - No, AI hasn't killed the stock image market</title>
      <link>https://www.techradar.com/pro/software-services/freepik-ceo-no-ai-hasnt-killed-the-stock-image-market</link>
      <pubDate>Sun, 09 Nov 2025 14:05:00 +0000</pubDate>
      <guid isPermaLink="false">hhufsp4f2t9EP8uzCdHL8E</guid>
      <description>I hoped the answer was "yes", but it's more complicated than that.</description>
    </item>
    <item>
      <title>HOBI-WAN : l'ESA transforme l'air des astronautes en prot&#233;ines pour conqu&#233;rir la Lune et Mars</title>
      <link>https://www.futura-sciences.com/sciences/actualites/exploration-hobi-wan-esa-transforme-air-astronautes-proteines-conquerir-lune-mars-127212/#xtor%3DRSS-8</link>
      <pubDate>Sun, 09 Nov 2025 15:03:06 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/exploration-hobi-wan-esa-transforme-air-astronautes-proteines-conquerir-lune-mars-127212/#xtor%3DRSS-8</guid>
      <description>Pour lib&#233;rer l'exploration lunaire et martienne du ravitaillement terrestre, l'ESA lance HOBI-WAN : un projet pionnier testant dans l'ISS la production de prot&#233;ines &#224; partir... de l'air ! Gr&#226;ce &#224; des bact&#233;ries transformant hydrog&#232;ne, oxyg&#232;ne et CO&#8322; en une poudre nutritive &#171; Solein &#187;, cette...</description>
    </item>
    <item>
      <title>I lived with this 700g rugged phone, and it outperformed my iPhone in key ways</title>
      <link>https://www.techradar.com/computing/ulefone-armor-29-pro-rugged-phone-review</link>
      <pubDate>Sun, 09 Nov 2025 14:02:00 +0000</pubDate>
      <guid isPermaLink="false">7nk57h9cJk4yjQ6aFefpwZ</guid>
      <description>Ulefone Armor 29 Pro is an evolution of the company's rugged phone series and offers all the usual rugged credentials that mean it's waterproof, drop-proof and pretty much able to withstand any environment that you put it in. It also offers 5G, plenty of storage and the latest AI features to run some impressive apps alongside the triple array of cameras....</description>
    </item>
    <item>
      <title>What Is Adobe Firefly? Here&#8217;s How to Use This Powerful Generative AI Tool</title>
      <link>https://www.wired.com/story/what-is-adobe-firefly/</link>
      <pubDate>Sun, 09 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">6904d18749ba1c8e1243f460</guid>
      <description>Adobe Firefly is a deceptively powerful AI playground to generate images, videos, and more. Here&#8217;s how to make the most of it.</description>
    </item>
    <item>
      <title>65daysofstatic&#8217;s new No Man&#8217;s Sky album searches for humanity in an AI-filled world</title>
      <link>https://www.theverge.com/report/816427/no-mans-sky-album-journeys-65daysofstatic</link>
      <pubDate>2025-11-09T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=816427</guid>
      <description>It's not often that a band returns to soundtrack the same game nine years after its release - then again, most games aren't No Man's Sky. Once demoed on The Tonight Show with Jimmy Fallon and at splashy E3 press conferences, in 2016, No Man's Sky was heralded as gaming's future. And it was all [&#8230;]</description>
    </item>
    <item>
      <title>How to watch Manchester City vs Liverpool: live streams, TV channels and preview for this Premier League blockbuster</title>
      <link>https://www.techradar.com/how-to-watch/football/manchester-city-vs-liverpool-premier-league-2025-26</link>
      <pubDate>Sun, 09 Nov 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">NpVTFvMBofLhWR9s4vTcBE</guid>
      <description>We'll show you all the ways to watch Man City take on Liverpool in the Premier League from anywhere in the world.</description>
    </item>
    <item>
      <title>Black Friday 2025 : les offres pleuvent chez Amazon &amp; Co, nous avons retenu les meilleures offres en avant premi&#232;re</title>
      <link>https://www.frandroid.com/bons-plans/2849105_black-friday-2025-les-offres-pleuvent-chez-amazon-co-nous-avons-retenir-les-meilleures-offres-en-avant-premiere</link>
      <pubDate>Sun, 09 Nov 2025 13:40:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849105_black-friday-2025-les-offres-pleuvent-chez-amazon-co-nous-avons-retenir-les-meilleures-offres-en-avant-premiere</guid>
      <description>
De nombreux e-commer&#231;ants ont pris de l'avance sur le Black Friday. On trouve d&#233;j&#224; de belles remises sur de nombreux produits Tech. Nous suivons les offres les plus int&#233;ressantes en temps r&#233;el pour vous pr&#233;senter une s&#233;lection des meilleures promotions tech du moment, incluant smartphones, ordinateurs, t&#233;l&#233;viseurs, objets connect&#233;s et accessoires.
...</description>
    </item>
  </channel>
</rss>
