<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 16 Feb 2026 08:55:54 GMT</lastBuildDate>
    <item>
      <title>Pourquoi le c&#233;l&#232;bre volant &#171;&#160;Yoke&#160;&#187; des Tesla va bient&#244;t devenir ill&#233;gal en Chine</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2978089_pourquoi-le-celebre-volant-yoke-des-tesla-va-bientot-devenir-illegal-en-chine</link>
      <pubDate>Mon, 16 Feb 2026 08:52:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2978089_pourquoi-le-celebre-volant-yoke-des-tesla-va-bientot-devenir-illegal-en-chine</guid>
      <description>
Le gouvernement chinois veut d&#233;sormais serrer la vis sur les volants de type &#171;&#160;yoke&#160;&#187; sur les voitures &#233;lectriques. Et cela logiquement pour des raisons de s&#233;curit&#233;.
</description>
    </item>
    <item>
      <title>Sophie Adenot &#224; rejoint la Station spatiale internationale pour une mission de 9 mois</title>
      <link>https://www.futura-sciences.com/sciences/actualites/sophie-adenot-sophie-adenot-rejoint-station-spatiale-internationale-mission-9-mois-131310/#xtor%3DRSS-8</link>
      <pubDate>Mon, 16 Feb 2026 09:49:23 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/sophie-adenot-sophie-adenot-rejoint-station-spatiale-internationale-mission-9-mois-131310/#xtor%3DRSS-8</guid>
      <description>Apr&#232;s un voyage de 34 heures en orbite autour de la Terre, l'&#233;quipage Crew-12 a rejoint la Station spatiale internationale dans la nuit de samedi &#224; dimanche. Pour Sophie Adenot, d&#233;bute une mission de 9 mois &#224; bord du complexe orbital o&#249; l'attend un programme de recherche ambitieux comprenant 36...</description>
    </item>
    <item>
      <title>CarPlay chez Tesla ? Un souci technique d&#8217;Apple Plans et iOS 26 fait obstacle</title>
      <link>https://www.frandroid.com/marques/tesla/2978115_carplay-chez-tesla-un-souci-technique-dapple-plans-et-ios-26-fait-obstacle</link>
      <pubDate>Mon, 16 Feb 2026 08:27:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2978115_carplay-chez-tesla-un-souci-technique-dapple-plans-et-ios-26-fait-obstacle</guid>
      <description>
Tesla veut int&#233;grer CarPlay dans ses voitures, mais un souci concernant Apple Plans sur iOS 26 a retard&#233; ses plans.
</description>
    </item>
    <item>
      <title>African defensetech Terra Industries, founded by two Gen Zers, raises additional $22M in a month</title>
      <link>https://techcrunch.com/2026/02/16/terra-industries-raises-22-million/</link>
      <pubDate>Mon, 16 Feb 2026 08:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3092801</guid>
      <description>Terra Industries, the African defense company, announced Monday that it had secured an additional $22 million in funding to further expand the business.</description>
    </item>
    <item>
      <title>The best cheap phones for 2026</title>
      <link>https://www.engadget.com/mobile/smartphones/best-cheap-phones-130017793.html?src=rss</link>
      <pubDate>Mon, 16 Feb 2026 08:00:35 +0000</pubDate>
      <guid isPermaLink="false">793a2c73-5ac3-420f-b60b-7dec8132bc94</guid>
      <description>A few years ago, it may have been fashionable to spend $1,000 on the latest flagship smartphone, but for most people, that&#8217;s neither practical nor necessary. You don't even have to spend $500 today to get a decent handset, whether it&#8217;s a refurbished iPhone or an affordable Android phone, as there are plenty of decent options as low as $160.However, navigating the budget phone market can be tricky; options that look good on paper may not be in practice, and some devices will end up costing you more when you consider many come with restrictive storage. While we spend most of our time reviewing m...</description>
    </item>
    <item>
      <title>Le cr&#233;ateur d&#8217;OpenClaw, l&#8217;IA open source qui fait le buzz, rejoint OpenAI</title>
      <link>https://www.01net.com/actualites/createur-dopenclaw-ia-open-source-fait-buzz-rejoint-openai.html</link>
      <pubDate>Mon, 16 Feb 2026 07:51:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326039</guid>
      <description>Le cr&#233;ateur d'OpenClaw vient de rejoindre OpenAI. Au sein de la start-up, le d&#233;veloppeur va contribuer au d&#233;veloppement d'agents IA autonomes. Sous la houlette de la soci&#233;t&#233; qui con&#231;oit ChatGPT, OpenClaw restera un projet open source.</description>
    </item>
    <item>
      <title>Android Quick Share limite le partage &#171; Tout le monde &#187; &#224; 10 minutes pour renforcer la s&#233;curit&#233;</title>
      <link>https://www.frandroid.com/android/applications/2978117_android-quick-share-limite-le-partage-tout-le-monde-a-10-minutes-pour-renforcer-la-securite</link>
      <pubDate>Mon, 16 Feb 2026 07:43:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/applications/2978117_android-quick-share-limite-le-partage-tout-le-monde-a-10-minutes-pour-renforcer-la-securite</guid>
      <description>
Google modifie en profondeur le fonctionnement de Quick Share sur Android en rempla&#231;ant le mode &#171; Tout le monde &#187; permanent par une option limit&#233;e &#224; 10 minutes, afin de r&#233;duire les risques de partage non sollicit&#233; tout en harmonisant son service avec AirDrop d&#8217;Apple.
</description>
    </item>
    <item>
      <title>Motorola Edge 70 vs Samsung Galaxy S25 Edge : quel est le meilleur smartphone ultrafin ?</title>
      <link>https://www.frandroid.com/versus/2936885_motorola-edge-70-vs-samsung-galaxy-s25-edge-quel-est-le-meilleur-smartphone-ultrafin</link>
      <pubDate>Mon, 16 Feb 2026 07:34:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/versus/2936885_motorola-edge-70-vs-samsung-galaxy-s25-edge-quel-est-le-meilleur-smartphone-ultrafin</guid>
      <description>
Le Samsung Galaxy S25 Edge a &#233;t&#233; le premier &#224; s'aventurer sur le march&#233;&#160;des smartphones ultrafins. Rapidement rejoint par Apple et par Motorola, ce dernier a su montrer qu'on pouvait faire aussi bien, pour beaucoup moins cher. Alors, pour lequel faut-il craquer&#160;?
</description>
    </item>
    <item>
      <title>Le chantier d&#8217;Apple sur iOS 27 pour am&#233;liorer l&#8217;autonomie des iPhone</title>
      <link>https://www.frandroid.com/marques/apple/2978085_le-chantier-dapple-sur-ios-27-pour-ameliorer-lautonomie-des-iphone</link>
      <pubDate>Mon, 16 Feb 2026 07:26:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2978085_le-chantier-dapple-sur-ios-27-pour-ameliorer-lautonomie-des-iphone</guid>
      <description>
Apple plancherait sur plusieurs chantiers en coulisses visant &#224; rendre iOS 27 &#224; la fois plus rapide et plus optimis&#233; pour l'autonomie des iPhone.
</description>
    </item>
    <item>
      <title>Ecouteurs filaire Diesel 60458 Wired Earbuds, de vrais accessoires de mode</title>
      <link>https://www.frandroid.com/produits-android/audio/2978091_ecouteurs-filaire-diesel-60458-wired-earbuds-de-vrais-accessoires-de-mode</link>
      <pubDate>Mon, 16 Feb 2026 07:25:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/audio/2978091_ecouteurs-filaire-diesel-60458-wired-earbuds-de-vrais-accessoires-de-mode</guid>
      <description>
La marque de mode italienne Diesel &#233;largit son catalogue d'accessoires audio avec le lancement des 60458 Wired Earbuds, des &#233;couteurs filaires qui affichent un design industriel particuli&#232;rement marqu&#233;, quasiment identitaire.
</description>
    </item>
    <item>
      <title>L&#8217;enceinte Bluetooth Bose SoundLink Flex 2 est aussi compacte que son prix qui passe &#224; moins de 100 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2977601_lenceinte-bluetooth-bose-soundlink-flex-2-est-aussi-compacte-que-son-prix-qui-passe-a-moins-de-100-e</link>
      <pubDate>Mon, 16 Feb 2026 07:25:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2977601_lenceinte-bluetooth-bose-soundlink-flex-2-est-aussi-compacte-que-son-prix-qui-passe-a-moins-de-100-e</guid>
      <description>
Avec la Bose SoundLink Flex deuxi&#232;me g&#233;n&#233;ration, vous avez une enceinte Bluetooth compacte et puissante, pour une utilisation quotidienne aussi bien en int&#233;rieur qu'en ext&#233;rieur. Elle se retrouve &#224; 99,99 euros sur Amazon au lieu de 179,95 euros.
</description>
    </item>
    <item>
      <title>Ces 7 produits Apple devraient arriver dans les prochaines semaines</title>
      <link>https://www.01net.com/actualites/sept-produits-apple-devraient-arriver-prochaines-semaines.html</link>
      <pubDate>Mon, 16 Feb 2026 07:13:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326028</guid>
      <description>Les semaines &#224; venir s'annoncent riches en produits Apple. Des iPad en passant par les MacBook et les iPhone, on fait le point.</description>
    </item>
    <item>
      <title>L&#8217;Europe veut faire sans Visa et Mastercard&#8230; mais c&#8217;est pas si simple</title>
      <link>https://www.01net.com/actualites/leurope-veut-faire-sans-visa-et-mastercard-mais-cest-pas-si-simple.html</link>
      <pubDate>Mon, 16 Feb 2026 07:02:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1325666</guid>
      <description>Cesser d'utiliser les solutions de paiement am&#233;ricaines Visa et Mastercard : c'est possible sur le papier, mais toutes les alternatives europ&#233;ennes, en cours de construction ou d'&#233;laboration, n'arriveront pas avant plusieurs ann&#233;es.</description>
    </item>
  </channel>
</rss>
