<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 16 Nov 2025 09:38:47 GMT</lastBuildDate>
    <item>
      <title>Google alerte sur ces 6 arnaques en ligne qui font des ravages</title>
      <link>https://www.01net.com/actualites/google-alerte-sur-ces-6-arnaques-en-ligne-qui-font-des-ravages.html</link>
      <pubDate>Sun, 16 Nov 2025 09:35:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1307151</guid>
      <description>&#192; l'approche des f&#234;tes de fin d'ann&#233;e, les arnaques en ligne explosent &#224; la hausse. Google a identifi&#233; les six menaces majeures qui planent sur les internautes fin 2025. Des fausses offres d'emploi aux VPN malveillants, en passant par les escroqueries &#224; l'IA, les pirates ne manquent pas d'ing&#233;niosit&#233;.</description>
    </item>
    <item>
      <title>&#171;&#160;Ils ne nous disent pas ce qui se passe&#160;&#187; : Tesla r&#233;agit &#224; l&#8217;attaque de Google et publie une vid&#233;o impressionnante qui prouve que ses voitures sont s&#251;res</title>
      <link>https://www.frandroid.com/marques/tesla/2870449_ils-ne-nous-disent-pas-ce-qui-se-passe-tesla-reagit-a-lattaque-de-google-et-publie-une-video-impressionnante-qui-prouve-que-ses-voitures-sont-sures</link>
      <pubDate>Sun, 16 Nov 2025 09:18:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2870449_ils-ne-nous-disent-pas-ce-qui-se-passe-tesla-reagit-a-lattaque-de-google-et-publie-une-video-impressionnante-qui-prouve-que-ses-voitures-sont-sures</guid>
      <description>
Tesla vient de sortir le grand jeu avec la publication d'une vid&#233;o impressionnantes et de donn&#233;es ultra rassurantes apr&#232;s l'attaque verbale de Waymo (Google). Mais attention aux pi&#232;ges m&#233;thodologiques qui se cachent derri&#232;re.
</description>
    </item>
    <item>
      <title>Contr&#244;le des conversations sur Internet&#160;: la nouvelle version de Chatcontrol aurait encore un souci</title>
      <link>https://www.01net.com/actualites/controle-des-conversations-sur-internet-la-nouvelle-version-de-chatcontrol-aurait-encore-un-souci.html</link>
      <pubDate>Sun, 16 Nov 2025 09:01:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308262</guid>
      <description>La disposition de &#171;&#160;ChatControl &#187; a &#233;t&#233; supprim&#233;e de la nouvelle version du projet de r&#232;glement europ&#233;en visant &#224; prot&#233;ger les mineurs en ligne. Mais pour l'ex-eurod&#233;put&#233; allemand Patrick Breyer, un nouvel article, introduit par le Danemark, aurait le m&#234;me objectif : imposer encore et toujours une obligation de d&#233;tection de nos conversations aux messageries chiffr&#233;es....</description>
    </item>
    <item>
      <title>How AI is changing developers&#8217; mindsets, not just their code</title>
      <link>https://www.techradar.com/pro/how-ai-is-changing-developers-mindsets-not-just-their-code</link>
      <pubDate>Sun, 16 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">PZKMP24arsWG3DAFRsq8N4</guid>
      <description>Generative AI transforms software development, workflows, and developer careers.</description>
    </item>
    <item>
      <title>Outlander season 8: everything we know so far about the hit Starz show's return</title>
      <link>https://www.techradar.com/streaming/amazon-prime-video/outlander-season-8</link>
      <pubDate>Sun, 16 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">b8qwub29VUngEXtuZrjtYV</guid>
      <description>Outlander season 8 is coming on March 6, 2026. Here's everything we know so far from release date, trailer, predicted cast, plot rumors and more.</description>
    </item>
    <item>
      <title>Black Friday 2025 : voici les meilleures offres encore en ligne ce week-end</title>
      <link>https://www.frandroid.com/bons-plans/2864479_black-friday-2025-meilleures-offres-week-end-en-direct-amazon</link>
      <pubDate>Sun, 16 Nov 2025 08:40:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2864479_black-friday-2025-meilleures-offres-week-end-en-direct-amazon</guid>
      <description>
La date officielle du Black Friday approche &#224; grands pas et les marchands multiplient les promotions en attendant le jour J, le 28 novembre 2025. Le pr&#233;-Black Friday est donc toujours en cours d'un c&#244;t&#233;, chez Amazon, Boulanger, Fnac, Darty ou encore Cdiscount. Et de l'autre, vous avez le Singles Day qui continue, notamment chez AliExpress et autres sites, aussi appel&#233; 11.11. C'est ici que vous retrouverez le meilleur de ces deux &#233;v&#232;nements avec les promos les plus int&#233;ressantes.
...</description>
    </item>
    <item>
      <title>LG Gram 17 : ce puissant ultraportable poids plume sous Ultra 7 perd 1 200 &#8364; en plein pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2869401_lg-gram-17-ce-puissant-ultraportable-poids-plume-sous-ultra-7-perd-1-200-e-en-plein-pre-black-friday</link>
      <pubDate>Sun, 16 Nov 2025 08:27:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2869401_lg-gram-17-ce-puissant-ultraportable-poids-plume-sous-ultra-7-perd-1-200-e-en-plein-pre-black-friday</guid>
      <description>
Meilleur alli&#233; des &#233;tudiants et des travailleurs qui ont la bougeotte, le LG Gram 17 est certes tr&#232;s l&#233;ger, mais il est aussi et surtout bien puissant. En ce pr&#233;-Black Friday, vous le trouverez affich&#233; &#224; 1 299,99 euros au lieu de 2 499,99 euros &#224; la Fnac et chez Darty.
</description>
    </item>
    <item>
      <title>What legacy business intelligence technology can learn from video games</title>
      <link>https://www.techradar.com/pro/what-legacy-business-intelligence-technology-can-learn-from-video-games</link>
      <pubDate>Sun, 16 Nov 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">wcohSPgwe3Ssx9T7a68RfQ</guid>
      <description>Why the future of business intelligence looks more like modern gaming than legacy reporting.</description>
    </item>
  </channel>
</rss>
