<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 12 Jan 2026 09:37:29 GMT</lastBuildDate>
    <item>
      <title>Soldes d&#8217;hiver 2026 : voici les meilleures offres en DIRECT avant la fin de la premi&#232;re d&#233;marque</title>
      <link>https://www.frandroid.com/bons-plans/2931731_soldes-dhiver-2026-voici-les-meilleures-offres-en-direct-avant-la-fin-de-la-premiere-demarque</link>
      <pubDate>Mon, 12 Jan 2026 09:35:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931731_soldes-dhiver-2026-voici-les-meilleures-offres-en-direct-avant-la-fin-de-la-premiere-demarque</guid>
      <description>
Les soldes d'hiver 2026 ont d&#233;but&#233; la semaine derni&#232;re et les offres continuent de tomber sur Amazon, Fnac, Darty ou encore Cdiscount et Boulanger. Smartphones, PC portables, t&#233;l&#233;viseurs, tablettes ou encore casques et &#233;couteurs sans fil&#8230; Voici les meilleures offres Tech s&#233;lectionn&#233;es par la r&#233;daction pour l'occasion.
</description>
    </item>
    <item>
      <title>Fnac et Darty vendent au rabais de nombreux produits Tech lors des soldes d&#8217;hiver 2026</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-vendent-au-rabais-de-nombreux-produits-tech-lors-des-soldes-dhiver-2026</link>
      <pubDate>Mon, 12 Jan 2026 09:34:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-et-darty-vendent-au-rabais-de-nombreux-produits-tech-lors-des-soldes-dhiver-2026</guid>
      <description>
Fnac et Darty n'h&#233;sitent pas &#224; brader de nombreux produits Tech pendant les soldes d'hiver 2026. Les deux enseignes pratiquent des prix bien bas sur des produits populaires. Pour vous y retrouver, voici les offres qui valent r&#233;ellement le coup. 
</description>
    </item>
    <item>
      <title>BYD va lancer une nouvelle marque de voitures &#233;lectriques et hybrides pour une raison bien pr&#233;cise</title>
      <link>https://www.frandroid.com/marques/byd/2938683_byd-va-lancer-une-nouvelle-marque-de-voitures-electriques-et-hybrides-pour-une-raison-bien-precise</link>
      <pubDate>Mon, 12 Jan 2026 09:34:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2938683_byd-va-lancer-une-nouvelle-marque-de-voitures-electriques-et-hybrides-pour-une-raison-bien-precise</guid>
      <description>
Apr&#232;s Denza, Yangwang et Fangchenbao, BYD va cr&#233;er une nouvelle marque de voitures &#233;lectriques. Le but&#160;? Renforcer sa position du march&#233; des taxis et VTC, sans influer sur les ventes et l'image de ses autres filiales.
</description>
    </item>
    <item>
      <title>Stranger Things s&#8217;installe sur votre Samsung Galaxy : voici comment r&#233;cup&#233;rer le th&#232;me gratuit</title>
      <link>https://www.frandroid.com/marques/samsung/2938805_stranger-things-sinstalle-sur-votre-samsung-galaxy-voici-comment-recuperer-le-theme-gratuit</link>
      <pubDate>Mon, 12 Jan 2026 09:34:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2938805_stranger-things-sinstalle-sur-votre-samsung-galaxy-voici-comment-recuperer-le-theme-gratuit</guid>
      <description>
Samsung s'associe &#224; Netflix pour proposer un th&#232;me exclusif aux couleurs de la s&#233;rie Stranger Things sur ses smartphones. Disponible pour une dur&#233;e limit&#233;e sur le Galaxy Store, ce contenu permet de modifier en profondeur l'interface, sous r&#233;serve de remplir certaines conditions d'&#233;ligibilit&#233;.
</description>
    </item>
    <item>
      <title>Adieu les fake news sur WhatsApp&#8201;? L&#8217;UE va serrer la vis sur les &#171;&#8201;chaines&#8201;&#187; publiques de l&#8217;app</title>
      <link>https://www.frandroid.com/marques/meta/2938659_adieu-les-fake-news-sur-whatsapp-lue-va-serrer-la-vis-sur-les-chaines-publiques-de-lapp</link>
      <pubDate>Mon, 12 Jan 2026 09:25:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2938659_adieu-les-fake-news-sur-whatsapp-lue-va-serrer-la-vis-sur-les-chaines-publiques-de-lapp</guid>
      <description>
WhatsApp n&#8217;en a pas fini avec ses soucis r&#233;glementaires. L&#8217;application ne va pas tarder &#224; &#234;tre d&#233;sign&#233;e comme une &#171;&#8201;tr&#232;s grande plateforme&#8201;&#187; par l&#8217;UE, ce qui vient avec de nouvelles obligations concernant la mod&#233;ration de contenus.
</description>
    </item>
    <item>
      <title>Bien plus ch&#232;re qu&#8217;une console ? Le prix de la Steam Machine de Valve aurait fuit&#233;</title>
      <link>https://www.frandroid.com/marques/valve/2938735_bien-plus-chere-quune-console-le-prix-de-la-steam-machine-de-valve-aurait-fuite</link>
      <pubDate>Mon, 12 Jan 2026 09:24:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/valve/2938735_bien-plus-chere-quune-console-le-prix-de-la-steam-machine-de-valve-aurait-fuite</guid>
      <description>
Un revendeur tch&#232;que aurait fait fuiter le prix des deux mod&#232;les de Steam Machine attendus pour ce d&#233;but d'ann&#233;e. On fait le point.
</description>
    </item>
    <item>
      <title>Android 16 ne vous laissera plus vous tromper de fuseau horaire</title>
      <link>https://www.frandroid.com/marques/google/2938661_android-16-ne-vous-laissera-plus-vous-tromper-de-fuseau-horaire</link>
      <pubDate>Mon, 12 Jan 2026 09:24:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2938661_android-16-ne-vous-laissera-plus-vous-tromper-de-fuseau-horaire</guid>
      <description>
La nouvelle version d&#8217;Android se doterait d'une fonctionnalit&#233; indiquant pr&#233;cis&#233;ment &#224; ses utilisateurs lorsqu&#8217;ils changeront de fuseau horaire.
</description>
    </item>
    <item>
      <title>Pourquoi Xiaomi pourrait tr&#232;s bient&#244;t s&#8217;installer sur votre bureau&#160;sous votre moniteur ?</title>
      <link>https://www.frandroid.com/marques/xiaomi/2938789_pourquoi-xiaomi-pourrait-tres-bientot-sinstaller-sur-votre-bureau-sous-votre-moniteur</link>
      <pubDate>Mon, 12 Jan 2026 09:18:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2938789_pourquoi-xiaomi-pourrait-tres-bientot-sinstaller-sur-votre-bureau-sous-votre-moniteur</guid>
      <description>
Xiaomi vient d&#8217;annoncer le lancement d&#8217;un produit sur lequel on n&#8217;attendait pas forc&#233;ment la marque chinoise, les barres de son. Baptis&#233;e Redmi Soundbar Speaker 2 Pro, il s&#8217;agit d&#8217;un syst&#232;me compos&#233; d'une barre de son avec &#233;clairage RGB &#224; installer sur un bureau et d'un caisson de basse sans fil.
</description>
    </item>
    <item>
      <title>Crypto&#160;: 3 nouvelles agressions secouent la France, les investisseurs Bitcoin sont devenus des cibles</title>
      <link>https://www.01net.com/actualites/crypto-nouvelles-agressions-secouent-france-investisseurs-sont-devenus-cibles.html</link>
      <pubDate>Mon, 12 Jan 2026 09:11:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319366</guid>
      <description>Une nouvelle vague d&#8217;enl&#232;vements ultra-violents vise directement les d&#233;tenteurs de cryptomonnaies en France. Trois incidents ont &#233;t&#233; recens&#233;s sur le sol fran&#231;ais en quelques jours, confirmant la triste tendance initi&#233;e l'ann&#233;e derni&#232;re.</description>
    </item>
    <item>
      <title>Galaxy S26, S26+ et S26 Ultra : la date de sortie a fuit&#233; et ce n&#8217;est pas pour demain</title>
      <link>https://www.frandroid.com/marques/2938755_galaxy-s26-s26-et-s26-ultra-la-date-de-sortie-a-fuite-et-ce-nest-pas-pour-demain</link>
      <pubDate>Mon, 12 Jan 2026 09:05:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2938755_galaxy-s26-s26-et-s26-ultra-la-date-de-sortie-a-fuite-et-ce-nest-pas-pour-demain</guid>
      <description>
Alors que les regards se tournent habituellement vers le mois de janvier pour le renouvellement de la gamme phare de Samsung, le leaker billbil-kun vient de doucher les espoirs d'une sortie pr&#233;coce. Selon ses informations, le g&#233;ant cor&#233;en aurait opt&#233; pour un calendrier plus tardif, fixant la commercialisation de ses Galaxy S26 au mois de mars 2026.
...</description>
    </item>
    <item>
      <title>Samsung a cass&#233; l&#8217;autonomie de ses smartphones &#224; cause d&#8217;une mise &#224; jour : voici comment y rem&#233;dier</title>
      <link>https://www.frandroid.com/marques/samsung/2938737_samsung-a-casse-lautonomie-de-ses-smartphones-a-cause-dune-mise-a-jour-voici-comment-y-remedier</link>
      <pubDate>Mon, 12 Jan 2026 08:57:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2938737_samsung-a-casse-lautonomie-de-ses-smartphones-a-cause-dune-mise-a-jour-voici-comment-y-remedier</guid>
      <description>
On commence l'ann&#233;e 2026 avec une belle boulette chez Samsung. Si vous avez un Galaxy Z Flip 7 ou un Fold 7, &#233;loignez-vous du bouton "Mise &#224; jour". Le patch de s&#233;curit&#233; de d&#233;cembre, cens&#233; vous prot&#233;ger, fait fondre l'autonomie de 20 %. 
</description>
    </item>
    <item>
      <title>Fausse bo&#238;te de vitesses et hautes performances : Kia transforme ses voitures &#233;lectriques en machine &#224; plaisir</title>
      <link>https://www.frandroid.com/marques/kia/2938635_fausse-boite-de-vitesses-et-hautes-performances-kia-transforme-ses-voitures-electriques-en-machine-a-plaisir</link>
      <pubDate>Mon, 12 Jan 2026 08:54:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/kia/2938635_fausse-boite-de-vitesses-et-hautes-performances-kia-transforme-ses-voitures-electriques-en-machine-a-plaisir</guid>
      <description>
Kia vient de lever le voile sur des versions sportives de trois voitures &#233;lectriques : ses EV3, EV4 et EV5. Au programme, plus de puissance, une transmission int&#233;grale et une fausse bo&#238;te de vitesses.
</description>
    </item>
    <item>
      <title>Voici l&#8217;op&#233;rateur internet avec les meilleures performances en 2025 selon le dernier barom&#232;tre nPerf</title>
      <link>https://www.frandroid.com/telecom/2938681_voici-loperateur-internet-avec-les-meilleures-performances-en-2025-selon-le-dernier-barometre-nperf</link>
      <pubDate>Mon, 12 Jan 2026 08:52:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2938681_voici-loperateur-internet-avec-les-meilleures-performances-en-2025-selon-le-dernier-barometre-nperf</guid>
      <description>
Chaque d&#233;but d'ann&#233;e, nPerf d&#233;voile son barom&#232;tre annuel r&#233;compensant l'op&#233;rateur qui a fait preuve des meilleures performances internet l'ann&#233;e pass&#233;e. Une fois encore, c'est Bouygues Telecom qui remporte la m&#233;daille d'or avec des r&#233;sultats impressionnants sur le fixe et le Wi-Fi.
</description>
    </item>
    <item>
      <title>&#171;&#160;Les usines n&#8217;acceptent plus les commandes&#160;&#187; : apr&#232;s la RAM, alerte rouge sur le prix des alimentations et ventirads</title>
      <link>https://www.frandroid.com/produits-android/hardware/batterie/2938715_les-usines-nacceptent-plus-les-commandes-apres-la-ram-alerte-rouge-sur-le-prix-des-alimentations-et-ventirads</link>
      <pubDate>Mon, 12 Jan 2026 08:43:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/batterie/2938715_les-usines-nacceptent-plus-les-commandes-apres-la-ram-alerte-rouge-sur-le-prix-des-alimentations-et-ventirads</guid>
      <description>
Monter une configuration PC en 2026 est un parcours du combattant pour le portefeuille. On savait pour les SSD. On savait pour la RAM. Mais voil&#224; que les alimentations et les refroidisseurs rejoignent la liste des composants en hausse. Si vous aviez un projet d'achat, c'est peut-&#234;tre le moment de vous d&#233;p&#234;cher.
</description>
    </item>
    <item>
      <title>iPhone&#160;: comment acc&#233;der &#224; YouTube sans pub gr&#226;ce &#224; Brave&#160;?</title>
      <link>https://www.01net.com/actualites/iphone-youtube-sans-pub-brave-raccourci.html</link>
      <pubDate>Mon, 12 Jan 2026 08:39:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319362</guid>
      <description>Cr&#233;ez un raccourci sur l'&#233;cran d'accueil de votre iPhone pour ouvrir rapidement YouTube dans Brave.</description>
    </item>
    <item>
      <title>Comment l&#8217;Iran a r&#233;ussi &#224; couper l&#8217;internet par satellite de Starlink sur son territoire</title>
      <link>https://www.frandroid.com/telecom/2938691_comment-liran-a-reussi-a-couper-linternet-par-satellite-de-starlink-sur-son-territoire</link>
      <pubDate>Mon, 12 Jan 2026 08:29:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2938691_comment-liran-a-reussi-a-couper-linternet-par-satellite-de-starlink-sur-son-territoire</guid>
      <description>
La promesse d'Elon Musk &#233;tait belle : un internet libre, partout, impossible &#224; censurer. La r&#233;alit&#233; vient de rattraper Elon Musk. En Iran, le trafic Starlink s'effondre, et ce n'est pas un accident technique. Le r&#233;gime semble avoir d&#233;ploy&#233; une nouvelle arme redoutable pour faire taire les terminaux satellitaires.
</description>
    </item>
    <item>
      <title>La r&#233;cente et &#233;l&#233;gante enceinte Bluetooth Bose SoundLink Home profite des soldes pour baisser de prix</title>
      <link>https://www.frandroid.com/bons-plans/2937669_la-recente-et-elegante-enceinte-bluetooth-bose-soundlink-home-profite-des-soldes-pour-baisser-de-prix</link>
      <pubDate>Mon, 12 Jan 2026 08:29:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2937669_la-recente-et-elegante-enceinte-bluetooth-bose-soundlink-home-profite-des-soldes-pour-baisser-de-prix</guid>
      <description>
La Bose SoundLink Home fait partie des enceintes Bluetooth les plus originales du moment, avec son design raffin&#233; un brin vintage. Pendant les soldes, plusieurs e-commer&#231;ants la proposent &#224; 199,99 euros au lieu de 229,99 euros.
</description>
    </item>
    <item>
      <title>Nikki Glasers Golden Globes monologue brutally roasts both celebrities and the government</title>
      <link>https://mashable.com/video/golden-globes-2026-nikki-glaser-monologue</link>
      <pubDate>Mon, 12 Jan 2026 08:22:19 +0000</pubDate>
      <guid isPermaLink="false">01s9i6B4VRMGIkfWZ6VzueI</guid>
      <description>2026 Golden Globes host Nikki Glaser took a dig at the Justice Department and roasted Leonardo DiCaprio in her opening monologue.</description>
    </item>
    <item>
      <title>Microsoft corrige une faille du navigateur Edge, installez la mise &#224; jour</title>
      <link>https://www.01net.com/actualites/microsoft-corrige-faille-navigateur-edge-installez-mise-jour.html</link>
      <pubDate>Mon, 12 Jan 2026 08:01:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319356</guid>
      <description>Une faille critique dans Microsoft Edge a &#233;t&#233; d&#233;busqu&#233;e. Elle permet de pirater le navigateur simplement en vous faisant visiter un site pi&#233;g&#233;. En quelques clics, un attaquant peut contourner les protections de s&#233;curit&#233;, voler vos donn&#233;es de navigation ou prendre le contr&#244;le du navigateur. Microsoft a publi&#233; un correctif.</description>
    </item>
    <item>
      <title>These Gen Zers just raised $11.75M to put Africa&#8217;s defense back in the hands of Africans</title>
      <link>https://techcrunch.com/2026/01/12/these-gen-zers-just-raised-11-75m-to-put-africas-defense-back-in-the-hands-of-africans/</link>
      <pubDate>Mon, 12 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3081535</guid>
      <description>African defense company Terra comes out of stealth with a $11.75M round led by Joe Lonsdale's 8VC.</description>
    </item>
  </channel>
</rss>
