<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 12 Jan 2026 08:38:56 GMT</lastBuildDate>
    <item>
      <title>Comment l&#8217;Iran a r&#233;ussi &#224; couper l&#8217;internet par satellite de Starlink sur son territoire</title>
      <link>https://www.frandroid.com/telecom/2938691_comment-liran-a-reussi-a-couper-linternet-par-satellite-de-starlink-sur-son-territoire</link>
      <pubDate>Mon, 12 Jan 2026 08:29:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2938691_comment-liran-a-reussi-a-couper-linternet-par-satellite-de-starlink-sur-son-territoire</guid>
      <description>
La promesse d'Elon Musk &#233;tait belle : un internet libre, partout, impossible &#224; censurer. La r&#233;alit&#233; vient de rattraper Elon Musk. En Iran, le trafic Starlink s'effondre, et ce n'est pas un accident technique. Le r&#233;gime semble avoir d&#233;ploy&#233; une nouvelle arme redoutable pour faire taire les terminaux satellitaires.
</description>
    </item>
    <item>
      <title>M&#234;me Linus Torvalds vibe-code</title>
      <link>https://www.frandroid.com/culture-tech/2938675_meme-linus-torvalds-vibe-code</link>
      <pubDate>Mon, 12 Jan 2026 08:19:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/2938675_meme-linus-torvalds-vibe-code</guid>
      <description>
Connu pour son intransigeance et ses e-mails incendiaires sur la qualit&#233; du code, Linus Torvalds a profit&#233; des vacances pour lancer un nouveau projet. La surprise ? Il a utilis&#233; le "vibe coding" via une IA pour g&#233;n&#233;rer toute une partie du logiciel.
</description>
    </item>
    <item>
      <title>Microsoft va supprimer une fonction pratique de votre Kindle</title>
      <link>https://www.frandroid.com/marques/amazon/2938645_microsoft-va-supprimer-une-fonction-pratique-de-votre-kindle</link>
      <pubDate>Mon, 12 Jan 2026 08:08:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazon/2938645_microsoft-va-supprimer-une-fonction-pratique-de-votre-kindle</guid>
      <description>
La liseuse d&#8217;Amazon ne pourra bient&#244;t plus recevoir aussi facilement et rapidement les documents cr&#233;&#233;s depuis Word. &#160;
</description>
    </item>
    <item>
      <title>Microsoft corrige une faille du navigateur Edge, installez la mise &#224; jour</title>
      <link>https://www.01net.com/actualites/microsoft-corrige-faille-navigateur-edge-installez-mise-jour.html</link>
      <pubDate>Mon, 12 Jan 2026 08:01:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319356</guid>
      <description>Une faille critique dans Microsoft Edge a &#233;t&#233; d&#233;busqu&#233;e. Elle permet de pirater le navigateur simplement en vous faisant visiter un site pi&#233;g&#233;. En quelques clics, un attaquant peut contourner les protections de s&#233;curit&#233;, voler vos donn&#233;es de navigation ou prendre le contr&#244;le du navigateur. Microsoft a publi&#233; un correctif.</description>
    </item>
    <item>
      <title>These Gen Zers just raised $11.75M to put Africa&#8217;s defense back in the hands of Africans</title>
      <link>https://techcrunch.com/2026/01/12/these-gen-zers-just-raised-11-75m-to-put-africas-defense-back-in-the-hands-of-africans/</link>
      <pubDate>Mon, 12 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3081535</guid>
      <description>African defense company Terra comes out of stealth with a $11.75M round led by Joe Lonsdale's 8VC.</description>
    </item>
    <item>
      <title>Motorola Edge 70 : le rival de l&#8217;iPhone Air peut vous revenir &#224; moins de 650 &#8364; pendant les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2936755_motorola-edge-70-le-rival-de-liphone-air-peut-vous-revenir-a-moins-de-650-e-pendant-les-soldes</link>
      <pubDate>Mon, 12 Jan 2026 07:36:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2936755_motorola-edge-70-le-rival-de-liphone-air-peut-vous-revenir-a-moins-de-650-e-pendant-les-soldes</guid>
      <description>
Le r&#233;cent Motorola Edge 70 vient concurrencer les iPhone Air et Galaxy S25 Edge sur le secteur des smartphones tr&#232;s peu &#233;pais. Il n'est certes pas le plus performant des trois, mais quand Boulanger le propose &#224; 649,99 euros au lieu de 799,99 euros pendant les soldes, on le recommande bien plus facilement.
</description>
    </item>
    <item>
      <title>Les soci&#233;t&#233;s d&#8217;IA devront-elles payer des dommages et int&#233;r&#234;ts aux auteurs&#160;? L&#8217;&#233;pineux sujet devrait &#234;tre tranch&#233; en 2026</title>
      <link>https://www.01net.com/actualites/les-societes-dia-devront-elles-payer-des-dommages-et-interets-aux-auteurs-lepineux-sujet-devrait-etre-tranche-en-2026.html</link>
      <pubDate>Mon, 12 Jan 2026 07:31:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318332</guid>
      <description>Les entreprises d&#233;veloppant des outils d'IA g&#233;n&#233;rative comme ChatGPT devront-elles payer des licences aux cr&#233;ateurs de contenus ? Le conflit qui oppose auteurs et soci&#233;t&#233;s d'IA devrait avancer cette ann&#233;e, avec plusieurs d&#233;cisions d&#233;cisives attendues de part et d'autre de l'Atlantique.</description>
    </item>
    <item>
      <title>Instagram rassure tout le monde, la r&#233;cente fuite de donn&#233;es n&#8217;en &#233;tait pas une finalement</title>
      <link>https://www.frandroid.com/marques/meta/2938631_instagram-rassure-tout-le-monde-la-recente-fuite-de-donnees-nen-etait-pas-une-finalement</link>
      <pubDate>Mon, 12 Jan 2026 07:14:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2938631_instagram-rassure-tout-le-monde-la-recente-fuite-de-donnees-nen-etait-pas-une-finalement</guid>
      <description>
Alors qu&#8217;un fichier promettant de contenir des informations personnelles sur 17,5&#160;millions de comptes Instagram a &#233;merg&#233; sur des recoins sombres du net, Meta tente de rassurer en expliquant qu&#8217;il n&#8217;y a pas eu d&#8217;acc&#232;s frauduleux &#224; ses donn&#233;es.
</description>
    </item>
    <item>
      <title>Do I need a dehumidifier? Here's exactly what they can help with</title>
      <link>https://www.techradar.com/home/small-appliances/how-does-a-dehumidifier-work-and-what-does-it-do</link>
      <pubDate>Mon, 12 Jan 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">y4jhfBYcsxH6SqUN8ggjhG</guid>
      <description>Dehumidifiers can help tackle all kinds of damp, condensation and humidity &#8211; here's how.</description>
    </item>
    <item>
      <title>Google Maps change enfin la pire partie de son interface</title>
      <link>https://www.01net.com/actualites/google-maps-change-enfin-pire-partie-son-interface.html</link>
      <pubDate>Mon, 12 Jan 2026 06:59:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319339</guid>
      <description>Google Maps d&#233;ploie en ce moment une refonte majeure de son menu des param&#232;tres pour mettre fin &#224; une interface devenue illisible au fil des ann&#233;es.</description>
    </item>
    <item>
      <title>Cyberattaque contre Instagram&#160;: le r&#233;seau social corrige une faille de s&#233;curit&#233;</title>
      <link>https://www.01net.com/actualites/fuite-donnees-instagram-informations-17-millions-utilisateurs-volees.html</link>
      <pubDate>Mon, 12 Jan 2026 06:55:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319288</guid>
      <description>Des pirates ont mis la main sur les donn&#233;es sensibles de 17,5 millions de comptes Instagram. Partag&#233;es sur le dark web, elles mettent en danger tous les utilisateurs concern&#233;s. Instagram confirme avoir &#233;t&#233; la cible d'une cyberattaque exploitant une faille de s&#233;curit&#233;, mais assure qu'aucune donn&#233;e n'a &#233;t&#233; vol&#233;e. Le r&#233;seau a corrig&#233; la vuln&#233;rabilit&#233;.</description>
    </item>
    <item>
      <title>Crypto-crime&#160;: pourquoi 2025 a pulv&#233;ris&#233; tous les records</title>
      <link>https://www.01net.com/actualites/crypto-crime-pourquoi-2025-pulverise-tous-records.html</link>
      <pubDate>Mon, 12 Jan 2026 06:50:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319112</guid>
      <description>En 2025, l&#8217;argent sale en cryptomonnaies a battu tous les records. Plus de 150 milliards de dollars li&#233;s au crime ont &#233;t&#233; identifi&#233;s sur les blockchains. Cette augmentation d&#233;coule des activit&#233;s de la Russie, l&#8217;Iran, et la Cor&#233;e du Nord, qui se sont appropri&#233; les cryptomonnaies pour &#233;chapper aux sanctions &#233;conomiques de l'Occident.</description>
    </item>
    <item>
      <title>Samsung Galaxy Z Flip 7 vs Motorola Razr 60 Ultra&#160;: comment choisir le meilleur smartphone pliable &#224; clapet&#160;?</title>
      <link>https://www.frandroid.com/versus/2777611_samsung-galaxy-z-flip-7-vs-motorola-razr-60-ultra-comment-choisir-le-meilleur-smartphone-pliable-a-clapet</link>
      <pubDate>Mon, 12 Jan 2026 06:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/versus/2777611_samsung-galaxy-z-flip-7-vs-motorola-razr-60-ultra-comment-choisir-le-meilleur-smartphone-pliable-a-clapet</guid>
      <description>
Samsung rencontre une concurrence de plus en plus f&#233;roce sur le march&#233; des pliants. Motorola a-t-il seulement des chances de distancer le Galaxy Z Flip 7&#160;avec son Razr 60 Ultra&#160;? On se pose la question dans notre nouveau comparatif&#160;!
</description>
    </item>
  </channel>
</rss>
