<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 31 Dec 2025 14:25:08 GMT</lastBuildDate>
    <item>
      <title>The Dreame X40 Ultra robovac is about $700 off, nearly matching its best price</title>
      <link>https://www.theverge.com/gadgets/851325/dreame-x40-ultra-baseus-163w-retractable-car-charger-deal-sale</link>
      <pubDate>2025-12-31T09:23:43-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=851325</guid>
      <description>With the year coming to a close, now&#8217;s a good time to set yourself up for a cleaner, more organized start in 2026. The Dreame X40 Ultra &#8212; one of our favorite robot vacuum deals from Black Friday &#8212; can handle most of the heavy lifting for you, and it&#8217;s once again on sale. You [&#8230;]</description>
    </item>
    <item>
      <title>L&#8217;industrie musicale face &#224; l&#8217;IA : quels impacts sur la recommandation et la cr&#233;ation ? [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/2923611_lindustrie-musicale-face-a-lia-quels-impacts-sur-la-recommandation-et-la-creation</link>
      <pubDate>Wed, 31 Dec 2025 14:10:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2923611_lindustrie-musicale-face-a-lia-quels-impacts-sur-la-recommandation-et-la-creation</guid>
      <description>
Marre des contenus musicaux g&#233;n&#233;r&#233;s par IA ? Des artistes pay&#233;s &#224; l&#8217;emporte-pi&#232;ce ? Si c'est le cas, c'est qu'il est temps de vous pencher sur les pratiques des plateformes de streaming musical. Certaines font plus d&#8217;efforts que d&#8217;autres &#224; l&#8217;image de Deezer et de sa politique concernant les contenus 100 % g&#233;n&#233;r&#233;s par IA.&#160;
</description>
    </item>
    <item>
      <title>On a vu la premi&#232;re voiture &#233;lectrique chinoise qui conduit seule &#224; 120 km/h : la GAC Hyptec A800</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2904239_on-a-vu-la-premiere-voiture-electrique-chinoise-qui-conduit-seule-a-120-km-h-la-gac-hyptec-a800</link>
      <pubDate>Wed, 31 Dec 2025 14:10:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2904239_on-a-vu-la-premiere-voiture-electrique-chinoise-qui-conduit-seule-a-120-km-h-la-gac-hyptec-a800</guid>
      <description>
On a pu monter &#224; bord de la voiture &#233;lectrique chinois qui a obtenu la premi&#232;re licence locale pour conduite en autonomie &#224; 120 km/h. La GAC Hyptec A800 et voici notre premier avis.
</description>
    </item>
    <item>
      <title>La PS5 vient de subir sa plus grosse fuite depuis son lancement</title>
      <link>https://www.frandroid.com/marques/sony/2924489_la-ps5-vient-de-subir-sa-plus-grosse-fuite-depuis-son-lancement</link>
      <pubDate>Wed, 31 Dec 2025 14:07:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2924489_la-ps5-vient-de-subir-sa-plus-grosse-fuite-depuis-son-lancement</guid>
      <description>
Le jailbreak de la PS5 est d&#233;sormais une r&#233;alit&#233; alors que les cl&#233;s de chiffrement de la console ont fuit&#233;. Une aubaine pour les pirates et une bien mauvaise nouvelle pour Sony.
</description>
    </item>
    <item>
      <title>The Best Gadgets of December 2025</title>
      <link>https://gizmodo.com/the-best-gadgets-of-december-2025-2000704366</link>
      <pubDate>Wed, 31 Dec 2025 14:00:34 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000704366</guid>
      <description>The end of the holiday season is a precursor to a weird, wacky, and chaotic 2026.</description>
    </item>
    <item>
      <title>Android : d&#233;couvrez quelle version &#233;quipe le plus de smartphones en 2025</title>
      <link>https://www.frandroid.com/android/mises-a-jour-android/1447927_versions-android-plus-utilisees-fragmentation</link>
      <pubDate>Wed, 31 Dec 2025 14:00:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/mises-a-jour-android/1447927_versions-android-plus-utilisees-fragmentation</guid>
      <description>
Utilisez-vous la version d'Android la plus r&#233;pandue ? Voici les derniers chiffres de la fragmentation de l'OS de Google pour savoir qui d'Android 16, Android 15, Android 14, Android 13 ou Android 12 est la mouture la plus d&#233;ploy&#233;e dans le monde.
</description>
    </item>
    <item>
      <title>The dumbest things that happened in tech this year</title>
      <link>https://techcrunch.com/2025/12/31/the-dumbest-things-that-happened-in-tech-this-year/</link>
      <pubDate>Wed, 31 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078541</guid>
      <description>From Sam Altman's olive oil "scandal" to Soham Parekh's viral moment, a lot of silly stuff has gone down in tech this year.</description>
    </item>
    <item>
      <title>Looking for the best games to play with the family? These must-play titles are perfect for bringing everyone together over New Year's</title>
      <link>https://www.techradar.com/gaming/looking-for-the-best-games-to-play-with-the-family-these-must-play-titles-are-perfect-for-bringing-everyone-together-over-new-years</link>
      <pubDate>Wed, 31 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">QYsBWXcZiXs64d883YZxHL</guid>
      <description>These family favorites are fantastic choices if you're looking for games to keep everyone entertained over the holidays.</description>
    </item>
    <item>
      <title>European space agency confirms 'external servers' breached in cyberattack</title>
      <link>https://www.techradar.com/pro/security/european-space-agency-confirms-external-servers-breached-in-cyberattack</link>
      <pubDate>Wed, 31 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">2w2PH5Wuny7MHThz9k32HJ</guid>
      <description>The ESA is investigating the extent of the breach, while hackers share stolen files on the dark web.</description>
    </item>
    <item>
      <title>How to use a VPN</title>
      <link>https://www.engadget.com/cybersecurity/vpn/how-to-use-a-vpn-140000564.html?src=rss</link>
      <pubDate>Wed, 31 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">52aa4501-7372-4990-ab5c-a027e398a215</guid>
      <description>Chances are that if a VPN is marketed to everyday users, it more or less runs itself. As long as you go with one of the best VPNs instead of setting up your own manual connection, the interface is likely built so you have to engage with it as little as possible. Generally, if you find yourself constantly thinking about your VPN while using it &#8212; as happened to me with Norton VPN &#8212; that's a bad thing and you should change providers.That said, it's still useful to get a high-level view of how to use a VPN, especially if you've never used one before. In this article, I'll walk you through how to d...</description>
    </item>
    <item>
      <title>Ce mini projecteur laser ultra lumineux &#224; prix cass&#233; affiche des images 4K jusqu&#8217;&#224; 200&#8243; sur votre mur</title>
      <link>https://www.frandroid.com/bons-plans/2827229_ce-mini-projecteur-laser-ultra-lumineux-a-prix-casse-affiche-des-images-4k-jusqua-200-sur-votre-mur</link>
      <pubDate>Wed, 31 Dec 2025 13:52:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2827229_ce-mini-projecteur-laser-ultra-lumineux-a-prix-casse-affiche-des-images-4k-jusqua-200-sur-votre-mur</guid>
      <description>
En promotion &#224; 999 &#8364; au lieu de 1 299 &#8364;, le Hisense M2 Pro fait tomber la barri&#232;re d&#8217;entr&#233;e de la projection laser 4K &#224; la maison, avec une image jusqu&#8217;&#224; 200 pouces, un triple laser ultra color&#233; et une plateforme Vidaa U compl&#232;te pour le streaming.
</description>
    </item>
    <item>
      <title>Les derniers chiffres de Google sont tomb&#233;s : Android 16 progresse bien et une version historique disparait</title>
      <link>https://www.frandroid.com/android/mises-a-jour-android/2924449_les-derniers-chiffres-de-google-sont-tombes-android-16-progresse-bien-et-une-version-historique-disparait</link>
      <pubDate>Wed, 31 Dec 2025 13:45:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/mises-a-jour-android/2924449_les-derniers-chiffres-de-google-sont-tombes-android-16-progresse-bien-et-une-version-historique-disparait</guid>
      <description>
Google partage pour la premi&#232;re fois les chiffres de d&#233;ploiement d'Android 16. Au passage, on apprend que le tr&#232;s vieil Android 4.4 KitKat n'est plus comptabilis&#233;.
</description>
    </item>
    <item>
      <title>We let ChatGPT judge impossible superhero debates &#8212; here's how it ruled</title>
      <link>https://www.techradar.com/ai-platforms-assistants/we-let-chatgpt-judge-impossible-superhero-debates</link>
      <pubDate>Wed, 31 Dec 2025 13:45:27 +0000</pubDate>
      <guid isPermaLink="false">K28N6WM59GaquQyxgz7dnY</guid>
      <description>ChatGPT referees superhero debates</description>
    </item>
    <item>
      <title>Les 18 voitures &#233;lectriques qu&#8217;on attend le plus en 2026 : des citadines aux berlines &#224; 800 km d&#8217;autonomie</title>
      <link>https://www.frandroid.com/survoltes/2923619_les-18-voitures-electriques-quon-attend-le-plus-en-2026-des-citadines-aux-berlines-a-800-km-dautonomie</link>
      <pubDate>Wed, 31 Dec 2025 13:42:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2923619_les-18-voitures-electriques-quon-attend-le-plus-en-2026-des-citadines-aux-berlines-a-800-km-dautonomie</guid>
      <description>
Voici les 18 voitures &#233;lectriques les plus attendues de 2026. De la Polo de Volkswagen &#224; la Ferrari Elettrica en passant par la Dacia Spring sur base Twingo, on a list&#233; les mod&#232;les qui devraient apporter du renouveau dans de nombreux segments.
</description>
    </item>
    <item>
      <title>Surprise&#160;: le Trump Phone dor&#233; ne sortira pas cette ann&#233;e</title>
      <link>https://www.01net.com/actualites/surprise-le-trump-phone-dore-ne-sortira-pas-cette-annee.html</link>
      <pubDate>Wed, 31 Dec 2025 13:31:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317761</guid>
      <description>Le Trump Phone plaqu&#233; or ne sortira pas avant la fin de l'ann&#233;e, qui approche &#224; grands pas. Le smartphone &#171; made in USA &#187;, pr&#233;sent&#233; en juin en grande pompe par Trump Mobile, devait initialement &#234;tre lanc&#233; dans le courant de l'&#233;t&#233;.</description>
    </item>
    <item>
      <title>Killing in the name of&#8230; nothing</title>
      <link>https://www.theverge.com/policy/849609/charlie-kirk-shooting-ideology-literacy-politics</link>
      <pubDate>2025-12-31T08:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=849609</guid>
      <description>In a good and just society, it would have been possible to bury Charlie Kirk without either threatening mass violence toward his enemies or making light of his death with a furry sex meme. But America in 2025 did not remotely resemble a working society, let alone a civil one, and Kirk's killing came prepackaged [&#8230;]</description>
    </item>
    <item>
      <title>Rotel's bijou integrated amp is small but mighty &#8212;and it became my system's pint-sized powerhouse</title>
      <link>https://www.techradar.com/audio/hi-fi/rotel-dx-5-review</link>
      <pubDate>Wed, 31 Dec 2025 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">6bsAKjC9zpva3MsUhjpGLM</guid>
      <description>Rotel has belatedly realised that &#8216;small&#8217; really might be &#8216;beautiful&#8217; after all &#8211; and the DX-5 wants to be your miniature stereo hero</description>
    </item>
    <item>
      <title>P&#233;nurie de RAM : seules ces 4 marques de PC auront du stock (et les autres vont souffrir)</title>
      <link>https://www.frandroid.com/produits-android/hardware/memoire/2924291_penurie-de-ram-seules-ces-4-marques-de-pc-auront-du-stock-et-les-autres-vont-souffrir</link>
      <pubDate>Wed, 31 Dec 2025 13:13:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/memoire/2924291_penurie-de-ram-seules-ces-4-marques-de-pc-auront-du-stock-et-les-autres-vont-souffrir</guid>
      <description>
On apprend cette semaine que la p&#233;nurie de m&#233;moire vive est d&#233;sormais suffisamment s&#233;v&#232;re pour permettre aux fabricants de DRAM de choisir litt&#233;ralement leurs clients afin de concentrer leurs exp&#233;ditions vers les plus offrantss. Une situation, pr&#233;visible, qui b&#233;n&#233;ficierait &#224; quatre constructeurs seulement.
</description>
    </item>
    <item>
      <title>Le processeur AMD Ryzen 7 9800X3D aurait enfin trouv&#233; son rempla&#231;ant</title>
      <link>https://www.frandroid.com/marques/amd/2924337_lamd-ryzen-7-9800x3d-aurait-enfin-trouve-son-remplacant</link>
      <pubDate>Wed, 31 Dec 2025 13:07:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amd/2924337_lamd-ryzen-7-9800x3d-aurait-enfin-trouve-son-remplacant</guid>
      <description>
L'annonce de l'AMD Ryzen 7 9850X3D est imminente alors que son tarif semble d&#233;j&#224; fuiter chez les distributeurs. Une information qui pourrait bien indiquer l'avenir que r&#233;serve AMD au 9800X3D, son pr&#233;d&#233;cesseur.
</description>
    </item>
    <item>
      <title>Behold &#8216;Dracula&#8217;s Chivito,&#8217; the Largest Planet Nursery Astronomers Have Ever Seen</title>
      <link>https://gizmodo.com/behold-draculas-chivito-the-largest-planet-nursery-astronomers-have-ever-seen-2000704065</link>
      <pubDate>Wed, 31 Dec 2025 13:05:53 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000704065</guid>
      <description>This enormous protoplanetary disk is confounding astronomers.</description>
    </item>
    <item>
      <title>The best winter tech for 2026 to get you through the coldest months</title>
      <link>https://www.engadget.com/home/smart-home/the-best-winter-tech-to-get-you-through-the-coldest-months-130009205.html?src=rss</link>
      <pubDate>Wed, 31 Dec 2025 13:01:25 +0000</pubDate>
      <guid isPermaLink="false">4592254c-75a2-4797-8bdf-787ecd64148b</guid>
      <description>The festive lights, time off and cute scarfs can only conceal the truth for so long: Winter can be pretty bleak. I don't mean to be a downer, but it's cold all of the time, dark most of the time and this lasts far beyond the most wonderful time of the year. Here at Engadget, we've tried so many tools and products to make winter more bearable from therapy lamps to heaters. We've invested in tea sets, wrapped ourselves in heated blankets and learned to grow herbs indoors &#8212; really, anything that will make these three-plus months more bearable, we've tried.Here, you'll find some of the best winter...</description>
    </item>
    <item>
      <title>How to watch the first-ever Lego CES 2026 press conference live</title>
      <link>https://www.engadget.com/gaming/how-to-watch-the-first-ever-lego-ces-2026-press-conference-live-130005307.html?src=rss</link>
      <pubDate>Wed, 31 Dec 2025 13:00:05 +0000</pubDate>
      <guid isPermaLink="false">d02a28a6-f21c-46c9-a5e0-dcff1b13d26a</guid>
      <description>picture alliance via Getty Images
The Lego Group is hosting its first-ever press conference at CES 2026 &#8211; but what the company is going to announce remains a mystery. While the huge toy brick creators haven't given any hints as to what they'll be showcasing, the possibilities run the gamut from new video games to Formula 1 race cars.
Here's how you can watch Lego's presentation at CES, and what we might expect to see.
How to watch The Lego Group's CES 2026 press conference
The Lego CES press conference is scheduled for Monday, January 5 at 1PM ET. While Lego and the Consumer Technology Associa...</description>
    </item>
    <item>
      <title>The 11 best Nintendo Switch 2 games we played in 2025</title>
      <link>https://www.theverge.com/games/845401/nintendo-switch-2-best-games</link>
      <pubDate>2025-12-31T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=845401</guid>
      <description>2025 was a big year for gaming, and that includes gaming hardware. Nintendo launched its Switch 2 console in June, and since then, numerous Switch 2 titles and noteworthy updates for original Switch games have launched. These include brand-new Nintendo experiences like Mario Kart World and Donkey Kong Bananza, as well as some belated but [&#8230;]</description>
    </item>
    <item>
      <title>I'm a phones expert, and these are my 5 tech resolutions for 2026 &#8211; from taking better photos to playing more Fortnite</title>
      <link>https://www.techradar.com/phones/im-a-phones-expert-and-these-are-my-5-tech-resolutions-for-2026-from-taking-better-photos-to-playing-more-fortnite</link>
      <pubDate>Wed, 31 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">4gFS48sBFDrhY8iPrAuLYK</guid>
      <description>In my quest for self-improvement, I&#8217;ve discovered that I need more Victory Royales &#8211; here are my 5 smartphone resolutions for 2026.</description>
    </item>
    <item>
      <title>Microsoft in 2025: year in review</title>
      <link>https://www.techradar.com/computing/windows/microsoft-in-2025-year-in-review</link>
      <pubDate>Wed, 31 Dec 2025 12:45:00 +0000</pubDate>
      <guid isPermaLink="false">uBKvK5hHARQFhhMu7rWyg</guid>
      <description>Microsoft doubled-down on AI this year, and the resulting backlash marked one of the biggest stumbles for the company.</description>
    </item>
    <item>
      <title>Ce grand t&#233;l&#233;viseur de 75&#8243; QLED sign&#233; Xiaomi avec du Dolby Audio, HDR10+ et du 120 Hz pour le jeu perd plus de 300 &#8364; de son prix</title>
      <link>https://www.frandroid.com/bons-plans/2924215_ce-grand-televiseur-de-75-qled-signe-xiaomi-avec-du-dolby-audio-hdr10-et-du-120-hz-pour-le-jeu-perd-plus-de-300-e-de-son-prix</link>
      <pubDate>Wed, 31 Dec 2025 12:41:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2924215_ce-grand-televiseur-de-75-qled-signe-xiaomi-avec-du-dolby-audio-hdr10-et-du-120-hz-pour-le-jeu-perd-plus-de-300-e-de-son-prix</guid>
      <description>
Si l&#8217;envie d&#8217;agrandir s&#233;rieusement l&#8217;&#233;cran qui rythme vos soir&#233;es se fait sentir sans faire exploser le budget, le Xiaomi QLED A Pro 75" coche beaucoup de cases. Une fiche technique solide, une dalle de qualit&#233; et un tarif qui fait mal &#224; la concurrence : 639 euros sur PC Componentes, contre 999 euros &#224; son lancement.
</description>
    </item>
    <item>
      <title>Factor Meal Delivery Promo: Free $200 Withings Body-Scan Scale</title>
      <link>https://www.wired.com/story/factor-withings-deal/</link>
      <pubDate>Wed, 31 Dec 2025 12:31:00 +0000</pubDate>
      <guid isPermaLink="false">6949ad42d9e065212f7d60cb</guid>
      <description>Factor meal kits offer a free $200 Withings body-scanning scale after a three-week subscription. I was afraid, then maybe a little motivated?</description>
    </item>
    <item>
      <title>The Samsung Galaxy S26 design may have leaked in a new hands-on video &#8212; with a price hike also rumored</title>
      <link>https://www.techradar.com/phones/samsung-galaxy-phones/the-samsung-galaxy-s26-design-may-have-leaked-in-a-new-hands-on-video-with-a-price-hike-also-rumored</link>
      <pubDate>Wed, 31 Dec 2025 12:30:00 +0000</pubDate>
      <guid isPermaLink="false">ia3LKRmQxyuWPRSVrJWziT</guid>
      <description>We've got some fresh leaks around the Galaxy S26 handsets, which are expected around February time.</description>
    </item>
  </channel>
</rss>
