<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 07 Jan 2026 09:32:55 GMT</lastBuildDate>
    <item>
      <title>PlayStation : Sony d&#233;pose un brevet pour que l&#8217;IA finisse vos jeux &#224; votre place</title>
      <link>https://www.frandroid.com/marques/sony/2932477_playstation-sony-depose-un-brevet-pour-que-lia-finisse-vos-jeux-a-votre-place</link>
      <pubDate>Wed, 07 Jan 2026 09:31:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2932477_playstation-sony-depose-un-brevet-pour-que-lia-finisse-vos-jeux-a-votre-place</guid>
      <description>
Un brevet d&#233;pos&#233; par Sony d&#233;voile les contours d&#8217;un futur dans lequel des assistants IA pourraient faire office de guides fant&#244;mes pour aider les joueurs &#224; traverser certaines parties de jeux.
</description>
    </item>
    <item>
      <title>Les Soldes d&#8217;hiver 2026 commencent fort avec -50% sur le Mova Z50 Ultra, un aspirateur robot laveur &#224; eau chaude 36&#176; in&#233;dit</title>
      <link>https://www.frandroid.com/bons-plans/2930221_les-soldes-dhiver-2026-commencent-fort-avec-50-sur-le-mova-z50-ultra-un-aspirateur-robot-laveur-a-eau-chaude-36-inedit</link>
      <pubDate>Wed, 07 Jan 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930221_les-soldes-dhiver-2026-commencent-fort-avec-50-sur-le-mova-z50-ultra-un-aspirateur-robot-laveur-a-eau-chaude-36-inedit</guid>
      <description>
Le Mova Z50 Ultra est un aspirateur laveur haut de gamme avec une puissance d'aspiration record de 19 000 Pa et un syst&#232;me de lavage innovant Hydro Sync. Il est sold&#233; &#224; 599 euros pour les Soldes Fnac et Darty, au lieu de 1 199 euros.
</description>
    </item>
    <item>
      <title>Lave-biberons Anker Eufy : le luxe ultime des parents &#233;puis&#233;s et fortun&#233;s</title>
      <link>https://www.frandroid.com/events/ces/2932803_lave-biberons-anker-eufy-le-luxe-ultime-des-parents-epuises-et-fortunes</link>
      <pubDate>Wed, 07 Jan 2026 09:29:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/events/ces/2932803_lave-biberons-anker-eufy-le-luxe-ultime-des-parents-epuises-et-fortunes</guid>
      <description>
La "taxe fatigue" des jeunes parents vient de trouver son nouveau roi. Le Eufy Bottle Washer S1 Pro d&#233;barque avec une promesse simple : ne plus jamais toucher un goupillon de votre vie. Pour 469 &#8364;, cet engin promet de laver, st&#233;riliser et s&#233;cher 8 biberons en 40 minutes. C'est cher pay&#233; le sommeil, mais &#231;a se regarde.
</description>
    </item>
    <item>
      <title>On a vu l&#8217;&#233;cran de ce PC portable s&#8217;agrandir tout seul : voici le nouveau concept bluffant de Lenovo</title>
      <link>https://www.frandroid.com/marques/lenovo/2932653_on-a-vu-lecran-de-ce-pc-portable-sagrandir-tout-seul-voici-le-nouveau-concept-bluffant-de-lenovo</link>
      <pubDate>Wed, 07 Jan 2026 09:27:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lenovo/2932653_on-a-vu-lecran-de-ce-pc-portable-sagrandir-tout-seul-voici-le-nouveau-concept-bluffant-de-lenovo</guid>
      <description>
Lors du CES 2026 de Las Vegas, Lenovo a d&#233;voil&#233; le Legion Pro Rollable Concept, un PC portable dont l'&#233;cran peut s'&#233;tirer physiquement pour atteindre une diagonale de 24 pouces. 
</description>
    </item>
    <item>
      <title>Voici les voitures &#233;lectriques qui se vendent le mieux en occasion : la Renault Zo&#233; ind&#233;tr&#244;nable</title>
      <link>https://www.frandroid.com/marques/renault/2932461_voici-les-voitures-electriques-qui-se-vendent-le-mieux-en-occasion-la-renault-zoe-indetronable</link>
      <pubDate>Wed, 07 Jan 2026 09:21:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2932461_voici-les-voitures-electriques-qui-se-vendent-le-mieux-en-occasion-la-renault-zoe-indetronable</guid>
      <description>
Le site AutoScout24 vient de publier son rapport sur le march&#233; de l&#8217;occasion en 2025. Et au classement des voitures &#233;lectriques les plus vendues en France, c&#8217;est une citadine tricolore qui arrive sur la plus haute marche du podium : la Renault Zo&#233;.
</description>
    </item>
    <item>
      <title>Galaxy S26&#160;: la date de l&#8217;Unpacked aurait fuit&#233;, et il va falloir &#234;tre patient</title>
      <link>https://www.01net.com/actualites/galaxy-s26-date-unpacked-aurait-fuite-va-falloir-etre-patient.html</link>
      <pubDate>Wed, 07 Jan 2026 09:16:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318520</guid>
      <description>Samsung d&#233;calerait le lancement de sa gamme Galaxy S26, rompant ainsi avec ses habituels lancements du mois de janvier. Un d&#233;lai qui pourrait s'expliquer par une r&#233;organisation strat&#233;gique de la gamme.</description>
    </item>
    <item>
      <title>The AI bubble &#8211; it will burst, but AI will still be here</title>
      <link>https://www.techradar.com/pro/the-ai-bubble-it-will-burst-but-ai-will-still-be-here</link>
      <pubDate>Wed, 07 Jan 2026 09:08:27 +0000</pubDate>
      <guid isPermaLink="false">AhFmRGuM4ryi9HbY2CMqYM</guid>
      <description>AI isn&#8217;t a bubble; it&#8217;s a technological shift on the scale of the internet or electricity, and you can&#8217;t uninvent intelligence.</description>
    </item>
    <item>
      <title>Razer veut sa part du g&#226;teau de l&#8217;IA et lance un monstre &#224; 4 GPU qui n&#8217;est pas pour vous</title>
      <link>https://www.frandroid.com/marques/razer/2932515_razer-veut-sa-part-du-gateau-de-lia-et-lance-un-monstre-a-4-gpu-qui-nest-pas-pour-vous</link>
      <pubDate>Wed, 07 Jan 2026 09:06:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/razer/2932515_razer-veut-sa-part-du-gateau-de-lia-et-lance-un-monstre-a-4-gpu-qui-nest-pas-pour-vous</guid>
      <description>
C'est le pivot classique du moment, ou presque. Razer, le roi du lifestyle gamer, s'attaque au monde professionnel. Avec le Razer Forge, la marque d&#233;voile une station de travail Threadripper Pro pens&#233;e pour l'entra&#238;nement d'IA. C'est certainement de l'argent facile en 2026.
</description>
    </item>
    <item>
      <title>Premi&#232;re faille Chrome de 2026&#160;: Google d&#233;ploie un correctif, installez la mise &#224; jour</title>
      <link>https://www.01net.com/actualites/premiere-faille-chrome-de-2026-google-deploie-un-correctif-installez-la-mise-a-jour.html</link>
      <pubDate>Wed, 07 Jan 2026 09:01:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318510</guid>
      <description>Google d&#233;marre 2026 avec une premi&#232;re alerte s&#233;curit&#233; sur Chrome. Le g&#233;ant am&#233;ricain corrige en effet une faille jug&#233;e de gravit&#233; &#233;lev&#233;e dans WebView. L'&#233;diteur d&#233;ploie une mise &#224; jour d'urgence pour prot&#233;ger ses utilisateurs.</description>
    </item>
    <item>
      <title>Xiaomi Redmi Pad 2 Pro : voici une tablette performante avec &#233;cran 120 Hz sold&#233;e &#224; moins de 300 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2930605_xiaomi-redmi-pad-2-pro-voici-une-tablette-performante-avec-ecran-120-hz-soldee-a-moins-de-300-e</link>
      <pubDate>Wed, 07 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930605_xiaomi-redmi-pad-2-pro-voici-une-tablette-performante-avec-ecran-120-hz-soldee-a-moins-de-300-e</guid>
      <description>
La Xiaomi Redmi Pad 2 Pro est une tablette milieu de gamme qui a fait son arriv&#233;e sur le march&#233; en 2025. Simple, polyvalente mais aussi et surtout performante, elle est affich&#233;e &#224; 299,99 euros au lieu de 349,99 euros &#224; la Fnac et chez Darty pendant les soldes d'hiver.
</description>
    </item>
    <item>
      <title>Le Wi-Fi 8 est d&#233;j&#224; au CES 2026, &#224; ce rythme-l&#224;, le Wi-Fi 14 sera pr&#233;sent&#233; avant vendredi midi</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/routeur/2932625_le-wi-fi-8-est-deja-au-ces-2026-a-ce-rythme-la-le-wi-fi-14-sera-presente-avant-vendredi-midi</link>
      <pubDate>Wed, 07 Jan 2026 08:48:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/routeur/2932625_le-wi-fi-8-est-deja-au-ces-2026-a-ce-rythme-la-le-wi-fi-14-sera-presente-avant-vendredi-midi</guid>
      <description>
Vous venez &#224; peine de comprendre l'int&#233;r&#234;t du Wi-Fi 6E, peut-&#234;tre m&#234;me que vous lorgnez sur le Wi-Fi 7. Oubliez tout. Au CES 2026, l'industrie a d&#233;cid&#233; d'acc&#233;l&#233;rer le temps : le Wi-Fi 8 est d&#233;j&#224; l&#224;. Enfin, "l&#224;", c'est vite dit.
</description>
    </item>
    <item>
      <title>Xiaomi am&#233;liore consid&#233;rablement sa SU7 &#233;lectrique : 900 km d&#8217;autonomie pour moins de 30 000 &#8364;</title>
      <link>https://www.frandroid.com/marques/xiaomi/2932405_xiaomi-ameliore-considerablement-sa-su7-electrique-900-km-dautonomie-pour-moins-de-30-000-e</link>
      <pubDate>Wed, 07 Jan 2026 08:48:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2932405_xiaomi-ameliore-considerablement-sa-su7-electrique-900-km-dautonomie-pour-moins-de-30-000-e</guid>
      <description>
Xiaomi profite du d&#233;but d&#8217;ann&#233;e 2026 pour apporter quelques am&#233;liorations &#224; sa SU7. La voiture &#233;lectrique restyl&#233;e gagne en vitesse de charge, en autonomie et en puissance. Si les tarifs augmentent, ils restent sous les 30 000 euros.
</description>
    </item>
    <item>
      <title>CES 2026 live updates: See the latest news, surprises, and strange tech from LG, Samsung, Lego, and new startups</title>
      <link>https://mashable.com/live/ces-2026-news-live-updates</link>
      <pubDate>Wed, 07 Jan 2026 08:48:05 +0000</pubDate>
      <guid isPermaLink="false">00HdPGMgSorg1E6HI6usOJ2</guid>
      <description>CES 2026 is finally here, and Mashable reporters are on the ground looking for the best in show. Get live updates from the showroom floor and behind the scenes.</description>
    </item>
    <item>
      <title>Galaxy S24 : l&#8217;ancienne gloire de Samsung est &#224; son plus bas prix historique pour les soldes sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2875381_galaxy-s24-lancienne-gloire-de-samsung-est-a-son-plus-bas-prix-historique-pour-les-soldes-sur-amazon</link>
      <pubDate>Wed, 07 Jan 2026 08:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2875381_galaxy-s24-lancienne-gloire-de-samsung-est-a-son-plus-bas-prix-historique-pour-les-soldes-sur-amazon</guid>
      <description>
Le Samsung Galaxy S24 a beau avoir &#233;t&#233; d&#233;pass&#233; par le Galaxy S25 et le nouveau S26 ne devrait m&#234;me pas tarder &#224; pointer le bout de son nez, l'ancien fleuron de 2024 de la marque a encore de beaux jours devant lui. Il pourrait en plus convenir &#224; celles et ceux qui ont un budget trop restreint pour les flagships r&#233;cents, puisqu'il est affich&#233; &#224; seulement 489 euros pour les soldes sur Amazon.
...</description>
    </item>
    <item>
      <title>Razer Project AVA : le Tamagotchi du futur est une &#171;&#160;waifu&#160;&#187; holographique qui vous juge quand vous jouez</title>
      <link>https://www.frandroid.com/marques/2932591_razer-project-ava-le-tamagotchi-du-futur-est-une-waifu-holographique-qui-vous-juge-quand-vous-jouez</link>
      <pubDate>Wed, 07 Jan 2026 08:34:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2932591_razer-project-ava-le-tamagotchi-du-futur-est-une-waifu-holographique-qui-vous-juge-quand-vous-jouez</guid>
      <description>
C'est un peu effrayant. Razer vient de d&#233;voiler Project AVA, un compagnon IA enferm&#233; dans un &#233;cran transparent de 5,5 pouces. Il tourne sous Grok (xAI), analyse votre &#233;cran en temps r&#233;el et promet de vous aider &#224; gagner vos parties class&#233;es.
</description>
    </item>
    <item>
      <title>Ce casque tr&#232;s ing&#233;nieux se transforme en enceinte Bluetooth : voici comment</title>
      <link>https://www.frandroid.com/produits-android/audio/2932295_ce-casque-tres-ingenieux-se-transforme-en-enceinte-bluetooth-voici-comment</link>
      <pubDate>Wed, 07 Jan 2026 08:34:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/audio/2932295_ce-casque-tres-ingenieux-se-transforme-en-enceinte-bluetooth-voici-comment</guid>
      <description>
J'ai pu essayer un casque audio unique en son genre puisqu'il se transforme en enceinte Bluetooth par un simple geste. Voici le TDM Neo.
</description>
    </item>
    <item>
      <title>Fin de l&#8217;ADSL : Orange accorde un sursis inattendu &#224; des millions de foyers fran&#231;ais</title>
      <link>https://www.frandroid.com/marques/orange/2932521_fin-de-ladsl-orange-accorde-un-sursis-inattendu-a-des-millions-de-foyers-francais</link>
      <pubDate>Wed, 07 Jan 2026 08:32:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/orange/2932521_fin-de-ladsl-orange-accorde-un-sursis-inattendu-a-des-millions-de-foyers-francais</guid>
      <description>
Apr&#232;s un tempo soutenu ces derni&#232;res ann&#233;es, le rythme de d&#233;ploiement de la fibre a largement baiss&#233; ces derniers mois, &#224; tel point qu&#8217;Orange vient de repousser son calendrier de fermeture de l&#8217;ADSL d&#8217;un an pour des milliers de communes.
</description>
    </item>
    <item>
      <title>Razer enferme un compagnon IA dans un bocal connect&#233; avec son &#233;trange projet Ava</title>
      <link>https://www.01net.com/actualites/razer-enferme-un-compagnon-ia-dans-un-bocal-connecte-avec-son-etrange-projet-ava.html</link>
      <pubDate>Wed, 07 Jan 2026 08:30:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318498</guid>
      <description>Amusant ou glauque, chacun aura son opinion sur le projet Ava, derni&#232;re folie sign&#233;e Razer qui enferme un bot IA dans une sorte de bocal connect&#233;. Les compagnons propos&#233;s, d'un go&#251;t plus ou moins douteux, donnent des conseils sur tous les sujets, y compris pour jouer plus efficacement.</description>
    </item>
    <item>
      <title>Philips Hue Will Soon Let Your Lights Work Together for Scenes</title>
      <link>https://gizmodo.com/philips-hue-will-soon-let-your-lights-work-together-for-scenes-2000706444</link>
      <pubDate>Wed, 07 Jan 2026 08:30:20 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000706444</guid>
      <description>It's now far easier to set grouped Philips Hue lights up in scenes.</description>
    </item>
    <item>
      <title>It turns out I&#8217;ve been using my Hue lights all wrong</title>
      <link>https://www.theverge.com/tech/857250/philips-hue-spatial-aware-smart-lighting-feature</link>
      <pubDate>2026-01-07T03:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=857250</guid>
      <description>Color-changing lights are a lot of fun, but it can be hard to figure out how to best use them in your home. Most smart lighting companies offer pre-designed scenes to help you light your space, but the lights don't know where they are physically in your home, and the effect can get diluted. Philips [&#8230;]</description>
    </item>
    <item>
      <title>The Philips Hue app can now customize lighting scenes so they suit the layout of your rooms</title>
      <link>https://www.techradar.com/home/smart-lights/the-philips-hue-app-can-now-customize-lighting-scenes-so-they-suit-the-layout-of-your-rooms</link>
      <pubDate>Wed, 07 Jan 2026 08:30:00 +0000</pubDate>
      <guid isPermaLink="false">xfEjXAbzHoKKZWrpFT5Uwf</guid>
      <description>Hue SpatialAware is a new augmented reality feature that considers the location of your bulbs and lamps when applying a scene.</description>
    </item>
    <item>
      <title>Gr&#226;ce aux Soldes 2026 cette cam&#233;ra de surveillance 2K motoris&#233;e avec d&#233;tection et suivi co&#251;te moins de 20 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2931529_grace-aux-soldes-2026-cette-camera-de-surveillance-2k-motorisee-avec-detection-et-suivi-coute-moins-de-20-e</link>
      <pubDate>Wed, 07 Jan 2026 08:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931529_grace-aux-soldes-2026-cette-camera-de-surveillance-2k-motorisee-avec-detection-et-suivi-coute-moins-de-20-e</guid>
      <description>
Pendant les Soldes d'hiver 2026, vous pouvez vous procurer la petite cam&#233;ra motoris&#233;e TP-Link Tapo TC71 pour seulement 19,99 euros au lieu de 39,99 euros.
</description>
    </item>
    <item>
      <title>EarFun Air Pro 4+ : traduction IA et son Lossless &#224; moins de 100 euros : le nouveau challenger du milieu de gamme ? [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/2931115_earfun-air-pro-4-traduction-ia-et-son-lossless-a-moins-de-100-euros-le-nouveau-challenger-du-milieu-de-gamme</link>
      <pubDate>Wed, 07 Jan 2026 08:24:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2931115_earfun-air-pro-4-traduction-ia-et-son-lossless-a-moins-de-100-euros-le-nouveau-challenger-du-milieu-de-gamme</guid>
      <description>
Est-il n&#233;cessaire de d&#233;penser 200 ou 300 euros dans une paire d&#8217;&#233;couteurs pour profiter d&#8217;un son de qualit&#233; ? EarFun a la r&#233;ponse et c&#8217;est non. Avec ses Air Pro 4+, la marque propose pour moins de 100 euros non seulement des &#233;couteurs de tr&#232;s bonne facture, mais aussi un traducteur instantan&#233; IA.&#160;
</description>
    </item>
    <item>
      <title>Windows 11 affiche les applis Android de votre smartphone en plein &#233;cran sur votre PC</title>
      <link>https://www.01net.com/actualites/windows-11-affiche-les-applis-android-de-votre-smartphone-en-plein-ecran-sur-votre-pc.html</link>
      <pubDate>Wed, 07 Jan 2026 08:19:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318512</guid>
      <description>Microsoft vient de mettre &#224; jour son application Mobile connect&#233;. L&#8217;utilitaire est maintenant capable d&#8217;afficher les applications Android de votre smartphone sur la quasi-totalit&#233; de l&#8217;&#233;cran de votre PC.</description>
    </item>
    <item>
      <title>G&#233;n&#233;ration et diffusion d&#8217;images sexuelles ill&#233;gales&#160;: Grok vis&#233; par des r&#233;gulateurs partout dans le monde</title>
      <link>https://www.01net.com/actualites/generation-et-diffusion-dimages-sexuelles-illegales-grok-vise-par-des-regulateurs-partout-dans-le-monde.html</link>
      <pubDate>Wed, 07 Jan 2026 08:02:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318496</guid>
      <description>La g&#233;n&#233;ration d'images p&#233;dopornographiques par Grok ainsi que la capacit&#233; du bot &#224; cr&#233;er et &#224; diffuser des images &#224; caract&#232;re sexuel non consenties risquent d'&#234;tre une grosse &#233;pine dans le pied d'Elon Musk. Plusieurs juridictions, aux &#201;tats-Unis, en Europe et ailleurs dans le monde, ont l'intention de lancer des enqu&#234;tes sur ces pratiques.</description>
    </item>
    <item>
      <title>CES Live Blog, Day 3: Even More of the Coolest Tech We&#8217;ve Seen</title>
      <link>https://www.wired.com/live/ces-2026-live-blog/</link>
      <pubDate>Wed, 07 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">6957fd7ea2ad6e107579ae74</guid>
      <description>Read our live updates from CES 2026 in Las Vegas to see the latest consumer gadgetry in all of its chatbot-enabled, sensor-packed, AI-infused glory.</description>
    </item>
    <item>
      <title>Fallout Season 2, episode 4 unveils mighty beast from the games</title>
      <link>https://mashable.com/article/fallout-deathclaw-tv-series</link>
      <pubDate>Wed, 07 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">06eZBD7RLMeKfXnvjja3X5z</guid>
      <description>'Fallout' Season 2, episode 4: One of "Fallout"s mightiest foes, the Deathclaw, is here.</description>
    </item>
  </channel>
</rss>
