<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 02 Jan 2026 09:29:27 GMT</lastBuildDate>
    <item>
      <title>Nothing CMF Buds Pro 2 : ces &#233;couteurs avec ANC sont &#224; prix cass&#233; sur Amazon (-34%)</title>
      <link>https://www.frandroid.com/bons-plans/2557733_nothing-cmf-buds-pro-2-ces-ecouteurs-avec-anc-sont-a-prix-casse-sur-amazon-34</link>
      <pubDate>Fri, 02 Jan 2026 09:10:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2557733_nothing-cmf-buds-pro-2-ces-ecouteurs-avec-anc-sont-a-prix-casse-sur-amazon-34</guid>
      <description>
Les CMF Buds Pro 2 de Nothing sont des &#233;couteurs sans fil &#224; r&#233;duction de bruit active qui affichent un excellent rapport qualit&#233;-prix, mais ils deviennent carr&#233;ment imbattables avec cette promo Amazon : ils passent &#224; 42 euros au lieu de 64 euros, une belle ristourne pour s&#8217;offrir une paire d'&#233;couteurs avec ANC sans se ruiner. 
</description>
    </item>
    <item>
      <title>Samsung adds much needed brightness to its Freestyle projector</title>
      <link>https://www.theverge.com/news/852545/samsung-adds-much-needed-brightness-to-its-freestyle-projector</link>
      <pubDate>2026-01-02T03:30:17-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=852545</guid>
      <description>The Freestyle Plus all-in-one portable projector features 430 ISO Lumens, or "nearly twice the brightness of the previous generation," according to Samsung. Great! But also a little strange since both the original and second generation Freestyle projectors listed "550 lumens" on their respective spec sheets. See, projector makers are notorious for playing fast and loose [&#8230;]...</description>
    </item>
    <item>
      <title>Les 18 voitures &#233;lectriques qu&#8217;on attend le plus en 2026 : des citadines aux berlines &#224; 800 km d&#8217;autonomie</title>
      <link>https://www.frandroid.com/survoltes/2923619_les-18-voitures-electriques-quon-attend-le-plus-en-2026-des-citadines-aux-berlines-a-800-km-dautonomie</link>
      <pubDate>Fri, 02 Jan 2026 08:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2923619_les-18-voitures-electriques-quon-attend-le-plus-en-2026-des-citadines-aux-berlines-a-800-km-dautonomie</guid>
      <description>
Voici les 18 voitures &#233;lectriques les plus attendues de 2026. De la Polo de Volkswagen &#224; la Ferrari Elettrica en passant par la Dacia Spring sur base Twingo, on a list&#233; les mod&#232;les qui devraient apporter du renouveau dans de nombreux segments.
</description>
    </item>
    <item>
      <title>BYD, MG, Xpeng : la part de march&#233; r&#233;elle des voitures chinoises en France va vous surprendre</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2925223_byd-mg-xpeng-la-part-de-marche-reelle-des-voitures-chinoises-en-france-va-vous-surprendre</link>
      <pubDate>Fri, 02 Jan 2026 08:25:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2925223_byd-mg-xpeng-la-part-de-marche-reelle-des-voitures-chinoises-en-france-va-vous-surprendre</guid>
      <description>
Il va falloir arr&#234;ter de se faire peur. On nous annon&#231;ait un tsunami de voitures chinoises sur nos routes, une d&#233;ferlante qui allait balayer Peugeot et Renault. On a les chiffres 2025 sous les yeux et la r&#233;alit&#233; est cruelle : le raz-de-mar&#233;e est une flaque d'eau.
</description>
    </item>
    <item>
      <title>Hack de la PS5&#160;? La console de Sony vient de d&#233;voiler son plus grand secret, plus rien ne sera comme avant</title>
      <link>https://www.01net.com/actualites/hack-de-la-ps5-la-console-de-sony-vient-de-devoiler-son-plus-grand-secret-plus-rien-ne-sera-comme-avant.html</link>
      <pubDate>Fri, 02 Jan 2026 08:06:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317789</guid>
      <description>La fuite des cl&#233;s ROM est un &#233;norme probl&#232;me pour la console de Sony et probablement le plus grand hack de son histoire.</description>
    </item>
    <item>
      <title>The best laptops for gaming and schoolwork in 2026</title>
      <link>https://www.engadget.com/computing/laptops/best-laptops-for-gaming-and-school-132207352.html?src=rss</link>
      <pubDate>Fri, 02 Jan 2026 08:00:35 +0000</pubDate>
      <guid isPermaLink="false">c44e3a73-1758-3e29-8212-bf6cf9045a41</guid>
      <description>A good laptop for both gaming and schoolwork strikes a balance that goes beyond raw power. It should handle essays and research during the day, then jump into your favorite games when you are ready to take a break. That mix is easier to find now, with more laptops offering capable GPUs, solid battery life and designs that do not look out of place in a classroom.Whether you want a budget gaming laptop for lighter titles or a more powerful system that can run demanding games, there is something that fits just about every schedule and workload. We rounded up the best laptops for gaming and school...</description>
    </item>
    <item>
      <title>Petkit&#8217;s first automatic wet food feeder keeps track of how much your pet eats</title>
      <link>https://www.theverge.com/news/850992/petkit-ai-camera-yumshare-daily-feast-automatic-wet-food-feeder-eversweet-ultra-fountain</link>
      <pubDate>2026-01-02T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=850992</guid>
      <description>Petkit has announced two new automated machines at CES 2026 designed to feed and care for your pets using AI-powered cameras that track their behavior and provide health insights that may otherwise go unnoticed. Launching sometime in April 2026, the Petkit Yumshare Daily Feast is one of the first automatic dispensers that works with wet [&#8230;]</description>
    </item>
    <item>
      <title>Plaques roses, hausse du carburant, bonus &#233;cologique : tout ce qui change pour les conducteurs en 2026</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/voiture-hydrogene/2923541_plaques-roses-hausse-du-carburant-bonus-ecologique-tout-ce-qui-change-pour-les-conducteurs-en-2026</link>
      <pubDate>Fri, 02 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/voiture-hydrogene/2923541_plaques-roses-hausse-du-carburant-bonus-ecologique-tout-ce-qui-change-pour-les-conducteurs-en-2026</guid>
      <description>
Le passage &#224; l'ann&#233;e 2026 s'accompagne de plusieurs modifications l&#233;gislatives impactant les automobilistes en France. Entre la r&#233;vision des bar&#232;mes du malus &#233;cologique, l'&#233;volution de la fiscalit&#233; sur les carburants et le renforcement du contr&#244;le technique pour certains v&#233;hicules, voici un point complet sur les nouvelles r&#232;gles en vigueur.
</description>
    </item>
    <item>
      <title>Test du Bosch Spotless Max : que vaut le robot aspirateur laveur du g&#233;ant allemand de l&#8217;&#233;lectrom&#233;nager ?</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/robot-aspirateur/2920937_test-du-bosch-spotless-max-que-vaut-le-robot-aspirateur-laveur-du-geant-allemand-de-lelectromenager</link>
      <pubDate>Fri, 02 Jan 2026 07:55:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/robot-aspirateur/2920937_test-du-bosch-spotless-max-que-vaut-le-robot-aspirateur-laveur-du-geant-allemand-de-lelectromenager</guid>
      <description>
Bosch se lance enfin s&#233;rieusement dans la bataille des aspirateurs robots tout-en-un. Pour ce faire, le g&#233;ant allemand a choisi une strat&#233;gie pragmatique : plut&#244;t que de r&#233;inventer la roue, il s'est associ&#233; au savoir-faire d'Ecovacs. Le r&#233;sultat ? La gamme Spotless Max, qui reprend l'excellente base technique du Deebot T30S, mais l'int&#232;gre dans l'&#233;cosyst&#232;me de Bosch. Une alliance prometteuse sur le papier, mais qu'en est-il &#224; l'usage ?
...</description>
    </item>
    <item>
      <title>Samsung Galaxy Fit 3 et Buds FE : le pack des bonnes r&#233;solutions sportives revient &#224; moins de 50 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2924755_samsung-galaxy-fit-3-et-buds-fe-le-pack-des-bonnes-resolutions-sportives-revient-a-moins-de-50-e</link>
      <pubDate>Fri, 02 Jan 2026 07:43:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2924755_samsung-galaxy-fit-3-et-buds-fe-le-pack-des-bonnes-resolutions-sportives-revient-a-moins-de-50-e</guid>
      <description>
Pour reprendre le sport, SFR sort un coup malin avec un pack r&#233;unissant le Samsung Galaxy Fit 3 et les Samsung Galaxy Buds FE : le tout passe de 129,99 &#8364; &#224; 99,99 &#8364;, et gr&#226;ce &#224; une ODR, les clients box RED by SFR et SFR peuvent m&#234;me repartir avec le bundle &#224; 49,99 &#8364;.
</description>
    </item>
  </channel>
</rss>
