<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 30 Dec 2025 08:35:23 GMT</lastBuildDate>
    <item>
      <title>The Frame, le t&#233;l&#233;viseur tableau de Samsung a enfin un rival &#224; sa hauteur&#160;: Gallery TV de LG</title>
      <link>https://www.01net.com/actualites/the-frame-le-televiseur-tableau-de-samsung-a-enfin-un-rival-a-sa-hauteur-gallery-tv-de-lg.html</link>
      <pubDate>Tue, 30 Dec 2025 08:11:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317584</guid>
      <description>LG va tenter de rivaliser avec le The Frame de Samsung sur le march&#233; des TV d&#233;coratifs. Son prochain mod&#232;le Gallery TV d&#233;voil&#233; lors du CES fait un choix technologique diff&#233;rent pour bousculer le march&#233;.</description>
    </item>
    <item>
      <title>25 jours d&#8217;autonomie pour moins de 170 &#8364; : cette nouvelle montre de sport frappe tr&#232;s fort</title>
      <link>https://www.frandroid.com/marques/amazfit/2921829_25-jours-dautonomie-pour-moins-de-170-e-cette-nouvelle-montre-de-sport-frappe-tres-fort</link>
      <pubDate>Tue, 30 Dec 2025 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amazfit/2921829_25-jours-dautonomie-pour-moins-de-170-e-cette-nouvelle-montre-de-sport-frappe-tres-fort</guid>
      <description>
Amazfit a d&#233;voil&#233;, ce mardi, sa nouvelle montre de sport pas ch&#232;re, l'Amazfit Active Max. Celle-ci profite d'une autonomie plus que confortable, d'un &#233;cran Amoled et d'un prix particuli&#232;rement accessible. 
</description>
    </item>
    <item>
      <title>La PS6 pourrait bien prendre du retard&#8230; &#224; cause de l&#8217;IA</title>
      <link>https://www.frandroid.com/marques/sony/2922673_la-ps6-pourrait-bien-prendre-du-retard-a-cause-de-lia</link>
      <pubDate>Tue, 30 Dec 2025 07:53:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2922673_la-ps6-pourrait-bien-prendre-du-retard-a-cause-de-lia</guid>
      <description>
La crise de la RAM caus&#233;e par le boom de l'IA pourrait avoir de lourdes cons&#233;quences sur le jeu vid&#233;o. Sony r&#233;fl&#233;chirait &#224; repousser la sortie de sa prochaine console.
</description>
    </item>
    <item>
      <title>Netflix gratuit ? Ce site gratuit permet de regarder 4 000 films en streaming l&#233;galement</title>
      <link>https://www.frandroid.com/services/svod/2922725_netflix-gratuit-ce-site-gratuit-permet-de-regarder-4-000-films-en-streaming-legalement</link>
      <pubDate>Tue, 30 Dec 2025 07:48:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/svod/2922725_netflix-gratuit-ce-site-gratuit-permet-de-regarder-4-000-films-en-streaming-legalement</guid>
      <description>
Vous avez vu l'&#233;tat de votre facture de streaming ce mois-ci ? &#199;a fait mal. Alors quand une plateforme d&#233;barque avec 4 000 films gratuits, sans inscription et une interface impeccable, on tend l'oreille. WikiFlix ne remplacera pas Netflix pour la derni&#232;re s&#233;rie &#224; la mode, mais pour la culture, c'est une mine d'or.
</description>
    </item>
    <item>
      <title>LG revient sur le march&#233; des t&#233;l&#233;viseurs artistiques avec le Gallery TV</title>
      <link>https://www.frandroid.com/marques/lg/2922691_lg-revient-sur-le-marche-des-televiseurs-artistiques-avec-le-gallery-tv</link>
      <pubDate>Tue, 30 Dec 2025 07:40:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lg/2922691_lg-revient-sur-le-marche-des-televiseurs-artistiques-avec-le-gallery-tv</guid>
      <description>
LG pr&#233;sentera au CES 2026 son nouveau t&#233;l&#233;viseur Gallery TV, un mod&#232;le sp&#233;cifiquement con&#231;u pour se muer en tableau afin d&#8217;afficher des &#339;uvres d&#8217;art, &#224; la mani&#232;re des The Frame de Samsung et autres Tableau TV de TCL et Hisense.
</description>
    </item>
    <item>
      <title>Ce constructeur chinois tente le pari risqu&#233; de la console pliable : OLED et Android dans un gros &#233;tui &#224; lunettes</title>
      <link>https://www.frandroid.com/android/2922701_ce-constructeur-chinois-tente-le-pari-risque-de-la-console-pliable-oled-et-android-dans-un-gros-etui-a-lunettes</link>
      <pubDate>Tue, 30 Dec 2025 07:40:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/2922701_ce-constructeur-chinois-tente-le-pari-risque-de-la-console-pliable-oled-et-android-dans-un-gros-etui-a-lunettes</guid>
      <description>
C'est une premi&#232;re mondiale. Une console de jeu qui se plie en deux pour tenir dans la poche. La OneXSugar Wallet de OneXPlayer d&#233;barque avec une promesse : un &#233;cran OLED g&#233;ant de 8 pouces dans un ch&#226;ssis compact. 
</description>
    </item>
    <item>
      <title>L&#8217;IA est en train de tuer le mod&#232;le &#233;conomique des consoles de jeux et c&#8217;est un vrai probl&#232;me</title>
      <link>https://www.frandroid.com/produits-android/console/console-de-jeux/2922685_lia-est-en-train-de-tuer-le-modele-economique-des-consoles-de-jeux-et-cest-un-vrai-probleme</link>
      <pubDate>Tue, 30 Dec 2025 07:33:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/console-de-jeux/2922685_lia-est-en-train-de-tuer-le-modele-economique-des-consoles-de-jeux-et-cest-un-vrai-probleme</guid>
      <description>
L'intelligence artificielle est en train de cannibaliser le march&#233; du jeu vid&#233;o. Les g&#233;ants de la tech s'arrachent la m&#233;moire vive pour leurs serveurs, faisant exploser les co&#251;ts. R&#233;sultat ? La PlayStation 6 et la prochaine Xbox pourraient arriver plus tard que pr&#233;vu, ou co&#251;ter beaucoup plus cher.
</description>
    </item>
    <item>
      <title>OpenAI recherche son ange gardien de l&#8217;IA&#160;: un job bien pay&#233;&#8230; mais tr&#232;s stressant</title>
      <link>https://www.01net.com/actualites/openai-recherche-son-ange-gardien-de-lia-un-job-bien-paye-mais-tres-stressant.html</link>
      <pubDate>Tue, 30 Dec 2025 07:30:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317552</guid>
      <description>Le prochain responsable de la pr&#233;vention des risques chez OpenAI touchera un gros pactole&#8230; mais il devra aussi vivre sous une pression intense, dans une fonction particuli&#232;rement stressante. Toujours int&#233;ress&#233; ?</description>
    </item>
    <item>
      <title>La flamb&#233;e des prix de la RAM pourrait repousser le lancement de la PS6</title>
      <link>https://www.01net.com/actualites/la-flambee-des-prix-de-la-ram-pourrait-repousser-le-lancement-de-la-ps6.html</link>
      <pubDate>Tue, 30 Dec 2025 07:30:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317545</guid>
      <description>Un faisceau de signaux et de bruits de couloir cr&#233;dibles laissait penser au lancement de la prochaine g&#233;n&#233;ration PlayStation aux alentours de fin 2027. Mais les prix d&#233;lirants de la RAM pourraient pousser Sony &#224; reporter la commercialisation de sa future PS6, m&#234;me s'il est toujours d&#233;licat de parler de report quand le constructeur n'a rien annonc&#233;.</description>
    </item>
    <item>
      <title>On a ri de Bixby pendant des ann&#233;es, Samsung One UI 8.5 pourrait nous faire taire avec Perplexity</title>
      <link>https://www.frandroid.com/marques/samsung/2922669_on-a-ri-de-bixby-pendant-des-annees-samsung-one-ui-8-5-pourrait-nous-faire-taire-avec-perplexity</link>
      <pubDate>Tue, 30 Dec 2025 07:27:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2922669_on-a-ri-de-bixby-pendant-des-annees-samsung-one-ui-8-5-pourrait-nous-faire-taire-avec-perplexity</guid>
      <description>
Alors que Samsung affiche Google Gemini partout sur ses Galaxy S25, le cor&#233;en pr&#233;pare un coup en douce. La derni&#232;re b&#234;ta de One UI 8.5 r&#233;v&#232;le une fusion entre Bixby et Perplexity. L'objectif ? Rendre enfin l'assistant maison utile. Et cette fois, &#231;a pourrait marcher.
</description>
    </item>
    <item>
      <title>Amazon retire 30 % &#224; la nouvelle Bose SoundLink Plus, une enceinte puissante not&#233;e 8/10 par nos soins</title>
      <link>https://www.frandroid.com/bons-plans/2921989_amazon-retire-30-a-la-nouvelle-bose-soundlink-plus-une-enceinte-puissante-notee-8-10-par-nos-soins</link>
      <pubDate>Tue, 30 Dec 2025 07:24:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2921989_amazon-retire-30-a-la-nouvelle-bose-soundlink-plus-une-enceinte-puissante-notee-8-10-par-nos-soins</guid>
      <description>
La Bose SoundLink Plus constitue un excellent choix pour animer vos soir&#233;es : elle offre une exp&#233;rience sonore puissante, une autonomie remarquable et une qualit&#233; de fabrication irr&#233;prochable. Bonne nouvelle, la voil&#224; en promotion &#224; 199 euros au lieu de 279 euros &#224; sa sortie.
</description>
    </item>
    <item>
      <title>J&#8217;ai couru un trail de nuit avec les 2 meilleures montres de sport du moment&#160;: qui est le meilleur, Garmin ou Suunto&#160;?</title>
      <link>https://www.01net.com/actualites/test-comparatif-garmin-fenix8-pro-suunto-vertical-2-avis.html</link>
      <pubDate>Tue, 30 Dec 2025 07:15:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317535</guid>
      <description>Garmin ou Suunto ? Quelle montre de sport choisir que ce soit pour le trail, pour les sports outdoor, la montagne ou la mer ? Pour vous aider &#224; vous faire votre avis on a test&#233; les deux meilleurs mod&#232;les du moment lors d&#8217;un trail nocturne. Voici le test en conditions r&#233;elles.</description>
    </item>
    <item>
      <title>WhatsApp Web n&#8217;a toujours pas cette fonction essentielle</title>
      <link>https://www.01net.com/actualites/whatsapp-web-travaille-toujours-sur-ce-qui-lui-manque.html</link>
      <pubDate>Tue, 30 Dec 2025 07:04:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317573</guid>
      <description>La version Web de WhatsApp continue d'avancer sur les appels vocaux et vid&#233;o, qui seront accompagn&#233;s de r&#233;glages suppl&#233;mentaires pour mieux g&#233;rer les notifications.</description>
    </item>
    <item>
      <title>La Chine pose les bases de la r&#233;gulation la plus stricte au monde contre les d&#233;rives des &#171;&#160;compagnons&#160;&#187; IA</title>
      <link>https://www.01net.com/actualites/la-chine-pose-les-bases-de-la-regulation-la-plus-stricte-au-monde-contre-les-derives-des-compagnons-ia.html</link>
      <pubDate>Tue, 30 Dec 2025 07:00:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317543</guid>
      <description>La Chine prend &#224; bras le corps la probl&#233;matique de la sant&#233; mentale avec les chatbots IA. Les autorit&#233;s ont propos&#233; une s&#233;rie de r&#232;gles tr&#232;s contraignantes qui pourraient fortement limiter les capacit&#233;s de ChatGPT et des autres bots.</description>
    </item>
    <item>
      <title>6 ways to sneak &#8216;micro-creativity&#8217; into your workday in the new year</title>
      <link>https://www.fastcompany.com/91456755/6-ways-to-sneak-micro-creativity-into-your-workday-in-the-new-year</link>
      <pubDate>2025-12-30T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91456755/6-ways-to-sneak-micro-creativity-into-your-workday-in-the-new-year</guid>
      <description>We&#8217;ve optimized the joy out of work, leading to burnout. These playful practices can help you feel inspired again.
The irony of modern work life hits you somewhere between your third consecutive hybrid meeting and the moment you realize you&#8217;ve been holding your breath for the past hour. We&#8217;ve engineered every process for maximum output, yet reports consistently show that workplace burnout is affecting us more than ever....</description>
    </item>
    <item>
      <title>Vous n&#8217;aurez plus besoin de sonde colorim&#233;trique pour ce nouvel &#233;cran professionnel</title>
      <link>https://www.01net.com/actualites/vous-naurez-plus-besoin-de-sonde-colorimetrique-pour-ce-nouvel-ecran-professionnel.html</link>
      <pubDate>Tue, 30 Dec 2025 06:58:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315649</guid>
      <description>L&#8217;entreprise ta&#239;wanaise BenQ pr&#233;sente le moniteur 4K de 27 pouces pour les professionnels de l&#8217;image. Outre une performance promise de haute vol&#233;e, l&#8217;&#233;cran b&#233;n&#233;ficie d&#8217;une sonde colorim&#233;trique int&#233;gr&#233;e, mais aussi de nombreuses fonctions et accessoires comme une t&#233;l&#233;commande de contr&#244;le d&#233;di&#233;e.</description>
    </item>
  </channel>
</rss>
