<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 18 Dec 2025 07:26:27 GMT</lastBuildDate>
    <item>
      <title>Ce drone 4K brad&#233; &#224; -20 % sur Amazon est une bonne alternative &#224; DJI</title>
      <link>https://www.frandroid.com/bons-plans/2913941_ce-drone-4k-brade-a-20-sur-amazon-est-une-bonne-alternative-a-dji</link>
      <pubDate>Thu, 18 Dec 2025 07:23:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2913941_ce-drone-4k-brade-a-20-sur-amazon-est-une-bonne-alternative-a-dji</guid>
      <description>
Pas besoin d'exploser son budget pour avoir un petit drone qui filme en 4K : le Potensic ATOM 2 devient encore plus int&#233;ressant avec cette belle remise qui fait passer son prix initial de 329 euros &#224; 263 euros sur Amazon. 
</description>
    </item>
    <item>
      <title>La CAF aurait &#233;t&#233; pirat&#233;e : 22 millions de comptes fran&#231;ais dans la nature ?</title>
      <link>https://www.frandroid.com/culture-tech/securite-applications/2914333_la-caf-aurait-ete-piratee-22-millions-de-comptes-francais-dans-la-nature</link>
      <pubDate>Thu, 18 Dec 2025 07:21:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/securite-applications/2914333_la-caf-aurait-ete-piratee-22-millions-de-comptes-francais-dans-la-nature</guid>
      <description>
Une base de donn&#233;es de 22 millions de comptes de la CAF a &#233;t&#233; partag&#233;e sur le darkweb, mais la Caisse d'allocations familiales a-t-elle &#233;t&#233; vraiment pirat&#233;e ?
</description>
    </item>
    <item>
      <title>&#171; Apr&#232;s 3 ans de gal&#232;re, nous commen&#231;ons &#224; voir une reprise &#187; : Brompton et ses v&#233;los &#233;lectriques pliants envoient un joli signal</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2913327_apres-3-ans-de-galere-nous-commencons-a-voir-une-reprise-brompton-et-ses-velos-electriques-pliants-envoient-un-joli-signal</link>
      <pubDate>Thu, 18 Dec 2025 07:14:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2913327_apres-3-ans-de-galere-nous-commencons-a-voir-une-reprise-brompton-et-ses-velos-electriques-pliants-envoient-un-joli-signal</guid>
      <description>
Sous l&#8217;impulsion de son r&#233;cent 20 pouces G Line et d&#8217;un service de location plus rentable, Brompton publie de meilleurs r&#233;sultats financiers en 2025, et se dit optimiste avec une reprise en 2026.
</description>
    </item>
    <item>
      <title>Avec Gemini 3 Flash, Google fait passer son IA au niveau sup&#233;rieur</title>
      <link>https://www.01net.com/actualites/gemini-2-flash-google-fait-passer-son-ia-niveau-superieur.html</link>
      <pubDate>Thu, 18 Dec 2025 07:09:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315959</guid>
      <description>Google vient de pr&#233;senter Gemini 3 Flash, son nouveau mod&#232;le plus rapide et polyvalent, qui arrive dans plusieurs services du g&#233;ant am&#233;ricain.</description>
    </item>
    <item>
      <title>Votre smartwatch Wear OS peut maintenant localiser votre smartphone Android</title>
      <link>https://www.01net.com/actualites/votre-smartwatch-wear-os-peut-maintenant-localiser-votre-smartphone-android.html</link>
      <pubDate>Thu, 18 Dec 2025 07:06:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315969</guid>
      <description>Google vient de mettre &#224; jour son application Localiser. D&#233;sormais compatible Wear OS, elle permet de localiser votre smartphone et de le faire sonner &#224; distance depuis votre smartwatch.</description>
    </item>
    <item>
      <title>Cowboy saddles up with a new owner</title>
      <link>https://www.theverge.com/news/847097/cowboy-acquired-by-rebirth-recycles-bankruptcy</link>
      <pubDate>2025-12-18T02:02:10-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=847097</guid>
      <description>The Brussels-based electric bike company has officially closed its deal to be acquired by ReBirth Group Holding, which also owns cycling brands Peugeot, Gitane, and Solex. The transaction includes new, undisclosed funding from ReBirth as well as &#8364;15 million ($17.6 million) from existing shareholders. The funding will be used to restart production and deal with [&#8230;]...</description>
    </item>
    <item>
      <title>The introvert&#8217;s networking playbook</title>
      <link>https://www.fastcompany.com/91457229/the-introverts-networking-playbook</link>
      <pubDate>2025-12-18T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91457229/the-introverts-networking-playbook</guid>
      <description>From pre-event prep to follow-through, these tips break down the tactics for people who get anxious at conferences.
I am an introverted person who feels shy at events. Early in my career, I found conferences to be so overwhelming that I&#8217;d sometimes just hide in the bathroom, go into an anxious spiral of fear and guilt, and then try to convince myself to get out and talk to at least one person. Watching how other people seemed to enjoy these events and easily talk to everyone made me think something was wrong with me. The truth is that 36% of young people have anxiety. But knowing that didn&#8217;t m...</description>
    </item>
    <item>
      <title>How to spot culture risks at your company when you can still fix them</title>
      <link>https://www.fastcompany.com/91457403/how-to-spot-culture-risks-at-your-company-when-you-can-still-fix-them</link>
      <pubDate>2025-12-18T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91457403/how-to-spot-culture-risks-at-your-company-when-you-can-still-fix-them</guid>
      <description>Having a thriving culture requires more than an engagement survey; it means paying attention to lived experiences. 
A headline catches your eye: A company you admire, known for its market performance and strong culture, is embroiled in a massive scandal. It causes reputational harm, profitability tanks, and customers notice. The details feel depressingly familiar&#8212;enough to fill books (most recently The Dark Pattern)....</description>
    </item>
    <item>
      <title>What dating is like in 2025 for the unemployed</title>
      <link>https://www.fastcompany.com/91462207/what-dating-is-like-in-2025-for-the-unemployed</link>
      <pubDate>2025-12-18T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91462207/what-dating-is-like-in-2025-for-the-unemployed</guid>
      <description>A new report reveals how unemployment is changing dating expectations in 2025.
Dating in 2025 has been rough. According to articles, data, and personal narratives on social media, it seems that it&#8217;s never been more challenging to find a partner. But, according to a new report, when it comes to one qualification, daters may actually be lowering the bar.&#160;...</description>
    </item>
    <item>
      <title>Voici la meilleure montre de sport de l&#8217;ann&#233;e &#8211; Frandroid Awards 2025</title>
      <link>https://www.frandroid.com/marques/garmin/2902173_voici-la-meilleure-montre-de-sport-de-2025-frandroid-awards-2025</link>
      <pubDate>Thu, 18 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/garmin/2902173_voici-la-meilleure-montre-de-sport-de-2025-frandroid-awards-2025</guid>
      <description>
Cette ann&#233;e, la r&#233;daction de Frandroid a test&#233; de nombreuses montres GPS d&#233;di&#233;es au sport. C'est la Garmin Forerunner 970 qui sort du lot et re&#231;oit le Frandroid Awards avec Delos. 
</description>
    </item>
    <item>
      <title>Face &#224; Google et Samsung, Meta &#171;&#160;met en pause&#160;&#187; son ambition de devenir l&#8217;Android de la VR</title>
      <link>https://www.frandroid.com/marques/meta/2914323_face-a-google-et-samsung-meta-met-en-pause-son-ambition-de-devenir-landroid-de-la-vr</link>
      <pubDate>Thu, 18 Dec 2025 06:52:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2914323_face-a-google-et-samsung-meta-met-en-pause-son-ambition-de-devenir-landroid-de-la-vr</guid>
      <description>
Alors que le groupe de Mark Zuckerberg avait accumul&#233; une avance non n&#233;gligeable dans le monde de la r&#233;alit&#233; virtuelle et augment&#233;e, il se fait doucement rattraper par la concurrence. &#192; tel point qu&#8217;il r&#233;duit d&#233;sormais ses ambitions.
</description>
    </item>
    <item>
      <title>Si vous avez un Google Pixel 10, cette mise &#224; jour va faire du bien</title>
      <link>https://www.frandroid.com/marques/google/2914319_si-vous-avez-un-google-pixel-10-cette-mise-a-jour-va-faire-du-bien</link>
      <pubDate>Thu, 18 Dec 2025 06:43:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2914319_si-vous-avez-un-google-pixel-10-cette-mise-a-jour-va-faire-du-bien</guid>
      <description>
Google met &#224; jour le pilote de la puce graphique des Google Pixel 10 pour am&#233;liorer les performances des smartphones.
</description>
    </item>
    <item>
      <title>Spellbound TikTok users are drooling over lavish office holiday parties</title>
      <link>https://www.fastcompany.com/91462120/spellbound-tiktok-users-are-drooling-over-lavish-office-holiday-parties</link>
      <pubDate>2025-12-18T06:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91462120/spellbound-tiktok-users-are-drooling-over-lavish-office-holiday-parties</guid>
      <description>&#8220;Sometimes I love corporate America,&#8221; one writes.
As the festive season gets into full swing, young corporate employees are taking to social media to flex their high-budget company holiday parties.&#160;</description>
    </item>
    <item>
      <title>Marre du m&#233;nage ? Ce robot aspirateur Dreame en promo &#224; -500 &#8364; s&#8217;occupe de tout pour les f&#234;tes [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/robot-aspirateur/2912139_marre-du-menage-ce-robot-aspirateur-dreame-en-promo-a-500-e-soccupe-de-tout-pour-les-fetes</link>
      <pubDate>Thu, 18 Dec 2025 06:21:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/robot-aspirateur/2912139_marre-du-menage-ce-robot-aspirateur-dreame-en-promo-a-500-e-soccupe-de-tout-pour-les-fetes</guid>
      <description>
Grosses promotions juste avant No&#235;l sur plusieurs appareils sign&#233;s Dreame, le sp&#233;cialiste de l&#8217;&#233;lectrom&#233;nager intelligent qui vous permet (enfin) de vous d&#233;faire des t&#226;ches m&#233;nag&#232;res.
</description>
    </item>
    <item>
      <title>Oubliez la chasse au Wi-Fi : avec 200 Go de 5G &#224; moins de 10 &#8364;, vous &#234;tes enfin libre partout</title>
      <link>https://www.frandroid.com/bons-plans/2913191_oubliez-la-chasse-au-wi-fi-avec-200-go-de-5g-a-moins-de-10-e-vous-etes-enfin-libre-partout</link>
      <pubDate>Thu, 18 Dec 2025 06:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2913191_oubliez-la-chasse-au-wi-fi-avec-200-go-de-5g-a-moins-de-10-e-vous-etes-enfin-libre-partout</guid>
      <description>
Pour les f&#234;tes de No&#235;l, Coriolis augmente la data de son forfait Le Relax pour proposer une enveloppe massive de 200 Go en 5G pour moins de 10 euros par mois.
</description>
    </item>
    <item>
      <title>HBO Max Promo Code: 50% Off | This Month</title>
      <link>https://www.wired.com/story/max-promo-code/</link>
      <pubDate>Thu, 18 Dec 2025 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">67b4f3536aeb9b93c37c1cbe</guid>
      <description>Stream your favorite shows and save up to 50% today with HBO Max discount codes and subscription deals.</description>
    </item>
    <item>
      <title>T-Mobile Business Promo Codes and Deals for November 2025</title>
      <link>https://www.wired.com/story/t-mobile-business-promo-code/</link>
      <pubDate>Thu, 18 Dec 2025 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">6942d12a8d14fbb0ba136390</guid>
      <description>Discover how to save on T-Mobile Business Internet and phone plans, from sign-up perks and switching rewards to bundled offers and free lines.</description>
    </item>
    <item>
      <title>Privacy vs control: a &#8220;whack-a-mole game&#8221; with no clear winners</title>
      <link>https://www.techradar.com/computing/cyber-security/privacy-vs-control-a-whack-a-mole-game-with-no-clear-winners</link>
      <pubDate>Thu, 18 Dec 2025 06:00:00 +0000</pubDate>
      <guid isPermaLink="false">Q7uNQgkTKeU47dBAaxGcX</guid>
      <description>Are authorities going too far in their pursuit of safety?</description>
    </item>
    <item>
      <title>Apple Music s&#8217;int&#232;gre &#224; ChatGPT pour cr&#233;er simplement vos playlists de No&#235;l</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2914311_apple-music-sintegre-a-chatgpt-pour-creer-simplement-vos-playlists-de-noel</link>
      <pubDate>Thu, 18 Dec 2025 05:55:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/openai-chatgpt/2914311_apple-music-sintegre-a-chatgpt-pour-creer-simplement-vos-playlists-de-noel</guid>
      <description>
Apr&#232;s les applications Adobe, c&#8217;est au tour d&#8217;Apple Music de faire son arriv&#233;e dans ChatGPT. Mais les fonctionnalit&#233;s sont encore relativement limit&#233;es pour le moment.
</description>
    </item>
  </channel>
</rss>
