<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 08 Nov 2025 13:08:12 GMT</lastBuildDate>
    <item>
      <title>On a test&#233; le nouveau VanMoof : le retour en gr&#226;ce du v&#233;lo &#233;lectrique connect&#233; longtemps tomb&#233; en disgr&#226;ce</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2853909_on-a-teste-le-nouveau-vanmoof-le-retour-en-grace-du-velo-electrique-connecte-longtemps-tombe-en-disgrace</link>
      <pubDate>Sat, 08 Nov 2025 13:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2853909_on-a-teste-le-nouveau-vanmoof-le-retour-en-grace-du-velo-electrique-connecte-longtemps-tombe-en-disgrace</guid>
      <description>
Apr&#232;s un mod&#232;le S5 fiabilis&#233;, le VanMoof S6 peaufine le style et la technologie d&#8217;un v&#233;lo &#233;lectrique qui ne d&#233;&#231;oit sur aucun point, que ce soit la connectivit&#233; ou la conduite &#224; bo&#238;te automatique. Nous l'avons test&#233;, voici notre verdict.
</description>
    </item>
    <item>
      <title>The endearing movie that affirms creativity as a human act</title>
      <link>https://www.theverge.com/entertainment/816399/peter-hujars-day-ira-sachs-interview</link>
      <pubDate>2025-11-08T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=816399</guid>
      <description>Peter Hujar's Day began, as many great works of art do, with a DM. Director Ira Sachs (Passages, The Delta) had just finished reading a recently unearthed interview between the late portrait photographer Peter Hujar and writer Linda Rosenkrantz that took place in 1974. That dialogue - a conversation about creative anxieties, complete with the [&#8230;]</description>
    </item>
    <item>
      <title>Soaring electricity rates fueled Democratic victories &#8212; now comes the hard part</title>
      <link>https://www.theverge.com/report/816946/electricity-rates-election-democrats</link>
      <pubDate>2025-11-08T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=816946</guid>
      <description>While there's plenty for voters to be worried about right now, rising utility bills have become a hot-button issue. The success of Democrats in New Jersey, Virginia, and Georgia in this week's elections can be seen as something of a referendum on the state of energy policy and infrastructure in the US as power grids [&#8230;]</description>
    </item>
    <item>
      <title>How to watch Italy vs Australia: free streams, TV channels and team news for 2025 Autumn Internationals rugby game</title>
      <link>https://www.techradar.com/how-to-watch/rugby/watch-italy-vs-australia-autumn-internationals-2025</link>
      <pubDate>Sat, 08 Nov 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">p4W4wAWi2bGdcybH4WxHBo</guid>
      <description>All the ways to watch Italy vs Australia live streams online, with Louis Lynagh set for a starring role in the 2025 Autumn International at Stadio Friuli.</description>
    </item>
    <item>
      <title>The WhatsApp team is aware that the new Apple Watch app is crashing on certain models &#8211; and is 'working quickly' to fix it</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/the-whatsapp-team-is-aware-that-the-new-apple-watch-app-is-crashing-on-certain-models-and-is-working-quickly-to-fix-it</link>
      <pubDate>Sat, 08 Nov 2025 12:30:00 +0000</pubDate>
      <guid isPermaLink="false">uQnKNeeggFT9MpuicXnvvd</guid>
      <description>WhatsApp has arrived on the Apple Watch, but some users are unable to get it running properly.</description>
    </item>
    <item>
      <title>Garmin Forerunner 255 : cette excellente montre connect&#233;e chute enfin sous les 200 &#8364; en ce pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2859675_garmin-forerunner-255-cette-excellente-montre-connectee-chute-enfin-sous-les-200-e-en-ce-pre-black-friday</link>
      <pubDate>Sat, 08 Nov 2025 12:19:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2859675_garmin-forerunner-255-cette-excellente-montre-connectee-chute-enfin-sous-les-200-e-en-ce-pre-black-friday</guid>
      <description>
Test&#233;e et largement valid&#233;e par nos soins, la Garmin Forerunner 255 est l'alli&#233;e des sportifs, en particulier des coureurs gr&#226;ce &#224; ses donn&#233;es tr&#232;s pr&#233;cises. Pendant le pr&#233;-Black Friday, cette montre connect&#233;e bien &#233;quip&#233;e est propos&#233;e &#224; 199,99 euros au lieu de 349,99 euros chez Decathlon. 
</description>
    </item>
    <item>
      <title>Trump&#8217;s Hatred of EVs Is Making Gas Cars More Expensive</title>
      <link>https://www.wired.com/story/trumps-anti-climate-agenda-is-making-it-more-expensive-to-own-a-car/</link>
      <pubDate>Sat, 08 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">68f0e774e90cdfdc0b885301</guid>
      <description>Trump&#8217;s anti-climate agenda is making it more expensive to own a car, period.</description>
    </item>
    <item>
      <title>Gear News of the Week: Fairphone Lands in the US, and WhatsApp Is Finally on the Apple Watch</title>
      <link>https://www.wired.com/story/gear-news-of-the-week-fairphone-lands-in-the-us-and-whatsapp-is-finally-on-the-apple-watch/</link>
      <pubDate>Sat, 08 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">690cf00b071026a4d738a11a</guid>
      <description>Plus: Motorola has new Moto G phones, Canon&#8217;s R6 III mirrorless has a 32-MP sensor, and Teenage Engineering&#8217;s Riddim n&#8217; Ting looks gorgeous.</description>
    </item>
    <item>
      <title>The 42 Best Movies on Netflix, WIRED&#8217;s Picks (November 2025)</title>
      <link>https://www.wired.com/story/netflix-best-movies-this-week/</link>
      <pubDate>Sat, 08 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">63e53e6469cf98bf35404268</guid>
      <description>Frankenstein, The Twits, and The Running Man are just a few of the movies you should watch on Netflix this month.</description>
    </item>
    <item>
      <title>The 42 Best Shows on Netflix, WIRED's Picks (November 2025)</title>
      <link>https://www.wired.com/story/netflix-best-shows-this-week/</link>
      <pubDate>Sat, 08 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">63e553d835b4148ce01604ab</guid>
      <description>The Witcher, Boots, and House of Guinness are just a few of the shows you need to watch on Netflix this month.</description>
    </item>
    <item>
      <title>I tested the Hisense U75QG mini-LED TV, and it&#8217;s the best value Hisense TV</title>
      <link>https://www.techradar.com/televisions/hisense-u75qg-review</link>
      <pubDate>Sat, 08 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">z4TK4Xvw5zKyjNX8kcEsDd</guid>
      <description>The Hisense U75QG delivers a super-bright picture and great gaming features at an affordable price. It may just be the company's best-value mini-LED TV yet.</description>
    </item>
    <item>
      <title>How to watch Scotland vs New Zealand: live stream Autumn Internationals 2025 rugby from anywhere, TV channel, preview, team news</title>
      <link>https://www.techradar.com/how-to-watch/rugby/scotland-vs-new-zealand-live-stream-autumn-internationals-2025</link>
      <pubDate>Sat, 08 Nov 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">hc92gmoSxsgjRVnewKFoBe</guid>
      <description>Murrayfield seeks a first win over the All Blacks in 120 years? Here's how to can watch Scotland vs New Zealand live streams from wherever you are in the world.</description>
    </item>
    <item>
      <title>How failure taught me to succeed as an entrepreneur</title>
      <link>https://www.fastcompany.com/91429737/what-failure-taught-me-about-entrepreneurship-fauilure-entrepreneurship</link>
      <pubDate>2025-11-08T11:58:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91429737/what-failure-taught-me-about-entrepreneurship-fauilure-entrepreneurship</guid>
      <description>A leader in the fashion footwear business shares the secrets of his success.
Over the past 50 years in the shoe trade, I have had my fair share of failure.</description>
    </item>
    <item>
      <title>Don&#8217;t wait for Black Friday &#8211; this colour laser printer from Brother is the cheapest you can buy, with an extra &#163;35 off the price right now</title>
      <link>https://www.techradar.com/pro/dont-wait-for-black-friday-this-colour-laser-printer-from-brother-is-the-cheapest-you-can-buy-with-an-extra-gbp35-off-the-price-right-now</link>
      <pubDate>Sat, 08 Nov 2025 11:47:00 +0000</pubDate>
      <guid isPermaLink="false">Y6euxSuckitRDnNRBAHG4V</guid>
      <description>Black Friday savings start now! Brother's HL-L3220CWE is the cheapest colour laser printer in the UK.</description>
    </item>
    <item>
      <title>Unpicking How to Measure the Complexity of Knots</title>
      <link>https://www.wired.com/story/unpicking-how-to-measure-the-complexity-of-knots/</link>
      <pubDate>Sat, 08 Nov 2025 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">68ff976f1d2e9317ea4637e3</guid>
      <description>Two mathematicians have proved that a straightforward question&#8212;how hard is it to untie a knot?&#8212;has a complicated answer.</description>
    </item>
    <item>
      <title>Should You Cold Plunge Before or After a Workout? (2025)</title>
      <link>https://www.wired.com/story/cold-plunge-before-or-after-workout/</link>
      <pubDate>Sat, 08 Nov 2025 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">68fbbe50cdb4a6eedb0ee447</guid>
      <description>If you&#8217;re going to suffer, make sure it&#8217;s worth the effort. We consulted fitness experts to help you maximize your ice bath.</description>
    </item>
    <item>
      <title>Xiaomi profite du pr&#233;-Black Friday pour brader ses produits les plus populaires : les 11 offres &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2858733_xiaomi-profite-du-pre-black-friday-pour-brader-ses-produits-les-plus-populaires-les-8-offres-a-saisir</link>
      <pubDate>Sat, 08 Nov 2025 11:18:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2858733_xiaomi-profite-du-pre-black-friday-pour-brader-ses-produits-les-plus-populaires-les-8-offres-a-saisir</guid>
      <description>
Le coup d&#8217;envoi du pr&#233;-Black Friday a &#233;t&#233; donn&#233; chez de nombreux e-commer&#231;ants, et Xiaomi ne compte pas manquer l&#8217;&#233;v&#233;nement. La marque chinoise multiplie les offres et casse les prix sur l&#8217;ensemble de ses produits phares. D&#233;couvrez ceux qui ont retenu notre attention. 
</description>
    </item>
  </channel>
</rss>
