<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 06 Jan 2026 15:28:42 GMT</lastBuildDate>
    <item>
      <title>AMD CEO welcomes us to the "YottaScale era" - Lisa Su says AI will need YottaFLOPS of compute power soon</title>
      <link>https://www.techradar.com/pro/amd-ceo-welcomes-us-to-the-yottascale-era-lisa-su-says-ai-will-need-yottaflops-of-compute-power-soon</link>
      <pubDate>Tue, 06 Jan 2026 15:24:31 +0000</pubDate>
      <guid isPermaLink="false">BGecmWgyF885gTzMBPhGQM</guid>
      <description>AI is only going to get more power-hungry as it grows, AMD CEO warns.</description>
    </item>
    <item>
      <title>3 ms de latence en Bluetooth ? Razer d&#233;voile la manette ultime pour le cloud gaming sans console</title>
      <link>https://www.frandroid.com/marques/2931401_3-ms-de-latence-en-bluetooth-razer-devoile-la-manette-ultime-pour-le-cloud-gaming-sans-console</link>
      <pubDate>Tue, 06 Jan 2026 15:21:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2931401_3-ms-de-latence-en-bluetooth-razer-devoile-la-manette-ultime-pour-le-cloud-gaming-sans-console</guid>
      <description>
Razer a d&#233;voil&#233; une nouvelle version de sa Wolverine V3 lors du CES 2026 de Las Vegas. Pens&#233;e pour le cloud gaming sur les t&#233;l&#233;viseurs LG, elle se targue d'offrir la meilleure latence pour une manette Bluetooth.
</description>
    </item>
    <item>
      <title>Le robot CLOiD de LG se charge (lentement) des corv&#233;es de la maison</title>
      <link>https://www.01net.com/actualites/le-robot-cloid-de-lg-se-charge-lentement-des-corvees-de-la-maison.html</link>
      <pubDate>Tue, 06 Jan 2026 15:19:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318436</guid>
      <description>Que va-t-on faire &#224; la maison une fois que les robots se seront occup&#233;s de toutes les t&#226;ches ingrates du quotidien ? Nul doute qu'on trouvera comment s'occuper ! Mais il faut d'abord que les robots domestiques fassent leur apparition et se montrent r&#233;ellement efficaces. Le CLOiD de LG n'en est pas encore l&#224; en termes d'efficacit&#233;, mais le constructeur cor&#233;en veut montrer au CES 2026 &#224; quoi pourrait ressembler, &#224; terme, un v&#233;ritable assistant domestique robotis&#233;....</description>
    </item>
    <item>
      <title>Valve fait exploser le jeu vid&#233;o sous Linux gr&#226;ce &#224; son Steam&#8239;Deck</title>
      <link>https://www.frandroid.com/actualites-generales/2931025_valve-fait-exploser-le-jeu-video-sous-linux-grace-a-son-steam-deck</link>
      <pubDate>Tue, 06 Jan 2026 15:13:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2931025_valve-fait-exploser-le-jeu-video-sous-linux-grace-a-son-steam-deck</guid>
      <description>
Le Steam&#8239;Deck, ce petit PC de poche sign&#233; Valve, continue de prouver qu&#8217;il n&#8217;est pas qu&#8217;une curiosit&#233; pour geeks. Non seulement il fait tourner vos jeux Steam n&#8217;importe o&#249;, mais il a aussi contribu&#233; &#224; un ph&#233;nom&#232;ne inattendu&#8239;: faire de Linux une v&#233;ritable plateforme de jeu.
</description>
    </item>
    <item>
      <title>Deepfakes and distrust: how human provenance can rebuild digital confidence</title>
      <link>https://www.techradar.com/pro/deepfakes-and-distrust-how-human-provenance-can-rebuild-digital-confidence</link>
      <pubDate>Tue, 06 Jan 2026 15:12:23 +0000</pubDate>
      <guid isPermaLink="false">Wfbd4RGM5p9CU6Mfxpjm5Q</guid>
      <description>As deepfakes surge, proving humanness may be the only reliable path to digital trust.</description>
    </item>
    <item>
      <title>Everything announced at CES 2026</title>
      <link>https://www.engadget.com/general/everything-announced-at-ces-2026-130124802.html?src=rss</link>
      <pubDate>Tue, 06 Jan 2026 15:11:41 +0000</pubDate>
      <guid isPermaLink="false">fd3b4bbf-1b78-4e34-9914-70a2e6f85389</guid>
      <description>It's the first week of a new year and there's no time for the tech world to slowly ease back into things following the holidays. That's because CES 2026 is in full swing, with all manner of companies descending on Las Vegas to reveal their latest innovations and what they're planning to bring your way in the near future.&#160;Many of the Engadget crew are on the ground to check out as much of the new tech as possible. Of course, we're keeping tabs on all of the major CES press conferences too. Samsung has already held its First Look presentation, which focuses on home products, while LG has shown o...</description>
    </item>
    <item>
      <title>Meta is adding a teleprompter and virtual writing to its Ray-Ban Display glasses</title>
      <link>https://www.theverge.com/news/856422/meta-ray-ban-display-emg-handwriting-teleprompter</link>
      <pubDate>2026-01-06T10:11:04-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=856422</guid>
      <description>Meta is giving Ray-Ban Display users an option to text on their glasses without needing their phone or a keyboard, only the Meta Neural Band. The new EMG handwriting feature, announced on Tuesday during CES, allows users to physically write with their hand on any surface, rather than texting. It's currently rolling out as an [&#8230;]</description>
    </item>
    <item>
      <title>Segway d&#233;gaine un &#171; v&#233;lo &#233;lectrique &#187; high-tech avec radar int&#233;gr&#233;&#8230; mais il y a un mais</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2931369_segway-degaine-un-velo-electrique-high-tech-avec-radar-integre-mais-il-y-a-un-mais</link>
      <pubDate>Tue, 06 Jan 2026 15:06:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2931369_segway-degaine-un-velo-electrique-high-tech-avec-radar-integre-mais-il-y-a-un-mais</guid>
      <description>
Au travers d'un v&#233;lo tout-chemin nomm&#233; Segway Myon et bard&#233; d&#8217;&#233;quipements, ainsi que l&#8217;urbain 20 pouces Muxi, la marque Segway double son portefeuille de v&#233;los &#233;lectriques... mais exclut encore une fois l'Europe, pour le moment.
</description>
    </item>
    <item>
      <title>Meta pauses international expansion of its Ray-Ban Display glasses</title>
      <link>https://techcrunch.com/2026/01/06/meta-pauses-international-expansion-of-its-ray-ban-display-glasses/</link>
      <pubDate>Tue, 06 Jan 2026 15:04:49 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3080212</guid>
      <description>Meta had originally planned to launch the glasses in France, Italy, Canada, and the U.K. in early 2026.</description>
    </item>
    <item>
      <title>Fender just released its first headphones and Bluetooth speakers, but I feel like it forgot something Marshall and Orange knew</title>
      <link>https://www.techradar.com/audio/fender-just-released-its-first-headphones-and-bluetooth-speakers-but-i-feel-like-it-forgot-something-marshall-and-orange-knew</link>
      <pubDate>Tue, 06 Jan 2026 15:04:20 +0000</pubDate>
      <guid isPermaLink="false">WQWgZDeEdmW4eaVHvy5RCC</guid>
      <description>Fender-branded consumer products are finally here, as of CES 2026, but they miss a key ingredient.</description>
    </item>
    <item>
      <title>The robots, phones, and Lego of CES 2026</title>
      <link>https://www.theverge.com/podcast/856248/ces-2026-gadgets-vergecast</link>
      <pubDate>2026-01-06T10:03:27-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=856248</guid>
      <description>This year's Consumer Electronics Show is only just getting into full swing, and we've already seen a deluge of gadget announcements. There are the staples, of course: gigantic TVs, smart home sensors, phone accessories, weirdly elaborate ways to charge your devices. Wouldn't be CES without them. But this year in Las Vegas, there are also [&#8230;]</description>
    </item>
    <item>
      <title>&#171; Tesla devrait s&#8217;inqui&#233;ter &#187; : il a roul&#233; pendant 40 minutes dans une Mercedes CLA &#233;lectrique avec la technologie Nvidia, voici son avis</title>
      <link>https://www.frandroid.com/marques/mercedes-benz/2931105_tesla-devrait-sinquieter-il-a-roule-pendant-40-minutes-dans-une-mercedes-cla-electrique-avec-la-technologie-nvidia-voici-son-avis</link>
      <pubDate>Tue, 06 Jan 2026 15:01:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/mercedes-benz/2931105_tesla-devrait-sinquieter-il-a-roule-pendant-40-minutes-dans-une-mercedes-cla-electrique-avec-la-technologie-nvidia-voici-son-avis</guid>
      <description>
Mercedes-Benz profite du CES de Las Vegas pour d&#233;voiler son syst&#232;me de conduite assist&#233;e de niveau 2++ et affiche des ambitions qui pourraient bousculer le march&#233;. Lors d'un essai &#224; San Francisco, la technologie d&#233;velopp&#233;e par Nvidia a d&#233;montr&#233; des capacit&#233;s qui rivalisent directement avec le fameux FSD de Tesla.
</description>
    </item>
    <item>
      <title>Could Another Villain Be Coming to &#8216;Spider-Man: Brand New Day?</title>
      <link>https://gizmodo.com/spider-man-brand-new-day-boomerang-costume-2000705898</link>
      <pubDate>Tue, 06 Jan 2026 15:00:47 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705898</guid>
      <description>Plus, do you dare read a page from the Necronomicon?</description>
    </item>
    <item>
      <title>&#8216;Industry&#8217; Takes on the Age Verification Wars</title>
      <link>https://www.wired.com/story/hbo-industry-season-4-age-verification/</link>
      <pubDate>Tue, 06 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">69405e8c4db6532247cba064</guid>
      <description>In the HBO show&#8217;s fourth season, Industry proves to be more prescient than it&#8217;s ever been.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Wednesday, January 7 (game #1444)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-7-january-2026</link>
      <pubDate>Tue, 06 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">Em4CK7tdFGsQ6cWGDvRYm8</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Wednesday, January 7 (game #941)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-7-january-2026</link>
      <pubDate>Tue, 06 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">WoUTr86TYCa5vPf2bNCRM3</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Wednesday, January 7 (game #675)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-7-january-2026</link>
      <pubDate>Tue, 06 Jan 2026 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">SSGEwbTcdQ5k4Rh8grjcG6</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Hisense RGB MiniLED evo, c&#8217;est quoi cette technologie qui veut vous en faire voir de toutes les couleurs&#160;?</title>
      <link>https://www.frandroid.com/marques/hisense/2931471_hisense-rgb-miniled-evo-cest-quoi-cette-technologie-qui-veut-vous-en-faire-voir-de-toutes-les-couleurs</link>
      <pubDate>Tue, 06 Jan 2026 14:56:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/hisense/2931471_hisense-rgb-miniled-evo-cest-quoi-cette-technologie-qui-veut-vous-en-faire-voir-de-toutes-les-couleurs</guid>
      <description>
Le fabricant chinois a d&#233;voil&#233; au CES 2026 une nouvelle technologie d&#8217;affichage pour ses t&#233;l&#233;viseurs&#160;: l'ajout d'une quatri&#232;me couleur primaire, bouleversant les standards de reproduction chromatique dans l'industrie. On vous explique tout.
</description>
    </item>
    <item>
      <title>Intermittent Fasting Isn&#8217;t Doing What You Think It&#8217;s Doing</title>
      <link>https://gizmodo.com/intermittent-fasting-isnt-doing-what-you-think-its-doing-2000706063</link>
      <pubDate>Tue, 06 Jan 2026 14:50:39 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000706063</guid>
      <description>Time-restricted eating without a change in how much you eat doesn't seem to do anything for your metabolic health.</description>
    </item>
    <item>
      <title>Gmail sur le Web&#160;: Google supprime cette fonction historique, vos autres bo&#238;tes mail sont bloqu&#233;es</title>
      <link>https://www.01net.com/actualites/gmail-sur-le-web-google-supprime-cette-fonction-historique-vos-autres-boites-mail-sont-bloquees.html</link>
      <pubDate>Tue, 06 Jan 2026 14:44:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318412</guid>
      <description>Coup de froid sur Gmail en ce mois de janvier 2026. Google met fin au support du POP3 et de Gmailify sur sa version Web. Si vous centralisiez vos comptes Yahoo ou Outlook, la synchronisation est coup&#233;e. Voici comment contourner le probl&#232;me.</description>
    </item>
    <item>
      <title>Demain, ce sont les soldes d&#8217;hiver : tout savoir pour faire de bonnes affaires d&#232;s ce d&#233;but d&#8217;ann&#233;e 2026</title>
      <link>https://www.frandroid.com/bons-plans/1368255_demain-ce-sont-les-soldes-dhiver-tout-savoir-pour-faire-de-bonnes-affaires-des-ce-debut-dannee-2026</link>
      <pubDate>Tue, 06 Jan 2026 14:40:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/1368255_demain-ce-sont-les-soldes-dhiver-tout-savoir-pour-faire-de-bonnes-affaires-des-ce-debut-dannee-2026</guid>
      <description>
Les&#160;soldes d&#8217;hiver 2026&#160;approchent &#224; grands pas&#8239;! Du&#160;7 janvier au 3 f&#233;vrier prochain, les e-commer&#231;ants fran&#231;ais vont d&#233;gainer des&#160;promotions sur une foule de produits Tech. L&#8217;occasion r&#234;v&#233;e de bien commencer l&#8217;ann&#233;e en profitant de belles r&#233;ductions, surtout avec la hausse pr&#233;vue des prix en 2026... Voici tout ce qu&#8217;il faut savoir avant le coup d&#8217;envoi officiel.
...</description>
    </item>
    <item>
      <title>Mieux que des lunettes connect&#233;es ? Razer annonce le Projet Motoko, un casque audio qui veut devenir vos nouveaux yeux (et votre cerveau)</title>
      <link>https://www.frandroid.com/marques/razer/2931219_mieux-que-des-lunettes-connectees-razer-annonce-le-projet-motoko-un-casque-audio-qui-veut-devenir-vos-nouveaux-yeux-et-votre-cerveau</link>
      <pubDate>Tue, 06 Jan 2026 14:32:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/razer/2931219_mieux-que-des-lunettes-connectees-razer-annonce-le-projet-motoko-un-casque-audio-qui-veut-devenir-vos-nouveaux-yeux-et-votre-cerveau</guid>
      <description>
Razer a profit&#233; du CES pour d&#233;voiler un nouveau concept de casque audio : Projet Motoko. Avec ses cam&#233;ras embarqu&#233;es, le casque agit comme un assistant IA conscient du monde qui l'entoure. Un concept qui pourrait bien voir le jour dans un futur proche.
</description>
    </item>
    <item>
      <title>Everything NVIDIA announced at CES 2026</title>
      <link>https://www.engadget.com/ai/everything-nvidia-announced-at-ces-2026-225653684.html?src=rss</link>
      <pubDate>Tue, 06 Jan 2026 14:30:50 +0000</pubDate>
      <guid isPermaLink="false">29e2c7bd-fe16-414f-bbd5-59e8cb1322d2</guid>
      <description>Jensen Huang took to the CES stage on Monday to share the latest from NVIDIA,  and while the presentation was more a refresher of technologies the company has been working on for the past few years, there were a couple of notable announcements. NVIDIA announced  Alpamayo, a family of open-source reasoning models designed to guide autonomous vehicles through difficult driving situations. The centerpiece of the release is Alpamayo 1 , a 10-billion parameter chain-of-thought system NVIDIA says is capable of approaching driving more like a human being would. The model works by breaking down unexpe...</description>
    </item>
    <item>
      <title>Microsoft Office has been rebranded to Microsoft 365 Copilot, or has it?</title>
      <link>https://www.techradar.com/pro/microsoft-office-has-been-rebranded-to-microsoft-365-copilot-or-has-it</link>
      <pubDate>Tue, 06 Jan 2026 14:30:00 +0000</pubDate>
      <guid isPermaLink="false">dG8BrcLv7QqVhTwujW4E3U</guid>
      <description>Microsoft wants the M365 Copilot app to be your one-stop-shop for AI, productivity, and everything in between.</description>
    </item>
    <item>
      <title>CES 2026 day 0: The biggest news you missed from the show's Monday press conferences</title>
      <link>https://www.engadget.com/big-tech/ces-2026-day-0-the-biggest-news-you-missed-from-the-shows-monday-press-conferences-142811448.html?src=rss</link>
      <pubDate>Tue, 06 Jan 2026 14:28:11 +0000</pubDate>
      <guid isPermaLink="false">2ad42c01-6915-4cc0-a733-d2d54ca26907</guid>
      <description>CES 2026 officially opens today, but much of the show&#8217;s biggest announcements already landed during Monday&#8217;s press conferences and early events. AI was everywhere, chipmakers dominated the schedule and a handful of brands used the pre-show window to quietly drop meaningful hardware updates.Below are the biggest announcements and trends from January 5, plus a few standout hands-ons from Pepcom and CES Unveiled.LG doubles down on AILG's CLOiD robot.LGLG&#8217;s World Premiere keynote leaned hard into its vision of &#8220;Affectionate Intelligence,&#8221; with AI positioned as the connective tissue across TVs, app...</description>
    </item>
    <item>
      <title>RAM prices are terrifying, so Nvidia wants to turn your Amazon Fire TV stick into a gaming PC</title>
      <link>https://www.techradar.com/gaming/pc-gaming/ram-prices-are-terrifying-so-nvidia-wants-to-turn-your-amazon-fire-tv-stick-into-a-gaming-pc</link>
      <pubDate>Tue, 06 Jan 2026 14:27:56 +0000</pubDate>
      <guid isPermaLink="false">qnumLQTyUncAQzwcpTqiMP</guid>
      <description>Linux PCs and Fire TV sticks get Nvidia GeForce Now native support, serving as a great gaming PC alternative in a rough market.</description>
    </item>
    <item>
      <title>Nvidia d&#233;clare la guerre &#224; Tesla : Alpamayo et la puce Rubin sur une Mercedes CLA pour faire mieux que le FSD</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/2931271_nvidia-declare-la-guerre-a-tesla-alpamayo-et-la-puce-rubin-sur-une-mercedes-cla-pour-faire-mieux-que-le-fsd</link>
      <pubDate>Tue, 06 Jan 2026 14:25:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/2931271_nvidia-declare-la-guerre-a-tesla-alpamayo-et-la-puce-rubin-sur-une-mercedes-cla-pour-faire-mieux-que-le-fsd</guid>
      <description>
C'est la d&#233;monstration de force du CES 2026. Pendant que Tesla garde son FSD jalousement ferm&#233;, Nvidia offre la m&#234;me technologie au reste du monde. La nouvelle Mercedes CLA embarque Alpamayo, une IA capable de voir, penser et conduire. Le monopole de Tesla sur l'autonomie vit peut-&#234;tre ses derni&#232;res heures.
</description>
    </item>
    <item>
      <title>CDC cuts the number of recommended vaccines for children, effective immediately</title>
      <link>https://www.fastcompany.com/91469675/cdc-cuts-number-recommended-vaccines-children-effective-immediately</link>
      <pubDate>2026-01-06T14:24:38</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91469675/cdc-cuts-number-recommended-vaccines-children-effective-immediately</guid>
      <description>In an unprecedented move, the Centers for Disease Control has reduced the number of recommended childhood vaccines.
The U.S. took the unprecedented step Monday of cutting the number of vaccines it recommends for every child &#8212; a move that leading medical groups said would undermine protections against a half-dozen diseases.The change is effective immediately, meaning that the U.S. Centers for Disease Control and Prevention will now recommend that all children get vaccinated against 11 diseases. What&#8217;s no longer broadly recommended is protection against flu, rotavirus, hepatitis A, hepatitis B, ...</description>
    </item>
    <item>
      <title>GameStop store closures: List of doomed locations grows in 2026 as the retailer races to reduce costs</title>
      <link>https://www.fastcompany.com/91469656/gamestop-closing-stores-2026-list-doomed-locations-grows</link>
      <pubDate>2026-01-06T14:21:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91469656/gamestop-closing-stores-2026-list-doomed-locations-grows</guid>
      <description>The Grapevine, Texas, video game seller has already closed hundreds of locations in the wake of a &#8220;store portfolio optimization review.&#8221; Here&#8217;s the latest.
GameStop Corp. is forging ahead with efforts to reduce its physical footprint in the first weeks of 2026.</description>
    </item>
    <item>
      <title>There's still one episode of Stranger Things season 5 left to watch &#8212; and it drops on Netflix next week</title>
      <link>https://www.techradar.com/streaming/netflix/theres-still-one-episode-of-stranger-things-season-5-left-to-watch-and-it-drops-on-netflix-next-week</link>
      <pubDate>Tue, 06 Jan 2026 14:15:39 +0000</pubDate>
      <guid isPermaLink="false">C2YowiWJHyssYhP7xaU4m</guid>
      <description>Stranger Things season 5 isn&#8217;t quite over yet thanks to this surprise Netflix special fans cannot miss, and it'll make 'conformity gate' a distant memory.</description>
    </item>
    <item>
      <title>Meet &#8216;Cloud-9,&#8217; a New Type of Object That Shows What a Failed Galaxy Looks Like</title>
      <link>https://gizmodo.com/meet-cloud-9-a-new-type-of-object-that-shows-what-a-failed-galaxy-looks-like-2000706031</link>
      <pubDate>Tue, 06 Jan 2026 14:15:28 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000706031</guid>
      <description>Astronomers have finally confirmed the existence of RELHICs&#8212;a long-theorized class of dark, starless clouds from the early universe.</description>
    </item>
    <item>
      <title>Hackers use 'Blue Screen of Death' malware to target victims</title>
      <link>https://www.techradar.com/pro/security/hackers-use-blue-screen-of-death-malware-to-target-victims</link>
      <pubDate>Tue, 06 Jan 2026 14:15:00 +0000</pubDate>
      <guid isPermaLink="false">FvNJUBBhyMMqiSinuSCys3</guid>
      <description>A new campaign is targeting the European hospitality industry.</description>
    </item>
    <item>
      <title>Kickstart a healthy January 2026 with this Nutribullet Blender for &#163;69</title>
      <link>https://www.techradar.com/home/juicers-blenders/kickstart-a-healthy-january-2026-with-this-nutribullet-blender-for-gbp69</link>
      <pubDate>Tue, 06 Jan 2026 14:05:07 +0000</pubDate>
      <guid isPermaLink="false">FzEkNtiR7eoTyRMVKY8KAj</guid>
      <description>Amazon cuts the price of the four-star Nutribullet Blender 900 to &#163;69, making it an excellent buy for your new year health kick.</description>
    </item>
    <item>
      <title>Marvel releases the third trailer for Avengers: Doomsday &#8212; and it teases some menacing mutant mayhem for the X-Men</title>
      <link>https://www.techradar.com/streaming/entertainment/marvel-releases-the-third-trailer-for-avengers-doomsday-and-it-teases-some-menacing-mutant-mayhem-for-the-x-men</link>
      <pubDate>Tue, 06 Jan 2026 14:04:43 +0000</pubDate>
      <guid isPermaLink="false">pP98TXZcXzrYXqGP8yJKwZ</guid>
      <description>The third teaser for Avengers: Doomsday has landed online &#8211; and it spells trouble for Professor X, Magneto and Cyclops.</description>
    </item>
    <item>
      <title>Garmin, Coros, Apple&#8230; voici les marques de montres les plus populaires chez les coureurs en France</title>
      <link>https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2930651_garmin-coros-apple-voici-les-marques-de-montres-les-plus-populaires-chez-les-coureurs-en-france</link>
      <pubDate>Tue, 06 Jan 2026 14:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/accessoires-objets-connectes/montres-connectees-2/2930651_garmin-coros-apple-voici-les-marques-de-montres-les-plus-populaires-chez-les-coureurs-en-france</guid>
      <description>
Le m&#233;dia fran&#231;ais Run'ix, d&#233;di&#233; &#224; la course &#224; pied, a publi&#233; le classement des marques de montres les plus utilis&#233;es par sa communaut&#233;. 
</description>
    </item>
    <item>
      <title>Razer Thinks AI Headphones With Cameras Can Take On Meta&#8217;s Ray-Bans</title>
      <link>https://gizmodo.com/razer-thinks-ai-headphones-with-cameras-can-take-on-metas-ray-bans-2000705583</link>
      <pubDate>Tue, 06 Jan 2026 14:00:43 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705583</guid>
      <description>Everyone wants in on the AI wearable game, but Razer is offering a slightly different take.</description>
    </item>
    <item>
      <title>Razer Made Its AI Gaming Assistant Into a Waifu Hologram</title>
      <link>https://gizmodo.com/razer-made-its-ai-gaming-assistant-into-a-waifu-hologram-2000705679</link>
      <pubDate>Tue, 06 Jan 2026 14:00:33 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705679</guid>
      <description>Yes, you read that right.</description>
    </item>
    <item>
      <title>Dell unveils a massive 52-inch 6K ultrawide monitor at CES 2026</title>
      <link>https://www.engadget.com/computing/dell-unveils-a-massive-52-inch-6k-ultrawide-monitor-at-ces-2026-140024029.html?src=rss</link>
      <pubDate>Tue, 06 Jan 2026 14:00:24 +0000</pubDate>
      <guid isPermaLink="false">f50d6f99-01f1-45ee-9af4-32825a117ff2</guid>
      <description>Dell has unveiled an ultrawide, curved 52-inch 6K monitor at CES 2026. This productivity behemoth is designed for stock traders, engineers and other data professionals. Dell claims the UltraSharp 52 Thunderbolt Hub Monitor is the world's first 52-inch ultrawide curved 6K monitor (but with that many qualifiers almost anything can be a world first).
Given Dell&#8217;s experience in the monitor realm, this could be a dream display for professionals who handle vast data sets such as trading platforms, AutoCAD, 3D rendering software, spreadsheets and more. It sports a 120Hz refresh rate on an IPS Black p...</description>
    </item>
    <item>
      <title>The X-Men Are Back in the Next &#8216;Avengers: Doomsday&#8217; Trailer</title>
      <link>https://gizmodo.com/avengers-doomsday-trailer-x-men-cyclops-xavier-magneto-2000703799</link>
      <pubDate>Tue, 06 Jan 2026 14:00:14 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703799</guid>
      <description>Marvel's latest look at its next 'Avengers' adventure teases the arrival of mutants into the MCU proper.</description>
    </item>
    <item>
      <title>Razer Shoves All Its Wackiest Immersion Products Into a Single Gaming Chair</title>
      <link>https://gizmodo.com/razer-shoves-all-its-wackiest-immersion-products-into-a-single-gaming-chair-2000705332</link>
      <pubDate>Tue, 06 Jan 2026 14:00:07 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000705332</guid>
      <description>Razer's got your back if you want spine-tingling haptics and sound.</description>
    </item>
    <item>
      <title>Steve Jobs&#8217; Early Apple Items Are Going Up for Auction&#8212;Along With His Bow Ties</title>
      <link>https://www.wired.com/story/steve-jobs-ephemera-auction-apple/</link>
      <pubDate>Tue, 06 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">695c09e7eb5da3dc323a9145</guid>
      <description>Some of the objects came from Steve Jobs&#8217; childhood bedroom. They&#8217;re being made available by his stepbrother, John Chovanec.</description>
    </item>
    <item>
      <title>Ring and Watch Duty Team Up to Keep a Closer Eye on Wildfires</title>
      <link>https://www.wired.com/story/ring-watch-duty-team-up-wildfire-tracking/</link>
      <pubDate>Tue, 06 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">695c0d968bbcecf91be2ebbb</guid>
      <description>In a move to help alert people to the spread of nearby blazes, Ring is partnering with Watch Duty to let users share their videos on the wildfire tracking app.</description>
    </item>
    <item>
      <title>Pila makes the power station pretty</title>
      <link>https://www.theverge.com/tech/844583/pila-makes-the-power-station-pretty</link>
      <pubDate>2026-01-06T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=844583</guid>
      <description>Pila Energy's home batteries are now available to preorder with deliveries expected to begin in February 2026. These power stations are meant to be seen, unlike most batteries in this class that are better suited for job sites than designer lofts. Pila's home batteries are designed to keep critical devices like a fridge running during [&#8230;]</description>
    </item>
    <item>
      <title>Dell made a big-ass 52-inch 6K Thunderbolt display</title>
      <link>https://www.theverge.com/tech/846600/dell-52-ultrasharp-thunderbolt-64-specs</link>
      <pubDate>2026-01-06T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=846600</guid>
      <description>The world's first 52-inch 6K monitor has arrived in Dell's UltraSharp 52 Thunderbolt Hub Monitor, which was announced at CES 2026. It's a 21:9 aspect ratio screen that's slightly curved (4200R) and can display up to 6,144 x 2,560 at up to 120Hz refresh rate (with VRR support). Its IPS Black panel type offers deeper [&#8230;]</description>
    </item>
    <item>
      <title>Dell&#8217;s new 4K QD-OLED monitor offers true 10-bit color</title>
      <link>https://www.theverge.com/tech/846633/dell-4k-32-qdoled-color-grading-specs-ultrasharp</link>
      <pubDate>2026-01-06T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=846633</guid>
      <description>Dell announced at CES 2026 that it'll launch the UltraSharp 32 4K QD-OLED Monitor on February 24th for $2,599.99. Despite having released a productivity-focused 4K QD-OLED of the same size in 2025 that regularly sold for well under $1,000, its new one costs more mainly due to having greater color accuracy for creative professionals. The [&#8230;]</description>
    </item>
    <item>
      <title>Vibe Bot is an AI agent that sits on your desk</title>
      <link>https://www.theverge.com/tech/851270/vibe-bot-is-an-ai-agent-that-sits-on-your-desk</link>
      <pubDate>2026-01-06T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=851270</guid>
      <description>Smart whiteboard manufacturer Vibe is expanding further into hybrid work hardware with the Vibe Bot, a physical AI device that can serve as a voice assistant, a smart webcam, and an AI note-taker, designed for office desks and meeting rooms. Despite the name, Vibe Bot is definitely not a robot. In fact it's closer to [&#8230;]</description>
    </item>
    <item>
      <title>Razer&#8217;s new controller has TMR sticks and ultra-low latency Bluetooth for use with TVs</title>
      <link>https://www.theverge.com/news/852022/razers-new-controller-has-tmr-sticks-and-ultra-low-latency-bluetooth-for-use-with-tvs</link>
      <pubDate>2026-01-06T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=852022</guid>
      <description>Razer is announcing a new Wolverine V3 BT controller at CES 2026 that's designed for TVs. It's the world's first gamepad to use ultra-low latency Bluetooth, allowing it a sub-3ms response time, and the first accessory to launch under LG's "Designed for LG Gaming Portal" program. But since it's been developed in collaboration with LG, [&#8230;]</description>
    </item>
    <item>
      <title>Ring&#8217;s Mobile Security Trailer provides 360-degree coverage anywhere</title>
      <link>https://www.theverge.com/tech/852890/ring-mobile-security-elite-camera-ces</link>
      <pubDate>2026-01-06T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=852890</guid>
      <description>Ring is introducing a host of new security devices and technologies, including a new line of security cameras and a mobile trailer equipped with a camera that can cover large areas. While these devices were developed mostly for enterprise-level security, they can be purchased and used for home and other uses as well. To begin, [&#8230;]</description>
    </item>
    <item>
      <title>Razer made a concept gaming chair with speakers, RGB lights, and rumble</title>
      <link>https://www.theverge.com/tech/854601/razer-concept-gaming-chair-speakers-rgb-lights-rumble</link>
      <pubDate>2026-01-06T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=854601</guid>
      <description>Razer is combining its various gaming chair add-ons of speakers, RGB lighting, and force feedback into one proof of concept: Project Madison. It features dual RGB light strips in the top corners, a pair of THX-certified speakers with spatial audio (which can act as the rear channels in 5.1 or 7.1 audio setups), and six [&#8230;]</description>
    </item>
    <item>
      <title>Aqara came to CES with something to prove</title>
      <link>https://www.theverge.com/tech/854695/aqara-came-to-ces-with-something-to-prove</link>
      <pubDate>2026-01-06T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=854695</guid>
      <description>Aqara came to Vegas with a number of smart home firsts in its rapidly growing portfolio. It's showcasing an impressive smart lock that unlocks on approach, a thermostat with support for Apple's Adaptive Temperature and Clean Energy Guidance, a Matter-enabled camera, and a pair of sensors to track human occupants and objects. The Camera Hub [&#8230;]</description>
    </item>
    <item>
      <title>Amazon&#8217;s Ring doorbells get fire alerts, an app store and new sensors</title>
      <link>https://techcrunch.com/2026/01/06/amazons-ring-doorbells-get-fire-alerts-an-app-store-and-new-sensors/</link>
      <pubDate>Tue, 06 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3080190</guid>
      <description>The new Ring Sensors can detect motion, openings, glass breakage, and smoke, and can also monitor carbon monoxide levels, leaks, temperature changes, and air quality.</description>
    </item>
    <item>
      <title>Wireless charging, super-fast unlocking, and built-in solar panels &#8211; the next generation of smart locks from CES 2026</title>
      <link>https://www.techradar.com/tech-events/ces-2026-smart-locks</link>
      <pubDate>Tue, 06 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">PhsS72WLaXDnbzuSaNEFZW</guid>
      <description>Home security is a hot topic at CES, with locks that are smarter, more secure, and simpler to use than ever.</description>
    </item>
    <item>
      <title>NVIDIA's G-Sync Pulsar tech can minimize motion blur for gamers</title>
      <link>https://www.engadget.com/gaming/pc/nvidias-g-sync-pulsar-tech-can-minimize-motion-blur-for-gamers-140000058.html?src=rss</link>
      <pubDate>Tue, 06 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">48f42961-91d1-4d73-8904-23270bcb06ea</guid>
      <description>NVIDIA has unveiled the G-Sync Pulsar, which it calls the &#8220;latest evolution of [its] pioneering VRR (variable refresh rate) technology,&#8221; at CES 2026. The new tech promises a gaming experience that&#8217;s free of stutter with buttery smooth motion, which is made possible by pulsing the display&#8217;s backlight. G-Sync Pulsar displays have multiple horizontal backlight sections that are pulsed independently from top to bottom, unlike traditional displays whose backlight is always on. When the backlight is always active, the image fades from one frame to the next. The displays with the new tech give pixels...</description>
    </item>
    <item>
      <title>Razer's Project Motoko is a concept gaming headset that doubles as an AI wearable</title>
      <link>https://www.engadget.com/gaming/razers-project-motoko-is-a-concept-gaming-headset-that-doubles-as-an-ai-wearable-140000534.html?src=rss</link>
      <pubDate>Tue, 06 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">8c794e1d-0014-4482-945d-0226a493ff49</guid>
      <description>We see plenty of far-out ideas on the CES show floor, and this year Razer brought in a concept piece called Project Motoko. The device is Razer's take on blurring the line between a gaming headset and an AI-powered wearable for daily life. Or it's a way for Ghost in the Shell fans to feel affronted by Razer taking The Major's name in vain, take your pick.&#160;Project Motoko is powered by Qualcomm's Snapdragon platforms. The headset has a pair of first-person view cameras positioned at eye level that can support real-time object and text recognition. It also has a wide field of attention that can c...</description>
    </item>
    <item>
      <title>Razer's Project Madison concept chair has reactive lighting, immersive audio and multi-zone haptics</title>
      <link>https://www.engadget.com/gaming/razers-project-madison-concept-chair-has-reactive-lighting-immersive-audio-and-multi-zone-haptics-140000118.html?src=rss</link>
      <pubDate>Tue, 06 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">9a19338c-cd40-463e-b114-a860d93c938e</guid>
      <description>Razer is once again thinking big about what a gaming chair can do, and its concept for CES 2026 isn't just a chair but an entire multisensory experience to match whatever's happening on-screen. The concept, called Project Madison, combines reactive lighting, spatial audio and multi-zone haptic feedback to make the player feel more immersed in the in-game environment. We're talking Razer Chroma light strips along the head flaps, THX Spatial Audio for 5.1 or 7.1 surround sound and six haptic motor actuators powered by Razer Sensa HD Haptics to bring the physical sensations of a game to life. One...</description>
    </item>
    <item>
      <title>Ring relaunches its suite of smart home sensors</title>
      <link>https://www.engadget.com/home/smart-home/ring-relaunches-its-suite-of-smart-home-sensors-140000667.html?src=rss</link>
      <pubDate>Tue, 06 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">56efeb3d-b14a-48a6-ac82-f62d3b16dd0c</guid>
      <description>Ring turned up to CES with a whole host of announcements, including a revamped range of home sensors. Ring Sensors (for that is their name) is a new lineup of tools, built on Amazon&#8217;s Sidewalk low-power networking protocol. That includes updated versions of its door, window and break glass sensors, as well as a new OBD-II car alarm, motion detectors and panic buttons. You&#8217;ll be able to pre-order the new car alarm today, while the rest of the new sensors will be available at some point in March. And, in tandem with that news, Amazon is announcing that Sidewalk is expanding outside of the US, st...</description>
    </item>
    <item>
      <title>J&#8217;ai vu le Dell UltraSharp 52 : l&#8217;&#233;cran 6K qui remplace 4 moniteurs</title>
      <link>https://www.frandroid.com/marques/dell/2926303_jai-vu-le-dell-ultrasharp-52-lecran-6k-qui-remplace-4-moniteurs</link>
      <pubDate>Tue, 06 Jan 2026 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/dell/2926303_jai-vu-le-dell-ultrasharp-52-lecran-6k-qui-remplace-4-moniteurs</guid>
      <description>
Vous avez deux &#233;crans ? Trois ? Quatre ? Arr&#234;tez tout. J'ai pos&#233; les yeux sur le Dell UltraSharp 52 Thunderbolt Hub, et c'est une vision assez terrifiante d'efficacit&#233;. C'est une dalle unique de 52 pouces en 6K qui remplace tout votre bazar de c&#226;bles. C'est impressionnant, m&#234;me si le choix de la dalle va faire d&#233;battre.
</description>
    </item>
    <item>
      <title>Birdbuddy unveils its most affordable 'mini' bird feeder camera &#8212; and it can identify birds by their song</title>
      <link>https://www.techradar.com/cameras/birdbuddy-unveils-its-most-affordable-mini-bird-feeder-camera-and-it-can-identify-birds-by-their-song</link>
      <pubDate>Tue, 06 Jan 2026 13:58:55 +0000</pubDate>
      <guid isPermaLink="false">cm2weZCvEK4gyYjiFR7jcH</guid>
      <description>Birdbuddy unveils its smallest and most accessible bird feeder camera yet &#8211; the Birdbuddy 2 Mini &#8211; and it can ID birds by visual and audio cues</description>
    </item>
    <item>
      <title>Voici la nouvelle arme d&#8217;Uber pour battre Tesla dans la guerre des taxis autonomes</title>
      <link>https://www.frandroid.com/marques/lucid/2931063_voici-la-nouvelle-arme-duber-pour-battre-tesla-dans-la-guerre-des-taxis-autonomes</link>
      <pubDate>Tue, 06 Jan 2026 13:57:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lucid/2931063_voici-la-nouvelle-arme-duber-pour-battre-tesla-dans-la-guerre-des-taxis-autonomes</guid>
      <description>
L'alliance entre Lucid, Uber et Nuro franchit un nouveau cap avec la pr&#233;sentation au CES 2026 d'un taxi autonome premium bas&#233; sur le SUV &#233;lectrique Gravity. Objectif affich&#233; : d&#233;ployer plus de 20 000 v&#233;hicules dans les cinq prochaines ann&#233;es.
</description>
    </item>
    <item>
      <title>Retour vers le futur&#160;: HP red&#233;couvre l&#8217;ordinateur &#171;&#160;tout-en-un&#160;&#187; dans un clavier</title>
      <link>https://www.01net.com/actualites/retour-vers-le-futur-hp-redecouvre-lordinateur-tout-en-un-dans-un-clavier.html</link>
      <pubDate>Tue, 06 Jan 2026 13:57:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318414</guid>
      <description>L'histoire (de l'informatique) repasse les plats. HP a red&#233;couvert les ordinateurs qui tiennent dans un clavier avec l'Eliteboard G1a ! Alors certes, on est loin d'une machine ultra-puissante, mais ce PC tout-en-un ultra-compact assume pleinement sa vocation : un poste de travail discret, facile &#224; d&#233;ployer et suffisamment v&#233;loce pour les usages bureautiques....</description>
    </item>
    <item>
      <title>Un casque gamer avec 90h d&#8217;autonomie : l&#8217;Asus ROG Pelta chute enfin sous les 100 &#8364; en 2026</title>
      <link>https://www.frandroid.com/bons-plans/2605313_un-casque-gamer-avec-90h-dautonomie-lasus-rog-pelta-chute-sous-les-100-euros-en-2026</link>
      <pubDate>Tue, 06 Jan 2026 13:55:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2605313_un-casque-gamer-avec-90h-dautonomie-lasus-rog-pelta-chute-sous-les-100-euros-en-2026</guid>
      <description>
Depuis la nouvelle ann&#233;e 2026, il y a de tr&#232;s bonnes affaires &#224; saisir c&#244;t&#233; Tech, comme ce casque wireless Asus ROG Pelta disponible &#224; 99,99 euros sur Amazon, au lieu de 149 euros habituellement. 
</description>
    </item>
    <item>
      <title>Acer poursuit son offensive dans les trottinettes &#233;lectriques avec un nouveau mod&#232;le abouti</title>
      <link>https://www.frandroid.com/survoltes/trottinette-electrique/2930767_acer-poursuit-son-offensive-dans-les-trottinettes-electriques-avec-un-nouveau-modele-abouti</link>
      <pubDate>Tue, 06 Jan 2026 13:48:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/trottinette-electrique/2930767_acer-poursuit-son-offensive-dans-les-trottinettes-electriques-avec-un-nouveau-modele-abouti</guid>
      <description>
Toujours dans cette volont&#233; de grignoter des parts &#224; Segway-Ninebot et Xiaomi, le groupe ta&#239;wanais Acer lance une nouvelle trottinette Acer Predator Storm Pro &#224; double suspension, avec un &#233;clairage personnalisable et une puissance soutenue.
</description>
    </item>
    <item>
      <title>New PlayStation tech patent called Ghost Player will take over players' games when they get stuck</title>
      <link>https://www.techradar.com/gaming/new-playstation-tech-patent-called-ghost-player-will-take-over-players-games-when-they-get-stuck</link>
      <pubDate>Tue, 06 Jan 2026 13:44:37 +0000</pubDate>
      <guid isPermaLink="false">zsnnBwDKvjGQTFHUKsYs2V</guid>
      <description>Sony has patented new AI technology that will take control of PlayStation games when the player gets stuck, offering limited to comprehensive solutions to problems. The system would also be trained on gameplay videos from YouTube and Twitch, as well as PSN data.</description>
    </item>
    <item>
      <title>Paris court finds 10 people guilty of cyberbullying Brigitte Macron</title>
      <link>https://www.engadget.com/social-media/paris-court-finds-10-people-guilty-of-cyberbullying-brigitte-macron-195500994.html?src=rss</link>
      <pubDate>Tue, 06 Jan 2026 13:43:31 +0000</pubDate>
      <guid isPermaLink="false">9f9f3597-08dc-42a1-8337-e67318bbf482</guid>
      <description>A Paris court has found 10 people guilty of cyberbullying Brigitte Macron, wife of President of France Emmanuel Macron, the BBC reports. The judge found that the defendants made false claims about Macron's gender and sexuality, and "malicious remarks" about the 24-year age gap between Macron and her spouse.Of the ten defendants, only one received a firm prison sentence of six months, according to&#160;LeMonde. Eight others received suspended sentences (effectively probation in France) of four to eight months, while the 10th person received a fine and was required to attend a sensitivity training co...</description>
    </item>
    <item>
      <title>Trois duplex en direct de Las Vegas et une tripot&#233;e de produits atypiques : rendez-vous ce soir pour un Unlock Talk de folie</title>
      <link>https://www.frandroid.com/humanoid/emissions/2930261_trois-duplex-en-direct-de-las-vegas-et-une-tripotee-de-produits-atypiques-rendez-vous-ce-soir-pour-un-unlock-talk</link>
      <pubDate>Tue, 06 Jan 2026 13:43:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/humanoid/emissions/2930261_trois-duplex-en-direct-de-las-vegas-et-une-tripotee-de-produits-atypiques-rendez-vous-ce-soir-pour-un-unlock-talk</guid>
      <description>
Direction Las Vegas et le Consumer Electronics Show (CES) pour la nouvelle ann&#233;e 2026. Comme &#224; l'accoutum&#233;e, Unlock Talk couvre le salon am&#233;ricain depuis Paris et la Ville du Vice, avec une &#233;mission Twitch sp&#233;cialement d&#233;di&#233;e o&#249; auront lieu pas moins de trois Duplex en direct.
</description>
    </item>
    <item>
      <title>Samsung corrige enfin le plus gros d&#233;faut des &#233;crans pliants</title>
      <link>https://www.frandroid.com/marques/samsung/2930627_samsung-corrige-enfin-le-plus-gros-defaut-des-ecrans-pliants</link>
      <pubDate>Tue, 06 Jan 2026 13:34:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2930627_samsung-corrige-enfin-le-plus-gros-defaut-des-ecrans-pliants</guid>
      <description>
Samsung profite du CES 2026 pour d&#233;voiler la nouvelle version de ses &#233;crans pliables sans la caract&#233;ristique pliure centrale avec le Galaxy Z Fold 8.
</description>
    </item>
    <item>
      <title>What does the new Lego Smart Brick actually do? Here are 3 ways it seriously upgrades your models</title>
      <link>https://www.techradar.com/streaming/entertainment/what-does-the-new-lego-smart-brick-actually-do-here-are-3-ways-it-seriously-upgrades-your-models</link>
      <pubDate>Tue, 06 Jan 2026 13:33:02 +0000</pubDate>
      <guid isPermaLink="false">fNagC3ritZEfZP82dvZFMH</guid>
      <description>Like the look of the Lego Smart Brick? These are the key things you need to know.</description>
    </item>
  </channel>
</rss>
