<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 02 Dec 2025 14:51:28 GMT</lastBuildDate>
    <item>
      <title>Some of the stuff we bought during Black Friday and Cyber Monday</title>
      <link>https://www.theverge.com/gadgets/835160/black-friday-cyber-monday-deals-staff-shopping</link>
      <pubDate>2025-12-02T09:48:23-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=835160</guid>
      <description>It&#8217;s one thing to do a bit of online shopping during the Black Friday / Cyber Monday sales, but it&#8217;s another to put your money where your mouth is. (Where&#160;did&#160;that phrase come from, anyway?) If you&#8217;re curious what our writers, editors, and reviewers bought for themselves, here are some of the items, many of which [&#8230;]</description>
    </item>
    <item>
      <title>&#171;&#160;Code rouge&#160;&#187; chez ChatGPT&#160;: OpenAI changerait de strat&#233;gie &#224; cause de Gemini</title>
      <link>https://www.01net.com/actualites/code-rouge-chez-chatgpt-openai-changerait-strategie-cause-gemini.html</link>
      <pubDate>Tue, 02 Dec 2025 14:47:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313112</guid>
      <description>Alerte rouge chez OpenAI ! Face au succ&#232;s de Gemini 3, la start-up aurait d&#233;cid&#233; de revoir sa strat&#233;gie. Plusieurs projets de taille auraient &#233;t&#233; suspendus de toute urgence. L&#8217;entreprise se concentrerait d&#233;sormais sur l'am&#233;lioration de ChatGPT.</description>
    </item>
    <item>
      <title>Apple will reportedly refuse India&amp;#8217;s order to preinstall a government app</title>
      <link>https://www.theverge.com/news/836384/apple-india-sanchar-saathi-app-response</link>
      <pubDate>2025-12-02T09:46:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=836384</guid>
      <description>Apple is not planning to comply with an order from the Indian government directing phone manufacturers to preload a state-backed cybersecurity app, according to Reuters.&#160; Industry sources tell Reuters that Apple plans to tell India&#8217;s government that they don&#8217;t comply with requests like this due to privacy and security concerns. However, Apple won&#8217;t go to [&#8230;]...</description>
    </item>
    <item>
      <title>Wooting&#8217;s 60HE v2 is a solid upgrade to the best gaming keyboard</title>
      <link>https://www.theverge.com/tech/836168/wooting-60he-v2-keyboard-gaming-hands-on</link>
      <pubDate>2025-12-02T09:45:45-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=836168</guid>
      <description>Over the past couple of years, I've tried to switch to many different gaming keyboards and always ended up back with a Wooting 60HE. Wooting changed PC gaming with the 60HE, popularizing the use of Hall effect switches and a Rapid Trigger system that speeds up how quickly you can activate keys. Now it's back [&#8230;]</description>
    </item>
    <item>
      <title>Xbox Game Pass en d&#233;cembre 2025 : le plus grand aventurier et une flop&#233;e de p&#233;pites ind&#233;s</title>
      <link>https://www.frandroid.com/actualites-generales/2895779_xbox-game-pass-en-decembre-2025-le-plus-grand-aventurier-et-une-flopee-de-pepites-indes</link>
      <pubDate>Tue, 02 Dec 2025 14:44:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2895779_xbox-game-pass-en-decembre-2025-le-plus-grand-aventurier-et-une-flopee-de-pepites-indes</guid>
      <description>
Pour finir l'ann&#233;e 2025 en beaut&#233;, Microsoft d&#233;ploie l'artillerie lourde dans le Xbox Game Pass. Entre l'arriv&#233;e tr&#232;s attendue d'Indiana Jones, le d&#233;barquement de Mortal Kombat 1 et une foule de p&#233;pites ind&#233;s, le mois de d&#233;cembre s'annonce tr&#232;s prometeur.
</description>
    </item>
    <item>
      <title>Sam Altman calls a &#8216;code red&#8217; for ChatGPT &#8211; here&#8217;s what it will mean for you</title>
      <link>https://www.techradar.com/ai-platforms-assistants/chatgpt/sam-altman-calls-a-code-red-for-chatgpt-heres-what-it-will-mean-for-you</link>
      <pubDate>Tue, 02 Dec 2025 14:43:36 +0000</pubDate>
      <guid isPermaLink="false">tRWFdTxnM9KGiehtJGKGVd</guid>
      <description>Sam Altman is calling a "code red" on improving the ChatGPT experience for users, but will that be a good thing for you?</description>
    </item>
    <item>
      <title>Sony A7 V vs Sony A7 IV: 5 key upgrades in Sony's latest full-frame all-rounder</title>
      <link>https://www.techradar.com/cameras/mirrorless-cameras/sony-a7-v-vs-sony-a7-iv-5-key-upgrades-in-sonys-latest-full-frame-all-rounder</link>
      <pubDate>Tue, 02 Dec 2025 14:35:01 +0000</pubDate>
      <guid isPermaLink="false">o7EUDQ53Dhys3SFgJgdSbH</guid>
      <description>They look largely the same, but with four years between the Sony A7V and Sony A7 IV, there are several upgrades in the latest model &#8211; I've highlighted the ones you need to know about.</description>
    </item>
    <item>
      <title>Amazon is testing 30-minute deliveries</title>
      <link>https://www.theverge.com/news/836337/amazon-now-30-minute-delivery-tests</link>
      <pubDate>2025-12-02T09:32:48-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=836337</guid>
      <description>Amazon is starting to test ultra-fast deliveries that aim to drop household goods at your doorstep in 30 minutes or less. The Amazon Now service is launching now in parts of Seattle and Philadelphia, according to Amazon&#8217;s announcement, allowing eligible customers to shop for items like fresh milk, eggs, produce, cosmetics, electronics, household essentials, over-the-counter [&#8230;]...</description>
    </item>
    <item>
      <title>Quels sont les meilleurs TV Oled en 2025&#8201;?</title>
      <link>https://www.frandroid.com/guide-dachat/679063_quelles-sont-les-meilleures-tv-oled-en-2020-notre-selection</link>
      <pubDate>Tue, 02 Dec 2025 14:30:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/679063_quelles-sont-les-meilleures-tv-oled-en-2020-notre-selection</guid>
      <description>
La technologie Oled est reine pour parmi les t&#233;l&#233;viseurs haut de gamme, gr&#226;ce &#224; ses excellents contrastes et la profondeur de ses noirs. Nous avons s&#233;lectionn&#233; et rassembl&#233; ici les meilleurs TV Oled que nous avons test&#233;s.
</description>
    </item>
    <item>
      <title>Cyber Monday is over, but the Nintendo Switch 2 is still a record low price</title>
      <link>https://www.techradar.com/gaming/cyber-monday-is-over-but-the-nintendo-switch-2-is-still-a-record-low-price</link>
      <pubDate>Tue, 02 Dec 2025 14:26:44 +0000</pubDate>
      <guid isPermaLink="false">6Rwbic8bguwNjVaAU4F3Rg</guid>
      <description>Pick up a Nintendo Switch 2 and a get free copy of Mario Kart World thanks to this huge discount at Walmart.</description>
    </item>
    <item>
      <title>4.3 million have installed this malicious browser extension on Chrome and Edge - here's how to check</title>
      <link>https://www.techradar.com/pro/security/4-3-million-have-installed-this-malicious-browser-extension-on-chrome-and-edge-heres-how-to-check</link>
      <pubDate>Tue, 02 Dec 2025 14:23:00 +0000</pubDate>
      <guid isPermaLink="false">H8ozX2DhZFVTZTm3P3EFGe</guid>
      <description>After five years, browser extensions turned malicious, putting countless people at risk.</description>
    </item>
    <item>
      <title>Voici comment One UI 8.5 veut en finir avec les applications pleines de pubs</title>
      <link>https://www.frandroid.com/marques/samsung/2895625_voici-comment-one-ui-8-5-veut-en-finir-avec-les-applications-pleines-de-pubs</link>
      <pubDate>Tue, 02 Dec 2025 14:15:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2895625_voici-comment-one-ui-8-5-veut-en-finir-avec-les-applications-pleines-de-pubs</guid>
      <description>
La prochaine mise &#224; jour de One UI s'attaque aux applis un peu trop charg&#233;es en publicit&#233;s avec une option cach&#233;e, mais bien pratique.
</description>
    </item>
    <item>
      <title>Bose QC Ultra II : le meilleur casque audio du moment perd 50 &#8364; juste apr&#232;s le Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2832759_bose-qc-ultra-ii-le-meilleur-casque-audio-du-moment-perd-50-juste-apres-le-black-friday</link>
      <pubDate>Tue, 02 Dec 2025 14:13:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2832759_bose-qc-ultra-ii-le-meilleur-casque-audio-du-moment-perd-50-juste-apres-le-black-friday</guid>
      <description>
Apr&#232;s le Black Friday, on trouve encore de belles offres : comme cette promotion sur le r&#233;cent Bose QuietComfort Ultra II qui passe de 449 euros &#224; 399 euros chez plusieurs e-commer&#231;ants. 
</description>
    </item>
    <item>
      <title>Sony Alpha 7 V : ce nouvel hybride plein format veut devenir le roi de la vitesse et de l&#8217;autofocus</title>
      <link>https://www.frandroid.com/marques/sony/2893771_sony-alpha-7-v-ce-nouvel-hybride-plein-format-veut-devenir-le-roi-de-la-vitesse-et-de-lautofocus</link>
      <pubDate>Tue, 02 Dec 2025 14:07:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2893771_sony-alpha-7-v-ce-nouvel-hybride-plein-format-veut-devenir-le-roi-de-la-vitesse-et-de-lautofocus</guid>
      <description>
Sony a pr&#233;sent&#233;, ce mardi, son nouvel appareil photo hybride plein format, le Sony&#160;A7 V. S'il conserve la d&#233;finition de son pr&#233;d&#233;cesseur, il se veut plus rapide aussi bien en photo qu'en vid&#233;o. 
</description>
    </item>
    <item>
      <title>PS5 : sans le dire &#224; personne, Sony a modifi&#233; un d&#233;tail pourtant crucial de ses consoles</title>
      <link>https://www.frandroid.com/marques/sony/2895023_ps5-sans-le-dire-a-personne-sony-a-modifie-un-detail-pourtant-crucial-de-ses-consoles</link>
      <pubDate>Tue, 02 Dec 2025 14:06:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2895023_ps5-sans-le-dire-a-personne-sony-a-modifie-un-detail-pourtant-crucial-de-ses-consoles</guid>
      <description>
Les PlayStation 5 les plus r&#233;cemment sorties d'usine profitent d'un changement tr&#232;s utile mais bien cach&#233; dans leurs entrailles : le passage &#224; une nouvelle technique d'application de leur m&#233;tal liquide. On vous explique en quoi c'est une tr&#232;s bonne nouvelle.
</description>
    </item>
    <item>
      <title>Google corrige 107 failles Android, dont 2 vuln&#233;rabilit&#233;s exploit&#233;es dans des attaques</title>
      <link>https://www.01net.com/actualites/google-corrige-107-failles-android-2-vulnerabilites-exploitees-attaques.html</link>
      <pubDate>Tue, 02 Dec 2025 14:01:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313073</guid>
      <description>Google corrige plus de 100 failles identifi&#233;es dans le code d'Android. Parmi les br&#232;ches, on trouve deux vuln&#233;rabilit&#233;s activement exploit&#233;es par des cybercriminels dans le cadre de cyberattaques.</description>
    </item>
    <item>
      <title>I tested the new Sony A7 V, and now it's my favorite Sony camera ever</title>
      <link>https://www.techradar.com/cameras/sony-a7-v-review</link>
      <pubDate>Tue, 02 Dec 2025 14:01:00 +0000</pubDate>
      <guid isPermaLink="false">MN8DTu7JxDHWeENXpnMkhW</guid>
      <description>Bang on cue, the Sony A7 V has arrived and it blurs the lines between enthusiast and pro cameras forever</description>
    </item>
    <item>
      <title>The First Reactions to &#8216;Avatar: Fire and Ash&#8217; Are Flying In</title>
      <link>https://gizmodo.com/avatar-3-reviews-reactions-james-cameron-2000694243</link>
      <pubDate>Tue, 02 Dec 2025 14:00:20 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000694243</guid>
      <description>The new James Cameron film starring Sam Worthington and Zoe Salda&#241;a opens December 19.</description>
    </item>
    <item>
      <title>Sony&#8217;s new A7 V uses a partially stacked sensor so you can shoot silently</title>
      <link>https://www.theverge.com/news/835420/sony-a7v-mirrorless-camera-partially-stacked-sensor-price-specs</link>
      <pubDate>2025-12-02T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=835420</guid>
      <description>Sony is announcing the A7 V, its first camera with a partially stacked sensor and various features borrowed from pricier Alpha models. It will be available body-only in late December for $2,899, and a kit including a new 28-70mm f/3.5-5.6 OSS II lens is coming in February.&#160; The A7 V is one of Sony&#8217;s most [&#8230;]</description>
    </item>
    <item>
      <title>YouTube introduces its own version of Spotify Wrapped for videos</title>
      <link>https://www.theverge.com/news/836173/youtube-recap-videos-eoy-review-wrapped</link>
      <pubDate>2025-12-02T09:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=836173</guid>
      <description>YouTube is rolling out a new roundup experience that lets you quickly review your most notable video habits over the last year. The Recap feature &#8220;uniquely highlights interests, deep dives, and moments&#8221; based on your watch history, according to YouTube&#8217;s announcement, providing up to 12 cards that spotlight top channels, interests, and how your taste [&#8230;]...</description>
    </item>
    <item>
      <title>Apple Music&#8217;s Replay 2025 is here</title>
      <link>https://techcrunch.com/2025/12/02/apple-musics-replay-2025-is-here/</link>
      <pubDate>Tue, 02 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3071320</guid>
      <description>This year, Apple Music Replay includes even more listening habits, including the "Discovery" section, which highlights new artists users listened to, and "Loyalty," which spotlights artists that users have kept coming back to each year.</description>
    </item>
    <item>
      <title>Ex-engineer blasts Microsoft &#8211; argues it must fix Windows 11 'until it doesn't suck', never mind about AI</title>
      <link>https://www.techradar.com/computing/windows/ex-engineer-blasts-microsoft-argues-it-must-fix-windows-11-until-it-doesnt-suck-never-mind-about-ai</link>
      <pubDate>Tue, 02 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">oEojqfmsVKZDDkojhGGcMN</guid>
      <description>Fed up with Microsoft's big push for AI? Wish it would fix the basic problems with Windows 11 instead? You are very much not alone.</description>
    </item>
    <item>
      <title>YouTube Recap is a fascinating review of your year in videos &#8211; here&#8217;s how to find it</title>
      <link>https://www.techradar.com/streaming/youtube-recap-is-a-fascinating-review-of-your-year-in-videos-heres-how-to-find-it</link>
      <pubDate>Tue, 02 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">wH4f9PULMQbPJZjyjiTCeZ</guid>
      <description>YouTube is joining in with the end-of-year summaries, and you should be able to find yours in your account now.</description>
    </item>
    <item>
      <title>Ascentra Labs raises $2 million to help consultants use AI instead of all-night Excel marathons</title>
      <link>https://venturebeat.com/ai/ascentra-labs-raises-usd2-million-to-help-consultants-use-ai-instead-of-all</link>
      <pubDate>Tue, 02 Dec 2025 14:00:00 GMT</pubDate>
      <guid isPermaLink="false">19V0UlgPojZ7W1OwbJxHN5</guid>
      <description>
While artificial intelligence has stormed into law firms and accounting practices with billion-dollar startups like Harvey leading the charge, the global consulting industry&#8212;a $250 billion behemoth&#8212;has remained stubbornly analog. A London-based startup founded by former McKinsey consultants is betting $2 million that it can crack open this resistant market, one Excel spreadsheet at a time.Ascentra Labs announced Monday that it has closed a $2 million seed round led by NAP, a Berlin-based venture capital firm formerly known as Cavalry Ventures. The funding comes with participation from notable...</description>
    </item>
    <item>
      <title>La R5 &#233;lectrique franchit un cap symbolique et s&#8217;offre une fonction attendue de longue date</title>
      <link>https://www.frandroid.com/marques/renault/2895517_la-r5-electrique-franchit-un-cap-symbolique-et-soffre-une-fonction-attendue-de-longue-date</link>
      <pubDate>Tue, 02 Dec 2025 13:54:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2895517_la-r5-electrique-franchit-un-cap-symbolique-et-soffre-une-fonction-attendue-de-longue-date</guid>
      <description>
&#199;a y est, la Renault 5 E-Tech a franchi le cap du 100&#160;000&#7497;&#160;exemplaire produit. &#192; l'occasion de cette c&#233;l&#233;bration, la marque annonce enfin l'arriv&#233;e du "one-pedal" sur sa petite voiture &#233;lectrique en janvier 2026.
</description>
    </item>
    <item>
      <title>The Lenovo Idea Tab Pro is the best iPad alternative, and it's 33% off in this post-Black Friday deal</title>
      <link>https://www.techradar.com/tablets/the-lenovo-idea-tab-pro-is-the-best-ipad-alternative-and-its-33-percent-off-in-this-post-black-friday-deal</link>
      <pubDate>Tue, 02 Dec 2025 13:48:28 +0000</pubDate>
      <guid isPermaLink="false">F7yNQBjCiV9i4fvULzzYoN</guid>
      <description>The Lenovo Idea Tab Pro is one of the best cheap tablets around, and it's currently 33% off in the post-Cyber Monday deals.</description>
    </item>
    <item>
      <title>&#171; Nous avons banni des tricheurs qui streamaient en direct &#187; : l&#8217;anti-cheat de Battlefield 6 ne pardonne pas, voici les chiffres &#233;difiants</title>
      <link>https://www.frandroid.com/produits-android/console/2895411_nous-avons-banni-des-tricheurs-qui-streamaient-en-direct-lanti-cheat-de-battlefield-6-ne-pardonne-pas-voici-les-chiffres-edifiants</link>
      <pubDate>Tue, 02 Dec 2025 13:47:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2895411_nous-avons-banni-des-tricheurs-qui-streamaient-en-direct-lanti-cheat-de-battlefield-6-ne-pardonne-pas-voici-les-chiffres-edifiants</guid>
      <description>
EA fait le point sur son syst&#232;me d'anti-triche pr&#232;s de deux mois apr&#232;s le lancement de Battlefield 6. Et les chiffres sont tr&#232;s encourageants.
</description>
    </item>
    <item>
      <title>Une immense tache braqu&#233;e sur nous : notre Soleil va-t-il nous rejouer l&#8217;&#233;v&#233;nement de Carrington&#8201;?</title>
      <link>https://www.futura-sciences.com/sciences/actualites/soleil-immense-tache-braquee-nous-notre-soleil-va-t-il-nous-rejouer-evenement-carrington-128141/#xtor%3DRSS-8</link>
      <pubDate>Tue, 02 Dec 2025 14:44:37 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/soleil-immense-tache-braquee-nous-notre-soleil-va-t-il-nous-rejouer-evenement-carrington-128141/#xtor%3DRSS-8</guid>
      <description>Il y a&#160;actuellement&#160;une immense tache &#224; la surface de notre Soleil. Une tache dont la taille rappelle celle qui a d&#233;clench&#233; la plus grande temp&#234;te solaire jamais enregistr&#233;e : l&#8217;&#233;v&#233;nement de Carrington. Faut-il s&#8217;inqui&#233;ter&#8201;?</description>
    </item>
    <item>
      <title>&#192; vous les couleurs &#233;clatantes dans vos jeux avec cet &#233;cran LG OLED de 32&#8243; &#224; 165 Hz qui dilue son prix de 30 %</title>
      <link>https://www.frandroid.com/marques/2894985_a-vous-les-couleurs-eclatantes-dans-vos-jeux-avec-cet-ecran-lg-oled-de-32-a-165-hz-qui-dilue-son-prix-de-30</link>
      <pubDate>Tue, 02 Dec 2025 13:34:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2894985_a-vous-les-couleurs-eclatantes-dans-vos-jeux-avec-cet-ecran-lg-oled-de-32-a-165-hz-qui-dilue-son-prix-de-30</guid>
      <description>
Vous avez envie de bousculer votre mani&#232;re de voir vos jeux ? Et si une dalle OLED sign&#233;e par l&#8217;un des ma&#238;tres du genre devenait votre passeport pour le pays des merveilles ? C&#8217;est exactement ce que promet le LG UltraGear 32GX850A : une dalle OLED fluide, compatible 4K et HDR et 165 Hz qui passe &#224; 704 euros au lieu de 999 euros.
</description>
    </item>
    <item>
      <title>Quels sont les meilleurs smartphones pliables ? Samsung Galaxy Z, Honor Magic, Motorola Razr&#8230; le comparatif</title>
      <link>https://www.frandroid.com/guide-dachat/1617799_meilleur-smartphone-pliant-quel-telephone-pliable-choisir</link>
      <pubDate>Tue, 02 Dec 2025 13:30:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1617799_meilleur-smartphone-pliant-quel-telephone-pliable-choisir</guid>
      <description>
Les smartphones pliants envahissent le march&#233;. Tr&#232;s compacts une fois referm&#233;s, ils d&#233;ploient de grands &#233;crans pour une exp&#233;rience visuelle plus agr&#233;able. D&#233;couvrez ici notre s&#233;lection des meilleurs mod&#232;les pliables, test&#233;s et approuv&#233;s par nos soins.
</description>
    </item>
    <item>
      <title>The Nikon ZR gets surprisingly close to a real RED camera (for a lot less money)</title>
      <link>https://www.theverge.com/gadgets/829930/nikon-zr-review-red-r3d-video-files</link>
      <pubDate>2025-12-02T08:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=829930</guid>
      <description>If you shoot video professionally, there's a good chance you've salivated over a RED camera at some point. RED has long been one of the top choices for big-budget productions, offering a combination of image quality and flexibility that's unrivaled by most consumer cameras. They're also wildly expensive, topping out at around $45,000 on the [&#8230;]</description>
    </item>
    <item>
      <title>&#171; Ce partenariat n&#8217;est pas seulement n&#233;cessaire, il est transformateur &#187; : pourquoi Realme s&#8217;est associ&#233; &#224; un g&#233;ant de la photo pour ses prochains smartphones</title>
      <link>https://www.frandroid.com/marques/realme/2882759_ce-partenariat-nest-pas-seulement-necessaire-il-est-transformateur-pourquoi-realme-sest-associe-a-un-geant-de-la-photo-pour-ses-prochains-smartphones</link>
      <pubDate>Tue, 02 Dec 2025 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/realme/2882759_ce-partenariat-nest-pas-seulement-necessaire-il-est-transformateur-pourquoi-realme-sest-associe-a-un-geant-de-la-photo-pour-ses-prochains-smartphones</guid>
      <description>
&#192; l'occasion du lancement du Realme GT 8 Pro, con&#231;u en partenariat avec Ricoh, nous avons eu l'occasion de nous entretenir avec des responsables de deux marques pour mieux comprendre les coulisses de ce partenariat. 
</description>
    </item>
    <item>
      <title>Starting with The Witcher 4, CD Projekt Red CEO says the entire next Witcher trilogy starring Ciri is still expected to launch within a six year time frame</title>
      <link>https://www.techradar.com/gaming/starting-with-the-witcher-4-cd-projekt-red-ceo-says-the-entire-next-witcher-trilogy-starring-ciri-is-still-expected-to-launch-within-a-six-year-time-frame</link>
      <pubDate>Tue, 02 Dec 2025 13:29:49 +0000</pubDate>
      <guid isPermaLink="false">eDudBQijy7tFN4Qqhndxya</guid>
      <description>CD Projekt Red has reaffirmed its plan to release its next trilogy of Witcher games within a six-year time frame.</description>
    </item>
    <item>
      <title>You can build a website for just $1 with IONOS right now - but this deal won&#8217;t be around for long</title>
      <link>https://www.techradar.com/pro/website-building/you-can-build-a-website-for-just-usd1-with-ionos-right-now-but-this-deal-wont-be-around-for-long</link>
      <pubDate>Tue, 02 Dec 2025 13:26:12 +0000</pubDate>
      <guid isPermaLink="false">xUzrLqiVsiZPJ8kscwkc5Y</guid>
      <description>What can you get for $1?</description>
    </item>
    <item>
      <title>Pire qu&#8217;une hausse de prix : une grave p&#233;nurie de composants PC se confirme jusqu&#8217;en 2027</title>
      <link>https://www.frandroid.com/produits-android/hardware/2895419_pire-quune-hausse-de-prix-une-grave-penurie-de-composants-pc-se-confirme-jusquen-2027</link>
      <pubDate>Tue, 02 Dec 2025 13:25:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/2895419_pire-quune-hausse-de-prix-une-grave-penurie-de-composants-pc-se-confirme-jusquen-2027</guid>
      <description>
Upgrader son PC va co&#251;ter de plus en plus cher. Le march&#233; de la m&#233;moire vive conna&#238;t une crise qui ne semble pas pr&#232;s de s'arr&#234;ter. 
</description>
    </item>
    <item>
      <title>Windows 11 : le cr&#233;ateur du Gestionnaire des t&#226;ches ne veut &#171; plus d&#8217;IA, seulement des correctifs &#187; dans Windows</title>
      <link>https://www.frandroid.com/marques/microsoft/2895095_windows-11-le-createur-du-gestionnaire-des-taches-ne-veut-plus-dia-seulement-des-correctifs-dans-windows</link>
      <pubDate>Tue, 02 Dec 2025 13:18:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2895095_windows-11-le-createur-du-gestionnaire-des-taches-ne-veut-plus-dia-seulement-des-correctifs-dans-windows</guid>
      <description>
Selon Dave Plummer, ancien d&#233;veloppeur de Microsoft et cr&#233;ateur du Gestionnaire de t&#226;ches, Windows 11 doit revenir &#224; l'essentiel et corriger ses d&#233;fauts avant de proposer de nouvelles fonctionnalit&#233;s. 
</description>
    </item>
    <item>
      <title>Derni&#232;re chance pour les retardataires du Black Friday : voici les meilleures offres encore disponibles</title>
      <link>https://www.frandroid.com/bons-plans/2894961_le-black-friday-est-termine-mais-voici-les-offres-encore-en-ligne-qui-meritent-votre-attention</link>
      <pubDate>Tue, 02 Dec 2025 13:15:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2894961_le-black-friday-est-termine-mais-voici-les-offres-encore-en-ligne-qui-meritent-votre-attention</guid>
      <description>
C&#8217;est officiel&#8230; Le Black Friday ainsi que le Cyber Monday sont termin&#233;s&#8201;! Toutefois, plusieurs offres sur des produits Tech populaires sont encore valables chez les diff&#233;rents e-commer&#231;ants, pratique pour celles et ceux qui ont loup&#233; le coche.
</description>
    </item>
    <item>
      <title>Cyber Monday is over, but Amazon Echo devices are still selling for record-low prices &#8211; for now</title>
      <link>https://www.techradar.com/home/smart-speakers/cyber-monday-is-over-but-amazon-echo-devices-are-still-selling-for-record-low-prices-for-now</link>
      <pubDate>Tue, 02 Dec 2025 13:13:42 +0000</pubDate>
      <guid isPermaLink="false">rz9QfzPHDGZuZUwcbN8j4V</guid>
      <description>There are still epic discounts on Amazon Echo speakers and smart displays, but they could disappear at any time.</description>
    </item>
    <item>
      <title>Microsoft met &#224; jour Windows 11 pour am&#233;liorer le th&#232;me sombre, mais fait buguer l&#8217;Explorateur de fichiers</title>
      <link>https://www.01net.com/actualites/windows-11-la-derniere-mise-a-jour-pour-ameliorer-le-theme-sombre-fait-buguer-lexplorateur-de-fichiers.html</link>
      <pubDate>Tue, 02 Dec 2025 13:12:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1313117</guid>
      <description>Microsoft vient de d&#233;ployer une mise &#224; jour cens&#233;e am&#233;liorer l&#8217;application du th&#232;me sombre dans le syst&#232;me d&#8217;exploitation. Malheureusement pour Microsoft, tout ne se passe pas comme pr&#233;vu.</description>
    </item>
    <item>
      <title>Google&#8217;s latest Android feature could let your boss read your RCS texts on your work phone</title>
      <link>https://www.techradar.com/phones/android/googles-latest-android-feature-could-let-your-boss-read-your-rcs-texts-on-your-work-phone</link>
      <pubDate>Tue, 02 Dec 2025 13:12:14 +0000</pubDate>
      <guid isPermaLink="false">C7mkDSYNdjKZcg6BEWaaCk</guid>
      <description>A new update to Google Pixel phones will archive your RCS texts, which your boss might be able to read.</description>
    </item>
    <item>
      <title>107 Android flaws just got patched by Google - here's how to make sure you're up to date</title>
      <link>https://www.techradar.com/pro/security/107-android-flaws-just-got-patched-by-google-heres-how-to-make-sure-youre-up-to-date</link>
      <pubDate>Tue, 02 Dec 2025 13:07:00 +0000</pubDate>
      <guid isPermaLink="false">AXYg2R27NkTbujDvMV8HRM</guid>
      <description>Among them are two actively exploited bugs, allegedly used by state-sponsored actors.</description>
    </item>
    <item>
      <title>How to watch What is the Monachy for? on BBC iplayer (it's *FREE*)</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/how-to-watch-what-is-the-monachy-for-on-bbc-iplayer-its-free</link>
      <pubDate>Tue, 02 Dec 2025 13:05:38 +0000</pubDate>
      <guid isPermaLink="false">ZoE2qVwb8VB7noFJzbFnGV</guid>
      <description>Here's our guide on how to watch What is the Monachy for? for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Bye-bye Apple : pourquoi Nvidia sera le seul &#224; profiter de cette innovation majeure en 2028</title>
      <link>https://www.frandroid.com/marques/nvidia/2895227_bye-bye-apple-pourquoi-nvidia-sera-le-seul-a-profiter-de-cette-innovation-majeure-en-2028</link>
      <pubDate>Tue, 02 Dec 2025 13:05:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2895227_bye-bye-apple-pourquoi-nvidia-sera-le-seul-a-profiter-de-cette-innovation-majeure-en-2028</guid>
      <description>
Nvidia semble avoir r&#233;ussi &#224; signer un accord avec TSMC lui permettant de profiter en premier, et potentiellement aussi en exclusivit&#233;, du futur proc&#233;d&#233; A16 que le fondeur ta&#239;wanais proposera d'ici &#224; 2028.
</description>
    </item>
    <item>
      <title>This pCloud bundle has everything you need to secure your storage for life - and it's on sale just for Cyber Monday</title>
      <link>https://www.techradar.com/pro/this-pcloud-bundle-has-everything-you-need-to-secure-your-storage-for-life-its-only-on-sale-for-cyber-monday</link>
      <pubDate>Tue, 02 Dec 2025 13:04:19 +0000</pubDate>
      <guid isPermaLink="false">DRbCMNCveVhskBGGvEhCbS</guid>
      <description>This bundle gets you 5TB of storage, Pass Premium, and Encryption - all for 50% off!</description>
    </item>
    <item>
      <title>Shawn Levy Reveals Some Big Changes Made to &#8216;Star Wars: Starfighter&#8217;</title>
      <link>https://gizmodo.com/star-wars-starfighter-shawn-levy-ending-reshoots-2000694173</link>
      <pubDate>Tue, 02 Dec 2025 13:00:17 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000694173</guid>
      <description>Plus, get your first look the return of 'Ready or Not'.</description>
    </item>
    <item>
      <title>Discord now lets you buy and gift video game skins</title>
      <link>https://www.theverge.com/news/835385/discord-shop-marvel-rivals-gifting-wishlist</link>
      <pubDate>2025-12-02T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=835385</guid>
      <description>Discord&#8217;s adding a new commerce feature that will let users buy digital items for games they might not even play. Starting with Marvel Rivals, users will be able to search, buy, wishlist, and gift cosmetics without ever leaving the platform.&#160; It works like this. Starting today, Marvel Rivals will have a new store page accessible [&#8230;]</description>
    </item>
    <item>
      <title>Amazon Music&#8217;s 2025 Delivered is now here to compete with Spotify Wrapped</title>
      <link>https://techcrunch.com/2025/12/02/amazon-musics-2025-delivered-is-now-here-to-compete-with-spotify-wrapped/</link>
      <pubDate>Tue, 02 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3071408</guid>
      <description>Amazon Music's 2025 Delivered introduced new badges for listeners to show off. For example, the  &#8220;Headliner&#8221; badge recognizes fans who fall in the top percentage of an artist&#8217;s listeners.</description>
    </item>
    <item>
      <title>Troll 2 and Guillermo Del Toro's Frankenstein are the 'perfect fit', says Monsterverse director</title>
      <link>https://www.techradar.com/streaming/netflix/troll-2-and-guillermo-del-toros-frankenstein-are-the-perfect-fit-says-monsterverse-director</link>
      <pubDate>Tue, 02 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">djUJkAezCka9VGoxanvW2h</guid>
      <description>Tis the season of innocent monsters caught up in human problems on Netflix... so why stream Frankenstein after Troll 2?</description>
    </item>
  </channel>
</rss>
