<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 11 Nov 2025 11:31:08 GMT</lastBuildDate>
    <item>
      <title>Le Black Friday chinois d&#233;marre fort : voici les meilleures offres en DIRECT du 11 novembre &#224; l&#8217;occasion du Singles Day</title>
      <link>https://www.frandroid.com/bons-plans/2863099_le-black-friday-chinois-demarre-fort-voici-le-top-10-des-meilleures-offres-du-11-novembre-sur-aliexpress-et-consorts</link>
      <pubDate>Tue, 11 Nov 2025 11:26:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2863099_le-black-friday-chinois-demarre-fort-voici-le-top-10-des-meilleures-offres-du-11-novembre-sur-aliexpress-et-consorts</guid>
      <description>
Le 11 novembre, c'est le 11.11, ou Singles Day. Voyez le un peu comme le Black Friday chinois o&#249; il est possible de faire d'excellentes affaires sur de nombreux produits Tech populaires. Dans cet article, nous vous partageons les meilleures offres s&#233;lectionn&#233;es par la r&#233;daction.  
</description>
    </item>
    <item>
      <title>Ghost of Y&#333;tei sold over 3.3 million units in its first month, Sony describes the sequel as a 'major hit'</title>
      <link>https://www.techradar.com/gaming/gaming-industry/ghost-of-yotei-sold-over-3-3-million-units-in-its-first-month-sony-describes-the-sequel-as-a-major-hit</link>
      <pubDate>Tue, 11 Nov 2025 11:14:44 +0000</pubDate>
      <guid isPermaLink="false">jU2UUmEr9vfQK4Nv3ekooi</guid>
      <description>Ghost of Y&#333;tei has sold very well indeed in its first month on the market. According to the latest earnings call. from Sony, the game is a 'major hit'.</description>
    </item>
    <item>
      <title>Tibo InShape laisse son image et sa voix &#224; la port&#233;e de tous sur Sora&#160;: apr&#232;s le coup de pub, un vide juridique&#160;?</title>
      <link>https://www.01net.com/actualites/tibo-inshape-laisse-son-image-et-sa-voix-a-la-portee-de-tous-sur-sora-apres-le-coup-de-pub-un-vide-juridique.html</link>
      <pubDate>Tue, 11 Nov 2025 11:07:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1304657</guid>
      <description>&#171; Allez-y, c'est openbar pour les deepfakes &#187;. Tibo InShape, le premier influenceur de France, a donn&#233; sur Sora, le nouveau r&#233;seau social d'OpenAI (une sorte de TikTok de vid&#233;os g&#233;n&#233;r&#233;es par l'IA), son avatar num&#233;rique, sans la moindre limite : les internautes, libres de cr&#233;er des vid&#233;os IA avec son image et sa voix, s'en sont donn&#233;s &#224; c&#339;ur joie, pour le meilleur et pour le pire. D&#233;cryptage sur les implications et les cons&#233;quences juridiques de ce geste avec Mathilde Croze du cabinet Lerins, avocate sp&#233;cialis&#233;e en droit des nouvelles technologies et donn&#233;es personnelles....</description>
    </item>
    <item>
      <title>Class&#233;e N&#176;1, cette chanson n&#8217;existe pas, elle a &#233;t&#233; 100% g&#233;n&#233;r&#233;e par IA, tout comme son artiste</title>
      <link>https://www.frandroid.com/services/streaming-musical/2863613_classee-n1-cette-chanson-nexiste-pas-elle-a-ete-100-generee-par-ia-tout-comme-son-artiste</link>
      <pubDate>Tue, 11 Nov 2025 11:04:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/streaming-musical/2863613_classee-n1-cette-chanson-nexiste-pas-elle-a-ete-100-generee-par-ia-tout-comme-son-artiste</guid>
      <description>
Une chanson country g&#233;n&#233;r&#233;e par intelligence artificielle, &#171; Walk My Walk &#187;, a atteint la premi&#232;re place du classement Billboard. Son "artiste", Breaking Rust, est &#233;galement une pure cr&#233;ation de l'IA, apparue &#224; la mi-octobre. Ce projet accumule des millions d'&#233;coutes et trompe de nombreux auditeurs.
</description>
    </item>
    <item>
      <title>Singles Day : le Black Friday chinois casse aussi les prix des smartphones Google, Xiaomi et Apple</title>
      <link>https://www.frandroid.com/bons-plans/2862703_single-day-le-black-friday-chinois-casse-les-prix-des-smartphones-google-xiaomi-et-apple</link>
      <pubDate>Tue, 11 Nov 2025 11:00:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2862703_single-day-le-black-friday-chinois-casse-les-prix-des-smartphones-google-xiaomi-et-apple</guid>
      <description>
Le Single Day est l&#224;, et avec lui les meilleures offres possibles sur les smartphones. AliExpress donne tout et fait pleuvoir des promotions assorties de codes de r&#233;duction pour encore faire descendre la note. On a tri&#233; pour vous les meilleurs deals de cette journ&#233;e sur le site chinois, et pas que.
</description>
    </item>
    <item>
      <title>&#8216;Super Sentai&#8217; Just Lost Its First Female Black Ranger</title>
      <link>https://gizmodo.com/super-sentai-gozyuger-maya-imamori-firing-explained-2000683761</link>
      <pubDate>Tue, 11 Nov 2025 11:00:03 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683761</guid>
      <description>The ongoing 'No. 1 Sentai Gozyuger' has found itself in a wild position after the abrupt firing of actress Maya Imamori.</description>
    </item>
    <item>
      <title>Sony is going whole hog on the weird ad campaigns again with its 'It Happens on PS5' campaign - that you'll get to see in real-life locations</title>
      <link>https://www.techradar.com/gaming/playstation/sony-is-going-whole-hog-on-the-weird-ad-campaigns-again-with-its-it-happens-on-ps5-campaign-that-youll-get-to-see-in-real-life-locations</link>
      <pubDate>Tue, 11 Nov 2025 10:58:06 +0000</pubDate>
      <guid isPermaLink="false">924JoQjHv99Lq3XUJM3vaX</guid>
      <description>PlayStation is celebrating five years of the PS5 with its latest 'It Happens on PS5' campaign, which sees eye-catching ads popping up around the world.</description>
    </item>
    <item>
      <title>AI demand is leading to major data center expansions - but do they have the power to fully operate?</title>
      <link>https://www.techradar.com/pro/ai-demand-is-leading-to-major-data-center-expansions-but-do-they-have-the-power-to-fully-operate</link>
      <pubDate>Tue, 11 Nov 2025 10:58:00 +0000</pubDate>
      <guid isPermaLink="false">daJot7PMhCfkJn2KfJNwwm</guid>
      <description>Two in five data centers could face power constraints by 2027 &#8211; if they even get built in the first place.</description>
    </item>
    <item>
      <title>Retournement de situation pour le prochain moteur &#233;lectrique sans terres rares de Renault</title>
      <link>https://www.frandroid.com/marques/renault/2863549_virement-de-situation-pour-le-prochain-moteur-electrique-sans-terres-rares-de-renault</link>
      <pubDate>Tue, 11 Nov 2025 10:53:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2863549_virement-de-situation-pour-le-prochain-moteur-electrique-sans-terres-rares-de-renault</guid>
      <description>
La collaboration entre Renault et l'&#233;quipementier fran&#231;ais Valeo pour concevoir un moteur &#233;lectrique sans terres rares aurait &#233;t&#233; abandonn&#233;e. Renault chercherait un fournisseur chinois pour finaliser le d&#233;veloppement de ce moteur pr&#233;vu pour ses futures voitures &#233;lectriques, qui sera toujours produit en France.
</description>
    </item>
    <item>
      <title>Outlander season 8 finally confirms its 2026 release date &#8211; and it could be a huge clue for what&#8217;s to come</title>
      <link>https://www.techradar.com/streaming/entertainment/outlander-season-8-finally-confirms-its-2026-release-date-and-it-could-be-a-huge-clue-for-whats-to-come</link>
      <pubDate>Tue, 11 Nov 2025 10:51:38 +0000</pubDate>
      <guid isPermaLink="false">TA7yHqsxnyo5ZRqELu25Me</guid>
      <description>Outlander season 8 is the final instalment of the hit TV show, but its 2026 release date could confirm brand-new secrets.</description>
    </item>
    <item>
      <title>Sony WH-1000XM4 : ce grand classique des casques sans fil n&#8217;est qu&#8217;&#224; 159 &#8364; lors du Black Friday chinois</title>
      <link>https://www.frandroid.com/bons-plans/2346192_sony-wh-1000xm4-ce-grand-classique-des-casques-sans-fil-nest-qua-159-euros-lors-du-black-friday-chinois</link>
      <pubDate>Tue, 11 Nov 2025 10:49:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2346192_sony-wh-1000xm4-ce-grand-classique-des-casques-sans-fil-nest-qua-159-euros-lors-du-black-friday-chinois</guid>
      <description>
Le Sony WH-1000XM4 est un casque Bluetooth &#224; r&#233;duction de bruit active qui est une vraie r&#233;f&#233;rence dans le domaine. M&#234;me la sortie de ses successeur, les WH-1000XM5 et XM6, n'a pas r&#233;ussi &#224; ternir son succ&#232;s, et d'autant plus quand il est aussi peu cher qu'aujourd'hui. 
</description>
    </item>
    <item>
      <title>These are the best Black Friday deals in the UK right now &#8211; I've hand-picked 50+ offers on appliances, TVs, laptops, headphones, and more</title>
      <link>https://www.techradar.com/live/news/black-friday-deals-uk-111125</link>
      <pubDate>Tue, 11 Nov 2025 10:48:16 +0000</pubDate>
      <guid isPermaLink="false">gqEEmMtwswyoGR7jD4RRna</guid>
      <description>Our roundup of the best Black Friday deals in the UK includes all the top offers on highly rated products and tech bargains handpicked by the experts.</description>
    </item>
    <item>
      <title>Le Singles Day se d&#233;chaine avec les meilleures promotions du moment sur les tablettes tactiles</title>
      <link>https://www.frandroid.com/bons-plans/2863365_le-singles-day-se-dechaine-avec-les-meilleures-promotions-du-moment-sur-les-tablettes-tactiles</link>
      <pubDate>Tue, 11 Nov 2025 10:41:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2863365_le-singles-day-se-dechaine-avec-les-meilleures-promotions-du-moment-sur-les-tablettes-tactiles</guid>
      <description>
Lors du Black Friday chinois nomm&#233; aussi Singles Day, une s&#233;lection de promotions sur diff&#233;rents produits tech vous est propos&#233;. Nous avons tri&#233; pour vous les meilleures offres tablettes de la journ&#233;e.
</description>
    </item>
    <item>
      <title>Facebook Like and Comment Buttons on External Websites Are Going Away</title>
      <link>https://gizmodo.com/facebook-like-and-comment-buttons-on-external-websites-are-going-away-2000683490</link>
      <pubDate>Tue, 11 Nov 2025 10:30:42 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683490</guid>
      <description>They're artifacts from a more naive time on the internet.</description>
    </item>
    <item>
      <title>5G&#160;: Bruxelles veut forcer les &#201;tats membres &#224; bannir Huawei et ZTE</title>
      <link>https://www.01net.com/actualites/5g-bruxelles-veut-forcer-les-etats-membres-a-bannir-huawei-et-zte.html</link>
      <pubDate>Tue, 11 Nov 2025 10:30:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1306839</guid>
      <description>La Commission europ&#233;enne voudrait que tous les &#201;tats membres (et m&#234;me au-del&#224;) cessent d'installer des &#233;quipements Huawei et ZTE pour leurs r&#233;seaux t&#233;l&#233;coms. Cinq ans apr&#232;s avoir fait des recommandations, Bruxelles pourrait maintenant forcer la main des pays r&#233;calcitrants.</description>
    </item>
    <item>
      <title>How weird wins</title>
      <link>https://www.fastcompany.com/91433628/how-weird-wins-weird-marketing</link>
      <pubDate>2025-11-11T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91433628/how-weird-wins-weird-marketing</guid>
      <description>The case for absurdity in marketing.
There are a lot of words marketers can&#8217;t seem to quit. &#8220;Unique.&#8221; &#8220;Authentic.&#8221; &#8220;Real.&#8221; But these are threadbare clich&#233;s, which have all but become nullified due to the erosion of their meaning, a dilution fueled by the desire for brands to be generally, yet specifically, for everyone. But &#8220;everyone&#8221; is not a target audience. It&#8217;s a comfortable void. What brands really need right now isn&#8217;t another lap around the buzzword block. It&#8217;s courage. Courage to lean into the one trait that could cut through in a world of algorithms, sameness, and mediocrity. Marketers...</description>
    </item>
    <item>
      <title>Customers prefer robots over humans when it comes to embarrassing purchases</title>
      <link>https://www.fastcompany.com/91436688/customers-prefer-robots-over-humans-embarrassing-purchases</link>
      <pubDate>2025-11-11T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91436688/customers-prefer-robots-over-humans-embarrassing-purchases</guid>
      <description>In moments when embarrassment looms large, humanlike chatbots can backfire.
When it comes to inquiring about&#8212;ahem&#8212;certain products, shoppers prefer the inhuman touch.</description>
    </item>
    <item>
      <title>Bagues connect&#233;es : quels sont les meilleurs mod&#232;les test&#233;s par la r&#233;daction ?</title>
      <link>https://www.frandroid.com/guide-dachat/1875593_bagues-connectees-quels-sont-les-modeles-deja-disponibles</link>
      <pubDate>Tue, 11 Nov 2025 10:27:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1875593_bagues-connectees-quels-sont-les-modeles-deja-disponibles</guid>
      <description>
Les bagues connect&#233;es sont de plus en plus nombreuses sur le march&#233; des wearables. Si ces produits vous intriguent, voici tout ce qu'il faut savoir, ainsi que notre s&#233;lection parmi les diff&#233;rentes bagues que nous avons pu tester.
</description>
    </item>
    <item>
      <title>James Gunn's Superman movie is getting a spin-off show &#8211; and it'll be led by one of the DCU film's breakout stars</title>
      <link>https://www.techradar.com/streaming/hbo-max/james-gunns-superman-movie-is-getting-a-spin-off-show-and-itll-be-led-by-one-of-the-dcu-films-breakout-stars</link>
      <pubDate>Tue, 11 Nov 2025 10:24:16 +0000</pubDate>
      <guid isPermaLink="false">4R5t77pFTHTps4wMAaNTT</guid>
      <description>The DCU's Superman movie is getting a spin-off series, and it sounds like it could be a true crime-based take on The Office.</description>
    </item>
    <item>
      <title>Apple has announced a limited-edition iPhone Pocket, and it&#8217;s not cheap</title>
      <link>https://www.techradar.com/phones/iphone/apple-has-announced-a-limited-edition-iphone-pocket-and-its-not-cheap</link>
      <pubDate>Tue, 11 Nov 2025 10:23:52 +0000</pubDate>
      <guid isPermaLink="false">zMFrshLrJu5yGULaXNMqj3</guid>
      <description>The iPhone Pocket is a new, limited-edition wearable pocket, designed specifically for your iPhone, and priced high.</description>
    </item>
    <item>
      <title>GameHub, le meilleur &#233;mulateur Windows pour Android arrive l&#224; o&#249; tout le monde peut le trouver</title>
      <link>https://www.frandroid.com/android/2863419_gamehub-le-meilleur-emulateur-windows-pour-android-arrive-la-ou-tout-le-monde-peut-le-trouver</link>
      <pubDate>Tue, 11 Nov 2025 10:23:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/2863419_gamehub-le-meilleur-emulateur-windows-pour-android-arrive-la-ou-tout-le-monde-peut-le-trouver</guid>
      <description>
Appr&#233;ci&#233; pour son efficacit&#233;, mais jusqu'&#224; pr&#233;sent diffus&#233; par des canaux peu connus du grand public, l'&#233;mulateur GameHub, qui permet notamment de jouer &#224; des jeux Windows sur Android, d&#233;barque sur le Google Play Store.
</description>
    </item>
    <item>
      <title>Apple made a $230 crossbody&#8230; sock</title>
      <link>https://www.theverge.com/news/818328/apple-iphone-pocket-crossbody-knitted-sock-bag</link>
      <pubDate>2025-11-11T05:22:27-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=818328</guid>
      <description>If you were confused about Apple releasing a crossbody iPhone strap, then you&#8217;re going to find its new iPhone Pocket even more perplexing. The Pocket is actually a knitted bag, though it might be more apt to describe it as a sock designed to snugly encase your iPhone, instead of just sticking it in your [&#8230;]</description>
    </item>
    <item>
      <title>NYT Connections hints today: Clues, answers for November 11, 2025</title>
      <link>https://mashable.com/article/nyt-connections-hint-answer-today-november-11-2025</link>
      <pubDate>Tue, 11 Nov 2025 10:20:23 +0000</pubDate>
      <guid isPermaLink="false">00ax3XoLV1f8DZ29MVayKQG</guid>
      <description>Connections is a New York Times word game that's all about finding the "common threads between words." How to solve the puzzle.</description>
    </item>
    <item>
      <title>NYT Strands hints, answers for November 11, 2025</title>
      <link>https://mashable.com/article/strands-nyt-hint-november-11-2025</link>
      <pubDate>Tue, 11 Nov 2025 10:20:16 +0000</pubDate>
      <guid isPermaLink="false">05kOX1eCVhIyAaA9z8vgOvg</guid>
      <description>The NYT Strands hints and answers you need to make the most of your puzzling experience.</description>
    </item>
    <item>
      <title>Wordle today: Answer, hints for November 11, 2025</title>
      <link>https://mashable.com/article/wordle-today-answer-november-11-2025</link>
      <pubDate>Tue, 11 Nov 2025 10:20:09 +0000</pubDate>
      <guid isPermaLink="false">04IlyfQkRdwpt2b6N5LKbfA</guid>
      <description>Here's the answer for "Wordle" #1605 on November 11 as well as a few hints, tips, and clues to help you solve it yourself.</description>
    </item>
    <item>
      <title>NYT Connections Sports Edition today: Hints and answers for November 11, 2025</title>
      <link>https://mashable.com/article/nyt-connections-sports-edition-hint-answer-today-november-11-2025</link>
      <pubDate>Tue, 11 Nov 2025 10:19:55 +0000</pubDate>
      <guid isPermaLink="false">01eYlgyAFR41ndwINEb2tCF</guid>
      <description>Connections: Sports Edition is a New York Times word game about finding common sports threads between words. How to solve the day's puzzle.</description>
    </item>
    <item>
      <title>NYT Pips hints, answers for November 11, 2025</title>
      <link>https://mashable.com/article/pips-nyt-games-hints-answers-easy-medium-hard-november-11</link>
      <pubDate>Tue, 11 Nov 2025 10:19:48 +0000</pubDate>
      <guid isPermaLink="false">01iLE1d3c6Sj1tgvCoFeG5B</guid>
      <description>The New York Times' latest game, Pips, brings domino fun to your desktop. How to play Pips as well as hints in case you get stuck.</description>
    </item>
    <item>
      <title>Apples iPhone Pocket is a new way to carry the iPhone, and we have questions</title>
      <link>https://mashable.com/article/apple-iphone-pocket</link>
      <pubDate>Tue, 11 Nov 2025 10:16:56 +0000</pubDate>
      <guid isPermaLink="false">06E2sxOvtY9tizCffQzUnuy</guid>
      <description>Apple launched a new accessory for the iPhone, called the iPhone Pocket.</description>
    </item>
    <item>
      <title>Software budgets are being wasted on over-engineered IT tools</title>
      <link>https://www.techradar.com/pro/software-budgets-are-being-wasted-on-over-engineered-it-tools</link>
      <pubDate>Tue, 11 Nov 2025 10:16:50 +0000</pubDate>
      <guid isPermaLink="false">2fHbZSyuRmqp7CXLA73wS6</guid>
      <description>Businesses aren&#8217;t seeing desired ROI, and workers are feeling stressed about complex software stacks.</description>
    </item>
    <item>
      <title>Chrome sur Android va prendre un retard consid&#233;rable sur Microsoft Edge, qui va encore am&#233;liorer ses extensions</title>
      <link>https://www.frandroid.com/marques/microsoft/2863317_chrome-sur-android-va-prendre-un-retard-considerable-sur-microsoft-edge-qui-va-encore-ameliorer-ses-extensions</link>
      <pubDate>Tue, 11 Nov 2025 10:12:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2863317_chrome-sur-android-va-prendre-un-retard-considerable-sur-microsoft-edge-qui-va-encore-ameliorer-ses-extensions</guid>
      <description>
Microsoft Edge va prendre de l'avance sur son concurrent Google Chrome. Le navigateur de Microsoft proposera dans une prochaine mise &#224; jour une prise en charge &#233;tendue des extensions sur Android. 
</description>
    </item>
    <item>
      <title>NYT Mini crossword answers, hints for November 11, 2025</title>
      <link>https://mashable.com/article/nyt-mini-crossword-answers-hints-november-11-2025</link>
      <pubDate>Tue, 11 Nov 2025 10:12:41 +0000</pubDate>
      <guid isPermaLink="false">05DV67Bv257lO7xNEFeNQTu</guid>
      <description>Answers to each clue for the November 11, 2025 edition of NYT's The Mini crossword puzzle.</description>
    </item>
    <item>
      <title>Du blanc au bleu sarcelle : voici ce que chaque couleur USB signifie</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2863637_du-blanc-au-bleu-sarcelle-voici-ce-que-chaque-couleur-usb-signifie</link>
      <pubDate>Tue, 11 Nov 2025 10:08:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/pc-portables/2863637_du-blanc-au-bleu-sarcelle-voici-ce-que-chaque-couleur-usb-signifie</guid>
      <description>
L'USB devait &#234;tre universel. 25 ans apr&#232;s, on se retrouve avec 6 couleurs de ports, 4 g&#233;n&#233;rations de normes, et un bordel monstre.
</description>
    </item>
    <item>
      <title>5 ways AI is supercharging DDoS attacks</title>
      <link>https://www.techradar.com/pro/5-ways-ai-is-supercharging-ddos-attacks</link>
      <pubDate>Tue, 11 Nov 2025 10:05:47 +0000</pubDate>
      <guid isPermaLink="false">USc6bK4QYEsK2Xir5nD2Xa</guid>
      <description>AI is transforming the world - especially in cybersecurity, where the technology is enabling more advanced attacks.</description>
    </item>
    <item>
      <title>Moon phase today: What the moon will look like on November 11</title>
      <link>https://mashable.com/article/moon-phase-today-nov-11</link>
      <pubDate>Tue, 11 Nov 2025 10:03:33 +0000</pubDate>
      <guid isPermaLink="false">059kLdYj5OPu0jBy6Mowfhf</guid>
      <description>See the moon phase expected for November 11, 2025 as well as when the next full moon is expected.</description>
    </item>
    <item>
      <title>The Head of the Cybertruck Program Quit Tesla. The Model Y Leader Left Hours Later</title>
      <link>https://gizmodo.com/the-head-of-the-cybertruck-program-quit-tesla-the-model-y-leader-left-hours-later-2000683513</link>
      <pubDate>Tue, 11 Nov 2025 10:00:11 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000683513</guid>
      <description>Tesla is hemorrhaging program managers.</description>
    </item>
    <item>
      <title>Nobody wants to be the boss anymore. Here&#8217;s why, in just 7 words</title>
      <link>https://www.fastcompany.com/91431738/nobody-wants-to-be-a-boss-anymore</link>
      <pubDate>2025-11-11T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91431738/nobody-wants-to-be-a-boss-anymore</guid>
      <description>New research shows only 30% of workers want to become managers. Here&#8217;s why, and what your organization can do about it.
Twenty years ago, getting promoted to manager was a major milestone. Today it&#8217;s a punishment.</description>
    </item>
    <item>
      <title>How to deal with grief at work</title>
      <link>https://www.fastcompany.com/91436831/how-to-deal-with-grief-at-work</link>
      <pubDate>2025-11-11T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91436831/how-to-deal-with-grief-at-work</guid>
      <description>Facing the unimaginable changes everything.
In September, my mom died after a short battle with colon cancer. She was 83 and lived a full life in which she had a fulfilling career in education, traveled the world visiting 100-plus countries, and was married to my father for more than 60 years. It&#8217;s hard to lose a parent, and my workplace (like many) allowed me time off to be with family for the days before and after the funeral....</description>
    </item>
    <item>
      <title>Is Arc Raiders worth buying? I played the new extraction shooter to find out.</title>
      <link>https://mashable.com/article/should-you-buy-arc-raiders-review</link>
      <pubDate>Tue, 11 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">03VmpS8a0kjaGihKgMGAlCm</guid>
      <description>Is 'Arc Raiders' worth buying?</description>
    </item>
    <item>
      <title>Voici la premi&#232;re voiture &#233;lectrique de Volkswagen con&#231;ue avec Xpeng : charge ultra-rapide et autonomie XXL au menu</title>
      <link>https://www.frandroid.com/marques/volkswagen/2863409_voici-la-premiere-voiture-electrique-de-volkswagen-concue-avec-xpeng-charge-ultra-rapide-et-autonomie-xxl-au-menu</link>
      <pubDate>Tue, 11 Nov 2025 09:56:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2863409_voici-la-premiere-voiture-electrique-de-volkswagen-concue-avec-xpeng-charge-ultra-rapide-et-autonomie-xxl-au-menu</guid>
      <description>
La nouvelle marque de Volkswagen d&#233;di&#233;e &#224; la Chine l&#232;ve le voile sur sa derni&#232;re cr&#233;ation en date, l&#8217;ID. Unyx 08. Il s&#8217;agit de la premi&#232;re voiture &#233;lectrique issue du partenariat avec Xpeng.
</description>
    </item>
    <item>
      <title>The 30+ best early Black Friday Apple deals: We found record lows on AirPods and MacBooks already</title>
      <link>https://mashable.com/article/best-early-black-friday-apple-deals-2025</link>
      <pubDate>Tue, 11 Nov 2025 09:56:11 +0000</pubDate>
      <guid isPermaLink="false">014Jb77aJBMaJR4tkMMFiHK</guid>
      <description>Mashable has dug up the best early Black Friday Apple deals, including year-round lows on AirPods and MacBooks.</description>
    </item>
    <item>
      <title>Voici la meilleure mani&#232;re de contacter Orange et Sosh d&#233;sormais si vous avez un probl&#232;me ou une question</title>
      <link>https://www.frandroid.com/marques/orange/2863597_voici-la-meilleure-maniere-de-contacter-orange-et-sosh-desormais-si-vous-avez-un-probleme-ou-une-question</link>
      <pubDate>Tue, 11 Nov 2025 09:52:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/orange/2863597_voici-la-meilleure-maniere-de-contacter-orange-et-sosh-desormais-si-vous-avez-un-probleme-ou-une-question</guid>
      <description>
Orange annonce l'arr&#234;t de son support client sur X et bascule vers Messenger et Instagram.
</description>
    </item>
    <item>
      <title>Single Day AliExpress : les meilleures offres high-tech sont l&#224;, mais pas pour longtemps [Sponso]</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2857195_single-day-aliexpress-les-meilleures-offres-high-tech-sont-la-mais-pas-pour-longtemps</link>
      <pubDate>Tue, 11 Nov 2025 09:51:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2857195_single-day-aliexpress-les-meilleures-offres-high-tech-sont-la-mais-pas-pour-longtemps</guid>
      <description>
Connaissez-vous le Single Day ? Venue de Chine, cette f&#234;te propuls&#233;e en France par AliExpress est une occasion r&#234;v&#233;e pour faire le plein de bonnes affaires. D&#233;couvrez les meilleurs bons plans tech de cette journ&#233;e devenue iconique.
</description>
    </item>
    <item>
      <title>iPhone 16e : le prix du smartphone abordable d&#8217;Apple n&#8217;est jamais tomb&#233; aussi bas que pour ce Singles Day</title>
      <link>https://www.frandroid.com/bons-plans/2723465_iphone-16e-le-prix-du-smartphone-abordable-dapple-nest-jamais-tombe-aussi-bas-que-pour-ce-singles-day</link>
      <pubDate>Tue, 11 Nov 2025 09:48:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2723465_iphone-16e-le-prix-du-smartphone-abordable-dapple-nest-jamais-tombe-aussi-bas-que-pour-ce-singles-day</guid>
      <description>
L'iPhone 16e d'Apple est un iPhone qui se veut moins cher, mais pas r&#233;ellement abordable &#224; la sortie. Heureusement, aujourd'hui il est possible de l'obtenir &#224; un prix bien plus avantageux : 489 euros contre 719 euros. 
</description>
    </item>
    <item>
      <title>Voici &#224; quoi ressemblera le Samsung Galaxy S26 Plus qui remplace le Galaxy S26 Edge</title>
      <link>https://www.frandroid.com/marques/samsung/2863451_voici-a-quoi-ressemblera-le-samsung-galaxy-s26-plus-qui-remplace-le-galaxy-s26-edge</link>
      <pubDate>Tue, 11 Nov 2025 09:48:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2863451_voici-a-quoi-ressemblera-le-samsung-galaxy-s26-plus-qui-remplace-le-galaxy-s26-edge</guid>
      <description>
En partenariat avec le leaker OnLeaks, Android Headlines a publi&#233; les premiers rendus CAO du futur Samsung Galaxy S26+. 
</description>
    </item>
    <item>
      <title>I ran the Dyson HushJet 24/7 for a week. Its so quiet that I forgot it was on, but I did notice fresher air.</title>
      <link>https://mashable.com/review/dyson-hushjet-air-purifier</link>
      <pubDate>Tue, 11 Nov 2025 09:36:51 +0000</pubDate>
      <guid isPermaLink="false">05GFaaR45j0d6vibr2Jua4c</guid>
      <description>In my testing, the Dyson HushJet air purifier has been as quiet and as powerful as Dyson says. Plus, its filter lasts for five years.</description>
    </item>
    <item>
      <title>The Hisense 50-inch E6 Cinema Series is down to its lowest-ever price at Amazon &#8212; save over $100 right now</title>
      <link>https://mashable.com/article/nov-11-hisense-tv-deal</link>
      <pubDate>Tue, 11 Nov 2025 09:34:58 +0000</pubDate>
      <guid isPermaLink="false">03js06kFNtsDeG6je4WN1a8</guid>
      <description>Get the best early Black Friday deal. Save 42% on Hisense 50-inch E6 Cinema Series at Amazon.</description>
    </item>
  </channel>
</rss>
