<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 26 Dec 2025 14:24:51 GMT</lastBuildDate>
    <item>
      <title>Fnac fait une derni&#232;re offre sur l&#8217;excellent casque Sony WH-1000XM6 pour la fin d&#8217;ann&#233;e 2025</title>
      <link>https://www.frandroid.com/bons-plans/2741417_fnac-fait-une-derniere-offre-sur-lexcellent-casque-sony-wh-1000xm6-pour-la-fin-dannee-2025</link>
      <pubDate>Fri, 26 Dec 2025 14:10:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2741417_fnac-fait-une-derniere-offre-sur-lexcellent-casque-sony-wh-1000xm6-pour-la-fin-dannee-2025</guid>
      <description>
Le Sony WH-1000XM6 est un mod&#232;le qui fr&#244;le la perfection. Sa r&#233;duction de bruit est d'une efficacit&#233; redoutable, le confort, exemplaire, et l&#8217;endurance impressionnante. S'il vous int&#233;resse, il est en ce moment en promotion &#224; 379 euros au lieu de 450 euros.
</description>
    </item>
    <item>
      <title>&#171;&#160;Tout finit par s&#8217;effondrer&#160;&#187; : programmer avec l&#8217;IA peut &#234;tre dangereux</title>
      <link>https://www.01net.com/actualites/tout-finit-par-seffondrer-programmer-avec-lia-peut-etre-dangereux.html</link>
      <pubDate>Fri, 26 Dec 2025 14:02:25 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317340</guid>
      <description>Programmer, c'est compliqu&#233;. &#201;crire des lignes de code dans un &#233;diteur n'a rien d'&#233;vident, et la finalisation d'un projet revient &#224; suer &#224; grosses gouttes. Le &#171; vibe coding &#187;, cette discipline apparue dans le sillage de l'IA g&#233;n&#233;rative, permet d'acc&#233;l&#233;rer le d&#233;veloppement de projets mais gare &#224; ne pas aller trop loin pr&#233;vient Michael Truell, cofondateur et CEO de Cursor&#8230; un logiciel sp&#233;cialis&#233; dans le vibe coding !...</description>
    </item>
    <item>
      <title>These are the cybersecurity stories we were jealous of in 2025</title>
      <link>https://techcrunch.com/2025/12/26/these-are-the-cybersecurity-stories-we-were-jealous-of-in-2025/</link>
      <pubDate>Fri, 26 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3078242</guid>
      <description>The very best reporting and investigative journalism from our friends at other publications.</description>
    </item>
    <item>
      <title>Spartacus: House of Ashur episode 5 has the most disturbing scene yet &#8211; and it was a 'dark' moment for cast</title>
      <link>https://www.techradar.com/streaming/entertainment/spartacus-house-of-ashur-episode-5-has-the-most-disturbing-scene-yet-and-it-was-a-dark-moment-for-cast</link>
      <pubDate>Fri, 26 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">uLcViowqrvTubMBtYeTKAN</guid>
      <description>Violence aside, Spartacus: House of Ashur episode 5 has the most shocking scene yet. For its cast, even the shoot was 'dark'.</description>
    </item>
    <item>
      <title>The year the internet broke &#8211; the 11 biggest tech fails that defined 2025, ranked</title>
      <link>https://www.techradar.com/tech/the-year-the-internet-broke-the-11-biggest-tech-fails-that-defined-2025-ranked</link>
      <pubDate>Fri, 26 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">SUwx8n8EeyHJB9fzyjrFRM</guid>
      <description>The biggest tech flops of this year, from Amazon taking out the internet to iPhone disappointment and hate for Copilot.</description>
    </item>
    <item>
      <title>Best Buy's post-Christmas sale is slashing prices on best-selling tech &#8212; 55% off TVs, laptops, smartwatches, and more</title>
      <link>https://www.techradar.com/seasonal-sales/best-buys-post-christmas-sale-is-slashing-prices-on-best-selling-tech-55-percent-off-tvs-laptops-smartwatches-and-more</link>
      <pubDate>Fri, 26 Dec 2025 14:00:00 +0000</pubDate>
      <guid isPermaLink="false">ZM4sWKhqmpTUYeDTk9YpyN</guid>
      <description>Best Buy just launched a post-Christmas sale with massive discounts on best-selling tech, including TVs, smartwatches, laptops, Apple devices, and more.</description>
    </item>
    <item>
      <title>Looking for a new laptop? Here are 6 expert-picked deals in the Boxing Day sales today</title>
      <link>https://www.techradar.com/computing/laptops/looking-for-a-new-laptop-here-are-6-expert-picked-deals-in-the-boxing-day-sales-today</link>
      <pubDate>Fri, 26 Dec 2025 13:58:05 +0000</pubDate>
      <guid isPermaLink="false">rukTKuw8nRz4uWQEnyohB</guid>
      <description>Don't miss today's Boxing Day sales if you're on the hunt for a new laptop - several retailers have fantastic deals to check out.</description>
    </item>
    <item>
      <title>&#171;&#160;H&#233;, je viens de trouver ta photo&#160;!&#160;&#187; : fuyez ce message WhatsApp, il menace de pirater votre compte</title>
      <link>https://www.01net.com/actualites/viens-trouver-photo-message-whatsapp-menace-pirater-compte.html</link>
      <pubDate>Fri, 26 Dec 2025 13:55:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316459</guid>
      <description>Une nouvelle tactique permettant de pirater un compte WhatsApp a &#233;t&#233; mise en lumi&#232;re. Elle consiste &#224; exploiter une fonctionnalit&#233; l&#233;gitime de la messagerie en manipulant l'utilisateur. La cyberattaque repose d'abord sur l'envoi d'un message.</description>
    </item>
    <item>
      <title>Apple will allow third-party app stores and payment processing in Brazil</title>
      <link>https://www.engadget.com/big-tech/apple-will-allow-third-party-app-stores-and-payment-processing-in-brazil-135114824.html?src=rss</link>
      <pubDate>Fri, 26 Dec 2025 13:51:15 +0000</pubDate>
      <guid isPermaLink="false">ae31e2e6-a39e-4901-ac4c-1231917fc47a</guid>
      <description>Brazilian regulators have reached a settlement with Apple after a yearslong investigation into the company's App Store fee practices as well as its policies against third-party app stores. As first reported by Brazilian tech site tecnoblog, the nation's Administrative Council of Economic Defense (CADE) said it has accepted Apple's proposed agreement that will address claims of anticompetitive practices.
The agreement will allow for third-party payment processing methods for in-app purchases and reins in Apple's anti-steering efforts by allowing links to external websites for transactions. The ...</description>
    </item>
    <item>
      <title>Xiaomi lance une nouvelle montre connect&#233;e : 6 jours d&#8217;autonomie et un capteur in&#233;dit</title>
      <link>https://www.frandroid.com/marques/xiaomi/2921267_xiaomi-lance-une-nouvelle-montre-connectee-6-jours-dautonomie-et-un-capteur-inedit</link>
      <pubDate>Fri, 26 Dec 2025 13:41:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2921267_xiaomi-lance-une-nouvelle-montre-connectee-6-jours-dautonomie-et-un-capteur-inedit</guid>
      <description>
La nouvelle montre connect&#233;e Xiaomi Watch 5 met en avant une grande autonomie et une d&#233;tection des gestes.
</description>
    </item>
    <item>
      <title>Voici les 10 s&#233;ries les plus pirat&#233;es en 2025</title>
      <link>https://www.01net.com/actualites/voici-10-series-plus-piratees-2025.html</link>
      <pubDate>Fri, 26 Dec 2025 13:21:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317329</guid>
      <description>Le top 10 des s&#233;ries les plus t&#233;l&#233;charg&#233;es ill&#233;galement vient de sortir. Cette ann&#233;e, plusieurs s&#233;ries Netflix s'offrent la t&#234;te du classement, &#224; commencer par une s&#233;rie qui vient de faire son (dernier) retour sur le devant de la sc&#232;ne.</description>
    </item>
    <item>
      <title>Argos Boxing Day sale includes up to 50% off TVs, appliances, toys, and more tech &#8212; here are the 13 best deals I'd buy</title>
      <link>https://www.techradar.com/seasonal-sales/argos-boxing-day-sale-includes-up-to-50-percent-off-tvs-appliances-toys-and-more-tech-here-are-the-13-best-deals-id-buy</link>
      <pubDate>Fri, 26 Dec 2025 13:16:29 +0000</pubDate>
      <guid isPermaLink="false">y248sKn5osTeGPmZr6mCUb</guid>
      <description>These are the best deals from the Argos Boxing Day sale, including savings of up to 50% on TVs, appliances, furniture, toys, games consoles, and more top-rated tech.</description>
    </item>
    <item>
      <title>On a test&#233; la BYD Atto 2 DM-i hybride avec 1 000 km d&#8217;autonomie : une bonne affaire face &#224; la version &#233;lectrique ? Voici notre avis</title>
      <link>https://www.frandroid.com/marques/byd/2902727_on-a-teste-la-byd-atto-2-dm-i-hybride-avec-1-000-km-dautonomie-une-bonne-affaire-face-a-la-version-electrique-voici-notre-avis</link>
      <pubDate>Fri, 26 Dec 2025 13:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2902727_on-a-teste-la-byd-atto-2-dm-i-hybride-avec-1-000-km-dautonomie-une-bonne-affaire-face-a-la-version-electrique-voici-notre-avis</guid>
      <description>
BYD a lanc&#233; l'Atto 2 DM-i "Super Hybrid", le SUV hybride rechargeable le plus petit et le moins cher du march&#233;. Comment atteint-il une autonomie &#233;lectrique de 90 km ? &#192; quoi &#231;a sert ? On vous explique !
</description>
    </item>
    <item>
      <title>The Astro A20 X doesn't get any points for originality, but it's still a great gaming headset</title>
      <link>https://www.techradar.com/gaming/astro-a20-x-review</link>
      <pubDate>Fri, 26 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">umBYtkwytKmJTzL8abtU7d</guid>
      <description>The Astro A20 X is just a Logitech G522 Lightspeed with a new platform switching feature, but that still means it offers great sound.</description>
    </item>
    <item>
      <title>Watch Christmas films from anywhere with a VPN</title>
      <link>https://www.techradar.com/vpn/vpn-services/watch-christmas-films-from-anywhere-with-a-vpn</link>
      <pubDate>Fri, 26 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">BdsoXFLnAwMkoM7vwUPFgN</guid>
      <description>Don't let geo-restrictions get in the way of your movie marathons</description>
    </item>
    <item>
      <title>These are the 5 best TVs I tested in 2025, from flagship OLEDs to affordable mini-LEDs</title>
      <link>https://www.techradar.com/televisions/these-are-the-5-best-tvs-i-tested-in-2025-from-flagship-oleds-to-affordable-mini-leds</link>
      <pubDate>Fri, 26 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">xt4YyF8Ui4C3YkjDnfA4LY</guid>
      <description>I tested a lot of TVs in 2025, and these were the very best of the bunch.</description>
    </item>
    <item>
      <title>Grab Game Pass and store credit for your new Xbox here</title>
      <link>https://www.techradar.com/gaming/grab-game-pass-and-store-credit-for-your-new-xbox-here</link>
      <pubDate>Fri, 26 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">VvvoDhLQFCiwrqSNWMvSED</guid>
      <description>Power up your new Xbox with these gift cards or a Game Pass subscription.</description>
    </item>
    <item>
      <title>The iPhone 17 was a win, but Apple needs to keep buffing up the base model in 2026</title>
      <link>https://www.techradar.com/phones/iphone/the-iphone-17-was-a-win-but-apple-needs-to-keep-buffing-up-the-base-model-in-2026</link>
      <pubDate>Fri, 26 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">rEkP2uCxvd3JBJ8jfwDbQS</guid>
      <description>If Apple wants to keep up with Samsung and Google in terms of mobile hardware, it needs to keep boosting the base model iPhone in 2026.</description>
    </item>
    <item>
      <title>Noise Luna Ring (Gen 2) review: a subscription-free Oura rival that&#8217;s solid but not standout</title>
      <link>https://www.techradar.com/health-fitness/fitness-trackers/noise-luna-ring-gen-2-review-a-subscription-free-oura-rival-thats-solid-but-not-standout</link>
      <pubDate>Fri, 26 Dec 2025 12:30:00 +0000</pubDate>
      <guid isPermaLink="false">DbzgdycMth3kCjSZ9LFY6f</guid>
      <description>An updated version of the Luna Ring with a slimmer design, better battery and useful tools &#8211; but nothing game-changing in a crowded smart ring market.</description>
    </item>
    <item>
      <title>22 best deals from the Currys Boxing Day sale &#8212; save up to 40% on TVs, laptops, appliances, and more tech</title>
      <link>https://www.techradar.com/seasonal-sales/22-best-deals-from-the-currys-boxing-day-sale-save-up-to-40-percent-on-tvs-laptops-appliances-and-more-tech</link>
      <pubDate>Fri, 26 Dec 2025 12:29:55 +0000</pubDate>
      <guid isPermaLink="false">mizdcBRceRsjejfWbzsdMD</guid>
      <description>Currys has launched another round of Epic Deals as part of its Boxing Day sale, so I've searched through and picked out the 22 best tech offers.</description>
    </item>
    <item>
      <title>Fin et avec un &#233;cran lumineux, le Realme 14T est un smartphone encore plus accessible &#224; moiti&#233; prix</title>
      <link>https://www.frandroid.com/bons-plans/2921087_fin-et-avec-un-ecran-lumineux-le-realme-14t-est-un-smartphone-encore-plus-accessible-a-moitie-prix</link>
      <pubDate>Fri, 26 Dec 2025 12:27:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2921087_fin-et-avec-un-ecran-lumineux-le-realme-14t-est-un-smartphone-encore-plus-accessible-a-moitie-prix</guid>
      <description>
Le Realme 14T s'accompagne d'un &#233;cran Amoled et de l'intelligence artificielle pour magnifier vos photos. Chez AliExpress, il passe de 299 euros &#224; 136 euros. 
</description>
    </item>
  </channel>
</rss>
