<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 16 Jan 2026 09:32:02 GMT</lastBuildDate>
    <item>
      <title>Fnac Darty lance une grande braderie pour le week-end de la 2e d&#233;marque des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2930751_fnac-darty-lance-une-grande-braderie-pour-le-week-end-de-la-2e-demarque-des-soldes</link>
      <pubDate>Fri, 16 Jan 2026 09:28:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2930751_fnac-darty-lance-une-grande-braderie-pour-le-week-end-de-la-2e-demarque-des-soldes</guid>
      <description>
Le week-end approche, et Fnac et Darty passent &#224; la vitesse sup&#233;rieure pour la deuxi&#232;me d&#233;marque des soldes&#8239;! Les deux enseignes cassent encore les prix sur des produits d&#233;j&#224; en promo&#8239;: laptop &#224; double &#233;cran &#224; prix mini, Apple Watch en baisse, trottinette Xiaomi encore plus abordable&#8230; C&#8217;est le bon moment pour craquer avant la fin des stocks&#8239;!
</description>
    </item>
    <item>
      <title>La nouvelle arme de Tesla contre les batteries chinoises est enfin pr&#234;te</title>
      <link>https://www.frandroid.com/marques/tesla/2944667_la-nouvelle-arme-de-tesla-contre-les-batteries-chinoises-est-enfin-prete</link>
      <pubDate>Fri, 16 Jan 2026 09:17:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2944667_la-nouvelle-arme-de-tesla-contre-les-batteries-chinoises-est-enfin-prete</guid>
      <description>
C&#8217;est officiel, Tesla vient de d&#233;marrer sa raffinerie de lithium aux &#201;tats-Unis. Et cela pourrait tout changer pour ses voitures &#233;lectriques, en renfor&#231;ant davantage l'ind&#233;pendance de la marque.
</description>
    </item>
    <item>
      <title>Samsung 65S90F : ce grand TV QD-OLED (144 Hz) perd plus de 1 000 &#8364; son prix lors des soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2837717_samsung-65s90f-ce-grand-tv-qd-oled-144-hz-perd-plus-de-1-000-euros-son-prix-lors-des-soldes-dhiver</link>
      <pubDate>Fri, 16 Jan 2026 09:14:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2837717_samsung-65s90f-ce-grand-tv-qd-oled-144-hz-perd-plus-de-1-000-euros-son-prix-lors-des-soldes-dhiver</guid>
      <description>
Parmi les t&#233;l&#233;viseurs 2025 de Samsung, le S90F&#160;mise sur la technologie QD-OLED pour s&#233;duire un large public &#224; un tarif plus accessible. Bonne nouvelle : sa version 65 pouces tombe aujourd'hui &#224; 1 399 euros contre 2 499 euros au d&#233;part. 
</description>
    </item>
    <item>
      <title>Stellantis assure qu&#8217;il n&#8217;y a &#171; pas de demande naturelle &#187; pour la voiture &#233;lectrique : les chiffres prouvent l&#8217;inverse</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2944757_stellantis-assure-quil-ny-a-pas-de-demande-naturelle-pour-la-voiture-electrique-les-chiffres-prouvent-linverse</link>
      <pubDate>Fri, 16 Jan 2026 09:06:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2944757_stellantis-assure-quil-ny-a-pas-de-demande-naturelle-pour-la-voiture-electrique-les-chiffres-prouvent-linverse</guid>
      <description>
C'est une interview qui sonne comme un aveu de faiblesse. Emanuele Cappellano, patron Europe de Stellantis, affirme qu'il n'y a &#171; pas de demande naturelle &#187; pour l'&#233;lectrique et que les marges s'effondrent. Le probl&#232;me ? Les chiffres de 2025 disent exactement l'inverse.
</description>
    </item>
    <item>
      <title>Un smartphone pliant enfin r&#233;parable&#160;? Le Google Pixel 11 Pro Fold ferait un pari os&#233;</title>
      <link>https://www.01net.com/actualites/un-smartphone-pliant-enfin-reparable-le-google-pixel-11-pro-fold-ferait-un-pari-ose.html</link>
      <pubDate>Fri, 16 Jan 2026 09:01:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320574</guid>
      <description>Un brevet rep&#233;r&#233; d&#233;voile les plans de Google pour le futur Pixel 11 Pro Fold. La marque envisagerait une batterie fix&#233;e m&#233;caniquement, sans colle, rendant la r&#233;paration enfin accessible sur ses mod&#232;les pliants.</description>
    </item>
    <item>
      <title>Ceramic heater vs fan heater: cost, efficiency, safety and more compared</title>
      <link>https://www.techradar.com/home/ceramic-heater-vs-fan-heater-whats-the-difference-and-which-is-better</link>
      <pubDate>Fri, 16 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">3Ck3ZxfJaP8ETznP3uyp4Y</guid>
      <description>We break down the key differences between these two popular portable heater types, to help you choose the right one for your home.</description>
    </item>
    <item>
      <title>Decathlon d&#233;gaine le v&#233;lo &#233;lectrique le plus radical de son histoire : un concept ultra puissant et l&#233;ger qui donne le tournis</title>
      <link>https://www.frandroid.com/marques/decathlon/2943981_decathlon-degaine-le-velo-electrique-le-plus-radical-de-son-histoire-un-concept-ultra-puissant-et-leger-qui-donne-le-tournis</link>
      <pubDate>Fri, 16 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/decathlon/2943981_decathlon-degaine-le-velo-electrique-le-plus-radical-de-son-histoire-un-concept-ultra-puissant-et-leger-qui-donne-le-tournis</guid>
      <description>
M&#234;lant l&#8217;univers a&#233;rodynamique du contre-la-montre et une assistance &#233;lectrique centrale Mahle, le Van Rysel FTP^2 n&#8217;est certes qu&#8217;un concept, mais dont certains &#233;l&#233;ments arriveront sur de prochains v&#233;los &#233;lectriques Decathlon.
</description>
    </item>
    <item>
      <title>Test du Xiaomi Redmi Note 15 5G : l&#8217;&#233;cran et la batterie sont bluffants, mais la pub vient ternir le tableau</title>
      <link>https://www.frandroid.com/marques/xiaomi/2932663_test-du-xiaomi-redmi-note-15-5g-il-serait-le-smartphone-presque-parfait-a-moins-de-300-e-sil-netait-pas-un-vrai-sapin-de-noel</link>
      <pubDate>Fri, 16 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2932663_test-du-xiaomi-redmi-note-15-5g-il-serait-le-smartphone-presque-parfait-a-moins-de-300-e-sil-netait-pas-un-vrai-sapin-de-noel</guid>
      <description>S&#8217;il poss&#232;de la m&#234;me nomenclature que l&#8217;an dernier, le Redmi Note 15 5G change pourtant de strat&#233;gie. Avec sa nouvelle gamme, Xiaomi veut se recentrer sur qui est le plus important pour le consommateur et selon ses enqu&#234;tes, si la photo &#233;tait le premier crit&#232;re de choix avant, c&#8217;est la durabilit&#233; et l&#8217;achat malin qui [&#8230;]</description>
    </item>
    <item>
      <title>&#201;trange d&#233;couverte : virus et bact&#233;ries mutent dans l&#8217;ISS&#8230; et ce qu&#8217;ils d&#233;clenchent n&#8217;a jamais &#233;t&#233; vu sur Terre</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-etrange-decouverte-virus-bacteries-mutent-iss-ce-quils-declenchent-na-jamais-ete-vu-terre-130214/#xtor%3DRSS-8</link>
      <pubDate>Fri, 16 Jan 2026 09:57:25 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-etrange-decouverte-virus-bacteries-mutent-iss-ce-quils-declenchent-na-jamais-ete-vu-terre-130214/#xtor%3DRSS-8</guid>
      <description>La Station spatiale internationale sert de laboratoire pour de nombreuses &#233;tudes sur les microbes et bact&#233;ries. L'occasion de voir que ces organismes r&#233;agissent &#233;trangement &#224; l'impesanteur, et en deviennent compl&#232;tement impr&#233;visibles.</description>
    </item>
    <item>
      <title>En difficult&#233; sur la voiture &#233;lectrique, Ford appelle le g&#233;ant BYD &#224; la rescousse</title>
      <link>https://www.frandroid.com/marques/ford/2944641_en-difficulte-sur-la-voiture-electrique-ford-appelle-le-geant-byd-a-la-rescousse</link>
      <pubDate>Fri, 16 Jan 2026 08:57:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/ford/2944641_en-difficulte-sur-la-voiture-electrique-ford-appelle-le-geant-byd-a-la-rescousse</guid>
      <description>
Alors que la demande de voitures &#233;lectriques est en baisse, Ford veut trouver de l&#8217;aide aupr&#232;s de BYD. Les deux constructeurs sont en discussions dans le cadre d&#8217;un partenariat autour des batteries des futures voitures hybrides.
</description>
    </item>
    <item>
      <title>P&#233;nurie de cartes graphiques : Asus s&#8217;explique sur les RTX 5070 Ti</title>
      <link>https://www.frandroid.com/marques/asus/2944727_penurie-de-cartes-graphiques-asus-sexplique-sur-les-rtx-5070-ti</link>
      <pubDate>Fri, 16 Jan 2026 08:42:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/asus/2944727_penurie-de-cartes-graphiques-asus-sexplique-sur-les-rtx-5070-ti</guid>
      <description>
Il s'est pass&#233; quelque chose d'&#233;trange ces derni&#232;res 24 heures. Apr&#232;s que plusieurs sources ont annonc&#233; la mort pr&#233;matur&#233;e des RTX 5070 Ti et 5060 Ti 16 Go, Asus a publi&#233; un d&#233;menti officiel ce matin. Tout va bien ? Pas vraiment. Derri&#232;re ce communiqu&#233; rassurant se cache une p&#233;nurie de m&#233;moire critique qui paralyse tout le march&#233;.
</description>
    </item>
    <item>
      <title>iPhone 18 Pro et iPhone Fold : un analyste r&#233;put&#233; balance tout sur les futurs fleurons d&#8217;Apple</title>
      <link>https://www.frandroid.com/marques/apple/2944701_iphone-18-pro-et-iphone-fold-un-analyste-repute-balance-tout-sur-les-futurs-fleurons-dapple</link>
      <pubDate>Fri, 16 Jan 2026 08:38:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2944701_iphone-18-pro-et-iphone-fold-un-analyste-repute-balance-tout-sur-les-futurs-fleurons-dapple</guid>
      <description>
Un analyste reconnu a d&#233;taill&#233; les caract&#233;ristiques techniques attendues pour les iPhone 18 Pro. Au programme : un SoC en 2 nm, l'arriv&#233;e de l'ouverture variable sur l'appareil photo et les premiers d&#233;tails concrets sur l'iPhone Fold.
</description>
    </item>
    <item>
      <title>Une fuite de donn&#233;es divulgue les plans de plusieurs prisons et d&#8217;une base militaire fran&#231;aise</title>
      <link>https://www.01net.com/actualites/fuite-donnees-devoile-plans-plusieurs-prisons-base-militaire-francaise.html</link>
      <pubDate>Fri, 16 Jan 2026 08:32:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320569</guid>
      <description>Une fuite de donn&#233;es sensibles touche la France. Des pirates sont parvenus &#224; mettre la main sur les plans techniques de plusieurs prisons fran&#231;aises, d'une base militaire et de certaines grandes entreprises. Les donn&#233;es ont &#233;t&#233; mises en vente sur le dark web.</description>
    </item>
    <item>
      <title>Pour l&#8217;ADEME, l&#8217;IA est une bombe &#233;nerg&#233;tique avec un sc&#233;nario noir &#224; la cl&#233;</title>
      <link>https://www.frandroid.com/survoltes/2944593_pour-lademe-lia-est-une-bombe-energetique-avec-un-scenario-noir-a-la-cle</link>
      <pubDate>Fri, 16 Jan 2026 08:29:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/2944593_pour-lademe-lia-est-une-bombe-energetique-avec-un-scenario-noir-a-la-cle</guid>
      <description>
Parce qu&#8217;ils font tourner en permanence des milliers de serveurs tout en &#233;vitant leur surchauffe, les centres de donn&#233;es sont de v&#233;ritables gouffres &#233;nerg&#233;tiques. Quelle sera leur consommation &#233;lectrique dans les ann&#233;es &#224; venir&#8239;? L&#8217;ADEME a &#233;tudi&#233; la question et estime qu&#8217;une hausse spectaculaire de la demande se dessine &#224; l&#8217;horizon.
</description>
    </item>
    <item>
      <title>Samsung ajoute de nouvelles animations de d&#233;verrouillage &#224; ses smartphones avec One UI 8.5</title>
      <link>https://www.frandroid.com/marques/samsung/2944675_samsung-ajoute-de-nouvelles-animations-de-deverrouillage-a-ses-smartphones-avec-one-ui-8-5</link>
      <pubDate>Fri, 16 Jan 2026 08:27:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2944675_samsung-ajoute-de-nouvelles-animations-de-deverrouillage-a-ses-smartphones-avec-one-ui-8-5</guid>
      <description>
La nouvelle version de One UI apporte des am&#233;liorations esth&#233;tiques &#224; l&#8217;&#233;cran de verrouillage. De quoi offrir un peu de fun &#224; votre smartphone.
</description>
    </item>
    <item>
      <title>Pour vos ext&#233;rieurs, cette cam&#233;ra TP-Link sera le vigile de vos absences avec une baisse de prix pour les soldes de 36 %</title>
      <link>https://www.frandroid.com/bons-plans/2944179_pour-vos-exterieurs-cette-camera-tp-link-sera-le-vigile-de-vos-absences-avec-une-baisse-de-prix-pour-les-soldes-de-36</link>
      <pubDate>Fri, 16 Jan 2026 08:07:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2944179_pour-vos-exterieurs-cette-camera-tp-link-sera-le-vigile-de-vos-absences-avec-une-baisse-de-prix-pour-les-soldes-de-36</guid>
      <description>
La Tapo C510W 2K est une petite cam&#233;ra de surveillance destin&#233;e &#224; l'ext&#233;rieur. Elle enregistre en 2K, peut entendre et parler, et fait aussi sonner l'alarme. Les soldes d'hiver font passer son prix de 56 euros &#224; 36,99 euros sur Amazon.
</description>
    </item>
    <item>
      <title>Nvidia calme les rumeurs sur l&#8217;arr&#234;t de plusieurs GPU, les stocks restent au plus bas</title>
      <link>https://www.01net.com/actualites/nvidia-calme-les-rumeurs-sur-larret-de-plusieurs-gpu-les-stocks-restent-au-plus-bas.html</link>
      <pubDate>Fri, 16 Jan 2026 08:01:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1320546</guid>
      <description>Les joueurs PC ne sont pas &#224; la f&#234;te. L'explosion des co&#251;ts de la m&#233;moire rend des composants aussi essentiels que la RAM, le stockage ou encore les cartes graphiques absolument hors de prix, &#224; moins de vendre un organe (ne faites pas &#231;a). Nvidia, qui fait partie &#224; la fois du probl&#232;me et de la solution, a d&#233;menti la rumeur qui courait d'un arr&#234;t de la production de deux de ses cartes graphiques les plus embl&#233;matiques et &#171; abordables &#187;....</description>
    </item>
    <item>
      <title>Free America Walkout: January 20 protest against Trump presidency at one-year mark, amid anti-ICE movement. Here&#8217;s what to know</title>
      <link>https://www.fastcompany.com/91474507/free-america-walkout-january-20-protests-against-trump-ice-womens-march-organizers-walk-out-of-work-cities</link>
      <pubDate>2026-01-16T08:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91474507/free-america-walkout-january-20-protests-against-trump-ice-womens-march-organizers-walk-out-of-work-cities</guid>
      <description>Organizers of the Women&#8217;s March&#8212;the largest single-day protest of Trump&#8217;s first term&#8212;are asking Americans to walk out of work on Tuesday.
Next week&#8217;s &#8220;Free America Walkout&#8221; is asking Americans to walk out of work (and school) on Tuesday, January 20, to disrupt &#8220;business as usual&#8221; in protest of the Trump administration&#8217;s recent actions and policies, including its treatment of immigrants, attempts to curb democracy, recent abuse by U.S. Immigration and Customs Enforcement (ICE) officers, and the recent fatal shooting of Renee Nicole Good in Minneapolis....</description>
    </item>
    <item>
      <title>Mieux que le Decathlon ? Ce nouveau casque v&#233;lo sign&#233; Shimano est un bouclier &#224; tout faire pour votre t&#234;te</title>
      <link>https://www.frandroid.com/marques/shimano/2943809_mieux-que-le-decathlon-ce-nouveau-casque-velo-signe-shimano-est-un-bouclier-a-tout-faire-pour-votre-tete</link>
      <pubDate>Fri, 16 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/shimano/2943809_mieux-que-le-decathlon-ce-nouveau-casque-velo-signe-shimano-est-un-bouclier-a-tout-faire-pour-votre-tete</guid>
      <description>
Relativement complet avec son &#233;clairage avant, une visi&#232;re ou sa ventilation mobile, le casque v&#233;lo Lazer Nova Kineticore de Shimano est aussi tr&#232;s protecteur gr&#226;ce &#224; un syst&#232;me de s&#233;curit&#233; suppl&#233;mentaire et sa compatibilit&#233; speedbike.
</description>
    </item>
    <item>
      <title>&#171;&#160;lekingdu44@gmail.com&#160;&#187; : vous pourrez bient&#244;t modifier cette adresse Google que vous n&#8217;assumez plus</title>
      <link>https://www.frandroid.com/marques/google/2944653_lekingdu44gmail-com-vous-pourrez-bientot-modifier-cette-adresse-google-que-vous-nassumez-plus</link>
      <pubDate>Fri, 16 Jan 2026 07:47:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2944653_lekingdu44gmail-com-vous-pourrez-bientot-modifier-cette-adresse-google-que-vous-nassumez-plus</guid>
      <description>
Apr&#232;s des ann&#233;es de rigidit&#233;, Google commence &#224; d&#233;ployer une fonctionnalit&#233; permettant de modifier son adresse @gmail.com sans avoir &#224; supprimer son compte ou &#224; cr&#233;er une nouvelle identit&#233; de z&#233;ro.
</description>
    </item>
    <item>
      <title>This &#163;40 gadget could be the key to better air quality in your home</title>
      <link>https://www.techradar.com/home/air-quality/this-gbp40-gadget-could-be-the-key-to-better-air-quality-in-your-home</link>
      <pubDate>Fri, 16 Jan 2026 07:40:00 +0000</pubDate>
      <guid isPermaLink="false">ahdjSjHTQBmAwDBh6kkZgm</guid>
      <description>The Levoit Core Mini Air Purifier is now available for under &#163;40 at Amazon &#8211; that's even cheaper than the price we saw during Black Friday.</description>
    </item>
    <item>
      <title>Int&#233;gration de Gemini sur les iPhone&#160;: un accord &#224; 5&#160;milliards en faveur de Google&#8201;?</title>
      <link>https://www.frandroid.com/marques/apple/2944655_integration-de-gemini-sur-les-iphone-un-accord-a-5-milliards-en-faveur-de-google</link>
      <pubDate>Fri, 16 Jan 2026 07:37:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2944655_integration-de-gemini-sur-les-iphone-un-accord-a-5-milliards-en-faveur-de-google</guid>
      <description>
Plus t&#244;t dans la semaine, Apple a annonc&#233; que la prochaine version de Siri sera aliment&#233;e par les grands mod&#232;les de langage de chez Google. Une d&#233;cision qui n&#8217;a pas &#233;t&#233; prise &#224; la l&#233;g&#232;re si les r&#233;centes d&#233;couvertes sur les coulisses de l&#8217;accord.
</description>
    </item>
  </channel>
</rss>
