<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 29 Dec 2025 08:37:44 GMT</lastBuildDate>
    <item>
      <title>Un risque &#233;norme pour le Galaxy S28&#160;? Samsung serait sur le point d&#8217;abandonner la puce de ses smartphones</title>
      <link>https://www.01net.com/actualites/un-risque-enorme-pour-le-galaxy-s28-samsung-serait-sur-le-point-dabandonner-la-puce-de-ses-smartphones.html</link>
      <pubDate>Mon, 29 Dec 2025 08:18:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317436</guid>
      <description>Samsung pr&#234;t &#224; se passer de Qualcomm pour le Galaxy S28 et pour ses futurs smartphones en g&#233;n&#233;ral. La marque cor&#233;enne semble avoir d&#233;velopp&#233; une puce qui r&#233;pond enfin &#224; ses attentes.</description>
    </item>
    <item>
      <title>AirPods&#160;: ces bo&#238;tiers color&#233;s fa&#231;on iPhone 5c qu&#8217;Apple a failli nous vendre</title>
      <link>https://www.01net.com/actualites/airpods-ces-boitiers-colores-facon-iphone-5c-quapple-a-failli-nous-vendre.html</link>
      <pubDate>Mon, 29 Dec 2025 08:17:29 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317433</guid>
      <description>Des images in&#233;dites d&#233;voilent des AirPods roses et jaunes. Apple a s&#233;rieusement envisag&#233; ces coloris pop rappelant l'iPhone 5c avant de tout annuler.</description>
    </item>
    <item>
      <title>Honor encha&#238;ne avec les grosses batteries : voici un nouveau smartphone &#224; plus de 10 000 mAh</title>
      <link>https://www.frandroid.com/marques/honor/2921723_honor-enchaine-avec-les-grosses-batteries-voici-un-nouveau-smartphone-a-plus-de-10-000-mah</link>
      <pubDate>Mon, 29 Dec 2025 08:02:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/honor/2921723_honor-enchaine-avec-les-grosses-batteries-voici-un-nouveau-smartphone-a-plus-de-10-000-mah</guid>
      <description>
Le Honor Power 2 arrive en janvier 2026 avec une batterie de 10 080 mAh alors que les tout r&#233;cents Honor WIN atteignaient d&#233;j&#224; les 10 000 mAh.
</description>
    </item>
    <item>
      <title>The best wireless chargers for 2026</title>
      <link>https://www.engadget.com/computing/accessories/best-wireless-charger-140036359.html?src=rss</link>
      <pubDate>Mon, 29 Dec 2025 08:00:36 +0000</pubDate>
      <guid isPermaLink="false">1fe3d1e8-55e1-40d5-a463-1336dd916f19</guid>
      <description>Imagine never having to fumble with a charging cable again. That's the magic of a wireless charger. Not only does going wireless clear up your space and make charging as simple as setting your phone down, but it&#8217;s also surprisingly versatile. Whether you&#8217;re looking for a sleek charging pad for your nightstand, a stand that keeps your phone propped up on your desk or even a foldable charger for convenient travel, there's a wireless charger designed to fit your lifestyle. Some can even double as a car charger, keeping your phone powered up on the go without the hassle of cables to plug in. With ...</description>
    </item>
    <item>
      <title>Des radars qui scannent les voitures&#160;: le S&#233;nat approuve l&#8217;utilisation g&#233;n&#233;ralis&#233;e des cam&#233;ras Lapi sur les routes</title>
      <link>https://www.01net.com/actualites/des-radars-qui-scannent-les-voitures-le-senat-approuve-lutilisation-generalisee-des-cameras-lapi-sur-les-routes.html</link>
      <pubDate>Mon, 29 Dec 2025 07:15:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317427</guid>
      <description>C'est officiel : les cam&#233;ras Lapi pourront &#234;tre utilis&#233;es pour des infractions criminelles. Est-ce un pas vers plus de s&#233;curit&#233; ou un risque pour nos libert&#233;s ?</description>
    </item>
    <item>
      <title>Home Chef Promo Code: 50% Off</title>
      <link>https://www.wired.com/story/home-chef-promo-code/</link>
      <pubDate>Mon, 29 Dec 2025 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">672bba29d5aea71a8c7fa36b</guid>
      <description>Enjoy up to 50% off deliveries, free meals, and more with the latest Home Chef coupons.</description>
    </item>
    <item>
      <title>The most important career skill to build in 2026</title>
      <link>https://www.fastcompany.com/91456491/the-most-important-career-skill-to-build-in-2026</link>
      <pubDate>2025-12-29T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91456491/the-most-important-career-skill-to-build-in-2026</guid>
      <description>Whether navigating people, problems, or rapid change, learning to adapt quickly is becoming the most valuable skill you can develop.
The end of the year is the perfect time to take stock of where you are, what you&#8217;re good at, and what you want to develop in the new year. The job market continues to be intense and competitive, so you&#8217;re wise to consider hiring trends and how you can best prepare and set yourself apart....</description>
    </item>
    <item>
      <title>Les plus gros flops dans la tech en 2025</title>
      <link>https://www.01net.com/actualites/les-plus-gros-flops-dans-la-tech-en-2025.html</link>
      <pubDate>Mon, 29 Dec 2025 06:50:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1315639</guid>
      <description>Quels sont les produits qui ont le plus d&#233;&#231;u cette ann&#233;e ? Qui a fait les plus mauvais choix strat&#233;giques en 2025 ? Et plus globalement qui a rat&#233; son dernier exercice ? Voici le bilan des plus gros rat&#233;s de 2025.</description>
    </item>
  </channel>
</rss>
