<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 24 Nov 2025 09:46:36 GMT</lastBuildDate>
    <item>
      <title>PS5 Slim, Pro, Digital : Sony baisse les prix sur tout, voici les promos du Black Friday</title>
      <link>https://www.frandroid.com/produits-android/console/console-de-jeux/2878499_slim-pro-digital-sony-baisse-les-prix-sur-tout-voici-les-promos-du-black-friday</link>
      <pubDate>Mon, 24 Nov 2025 09:45:39 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/console-de-jeux/2878499_slim-pro-digital-sony-baisse-les-prix-sur-tout-voici-les-promos-du-black-friday</guid>
      <description>
Sony ne fait pas les choses &#224; moiti&#233; avec des promos sur tous les mod&#232;les de PlayStation 5, notamment la Slim qui passe de 549 euros &#224; 449 euros et la Pro qui passe de 799 euros &#224; 699 euros. La version "Num&#233;rique" est &#224; seulement 349 euros.
</description>
    </item>
    <item>
      <title>&#171; Nous avons clairement besoin de projets plus ambitieux &#187; : Xpeng passe &#224; la vitesse sup&#233;rieure pour implanter ses voitures &#233;lectriques en Europe</title>
      <link>https://www.frandroid.com/marques/xpeng/2882395_nous-avons-clairement-besoin-de-projets-plus-ambitieux-xpeng-passe-a-la-vitesse-superieure-pour-implanter-ses-voitures-electriques-en-europe</link>
      <pubDate>Mon, 24 Nov 2025 09:45:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2882395_nous-avons-clairement-besoin-de-projets-plus-ambitieux-xpeng-passe-a-la-vitesse-superieure-pour-implanter-ses-voitures-electriques-en-europe</guid>
      <description>
Si le constructeur chinois Xpeng assemble d&#233;j&#224; ses voitures &#233;lectriques en Europe, il veut aller plus loin. Et cela pourrait lui permettre d&#8217;avoir le droit au bonus &#233;cologique en France.
</description>
    </item>
    <item>
      <title>&#171; Une rupture nette avec la philosophie du libre &#187; : pourquoi le dernier coup de Qualcomm inqui&#232;te autant</title>
      <link>https://www.frandroid.com/marques/qualcomm/2882459_une-rupture-nette-avec-la-philosophie-du-libre-pourquoi-le-dernier-coup-de-qualcomm-inquiete-autant</link>
      <pubDate>Mon, 24 Nov 2025 09:40:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/qualcomm/2882459_une-rupture-nette-avec-la-philosophie-du-libre-pourquoi-le-dernier-coup-de-qualcomm-inquiete-autant</guid>
      <description>
Quelques semaines &#224; peine apr&#232;s avoir rachet&#233; l&#8217;entreprise Arduino, Qualcomm vient de bousculer la philosophie de la firme en s&#8217;arrogeant des droits tr&#232;s larges sur tous les projets cr&#233;&#233;s par la communaut&#233;.
</description>
    </item>
    <item>
      <title>Insolvabilit&#233; provisoire pour cette marque berlinoise de v&#233;los &#233;lectriques, qui est menac&#233;e de dispara&#238;tre</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2882585_insolvabilite-provisoire-pour-cette-marque-berlinoise-de-velos-electriques-qui-est-menacee-de-disparaitre</link>
      <pubDate>Mon, 24 Nov 2025 09:36:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2882585_insolvabilite-provisoire-pour-cette-marque-berlinoise-de-velos-electriques-qui-est-menacee-de-disparaitre</guid>
      <description>
La soci&#233;t&#233; berlinoise Hawk Bike Sales GmbH est sous administration provisoire d&#8217;insolvabilit&#233; depuis le 19 novembre 2025, une mesure r&#233;serv&#233;e aux entreprises confront&#233;es &#224; d&#8217;importantes difficult&#233;s financi&#232;res. L&#8217;examen men&#233; doit d&#233;terminer si l&#8217;activit&#233; peut se poursuivre ou si une proc&#233;dure plus lourde devra &#234;tre engag&#233;e.
</description>
    </item>
    <item>
      <title>Windows 11 : voici comment Microsoft veut corriger le plus gros d&#233;faut de l&#8217;Explorateur de fichiers</title>
      <link>https://www.frandroid.com/marques/microsoft/2882465_fini-les-lenteurs-voici-comment-microsoft-veut-corriger-le-plus-gros-defaut-de-lexplorateur-de-fichiers</link>
      <pubDate>Mon, 24 Nov 2025 09:33:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2882465_fini-les-lenteurs-voici-comment-microsoft-veut-corriger-le-plus-gros-defaut-de-lexplorateur-de-fichiers</guid>
      <description>
Microsoft teste actuellement deux changements pour l'Explorateur de fichiers de Windows 11 qui pourraient en am&#233;liorer la praticit&#233; et les performances.
</description>
    </item>
    <item>
      <title>Black Friday Nintendo Switch 2 deals are live! Here are my top picks on consoles, controllers, accessories, games, and more</title>
      <link>https://www.techradar.com/live/news/black-friday-nintendo-switch-2-deals-live-2025</link>
      <pubDate>Mon, 24 Nov 2025 09:26:04 +0000</pubDate>
      <guid isPermaLink="false">LiA8sfZcYkTHhH2pm8jMPb</guid>
      <description>The very best Black Friday Nintendo Switch 2 deals, from consoles and controllers to accessories and more.</description>
    </item>
    <item>
      <title>The Razer Blade 14 is 'the only gaming laptop I&#8217;d happily carry everywhere' and it's $500 off for Black Friday</title>
      <link>https://www.techradar.com/computing/gaming-laptops/the-razer-blade-14-is-the-only-gaming-laptop-id-happily-carry-everywhere-and-its-usd500-off-for-black-friday</link>
      <pubDate>Mon, 24 Nov 2025 09:07:26 +0000</pubDate>
      <guid isPermaLink="false">nvdMhMASFZXJabURB37pre</guid>
      <description>Get some of the best gaming laptops we've ever tested up to $800 off for Black Friday.</description>
    </item>
    <item>
      <title>Steam Machine&#160;: Valve en dit plus sur le prix de sa console</title>
      <link>https://www.01net.com/actualites/steam-machine-valve-en-dit-plus-sur-prix-console.html</link>
      <pubDate>Mon, 24 Nov 2025 09:06:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310568</guid>
      <description>Tous ceux qui s'int&#233;ressent &#224; la Steam Machine n'ont qu'une question sur les l&#232;vres : quel sera son prix ? Dans un podcast, un des ing&#233;nieurs de chez Valve donne quelques indications suppl&#233;mentaires &#224; ce sujet.</description>
    </item>
    <item>
      <title>Une v&#233;ritable h&#233;catombe : &#233;ni&#232;me faillite dans le v&#233;lo &#233;lectrique europ&#233;en, la fili&#232;re vit une sombre ann&#233;e 2025</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2882479_une-veritable-hecatombe-enieme-faillite-dans-le-velo-electrique-europeen-la-filiere-vit-une-sombre-annee-2025</link>
      <pubDate>Mon, 24 Nov 2025 09:02:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2882479_une-veritable-hecatombe-enieme-faillite-dans-le-velo-electrique-europeen-la-filiere-vit-une-sombre-annee-2025</guid>
      <description>
Olimpia Bicycle Ltd, propri&#233;taire de la marque hongroise Gepida et acteur historique du v&#233;lo &#233;lectrique en Europe, va cesser d&#233;finitivement toutes ses activit&#233;s apr&#232;s plus de trente ans d&#8217;existence. On ne compte plus vraiment les faillites au sein de la fili&#232;re cycle sur l'ann&#233;e 2025.
</description>
    </item>
    <item>
      <title>Bois, m&#233;tal ou &#233;cran e-ink : voici pourquoi la fa&#231;ade de la Steam Machine est sa botte secr&#232;te</title>
      <link>https://www.frandroid.com/marques/valve/2882387_bois-metal-ou-ecran-e-ink-voici-pourquoi-la-facade-de-la-steam-machine-est-sa-botte-secrete</link>
      <pubDate>Mon, 24 Nov 2025 09:00:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/valve/2882387_bois-metal-ou-ecran-e-ink-voici-pourquoi-la-facade-de-la-steam-machine-est-sa-botte-secrete</guid>
      <description>
Le fabricant d'accessoires JSAUX a d&#233;voil&#233; des prototypes de fa&#231;ades personnalis&#233;es pour la Steam Machine. De quoi jouer avec une console qui vous ressemble. 
</description>
    </item>
    <item>
      <title>10 Best Early Black Friday Deals at Best Buy (2025)</title>
      <link>https://www.wired.com/story/early-black-friday-best-buy-deals/</link>
      <pubDate>Mon, 24 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">691b78c0cac069ace2d1a5d4</guid>
      <description>The main event hasn&#8217;t started, but Best Buy has already rolled out great deals on our favorite tech of the year.</description>
    </item>
    <item>
      <title>This super-stylish backpack has transformed how I pack for events - and it's even cheaper now for Black Friday</title>
      <link>https://www.techradar.com/pro/this-super-stylish-backpack-has-transformed-how-i-pack-for-events-and-its-even-cheaper-now-for-black-friday</link>
      <pubDate>Mon, 24 Nov 2025 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">X6gptFGsyviQepTDg6cbY9</guid>
      <description>Harber London is always my pick for business backpacks - get yours for less this Black Friday.</description>
    </item>
    <item>
      <title>AI has exposed the illusion of work</title>
      <link>https://www.fastcompany.com/91446213/ai-has-exposed-the-illusion-of-work</link>
      <pubDate>2025-11-24T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91446213/ai-has-exposed-the-illusion-of-work</guid>
      <description>It&#8217;s a &#8216;realization that feels strange at first, but it&#8217;s also freeing.&#8217;
There&#8217;s a scene in Office Space where Peter sits across from two consultants during a company downsizing. They ask him, &#8220;What would you say you do here?&#8221; He hesitates, smirks, and admits he only works about 15 minutes a week. The rest of the time, he&#8217;s pretending. It was comedy in 1999. It&#8217;s confession now....</description>
    </item>
    <item>
      <title>Google a r&#233;solu le probl&#232;me du texte dans les images : on a test&#233; Nano Banana Pro, c&#8217;est bluffant</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2882397_google-a-resolu-le-probleme-du-texte-dans-les-images-on-a-teste-nano-banana-pro-cest-bluffant</link>
      <pubDate>Mon, 24 Nov 2025 08:57:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2882397_google-a-resolu-le-probleme-du-texte-dans-les-images-on-a-teste-nano-banana-pro-cest-bluffant</guid>
      <description>
Oubliez tout ce que vous savez sur les g&#233;n&#233;rateurs d'images. Jusqu'ici, Midjourney ou DALL-E &#233;taient des artistes un peu illettr&#233;s. M&#234;me si les derni&#232;res am&#233;liorations de ChatGPT &#233;taient encourageantes. Avec Nano Banana Pro, Google change les r&#232;gles. Vous lui demandez la diff&#233;rence technique entre le MagSafe et le Qi 2.2 ? Il ne se contente pas de dessiner : il va chercher l'info, la comprend, et vous sort un comparatif visuel parfait.
...</description>
    </item>
    <item>
      <title>Black Friday 2025 : voici les meilleurs deals &#224; saisir en DIRECT chez Amazon, Boulanger, Fnac, Darty&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2876855_black-friday-2025-voici-les-meilleurs-deals-a-saisir-en-direct-chez-amazon-boulanger-fnac-darty</link>
      <pubDate>Mon, 24 Nov 2025 08:56:57 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2876855_black-friday-2025-voici-les-meilleurs-deals-a-saisir-en-direct-chez-amazon-boulanger-fnac-darty</guid>
      <description>
La Black Friday Week d&#233;marre sur Amazon, Fnac, Darty, Boulanger et Cdiscount. C'est donc l'occasion id&#233;ale pour profiter des meilleures offres pour acheter votre prochain smartphone, tablette, PC portable ou TV au meilleur prix. Retrouvez ici, en temps r&#233;el, les promos tech les plus int&#233;ressantes.
</description>
    </item>
    <item>
      <title>Google alerte sur une gigantesque fuite de donn&#233;es</title>
      <link>https://www.01net.com/actualites/google-leve-voile-gigantesque-fuite-donnees.html</link>
      <pubDate>Mon, 24 Nov 2025 08:33:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310555</guid>
      <description>Google tire la sonnette d&#8217;alarme au sujet d'une grande fuite de donn&#233;es. Plus de 200 entreprises ont en effet vu leurs informations siphonn&#233;es durant une attaque ciblant des applications tierces connect&#233;es &#224; Salesforce. L&#8217;op&#233;ration, orchestr&#233;e par le gang ShinyHunters, vise &#224; extorquer de l'argent aux victimes.</description>
    </item>
    <item>
      <title>Nouvelle faillite dans le v&#233;lo &#233;lectrique, cette fois d&#8217;un sp&#233;cialiste allemand apr&#232;s 36 ans d&#8217;existence</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2880805_nouvelle-faillite-dans-le-velo-electrique-cette-fois-dun-specialiste-allemand-apres-36-ans-dexistence</link>
      <pubDate>Mon, 24 Nov 2025 08:32:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2880805_nouvelle-faillite-dans-le-velo-electrique-cette-fois-dun-specialiste-allemand-apres-36-ans-dexistence</guid>
      <description>
Jugeant le march&#233; du v&#233;lo &#233;lectrique trop compliqu&#233;, la marque allemande sp&#233;cialiste du VTT M1-Sporttechnik mettra la cl&#233; sous la porte au printemps 2026, apr&#232;s 36 ans d&#8217;existence.
</description>
    </item>
    <item>
      <title>DOGE is dead</title>
      <link>https://mashable.com/article/doge-dead-government-efficiency</link>
      <pubDate>Mon, 24 Nov 2025 08:16:45 +0000</pubDate>
      <guid isPermaLink="false">04NmWFL6aO2mVunCcc5NPHb</guid>
      <description>The Department of Government Efficiency (DOGE) has been quietly dissolved since the departure of de facto leader Elon Musk in May.</description>
    </item>
    <item>
      <title>Guerre aux drones&#160;: la France veut changer la loi pour mieux se d&#233;fendre</title>
      <link>https://www.01net.com/actualites/guerre-drones-france-veut-changer-loi-pour-mieux-defendre.html</link>
      <pubDate>Mon, 24 Nov 2025 08:07:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310537</guid>
      <description>Des drones non identifi&#233;s survolent des bases militaires et des sites strat&#233;giques fran&#231;ais depuis plusieurs semaines. Le gouvernement veut modifier la l&#233;gislation pour permettre aux arm&#233;es de neutraliser plus rapidement les drones espions.</description>
    </item>
  </channel>
</rss>
