<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 29 Dec 2025 17:22:16 GMT</lastBuildDate>
    <item>
      <title>Vous avez re&#231;u une barre de son pour No&#235;l&#160;? Tous nos conseils pour bien l&#8217;installer et la configurer</title>
      <link>https://www.frandroid.com/produits-android/audio/barre-de-son/2922363_vous-avez-recu-une-barre-de-son-voici-comment-bien-linstaller-et-la-configurer</link>
      <pubDate>Mon, 29 Dec 2025 17:03:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/audio/barre-de-son/2922363_vous-avez-recu-une-barre-de-son-voici-comment-bien-linstaller-et-la-configurer</guid>
      <description>
Les f&#234;tes de fin d&#8217;ann&#233;e sont souvent l&#8217;occasion de donner un s&#233;rieux coup de jeune &#224; son installation audio-vid&#233;o, et la barre de son fait partie des cadeaux les plus fr&#233;quents sous le sapin. Voici quelques conseils pour l&#8217;installer et la configurer au mieux afin d'en profiter pleinement avec votre TV.
</description>
    </item>
    <item>
      <title>L&#8217;IA g&#233;n&#233;rative hallucine encore trop pour remplacer votre patron</title>
      <link>https://www.01net.com/actualites/lia-generative-hallucine-encore-trop-pour-piloter-une-entreprise.html</link>
      <pubDate>Mon, 29 Dec 2025 17:02:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317519</guid>
      <description>Pour taper la discute ou g&#233;n&#233;rer des images Ghibli, l'IA g&#233;n&#233;rative est bien adapt&#233;e, mais il vaut mieux y r&#233;fl&#233;chir &#224; deux fois avant de lui confier les r&#234;nes d'une entreprise. Les cons&#233;quences peuvent co&#251;ter cher, si jamais le bot hallucine une information ou perd les p&#233;dales. Salesforce, qui vend des solutions bas&#233;es sur cette technologie, a trouv&#233; une solution tr&#232;s simple pour &#233;viter les mauvaises surprises....</description>
    </item>
    <item>
      <title>This Desktop Doohickey Will Bring Your Physical SNES Games to Your PC</title>
      <link>https://gizmodo.com/this-desktop-doohickey-will-bring-your-physical-snes-games-to-your-pc-2000703925</link>
      <pubDate>Mon, 29 Dec 2025 17:00:09 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703925</guid>
      <description>Finally, there's an easy device that will let you digitize your Super Nintendo library.</description>
    </item>
    <item>
      <title>Why the electrical grid needs more software</title>
      <link>https://techcrunch.com/2025/12/29/why-the-electrical-grid-needs-more-software/</link>
      <pubDate>Mon, 29 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3075569</guid>
      <description>The electrical grid is facing unprecedented stress from the addition of new data centers. Software could offer a cost-effective way to boost reliability and capacity.</description>
    </item>
    <item>
      <title>What is the release date for the Stranger Things season 5 finale?</title>
      <link>https://www.techradar.com/streaming/netflix/what-is-the-release-date-for-the-stranger-things-season-5-finale</link>
      <pubDate>Mon, 29 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">39o9bzbrexZYmqDMnStCwB</guid>
      <description>Here's when the final episode of Stranger Things season 5 &#8211; and the entire show &#8211; will air.</description>
    </item>
    <item>
      <title>I watched over 100 new movies on Netflix, Prime Video, and more in 2025 &#8211; and these are the 12 best ones I saw</title>
      <link>https://www.techradar.com/streaming/i-watched-over-100-new-movies-on-netflix-prime-video-and-more-in-2025-and-these-are-the-12-best-ones-i-saw</link>
      <pubDate>Mon, 29 Dec 2025 17:00:00 +0000</pubDate>
      <guid isPermaLink="false">u3eaguXNQMqVvCyUVvVm6i</guid>
      <description>Here are my 12 favorite new movies I streamed over 2025, including Anora, A Real Pain, and more.</description>
    </item>
    <item>
      <title>M&#234;me Meta admet la sup&#233;riorit&#233; de Valve : ses serveurs utilisent une technologie Steam Deck</title>
      <link>https://www.frandroid.com/marques/meta/2922593_meme-meta-admet-la-superiorite-de-valve-ses-serveurs-utilisent-une-technologie-steam-deck</link>
      <pubDate>Mon, 29 Dec 2025 16:49:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/meta/2922593_meme-meta-admet-la-superiorite-de-valve-ses-serveurs-utilisent-une-technologie-steam-deck</guid>
      <description>
On apprend gr&#226;ce &#224; une conf&#233;rence du monde Linux que Meta utilise un composant logiciel con&#231;u pour le Steam Deck dans ses serveurs.
</description>
    </item>
    <item>
      <title>Super prix pour ce laptop Lenovo avec &#233;cran OLED de 14&#8243; et puce Core i7 de 13e g&#233;n&#233;ration</title>
      <link>https://www.frandroid.com/bons-plans/2922469_super-prix-pour-ce-laptop-lenovo-avec-ecran-oled-de-14-et-puce-core-i7-de-13e-generation</link>
      <pubDate>Mon, 29 Dec 2025 16:38:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2922469_super-prix-pour-ce-laptop-lenovo-avec-ecran-oled-de-14-et-puce-core-i7-de-13e-generation</guid>
      <description>
Le Lenovo IdeaPad Slim 3 14IRH10 est un PC portable avec &#233;cran OLED et configuration solide qui se retrouve &#224; 649,99 euros au lieu de 899,99 euros sur Cdiscount.
</description>
    </item>
    <item>
      <title>The Duffer Brothers Promise the &#8216;Stranger Things&#8217; Finale Won&#8217;t Massacre Your Faves</title>
      <link>https://gizmodo.com/stranger-things-last-episode-deaths-netflix-2000703965</link>
      <pubDate>Mon, 29 Dec 2025 16:30:58 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703965</guid>
      <description>As 'Stranger Things' bids farewell this week, don't expect Vecna to bring the Red Wedding to Hawkins.</description>
    </item>
    <item>
      <title>Bombogenesis! Eastern U.S. Braces for Blizzard Conditions</title>
      <link>https://gizmodo.com/bombogenesis-eastern-u-s-braces-for-blizzard-conditions-2000703935</link>
      <pubDate>Mon, 29 Dec 2025 16:30:09 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703935</guid>
      <description>A bomb cyclone could dump 1 to 2 feet of snow on the upper Great Lakes, per the National Weather Service.</description>
    </item>
    <item>
      <title>How to tweak your online platform algorithms</title>
      <link>https://www.theverge.com/tech/849742/how-to-tune-algorithms-recommendations-online-platforms</link>
      <pubDate>2025-12-29T11:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=849742</guid>
      <description>Love them or hate them, more than half of the world's population interacts with algorithmic recommendations in some way every day. Algorithmic recommendations play an integral role in how users discover new content across platforms like Facebook, Instagram, TikTok, and YouTube. It can be nice to be fed a stream of fresh posts, pictures, and [&#8230;]</description>
    </item>
    <item>
      <title>1Password deal: Get 50 percent off plans for the holiday season</title>
      <link>https://www.engadget.com/deals/1password-deal-get-50-percent-off-plans-for-the-holiday-season-162844584.html?src=rss</link>
      <pubDate>Mon, 29 Dec 2025 16:28:45 +0000</pubDate>
      <guid isPermaLink="false">cd9e1307-aef8-4e09-8a9c-1a77b7b352b3</guid>
      <description>If cleaning up your digital life is on your New Year's resolution list, we've got good news: 1Password is offering half off its subscription plans now through December 30. This includes the Individual and Families plans.
That brings the price of the Individual plan down to $24 for a year and the Families plan down to $36 for a year. The plans are nearly identical, but the Families plan accommodates five additional people. These discounts are only available to new customers and the prices expire after the year, so set a reminder to cancel or reassess. 


This provider topped our list of the bes...</description>
    </item>
    <item>
      <title>Pourquoi un iPhone sans batterie pourrait bient&#244;t ouvrir une Tesla</title>
      <link>https://www.01net.com/actualites/pourquoi-un-iphone-sans-batterie-pourrait-bientot-ouvrir-une-tesla.html</link>
      <pubDate>Mon, 29 Dec 2025 16:21:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317522</guid>
      <description>Des lignes de code d&#233;nich&#233;es dans la derni&#232;re mise &#224; jour de l'application Tesla sugg&#232;rent l'arriv&#233;e imminente d'une vraie cl&#233; num&#233;rique native. De quoi rattraper un retard technologique aga&#231;ant face &#224; la concurrence.</description>
    </item>
    <item>
      <title>Software supply chain attacks pose huge dangers - here's how to bolster your defenses</title>
      <link>https://www.techradar.com/pro/security/software-supply-chain-attacks-pose-huge-dangers-heres-how-to-bolster-your-defenses</link>
      <pubDate>Mon, 29 Dec 2025 16:20:00 +0000</pubDate>
      <guid isPermaLink="false">2zAKCiNLSDW3uJ8jLUBFN5</guid>
      <description>A new report shows how risky software supply chains really are, and how AI only makes it worse.</description>
    </item>
    <item>
      <title>Free met en place un dispositif sp&#233;cial pour ne pas perdre le r&#233;seau au nouvel an</title>
      <link>https://www.frandroid.com/marques/free/2922531_free-met-en-place-un-dispositif-special-pour-ne-pas-perdre-le-reseau-au-nouvel-an</link>
      <pubDate>Mon, 29 Dec 2025 16:19:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2922531_free-met-en-place-un-dispositif-special-pour-ne-pas-perdre-le-reseau-au-nouvel-an</guid>
      <description>
Pour assurer une disponibilit&#233; de son r&#233;seau mobile face &#224; l'affluence attendue le 31 d&#233;cembre, Free Mobile a mis une installation sp&#233;ciale sur les Champs-&#201;lys&#233;es &#224; Paris.
</description>
    </item>
    <item>
      <title>Google may let Gmail users change their email addresses</title>
      <link>https://mashable.com/article/google-gmail-users-change-email-address</link>
      <pubDate>Mon, 29 Dec 2025 16:17:21 +0000</pubDate>
      <guid isPermaLink="false">053yWjkA25ddcO9vHo5rIIr</guid>
      <description>Google may soon allow users to change their email addresses while keeping all their records.</description>
    </item>
    <item>
      <title>A Deadly Mad Cow-Like Disease Is Spreading Among North American Deer</title>
      <link>https://gizmodo.com/a-deadly-mad-cow-like-disease-is-spreading-among-north-american-deer-2000703926</link>
      <pubDate>Mon, 29 Dec 2025 16:15:41 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000703926</guid>
      <description>Wildlife officials in the U.S. and Canada report cases of chronic wasting diseases where it hasn't been detected before.</description>
    </item>
    <item>
      <title>Transports en Ile-de-France&#160;: 2026 signe la fin d&#233;finitive du ticket en carton</title>
      <link>https://www.01net.com/actualites/transports-en-ile-de-france-2026-signe-la-fin-definitive-du-ticket-en-carton.html</link>
      <pubDate>Mon, 29 Dec 2025 16:15:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317526</guid>
      <description>2026 sera une ann&#233;e charni&#232;re pour les transports publics en Ile-de-France. Le bon vieux ticket en carton va d&#233;finitivement dispara&#238;tre, tandis qu'il sera possible d'acheter et de stocker des titres dans Google Wallet sur Android, comme sur l'iPhone avec l'app Cartes d'Apple. Enfin !</description>
    </item>
    <item>
      <title>CES 2026: What to expect from tech&#8217;s biggest conference in January</title>
      <link>https://www.engadget.com/big-tech/ces-2026-what-to-expect-from-techs-biggest-conference-in-january-120000369.html?src=rss</link>
      <pubDate>Mon, 29 Dec 2025 16:03:00 +0000</pubDate>
      <guid isPermaLink="false">2645ab40-20b1-4cf0-bdcf-9e9656c79061</guid>
      <description>CES is the January trade show where the tech industry kicks off the year with a bevy of new and notable announcements &#8212; and it&#8217;s less than a week away. The CES 2026 show floor is officially open from January 6 through 9, but the fun kicks off with events on Sunday January 4 and a host of press conferences on Monday. As always, product demos, announcements and networking will be happening at the Las Vegas Convention Center and other hotels all over the city. As usual, Engadget will be covering the event in-person and remotely, bringing you news and hands-ons straight from the show floor.More sp...</description>
    </item>
    <item>
      <title>U.S. pledges $2 billion in aid as Trump administration warns agencies to &#8216;adapt or die&#8217;</title>
      <link>https://www.fastcompany.com/91467459/u-s-pledges-2-billion-aid-trump-administration-warns-agencies-adapt-die</link>
      <pubDate>2025-12-29T16:02:35</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91467459/u-s-pledges-2-billion-aid-trump-administration-warns-agencies-adapt-die</guid>
      <description>The money is a fraction of what the United States has contributed in the past.
The United States on Monday announced a $2 billion pledge for U.N. humanitarian aid as President Donald Trump&#8217;s administration continues to slash U.S. foreign assistance and warns United Nations agencies to &#8220;adapt, shrink or die&#8221; in a time of new financial realities.The money is a small fraction of what the U.S. has contributed in the past but reflects what the administration believes is a generous amount that will maintain the United States&#8217; status as the world&#8217;s largest humanitarian donor.The pledge creates an umb...</description>
    </item>
    <item>
      <title>Test du Clam ACE 2 : de vraies qualit&#233;s, une signature sonore ajustable</title>
      <link>https://www.frandroid.com/produits-android/audio/casque-audio/2915637_test-du-clam-ace-2-de-vraies-qualites-une-signature-sonore-ajustable</link>
      <pubDate>Mon, 29 Dec 2025 16:01:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/audio/casque-audio/2915637_test-du-clam-ace-2-de-vraies-qualites-une-signature-sonore-ajustable</guid>
      <description>
Fresh 'n Rebel n'est pas le premier nom qui vient &#224; l'esprit quand on parle de casques audio. Pourtant, avec son Clam ACE 2 &#224; 99 euros, la marque n&#233;erlandaise prouve qu'il est possible de proposer un casque circum-auriculaire avec ANC, Bluetooth multipoint et finitions l&#233;ch&#233;es sans exploser son budget. Alors, miracle &#233;conomique ou compromis douloureux ? On a test&#233;.
...</description>
    </item>
    <item>
      <title>Writing the DNA of robotics</title>
      <link>https://www.fastcompany.com/91464905/writing-the-dna-of-robotics</link>
      <pubDate>2025-12-29T16:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464905/writing-the-dna-of-robotics</guid>
      <description>As intelligence moves off screens and into the physical world, we have a rare opportunity to shape how people and machines live together. Let&#8217;s get it right.
We&#8217;re at a rare inflection point. Robots are moving from research labs and factory floors into everyday life. Right now, they&#8217;re being dropped into human spaces and, often, missing the mark. Yet embodied AI is becoming more intelligent, manipulation more capable, and perception more attuned. These shifts are giving robotics a new expressive range, the ability to move, interact, and take shape in ways that feel natural in human environment...</description>
    </item>
    <item>
      <title>Fini le tout tactile&#160;? Ce smartphone coulissant cache une vraie manette (ou presque)</title>
      <link>https://www.01net.com/actualites/fini-le-tout-tactile-ce-smartphone-coulissant-cache-une-vraie-manette-ou-presque.html</link>
      <pubDate>Mon, 29 Dec 2025 15:58:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317503</guid>
      <description>Quinze ans apr&#232;s, le concept du t&#233;l&#233;phone-console fait son grand retour. L'AYANEO Pocket PLAY ne se contente pas de jouer sur la nostalgie : il promet un affichage OLED ultra-rapide et une vraie manette coulissante pour s&#233;duire les gamers.</description>
    </item>
    <item>
      <title>Outdoor deals at Amazon include a 45% discount on the Garmin inReach Messenger</title>
      <link>https://mashable.com/article/dec-19-garmin-inreach-deal</link>
      <pubDate>Mon, 29 Dec 2025 15:56:44 +0000</pubDate>
      <guid isPermaLink="false">07EOs6u8Tu1eM2MSvtZpT9z</guid>
      <description>The Garmin inReach Messenger is on sale for $165.50 at Amazon, down from the normal price of $299.99. That's a 45% discount.</description>
    </item>
    <item>
      <title>Beats&#8217; new Powerbeats Fit earbuds are down to $180</title>
      <link>https://www.theverge.com/gadgets/850705/beats-pixel-watch-apple-pencil-sales-deal</link>
      <pubDate>2025-12-29T10:53:03-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=850705</guid>
      <description>It&#8217;s almost the new year and time to treat yourself to a new pair of earbuds &#8212; especially if one of your resolutions for 2026 is to work out more. If you find yourself reading this and nodding, take a look at the Beats Powerbeats Fit, a recent upgrade of Beats&#8217; Fit Pro earbuds that [&#8230;]</description>
    </item>
    <item>
      <title>How to use the new ChatGPT app integrations, including DoorDash, Spotify, Uber, and others</title>
      <link>https://techcrunch.com/2025/12/29/how-to-use-the-new-chatgpt-app-integrations-including-doordash-spotify-uber-and-others/</link>
      <pubDate>Mon, 29 Dec 2025 15:51:40 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3062029</guid>
      <description>Learn how to use Spotify, Canva, Figma, Expedia, and other apps directly in ChatGPT.</description>
    </item>
    <item>
      <title>Tout simplement son prix le plus bas sur Amazon : l&#8217;iPhone Air 256 Go, le plus fin des iPhone, perd 150 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2922359_tout-simplement-son-prix-le-plus-bas-sur-amazon-liphone-air-256-go-le-plus-fin-des-iphone-perd-150-e</link>
      <pubDate>Mon, 29 Dec 2025 15:45:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2922359_tout-simplement-son-prix-le-plus-bas-sur-amazon-liphone-air-256-go-le-plus-fin-des-iphone-perd-150-e</guid>
      <description>
L'iPhone Air est le successeur de l'iPhone SE, un smartphone ultrafin et l&#233;ger que vous retrouvez &#224; son prix le plus bas sur Amazon, soit 1 079 euros au lieu de 1 229 euros.
</description>
    </item>
    <item>
      <title>NYT Pips hints, answers for December 29, 2025</title>
      <link>https://mashable.com/article/pips-nyt-games-hints-answers-easy-medium-hard-december-29</link>
      <pubDate>Mon, 29 Dec 2025 15:37:09 +0000</pubDate>
      <guid isPermaLink="false">02n9om1OcyQFK5ZDYYaX021</guid>
      <description>The New York Times' latest game, Pips, brings domino fun to your desktop. How to play Pips as well as hints in case you get stuck.</description>
    </item>
    <item>
      <title>This 27-inch all-in-one PC desktop is $320 off at Best Buy</title>
      <link>https://mashable.com/article/dec-29-hp-desktop-deal</link>
      <pubDate>Mon, 29 Dec 2025 15:35:40 +0000</pubDate>
      <guid isPermaLink="false">02qbbEQqIE8nl7Mp5txfbcG</guid>
      <description>Get the HP 27-inch Touch All-in-One with 16GB RAM and 1TB SSD for $809.99 ($320 off) at Best Buy.</description>
    </item>
    <item>
      <title>Bigger batteries, better AI, and more: here&#8217;s what the TechRadar team wants to see from smartphones in 2026</title>
      <link>https://www.techradar.com/phones/bigger-batteries-better-ai-and-more-heres-what-the-techradar-team-wants-to-see-from-smartphones-in-2026</link>
      <pubDate>Mon, 29 Dec 2025 15:35:00 +0000</pubDate>
      <guid isPermaLink="false">PrwrjC3nCAXev8Nj4KBFb8</guid>
      <description>Here&#8217;s what our resident tech-heads are hoping for in the world of smartphones next year.</description>
    </item>
    <item>
      <title>Can Zohran Mamdani deliver on NYC campaign promises? Experts weigh in</title>
      <link>https://www.fastcompany.com/91467452/can-zohran-mamdani-deliver-campaign-promises-experts-weigh-in</link>
      <pubDate>2025-12-29T15:30:51</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91467452/can-zohran-mamdani-deliver-campaign-promises-experts-weigh-in</guid>
      <description>The 34-year-old democratic socialist&#8217;s term begins on January 1 under intense scrutiny.
Zohran Mamdani has promised to transform New York City government when he becomes mayor. Can he do it?Mamdani, a 34-year-old democratic socialist, already faces intense scrutiny, even before taking office in one of the country&#8217;s most scrutinized political jobs. Republicans have cast him as a liberal boogeyman. Some of his fellow Democrats have deemed him too far left. Progressives are closely watching for any signs of him shifting toward the center.On Jan. 1, he will assume control of America&#8217;s biggest city...</description>
    </item>
    <item>
      <title>Robots in 2026 &#8212; the rise of Terminator this is not</title>
      <link>https://www.techradar.com/ai-platforms-assistants/robots-in-2026-the-rise-of-terminator-this-is-not</link>
      <pubDate>Mon, 29 Dec 2025 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">c6T7ugXys66ctBzwev24Bh</guid>
      <description>2026 should be a big year in robotics with humanoid robots in the home and in factories, but it also won't be as transformative as some think.</description>
    </item>
    <item>
      <title>Le jeu illimit&#233; sur GeForce Now, c&#8217;est termin&#233; : Nvidia impose un plafond &#224; tout le monde&#8230; ou presque</title>
      <link>https://www.frandroid.com/marques/nvidia/2922349_le-jeu-illimite-sur-geforce-now-cest-termine-nvidia-impose-un-plafond-a-tout-le-monde-ou-presque</link>
      <pubDate>Mon, 29 Dec 2025 15:26:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2922349_le-jeu-illimite-sur-geforce-now-cest-termine-nvidia-impose-un-plafond-a-tout-le-monde-ou-presque</guid>
      <description>
Nvidia met en place ce que la firme annon&#231;ait l'an dernier : une limite de temps de jeu mensuel via son service de cloud gaming GeForce Now. Tout le monde est concern&#233;, sauf certains abonn&#233;s.
</description>
    </item>
    <item>
      <title>Rainbow Six Siege servers are back online after shutting down in response to Marketplace hacks</title>
      <link>https://www.engadget.com/gaming/rainbow-six-siege-servers-are-back-online-after-shutting-down-in-response-to-marketplace-hacks-191049079.html?src=rss</link>
      <pubDate>Mon, 29 Dec 2025 15:22:54 +0000</pubDate>
      <guid isPermaLink="false">d2c981d2-9e5e-43f8-8c4f-631cd763f890</guid>
      <description>Ubisoft had to shut down Rainbow Six Siege's servers and roll back transactions, a situation that came from a widespread breach that left various players with billions of in-game credits, ultra-rare skins of weapons, and banned accounts. As of Sunday, December 28, the status page on Rainbow Six Siege's website still shows "unplanned outage" on all servers across PC, PlayStation and Xbox.Later that evening, though, the company confirmed that it was done testing on the update it pushed out and was opening the severs back up to players. It also said that the transaction rollback was complete, but...</description>
    </item>
  </channel>
</rss>
