<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 19 Nov 2025 16:53:24 GMT</lastBuildDate>
    <item>
      <title>Ahead of the official Black Friday PS5 deals starting on Friday, Walmart has a discount on a PS5 console - but you shouldn't buy it</title>
      <link>https://www.techradar.com/gaming/ahead-of-the-official-black-friday-ps5-deals-starting-on-friday-walmart-has-a-discount-on-a-ps5-console-but-you-shouldnt-buy-it</link>
      <pubDate>Wed, 19 Nov 2025 16:51:58 +0000</pubDate>
      <guid isPermaLink="false">SasfwgrUdoJuG6eYaLMRED</guid>
      <description>This early Black Friday PS5 deal at Walmart is absolutely not a Black Friday PS5 deal worth buying</description>
    </item>
    <item>
      <title>Amazon n&#8217;h&#233;site pas &#224; vendre au rabais de nombreux produits Tech la veille du Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2860071_amazon-lance-une-vague-de-promotions-pour-le-pre-black-friday-les-18-offres-a-ne-pas-louper</link>
      <pubDate>Wed, 19 Nov 2025 16:50:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860071_amazon-lance-une-vague-de-promotions-pour-le-pre-black-friday-les-18-offres-a-ne-pas-louper</guid>
      <description>
Amazon lance &#224; partir de demain ses offres Black Friday, mais certaines sont d&#233;j&#224; en lignes. Plusieurs gammes telles que les smartphones, ordinateurs portables, casques audio et consoles de jeux b&#233;n&#233;ficient actuellement de prix r&#233;duits.
</description>
    </item>
    <item>
      <title>Black Friday PC portables : notre top 10 des meilleurs bons plans sur les configurations gaming et bureautiques</title>
      <link>https://www.frandroid.com/bons-plans/2848587_black-friday-pc-portable-la-selection-des-11-meilleures-offres-sur-les-laptops-bureautiques-et-gaming-dapple-msi-lenovo</link>
      <pubDate>Wed, 19 Nov 2025 16:49:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2848587_black-friday-pc-portable-la-selection-des-11-meilleures-offres-sur-les-laptops-bureautiques-et-gaming-dapple-msi-lenovo</guid>
      <description>
Besoin d&#8217;un nouveau PC portable ? Que vous recherchiez un ordinateur bureautique ou un mod&#232;le taill&#233; pour le gaming, il y en a pour tous les go&#251;ts durant l&#8217;avant-premi&#232;re du Black Friday. Les marques phares comme Apple, Asus, HP, Lenovo ou encore MSI affichent d&#233;j&#224; de belles r&#233;ductions, pour tous les budgets et tous les usages.
</description>
    </item>
    <item>
      <title>I tested every Galaxy S25 model, and the one I recommend most is on sale now at Amazon and free from Verizon and T-Mobile</title>
      <link>https://www.techradar.com/seasonal-sales/i-tested-every-galaxy-s25-model-and-the-one-i-recommend-most-is-on-sale-now-at-amazon-and-free-from-verizon-and-t-mobile</link>
      <pubDate>Wed, 19 Nov 2025 16:46:42 +0000</pubDate>
      <guid isPermaLink="false">db7WUeqfRnBec9gFvbAvKm</guid>
      <description>The Samsung Galaxy S25 Plus gives you the most bang for the buck of any Galaxy S25 phone I've tested. It has amazing performance and great battery life, and it's even better when there's a discount.</description>
    </item>
    <item>
      <title>It&#8217;s official &#8211;the Porsche Cayenne Turbo Electric will be the most powerful production Porsche ever made</title>
      <link>https://www.techradar.com/vehicle-tech/hybrid-electric-vehicles/its-official-the-porsche-cayenne-turbo-electric-will-be-the-most-powerful-production-porsche-ever-made</link>
      <pubDate>Wed, 19 Nov 2025 16:45:20 +0000</pubDate>
      <guid isPermaLink="false">SSeHehfRgTMqoW7nMwV9tY</guid>
      <description>The Porsche Cayenne Turbo Electric is officially going to be the "most powerful production Porsche of all time".</description>
    </item>
    <item>
      <title>Ce pack Xiaomi avec smartphone + montre + &#233;couteurs est &#224; un super prix en cette veille de Black Friday Week</title>
      <link>https://www.frandroid.com/bons-plans/2875367_ce-pack-xiaomi-avec-smartphone-montre-ecouteurs-est-a-un-super-prix-en-cette-veille-de-black-friday-week</link>
      <pubDate>Wed, 19 Nov 2025 16:42:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2875367_ce-pack-xiaomi-avec-smartphone-montre-ecouteurs-est-a-un-super-prix-en-cette-veille-de-black-friday-week</guid>
      <description>
Xiaomi, c&#8217;est le genre de marque qui r&#234;ve d&#8217;emm&#233;nager chez vous, de vous &#233;quiper de la t&#234;te aux poignets. Pour ce pr&#233;-Black Friday, le trio smartphone + montre + &#233;couteurs tombe &#224; bas prix. L&#8217;endurant Redmi 15, l'&#233;l&#233;gante Watch Active 6 et les Buds 6 viennent ensemble, dans un seul et m&#234;me pack chez Electro Depot au tarif de 229 euros. Oui, moins cher que le prix du smartphone seul, affich&#233; &#224; 253 euros.
...</description>
    </item>
    <item>
      <title>Boulanger propose de v&#233;ritables p&#233;pites la veille du v&#233;ritable Black Friday : le TOP 26 des offres</title>
      <link>https://www.frandroid.com/bons-plans/2859523_boulanger-multiplie-deja-les-promotions-au-pre-black-friday-les-16-deals-a-retenir</link>
      <pubDate>Wed, 19 Nov 2025 16:39:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2859523_boulanger-multiplie-deja-les-promotions-au-pre-black-friday-les-16-deals-a-retenir</guid>
      <description>
Le Black Friday approche, Boulanger met donc en avant une nouvelle s&#233;rie de promotions sur une large s&#233;lection de produits. De nombreux appareils b&#233;n&#233;ficient actuellement de r&#233;ductions significatives, valables jusqu&#8217;&#224; la fin de l&#8217;&#233;v&#233;nement.
</description>
    </item>
    <item>
      <title>Cookies : l&#8217;Europe pr&#233;pare enfin la suppression des fen&#234;tres de consentement obligatoires</title>
      <link>https://www.frandroid.com/culture-tech/web/2877033_cookies-leurope-prepare-enfin-la-suppression-des-fenetres-de-consentement-obligatoires</link>
      <pubDate>Wed, 19 Nov 2025 16:39:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/web/2877033_cookies-leurope-prepare-enfin-la-suppression-des-fenetres-de-consentement-obligatoires</guid>
      <description>
Vous cliquez machinalement sur "Accepter" juste pour acc&#233;der au contenu ? Vous n'&#234;tes pas seul : 90 % des internautes font pareil. Bruxelles a enfin pris conscience de l'hypocrisie du syst&#232;me actuel. La Commission pr&#233;pare une r&#233;forme pour supprimer ces fen&#234;tres intrusives au profit d'un r&#233;glage unique dans le navigateur.
</description>
    </item>
    <item>
      <title>Sydney Sweeney&#8217;s Transformation Into a Right-Wing Meme Was Not a &#8216;Total Aesthetic Victory&#8217;</title>
      <link>https://gizmodo.com/sydney-sweeneys-transformation-into-a-right-wing-meme-was-not-a-total-aesthetic-victory-2000685483</link>
      <pubDate>Wed, 19 Nov 2025 16:35:42 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000685483</guid>
      <description>X users have made her the face of bigotry on the platform.</description>
    </item>
    <item>
      <title>Fnac et Darty d&#233;gainent de nouvelles offres &#224; l&#8217;approche du v&#233;ritable Black Friday : les 12 meilleurs deals &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2869625_fnac-et-darty-lancent-de-nouvelles-offres-a-lapproche-du-veritable-black-friday-le-top-10-des-bons-plans-immanquables</link>
      <pubDate>Wed, 19 Nov 2025 16:33:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2869625_fnac-et-darty-lancent-de-nouvelles-offres-a-lapproche-du-veritable-black-friday-le-top-10-des-bons-plans-immanquables</guid>
      <description>
Les promotions continuent de pleuvoir chez la Fnac et Darty. Les deux enseignes lancent une nouvelle vague d&#8217;offres particuli&#232;rement attractives lors du pr&#233;-Black Friday. On trouve le Pixel 9 &#224; -45&#8239;% ou encore le dernier pliant abordable de Samsung &#224; -30 %. Voici celles qui valent r&#233;ellement le coup.
</description>
    </item>
    <item>
      <title>3 Best Hall Effect Keyboards for Gamers and Serious Typists (2025)</title>
      <link>https://www.wired.com/gallery/best-hall-effect-keyboards/</link>
      <pubDate>Wed, 19 Nov 2025 16:30:00 +0000</pubDate>
      <guid isPermaLink="false">6831451f8a2de16a3cb20a34</guid>
      <description>Ascend from your mechanical keyboard to magnetically powered Hall effect switches.</description>
    </item>
    <item>
      <title>Test du Xgimi Horizon 20 Max, le laser 4K ultime pour le home cin&#233;ma</title>
      <link>https://www.frandroid.com/marques/xgimi/2876505_test-du-xgimi-horizon-20-max-le-laser-4k-ultime-pour-le-home-cinema</link>
      <pubDate>Wed, 19 Nov 2025 16:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xgimi/2876505_test-du-xgimi-horizon-20-max-le-laser-4k-ultime-pour-le-home-cinema</guid>
      <description>
Dot&#233; d&#8217;une fiche technique impressionnante et pens&#233; pour les salles lumineuses, le Xgimi Horizon 20 Max vise le tr&#232;s haut de gamme des projecteurs home cin&#233;ma. En voici notre test complet.
</description>
    </item>
    <item>
      <title>NASA&#8217;s Perseverance Has Seen a Lot of Rocks&#8212;But Not One Like This</title>
      <link>https://gizmodo.com/nasas-perseverance-has-seen-a-lot-of-rocks-but-not-one-like-this-2000688181</link>
      <pubDate>Wed, 19 Nov 2025 16:25:09 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000688181</guid>
      <description>In a first for the Perseverance rover, it appears to have found an iron-nickel meteorite near the Jezero Crater.</description>
    </item>
    <item>
      <title>7 superb portable power station deals that I am going to bookmark for Black Friday, including one that&#8217;s over $3,000 off right now!</title>
      <link>https://www.techradar.com/pro/7-superb-portable-power-station-deals-that-i-am-going-to-bookmark-for-black-friday-including-one-thats-over-usd3-000-off-right-now</link>
      <pubDate>Wed, 19 Nov 2025 16:22:00 +0000</pubDate>
      <guid isPermaLink="false">hvCKh967ZwYSxk6JEzfYTQ</guid>
      <description>Don't wait for Black Friday - there are already some standout portable power stations deals live right now.</description>
    </item>
    <item>
      <title>The Verge&#8217;s 2025 holiday gift guide for tinkerers</title>
      <link>https://www.theverge.com/tech/800444/best-tool-gift-ideas-2025</link>
      <pubDate>2025-11-19T11:17:53-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=800444</guid>
      <description>As AI tools continue to rise in popularity, it's easy to forget the satisfaction of using something that doesn't need an update or a prompt to help you get things done. I'm talking about tools. They're simple and rugged, and they don't make things needlessly complicated. And now that the holidays are approaching, these tools [&#8230;]</description>
    </item>
    <item>
      <title>Google Maps adds Gemini-powered tips section, EV charger availability predictions, and more</title>
      <link>https://techcrunch.com/2025/11/19/google-maps-adds-gemini-powered-tips-section-ev-charger-availability-predictions-and-more/</link>
      <pubDate>Wed, 19 Nov 2025 16:14:34 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069159</guid>
      <description>Now, when users search for places in Map like restaurants, hotels, or concert venues, they'll see a new "know before you go" tips section that will surface important information about the place.</description>
    </item>
    <item>
      <title>Le Black Friday en avance d&#233;stocke tous les vid&#233;oprojecteurs ! Voici notre s&#233;lection des 11 meilleures promotions</title>
      <link>https://www.frandroid.com/bons-plans/2872141_le-black-friday-en-avance-destocke-tous-les-videoprojecteurs-voici-notre-selection-des-meilleures-promotions-disponibles</link>
      <pubDate>Wed, 19 Nov 2025 16:12:24 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2872141_le-black-friday-en-avance-destocke-tous-les-videoprojecteurs-voici-notre-selection-des-meilleures-promotions-disponibles</guid>
      <description>
Les vid&#233;oprojecteurs ont de plus en plus la cote face aux t&#233;l&#233;viseurs. A tel point que lors des premi&#232;res offres avant le Black Friday, plusieurs mod&#232;les sont mis en promotion. Voici notre s&#233;lection compl&#232;te des meilleures r&#233;ductions.
</description>
    </item>
    <item>
      <title>Black Friday Xbox game deals are live &#8211; here are the Series X titles actually worth buying starting at under $6</title>
      <link>https://www.techradar.com/gaming/black-friday-xbox-game-deals-are-live-here-are-the-series-x-titles-actually-worth-buying-starting-at-under-usd6</link>
      <pubDate>Wed, 19 Nov 2025 16:11:33 +0000</pubDate>
      <guid isPermaLink="false">Yw2hUxfgWHQfcwpKjjQKkH</guid>
      <description>Xbox Series X games are going cheap ahead of Black Friday, with deals starting under $6.</description>
    </item>
    <item>
      <title>Lawmakers want to let users sue over harmful social media algorithms</title>
      <link>https://www.theverge.com/policy/824054/algorithm-accountability-act-section-230</link>
      <pubDate>2025-11-19T11:07:28-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=824054</guid>
      <description>Tech critics' least favorite law is under siege again, this time with a focus on its recommendation algorithms. On Wednesday Sens. John Curtis (R-UT) and Mark Kelly (D-AZ) introduced the Algorithm Accountability Act, which amends Section 230 of the Communications Decency Act to make platforms responsible for preventing their recommendation systems from causing certain foreseeable [&#8230;]...</description>
    </item>
    <item>
      <title>Windows 11&#8217;s Only New Useful Feature Has Nothing to Do With AI</title>
      <link>https://gizmodo.com/windows-11-only-new-useful-feature-has-nothing-to-do-with-ai-2000688165</link>
      <pubDate>Wed, 19 Nov 2025 16:06:36 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000688165</guid>
      <description>We're still waiting to get all those missing Windows 10 features in Windows 11.</description>
    </item>
    <item>
      <title>Google patches worrying Chrome zero-day flaw being exploited in the wild - here's how to stay safe</title>
      <link>https://www.techradar.com/pro/security/google-patches-worrying-chrome-zero-day-flaw-being-exploited-in-the-wild-heres-how-to-stay-safe</link>
      <pubDate>Wed, 19 Nov 2025 16:06:00 +0000</pubDate>
      <guid isPermaLink="false">XVcEFXkcZxK2dptFe2KP5B</guid>
      <description>A bug in Google Chrome V8 allowed for arbitrary code execution, and is being actively exploited.</description>
    </item>
    <item>
      <title>1,2 million de personnes touch&#233;es par le piratage de l&#8217;Urssaf : quels sont les risques ?</title>
      <link>https://www.frandroid.com/culture-tech/securite-applications/2876085_12-million-de-personnes-touchees-par-le-piratage-de-lurssaf-quels-sont-les-risques</link>
      <pubDate>Wed, 19 Nov 2025 16:05:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/securite-applications/2876085_12-million-de-personnes-touchees-par-le-piratage-de-lurssaf-quels-sont-les-risques</guid>
      <description>
Un des services de l'Urssaf a subi une cyberattaque massive. Au total, les donn&#233;es de plus d'un million de personnes ont &#233;t&#233; d&#233;rob&#233;es. Voici ce que les criminels peuvent en faire.
</description>
    </item>
    <item>
      <title>I'm tracking these 11 early Black Friday SSD and HDD storage deals with prices from $130 and massive 16TB capacities</title>
      <link>https://www.techradar.com/pro/11-rampant-storage-deals-im-tracking-for-black-friday</link>
      <pubDate>Wed, 19 Nov 2025 16:02:09 +0000</pubDate>
      <guid isPermaLink="false">FSZPjwRL8e6mff5ZHERhKJ</guid>
      <description>Black Friday sales haven't officially started yet - but these are the storage items I'm keeping the closest eye on</description>
    </item>
    <item>
      <title>The Team Behind &#8216;The Last Starship&#8217; Break Down Their Audacious New &#8216;Star Trek&#8217; Comic</title>
      <link>https://gizmodo.com/star-trek-the-last-starship-spoilers-interview-kirk-borg-klingons-2000688147</link>
      <pubDate>Wed, 19 Nov 2025 16:00:34 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000688147</guid>
      <description>Jackson Lanzing, Collin Kelly, and Heather Antos sit down with io9 to talk about bringing Captain Kirk back from the grave, and more, in 'The Last Starship'.</description>
    </item>
    <item>
      <title>Voici les 17 produits Tech pas chers pour se faire plaisir &#224; petit prix lors du pr&#233;-Black Friday : la s&#233;lection &#224; moins de 100 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2866283_voici-les-14-produits-tech-pas-chers-pour-se-faire-plaisir-a-petit-prix-lors-du-pre-black-friday-la-selection-a-moins-de-100</link>
      <pubDate>Wed, 19 Nov 2025 16:00:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2866283_voici-les-14-produits-tech-pas-chers-pour-se-faire-plaisir-a-petit-prix-lors-du-pre-black-friday-la-selection-a-moins-de-100</guid>
      <description>
Le v&#233;ritable Black Friday arrive &#224; grands pas et de nombreuses promotions sont d&#233;j&#224; en ligne. M&#234;me avec un budget inf&#233;rieur &#224; 100 euros, il est possible de se faire plaisir. Pour celles et ceux qui surveillent leurs d&#233;penses, voici une s&#233;lection des meilleures offres &#224; ne pas manquer.
</description>
    </item>
    <item>
      <title>How Donald Trump Lost Control of the Epstein Spin Cycle</title>
      <link>https://www.wired.com/story/how-donald-trump-lost-control-of-the-epstein-spin-cycle/</link>
      <pubDate>Wed, 19 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">691b2e2a6ec7da216c943364</guid>
      <description>Donald Trump has spent years benefiting from the QAnon's Jeffrey Epstein obsession. That&#8217;s all changing.</description>
    </item>
    <item>
      <title>How to watch CMA Awards 2025 online for free from anywhere &#8211; plus performances from Keith Urban and Shaboozey</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/cma-awards-2025</link>
      <pubDate>Wed, 19 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">TeRQPmkSND7czCHgRfqbfm</guid>
      <description>Lainey Wilson returns to Bridgestone Arena to celebrate country music&#8217;s hottest stars, and our guide explains how to watch CMA Awards 2025 online from anywhere and for free.</description>
    </item>
    <item>
      <title>Making a good impression in a new job</title>
      <link>https://www.fastcompany.com/91443743/making-a-good-impression-in-a-new-job</link>
      <pubDate>2025-11-19T16:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91443743/making-a-good-impression-in-a-new-job</guid>
      <description>Listening and being humble are two key things to keep in mind.
Starting a new job can be exhilarating and stressful at the same time. You are excited to meet new people, take on new responsibilities, and grow. You also want to demonstrate to your new employer that they made the right choice by hiring you.&#160;</description>
    </item>
    <item>
      <title>You should buy a DualSense Edge this Black Friday, but only if it falls to this price</title>
      <link>https://www.techradar.com/gaming/you-should-buy-a-dualsense-edge-this-black-friday-but-only-if-it-falls-to-this-price</link>
      <pubDate>Wed, 19 Nov 2025 15:58:38 +0000</pubDate>
      <guid isPermaLink="false">sKsdrdQVynU7V6AbSN2P5d</guid>
      <description>There&#8217;s a high likelihood of DualSense Edge discounts this Black Friday, but should you really buy one?</description>
    </item>
    <item>
      <title>Quelle montre connect&#233;e Garmin choisir ? Notre s&#233;lection des meilleurs mod&#232;les de 2025</title>
      <link>https://www.frandroid.com/guide-dachat/1649125_montres-connectees-garmin-quel-modele-de-smartwatch-choisir</link>
      <pubDate>Wed, 19 Nov 2025 15:55:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/1649125_montres-connectees-garmin-quel-modele-de-smartwatch-choisir</guid>
      <description>
Si vous &#234;tes &#224; la recherche d'une excellente smartwatch pour vous accompagner pendant vos s&#233;ances de sport, la marque Garmin est la r&#233;f&#233;rence. Quelle est la meilleure montre connect&#233;e Garmin ? Nous avons d&#233;taill&#233; les gammes du constructeur et s&#233;lectionn&#233; les meilleurs mod&#232;les.
</description>
    </item>
    <item>
      <title>&#201;crivez comme Google : la nouvelle police Google Sans Flex est gratuite</title>
      <link>https://www.frandroid.com/marques/google/2876351_ecrivez-comme-google-la-nouvelle-police-google-sans-flex-est-gratuite</link>
      <pubDate>Wed, 19 Nov 2025 15:53:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2876351_ecrivez-comme-google-la-nouvelle-police-google-sans-flex-est-gratuite</guid>
      <description>
Google met &#224; disposition sa propre police de caract&#232;re Google Sans Flex. Tout le monde peut s'en servir. On vous explique comment la r&#233;cup&#233;rer.
</description>
    </item>
    <item>
      <title>Watch how Apple 3D prints Watches by blasting powdered titanium with lasers</title>
      <link>https://www.theverge.com/news/823988/apple-watch-3d-printing-process</link>
      <pubDate>2025-11-19T10:52:06-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=823988</guid>
      <description>If you compare the Apple Watch Ultra 3 with the Ultra 2, you probably wouldn&#8217;t be able to tell they were made with drastically different manufacturing processes. The titanium Apple Watch Series 11 and Ultra 3 are not only made with 100 percent recycled titanium powder, but are also 3D-printed, a process that&#8217;s pretty impressive [&#8230;]</description>
    </item>
    <item>
      <title>La nouvelle t&#233;l&#233;commande Google TV ne meurt jamais</title>
      <link>https://www.01net.com/actualites/la-nouvelle-telecommande-google-tv-ne-meurt-jamais.html</link>
      <pubDate>Wed, 19 Nov 2025 15:49:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309376</guid>
      <description>Les constructeurs de bo&#238;tiers de streaming Google TV ont d&#233;sormais &#224; leur disposition une nouvelle t&#233;l&#233;commande certifi&#233;e. Le mod&#232;le G32 comprend &#233;videmment des boutons d'acc&#232;s vers des services de streaming et surtout, il remplace les piles par une cellule solaire.</description>
    </item>
    <item>
      <title>7 smashing rugged smartphones I'm definitely earmarking for Black Friday</title>
      <link>https://www.techradar.com/pro/7-smashing-rugged-smartphones-im-definitely-earmarking-for-black-friday</link>
      <pubDate>Wed, 19 Nov 2025 15:45:34 +0000</pubDate>
      <guid isPermaLink="false">AdHzSefYfktig4hCWs76kf</guid>
      <description>These are the rugged smartphones I'm keeping a close eye on for Black Friday.</description>
    </item>
    <item>
      <title>Adobe to buy Semrush for $1.9 billion</title>
      <link>https://techcrunch.com/2025/11/19/adobe-to-buy-semrush-for-1-9-billion/</link>
      <pubDate>Wed, 19 Nov 2025 15:42:15 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069146</guid>
      <description>Adobe said it would offer $12 per share for Semrush, almost double the latter's closing price of $6.89 on Tuesday, before news of the deal.</description>
    </item>
    <item>
      <title>Garmin's latest dash cams sink to record-low prices for Black Friday &#8211; here are my expert picks, including the budget Dash Cam Mini 3</title>
      <link>https://www.techradar.com/vehicle-tech/dash-cams/garmins-latest-dash-cams-sink-to-record-low-prices-for-black-friday-here-are-my-expert-picks-including-the-budget-dash-cam-mini-3</link>
      <pubDate>Wed, 19 Nov 2025 15:37:21 +0000</pubDate>
      <guid isPermaLink="false">KwPgztLHtPGHEwJt8AhHWe</guid>
      <description>From the budget Dash Cam Mini 3 to the flagship X310, Garmin's new dash cams get the Black Friday treatment</description>
    </item>
    <item>
      <title>Disney loses bid to block Sling TV&#8217;s one-day cable passes</title>
      <link>https://www.theverge.com/news/824017/disney-sling-tv-cable-passes-block-denied</link>
      <pubDate>2025-11-19T10:36:30-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=824017</guid>
      <description>A federal judge in New York denied Disney&#8217;s request to block Sling TV&#8217;s short-term passes, which give viewers the ability to stream live content for as little as one day. In a ruling on Tuesday, US District Judge Arun Subramanian ruled that Disney didn&#8217;t prove that Sling TV&#8217;s passes caused &#8220;irreparable harm&#8221; to the entertainment [&#8230;]</description>
    </item>
    <item>
      <title>Voici enfin les premiers prix de la Renault Twingo &#233;lectrique : moins de 20 000 &#8364; confirm&#233;, mais il y a un mais</title>
      <link>https://www.frandroid.com/marques/renault/2876717_voici-enfin-les-premiers-prix-de-la-renault-twingo-electrique-moins-de-20-000-e-confirme-mais-il-y-a-un-mais</link>
      <pubDate>Wed, 19 Nov 2025 15:33:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2876717_voici-enfin-les-premiers-prix-de-la-renault-twingo-electrique-moins-de-20-000-e-confirme-mais-il-y-a-un-mais</guid>
      <description>
&#192; peine pr&#233;sent&#233;e, la Renault Twingo E-Tech annonce ses prix pour le march&#233; italien. De quoi offrir une premi&#232;re id&#233;e de ce qui nous attend en France, et de d&#233;couvrir que la promesse d'une voiture &#233;lectrique &#224; moins de 20 000 euros sera une r&#233;alit&#233;... un peu plus tard.
</description>
    </item>
    <item>
      <title>Hisense&#8217;s Annual Upgrade Season Is Taking Up to $2,800 Off Its Top TVs Before Black Friday, With a Free $100 FIFA Gift Card</title>
      <link>https://gizmodo.com/hisenses-annual-upgrade-season-is-taking-up-to-2800-off-its-top-tvs-before-black-friday-with-a-free-100-fifa-gift-card-2000686716</link>
      <pubDate>Wed, 19 Nov 2025 15:32:15 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000686716</guid>
      <description>Upgrading your entertainment setup has never been more affordable.</description>
    </item>
    <item>
      <title>The 100, Arrow and Supernatural are all leaving Netflix in December &#8211; here are some similar TV shows to watch instead</title>
      <link>https://www.techradar.com/streaming/netflix/the-100-arrow-and-supernatural-are-all-leaving-netflix-in-december-here-are-some-similar-tv-shows-to-watch-instead</link>
      <pubDate>Wed, 19 Nov 2025 15:31:17 +0000</pubDate>
      <guid isPermaLink="false">PxFeAa5x6ZJ5TZCKsbBwpC</guid>
      <description>A new slew of shows leaving Netflix in December include Arrow, The 100 and Supernatural &#8211; here are similar series to watch instead.</description>
    </item>
    <item>
      <title>Le pr&#233;-Black Friday ratisse le prix de ce robot tondeuse Mammotion capable d&#8217;op&#233;rer sur une superficie de 800 m2</title>
      <link>https://www.frandroid.com/bons-plans/2875775_le-pre-black-friday-ratisse-le-prix-de-ce-robot-tondeuse-mammotion-capable-doperer-sur-une-superficie-de-800-m2</link>
      <pubDate>Wed, 19 Nov 2025 15:31:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2875775_le-pre-black-friday-ratisse-le-prix-de-ce-robot-tondeuse-mammotion-capable-doperer-sur-une-superficie-de-800-m2</guid>
      <description>
Les robots tondeuses commencent s&#233;rieusement &#224; gagner du terrain, au point que l&#8217;on voit d&#233;sormais appara&#238;tre des mod&#232;les abordables&#8230; sans pour autant sacrifier la fiche technique. C&#8217;est le cas de la Mammotion Yuka Mini 800. Et pour le rendre encore plus s&#233;duisant, il s&#8217;offre une belle coupe avant le Black Friday son prix passe de 959 euros &#224; 699 euros chez Boulanger.
...</description>
    </item>
    <item>
      <title>Une pr&#233;cision jamais atteinte dans une simulation de la Voie lact&#233;e : ce qu&#8217;elle promet pour la science est immense</title>
      <link>https://www.futura-sciences.com/sciences/actualites/voie-lactee-precision-jamais-atteinte-simulation-voie-lactee-ce-quelle-promet-science-immense-127668/#xtor%3DRSS-8</link>
      <pubDate>Wed, 19 Nov 2025 16:31:10 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/voie-lactee-precision-jamais-atteinte-simulation-voie-lactee-ce-quelle-promet-science-immense-127668/#xtor%3DRSS-8</guid>
      <description>Simuler un syst&#232;me aussi complexe qu&#8217;une galaxie, c&#8217;est un casse-t&#234;te, m&#234;me avec les supercalculateurs les plus perfectionn&#233;s. Mais des chercheurs ont trouv&#233; un moyen de doper leurs performances. Ils nous r&#233;v&#232;lent tout&#8230;</description>
    </item>
    <item>
      <title>Bipartisan bill seeks to pay air traffic controllers during shutdowns</title>
      <link>https://www.fastcompany.com/91445005/bipartisan-bill-air-traffic-controllers-pay-shutdowns</link>
      <pubDate>2025-11-19T15:30:59</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91445005/bipartisan-bill-air-traffic-controllers-pay-shutdowns</guid>
      <description>Over the years, lawmakers have tried to find a long-term solution to keep air traffic controllers and other essential aviation workers paid during funding lapses.
The flight disruptions during the record&#160;government shutdown&#160;that ended last week inspired a rare act of bipartisanship in Washington on Tuesday, when congressional representatives from both parties introduced legislation that would allow&#160;air traffic controllers&#160;to get paid during future shutdowns....</description>
    </item>
    <item>
      <title>Xiaomi multiplie les deals &#224; la veille du Black Friday : les 17 meilleures offres &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2858733_xiaomi-profite-du-pre-black-friday-pour-brader-ses-produits-les-plus-populaires-les-8-offres-a-saisir</link>
      <pubDate>Wed, 19 Nov 2025 15:30:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2858733_xiaomi-profite-du-pre-black-friday-pour-brader-ses-produits-les-plus-populaires-les-8-offres-a-saisir</guid>
      <description>
&#192; l'approche du Black Friday, Xiaomi n'h&#233;site pas &#224; casser le prix de ses produits, y compris sur les r&#233;f&#233;rences les plus r&#233;centes. Voici les produits de la marque que l'on recommande sans h&#233;siter.
</description>
    </item>
    <item>
      <title>19 Best Mac Accessories (2025), Tested and Reviewed</title>
      <link>https://www.wired.com/gallery/best-mac-accessories/</link>
      <pubDate>Wed, 19 Nov 2025 15:30:00 +0000</pubDate>
      <guid isPermaLink="false">6800120f10c613a84bf60f5c</guid>
      <description>From a Mac Mini hub to mechanical keyboards, these curated gadgets will upgrade your Mac-powered desktop.</description>
    </item>
    <item>
      <title>Zohran Mamdani is quickly becoming conservative media&#8217;s new bogeyman</title>
      <link>https://www.fastcompany.com/91444999/zohran-mamdani-conservative-media-bogeyman</link>
      <pubDate>2025-11-19T15:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444999/zohran-mamdani-conservative-media-bogeyman</guid>
      <description>Mamdani&#8217;s status as a member of the Democratic Socialists of America and his Muslim background are behind many of the conservative media attacks.
New York City&#8217;s incoming mayor, Zohran Mamdani, hasn&#8217;t taken office yet. But he&#8217;s already the new avatar of evil for conservative media figures.</description>
    </item>
    <item>
      <title>With upcoming ban, Meta begins to notify Australian teens that their accounts will be shut down</title>
      <link>https://techcrunch.com/2025/11/19/with-upcoming-ban-meta-begins-to-notify-australian-teens-that-their-accounts-will-be-shut-down/</link>
      <pubDate>Wed, 19 Nov 2025 15:29:38 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069147</guid>
      <description>When the ban goes into effect on December 10, Meta will revoke account access for users under the age of 16 in Australia.</description>
    </item>
    <item>
      <title>Spotify&#8217;s new features let listeners explore the people and stories behind their favorite music</title>
      <link>https://techcrunch.com/2025/11/19/spotifys-new-features-let-listeners-explore-the-people-and-stories-behind-their-favorite-music/</link>
      <pubDate>Wed, 19 Nov 2025 15:24:19 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069145</guid>
      <description>Spotify's new features will showcase who's behind your favorite songs, how music is connected, and what inspired the tunes.</description>
    </item>
    <item>
      <title>60+ early Black Friday deals: Score big savings on MacBooks, Nintendo Switch 2, Keurig, and Garmin</title>
      <link>https://mashable.com/article/best-early-black-friday-deals-2025</link>
      <pubDate>Wed, 19 Nov 2025 15:21:44 +0000</pubDate>
      <guid isPermaLink="false">02qcRU5kEQhykGdtbnTdwiW</guid>
      <description>We found the latest early Black Friday deals on Apple products, robot vacuums, headphones, power stations, Legos, and tons more goodies.</description>
    </item>
    <item>
      <title>Ray clusters hijacked and turned into crypto miners by shadowy new botnet</title>
      <link>https://www.techradar.com/pro/security/ray-clusters-hijacked-and-turned-into-crypto-miners-by-shadowy-new-botnet</link>
      <pubDate>Wed, 19 Nov 2025 15:21:00 +0000</pubDate>
      <guid isPermaLink="false">ozXReKDgQvNrMjRL6dMUDb</guid>
      <description>IronErn440 is using a known, unfixed flaw, to create a botnet and deploy the XMRig cryptojacker.</description>
    </item>
    <item>
      <title>Why &#8216;Twin Peaks&#8217; Still Looks Incredible Decades Later</title>
      <link>https://gizmodo.com/twin-peaks-cinematography-ronald-victor-garcia-david-lynch-2000688097</link>
      <pubDate>Wed, 19 Nov 2025 15:19:02 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000688097</guid>
      <description>Director of Photography Ronald V&#237;ctor Garc&#237;a shares all the metaphorical direction Lynch would give him to nail the show's warm vibes.</description>
    </item>
    <item>
      <title>This viral AI pen didn&amp;#8217;t help me cheat</title>
      <link>https://www.theverge.com/report/822151/ai-smart-pen-for-cheating-tests</link>
      <pubDate>2025-11-19T10:12:20-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=822151</guid>
      <description>A college student recently told me about the latest tech designed to help students cheat - and it wasn't ChatGPT. It was an actual, physical gadget marketed in YouTube ads as the workaround to physical, hardcopy tests, which are back in vogue now as AI tears through higher education like a tornado. (One example is [&#8230;]</description>
    </item>
    <item>
      <title>Exceptionally Rare Pink Grasshopper Is Chonky, Adorable&#8212;and a Genetic Miracle</title>
      <link>https://gizmodo.com/exceptionally-rare-pink-grasshopper-is-chonky-adorable-and-a-genetic-miracle-2000688101</link>
      <pubDate>Wed, 19 Nov 2025 15:10:02 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000688101</guid>
      <description>The color, likely caused by a genetic mutation, is lovely to behold but unfortunately detrimental to the critter's chances of survival.</description>
    </item>
    <item>
      <title>Best Gifts for Hikers, Backpackers, Outdoorsy People (2025)</title>
      <link>https://www.wired.com/gallery/awesome-gifts-for-hikers-backpackers-and-outdoorsy-people/</link>
      <pubDate>Wed, 19 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">66e33f4256ceae918a4e0dd0</guid>
      <description>Let them pick out their own hiking boots. Instead, try gifting a useful blade or a nature journal to delight your outdoorsy friend.</description>
    </item>
    <item>
      <title>Demonschool channels Buffy and Persona for delightfully demonic RPG action</title>
      <link>https://www.theverge.com/games-review/770090/demonschool-review-switch-xbox-ps5</link>
      <pubDate>2025-11-19T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=770090</guid>
      <description>In one particularly memorable sequence in Demonschool - the new tactical RPG from Necrosoft that, after a few hiccups, releases on November 19th - I throw a doll at a zombie's head, dispatch it with a roundhouse kick to the jowls as I watch my friends sweep demons off the floor in vortices of blood, [&#8230;]</description>
    </item>
    <item>
      <title>Onepot AI raises $13M to help make chemical drug creation easier</title>
      <link>https://techcrunch.com/2025/11/19/onepot-ai-raises-13m-to-help-make-chemical-drug-creation-easier/</link>
      <pubDate>Wed, 19 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3069120</guid>
      <description>Onepot AI is a a company that is home to the small-molecule synthesis lab POT-1.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Thursday, November 20 (game #1396)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-20-november-2025</link>
      <pubDate>Wed, 19 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">dfG6nNNELMA8kf5xyerQLQ</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Thursday, November 20 (game #893)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-20-november-2025</link>
      <pubDate>Wed, 19 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">N2C2T6DztpWdxSdKpSUx89</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Thursday, November 20 (game #627)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-20-november-2025</link>
      <pubDate>Wed, 19 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">fbbFeFc9a6hqGZ9pRhwynF</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>What is the release date for South Park season 28 episode 4 on Paramount+?</title>
      <link>https://www.techradar.com/streaming/paramount-plus/what-is-the-release-date-for-south-park-season-28-episode-4-on-paramount</link>
      <pubDate>Wed, 19 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">EAHrGv77cwoKfgRfGfVxPP</guid>
      <description>You'll have to wait patiently for more South Park, as there's no new episode this week.</description>
    </item>
    <item>
      <title>How&#160;modern&#160;CMOs drive strategic impact in the age of&#160;AI</title>
      <link>https://www.fastcompany.com/91444224/how-modern-cmos-drive-strategic-impact-in-the-age-of-ai</link>
      <pubDate>2025-11-19T15:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444224/how-modern-cmos-drive-strategic-impact-in-the-age-of-ai</guid>
      <description>The new imperatives for marketing leadership to unlock growth. 
In today&#8217;s hyper-competitive B2B landscape, marketing leaders face a paradox:&#160;The&#160;pace of change is relentless, yet the need for clarity and purpose has never been greater.&#160;With artificial intelligence (AI) reshaping every&#160;facet&#160;of business, the imperative is not just to keep up but to lead the charge.&#160;&#160;...</description>
    </item>
    <item>
      <title>La guerre des routeurs&#160;: TP-Link accuse Netgear de d&#233;nigrement &#224; un milliard de dollars</title>
      <link>https://www.01net.com/actualites/la-guerre-des-routeurs-tp-link-accuse-netgear-de-denigrement-a-un-milliard-de-dollars.html</link>
      <pubDate>Wed, 19 Nov 2025 14:55:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1309359</guid>
      <description>Guerre ouverte sur le march&#233; des routeurs. TP-Link accuse son concurrent Netgear d'&#339;uvrer dans l'ombre pour lui nuire, en orchestrant une campagne de d&#233;sinformation qui pourrait lui co&#251;ter tr&#232;s cher.</description>
    </item>
    <item>
      <title>This smart Nextbase dash cam for &#163;59 is my expert-approved pick &#8211; but hurry, the deal ends today</title>
      <link>https://www.techradar.com/vehicle-tech/dash-cams/this-smart-nextbase-dash-cam-for-gbp59-is-my-expert-approved-pick-but-hurry-the-deal-ends-today</link>
      <pubDate>Wed, 19 Nov 2025 14:55:26 +0000</pubDate>
      <guid isPermaLink="false">Ge6bbXATALHGWXs5wCSkzM</guid>
      <description>Amazon has the Nextbase Piqo for just &#163;59, and I think it's a no-brainer buy. Get it while it's still in stock.</description>
    </item>
  </channel>
</rss>
