<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 01 Feb 2026 11:26:17 GMT</lastBuildDate>
    <item>
      <title>Man Utd vs Fulham Live Streams: How to watch Premier League 2025-26 from anywhere in the world</title>
      <link>https://www.techradar.com/how-to-watch/football/man-utd-vs-fulham-watch-premier-league-2025-26</link>
      <pubDate>Sun, 01 Feb 2026 11:20:00 +0000</pubDate>
      <guid isPermaLink="false">tBDTK5nzjpqUuoVaLhrENX</guid>
      <description>All the ways to watch Man Utd vs Fulham live streams online and from anywhere, as the Red Devils chase another win at Old Trafford.</description>
    </item>
    <item>
      <title>The Best Chocolate Boxes of 2026 for Valentine&#8217;s Delivery</title>
      <link>https://www.wired.com/story/best-chocolate-boxes-delivery-2026/</link>
      <pubDate>Sun, 01 Feb 2026 11:02:00 +0000</pubDate>
      <guid isPermaLink="false">697bd05c975afcdd18512b92</guid>
      <description>We tasted dozens of chocolates to find the best-tasting delivery boxes for your true love, self-love, or your lovely mother.</description>
    </item>
    <item>
      <title>Google Meet et la France, Apple AirTag 2 et WinRAR&#8230; &#8211; L&#8217;actu tech de la semaine</title>
      <link>https://www.frandroid.com/actualites-generales/2961541_recap-tech-semaine-202605</link>
      <pubDate>Sun, 01 Feb 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2961541_recap-tech-semaine-202605</guid>
      <description>
Encore une semaine riche en actualit&#233;s tech. Voici, entre autres, quelques sujets qu'il ne fallait pas manquer : l'administration fran&#231;ais qui va bloquer Google Meet en interne, l'annonce d'un nouveau AirTag par Apple ou encore une alerte s&#233;curit&#233; sur WinRAR.
</description>
    </item>
    <item>
      <title>Un crash plan&#233;taire colossal pourrait expliquer pourquoi cette &#233;toile s&#8217;est assombrie</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-crash-planetaire-colossal-pourrait-expliquer-cette-etoile-assombrie-130416/#xtor%3DRSS-8</link>
      <pubDate>Sun, 01 Feb 2026 11:47:56 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-crash-planetaire-colossal-pourrait-expliquer-cette-etoile-assombrie-130416/#xtor%3DRSS-8</guid>
      <description>J0705+0612 est une &#233;toile de type solaire &#226;g&#233;e d&#8217;un peu plus de deux milliards d&#8217;ann&#233;es et situ&#233;e &#224; seulement 3&#8239;000 ann&#233;es-lumi&#232;re du Syst&#232;me solaire. A priori, rien de bien exotique et pourtant, de septembre 2024 &#224; mai 2025, sa luminosit&#233; a brusquement diminu&#233; d&#8217;un facteur 40&#160;! Les...</description>
    </item>
    <item>
      <title>The Information Networks That Connect Venezuelans in Uncertain Times</title>
      <link>https://www.wired.com/story/venezuela-information-networks-maduro-censorship/</link>
      <pubDate>Sun, 01 Feb 2026 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">697b600e3bf992a51d40fd4c</guid>
      <description>The people of Venezuela have spent years learning resilience in the face of censorship, disinformation, and repression. They now rely on those tools more than ever.</description>
    </item>
    <item>
      <title>Un QLED de 43&#8243; avec Dolby Vision/Atmos et Google TV &#224; moins de 250 &#8364; ? C&#8217;est possible pour la fin des soldes</title>
      <link>https://www.frandroid.com/bons-plans/2961821_un-qled-de-43-avec-dolby-vision-atmos-et-google-tv-a-moins-de-250-e-cest-possible-pour-la-fin-des-soldes</link>
      <pubDate>Sun, 01 Feb 2026 10:29:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2961821_un-qled-de-43-avec-dolby-vision-atmos-et-google-tv-a-moins-de-250-e-cest-possible-pour-la-fin-des-soldes</guid>
      <description>
Le TCL 43P7K est un t&#233;l&#233;viseur avec une dalle QLED de 43 pouces. Compatible avec les technologies HDR10+ et Dolby Vision, ce t&#233;l&#233;viseur n'est pas en reste c&#244;t&#233; audio avec le Dolby Atmos. Les soldes affichent ce TV &#224; moins de 250 euros sur Amazon.
</description>
    </item>
    <item>
      <title>Ultime d&#233;lai pour le transfert des comptes Fitbit vers Google</title>
      <link>https://www.01net.com/actualites/ultime-delai-pour-le-transfert-des-comptes-fitbit-vers-google.html</link>
      <pubDate>Sun, 01 Feb 2026 10:01:46 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323547</guid>
      <description>Les t&#234;tes-en-l'air et les retardataires ont gagn&#233; un nouveau sursis : Google a en effet repouss&#233; la date fatidique pour migrer un compte Fitbit. La derni&#232;re &#233;ch&#233;ance &#233;tait programm&#233;e au 2 f&#233;vrier, elle a bascul&#233; au 19 mai. Ouf !</description>
    </item>
    <item>
      <title>What If the Sensors on Your Car Were Inspecting Potholes for the Government? Honda Found Out</title>
      <link>https://gizmodo.com/what-if-the-sensors-on-your-car-were-inspecting-potholes-for-the-government-honda-found-out-2000715973</link>
      <pubDate>Sun, 01 Feb 2026 10:00:33 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000715973</guid>
      <description>Radars and cameras might be for seeing cars and people now but they can be used to make existing roads better in the first place.</description>
    </item>
    <item>
      <title>Smartphones durables&#160;: quels t&#233;l&#233;phones ont les meilleures dur&#233;es de vie en 2026&#8201;?</title>
      <link>https://www.frandroid.com/guide-dachat/smartphones/1288951_smartphones-durables-quel-telephone-a-la-meilleure-duree-de-vie</link>
      <pubDate>Sun, 01 Feb 2026 10:00:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/smartphones/1288951_smartphones-durables-quel-telephone-a-la-meilleure-duree-de-vie</guid>
      <description>
Acheter un smartphone durable est-il possible&#8201;? Entre les diff&#233;rents engagements &#233;cologiques, les mises &#224; jour logicielles et la r&#233;parabilit&#233;, les crit&#232;res de choix sont multiples. Nous vous proposons de d&#233;couvrir quelles sont les marques proposant les t&#233;l&#233;phones avec la meilleure dur&#233;e de vie.
</description>
    </item>
    <item>
      <title>Who really controls your data? The test of sovereign cloud</title>
      <link>https://www.techradar.com/pro/who-really-controls-your-data-the-test-of-sovereign-cloud</link>
      <pubDate>Sun, 01 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">5FxeJuQd6DaZv9HwwjQMch</guid>
      <description>As demand for sovereignty and resilience grows, the question is how Europe can build a more balanced and independent cloud ecosystem.</description>
    </item>
    <item>
      <title>Groundhogs are bad at predicting weather, but they&#8217;re valuable animal engineers</title>
      <link>https://www.fastcompany.com/91481894/groundhogs-are-bad-at-predicting-weather-but-theyre-valuable-animal-engineers</link>
      <pubDate>2026-02-01T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91481894/groundhogs-are-bad-at-predicting-weather-but-theyre-valuable-animal-engineers</guid>
      <description>Also known as woodchucks, they are correct 50% of the time in forecasting the arrival of spring.
Whether you call him groundhog, woodchuck, or whistle-pig, or use the full genus and species name, Marmota monax, the nation&#8217;s premier animal weather forecaster has been making headlines as Punxsutawney Phil for decades.</description>
    </item>
    <item>
      <title>Bitwarden announced a price hike in the worst way possible</title>
      <link>https://www.fastcompany.com/91483458/bitwarden-price-increase</link>
      <pubDate>2026-02-01T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91483458/bitwarden-price-increase</guid>
      <description>With any luck, it&#8217;s not a sign of bigger issues for the excellent password manager&#8217;s maker.
Bitwarden is one of the more likable tech companies. It offers a great password manager for free, charges modestly for its paid version, and has mostly stayed in its lane with its focus on security products.</description>
    </item>
    <item>
      <title>Why an all-foods-fit approach to nutrition is better than dieting, according to a dietitian</title>
      <link>https://www.fastcompany.com/91481885/why-an-all-foods-fit-approach-to-nutrition-is-better-than-dieting</link>
      <pubDate>2026-02-01T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91481885/why-an-all-foods-fit-approach-to-nutrition-is-better-than-dieting</guid>
      <description>This eating philosophy allows for nuance to exist in health and nutrition. 
Eat this, not that. This one food will cure everything. That food is poison. Cut this food out. Try this diet. Don&#8217;t eat at these times. Eat this food and you&#8217;ll lose weight. With society&#8217;s obsession with food, health, and weight, statements like these are all over social media, gyms, and even healthcare offices....</description>
    </item>
    <item>
      <title>Obfuscation VPN : que sont les serveurs VPN obfusqu&#233;s et pourquoi sont-ils recommand&#233;s pour naviguer en s&#233;curit&#233; ?</title>
      <link>https://www.frandroid.com/services/vpn/2957127_obfuscation-vpn-que-sont-les-serveurs-vpn-obfusques-et-pourquoi-sont-ils-recommandes-pour-naviguer-en-securite</link>
      <pubDate>Sun, 01 Feb 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/vpn/2957127_obfuscation-vpn-que-sont-les-serveurs-vpn-obfusques-et-pourquoi-sont-ils-recommandes-pour-naviguer-en-securite</guid>
      <description>
C'est un mot &#233;trange que l'on n'entend pas tous les jours. L'obfuscation d&#233;signe au sens large toutes les strat&#233;gies pour brouiller les traces. Dans le cas des VPN, l'obfuscation d&#233;signe non pas les techniques employ&#233;es pour dissimuler ses activit&#233;s en ligne ; c'est d&#233;j&#224; leur principe de base. Voici tout ce qu'il y a &#224; savoir sur l'obfuscation.
</description>
    </item>
  </channel>
</rss>
