<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 24 Dec 2025 13:35:05 GMT</lastBuildDate>
    <item>
      <title>Orange fait un cadeau surprise aux Livebox 4 et 5 (mais il peut brider votre Wi-Fi)</title>
      <link>https://www.01net.com/actualites/orange-fait-un-cadeau-surprise-aux-livebox-4-et-5-mais-il-peut-brider-votre-wi-fi.html</link>
      <pubDate>Wed, 24 Dec 2025 13:32:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317157</guid>
      <description>C'est une mise &#224; jour aussi discr&#232;te qu'importante. Orange a commenc&#233; &#224; d&#233;ployer une nouvelle fonctionnalit&#233; sur ses anciennes Livebox 4 et 5, ainsi que sur les mod&#232;les Sosh, pour r&#233;duire leur consommation &#233;lectrique. Attention, cette &#233;conomie d'&#233;nergie passe par une coupure automatique d'une partie du Wi-Fi, ce qui peut impacter la qualit&#233; de votre connexion....</description>
    </item>
    <item>
      <title>Toyota's Prius Prime saved me gas money but probably not the environment</title>
      <link>https://www.engadget.com/transportation/toyotas-prius-prime-saved-me-gas-money-but-probably-not-the-environment-133027378.html?src=rss</link>
      <pubDate>Wed, 24 Dec 2025 13:30:27 +0000</pubDate>
      <guid isPermaLink="false">2adbb108-ccc5-4295-a399-d2b2c5581dab</guid>
      <description>I&#8217;ve always wondered what it would be like to own a plug-in hybrid, and recently, fate handed me that opportunity. On a recent trip to Vancouver, I rented a 2024 Toyota Prius Prime for nearly two months &#8212; the ideal scenario to try out North America&#8217;s most popular PHEV.
My experience with the Prius Prime
Previously, the words "Prius" and "sexy" were rarely used in the same sentence. However, I think the wedge-shaped Prius Prime introduced for 2023 is much sexier than its frumpy predecessors. The sleek shape also pierces the wind better to improve efficiency. It&#8217;s lower to the ground than before...</description>
    </item>
    <item>
      <title>How to Choose a Computer Monitor (2025): Everything You Need to Know</title>
      <link>https://www.wired.com/story/how-to-choose-a-computer-monitor/</link>
      <pubDate>Wed, 24 Dec 2025 13:30:00 +0000</pubDate>
      <guid isPermaLink="false">69446762ac80595d87684b6f</guid>
      <description>Monitors are cheaper, faster, and more beautiful than ever. Here&#8217;s how to choose one that will suit your needs and budget.</description>
    </item>
    <item>
      <title>The best shows and movies to stream on Netflix in 2025</title>
      <link>https://www.theverge.com/entertainment/845388/netflix-best-shows-movies-2025</link>
      <pubDate>2025-12-24T08:30:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=845388</guid>
      <description>Netflix has had an interesting year. Its ad tier, introduced last year, has grown significantly, and its live TV initiative has expanded to include not only weird one-offs like hot-dog-eating grudge matches but also WWE programming. Taking KPop Demon Hunters off Sony's hands for the business equivalent of $200 in a potato chip bag also [&#8230;]</description>
    </item>
    <item>
      <title>Orange am&#233;liore ses vieilles Livebox : elles vont consommer beaucoup moins d&#8217;&#233;nergie gr&#226;ce &#224; cette nouveaut&#233; bienvenue</title>
      <link>https://www.frandroid.com/marques/orange/2920541_orange-ameliore-ses-vieilles-livebox-elles-vont-consommer-beaucoup-moins-denergie-grace-a-cette-nouveaute-bienvenue</link>
      <pubDate>Wed, 24 Dec 2025 13:24:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/orange/2920541_orange-ameliore-ses-vieilles-livebox-elles-vont-consommer-beaucoup-moins-denergie-grace-a-cette-nouveaute-bienvenue</guid>
      <description>
Orange a entam&#233; le d&#233;ploiement d'une nouveaut&#233; logicielle int&#233;ressante vou&#233;e &#224; ses anciennes Livebox 4 et Livebox 5. Cette derni&#232;re leur permet d&#233;sormais de g&#233;rer dynamiquement la bande des 5 GHz pour faire d'importantes &#233;conomies d'&#233;nergie. 
</description>
    </item>
    <item>
      <title>C&#8217;est peut-&#234;tre la derni&#232;re offre avant No&#235;l pour la PS5 Slim : ce pack avec deux manettes chute sous les 500 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2920581_cest-peut-etre-la-derniere-offre-avant-noel-pour-la-ps5-slim-ce-pack-deux-manettes-chute-sous-les-500-e</link>
      <pubDate>Wed, 24 Dec 2025 13:21:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2920581_cest-peut-etre-la-derniere-offre-avant-noel-pour-la-ps5-slim-ce-pack-deux-manettes-chute-sous-les-500-e</guid>
      <description>
Compacte, dot&#233;e d'un espace de stockage confortable et toujours aussi performante, la PS5 Slim est bien plac&#233;e sur le podium des consoles next-gen. Si vous n'avez pas encore craqu&#233;, sachez qu'elle est actuellement, et s&#251;rement pour la derni&#232;re fois avant la fin des f&#234;tes de fin d'ann&#233;e 2025, en promo : PC Componentes la propose en pack &#224; 494,88 euros au lieu de 599,99 euros.
...</description>
    </item>
    <item>
      <title>On a essay&#233; la nouvelle Peugeot 308 &#233;lectrique restyl&#233;e, qui s&#8217;am&#233;liore sur un point en particulier</title>
      <link>https://www.frandroid.com/marques/peugeot/2887121_on-a-essaye-la-nouvelle-peugeot-308-electrique-restylee-qui-sameliore-sur-un-point-en-particulier</link>
      <pubDate>Wed, 24 Dec 2025 13:09:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/peugeot/2887121_on-a-essaye-la-nouvelle-peugeot-308-electrique-restylee-qui-sameliore-sur-un-point-en-particulier</guid>
      <description>
D&#233;voil&#233;e en 2023, l&#8217;actuelle g&#233;n&#233;ration de la Peugeot e-308 passe enfin par la case restylage. La voiture &#233;lectrique s&#8217;offre un style modernis&#233;, mais surtout, elle corrige l&#8217;un de ses plus gros d&#233;fauts. Nous en avons pris le volant, afin de savoir ce qu&#8217;elle vaut sur la route.
</description>
    </item>
    <item>
      <title>Le piratage de La Poste, une &#171;&#160;strat&#233;gie de sabotage&#160;&#187; qui risque de durer</title>
      <link>https://www.01net.com/actualites/piratage-la-poste-strategie-sabotage-vise-interets-francais.html</link>
      <pubDate>Wed, 24 Dec 2025 13:01:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317032</guid>
      <description>&#192; quelques heures de No&#235;l, La Poste reste prise en otage par une attaque DDoS qui s&#8217;&#233;ternise. Pour les experts, il s'agit d'une op&#233;ration de &#171; sabotage &#187; qui cherche &#224; nuire &#224; la France et aux millions de Fran&#231;ais qui attendent un colis. On fait le point sur la cyberattaque &#224; quelques heures du r&#233;veillon.</description>
    </item>
    <item>
      <title>How to redeem game codes on the Nintendo Switch 2</title>
      <link>https://www.engadget.com/gaming/nintendo/how-to-redeem-game-codes-on-the-nintendo-switch-2-130059847.html?src=rss</link>
      <pubDate>Wed, 24 Dec 2025 13:00:59 +0000</pubDate>
      <guid isPermaLink="false">a81f2c18-507d-4725-aaca-88daae260715</guid>
      <description>Digital game codes remain one of the simplest ways to add new titles to a Nintendo library. The Nintendo Switch 2 handles code redemption in a familiar way, building on the same process used on the original Switch. You can redeem a download code directly from the eShop on the console, or through a browser on a phone or desktop. Both routes link the purchase to the same Nintendo Account so the redeemed title appears on any compatible device tied to that account. The process is quick once you know where to look. Here is how to redeem game codes on Switch 2 through the console and online.
Things ...</description>
    </item>
    <item>
      <title>Samsung's latest Odyssey gaming monitor has a 32-inch 6K screen with glasses-free 3D</title>
      <link>https://www.engadget.com/computing/accessories/samsungs-latest-odyssey-gaming-monitor-has-a-32-inch-6k-screen-with-glasses-free-3d-130051748.html?src=rss</link>
      <pubDate>Wed, 24 Dec 2025 13:00:51 +0000</pubDate>
      <guid isPermaLink="false">907f23f2-3933-4b65-b5f7-864e897423fc</guid>
      <description>Ahead of CES 2026, Samsung has unveiled a number of impressive gaming monitors that flaunt 3D and very high refresh rates. The headliner is the 32-inch Odyssey 3D, "the world's first 6K display with glasses free 3D," according to Samsung. Along with the high resolution, it offers a 165Hz refresh rate (boosted to 330Hz through Dual Mode), along with a 1ms GtG response time. Optimized 3D effects that enhance terrain, distance and object separation "beyond 2D" will work with featured games like Stellar Blade and The First Berserker: Khazan," according to Samsung.
Another model, the 27-inch Odysse...</description>
    </item>
    <item>
      <title>In 2025, AI became a lightning rod for gamers and developers</title>
      <link>https://www.theverge.com/entertainment/848368/gen-ai-video-games-2025</link>
      <pubDate>2025-12-24T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=848368</guid>
      <description>2025 was the year generative AI made its presence felt in the video game industry. Its use has been discovered in some of the most popular games of the year, and CEOs from some of the largest game studios claim it's being implemented everywhere in the industry including in their own development processes. Meanwhile, rank-and-file [&#8230;]</description>
    </item>
    <item>
      <title>The Cosori 5L Rice Cooker review is a multifunctional appliance that delivers mixed results</title>
      <link>https://www.techradar.com/home/multi-cookers/cosori-5l-rice-cooker-review</link>
      <pubDate>Wed, 24 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">U6syvgu8gKrqgVwVCaVWV4</guid>
      <description>This rice cooker can steam, saut&#233;, and slow cook, but its rice cooking capabilities are somewhat disappointing</description>
    </item>
    <item>
      <title>Google Pixel phones need power and parity to fix a confusing product strategy in 2026</title>
      <link>https://www.techradar.com/phones/google-pixel-phones/google-pixel-phones-need-power-and-parity-to-fix-a-confusing-product-strategy-in-2026</link>
      <pubDate>Wed, 24 Dec 2025 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">kFo3EM7bNdjdB94UatDA97</guid>
      <description>Google has positioned itself as the software lover&#8217;s choice when it comes to flagship phones &#8211; but there are some odd gaps between the standard and Pro handsets.</description>
    </item>
    <item>
      <title>The fifth dimension of design</title>
      <link>https://www.fastcompany.com/91464967/the-fifth-dimension-of-design</link>
      <pubDate>2025-12-24T13:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91464967/the-fifth-dimension-of-design</guid>
      <description>Why time is the measure of true accessibility.
Michael Graves once said regarding a men&#8217;s suit, &#8220;You can buy a lot of cheap ones, or you can buy one great Armani suit.&#8221;</description>
    </item>
    <item>
      <title>Bo&#238;te de r&#233;ception | Pourriels, ChatGPT et Google Traduction</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-12-24/boite-de-reception/pourriels-chatgpt-et-google-traduction.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 24 Dec 2025 08:00:00 -0500</pubDate>
      <guid isPermaLink="false">84e3385e301f3d2f857b39131ab7d2d6</guid>
      <description>Chaque mercredi, notre journaliste r&#233;pond &#224; vos questions en lien avec le num&#233;rique et les nouvelles technologies. Cette semaine, on se demande qui combat les pourriels, on trouve les limites de l&#8217;intelligence artificielle sur son mobile et on d&#233;sactive la traduction dans Chrome.</description>
    </item>
    <item>
      <title>Voici ce que vous devez absolument activer si vous &#234;tes chez Free : la &#171;&#160;refonte&#160;&#187; 3G ne passent pas sur certains t&#233;l&#233;phones</title>
      <link>https://www.frandroid.com/marques/free/2920091_la-refonte-3g-de-free-tourne-au-cauchemar-pour-certains-smartphones</link>
      <pubDate>Wed, 24 Dec 2025 12:49:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2920091_la-refonte-3g-de-free-tourne-au-cauchemar-pour-certains-smartphones</guid>
      <description>
Votre t&#233;l&#233;phone affiche "4G", vos donn&#233;es fonctionnent, mais vos appels coupent ou n'aboutissent jamais ? Ne cherchez pas, ce n'est pas une panne temporaire. C'est structurel. Free est en train de transformer son r&#233;seau, et si votre smartphone n'est pas pr&#234;t, vous risquez bien plus qu'une conversation manqu&#233;e. 
</description>
    </item>
    <item>
      <title>Another image of the DJI Osmo Pocket 4 leaks &#8212; and it could come with a mysterious new accessory</title>
      <link>https://www.techradar.com/cameras/video-cameras/another-image-of-the-dji-osmo-pocket-4-leaks-and-it-could-come-with-a-mysterious-new-accessory</link>
      <pubDate>Wed, 24 Dec 2025 12:34:04 +0000</pubDate>
      <guid isPermaLink="false">tQKiWeRviGnCZpXUjxxxxX</guid>
      <description>We've got another sign of the DJI Osmo Pocket 4 and something called the DJI Osmo FrameTap.</description>
    </item>
    <item>
      <title>25 Work From Home Gift Ideas</title>
      <link>https://www.wired.com/gallery/work-from-home-gift-ideas/</link>
      <pubDate>Wed, 24 Dec 2025 12:30:00 +0000</pubDate>
      <guid isPermaLink="false">5db84ebc182de80009f7fe2b</guid>
      <description>Upgrade your loved one&#8217;s home office with these picks that make every day a little easier&#8212;and a little more fun.</description>
    </item>
    <item>
      <title>Save &#163;50 on Corsair&#8217;s top-tier VANGUARD PRO 96 Hall Effect Gaming Keyboard for Boxing Day</title>
      <link>https://www.techradar.com/computing/save-gbp50-on-corsairs-top-tier-vanguard-pro-96-hall-effect-gaming-keyboard-for-boxing-day</link>
      <pubDate>Wed, 24 Dec 2025 12:24:46 +0000</pubDate>
      <guid isPermaLink="false">WAnqzK6FaDi7mHp9WyjrKL</guid>
      <description>Save &#163;50 on Corsair&#8217;s top-tier VANGUARD PRO 96 Hall Effect Gaming Keyboard for Boxing Day</description>
    </item>
    <item>
      <title>Taking too many photos this year? Get Google's cloud storage for half price to keep them safe - or check out some of these other great deals</title>
      <link>https://www.techradar.com/computing/cloud-computing/taking-too-many-photos-this-year-get-googles-cloud-storage-for-half-price-to-keep-them-safe-or-check-out-some-of-these-other-great-deals</link>
      <pubDate>Wed, 24 Dec 2025 12:24:35 +0000</pubDate>
      <guid isPermaLink="false">XN263pahoM9fboRarg5vbH</guid>
      <description>If you'll be clogging up your camera roll with too many family videos this Christmas, check out this Google Cloud deal.</description>
    </item>
    <item>
      <title>Be confident online with 30% off at ESET with our exclusive code</title>
      <link>https://www.techradar.com/computing/antivirus/be-confident-online-with-30-percent-off-at-eset-with-our-exclusive-code</link>
      <pubDate>Wed, 24 Dec 2025 12:24:05 +0000</pubDate>
      <guid isPermaLink="false">ECDzbdCjwL3p2LgDwCxdS3</guid>
      <description>Save up to 30% on ESET Home Security Essential, Premium, and Ultimate with our exclusive code</description>
    </item>
    <item>
      <title>Cette Power Bank de 22.5 W perd deux euros chez Xiaomi et des &#233;couteurs filaires sont offerts</title>
      <link>https://www.frandroid.com/bons-plans/2920487_cette-power-bank-de-22-5-w-perd-deux-euros-chez-xiaomi-et-des-ecouteurs-filaires-sont-offerts</link>
      <pubDate>Wed, 24 Dec 2025 12:23:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2920487_cette-power-bank-de-22-5-w-perd-deux-euros-chez-xiaomi-et-des-ecouteurs-filaires-sont-offerts</guid>
      <description>
Xiaomi a sorti une petite power bank de poche qui dispose de nombreuses qualit&#233;s dont trois ports de charge de 22,5 W et une autonomie de 10 000 mAh. Sur le site de la marque chinoise, elle passe de 14,99 euros &#224; 12,99 euros et des &#233;couteurs filaires sont offerts.
</description>
    </item>
    <item>
      <title>Fallout Season 2 is full of game details. Heres a handy guide.</title>
      <link>https://mashable.com/article/fallout-2-game-details</link>
      <pubDate>Wed, 24 Dec 2025 12:18:37 +0000</pubDate>
      <guid isPermaLink="false">04jt30Cuy1RldDr6UkEYfPT</guid>
      <description>"Fallout 2" is full of game details. From Pip-Boys to power armor, the Prime Video series is a fan's Wasteland. Here's a guide.</description>
    </item>
    <item>
      <title>US bans former EU Commissioner and others over social media rules</title>
      <link>https://www.engadget.com/big-tech/us-bans-former-eu-commissioner-and-others-over-social-media-rules-121804097.html?src=rss</link>
      <pubDate>Wed, 24 Dec 2025 12:18:04 +0000</pubDate>
      <guid isPermaLink="false">4184b504-60fb-41fc-bb4a-7c7a4146d7e8</guid>
      <description>The Trump administration has issued travel bans that prohibit five European tech researchers, including one former EU Commissioner, from entering the United States. &#8220;For far too long, ideologues in Europe have led organized efforts to coerce American platforms to punish American viewpoints they oppose. The Trump Administration will no longer tolerate these egregious acts of extraterritorial censorship,&#8221; said US Secretary of State Marco Rubio.That official is Thierry Breton, the former European Commissioner for Internal Markets and Digital Services, who Sarah Rogers called the &#8220;mastermind&#8221; of t...</description>
    </item>
    <item>
      <title>The five-star JBL Charge 6 drops to its lowest-ever price on Amazon</title>
      <link>https://www.techradar.com/audio/wireless-bluetooth-speakers/the-five-star-jbl-charge-6-drops-to-its-lowest-ever-price-on-amazon</link>
      <pubDate>Wed, 24 Dec 2025 12:10:00 +0000</pubDate>
      <guid isPermaLink="false">4axfNxZJqbHmD2M2tHd9PE</guid>
      <description>The JBL Charge 6 is now available at a record-low price of $129.95, thanks to a limited-time deal at Amazon.</description>
    </item>
    <item>
      <title>This Switch 2 Joy-Con replacement was already my most anticipated accessory &#8212; and now it&#8217;s getting two new versions plus cool pre-order bonuses</title>
      <link>https://www.techradar.com/gaming/this-switch-2-joy-con-replacement-was-already-my-most-anticipated-accessory-and-now-its-getting-two-new-versions-plus-cool-pre-order-bonuses</link>
      <pubDate>Wed, 24 Dec 2025 12:03:07 +0000</pubDate>
      <guid isPermaLink="false">ToBQeK6DGDZaeRVKAavpC6</guid>
      <description>Two new versions of my most anticipated Nintendo Switch 2 accessory were just revealed.</description>
    </item>
    <item>
      <title>Surprise last-minute MacBook Air 15 deal at Best Buy drops latest model down to new record-low price</title>
      <link>https://www.techradar.com/computing/macbooks/surprise-last-minute-macbook-air-15-deal-at-best-buy-drops-latest-model-down-to-new-record-low-price</link>
      <pubDate>Wed, 24 Dec 2025 12:01:33 +0000</pubDate>
      <guid isPermaLink="false">bTFMzWKPN9mmPpRnU23KAh</guid>
      <description>You can bundle together a trade-in rebate and an upfront discount to get a MacBook Air 15 for just $299 at Best Buy today.</description>
    </item>
    <item>
      <title>The best streaming deals: Get 50 percent off MasterClass subscriptions, plus save on Starz, Audible, Crunchyroll and others</title>
      <link>https://www.engadget.com/deals/the-best-streaming-deals-get-50-percent-off-masterclass-subscriptions-plus-save-on-starz-audible-crunchyroll-and-others-133028536.html?src=rss</link>
      <pubDate>Wed, 24 Dec 2025 12:01:27 +0000</pubDate>
      <guid isPermaLink="false">026fe1b5-ea22-49f6-8016-fd8686928f5c</guid>
      <description>If you&#8217;ve been shocked by how much you spend on streaming services lately, you&#8217;re not alone. Companies like Netflix, Disney, HBO Max and others have been consistently raising prices to the point where you may question if streaming is even worth it anymore. We at Engadget still think it is, but we also think you should be smart with your money &#8212; and that&#8217;s where streaming deals come in.
Yes, it is possible to get discounts on services like Peacock and Paramount+, even if those deals aren&#8217;t as common as a sale on AirPods. If you&#8217;re looking to save money and still stream all of the content you wa...</description>
    </item>
    <item>
      <title>PSA: Please Do Not Buy This Dubious &#8216;AI Translator&#8217;</title>
      <link>https://gizmodo.com/psa-do-not-buy-innaio-t10-ai-translator-2000701432</link>
      <pubDate>Wed, 24 Dec 2025 12:00:33 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000701432</guid>
      <description>We were asked not to write this review for the InnAIO T10, so naturally, we wrote this review.</description>
    </item>
    <item>
      <title>Apple&#8217;s App Course Runs $20,000 a Student. Is It Really Worth It?</title>
      <link>https://www.wired.com/story/apple-app-making-course-michigan-state-university/</link>
      <pubDate>Wed, 24 Dec 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">694058f47656a254331c40b8</guid>
      <description>Apple, Michigan taxpayers, and one of Detroit&#8217;s wealthiest families spent roughly $30 million training hundreds of people to build iPhone apps. Not everyone lands coding jobs right away.</description>
    </item>
    <item>
      <title>What is the release date for Spartacus: House of Ashur episode 5 on Starz?</title>
      <link>https://www.techradar.com/streaming/entertainment/spartacus-house-of-ashur-episode-5-release-date-time-starz</link>
      <pubDate>Wed, 24 Dec 2025 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">v4M36Q4zDq8wtUaTythcGV</guid>
      <description>We've reached the halfway point of the Starz series, but when will Spartacus: House of Ashur episode 5 be released?</description>
    </item>
    <item>
      <title>Vie num&#233;rique | Le Canada entrera dans l&#8217;&#232;re des t&#233;l&#233;phones pliables en 2026</title>
      <link>https://www.lapresse.ca/affaires/techno/2025-12-24/vie-numerique/le-canada-entrera-dans-l-ere-des-telephones-pliables-en-2026.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Wed, 24 Dec 2025 07:00:00 -0500</pubDate>
      <guid isPermaLink="false">cd529b8acbef3b6da72d86b44f0638b0</guid>
      <description>Les &#233;crans pliables. On en trouve sur des t&#233;l&#233;phones vendus en Chine et en Europe depuis quelques ann&#233;es. Ils sont toujours tr&#232;s rares au Canada, mais 2026 pourrait changer la donne, maintenant qu&#8217;Apple songerait tr&#232;s s&#233;rieusement &#224; investir ce march&#233;.</description>
    </item>
    <item>
      <title>Tell Me Lies season 3: everything we know so far about the hit show's return to Hulu and Disney+</title>
      <link>https://www.techradar.com/streaming/hulu/tell-me-lies-season-3-everything-we-know-so-far-about-the-hit-shows-return-to-hulu-and-disney</link>
      <pubDate>Wed, 24 Dec 2025 11:54:00 +0000</pubDate>
      <guid isPermaLink="false">89gCBLFm2uRuxG6nD7tume</guid>
      <description>Tell Me Lies season 3 arrives on January 13 &#8211; here's everything you need to know about the hit Hulu and Disney+ show's return.</description>
    </item>
    <item>
      <title>Will it air fry? I've taste-tested 9 Christmas favorites in an air fryer &#8211;here are the results</title>
      <link>https://www.techradar.com/home/air-fryers/will-it-air-fry-ive-taste-tested-9-christmas-favorites-in-an-air-fryer-here-are-the-results</link>
      <pubDate>Wed, 24 Dec 2025 11:48:29 +0000</pubDate>
      <guid isPermaLink="false">xzssjDcBLZfLcCE3FhFpx5</guid>
      <description>Is an air fryer really the kitchen gadget panacea? We put it to the test with some Christmas classics.</description>
    </item>
    <item>
      <title>Hisense unveils two 4K laser projectors &#8212; a 300-inch beast with huge brightness, plus the sequel to the best ultra short throw projector</title>
      <link>https://www.techradar.com/televisions/projectors/hisense-unveils-two-4k-laser-projectors-a-300-inch-beast-with-huge-brightness-plus-the-sequel-to-the-best-ultra-short-throw-projector</link>
      <pubDate>Wed, 24 Dec 2025 11:45:04 +0000</pubDate>
      <guid isPermaLink="false">7L8q8CCGSXDq6JYVGSRvWk</guid>
      <description>Hisense unveils two new 4K laser projectors for images from 65 to 300 inches, including the PX4-Pro UST projector</description>
    </item>
    <item>
      <title>Guerre des puces&#160;: Washington accuse P&#233;kin de &#171;&#160;concurrence d&#233;loyale&#160;&#187; et promet des nouveaux droits de douane pour&#8230; 2027</title>
      <link>https://www.01net.com/actualites/guerre-des-puces-washington-accuse-pekin-de-concurrence-deloyale-et-promet-des-nouveaux-droits-de-douane-pour-2027.html</link>
      <pubDate>Wed, 24 Dec 2025 11:41:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1316984</guid>
      <description>Des menaces, mais pas encore d'actes : les &#201;tats-Unis comptent davantage taxer les semi-conducteurs chinois, mais seulement en juin 2027, en raison de la &#171;&#160;concurrence d&#233;loyale &#187; de P&#233;kin. La d&#233;claration intervient dans un contexte bien particulier de guerre des semi-conducteurs, mais aussi de tr&#234;ve commerciale entre les deux puissances.</description>
    </item>
  </channel>
</rss>
