<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 25 Nov 2025 11:32:37 GMT</lastBuildDate>
    <item>
      <title>Can Tech Get Rid of Bad Trips?</title>
      <link>https://www.wired.com/story/uncanny-valley-podcast-can-tech-get-rid-of-bad-trips/</link>
      <pubDate>Tue, 25 Nov 2025 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">691e1a55c48453eb436d0c6b</guid>
      <description>In this episode of Uncanny Valley, we talk about some of the latest drug trends and all the ways drugs are changing as they continue to be intertwined with tech.</description>
    </item>
    <item>
      <title>Black Friday Week audio : &#233;couteurs, casques, enceintes et barres de son, voici les 12 meilleures promos du moment</title>
      <link>https://www.frandroid.com/bons-plans/2849763_black-friday-week-ecouteurs-casques-et-enceintes-les-deals-les-plus-fous-sur-laudio</link>
      <pubDate>Tue, 25 Nov 2025 11:29:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849763_black-friday-week-ecouteurs-casques-et-enceintes-les-deals-les-plus-fous-sur-laudio</guid>
      <description>
Le vrai Black Friday approche, mais d'innombrables offres sont d&#233;j&#224; pr&#233;sentes chez les e-commer&#231;ants lors de cette Black Friday Week. C'est notamment le cas sur les produits audio de toutes sortes dont les casques Bluetooth et les &#233;couteurs sans fil.
</description>
    </item>
    <item>
      <title>On a vu la Leapmotor A10 (B03X) : pourquoi cette voiture &#233;lectrique chinoise de Stellantis pourrait faire mal aux Renault 4 et Peugeot 2008 en France</title>
      <link>https://www.frandroid.com/marques/leapmotor/2884557_on-a-vu-la-leapmotor-a10-b03x-pourquoi-cette-voiture-electrique-chinoise-de-stellantis-pourrait-faire-mal-aux-renault-4-et-peugeot-2008-en-france</link>
      <pubDate>Tue, 25 Nov 2025 11:26:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/leapmotor/2884557_on-a-vu-la-leapmotor-a10-b03x-pourquoi-cette-voiture-electrique-chinoise-de-stellantis-pourrait-faire-mal-aux-renault-4-et-peugeot-2008-en-france</guid>
      <description>
On a pu voir la nouvelle voiture &#233;lectrique chinoise de Stellantis qui devrait bient&#244;t arriver en Europe : la Leapmotor A10, appel&#233;e B03X chez nous. Un SUV compact qui viendra notamment concurrencer les Renault 4 E-Tech, Peugeot 2008 &#233;lectrique ou BYD Atto 2.
</description>
    </item>
    <item>
      <title>15&#160;&#8364; pour un iPad&#160;: un magasin fait une &#233;norme erreur et veut r&#233;cup&#233;rer les iPad vendus</title>
      <link>https://www.01net.com/actualites/15-euros-ipad-magasin-fait-erreur-veut-recuperer-ipad-vendus.html</link>
      <pubDate>Tue, 25 Nov 2025 11:24:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311010</guid>
      <description>&#192; la suite d'une erreur de prix, le g&#233;ant de l'&#233;lectronique MediaWorld a vendu des iPad pour 15 euros. Certains clients sont repartis avec leur tablette, avant de recevoir un message de l'enseigne.</description>
    </item>
    <item>
      <title>Apple reveals rare job cuts - some sales staff affected</title>
      <link>https://www.techradar.com/pro/apple-reveals-rare-job-cuts-some-sales-staff-affected</link>
      <pubDate>Tue, 25 Nov 2025 11:24:00 +0000</pubDate>
      <guid isPermaLink="false">rgxueDHLGsvhzgYeXJ9SdE</guid>
      <description>Apple doesn't often announce job cuts, but it seems these are only small layoffs.</description>
    </item>
    <item>
      <title>BYD &#233;crase Tesla sur le march&#233; europ&#233;en : un renversement spectaculaire qui n&#8217;a rien de vraiment &#233;tonnant</title>
      <link>https://www.frandroid.com/marques/byd/2884635_byd-ecrase-tesla-sur-le-marche-europeen-un-renversement-spectaculaire-qui-na-rien-de-vraiment-etonnant</link>
      <pubDate>Tue, 25 Nov 2025 11:23:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2884635_byd-ecrase-tesla-sur-le-marche-europeen-un-renversement-spectaculaire-qui-na-rien-de-vraiment-etonnant</guid>
      <description>
En octobre dernier, le constructeur chinois a vu ses immatriculations exploser de plus de 200 % en Europe, tandis que Tesla accuse un recul de pr&#232;s de 50%.
</description>
    </item>
    <item>
      <title>Black Friday : oubliez vendredi, les 10 meilleures offres sont d&#233;j&#224; l&#224; et c&#8217;est violent</title>
      <link>https://www.frandroid.com/bons-plans/2884767_black-friday-oubliez-vendredi-les-10-meilleures-offres-sont-deja-la-et-cest-violent</link>
      <pubDate>Tue, 25 Nov 2025 11:23:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2884767_black-friday-oubliez-vendredi-les-10-meilleures-offres-sont-deja-la-et-cest-violent</guid>
      <description>
Le Black Friday c'est officiellement vendredi, mais les stocks, eux, partent maintenant. Nous avons filtr&#233; des milliers d'offres pour ne garder que la cr&#232;me de la cr&#232;me : voici les 10 deals qu'il ne faut absolument pas rater aujourd'hui.
</description>
    </item>
    <item>
      <title>Thanks to Black Friday Backbone's latest and greatest mobile controller has never been cheaper</title>
      <link>https://www.techradar.com/gaming/thanks-to-black-friday-backbones-latest-and-greatest-mobile-controller-has-never-been-cheaper</link>
      <pubDate>Tue, 25 Nov 2025 11:22:24 +0000</pubDate>
      <guid isPermaLink="false">CWoiKPHAPVkf2nPF4Tsfzk</guid>
      <description>Go Pro this Black Friday</description>
    </item>
    <item>
      <title>Garmin Epix Pro (Gen 2) : la boussole des sportifs avec de l&#8217;OLED, plein de capteurs, une lampe, un GNSS perd plus de 500 &#8364; &#224; l&#8217;approche du Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2884301_garmin-epix-pro-gen-2-la-boussole-des-sportifs-avec-de-loled-plein-de-capteurs-une-lampe-un-gnss-perd-plus-de-500-e-a-lapproche-du-black-friday</link>
      <pubDate>Tue, 25 Nov 2025 11:21:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2884301_garmin-epix-pro-gen-2-la-boussole-des-sportifs-avec-de-loled-plein-de-capteurs-une-lampe-un-gnss-perd-plus-de-500-e-a-lapproche-du-black-friday</guid>
      <description>
L&#8217;Epix Pro de deuxi&#232;me g&#233;n&#233;ration, c&#8217;est la toquante ultime pour les amoureux d&#8217;outdoor : blind&#233;e de capteurs, r&#233;gl&#233;e au millim&#232;tre, taill&#233;e pour encaisser tout ce que la nature peut lui envoyer. Son seul vrai d&#233;faut, c&#8217;&#233;tait son prix &#224; sa sortie il y a deux ans. La Black Friday Week corrige l'heure, elle passe de 1 049 &#8364; &#224; 498 &#8364; chez Lepape.
</description>
    </item>
    <item>
      <title>A superfast portable SSD for $59! Walmart bargain 500GB external storage device undercuts Sandisk and Samsung rivals by</title>
      <link>https://www.techradar.com/pro/a-superfast-portable-ssd-for-usd59-walmart-bargain-500gb-external-storage-device-undercuts-sandisk-and-samsung-rivals-by</link>
      <pubDate>Tue, 25 Nov 2025 11:18:35 +0000</pubDate>
      <guid isPermaLink="false">QKsMkNMhy3u9CM5LQjPhu7</guid>
      <description>Onn 500GB SSD has a familiar orange carabiner and can reach surprisingly high speeds</description>
    </item>
    <item>
      <title>Fnac et Darty font le plein de bonnes affaires lors de la Black Friday Week : voici les 15 meilleures offres</title>
      <link>https://www.frandroid.com/bons-plans/2869625_fnac-et-darty-donnent-tout-pour-le-week-end-de-la-black-friday-week-le-top-15-des-offres-du-moment</link>
      <pubDate>Tue, 25 Nov 2025 11:16:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2869625_fnac-et-darty-donnent-tout-pour-le-week-end-de-la-black-friday-week-le-top-15-des-offres-du-moment</guid>
      <description>
La Black Week bat son plein chez la Fnac et Darty. Les deux enseignes proposent en continu de nouvelles offres. Pour ne rien manquer et profiter d&#232;s maintenant des meilleures r&#233;ductions, d&#233;couvrez la s&#233;lection des offres incontournables &#224; saisir sans tarder, avant &#233;puisement des stocks et la fin de l&#8217;&#233;v&#233;nement.
</description>
    </item>
    <item>
      <title>Starz is home to some of the best TV shows of 2025 &#8211; and with Prime Video&#8217;s Black Friday deal you can subscribe for less than $3</title>
      <link>https://www.techradar.com/streaming/entertainment/starz-is-home-to-some-of-the-best-tv-shows-of-2025-and-with-prime-videos-black-friday-deal-you-can-subscribe-for-less-than-usd3</link>
      <pubDate>Tue, 25 Nov 2025 11:12:05 +0000</pubDate>
      <guid isPermaLink="false">nvFZxcjiUaNCZmpDqYVkqV</guid>
      <description>Want a Starz subscription for less than $3? Say hello to Prime Video&#8217;s add-on Black Friday deal and stream 2025's most unmissable content.</description>
    </item>
    <item>
      <title>Assassin's Creed Shadows gets a limited-time Attack on Titan crossover mission and cosmetics in latest patch</title>
      <link>https://www.techradar.com/gaming/assassins-creed-shadows-gets-a-limited-time-attack-on-titan-crossover-mission-and-cosmetics-in-latest-patch</link>
      <pubDate>Tue, 25 Nov 2025 11:09:57 +0000</pubDate>
      <guid isPermaLink="false">jfQxXuYaMbntP2xJQJ6omF</guid>
      <description>Ubisoft has released the patch notes for the next Assassin's Creed Shadows update, which will feature a new, limited-time crossover event with Attack on Titan.</description>
    </item>
    <item>
      <title>Le ticket d&#8217;entr&#233;e pour l&#8217;OLED sur PC n&#8217;a jamais &#233;t&#233; aussi bas</title>
      <link>https://www.frandroid.com/bons-plans/bons-plans-gaming/2882101_le-ticket-dentree-pour-loled-sur-pc-na-jamais-ete-aussi-bas</link>
      <pubDate>Tue, 25 Nov 2025 11:08:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/bons-plans-gaming/2882101_le-ticket-dentree-pour-loled-sur-pc-na-jamais-ete-aussi-bas</guid>
      <description>
L'OLED sur PC, c'&#233;tait un luxe r&#233;serv&#233; aux budgets illimit&#233;s jusqu'&#224; ce matin. Avec 200 euros de r&#233;duction imm&#233;diate, ce Samsung Odyssey G5 brise enfin la barri&#232;re psychologique.
</description>
    </item>
    <item>
      <title>Pourquoi les Tesla sont les voitures les plus recal&#233;es au contr&#244;le technique</title>
      <link>https://www.frandroid.com/marques/tesla/2884281_pourquoi-les-tesla-sont-les-voitures-les-plus-recalees-au-controle-technique</link>
      <pubDate>Tue, 25 Nov 2025 11:06:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2884281_pourquoi-les-tesla-sont-les-voitures-les-plus-recalees-au-controle-technique</guid>
      <description>
L&#8217;ADAC vient de publier son &#233;tude sur les r&#233;sultats des voitures au contr&#244;le technique en Allemagne. Et c&#8217;est la douche froide pour les Tesla, qui arrivent en derni&#232;re place. On vous explique les raisons, qui peuvent toucher d'autres voitures &#233;lectriques.
</description>
    </item>
    <item>
      <title>Gemini 3's Nano Banana Pro photo editing is amazing &#8211; here are 3 ways to make the most of it</title>
      <link>https://www.techradar.com/ai-platforms-assistants/gemini/gemini-3s-nano-banana-pro-photo-editing-is-amazing-here-are-3-ways-to-make-the-most-of-it</link>
      <pubDate>Tue, 25 Nov 2025 11:00:37 +0000</pubDate>
      <guid isPermaLink="false">9gy8nMLZoPmVKCHzXQuapF</guid>
      <description>How Nano Banana Pro makes editing photos with AI easier and more impressive.</description>
    </item>
    <item>
      <title>Why Does This Michael Keaton Batman Figure Look Like That?</title>
      <link>https://gizmodo.com/michael-keaton-batman-blue-grey-hot-toys-2000691063</link>
      <pubDate>Tue, 25 Nov 2025 11:00:33 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000691063</guid>
      <description>Hot Toys has a new Keaton Batman out, this one from 'The Flash,' and it is very confusing.</description>
    </item>
    <item>
      <title>Wish List 2025: A WIRED Gift Guide</title>
      <link>https://www.wired.com/story/wish-list-2025/</link>
      <pubDate>Tue, 25 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">691bc7bc48da31ed31953d25</guid>
      <description>27 thoughtful and beautifully designed gifts, chosen by WIRED's editors.</description>
    </item>
    <item>
      <title>The real AI threat is algorithms that &#8216;enrage to engage&#8217;</title>
      <link>https://www.fastcompany.com/91434708/ai-algorithms-amplify-extremism</link>
      <pubDate>2025-11-25T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91434708/ai-algorithms-amplify-extremism</guid>
      <description>Feeds that amplify hysterical content are accelerating extremism and a grievance society that endangers us all.
Media personalities and online influencers who sow social division for a living, blame the rise of assassination culture on Antifa and MAGA. Meanwhile, tech CEOs gin up fears of an AI apocalypse. But they&#8217;re both smokescreens hiding a bigger problem. Algorithms decide what we see, and in trying to win their approval, we&#8217;re changing how we behave....</description>
    </item>
    <item>
      <title>How women business owners can use networking to close the capital and mentorship gap</title>
      <link>https://www.fastcompany.com/91443986/how-women-business-owners-can-use-networking-to-close-the-capital-and-mentorship-gap</link>
      <pubDate>2025-11-25T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91443986/how-women-business-owners-can-use-networking-to-close-the-capital-and-mentorship-gap</guid>
      <description>The key is thinking about what you can give when you connect with someone.
When I launched my first business in my twenties, I thought success meant doing everything alone. I believed that if I worked hard enough, read every business book, and put in the hours, I&#8217;d eventually figure it all out. What I quickly realized, however, is that you don&#8217;t find the most valuable growth strategy in your balance sheet. You find it in your network....</description>
    </item>
    <item>
      <title>How to introduce AI to a skeptical workplace</title>
      <link>https://www.fastcompany.com/91444787/how-to-introduce-ai-to-a-skeptical-workplace</link>
      <pubDate>2025-11-25T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91444787/how-to-introduce-ai-to-a-skeptical-workplace</guid>
      <description>There&#8217;s no point in convincing someone who doesn&#8217;t believe in it.
Chris was frustrated. He&#8217;d used Artificial Intelligence (AI) extensively in college. Now at his first job, he saw very few of his colleagues ever experimenting with it.</description>
    </item>
    <item>
      <title>For caregivers, Thanksgiving is no break at all</title>
      <link>https://www.fastcompany.com/91448214/for-caregivers-thanksgiving-is-no-break-at-all</link>
      <pubDate>2025-11-25T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448214/for-caregivers-thanksgiving-is-no-break-at-all</guid>
      <description>A new campaign by Paid Leave for All argues for legislation that gives paid family and medical leave to all working people.
You&#8217;re probably winding down from work and getting ready for a few days at home with your family. But anybody with caregiving responsibility knows that the Thanksgiving and Christmas breaks will not be relaxing. Since the United States does not have a federal policy that gives workers paid time off after giving birth, having a medical procedure, or to care for a loved one, many will cram this labor into their precious holiday time. ...</description>
    </item>
    <item>
      <title>ExpressVPN is still the most expensive VPN in our top 5, but here's why it's worth checking out</title>
      <link>https://www.techradar.com/vpn/vpn-services/expressvpn-is-still-the-most-expensive-vpn-in-our-top-5-but-heres-why-its-worth-checking-out</link>
      <pubDate>Tue, 25 Nov 2025 10:53:19 +0000</pubDate>
      <guid isPermaLink="false">NeY6Gsz4rUKJjbfx3UmfTe</guid>
      <description>ExpressVPN isn't joining the race to the bottom this Black Friday. We dig into why its premium price might just be worth it for your digital security needs.</description>
    </item>
    <item>
      <title>My favorite Proton VPN plan is half price right now &#8211; don't miss this Black Friday deal</title>
      <link>https://www.techradar.com/vpn/vpn-services/my-favorite-proton-vpn-plan-is-half-price-right-now-dont-miss-this-black-friday-deal</link>
      <pubDate>Tue, 25 Nov 2025 10:48:50 +0000</pubDate>
      <guid isPermaLink="false">RaP85oEvsqphhyHRRip5XA</guid>
      <description>Proton Unlimited is now $6.49 a month, down 50% on its normal price</description>
    </item>
    <item>
      <title>Le prix de cette RTX 5090 est hallucinant, mais elle est d&#233;j&#224; introuvable</title>
      <link>https://www.frandroid.com/marques/nvidia/2884563_le-prix-de-cette-rtx-5090-est-hallucinant-mais-elle-est-deja-introuvable</link>
      <pubDate>Tue, 25 Nov 2025 10:48:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2884563_le-prix-de-cette-rtx-5090-est-hallucinant-mais-elle-est-deja-introuvable</guid>
      <description>
Une carte graphique &#224; plus de 4000 euros, &#231;a vous dit ? L'&#233;dition limit&#233;e de RTX 5090 par Asus est d&#233;j&#224; en rupture de stock malgr&#233; son prix hors du commun.
</description>
    </item>
    <item>
      <title>La Black Friday Week est &#224; l&#8217;heure avec les meilleures montres connect&#233;es en promo ! Le top deals sur les Apple Watch et Garmin Fenix</title>
      <link>https://www.frandroid.com/bons-plans/2854639_black-friday-montre-connectee-meilleures-offres-apple-watch-samsung-galaxy-watch-garmin-fenix</link>
      <pubDate>Tue, 25 Nov 2025 10:48:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2854639_black-friday-montre-connectee-meilleures-offres-apple-watch-samsung-galaxy-watch-garmin-fenix</guid>
      <description>
Apple Watch, Samsung Galaxy Watch, Huawei Watch, Garmin Fenix... Il existe pl&#233;thore de r&#233;f&#233;rences sur le march&#233; des montres connect&#233;es et des p&#233;pites chez un peu tous les constructeurs. C'est dire si on a le choix dans cette s&#233;lection des meilleures promotions du Black Friday.
</description>
    </item>
    <item>
      <title>Crypto&#160;: le fondateur de Ledger d&#233;voile son myst&#233;rieux projet autour du Bitcoin</title>
      <link>https://www.01net.com/actualites/crypto-fondateur-ledger-devoile-mysterieux-projet-bitcoin.html</link>
      <pubDate>Tue, 25 Nov 2025 10:46:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310968</guid>
      <description>Magnat des cryptomonnaies et cofondateur de Ledger, &#201;ric Larchev&#234;que a  d&#233;voil&#233; The Bitcoin Society (TBSO) devant toute la France. M&#234;lant ambitions &#233;conomiques et influence politique, le projet a d&#233;clench&#233; des r&#233;actions contrast&#233;es.</description>
    </item>
    <item>
      <title>Nvidia vide ses stocks : la RTX 5060 et la 5080 sont les stars du jour pour le Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/bons-plans-hardware/2884599_nvidia-vide-ses-stocks-la-rtx-5060-et-la-5080-sont-les-stars-du-jour-pour-le-black-friday</link>
      <pubDate>Tue, 25 Nov 2025 10:37:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/bons-plans-hardware/2884599_nvidia-vide-ses-stocks-la-rtx-5060-et-la-5080-sont-les-stars-du-jour-pour-le-black-friday</guid>
      <description>
Les cartes graphiques Nvidia RTX 50 voient enfin leurs prix chuter drastiquement pour le Black Friday. Que vous visiez l'entr&#233;e de gamme ou le monstre de puissance, il y a une affaire &#224; saisir aujourd'hui.
</description>
    </item>
    <item>
      <title>Boulanger se montre g&#233;n&#233;reux &#224; la Black Friday Week avec ce TV Philips OLED et Ambilight g&#233;ant de 75 pouces brad&#233; &#224; moiti&#233; prix</title>
      <link>https://www.frandroid.com/bons-plans/2884309_boulanger-se-montre-genereux-a-la-black-friday-week-avec-ce-tv-philips-oled-et-ambilight-geant-de-75-pouces-brade-a-moitie-prix</link>
      <pubDate>Tue, 25 Nov 2025 10:33:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2884309_boulanger-se-montre-genereux-a-la-black-friday-week-avec-ce-tv-philips-oled-et-ambilight-geant-de-75-pouces-brade-a-moitie-prix</guid>
      <description>
Avec un prix &#224; la hauteur de sa dalle de 77 pouces, ce TV Philips 77OLED760 est assez on&#233;reux, mais Boulanger baisse son prix &#224; 1 379 euros au lieu de 2 498 euros pour le rendre plus accessible.
</description>
    </item>
    <item>
      <title>11 Best Down Comforters (2025), Tested in Our Homes in Every Season</title>
      <link>https://www.wired.com/gallery/best-down-comforters/</link>
      <pubDate>Tue, 25 Nov 2025 10:33:00 +0000</pubDate>
      <guid isPermaLink="false">67041330bf3ee9bf66b3c41a</guid>
      <description>The best down comforters keep you cozy and comfortable no matter the season. After sleep-testing multiple options, our top pick is the Premium from Quince.</description>
    </item>
    <item>
      <title>Those Viral Photos of Elon and Zuck Are AI. But Google Launched a New Way to Check for Fakes</title>
      <link>https://gizmodo.com/those-viral-photos-of-elon-and-zuck-are-ai-but-google-launched-a-new-way-to-check-for-fakes-2000691049</link>
      <pubDate>Tue, 25 Nov 2025 10:30:01 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000691049</guid>
      <description>The watermark is invisible to the naked eye. Here's how to find it.</description>
    </item>
    <item>
      <title>How to build a solopreneur safety net</title>
      <link>https://www.fastcompany.com/91445195/how-to-build-solopreneur-safety-net</link>
      <pubDate>2025-11-25T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91445195/how-to-build-solopreneur-safety-net</guid>
      <description>What to do before you leave your 9-to-5 job.
Leaving your corporate job for a solopreneur path is a bold move&#8212;and it can feel terrifying. But as long as you&#8217;re prepared, it can be a smart move, especially in the current rocky job market.</description>
    </item>
    <item>
      <title>Meta fires back at allegations that it silenced research linking Facebook to depression, anxiety, and loneliness</title>
      <link>https://www.fastcompany.com/91448117/meta-andy-stone-facebook-depression</link>
      <pubDate>2025-11-25T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448117/meta-andy-stone-facebook-depression</guid>
      <description>The company has implied that results of a recent study on social harms were flawed.
In a new legal filing, Meta is being accused of shutting down internal research that showed people who stopped using Facebook experienced less depression, anxiety, and loneliness. The allegations come as part of a lawsuit filed by several U.S. school districts against Meta, Snap, TikTok, and other social media companies....</description>
    </item>
    <item>
      <title>I adore my reMarkable 2 for digital writing - and this Black Friday deal makes it a must-buy for business professionals and writers</title>
      <link>https://www.techradar.com/pro/i-adore-my-remarkable-2-for-digital-writing-and-this-black-friday-deal-makes-it-a-must-buy-for-business-professionals-and-writers</link>
      <pubDate>Tue, 25 Nov 2025 10:26:06 +0000</pubDate>
      <guid isPermaLink="false">yQ9dkmNTNXnq4iiGoRa7xg</guid>
      <description>My absolute favorite gadget for getting down to business gets a proper discount for Black Friday.</description>
    </item>
    <item>
      <title>Ces anciennes voitures &#233;lectriques chinoises obtiennent ce que Tesla a toujours refus&#233; : des nouveaux calculateurs</title>
      <link>https://www.frandroid.com/marques/zeekr/2884427_ces-anciennes-voitures-electriques-chinoises-obtiennent-ce-que-tesla-a-toujours-refuse-des-nouveaux-calculateurs</link>
      <pubDate>Tue, 25 Nov 2025 10:25:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/zeekr/2884427_ces-anciennes-voitures-electriques-chinoises-obtiennent-ce-que-tesla-a-toujours-refuse-des-nouveaux-calculateurs</guid>
      <description>
La marque chinoise Zeekr vient de lancer une &#233;tonnante op&#233;ration : un financement participatif pour proposer aux clients de voitures &#233;lectriques d'ancienne g&#233;n&#233;ration l'installation les &#233;quipements d'aides &#224; la conduite des nouveaux mod&#232;les. Un cas refus&#233; par Tesla.
</description>
    </item>
    <item>
      <title>The best cordless vacuum I've tested is now at its lowest-ever price</title>
      <link>https://www.techradar.com/home/vacuums/the-best-cordless-vacuum-ive-tested-is-now-at-its-lowest-ever-price</link>
      <pubDate>Tue, 25 Nov 2025 10:24:49 +0000</pubDate>
      <guid isPermaLink="false">TeZhwAmQXm9uZYML5setwK</guid>
      <description>The Dreame R20 is an excellent all-rounder, and the Black Friday sales mean it's even more affordable than usual.</description>
    </item>
    <item>
      <title>Amazon brade un tas de produits Tech pour la Black Friday Week : les 21 offres &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2860071_amazon-se-montre-genereux-pour-la-black-friday-week-voici-les-20-offres-a-saisir-ce-week-end</link>
      <pubDate>Tue, 25 Nov 2025 10:24:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860071_amazon-se-montre-genereux-pour-la-black-friday-week-voici-les-20-offres-a-saisir-ce-week-end</guid>
      <description>
Amazon n&#8217;h&#233;site pas &#224; casser les prix de nombreuses r&#233;f&#233;rences sur son site lors de la Black Friday Week. Il y aura forc&#233;ment de quoi vous faire plaisir&#160;: retrouvez ici les meilleures offres qui valent le coup.
</description>
    </item>
    <item>
      <title>La Black Friday Week en mode gaming : la cr&#232;me des PC gamers pour le jeu vid&#233;o et la cr&#233;ation graphique est dans ce top deals</title>
      <link>https://www.frandroid.com/bons-plans/2875949_black-friday-week-les-meilleurs-pc-portables-gamers-en-promotion-msi-hp-acer-lenovo-asus</link>
      <pubDate>Tue, 25 Nov 2025 10:14:32 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2875949_black-friday-week-les-meilleurs-pc-portables-gamers-en-promotion-msi-hp-acer-lenovo-asus</guid>
      <description>
Voici pourquoi on attend le Black Friday et les salves de promotions sur les PC portables gaming : une machine de guerre capable de lancer les derniers jeux AAA et toutes ces p&#233;pites vid&#233;oludiques balanc&#233;es en pleine figure en cette ann&#233;e 2025. Voici le top du top des offres sur les laptops de gamers.
</description>
    </item>
    <item>
      <title>Data Centers in Texas Could Lead to Blackouts in the Middle of Winter, Group Warns</title>
      <link>https://gizmodo.com/data-centers-in-texas-could-lead-to-blackouts-in-the-middle-of-winter-group-warns-2000691060</link>
      <pubDate>Tue, 25 Nov 2025 10:00:22 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000691060</guid>
      <description>Data centers can warp an already strained electrical grid, a report claims.</description>
    </item>
    <item>
      <title>Sam Bankman-Fried Goes on the Offensive</title>
      <link>https://www.wired.com/story/sam-bankman-fried-goes-on-the-offensive/</link>
      <pubDate>Tue, 25 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">6924d64261a663371e3d9848</guid>
      <description>Two years after he was found guilty of fraud, FTX founder Sam Bankman-Fried is pursuing a legal appeal&#8212;and firing up his X account.</description>
    </item>
    <item>
      <title>Act fast! Disney has slashed the annual price of its Disney+ and Hulu ads bundle in a huge Black Friday deal</title>
      <link>https://www.techradar.com/streaming/disney-plus/act-fast-disney-has-slashed-the-annual-price-of-its-disney-and-hulu-ads-bundle-in-huge-black-friday-deal</link>
      <pubDate>Tue, 25 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">R7T8pp4BMvJD7Tcd7TC8TZ</guid>
      <description>One of the best Disney streaming deals is almost $100 off for Black Friday 2025 &#8211; here's why I'm snapping up this $4.99 a month offer.</description>
    </item>
    <item>
      <title>How great leaders boost motivation and avoid quiet quitting</title>
      <link>https://www.fastcompany.com/91433435/great-leaders-boost-motivation-quiet-quitting</link>
      <pubDate>2025-11-25T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91433435/great-leaders-boost-motivation-quiet-quitting</guid>
      <description>According to Culture Amp data, employees aren&#8217;t really quiet quitting, they&#8217;re asking you to listen.
The phrase&#160;quiet quitting&#160;has been cast as a generational rebellion, a&#160;disengagement crisis, and a&#160;leadership failure, all rolled into one. The narrative suggests that half of your workforce has decided to coast, collecting a paycheck while doing the bare minimum....</description>
    </item>
    <item>
      <title>Beating the AI bubble</title>
      <link>https://www.fastcompany.com/91443866/ai-bubble-economy-data-center-economy-palantir-open-ai</link>
      <pubDate>2025-11-25T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91443866/ai-bubble-economy-data-center-economy-palantir-open-ai</guid>
      <description>There&#8217;s a way out of the coming disaster.
You can&#8217;t help but feel uneasy when looking at market concentration. Alphabet, Amazon, Apple, Meta, Microsoft, Nvidia, and Tesla now make up more than a third of the S&amp;P 500, more than twice the level seen before the dot-com bust.</description>
    </item>
    <item>
      <title>Enjoy 100s of nostalgic classics with this family-friendly retro gaming console, now $75 off</title>
      <link>https://mashable.com/article/nov-25-kinhank-super-console-x2-pro-retro-gaming</link>
      <pubDate>Tue, 25 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00c2rYV0nOfmCC3KzZYrNwy</guid>
      <description>Enjoy a good old-fashioned family game night with the Kinhank Super Console X2 Pro Retro Gaming Emulator and Streaming Console, now $84.97 (reg. $159.99) through Dec. 14.</description>
    </item>
    <item>
      <title>The internet is drowning in AI slop. Heres how we got here.</title>
      <link>https://mashable.com/article/ai-slop-tiktok-fyp-trending-social-media-why</link>
      <pubDate>Tue, 25 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02sxufN7UIdKfMKlKUOj0eE</guid>
      <description>AI slop is all over our feeds. We examine why this is the case &#8212; and why it's worsening.</description>
    </item>
    <item>
      <title>Black Friday 2025: Live updates on the latest deals from Amazon, Target, Walmart, and more</title>
      <link>https://mashable.com/live/black-friday-live-deals-2025</link>
      <pubDate>Tue, 25 Nov 2025 09:59:06 +0000</pubDate>
      <guid isPermaLink="false">03tp2JNOQKRcB69tUBVVrSJ</guid>
      <description>Get live updates on Black Friday sales. We found savings of $150 on Dyson Supersonic hair dryers and $300 on Samsung TVs.</description>
    </item>
    <item>
      <title>If the latest foldable iPhone price rumor is correct, the iPad Mini 8 will be the only sensible choice</title>
      <link>https://www.techradar.com/phones/iphone/if-the-latest-foldable-iphone-price-rumor-is-correct-the-ipad-mini-8-will-be-the-only-sensible-choice</link>
      <pubDate>Tue, 25 Nov 2025 09:58:56 +0000</pubDate>
      <guid isPermaLink="false">rCWowuziGBpVEv7HfqmFoY</guid>
      <description>The iPhone Fold could be seriously expensive, crease-free, and launch next year, likely alongside the iPhone 18 series.</description>
    </item>
    <item>
      <title>Brew barista-quality coffee at home this Black Friday &#8212; save $350 on the DeLonghi Magnifica Evo</title>
      <link>https://mashable.com/article/black-friday-deal-2025-delonghi-magnifica-coffee-machine</link>
      <pubDate>Tue, 25 Nov 2025 09:57:10 +0000</pubDate>
      <guid isPermaLink="false">02wFB8sn3r0XNwWkzo0r3IK</guid>
      <description>Get $350 off the De'Longhi Magnifica Evo Automatic Espresso &amp; Coffee Machine this Black Friday. Now priced at $549.95 at Amazon.</description>
    </item>
    <item>
      <title>NYT Mini crossword answers, hints for November 25, 2025</title>
      <link>https://mashable.com/article/nyt-mini-crossword-answers-hints-november-25-2025</link>
      <pubDate>Tue, 25 Nov 2025 09:53:29 +0000</pubDate>
      <guid isPermaLink="false">04j0JaENsbPB2VxG9cm6jxM</guid>
      <description>Answers to each clue for the November 25, 2025 edition of NYT's The Mini crossword puzzle.</description>
    </item>
    <item>
      <title>The hidden gaps in your cloud security fabric</title>
      <link>https://www.techradar.com/pro/the-hidden-gaps-in-your-cloud-security-fabric</link>
      <pubDate>Tue, 25 Nov 2025 09:50:43 +0000</pubDate>
      <guid isPermaLink="false">RsjqMHvVZ9d3bjJztV7NVD</guid>
      <description>Your cloud isn&#8217;t as secure as you think&#8212;attackers thrive in the blind spots between workloads.</description>
    </item>
    <item>
      <title>Google Photos repense l&#8217;affichage des raccourcis et c&#8217;est impossible &#224; rater</title>
      <link>https://www.01net.com/actualites/google-photos-repense-affichage-des-raccourcis-impossible-rater.html</link>
      <pubDate>Tue, 25 Nov 2025 09:44:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1310956</guid>
      <description>Google Photos teste un nouveau carrousel pour les raccourcis, et vous allez tout de suite voir la diff&#233;rence.</description>
    </item>
    <item>
      <title>$69 Apple AirPods have just landed at Amazon &#8212; score a new record-low price for Black Friday</title>
      <link>https://mashable.com/article/best-black-friday-deal-2025-apple-airpods-4</link>
      <pubDate>Tue, 25 Nov 2025 09:36:35 +0000</pubDate>
      <guid isPermaLink="false">05kAWaEmfOwbk9aXbRabrkq</guid>
      <description>Get the best Black Friday AirPods deal. Apple AirPods 4 are on sale for $69 in the Amazon Black Friday sale.</description>
    </item>
  </channel>
</rss>
