<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 23 Jan 2026 08:36:39 GMT</lastBuildDate>
    <item>
      <title>Les donn&#233;es d&#8217;un million de chasseurs fran&#231;ais ont &#233;t&#233; pirat&#233;es</title>
      <link>https://www.01net.com/actualites/donnees-million-chasseurs-francais-piratees.html</link>
      <pubDate>Fri, 23 Jan 2026 08:22:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322043</guid>
      <description>La F&#233;d&#233;ration nationale des chasseurs vient de rejoindre la longue liste des f&#233;d&#233;rations fran&#231;aises victimes d'une cyberattaque. Au cours d'un incident r&#233;cent, ce sont les donn&#233;es d'un million de chasseurs qui ont &#233;t&#233; compromises. Les informations compromises sont d'ores et d&#233;j&#224; sur le dark web.</description>
    </item>
    <item>
      <title>Elon Musk a encore sorti sa boule de cristal : les robots humano&#239;des de Tesla ont une date de sortie</title>
      <link>https://www.frandroid.com/produits-android/robots/2952699_elon-musk-a-encore-sorti-sa-boule-de-cristal-les-robots-humanoides-de-tesla-ont-une-date-de-sortie</link>
      <pubDate>Fri, 23 Jan 2026 08:19:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/robots/2952699_elon-musk-a-encore-sorti-sa-boule-de-cristal-les-robots-humanoides-de-tesla-ont-une-date-de-sortie</guid>
      <description>
Elon Musk a encore sorti sa boule de cristal &#224; Davos. Le patron de Tesla promet d&#233;sormais que son robot humano&#239;de, Optimus, sera disponible pour les particuliers d'ici fin 2027. Une annonce qui intervient alors que le programme robotique de la marque a perdu sa t&#234;te pensante il y a six mois. On y croit ?
</description>
    </item>
    <item>
      <title>La Cnil inflige une lourde amende pour publicit&#233; cibl&#233;e ill&#233;gale</title>
      <link>https://www.01net.com/actualites/la-cnil-inflige-une-lourde-amende-pour-publicite-ciblee-illegale.html</link>
      <pubDate>Fri, 23 Jan 2026 08:00:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322023</guid>
      <description>La Cnil a lourdement sanctionn&#233; une entreprise qui a transmis pendant des ann&#233;es des donn&#233;es personnelles des membres de son programme de fid&#233;lit&#233; &#224; un r&#233;seau social. Plus de 10 millions d'utilisateurs europ&#233;ens sont concern&#233;s.</description>
    </item>
    <item>
      <title>Google propose de fouiller dans vos photos et vos mails pour am&#233;liorer ses r&#233;sultats de recherche</title>
      <link>https://www.frandroid.com/marques/google/2952685_google-propose-de-fouiller-dans-vos-photos-et-vos-mails-pour-ameliorer-ses-resultats-de-recherche</link>
      <pubDate>Fri, 23 Jan 2026 07:43:22 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2952685_google-propose-de-fouiller-dans-vos-photos-et-vos-mails-pour-ameliorer-ses-resultats-de-recherche</guid>
      <description>
Aur&#233;ol&#233; de son nouveau statut de roi de l&#8217;IA, Google d&#233;ploie une nouvelle fonctionnalit&#233; au sein de son moteur de recherche. Vos r&#233;sultats seront d&#233;sormais personnalis&#233;s gr&#226;ce au contenu de vos mails et de vos photos.
</description>
    </item>
    <item>
      <title>Google Photos int&#232;gre enfin la fonctionnalit&#233; parfaite pour cr&#233;er des m&#232;mes</title>
      <link>https://www.frandroid.com/android/applications/google-apps/2952683_google-photos-integre-enfin-la-fonctionnalite-parfaite-pour-creer-des-memes</link>
      <pubDate>Fri, 23 Jan 2026 07:38:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/applications/google-apps/2952683_google-photos-integre-enfin-la-fonctionnalite-parfaite-pour-creer-des-memes</guid>
      <description>
Transformez vos photos en m&#232;mes avec Google Photos avec cette nouvelle fonctionnalit&#233;, r&#233;serv&#233;e pour l'instant aux &#201;tats-Unis.
</description>
    </item>
    <item>
      <title>L&#8217;IA fait gagner de l&#8217;argent aux entreprises&#160;? Pour le moment c&#8217;est une id&#233;e re&#231;ue</title>
      <link>https://www.01net.com/actualites/ce-nest-pas-encore-leldorado-de-lia-dans-les-entreprises.html</link>
      <pubDate>Fri, 23 Jan 2026 07:30:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322028</guid>
      <description>Les entreprises qui succombent aux d&#233;lices de l'IA g&#233;n&#233;rative ne b&#233;n&#233;ficient pas forc&#233;ment d'une hausse de leurs revenus, malgr&#233; les gains en productivit&#233; que cette technologie est cens&#233;e apporter.</description>
    </item>
    <item>
      <title>Apr&#232;s le succ&#232;s de Nano Banana, Google Gemini s&#8217;attaque bient&#244;t &#224; une nouvelle fronti&#232;re sur Android</title>
      <link>https://www.frandroid.com/marques/2952663_apres-le-succes-de-nano-banana-google-gemini-sattaque-bientot-a-une-nouvelle-frontiere-sur-android</link>
      <pubDate>Fri, 23 Jan 2026 07:15:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2952663_apres-le-succes-de-nano-banana-google-gemini-sattaque-bientot-a-une-nouvelle-frontiere-sur-android</guid>
      <description>
Gemini pourrait bient&#244;t vous aider &#224; cr&#233;er de la musique directement dans son application.
</description>
    </item>
    <item>
      <title>The more I tested the GMKtec NucBox M7 Ultra, the less it looked like it justified its 'Ultra' moniker</title>
      <link>https://www.techradar.com/computing/gmktec-nucbox-m7-ultra-mini-pc-review</link>
      <pubDate>Fri, 23 Jan 2026 07:15:00 +0000</pubDate>
      <guid isPermaLink="false">r5XZTtizT9JMcK6t5T3eTA</guid>
      <description>The GMKtec M7 Ultra is a replacement for earlier M7 designs, but it fails to perform as well</description>
    </item>
    <item>
      <title>Voici les 10 produits Tech pas chers pour se faire plaisir sans se ruiner lors des soldes : la s&#233;lection &#224; moins de 100 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2951205_voici-les-10-produits-tech-pas-chers-pour-se-faire-plaisir-sans-se-ruiner-lors-des-soldes-la-selection-a-moins-de-100-e</link>
      <pubDate>Fri, 23 Jan 2026 07:15:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2951205_voici-les-10-produits-tech-pas-chers-pour-se-faire-plaisir-sans-se-ruiner-lors-des-soldes-la-selection-a-moins-de-100-e</guid>
      <description>
Les soldes d&#8217;hiver entament leur 3e d&#233;marque et m&#234;me avec un budget serr&#233;, il est tout &#224; fait possible de se faire plaisir pendant les soldes. On a d&#233;nich&#233; pour vous une s&#233;lection des meilleures affaires Tech &#224; moins de 100&#8239;&#8364;. De quoi upgrader votre setup sans culpabiliser.
</description>
    </item>
    <item>
      <title>Look BMX et finition cuir : le v&#233;lo &#233;lectrique Marcel se veut coquet et ultra personnalisable</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2951981_look-bmx-et-finition-cuir-le-velo-electrique-marcel-se-veut-coquet-et-ultra-personnalisable</link>
      <pubDate>Fri, 23 Jan 2026 07:14:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2951981_look-bmx-et-finition-cuir-le-velo-electrique-marcel-se-veut-coquet-et-ultra-personnalisable</guid>
      <description>
Pour ses 80 ans, la marque belge Achielle pr&#233;sente un nouveau v&#233;lo &#233;lectrique compact muni de roues de 24 pouces,. Le Marcel, haut en couleurs, pousse tr&#232;s loin le niveau de personnalisation.
</description>
    </item>
    <item>
      <title>Dos-d&#8217;&#226;ne, p&#233;ages, ronds-points&#160;: Waze active enfin ces 5 nouveaut&#233;s</title>
      <link>https://www.01net.com/actualites/dos-dane-peages-ronds-points-waze-active-5-nouveautes.html</link>
      <pubDate>Fri, 23 Jan 2026 07:04:55 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322036</guid>
      <description>Waze s'appr&#234;te enfin &#224; d&#233;ployer une s&#233;rie de fonctionnalit&#233;s qui ont pourtant &#233;t&#233; annonc&#233;es en 2024&#8230; On fait le point.</description>
    </item>
    <item>
      <title>La fermeture de la boutique alternative Setapp ravive la guerre entre la Commission europ&#233;enne et Apple</title>
      <link>https://www.01net.com/actualites/la-fermeture-de-la-boutique-alternative-setapp-ravive-la-guerre-entre-la-commission-europeenne-et-apple.html</link>
      <pubDate>Fri, 23 Jan 2026 07:00:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1322034</guid>
      <description>La fermeture de Setapp, une des premi&#232;res boutiques alternatives lanc&#233;es sur iPhone en Europe, ne passe pas aupr&#232;s de Bruxelles. L'&#233;diteur Macpaw a mis sa d&#233;cision sur le compte de conditions commerciales complexes, sans citer la politique d'Apple&#8230; m&#234;me si c'est ce qu'il faut comprendre entre les lignes. La Commission europ&#233;enne s'appr&#234;terait &#224; taper du poing sur la table mais Apple ne veut rien l&#226;cher....</description>
    </item>
    <item>
      <title>Jamie Dimon wants government to restrict AI layoffs</title>
      <link>https://www.fastcompany.com/91479436/jaime-dimon-wants-government-to-restrict-ai-layoffs</link>
      <pubDate>2026-01-23T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91479436/jaime-dimon-wants-government-to-restrict-ai-layoffs</guid>
      <description>At Davos, the JPMorgan Chase chairman and CEO issued a stark warning about the impact of rapid AI adoption, calling for governments and businesses to &#8216;save society.&#8217;
While speaking at the World Economic Forum in Davos, Switzerland, on January 21, Jamie Dimon, chairman and CEO of JPMorgan Chase, said AI could bring about &#8220;civil unrest&#8221; by destroying jobs, and that businesses and governments need to step in to help.&#160;...</description>
    </item>
    <item>
      <title>Entre Fortnite et Google, une paix &#224; 800 millions de dollars</title>
      <link>https://www.frandroid.com/marques/google/2952651_entre-fortnite-et-google-une-paix-a-800-millions-de-dollars</link>
      <pubDate>Fri, 23 Jan 2026 06:44:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2952651_entre-fortnite-et-google-une-paix-a-800-millions-de-dollars</guid>
      <description>
Ennemi juridique des ann&#233;es durant, Google et Epic Games se sont r&#233;cemment rabiboch&#233;s permettant le retour de Fortnite sur Android. Mais cette tr&#234;ve pourrait surtout &#234;tre une histoire de gros sous.
</description>
    </item>
  </channel>
</rss>
