<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 09 Jan 2026 09:32:58 GMT</lastBuildDate>
    <item>
      <title>Bose refuse de tuer ses vieilles enceintes et r&#233;alise un geste rare</title>
      <link>https://www.01net.com/actualites/bose-refuse-de-tuer-ses-vieilles-enceintes-et-realise-un-geste-rare.html</link>
      <pubDate>Fri, 09 Jan 2026 09:28:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1319008</guid>
      <description>Au lieu de transformer ses anciennes enceintes SoundTouch en d&#233;chets &#233;lectroniques, Bose fait un geste rare. La marque repousse la fin du support &#224; mai 2026 et ouvre sa documentation technique pour que la communaut&#233; puisse prendre le relais.</description>
    </item>
    <item>
      <title>Gigastamping&#160;: c&#8217;est quoi cette nouvelle technique de production qui pourrait rendre les voitures &#233;lectriques encore moins ch&#232;res</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2936423_gigastamping-cest-quoi-cette-nouvelle-technique-de-production-qui-pourrait-rendre-les-voitures-electriques-encore-moins-cheres</link>
      <pubDate>Fri, 09 Jan 2026 09:26:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2936423_gigastamping-cest-quoi-cette-nouvelle-technique-de-production-qui-pourrait-rendre-les-voitures-electriques-encore-moins-cheres</guid>
      <description>
Si Tesla ne jure que par le Gigacasting pour produire ses voitures &#233;lectriques, les marques europ&#233;ennes optent pour une autre m&#233;thode&#160;: le Gigastamping. De quoi s&#8217;agit-il&#160;?
</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : voici les meilleurs deals &#224; saisir en DIRECT chez Amazon, Boulanger, Fnac, Darty&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2931731_soldes-dhiver-2026-voici-les-meilleurs-deals-a-saisir-en-direct-chez-amazon-boulanger-fnac-darty</link>
      <pubDate>Fri, 09 Jan 2026 09:20:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931731_soldes-dhiver-2026-voici-les-meilleurs-deals-a-saisir-en-direct-chez-amazon-boulanger-fnac-darty</guid>
      <description>
Les soldes d'hiver 2026 viennent de d&#233;buter et pour l'occasion Boulanger, Amazon, Fnac, Darty ou encore Cdiscount proposent une foule d'offres int&#233;ressantes. Smartphones, PC portables, t&#233;l&#233;viseurs, tablettes ou encore casques et &#233;couteurs sans fil&#8230; Voici les meilleures offres Tech s&#233;lectionn&#233;es par la r&#233;daction.&#160;
</description>
    </item>
    <item>
      <title>1 000 km en une charge : Volkswagen d&#233;voile un monstre d&#8217;autonomie, qu&#8217;on ne verra pas de sit&#244;t</title>
      <link>https://www.frandroid.com/marques/volkswagen/2936393_1-000-km-en-une-charge-volkswagen-devoile-un-monstre-dautonomie-quon-ne-verra-pas-de-sitot</link>
      <pubDate>Fri, 09 Jan 2026 09:11:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2936393_1-000-km-en-une-charge-volkswagen-devoile-un-monstre-dautonomie-quon-ne-verra-pas-de-sitot</guid>
      <description>
Volkswagen s&#8217;appr&#234;te &#224; lever le voile sur une toute nouvelle voiture &#233;lectrique pouvant parcourir plus de 1 000 kilom&#232;tres en une seule charge. Baptis&#233;e ID. Era 9X, cette derni&#232;re va faire appel &#224; un prolongateur d&#8217;autonomie, mais elle ne devrait pas &#234;tre vendue en Europe.
</description>
    </item>
    <item>
      <title>VPN users under siege in Jammu and Kashmir as authorities issue a 2-month ban &#8211; here's what we know</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/vpn-users-under-siege-in-jammu-and-kashmir-as-authorities-issue-a-2-month-ban-heres-what-we-know</link>
      <pubDate>Fri, 09 Jan 2026 09:06:18 +0000</pubDate>
      <guid isPermaLink="false">96CprQwWCsmKrZBPWU9Jka</guid>
      <description>People in Jammu and Kashmir are being persecuted for using unauthorized VPNs. Authorities said the VPN ban is needed for online security, but digital rights experts are concerned.</description>
    </item>
    <item>
      <title>L&#8217;une des pires fuites de donn&#233;es de 2025&#160;: le pirate &#224; l&#8217;origine de l&#8217;attaque a &#233;t&#233; arr&#234;t&#233; en France</title>
      <link>https://www.01net.com/actualites/pires-fuites-donnees-2025-pirate-origine-attaque-arrete-france.html</link>
      <pubDate>Fri, 09 Jan 2026 09:00:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318996</guid>
      <description>Le piratage de la F&#233;d&#233;ration Fran&#231;aise de Tir s'est accompagn&#233; d'une augmentation des tentatives de vols d'armes &#224; feu en France. Quelques mois apr&#232;s l'incident, la police est parvenue &#224; remonter jusqu'au pirate &#224; l'origine de la fuite de donn&#233;es. Il a interpell&#233; en Seine-Saint-Denis.</description>
    </item>
    <item>
      <title>Nous avons vu le xLean TR1, c&#8217;est &#224; la fois un robot aspirateur laveur et un balai laveur de sols</title>
      <link>https://www.frandroid.com/produits-android/2935255_nous-avons-vu-le-xlean-tr1-cest-a-la-fois-un-robot-aspirateur-laveur-et-un-balai-laveur-de-sols</link>
      <pubDate>Fri, 09 Jan 2026 09:00:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2935255_nous-avons-vu-le-xlean-tr1-cest-a-la-fois-un-robot-aspirateur-laveur-et-un-balai-laveur-de-sols</guid>
      <description>
Le xLean combine un robot aspirateur laveur et un balai laveur de sols en un seul produit, il permet d'attacher un manche au robot pour laver manuellement lorsqu'un accident survient. Un pari audacieux qui veut mettre fin &#224; la cohabitation de deux appareils dans nos foyers.
</description>
    </item>
    <item>
      <title>Anthropic adds Allianz to growing list of enterprise wins</title>
      <link>https://techcrunch.com/2026/01/09/anthropic-adds-allianz-to-growing-list-of-enterprise-wins/</link>
      <pubDate>Fri, 09 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3081328</guid>
      <description>Anthropic announces its first enterprise deal of 2026 which includes building agents and for, and giving Claude code, to Allianz.</description>
    </item>
    <item>
      <title>How to watch PGA Tour 2026: live streams, cheap golf broadcasts, season schedule</title>
      <link>https://www.techradar.com/how-to-watch/golf/pga-tour-2026</link>
      <pubDate>Fri, 09 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">6otjpsQLXxyARmyVfgWE5f</guid>
      <description>All the ways to watch PGA Tour 2026 live streams online from anywhere, with Scottie Scheffler aiming to emulate Rory McIlroy with the career grand slam.</description>
    </item>
    <item>
      <title>Deepfakes drastically improved in 2025. They&#8217;re about to get even harder to detect</title>
      <link>https://www.fastcompany.com/91469337/deepfakes-surge-2026-detection</link>
      <pubDate>2026-01-09T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91469337/deepfakes-surge-2026-detection</guid>
      <description>Looking forward, the trajectory for next year is clear: Deepfakes are moving toward real-time synthesis.
Over the course of 2025, deepfakes improved dramatically. AI-generated faces, voices, and full-body performances that mimic real people increased in quality far beyond what even many experts expected would be the case just a few years ago. They were also increasingly used to deceive people....</description>
    </item>
    <item>
      <title>Fans de Nintendo, c&#8217;est le moment : Donkey Kong Bananza passe sous la barre des 50 &#8364; gr&#226;ce aux soldes</title>
      <link>https://www.frandroid.com/bons-plans/2893687_fans-de-nintendo-cest-le-moment-donkey-kong-bananza-passe-sous-la-barre-des-50-grace-aux-soldes</link>
      <pubDate>Fri, 09 Jan 2026 08:54:45 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2893687_fans-de-nintendo-cest-le-moment-donkey-kong-bananza-passe-sous-la-barre-des-50-grace-aux-soldes</guid>
      <description>
Donkey Kong Bananza, l&#8217;une des exclusivit&#233;s les plus marquantes de la Switch 2, propulse le c&#233;l&#232;bre singe dans une aventure pleine d&#8217;action, de rebondissements et de destruction. Encore plus recommandable en cette p&#233;riode de soldes d&#8217;hiver, le jeu passe d&#233;sormais &#224; 47,16 &#8364; au lieu de 89 &#8364; chez E.Leclerc.
</description>
    </item>
    <item>
      <title>Elle comprend les gestes des pi&#233;tons : la mise &#224; jour folle des SUV &#233;lectriques stars de Xpeng</title>
      <link>https://www.frandroid.com/marques/xpeng/2936333_elle-comprend-les-gestes-des-pietons-la-mise-a-jour-folle-des-suv-electriques-stars-de-xpeng</link>
      <pubDate>Fri, 09 Jan 2026 08:54:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xpeng/2936333_elle-comprend-les-gestes-des-pietons-la-mise-a-jour-folle-des-suv-electriques-stars-de-xpeng</guid>
      <description>
R&#233;cemment restyl&#233;s, les Xpeng G6 et G9 s&#8217;offrent encore quelques fonctionnalit&#233;s suppl&#233;mentaires en Chine... qui pourraient par la suite faire leur arriv&#233;e sur les deux voitures &#233;lectriques en Europe.
</description>
    </item>
    <item>
      <title>Apple teste l&#8217;installation de mises &#224; jour de s&#233;curit&#233; en arri&#232;re-plan, sans red&#233;marrage</title>
      <link>https://www.01net.com/actualites/apple-teste-linstallation-de-mises-a-jour-de-securite-en-arriere-plan-sans-redemarrage.html</link>
      <pubDate>Fri, 09 Jan 2026 08:31:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318976</guid>
      <description>Apple ne l&#226;che pas l'affaire. La fonction qui installe des mises &#224; jour de s&#233;curit&#233; en arri&#232;re-plan (donc sans red&#233;marrage obligatoire) est de nouveau test&#233;e avec iOS 26.3. Avant un d&#233;ploiement pour le grand public ? Cette fonctionnalit&#233; est cens&#233;e exister depuis 2022, mais elle n'a jamais vraiment &#233;t&#233; exploit&#233;e.</description>
    </item>
    <item>
      <title>1 km d&#8217;autonomie en plus : face &#224; Tesla et Mercedes, la nouvelle Peugeot 408 &#233;lectrique d&#233;&#231;oit-elle d&#233;j&#224; ?</title>
      <link>https://www.frandroid.com/marques/peugeot/2929199_1-km-dautonomie-en-plus-face-a-tesla-et-mercedes-la-nouvelle-peugeot-408-electrique-decoit-elle-deja</link>
      <pubDate>Fri, 09 Jan 2026 08:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/peugeot/2929199_1-km-dautonomie-en-plus-face-a-tesla-et-mercedes-la-nouvelle-peugeot-408-electrique-decoit-elle-deja</guid>
      <description>
La Peugeot 408 profite de ce d&#233;but d'ann&#233;e 2026 pour se refaire une beaut&#233;, avec une face avant qui reprend l'air de la 308. La version 100 % &#233;lectrique de cette berline sur&#233;lev&#233;e n'&#233;volue qu'&#224; la marge. Suffisant pour rattraper les voitures &#233;lectriques concurrentes, comme la Tesla Model 3 ou la Mercedes-Benz CLA ?
</description>
    </item>
    <item>
      <title>CES 2026 live updates: See the latest news, surprises, and strange tech from LG, Samsung, and new startups</title>
      <link>https://mashable.com/live/ces-2026-news-live-blog-updates</link>
      <pubDate>Fri, 09 Jan 2026 08:26:39 +0000</pubDate>
      <guid isPermaLink="false">03weFCUbfFvR5jPHEa0V0Ce</guid>
      <description>CES 2026 is finally here, and Mashable reporters are on the ground looking for the best in show. Get live updates from the showroom floor and behind the scenes.</description>
    </item>
    <item>
      <title>Orange bloque les mises &#224; jour des smartphones Xiaomi : la col&#232;re des abonn&#233;s monte</title>
      <link>https://www.frandroid.com/marques/xiaomi/2936431_orange-bloque-les-mises-a-jour-des-smartphones-xiaomi-la-colere-des-abonnes-monte</link>
      <pubDate>Fri, 09 Jan 2026 08:23:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/xiaomi/2936431_orange-bloque-les-mises-a-jour-des-smartphones-xiaomi-la-colere-des-abonnes-monte</guid>
      <description>
On pensait cette pratique enterr&#233;e avec les ann&#233;es 2010. Pourtant, Orange continue de modifier le logiciel des smartphones qu'il vend, au d&#233;triment de ses clients. Le cas du Xiaomi 15 est &#233;difiant : mises &#224; jour bloqu&#233;es, s&#233;curit&#233; obsol&#232;te et fonctionnalit&#233;s en panne. 
</description>
    </item>
    <item>
      <title>Trois c&#226;bles sous-marins ont &#233;t&#233; sabot&#233;s l&#8217;un apr&#232;s l&#8217;autre en Europe&#160;: l&#8217;enqu&#234;te se poursuit</title>
      <link>https://www.01net.com/actualites/trois-cables-sous-marins-ete-sabotes-un-apres-autre-europe.html</link>
      <pubDate>Fri, 09 Jan 2026 08:02:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318514</guid>
      <description>En quelques jours, trois c&#226;bles sous-marins ont &#233;t&#233; sectionn&#233;s en mer Baltique. Deux navires ont &#233;t&#233; identifi&#233;s comme &#233;tant potentiellement &#224; l'origine des incidents, dont un cargo charg&#233; d'acier russe. Les autorit&#233;s redoutent une op&#233;ration de sabotage en provenance de la Russie.</description>
    </item>
    <item>
      <title>Au CES&#160;2026, Ikea d&#233;voile une enceinte &#224; 5&#160;euros et 21&#160;objets de domotique pas chers compatibles avec Matter</title>
      <link>https://www.01net.com/actualites/au-ces-2026-ikea-devoile-une-enceinte-a-5-euros-et-21-objets-de-domotique-pas-chers-compatibles-avec-matter.html</link>
      <pubDate>Fri, 09 Jan 2026 08:00:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318951</guid>
      <description>Au CES&#8239;2026, Ikea confirme son virage tech avec des objets connect&#233;s compatibles Matter et la Kallsup, mini-enceinte &#224; 5&#8239;euros capable de se synchroniser avec une centaine d&#8217;autres.</description>
    </item>
    <item>
      <title>The Oceans Just Keep Getting Hotter</title>
      <link>https://www.wired.com/story/the-oceans-just-keep-getting-hotter/</link>
      <pubDate>Fri, 09 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">695be13491572e7a8a7d2adf</guid>
      <description>For the eighth year in a row, the world&#8217;s oceans absorbed a record-breaking amount of heat in 2025. It was equivalent to the energy it would take to boil 2 billion Olympic swimming pools.</description>
    </item>
    <item>
      <title>Apr&#232;s la Topolino, voici le Fiat Tris : une voiture &#233;lectrique sans permis ultra pratique mais qui snobe la France</title>
      <link>https://www.frandroid.com/marques/fiat/2933569_apres-la-topolino-voici-le-fiat-tris-une-voiture-electrique-sans-permis-ultra-pratique-mais-qui-snobe-la-france</link>
      <pubDate>Fri, 09 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/fiat/2933569_apres-la-topolino-voici-le-fiat-tris-une-voiture-electrique-sans-permis-ultra-pratique-mais-qui-snobe-la-france</guid>
      <description>
Apr&#232;s une pr&#233;sentation en 2025, le Fiat Tris arrive enfin en Europe. Ce tricycle &#233;lectrique se positionne dans le segment de la livraison en ville avec des caract&#233;ristiques int&#233;ressantes, mais la France n'est pas (encore) dans la liste des march&#233;s retenus.
</description>
    </item>
    <item>
      <title>Apple Watch : pourquoi Free a d&#251; &#171;&#160;sacrifier&#160;&#187; la 5G pour lancer son offre</title>
      <link>https://www.frandroid.com/marques/free/2936385_apple-watch-pourquoi-free-a-du-sacrifier-la-5g-pour-lancer-son-offre</link>
      <pubDate>Fri, 09 Jan 2026 08:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2936385_apple-watch-pourquoi-free-a-du-sacrifier-la-5g-pour-lancer-son-offre</guid>
      <description>
"C'est extr&#234;mement compliqu&#233;." Quand on demande &#224; la direction r&#233;seau de Free pourquoi les montres Samsung ou Pixel ne sont pas encore support&#233;es, ou pourquoi l'Apple Watch n'a pas la 5G, la r&#233;ponse fusent. Pascal Mayeux nous ouvre le capot des n&#233;gociations avec les constructeurs pour ces petits objets connect&#233;s.
</description>
    </item>
    <item>
      <title>En lib&#233;rant le code de ses enceintes, Bose prouve que l&#8217;abandon logiciel n&#8217;est pas une fatalit&#233;</title>
      <link>https://www.frandroid.com/marques/bose/2936403_en-liberant-le-code-de-ses-enceintes-bose-prouve-que-labandon-logiciel-nest-pas-une-fatalite</link>
      <pubDate>Fri, 09 Jan 2026 07:52:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bose/2936403_en-liberant-le-code-de-ses-enceintes-bose-prouve-que-labandon-logiciel-nest-pas-une-fatalite</guid>
      <description>
Alors que les enceintes Bose SoundTouch devaient perdre leurs fonctionnalit&#233;s &#171; intelligentes &#187; le 18&#160;f&#233;vrier prochain, Bose fait marche arri&#232;re et offre &#224; ses clients un acc&#232;s in&#233;dit au c&#339;ur de son syst&#232;me pour garder ses appareils en ligne.
</description>
    </item>
    <item>
      <title>900 km d&#8217;autonomie &#224; moins de 30 000 &#8364; : l&#8217;&#233;trange recette de ce SUV chinois de Stellantis vendu en France</title>
      <link>https://www.frandroid.com/marques/leapmotor/2935277_900-km-dautonomie-a-moins-de-30-000-e-letrange-recette-de-ce-suv-chinois-de-stellantis-vendu-en-france</link>
      <pubDate>Fri, 09 Jan 2026 07:43:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/leapmotor/2935277_900-km-dautonomie-a-moins-de-30-000-e-letrange-recette-de-ce-suv-chinois-de-stellantis-vendu-en-france</guid>
      <description>
Le constructeur chinois Leapmotor enrichit sa gamme europ&#233;enne avec le B10 New e-Hybrid, une voiture &#233;lectrique &#224; prolongateur d'autonomie. Propos&#233; &#224; partir de 29 900 euros, ce SUV compact mise sur un petit moteur essence pour afficher 900 km d'autonomie et s&#233;duire les automobilistes encore r&#233;ticents au tout-&#233;lectrique.
</description>
    </item>
    <item>
      <title>Renault et Peugeot dans le viseur : la Leapmotor B05 arrive en Europe avec des arguments massifs</title>
      <link>https://www.frandroid.com/marques/leapmotor/2935095_renault-et-peugeot-dans-le-viseur-la-leapmotor-b05-arrive-en-europe-avec-des-arguments-massifs</link>
      <pubDate>Fri, 09 Jan 2026 07:39:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/leapmotor/2935095_renault-et-peugeot-dans-le-viseur-la-leapmotor-b05-arrive-en-europe-avec-des-arguments-massifs</guid>
      <description>
Apr&#232;s son lancement en Chine, la Leapmotor B05 arrive en Europe. De quoi d&#233;couvrir la puissance et l'autonomie de cette voiture &#233;lectrique chinoise, qui sera vendue dans le r&#233;seau Stellantis face aux Renault M&#233;gane et Peugeot 308.
</description>
    </item>
    <item>
      <title>J&#8217;ai jou&#233; aux LEGO avec la Smart Brick : les possibilit&#233;s sont infinies, le coup de c&#339;ur est &#233;norme</title>
      <link>https://www.frandroid.com/events/ces/2936269_jai-joue-aux-lego-avec-la-smart-brick-les-possibilites-sont-infinies-le-coup-de-coeur-est-enorme</link>
      <pubDate>Fri, 09 Jan 2026 07:37:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/events/ces/2936269_jai-joue-aux-lego-avec-la-smart-brick-les-possibilites-sont-infinies-le-coup-de-coeur-est-enorme</guid>
      <description>
J'ai jou&#233; avec la LEGO Smart Brick et les sets Star Wars compatibles. Un plaisir simple, une belle id&#233;e et un coup de c&#339;ur &#233;norme. Retour d'exp&#233;rience.
</description>
    </item>
    <item>
      <title>EE drops 150Mbps Full Fibre broadband down to &#163;27.99 per month in its new year sale</title>
      <link>https://www.techradar.com/computing/wi-fi-broadband/ee-drops-150mbps-full-fibre-broadband-down-to-gbp27-99-per-month-in-its-new-year-sale</link>
      <pubDate>Fri, 09 Jan 2026 07:35:00 +0000</pubDate>
      <guid isPermaLink="false">RXW6cA9Aj7bg8ZtXHYjoEU</guid>
      <description>You can now get 150Mbps Full Fibre down to its lowest price of &#163;27.99 per month at EE, plus a handful of other perks for switching.</description>
    </item>
  </channel>
</rss>
