<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 31 Jan 2026 10:30:19 GMT</lastBuildDate>
    <item>
      <title>ICYMI: the week's 7 biggest tech news stories from Samsung teasing a major S26 upgrade to Garmin's leaked Whoop clone</title>
      <link>https://www.techradar.com/tech/icymi-the-weeks-7-biggest-tech-news-stories-from-samsung-teasing-a-major-s26-upgrade-to-garmins-leaked-whoop-clone</link>
      <pubDate>Sat, 31 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">AqmSJYsGUnByMWfn9meAiY</guid>
      <description>Here are the biggest tech news stories from Whoop, Netflix, Samsung, OpenAI, and more for January 31, 2026.</description>
    </item>
    <item>
      <title>This smart service saves memorable podcast moments in your inbox</title>
      <link>https://www.fastcompany.com/91480435/this-smart-service-saves-memorable-podcast-moments-in-your-inbox</link>
      <pubDate>2026-01-31T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91480435/this-smart-service-saves-memorable-podcast-moments-in-your-inbox</guid>
      <description>Once you see how helpful this podcast-playing companion can be, you&#8217;ll never want to listen to audio without it.
Listen, I don&#8217;t know about you, but I&#8217;m generally not so big on listening. I tend to be more of a &#8220;words in front of my eyes&#8221; kind of guy when it comes to taking in information (which, as I&#8217;ve come to learn, also means I&#8217;m &#8220;an old person&#8221; by modern-day standards&#8212;hey, I&#8217;m okay with that)....</description>
    </item>
    <item>
      <title>TikTok&#8217;s odd behavior was caused by a tech issue&#8212;but users&#8217; response indicates the app has a trust problem</title>
      <link>https://www.fastcompany.com/91483820/tiktoks-odd-behavior-was-caused-by-a-tech-issue-but-users-response-indicates-the-app-has-a-trust-problem</link>
      <pubDate>2026-01-31T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91483820/tiktoks-odd-behavior-was-caused-by-a-tech-issue-but-users-response-indicates-the-app-has-a-trust-problem</guid>
      <description>Simple, if embarrassing, infrastructure issues can snowball into conspiracies about how Donald Trump is trying to tame the app. Welcome to the new world of TikTok.
Anyone wanting to get their TikTok fix in the United States recently had a rough time. The app went haywire, kicking off early on the morning of January 25, due to a power outage at a key data center that knocked out services nationwide. Users reported the app crashing, with videos getting stuck and refusing to play, upload, or even hit a single view....</description>
    </item>
    <item>
      <title>Volkswagen ID. Polo : de la version &#224; 25 000 &#8364; &#224; la puissance de la GTI, tout ce que l&#8217;on sait sur la gamme 2026</title>
      <link>https://www.frandroid.com/marques/volkswagen/2962121_volkswagen-id-polo-de-la-version-a-25-000-e-a-la-puissance-de-la-gti-tout-ce-que-lon-sait-sur-la-gamme-2026</link>
      <pubDate>Sat, 31 Jan 2026 09:38:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volkswagen/2962121_volkswagen-id-polo-de-la-version-a-25-000-e-a-la-puissance-de-la-gti-tout-ce-que-lon-sait-sur-la-gamme-2026</guid>
      <description>
Volkswagen vient de mettre en ligne la liste des finitions de l'ID. Polo &#233;lectrique, ainsi que son prix officiel de d&#233;part : moins de 25 000 euros. De la version Trend &#224; la version GTi, voici tous les d&#233;tails techniques connus actuellement.
</description>
    </item>
    <item>
      <title>Pourquoi l&#8217;IA Genie de Google provoque un krach boursier absurde dans le jeu vid&#233;o</title>
      <link>https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2962105_pourquoi-lia-genie-de-google-provoque-un-krach-boursier-absurde-dans-le-jeu-video</link>
      <pubDate>Sat, 31 Jan 2026 09:02:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/intelligence-artificielle/google-gemini/2962105_pourquoi-lia-genie-de-google-provoque-un-krach-boursier-absurde-dans-le-jeu-video</guid>
      <description>
Google vient de sortir Genie 3, une IA capable de g&#233;n&#233;rer des environnements 3D "jouables". &#192; peine d&#233;voil&#233;e, elle a r&#233;ussi deux exploits : faire chuter l'action Unity de 20 % et &#233;nerver les juristes de chez Nintendo.
</description>
    </item>
    <item>
      <title>Les meilleurs claviers PC : notre s&#233;lection pour la bureautique en 2026</title>
      <link>https://www.frandroid.com/guide-dachat/708478_quels-sont-les-meilleurs-claviers-pour-la-bureautique</link>
      <pubDate>Sat, 31 Jan 2026 09:02:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/708478_quels-sont-les-meilleurs-claviers-pour-la-bureautique</guid>
      <description>
Avoir un bon clavier d'ordinateur est essentiel pour travailler dans de bonnes conditions. Vous trouverez ici notre s&#233;lection des meilleurs claviers PC d&#233;di&#233;s &#224; la bureautique, pour tous les budgets.
</description>
    </item>
    <item>
      <title>3 best Netflix action movies to stream in one suspenseful weekend</title>
      <link>https://www.techradar.com/streaming/netflix/3-best-netflix-action-movies-to-stream-in-one-suspenseful-weekend</link>
      <pubDate>Sat, 31 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">EvakwuBLpffhfukzD2aYER</guid>
      <description>Here's our pick of the best Netflix action films for a breathless weekend binge watch.</description>
    </item>
    <item>
      <title>The eye-popping price of Harry Styles tickets has social media users furious</title>
      <link>https://www.fastcompany.com/91483789/the-eye-popping-price-of-harry-styles-tickets-has-social-media-users-furious</link>
      <pubDate>2026-01-31T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91483789/the-eye-popping-price-of-harry-styles-tickets-has-social-media-users-furious</guid>
      <description>&#8220;$1,000 for lower bowl at MSG is genuinely the most insulting thing I&#8217;ve ever seen. That&#8217;s one month&#8217;s rent.&#8221;
More than 11.5 million fans signed up for presale tickets to Harry Styles&#8217;s upcoming Madison Square Garden residency for the Together, Together tour.&#160;</description>
    </item>
    <item>
      <title>Chaussures &#224; plaque carbone&#160;: est-ce la fin de la r&#233;volution technologique dans la course-&#224;-pied&#160;?</title>
      <link>https://www.01net.com/actualites/chaussures-a-plaque-carbone-est-ce-la-fin-de-la-revolution-technologique-dans-la-course-a-pied.html</link>
      <pubDate>Sat, 31 Jan 2026 08:47:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323258</guid>
      <description>Ce sont les chaussures de sport les plus techno du moment. Les carbon shoes ou chaussures dot&#233;es de plaques en carbone ont chamboul&#233; la course &#224; pied autant qu&#8217;elles ont fait baisser les records. 10 ans apr&#232;s leur commercialisation, est-on arriv&#233; au bout de cette r&#233;volution ?</description>
    </item>
    <item>
      <title>France Identit&#233; : voici une solution propre pour prouver son &#226;ge sans donner son nom ni son &#226;ge exact</title>
      <link>https://www.frandroid.com/culture-tech/web/2962099_france-identite-voici-une-solution-propre-pour-prouver-son-age-sans-donner-son-nom-ni-son-age-exact</link>
      <pubDate>Sat, 31 Jan 2026 08:45:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/web/2962099_france-identite-voici-une-solution-propre-pour-prouver-son-age-sans-donner-son-nom-ni-son-age-exact</guid>
      <description>
L'application France Identit&#233; teste actuellement une fonction pour prouver votre majorit&#233; sans r&#233;v&#233;ler ni votre nom, ni votre date de naissance. C'est l'application concr&#232;te du double anonymat, et c'est peut-&#234;tre la seule option viable pour s&#233;curiser le web fran&#231;ais.
</description>
    </item>
    <item>
      <title>Ce v&#233;lo de route &#233;lectrique ultra l&#233;ger avec plus de 100 km d&#8217;autonomie perd 1 200 &#8364; chez Decathlon, une affaire en or</title>
      <link>https://www.frandroid.com/bons-plans/2960377_ce-velo-de-route-electrique-ultra-leger-avec-plus-de-100-km-dautonomie-perd-1-200-e-chez-decathlon-une-affaire-en-or</link>
      <pubDate>Sat, 31 Jan 2026 08:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2960377_ce-velo-de-route-electrique-ultra-leger-avec-plus-de-100-km-dautonomie-perd-1-200-e-chez-decathlon-une-affaire-en-or</guid>
      <description>
Si vous cherchez un v&#233;lo de route &#233;lectrique, le Van Rysel E-EDR AF chute &#224; 1 599 euros contre 2 799 euros de base chez Decathlon. Une belle offre sur un v&#233;lo aussi l&#233;ger, capable d&#8217;atteindre plus de 100 km d&#8217;autonomie selon l&#8217;usage.
</description>
    </item>
  </channel>
</rss>
