<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 08 Jan 2026 09:33:09 GMT</lastBuildDate>
    <item>
      <title>Un v&#233;lo pliant &#224; 1 200 &#8364; pour le prix d&#8217;un abonnement Netflix : le tr&#232;s gros coup de V&#233;ligo</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2934749_un-velo-pliant-a-1-200-e-pour-le-prix-dun-abonnement-netflix-le-tres-gros-coup-de-veligo</link>
      <pubDate>Thu, 08 Jan 2026 09:31:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2934749_un-velo-pliant-a-1-200-e-pour-le-prix-dun-abonnement-netflix-le-tres-gros-coup-de-veligo</guid>
      <description>
Le service de location de v&#233;los V&#233;ligo poursuit l&#8217;&#233;largissement de son catalogue avec l&#8217;arriv&#233;e d&#8217;un mod&#232;le pliant de Brompton. Ce v&#233;lo m&#233;canique, propos&#233; en location &#224; partir de 22 euros par mois, compl&#232;te une offre o&#249; le v&#233;lo pliant manquait justement.
</description>
    </item>
    <item>
      <title>Volvo EX60 : 810 km d&#8217;autonomie et recharge ultra-rapide pour le nouveau SUV &#233;lectrique</title>
      <link>https://www.frandroid.com/marques/volvo/2934547_volvo-ex60-810-km-dautonomie-et-recharge-ultra-rapide-pour-le-nouveau-suv-electrique</link>
      <pubDate>Thu, 08 Jan 2026 09:29:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/volvo/2934547_volvo-ex60-810-km-dautonomie-et-recharge-ultra-rapide-pour-le-nouveau-suv-electrique</guid>
      <description>
&#192; quelques semaines de sa r&#233;v&#233;lation, le Volvo EX60 d&#233;voile de nouveaux d&#233;tails &#224; son sujet. La voiture &#233;lectrique su&#233;doise promet notamment une autonomie g&#233;n&#233;reuse de 810 km, d&#233;passant donc le BMW iX3, tout en promettant une recharge ultra-rapide.
</description>
    </item>
    <item>
      <title>Roblox impose la reconnaissance faciale : voici comment le jeu va d&#233;sormais filtrer ses joueurs</title>
      <link>https://www.frandroid.com/produits-android/console/2934511_roblox-impose-la-reconnaissance-faciale-voici-comment-le-jeu-va-desormais-filtrer-ses-joueurs</link>
      <pubDate>Thu, 08 Jan 2026 09:14:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/console/2934511_roblox-impose-la-reconnaissance-faciale-voici-comment-le-jeu-va-desormais-filtrer-ses-joueurs</guid>
      <description>
Roblox veut prot&#233;ger ses jeunes joueurs des mauvaises rencontres en mettant en place un syst&#232;me de reconnaissance faciale pour les orienter vers des personnes de leur &#226;ge.
</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : les premi&#232;res offres sont en ligne, voici les meilleurs deals &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2931731_top-depart-soldes-dhiver-2026-les-meilleures-offres-en-direct</link>
      <pubDate>Thu, 08 Jan 2026 09:11:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931731_top-depart-soldes-dhiver-2026-les-meilleures-offres-en-direct</guid>
      <description>
Apr&#232;s les f&#234;tes, la nouvelle ann&#233;e s'est install&#233;e en introduisant avec elle les soldes d'hiver ! Cette &#233;dition promet de belles affaires &#224; ne pas manquer pour s&#8217;&#233;quiper &#224; petit prix avant la hausse annonc&#233;e en 2026. Comptez sur Frandroid pour vous relayer uniquement les meilleures offres.
</description>
    </item>
    <item>
      <title>Nvidia : on a d&#233;j&#224; une petite id&#233;e de la date de sortie des RTX 60</title>
      <link>https://www.frandroid.com/marques/nvidia/2934599_nvidia-on-a-deja-une-petite-idee-de-la-date-de-sortie-des-rtx-60</link>
      <pubDate>Thu, 08 Jan 2026 09:11:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nvidia/2934599_nvidia-on-a-deja-une-petite-idee-de-la-date-de-sortie-des-rtx-60</guid>
      <description>
Une fuite &#233;voque pour la premi&#232;re fois une p&#233;riode de lancement pour les prochaines cartes graphiques de Nvidia, les GeForce RTX 60, qui seront bas&#233;es sur l'architecture Rubin.
</description>
    </item>
    <item>
      <title>&#171;&#160;Les voitures &#233;lectriques perdent 50&#160;% d&#8217;autonomie en hiver&#160;&#187;&#160;: pourquoi ce n&#8217;est pas (vraiment) le cas</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2934493_les-voitures-electriques-perdent-50-dautonomie-en-hiver-pourquoi-ce-nest-pas-vraiment-le-cas</link>
      <pubDate>Thu, 08 Jan 2026 09:03:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2934493_les-voitures-electriques-perdent-50-dautonomie-en-hiver-pourquoi-ce-nest-pas-vraiment-le-cas</guid>
      <description>
Selon Le Figaro, les voitures &#233;lectriques peuvent voir leur autonomie fondre de 30 &#224; 50&#160;% lorsqu&#8217;il fait froid. Info ou intox&#160;? La r&#233;ponse dans notre article ci-dessous avec des chiffres en conditions r&#233;elles.
</description>
    </item>
    <item>
      <title>&#171; De la zinzinerie &#224; l&#8217;&#233;tat pur &#187; : on a vu les PC d&#233;roulants de Lenovo</title>
      <link>https://www.frandroid.com/marques/lenovo/2934635_de-la-zinzinerie-a-letat-pur-on-a-vu-les-pc-deroulants-de-lenovo</link>
      <pubDate>Thu, 08 Jan 2026 09:01:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lenovo/2934635_de-la-zinzinerie-a-letat-pur-on-a-vu-les-pc-deroulants-de-lenovo</guid>
      <description>
Lenovo est au CES 2026. Arnaud est sur place &#224; Las Vegas et a mis la main sur des concepts d&#233;lirants : des &#233;crans qui s'enroulent, qui vous suivent du regard et m&#234;me un ch&#226;ssis enti&#232;rement magn&#233;tique. 
</description>
    </item>
    <item>
      <title>New Paramount+ series Girl Taken will rip your heart out &#8212; but its cast think this classic comedy is the perfect way to decompress after</title>
      <link>https://www.techradar.com/streaming/paramount-plus/new-paramount-series-girl-taken-will-rip-your-heart-out-but-its-cast-think-this-classic-comedy-is-the-perfect-way-to-decompress-after</link>
      <pubDate>Thu, 08 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">EwChTTxnv7haUJM69NJAyU</guid>
      <description>Kicking 2026 off in the darkest tone possible, Girl Taken is this week's new chilling crime drama on Paramount+. In fact, it's so chilling, you should stream this classic comedy straight after.</description>
    </item>
    <item>
      <title>How to watch The Traitors US Season 4 &#8212; Free Streams From Anywhere</title>
      <link>https://www.techradar.com/how-to-watch/tv-shows/the-traitors-us-season-4-free</link>
      <pubDate>Thu, 08 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">LVeY75qvvYvKkQ8kxdoQD4</guid>
      <description>Donna Kelce, Dorinda Medley and Tiffany Mitchell are amongst those being hosted by Alan Cumming at Ardross Castle. Here's how to watch The Traitors US season 4 online.</description>
    </item>
    <item>
      <title>How to work with challenging personalities (and avoid being one of them)</title>
      <link>https://www.fastcompany.com/91468685/working-with-challenging-personalities</link>
      <pubDate>2026-01-08T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91468685/working-with-challenging-personalities</guid>
      <description>Five science-backed strategies for getting along with anyone.
Oscar Wilde famously noted, &#8220;Some cause happiness wherever they go; others, whenever they go.&#8221; It is arguably one of the best brief illustrations of emotional intelligence (EQ), a trait that became popular thanks to a nonacademic best-selling book by journalist Daniel Goleman, in which he insinuated that EQ is a more important driver of success than IQ (a claim that has been discredited)....</description>
    </item>
    <item>
      <title>Realme perd son ind&#233;pendance&#160;: pourquoi Oppo reprend le contr&#244;le total en 2026</title>
      <link>https://www.01net.com/actualites/realme-perd-son-independance-pourquoi-oppo-reprend-le-controle-total-en-2026.html</link>
      <pubDate>Thu, 08 Jan 2026 08:58:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318765</guid>
      <description>C'est officiel : Realme n'est plus une marque autonome. Le constructeur chinois devient une simple division d'Oppo, dont l'objectif est de mutualiser les co&#251;ts et gonfler ses rangs.</description>
    </item>
    <item>
      <title>NYT Pips hints, answers for January 8, 2026</title>
      <link>https://mashable.com/article/pips-nyt-games-hints-answers-easy-medium-hard-january-8-2026</link>
      <pubDate>Thu, 08 Jan 2026 08:58:38 +0000</pubDate>
      <guid isPermaLink="false">03uSru2wCPD35Uqm4gd340C</guid>
      <description>The New York Times' latest game, Pips, brings domino fun to your desktop. How to play Pips as well as hints in case you get stuck.</description>
    </item>
    <item>
      <title>Le &#171;&#160;miracle&#160;&#187; Tesla prend fin brutalement en Europe : la France (-37 %) et la Belgique (-53 %) sanctionnent lourdement Elon Musk</title>
      <link>https://www.frandroid.com/marques/tesla/2934587_le-miracle-tesla-prend-fin-brutalement-en-europe-la-france-37-et-la-belgique-53-sanctionnent-lourdement-elon-musk</link>
      <pubDate>Thu, 08 Jan 2026 08:49:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2934587_le-miracle-tesla-prend-fin-brutalement-en-europe-la-france-37-et-la-belgique-53-sanctionnent-lourdement-elon-musk</guid>
      <description>
Les chiffres sont tomb&#233;s et c'est une boucherie. Apr&#232;s des ann&#233;es de croissance insolente, Tesla vient de se prendre un mur en Europe : -27,8 % de ventes en un an. L'Allemagne et la France d&#233;vissent, et Elon Musk semble vivre dans une r&#233;alit&#233; parall&#232;le.
</description>
    </item>
    <item>
      <title>Meet the tiny AI hologram ready to be your esports coach and life planner</title>
      <link>https://www.techradar.com/ai-platforms-assistants/meet-the-tiny-ai-hologram-ready-to-be-your-esports-coach-and-life-planner</link>
      <pubDate>Thu, 08 Jan 2026 08:42:32 +0000</pubDate>
      <guid isPermaLink="false">tg6hwpjM63TjAvxoDRdQqN</guid>
      <description>Razer&#8217;s Project AVA provides AI assistance in the form of an animated desktop hologram.</description>
    </item>
    <item>
      <title>CES 2026 live updates: See the latest news, surprises, and strange tech from LG, Samsung, Lego, and new startups</title>
      <link>https://mashable.com/live/ces-2026-news-live-updates</link>
      <pubDate>Thu, 08 Jan 2026 08:41:02 +0000</pubDate>
      <guid isPermaLink="false">00HdPGMgSorg1E6HI6usOJ2</guid>
      <description>CES 2026 is finally here, and Mashable reporters are on the ground looking for the best in show. Get live updates from the showroom floor and behind the scenes.</description>
    </item>
    <item>
      <title>&#171;&#8201;Personne ne pourra y &#233;chapper&#8201;&#187;&#160;: le patron de Lenovo est (trop&#8201;?) optimiste sur l&#8217;avenir de l&#8217;IA</title>
      <link>https://www.frandroid.com/marques/lenovo/2934537_personne-ne-pourra-y-echapper-le-patron-de-lenovo-est-trop-optimiste-sur-lavenir-de-lia</link>
      <pubDate>Thu, 08 Jan 2026 08:39:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lenovo/2934537_personne-ne-pourra-y-echapper-le-patron-de-lenovo-est-trop-optimiste-sur-lavenir-de-lia</guid>
      <description>
Sans surprise, le CES 2026 a &#233;t&#233; domin&#233; par les gadgets dop&#233;s &#224; l&#8217;intelligence artificielle g&#233;n&#233;rative. Mais la d&#233;bauche de nouveaut&#233;s sur le secteur est parfaitement assum&#233;e par le patron de Lenovo, entre autres.
</description>
    </item>
    <item>
      <title>A24s undertone trailer teases a podcast turning into a nightmare</title>
      <link>https://mashable.com/video/a24-undertone-trailer</link>
      <pubDate>Thu, 08 Jan 2026 08:37:52 +0000</pubDate>
      <guid isPermaLink="false">04GSrgYtAX12ANr5kq8pFQr</guid>
      <description>A24 has released its trailer for "undertone" a horror about a paranormal podcast host who falls victim to a creepy audio recording.</description>
    </item>
    <item>
      <title>J&#8217;ai vu un robot aspirateur voler pour aller d&#8217;un &#233;tage &#224; l&#8217;autre</title>
      <link>https://www.frandroid.com/marques/2932115_jai-vu-un-robot-aspirateur-voler-pour-aller-dun-etage-a-lautre</link>
      <pubDate>Thu, 08 Jan 2026 08:37:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2932115_jai-vu-un-robot-aspirateur-voler-pour-aller-dun-etage-a-lautre</guid>
      <description>
Les fabricants de robots aspirateurs rivalisent d'innovation pour faire d&#233;placer les robots d'&#233;tage en &#233;tage. Apr&#232;s la pr&#233;sentation de prototypes capables de monter les escaliers &#224; l'IFA en septembre, Mova vient de pr&#233;senter un aspirateur qui vole pour se d&#233;placer.
</description>
    </item>
    <item>
      <title>Une vague de cyberattaques s&#8217;abat sur ces routeurs D-Link obsol&#232;tes</title>
      <link>https://www.01net.com/actualites/vague-cyberattaques-abat-routeurs-d-link-obsoletes.html</link>
      <pubDate>Thu, 08 Jan 2026 08:30:53 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318758</guid>
      <description>Une faille critique permet de prendre le contr&#244;le &#224; distance d&#8217;anciens routeurs D&#8209;Link. Priv&#233;s de mises &#224; jour depuis plus de cinq ans, ils sont vuln&#233;rables aux cyberattaques. Pour &#233;viter les risques, D-Link recommande de changer de routeur.</description>
    </item>
    <item>
      <title>F2 Pro E : l&#8217;ancienne star des trottinettes milieu de gamme de Segway-Ninebot est sold&#233;e &#224; moins de 400 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2933337_f2-pro-e-lancienne-star-des-trottinettes-milieu-de-gamme-de-segway-ninebot-est-soldee-a-moins-de-400-e</link>
      <pubDate>Thu, 08 Jan 2026 08:12:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2933337_f2-pro-e-lancienne-star-des-trottinettes-milieu-de-gamme-de-segway-ninebot-est-soldee-a-moins-de-400-e</guid>
      <description>
Id&#233;ale pour les trajets en ville, la Ninebot KickScooter F2 Pro E est une trottinette &#233;lectrique puissante, confortable et rassurante. Elle a beau avoir &#233;t&#233; d&#233;pass&#233;e par sa successeure, la F3 Pro E, elle reste tout de m&#234;me recommandable, surtout quand son prix passe de 449,99 euros &#224; 359,99 euros chez Boulanger, comme pendant ces soldes d'hiver 2026. 
...</description>
    </item>
    <item>
      <title>Grosse panne chez Logitech : pourquoi vos p&#233;riph&#233;riques Mac plantent et comment r&#233;gler le probl&#232;me</title>
      <link>https://www.frandroid.com/marques/logitech/2934135_grosse-panne-chez-logitech-pourquoi-vos-peripheriques-mac-plantent-et-comment-regler-le-probleme</link>
      <pubDate>Thu, 08 Jan 2026 08:03:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/logitech/2934135_grosse-panne-chez-logitech-pourquoi-vos-peripheriques-mac-plantent-et-comment-regler-le-probleme</guid>
      <description>
Depuis hier, les utilisateurs de p&#233;riph&#233;riques Logitech sur macOS font face &#224; un blocage complet des logiciels de configuration de la marque. Une mise &#224; jour corrective vient d'&#234;tre d&#233;ploy&#233;e pour r&#233;tablir la connexion avec vos souris et claviers.
</description>
    </item>
    <item>
      <title>Volvo touts EX60&#8217;s range and charging speed ahead of official debut</title>
      <link>https://www.theverge.com/transportation/857933/volvo-ex60-range-charging-speed-megacasting-battery</link>
      <pubDate>2026-01-08T03:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=857933</guid>
      <description>Volvo is starting to trickle out some details about its upcoming midsize electric SUV, the EX60, before its official debut January 21st. The EX60 will have an estimated range of 400 miles (or 810km based on the generous WLTP standard in Europe). That's significantly more range than any previous Volvo EV - at least until [&#8230;]</description>
    </item>
    <item>
      <title>Une anomalie cosmique sugg&#232;re qu'il faut revoir la forme de notre Univers  !</title>
      <link>https://www.futura-sciences.com/sciences/actualites/astronomie-anomalie-cosmique-suggere-quil-faut-revoir-forme-notre-univers-129767/#xtor%3DRSS-8</link>
      <pubDate>Thu, 08 Jan 2026 08:47:01 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/astronomie-anomalie-cosmique-suggere-quil-faut-revoir-forme-notre-univers-129767/#xtor%3DRSS-8</guid>
      <description>Ces derni&#232;res ann&#233;es, le prix Nobel de physique et architecte du Mod&#232;le cosmologique standard James Peebles avait rassembl&#233; dans un article plusieurs anomalies et &#233;nigmes que pose ce mod&#232;le. L'une d'elles est bien connue, c'est celle de la tension de Hubble. Mais si&#160;l'anomalie du dip&#244;le cosmique...</description>
    </item>
    <item>
      <title>Google Messages va int&#233;grer un menu d&#8217;actions inspir&#233; de WhatsApp</title>
      <link>https://www.01net.com/actualites/google-messages-va-integrer-un-menu-dactions-inspire-de-whatsapp.html</link>
      <pubDate>Thu, 08 Jan 2026 07:35:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318757</guid>
      <description>L&#8217;application de messagerie de Google vous permettra bient&#244;t d&#8217;acc&#233;der &#224; plus d&#8217;options en effectuant un appui long sur les messages et les images que vous recevez. Un syst&#232;me directement inspir&#233; de WhatsApp.</description>
    </item>
  </channel>
</rss>
