<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Wed, 18 Feb 2026 09:54:59 GMT</lastBuildDate>
    <item>
      <title>You&#8217;ll be able to double your storage with Samsung Galaxy S26 pre-orders &#8212; but only in some regions</title>
      <link>https://www.techradar.com/phones/samsung-galaxy-phones/youll-be-able-to-double-your-storage-with-samsung-galaxy-s26-pre-orders-but-only-in-some-regions</link>
      <pubDate>Wed, 18 Feb 2026 09:53:20 +0000</pubDate>
      <guid isPermaLink="false">avUPihiveKEQ3S9MGvyVZm</guid>
      <description>Samsung has revealed some pre-order perks for the Samsung Galaxy S26 series, but a major one is missing in the US and Australia.</description>
    </item>
    <item>
      <title>Cyberattaques chinoises&#160;: des espions ont exploit&#233; une faille Dell sans se faire remarquer pendant 18 mois</title>
      <link>https://www.01net.com/actualites/cyberattaques-chinoises-hackers-exploitent-faille-critique-dell-inapercus-mois.html</link>
      <pubDate>Wed, 18 Feb 2026 09:43:37 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326566</guid>
      <description>Depuis des mois, des cybercriminels chinois, sous les ordres de P&#233;kin, exploitent une faille critique d'un logiciel Dell pour mener des op&#233;rations d'espionnage &#224; grande &#233;chelle. D&#233;busqu&#233;e par Mandiant et Google Threat Intelligence Group, la cyberattaque est pass&#233;e inaper&#231;ue pendant 18&#160;mois&#8230;</description>
    </item>
    <item>
      <title>I tested the new GHD hair dryer and was blown away by a hurricane of power</title>
      <link>https://www.techradar.com/home/hair-care/ghd-speed-hair-dryer-review</link>
      <pubDate>Wed, 18 Feb 2026 09:42:30 +0000</pubDate>
      <guid isPermaLink="false">7RvSwmfEryGvxjZjfn6zCW</guid>
      <description>The GHD Speed packs a punch when it comes to power, and delivers plenty of precise control, too.</description>
    </item>
    <item>
      <title>Pourquoi les boutons physiques vont faire leur grand retour dans les voitures d&#232;s 2026</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2980989_pourquoi-les-boutons-physiques-vont-faire-leur-grand-retour-dans-les-voitures-des-2026</link>
      <pubDate>Wed, 18 Feb 2026 09:41:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2980989_pourquoi-les-boutons-physiques-vont-faire-leur-grand-retour-dans-les-voitures-des-2026</guid>
      <description>
Apr&#232;s avoir mis&#233; massivement sur le tout-tactile, les constructeurs sont peu &#224; peu contraints de faire machine arri&#232;re. De nombreuses voitures &#233;lectriques reviennent d&#233;sormais aux commandes physiques, qui seront de toutes fa&#231;ons bient&#244;t obligatoires.
</description>
    </item>
    <item>
      <title>Comment rouler &#224; deux sur votre v&#233;lo en toute l&#233;galit&#233; et sans danger ? La selle biplace Selle Jallot se veut r&#233;volutionnaire</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2980323_comment-rouler-a-deux-sur-votre-velo-en-toute-legalite-et-sans-danger-la-selle-biplace-selle-jallot-se-veut-revolutionnaire</link>
      <pubDate>Wed, 18 Feb 2026 09:35:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2980323_comment-rouler-a-deux-sur-votre-velo-en-toute-legalite-et-sans-danger-la-selle-biplace-selle-jallot-se-veut-revolutionnaire</guid>
      <description>
Gr&#226;ce &#224; sa solution in&#233;dite d&#8217;assise longue pour deux personnes, la Selle Jallot peut s'installer sur n&#8217;importe quel v&#233;lo &#233;lectrique ou m&#233;canique, de quoi offrir une alternative aux v&#233;los cargos, aux fatbikes, ou aux pratiques parfois ill&#233;gales et dangereuses.
</description>
    </item>
    <item>
      <title>Google Home ajoute trois nouvelles fonctionnalit&#233;s pratiques pour la maison</title>
      <link>https://www.frandroid.com/android/2980879_google-home-ajoute-trois-nouvelles-fonctionnalites-pratiques-pour-la-maison</link>
      <pubDate>Wed, 18 Feb 2026 09:29:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/android/2980879_google-home-ajoute-trois-nouvelles-fonctionnalites-pratiques-pour-la-maison</guid>
      <description>
Les &#233;quipes de Google d&#233;ploient une nouvelle mise &#224; jour qui va faciliter l&#8217;ajout de nouvelles commandes tout en am&#233;liorant les processus d&#8217;automatisations de Google Home. &#160;
</description>
    </item>
    <item>
      <title>'Making silky smoothies has never been so much fun' &#8212; Ninja's most colourful blender is finally on sale in the UK</title>
      <link>https://www.techradar.com/home/small-appliances/making-silky-smoothies-has-bever-been-so-much-fun-ninjas-most-colourful-blender-is-finally-on-sale-in-the-uk</link>
      <pubDate>Wed, 18 Feb 2026 09:21:59 +0000</pubDate>
      <guid isPermaLink="false">4EfkwEPQequvioiAJY8FDi</guid>
      <description>The BlendBoss has a super-powerful motor and tough blade assembly to make light work of tough ingredients like ice and fibrous veggies.</description>
    </item>
    <item>
      <title>Meilleures consoles de jeux portables : notre s&#233;lection en 2026</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-gaming/1705105_quelles-sont-les-meilleures-consoles-portables-notre-selection</link>
      <pubDate>Wed, 18 Feb 2026 09:15:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-gaming/1705105_quelles-sont-les-meilleures-consoles-portables-notre-selection</guid>
      <description>
Les consoles de jeu portables ont le vent en poupe. Il existe de nombreuses r&#233;f&#233;rences pour jouer partout &#224; tous vos titres favoris : jeux Nintendo, mais aussi jeux PC, et Android. Voici quelles sont les meilleures consoles portables disponibles sur le march&#233;.
</description>
    </item>
    <item>
      <title>Thule d&#233;voile InLock, un nouveau syst&#232;me de fixation pour sacoches v&#233;lo qui veut vous faciliter la vie</title>
      <link>https://www.frandroid.com/marques/thule/2981077_thule-devoile-inlock-un-nouveau-systeme-de-fixation-pour-sacoches-velo-qui-veut-vous-faciliter-la-vie</link>
      <pubDate>Wed, 18 Feb 2026 09:15:10 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/thule/2981077_thule-devoile-inlock-un-nouveau-systeme-de-fixation-pour-sacoches-velo-qui-veut-vous-faciliter-la-vie</guid>
      <description>
Thule introduit InLock, un nouveau syst&#232;me de fixation universel pour sacoches de v&#233;lo, accompagn&#233; des collections Thule Shield et Thule Chasm compatibles. La commercialisation est pr&#233;vue en f&#233;vrier 2026.
</description>
    </item>
    <item>
      <title>Pour contrer la Chine, l&#8217;Europe pr&#233;pare une nouvelle riposte sur la voiture &#233;lectrique</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2980931_pour-contrer-la-chine-leurope-prepare-une-nouvelle-riposte-sur-la-voiture-electrique</link>
      <pubDate>Wed, 18 Feb 2026 09:13:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2980931_pour-contrer-la-chine-leurope-prepare-une-nouvelle-riposte-sur-la-voiture-electrique</guid>
      <description>
Bruxelles travaille sur une solution pour contrer l'arriv&#233;e des voitures &#233;lectriques chinoises en Europe. Une mesure soutenue par Stellantis et Volkswagen.
</description>
    </item>
    <item>
      <title>Le futur Renault Sc&#233;nic &#233;lectrique va tout changer : recharge, autonomie et fin du &#171;&#160;made in France&#160;&#187;</title>
      <link>https://www.frandroid.com/marques/renault/2980883_le-futur-renault-scenic-electrique-va-tout-changer-recharge-autonomie-et-fin-du-made-in-france</link>
      <pubDate>Wed, 18 Feb 2026 09:05:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/renault/2980883_le-futur-renault-scenic-electrique-va-tout-changer-recharge-autonomie-et-fin-du-made-in-france</guid>
      <description>
&#192; l&#8217;heure actuelle, et hormis la Twingo, toutes les voitures &#233;lectriques de Renault sont produites en France. Mais voil&#224; que le constructeur au losange vient de prendre une d&#233;cision forte : la prochaine g&#233;n&#233;ration du Sc&#233;nic &#233;lectrique devrait &#234;tre assembl&#233;e en Espagne.
</description>
    </item>
    <item>
      <title>VanMoof : pourquoi la fin de la 2G pourrait impacter votre v&#233;lo &#233;lectrique</title>
      <link>https://www.frandroid.com/marques/vanmoof/2980529_vanmoof-pourquoi-la-fin-de-la-2g-pourrait-impacter-votre-velo-electrique</link>
      <pubDate>Wed, 18 Feb 2026 08:49:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/vanmoof/2980529_vanmoof-pourquoi-la-fin-de-la-2g-pourrait-impacter-votre-velo-electrique</guid>
      <description>
Reposant sur le r&#233;seau 2G, le suivi des vols des VanMoof S3 et X3 ne fonctionnera plus apr&#232;s la fin du r&#233;seau 2G. La marque propose une solution pour conserver cette fonction, mais ladite solution s'annonce payante.
</description>
    </item>
    <item>
      <title>Fresh &#8216;n Rebel Pearls, &#231;a ressemble &#224; des &#233;couteurs mais &#231;a n&#8217;en est pas</title>
      <link>https://www.frandroid.com/produits-android/2980997_fresh-n-rebel-pearls-ca-ressemble-a-des-ecouteurs-mais-ca-nen-est-pas</link>
      <pubDate>Wed, 18 Feb 2026 08:33:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2980997_fresh-n-rebel-pearls-ca-ressemble-a-des-ecouteurs-mais-ca-nen-est-pas</guid>
      <description>
La marque Fresh 'n Rebel vient d&#8217;annoncer la commercialisation d&#8217;un nouveau dispositif permettant de prot&#233;ger l'audition lors d'&#233;v&#233;nements musicaux. Baptis&#233;s Pearls, il s&#8217;agit de bouchons d'oreilles combinant optimisation acoustique et design distinctif.
</description>
    </item>
    <item>
      <title>Cette souris sans-fil et ultra-l&#233;g&#232;re de chez Logitech perd presque 40 % de son prix sur Amazon</title>
      <link>https://www.frandroid.com/bons-plans/2980201_cette-souris-sans-fil-et-ultra-legere-de-chez-logitech-perd-presque-40-de-son-prix-sur-amazon</link>
      <pubDate>Wed, 18 Feb 2026 08:33:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2980201_cette-souris-sans-fil-et-ultra-legere-de-chez-logitech-perd-presque-40-de-son-prix-sur-amazon</guid>
      <description>
Avec la Logitech G Pro X Superlight 2, vous pourrez profiter d'une souris gamer qui m&#234;le l&#233;g&#232;ret&#233; et pr&#233;cision pour 104,99 euros au lieu de 169,99 euros sur Amazon.
</description>
    </item>
    <item>
      <title>Nouveaux emojis, barre des t&#226;ches am&#233;lior&#233;es, optimisation syst&#232;me&#160;: Windows&#160;11 pr&#233;pare quelques petites am&#233;liorations bienvenues</title>
      <link>https://www.frandroid.com/os/windows/2980991_nouveaux-emojis-barre-des-taches-ameliorees-optimisation-systeme-windows-11-prepare-quelques-petites-ameliorations-bienvenues</link>
      <pubDate>Wed, 18 Feb 2026 08:29:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/os/windows/2980991_nouveaux-emojis-barre-des-taches-ameliorees-optimisation-systeme-windows-11-prepare-quelques-petites-ameliorations-bienvenues</guid>
      <description>
Tenue par une politique d&#8217;&#171; innovation continuelle &#187;, Microsoft pr&#233;pare une grosse mise &#224; jour pour son dernier syst&#232;me d&#8217;exploitation star. Au programme, des tas d&#8217;optimisations sous le capot et quelques nouveaut&#233;s int&#233;ressantes pour le grand public.
</description>
    </item>
    <item>
      <title>Anthropic d&#233;voile Claude Sonnet 4.6, sa nouvelle IA de r&#233;f&#233;rence</title>
      <link>https://www.01net.com/actualites/anthropic-devoile-claude-sonnet-4-6-nouvelle-ia-reference.html</link>
      <pubDate>Wed, 18 Feb 2026 08:15:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326554</guid>
      <description>Anthropic d&#233;voile Claude Sonnet 4.6, une mise &#224; jour majeure de son mod&#232;le d&#8217;IA g&#233;n&#233;raliste. Plus rapide, plus fiable et presque aussi performant que les mod&#232;les de pointe, Sonnet 4.6 vise &#224; rendre l&#8217;automatisation intelligente accessible au plus grand nombre.</description>
    </item>
    <item>
      <title>The best drone for 2026</title>
      <link>https://www.engadget.com/cameras/best-drone-120046775.html?src=rss</link>
      <pubDate>Wed, 18 Feb 2026 08:01:26 +0000</pubDate>
      <guid isPermaLink="false">de298f39-1edd-4bb0-b825-fcc7f3710e12</guid>
      <description>Drones are no longer just niche toys for enthusiasts. Today&#8217;s models are compact, increasingly affordable and capable of capturing sharp aerial photos and video with minimal effort. Whether you&#8217;re curious about flying for the first time or looking to upgrade to a more advanced camera drone, the options available in 2026 are broader and more approachable than ever.Entry-level drones now offer features like GPS-assisted flight, return-to-home safety systems and automated shooting modes that take much of the stress out of learning to fly. Step up to more advanced models and you&#8217;ll find foldable d...</description>
    </item>
  </channel>
</rss>
