<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 17 Feb 2026 11:42:08 GMT</lastBuildDate>
    <item>
      <title>Google Messages : cette nouvelle option toute simple va changer votre quotidien</title>
      <link>https://www.frandroid.com/marques/google/2979989_google-messages-cette-nouvelle-option-toute-simple-va-changer-votre-quotidien</link>
      <pubDate>Tue, 17 Feb 2026 11:35:07 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2979989_google-messages-cette-nouvelle-option-toute-simple-va-changer-votre-quotidien</guid>
      <description>
Google Messages va enfin vous permettre de ne copier qu'une partie d'un message re&#231;u. Une mise &#224; jour qui semble insignifiante, mais qui r&#233;pond &#224; un v&#233;ritable besoin apr&#232;s toutes ces ann&#233;es.
</description>
    </item>
    <item>
      <title>Apple va enfin s&#233;curiser l&#8217;envoi de messages entre iPhone et Android</title>
      <link>https://www.frandroid.com/marques/apple/2979607_apple-va-enfin-securiser-lenvoi-de-messages-entre-iphone-et-android</link>
      <pubDate>Tue, 17 Feb 2026 11:33:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2979607_apple-va-enfin-securiser-lenvoi-de-messages-entre-iphone-et-android</guid>
      <description>
La nouvelle b&#234;ta d&#233;veloppeur d&#8217;iOS d&#233;voile une bonne nouvelle pour la s&#233;curit&#233; de vos messages en testant le chiffrement de bout en bout pour les messages RCS.
</description>
    </item>
    <item>
      <title>Voici un puissant ultrabook (Ultra 9, 32 Go de RAM, &#233;cran Oled&#8230;) en forte promotion chez E.Leclerc</title>
      <link>https://www.frandroid.com/bons-plans/2979675_voici-un-puissant-ultrabook-ultra-9-32-go-de-ram-ecran-oled-en-forte-promotion-chez-e-leclerc</link>
      <pubDate>Tue, 17 Feb 2026 11:33:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2979675_voici-un-puissant-ultrabook-ultra-9-32-go-de-ram-ecran-oled-en-forte-promotion-chez-e-leclerc</guid>
      <description>
L'Asus Zenbook est un ultrabook complet qui b&#233;n&#233;ficie d'un &#233;cran OLED de 14 pouces et d'un Intel Core Ultra 9 pour des performances optimales. Chez E.Leclerc, il passe de 1 599 euros &#224; 1 249 euros.
</description>
    </item>
    <item>
      <title>Une cyberattaque frappe Voyage Priv&#233; : les donn&#233;es vol&#233;es sont d&#233;j&#224; exploit&#233;es dans des arnaques</title>
      <link>https://www.01net.com/actualites/cyberattaque-frappe-voyage-prive-donnees-volees-deja-exploitees-arnaques.html</link>
      <pubDate>Tue, 17 Feb 2026 11:33:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326367</guid>
      <description>Voyage Priv&#233; vient de r&#233;v&#233;ler qu'un de ses partenaires a &#233;t&#233; victime d'une cyberattaque. Les pirates ont r&#233;ussi &#224; d&#233;rober des donn&#233;es sensibles de r&#233;servation, y compris des noms, pr&#233;noms, adresses mail, num&#233;ros de t&#233;l&#233;phone et m&#234;me des informations de passeport. Les cybercriminels exploitent d&#233;j&#224; activement ces informations dans des campagnes de phishing sophistiqu&#233;es sur WhatsApp......</description>
    </item>
    <item>
      <title>EU launches second investigation into Grok's nonconsensual image generation</title>
      <link>https://www.engadget.com/big-tech/eu-launches-second-investigation-into-groks-nonconsensual-image-generation-113239967.html?src=rss</link>
      <pubDate>Tue, 17 Feb 2026 11:32:39 +0000</pubDate>
      <guid isPermaLink="false">6aaeecb0-5038-48c6-99ba-a64336ca3cc5</guid>
      <description>X is facing yet another investigation into Grok's reported creation of nonconsensual sexual images on the platform. Ireland's Data Protection Commission (DPC) has announced an inquiry into X regarding the harmful, intimate images and processing of EU and EEA individuals' personal data &#8212; including children.
In an 11-day period, X generated about three million sexualized images, an estimated 23,000 of which were of children. British nonprofit, the Center for Countering Digital Hate (CCDH) announced the results of its December 29 to January 9 review last month.&#160;&#160;
Critically, the investigation wil...</description>
    </item>
    <item>
      <title>Un antivirus int&#233;gr&#233; &#224; la box : Free lance un nouveau service pour les pros</title>
      <link>https://www.frandroid.com/marques/free/2979887_un-antivirus-integre-a-la-box-free-lance-un-nouveau-service-pour-les-pros</link>
      <pubDate>Tue, 17 Feb 2026 11:30:48 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/free/2979887_un-antivirus-integre-a-la-box-free-lance-un-nouveau-service-pour-les-pros</guid>
      <description>
En ces temps de piratages massifs, Free fait &#233;voluer Free Pro pour int&#233;grer une offre de cybers&#233;curit&#233;.
</description>
    </item>
    <item>
      <title>The Simplest Android App for Scanning Documents</title>
      <link>https://www.wired.com/story/fairscan-simple-app-for-scanning-documents-on-android/</link>
      <pubDate>Tue, 17 Feb 2026 11:30:00 +0000</pubDate>
      <guid isPermaLink="false">698d0feafbe49e3e4a648a0e</guid>
      <description>Most scanning apps try to get you to buy a cloud storage subscription or pay for extras. Not FairScan, which is free and open-source, and has some powerful features.</description>
    </item>
    <item>
      <title>La croisade anti-science de Donald Trump continue : la Nasa somm&#233;e d&#8217;arr&#234;ter certaines missions phares et projets</title>
      <link>https://www.futura-sciences.com/sciences/actualites/nasa-croisade-anti-science-donald-trump-continue-nasa-sommee-arreter-certaines-missions-phares-projets-131335/#xtor%3DRSS-8</link>
      <pubDate>Tue, 17 Feb 2026 12:25:28 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/nasa-croisade-anti-science-donald-trump-continue-nasa-sommee-arreter-certaines-missions-phares-projets-131335/#xtor%3DRSS-8</guid>
      <description>Le gouvernement &#233;tats-unien a demand&#233; &#224; la Nasa de cesser le financement de certains programmes scientifiques, et ce alors m&#234;me que le budget de l'Agence spatiale am&#233;ricaine avait pourtant &#233;t&#233; sauv&#233; par le Congr&#232;s. Au final, Donald Trump applique les m&#234;mes restrictions que ce qu'il avait demand&#233;...</description>
    </item>
    <item>
      <title>Final Fantasy 7 Remake Part 3 director confirms PC as lead platform, and stresses a multiplatform release 'will not in any way' impact quality on PS5, Xbox, and Switch 2</title>
      <link>https://www.techradar.com/gaming/final-fantasy-7-remake-part-3-director-confirms-pc-as-lead-platform-and-stresses-a-multiplatform-release-will-not-in-any-way-impact-quality-on-ps5-xbox-and-switch-2</link>
      <pubDate>Tue, 17 Feb 2026 11:18:47 +0000</pubDate>
      <guid isPermaLink="false">rdt9yo8NM56eQr66WcDJD</guid>
      <description>Final Fantasy 7 Remake Part 3 'will not in any way' have its quality impacted by a multiplatform release, says director.</description>
    </item>
    <item>
      <title>Apple va enfin corriger ce gros d&#233;faut de la recharge sur MacBook</title>
      <link>https://www.frandroid.com/marques/apple/2979501_macos-26-4-loption-cachee-qui-va-prolonger-la-vie-de-votre-mac</link>
      <pubDate>Tue, 17 Feb 2026 11:18:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2979501_macos-26-4-loption-cachee-qui-va-prolonger-la-vie-de-votre-mac</guid>
      <description>
macOS se dote enfin de la fonctionnalit&#233; de limite de charge import&#233;e de l&#8217;iPhone, pour pr&#233;server la long&#233;vit&#233; de votre batterie sur Mac, surtout si vous le laissez branch&#233; en permanence.
</description>
    </item>
    <item>
      <title>Voici l&#8217;int&#233;rieur de la BYD Racco, une kei-car &#233;lectrique qui pourrait bien arriver en Europe</title>
      <link>https://www.frandroid.com/marques/byd/2979509_voici-linterieur-de-la-byd-racco-une-kei-car-electrique-qui-pourrait-bien-arriver-en-europe</link>
      <pubDate>Tue, 17 Feb 2026 11:17:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2979509_voici-linterieur-de-la-byd-racco-une-kei-car-electrique-qui-pourrait-bien-arriver-en-europe</guid>
      <description>
Lors du dernier Japan Mobility Show &#224; Tokyo, BYD a pr&#233;sent&#233; un v&#233;hicule petit mais ambitieux. Il s&#8217;agit de la Racco K-EV, une citadine &#233;lectrique destin&#233;e au march&#233; japonais, afin de s&#8217;imposer dans la cat&#233;gorie des kei-cars. Elle d&#233;voile d&#233;sormais son int&#233;rieur.
</description>
    </item>
    <item>
      <title>Cozy gamers rejoice, Pinterest is coming to World of Warcraft with interior design mood boards and the ability to share in-game snaps</title>
      <link>https://www.techradar.com/gaming/pc-gaming/cozy-gamers-rejoice-pinterest-is-coming-to-world-of-warcraft-with-interior-design-mood-boards-and-the-ability-to-share-in-game-snaps</link>
      <pubDate>Tue, 17 Feb 2026 11:08:11 +0000</pubDate>
      <guid isPermaLink="false">TspCnc9ZF86VmmGc5XCQNE</guid>
      <description>The new Pinterest and World of Warcraft collaboration allows players to share snaps of their in-game houses.</description>
    </item>
    <item>
      <title>Sony could be forced to delay the PS6 to 2029 due to the rising cost of RAM, as Nintendo reportedly considers increasing the cost of the Switch 2</title>
      <link>https://www.techradar.com/gaming/sony-could-be-forced-to-delay-the-ps6-to-2029-due-to-the-rising-cost-of-ram-as-nintendo-reportedly-considers-increasing-the-cost-of-the-switch-2</link>
      <pubDate>Tue, 17 Feb 2026 11:06:34 +0000</pubDate>
      <guid isPermaLink="false">9a3ts7ZcxcPMAwb7orReT3</guid>
      <description>Sony could be forced to delay the launch of the PlayStation 6, while the Nintendo Switch 2 could get more expensive, due to the ongoing RAM shortage.</description>
    </item>
    <item>
      <title>Get the Pok&#233;mon TCG Pok&#233;mon Day 2026 Collection for under $40 at Amazon</title>
      <link>https://mashable.com/article/feb-17-pokemon-tcg-pokemon-day-2026-collection-deal</link>
      <pubDate>Tue, 17 Feb 2026 11:05:08 +0000</pubDate>
      <guid isPermaLink="false">02Ngk0f6sjVRwxdotB0Pcxk</guid>
      <description>Amazon drops the Pok&#233;mon TCG: Pok&#233;mon Day 2026 Collection to $39.45 &#8212; about $24 cheaper than TCGplayer with delivery before Feb. 27.</description>
    </item>
    <item>
      <title>Mauvaise nouvelle pour la Switch 2&#160;: Nintendo ferait face &#224; un gros souci en 2026</title>
      <link>https://www.01net.com/actualites/mauvaise-nouvelle-pour-la-switch-2-nintendo-ferait-face-a-un-gros-souci-en-2026.html</link>
      <pubDate>Tue, 17 Feb 2026 11:03:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326376</guid>
      <description>Nintendo envisagerait d&#8217;augmenter le prix de la Switch 2 d&#232;s 2026, malgr&#233; un lancement d&#233;j&#224; jug&#233; co&#251;teux par de nombreux joueurs. &#171; Bloomberg &#187; rapporte que la flamb&#233;e des prix de la DRAM, dop&#233;e par la demande en IA, pousserait la firme &#224; r&#233;percuter cette hausse sur sa console hybride phare.</description>
    </item>
    <item>
      <title>Affinity by Canva (2026) review: Three design tools in one, all for free - but is the software an Adobe-killer?</title>
      <link>https://www.techradar.com/pro/affinity-by-canva-2026-review</link>
      <pubDate>Tue, 17 Feb 2026 11:00:40 +0000</pubDate>
      <guid isPermaLink="false">ESwkymiCDAAgoPVcXGw4Y5</guid>
      <description>Paint, draw curves, layout a magazine, all for free.</description>
    </item>
    <item>
      <title>Pourquoi le retour soudain du diesel chez Peugeot et Citro&#235;n cache une r&#233;alit&#233; bien plus inqui&#233;tante pour l&#8217;avenir de Stellantis</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2979741_pourquoi-le-retour-soudain-du-diesel-chez-peugeot-et-citroen-cache-une-realite-bien-plus-inquietante-pour-lavenir-de-stellantis</link>
      <pubDate>Tue, 17 Feb 2026 11:00:38 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2979741_pourquoi-le-retour-soudain-du-diesel-chez-peugeot-et-citroen-cache-une-realite-bien-plus-inquietante-pour-lavenir-de-stellantis</guid>
      <description>
Ressusciter le moteur diesel alors que le march&#233; automobile mondial a les yeux riv&#233;s sur l'&#233;lectrique et l'hybride ? C&#8217;est le pari pour le moins audacieux que vient de faire Stellantis. Mais derri&#232;re les discours officiels pour justifier cette d&#233;cision, la r&#233;alit&#233; du terrain r&#233;v&#232;le des failles inqui&#233;tantes pour l'avenir du groupe.
</description>
    </item>
    <item>
      <title>AI Digital Twins Are Helping People Manage Diabetes and Obesity</title>
      <link>https://www.wired.com/story/ai-digital-twins-are-helping-people-manage-diabetes-and-obesity/</link>
      <pubDate>Tue, 17 Feb 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">697cba05d81e4a03091a36de</guid>
      <description>As patients and employers look for alternatives to pricey GLP-1 drugs, Silicon Valley startup Twin Health is using AI and wearable sensors to help people make healthier choices.</description>
    </item>
    <item>
      <title>How to design a portfolio career that works: These Renaissance women show how it&#8217;s done</title>
      <link>https://www.fastcompany.com/91479963/how-to-design-a-portfolio-career-that-works-these-renaissance-women-show-how-its-done</link>
      <pubDate>2026-02-17T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91479963/how-to-design-a-portfolio-career-that-works-these-renaissance-women-show-how-its-done</guid>
      <description>As juggling multiple jobs and projects as a career becomes more commonplace, meet the multi-hyphenate women who are making a living while maintaining control. 
Gabriela Flax spent the first part of her career working in tech as a product manager. And while every day was different and varied, there were aspects of it that were causing her burnout. </description>
    </item>
    <item>
      <title>Ikea&#8217;s resale bet is paying off</title>
      <link>https://www.fastcompany.com/91491130/ikea-resale-is-paying-off</link>
      <pubDate>2026-02-17T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91491130/ikea-resale-is-paying-off</guid>
      <description>Ikea&#8217;s secondhand product sales keep growing&#8212;including some vintage furniture that&#8217;s decades old.
If you stop by the &#8220;as-is&#8221; section at one of Ikea&#8217;s U.S. stores, you might now find a vintage table from the 1980s.</description>
    </item>
    <item>
      <title>Cette mini console portable r&#233;tro fa&#231;on Game Boy Advance SP chute sous les 50 &#8364; gr&#226;ce &#224; cette offre</title>
      <link>https://www.frandroid.com/bons-plans/2979491_cette-mini-console-portable-retro-facon-game-boy-advance-sp-chute-sous-les-50-e-grace-a-cette-offre</link>
      <pubDate>Tue, 17 Feb 2026 10:58:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2979491_cette-mini-console-portable-retro-facon-game-boy-advance-sp-chute-sous-les-50-e-grace-a-cette-offre</guid>
      <description>
Compacte et l&#233;g&#232;re, l'Anbernic RG35XXSP &#233;mule les jeux de presque toutes les consoles r&#233;tro incontournables. Si vous souhaitez d&#233;couvrir ou red&#233;couvrir des grands classiques, sachez que cette console de poche est disponible &#224; 47,26 euros au lieu de 59 euros sur AliExpress.
</description>
    </item>
    <item>
      <title>Samsung is slopping AI ads all over its social channels</title>
      <link>https://www.theverge.com/tech/879864/samsung-ai-generated-edited-video-ads-slop</link>
      <pubDate>2026-02-17T05:55:32-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=879864</guid>
      <description>After cramming AI into every inch of its smartphones, appliances, and other devices, Samsung is now increasingly slapping it across social media. Several videos posted to the company's YouTube, Instagram, and TikTok accounts in recent weeks were made or edited using generative AI tools, including its latest teaser for the upcoming Galaxy S26 series. The [&#8230;]...</description>
    </item>
    <item>
      <title>Eurail confirms stolen traveler data is on sale in the dark web - and it still doesn't know who is behind the attack</title>
      <link>https://www.techradar.com/pro/security/eurail-confirms-stolen-traveler-data-is-on-sale-in-the-dark-web-and-it-still-doesnt-know-who-is-behind-the-attack</link>
      <pubDate>Tue, 17 Feb 2026 10:55:00 +0000</pubDate>
      <guid isPermaLink="false">B4nCqfcZeJUkdPBQzb9iDX</guid>
      <description>The January 2026 Eurail breach just got worse, as hackers have started selling the stolen data.</description>
    </item>
    <item>
      <title>Save $250 on the Samsung 49-inch Odyssey G9 gaming monitor at Amazon</title>
      <link>https://mashable.com/article/feb-17-samsung-odyssey-g9-deal</link>
      <pubDate>Tue, 17 Feb 2026 10:54:33 +0000</pubDate>
      <guid isPermaLink="false">00ZU58FrN4PPWc8XMKOXe5j</guid>
      <description>Find the best gaming monitor deal. Save 25% on the Samsung 49-inch Odyssey G9 at Amazon.</description>
    </item>
    <item>
      <title>Mobile + fibre : B&amp;You a trouv&#233; le combo parfait pour r&#233;duire vos factures sans sacrifier votre confort [Sponso]</title>
      <link>https://www.frandroid.com/telecom/2979005_mobile-fibre-byou-a-trouve-le-combo-parfait-pour-reduire-vos-factures-sans-sacrifier-votre-confort</link>
      <pubDate>Tue, 17 Feb 2026 10:51:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/telecom/2979005_mobile-fibre-byou-a-trouve-le-combo-parfait-pour-reduire-vos-factures-sans-sacrifier-votre-confort</guid>
      <description>
B&amp;You prouve que le confort n'a pas besoin de se payer cher avec son g&#233;n&#233;reux forfait 5G de 100 Go accessible &#224; prix plancher et sans engagement.
</description>
    </item>
    <item>
      <title>The Amazon Fire TV Stick 4K Select is at its lowest price this year &#8212; save $18 right now</title>
      <link>https://mashable.com/article/feb-17-fire-stick-4k-select-deal</link>
      <pubDate>Tue, 17 Feb 2026 10:48:41 +0000</pubDate>
      <guid isPermaLink="false">04GtzjzVZIiYE2xowuDBYn8</guid>
      <description>Get the best Fire Stick deal at Amazon. Save 45% on the Amazon Fire TV Stick 4K Select at Amazon.</description>
    </item>
    <item>
      <title>The Hisense Class U8 Mini-LED TV has dropped to its lowest-ever price at Amazon &#8212; save over $600</title>
      <link>https://mashable.com/article/feb-17-hisense-class-u8-tv-deal</link>
      <pubDate>Tue, 17 Feb 2026 10:43:43 +0000</pubDate>
      <guid isPermaLink="false">00KoHk7JeiCsrLLtvDai8AK</guid>
      <description>Find the best TV deal. Save 43% on the Hisense 65-inch U8 Mini-LED at Amazon.</description>
    </item>
    <item>
      <title>Galaxy A07 5G&#160;: grosse batterie et bouton Gemini pour le nouveau Samsung &#224; petit prix</title>
      <link>https://www.01net.com/actualites/galaxy-a07-5g-grosse-batterie-et-bouton-gemini-pour-le-nouveau-samsung-a-petit-prix.html</link>
      <pubDate>Tue, 17 Feb 2026 10:42:56 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326327</guid>
      <description>Samsung officialise le lancement global de son Galaxy A07 5G. Derri&#232;re son prix plancher, ce smartphone d'entr&#233;e de gamme cache une &#233;norme batterie et, surprise, une int&#233;gration pouss&#233;e de l'intelligence artificielle de Google.</description>
    </item>
    <item>
      <title>Future Alpine A110 &#233;lectrique : elle partage un secret technique avec la plus folle des Renault 5</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2979617_future-alpine-a110-electrique-elle-partage-un-secret-technique-avec-la-plus-folle-des-renault-5</link>
      <pubDate>Tue, 17 Feb 2026 10:35:58 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2979617_future-alpine-a110-electrique-elle-partage-un-secret-technique-avec-la-plus-folle-des-renault-5</guid>
      <description>
L'Alpine A110 va bient&#244;t devenir, elle aussi, une voiture &#233;lectrique. &#192; quelques mois de sa pr&#233;sentation, nos confr&#232;res d'Autocar ont appris qu'elle reposerait sur la m&#234;me plateforme que la Renault 5 Turbo 3E, de quoi promettre des performances de haut niveau.
</description>
    </item>
    <item>
      <title>Boulanger fait chuter le prix du Google Pixel 10 avec une offre particuli&#232;rement s&#233;duisante</title>
      <link>https://www.frandroid.com/bons-plans/2912095_boulanger-fait-chuter-le-prix-du-google-pixel-10-avec-une-offre-particulierement-seduisante</link>
      <pubDate>Tue, 17 Feb 2026 10:32:44 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2912095_boulanger-fait-chuter-le-prix-du-google-pixel-10-avec-une-offre-particulierement-seduisante</guid>
      <description>
Le Pixel 10 profite d&#8217;une nouvelle baisse de prix chez Boulanger. Gr&#226;ce &#224; un bonus de reprise, le smartphone de Google passe sous la barre des 600 euros, avec en prime une paire d&#8217;&#233;couteurs Buds 2a offerte pour compl&#233;ter un pack particuli&#232;rement s&#233;duisant.
</description>
    </item>
    <item>
      <title>La crise de la RAM va provoquer des faillites en cascade, et ce n&#8217;est pas n&#8217;importe qui qui l&#8217;explique</title>
      <link>https://www.frandroid.com/culture-tech/economie/2979497_la-crise-de-la-ram-va-provoquer-des-faillites-en-cascade-et-ce-nest-pas-nimporte-qui-qui-lexplique</link>
      <pubDate>Tue, 17 Feb 2026 10:31:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/culture-tech/economie/2979497_la-crise-de-la-ram-va-provoquer-des-faillites-en-cascade-et-ce-nest-pas-nimporte-qui-qui-lexplique</guid>
      <description>
Au cours d'une interview accord&#233;e &#224; un m&#233;dia ta&#239;wanais, Pua Khein-Seng, dirigeant et co-fondateur de Phison, sp&#233;cialiste de la m&#233;moire flash, a expliqu&#233; que la crise actuelle de la m&#233;moire vive va bient&#244;t mettre dos au mur de nombreux fabricants de produits &#233;lectroniques grand public... et en pousser certains &#224; la faillite. 
</description>
    </item>
    <item>
      <title>It&#8217;s Probably a Bit Much to Say This AI Agent Cyberbullied a Developer By Blogging About Him</title>
      <link>https://gizmodo.com/its-probably-a-bit-much-to-say-this-ai-agent-cyberbullied-a-developer-by-blogging-about-him-2000722389</link>
      <pubDate>Tue, 17 Feb 2026 10:30:04 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000722389</guid>
      <description>It's an interesting case study in AI agents and what that whole "agency" thing...</description>
    </item>
    <item>
      <title>Valve admits Steam Deck availability is affected by memory and storage shortages</title>
      <link>https://www.engadget.com/gaming/valve-admits-steam-deck-availability-is-affected-by-memory-and-storage-shortages-102913993.html?src=rss</link>
      <pubDate>Tue, 17 Feb 2026 10:29:13 +0000</pubDate>
      <guid isPermaLink="false">c3ddda8a-0780-419d-bb63-3ddde3fc977d</guid>
      <description>Don&#8217;t expect the Steam Deck to be easier to get anytime soon. Valve has posted a notice on the Steam Deck page with a warning that the handheld gaming console &#8220;may be out of stock intermittently&#8221; in certain regions &#8220;due to memory and storage shortages.&#8221; The company also reiterated that the more affordable Steam Deck LCD is no longer in production and will no longer be available once stocks run out. Valve started phasing out the LCD console back in December, which means the OLED handhelds are now the only choice for gamers who want to get a Steam Deck. The company&#8217;s notice comes after it comple...</description>
    </item>
    <item>
      <title>Cyberattaque contre OpenClaw&#160;: un virus cherche &#224; voler les donn&#233;es des utilisateurs, c&#8217;est une premi&#232;re</title>
      <link>https://www.01net.com/actualites/cyberattaque-contre-openclaw-virus-cherche-voler-donnees-utilisateurs-premiere.html</link>
      <pubDate>Tue, 17 Feb 2026 10:11:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326305</guid>
      <description>OpenClaw, l'IA autonome open source qui s&#233;duit les bidouilleurs, est d&#233;sormais dans le viseur des cybercriminels. Les chercheurs d'Hudson Rock viennent de r&#233;v&#233;ler le premier cas av&#233;r&#233; de vol de donn&#233;es de configuration de l'agent autonome. Les pirates ne visent plus seulement vos mots de passe, mais l'int&#233;gralit&#233; de votre identit&#233; num&#233;rique par le biais des agents d'IA....</description>
    </item>
    <item>
      <title>Sauvegarde automatique des fichiers Android : Google pr&#233;pare un backup intelligent du dossier T&#233;l&#233;chargements</title>
      <link>https://www.frandroid.com/marques/google/2979717_sauvegarde-automatique-des-fichiers-android-google-prepare-un-backup-intelligent-du-dossier-telechargements</link>
      <pubDate>Tue, 17 Feb 2026 10:05:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2979717_sauvegarde-automatique-des-fichiers-android-google-prepare-un-backup-intelligent-du-dossier-telechargements</guid>
      <description>
Android va prochainement proposer une nouvelle fonction de sauvegarde automatique des fichiers locaux de l&#8217;appareil vers Google Drive, centr&#233;e sur le dossier &#171; T&#233;l&#233;chargements &#187;, via une mise &#224; jour de Google Play services (version 26.06) class&#233;e dans la cat&#233;gorie &#171; Utilities &#187;.
</description>
    </item>
    <item>
      <title>Alors que la p&#233;nurie bat son plein, Darty retire pr&#232;s de 20 % au prix de ce SSD de 2 To avec dissipateur</title>
      <link>https://www.frandroid.com/bons-plans/2979475_alors-que-la-penurie-bat-son-plein-darty-retire-pres-de-20-au-prix-de-ce-ssd-de-2-to-avec-dissipateur</link>
      <pubDate>Tue, 17 Feb 2026 10:03:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2979475_alors-que-la-penurie-bat-son-plein-darty-retire-pres-de-20-au-prix-de-ce-ssd-de-2-to-avec-dissipateur</guid>
      <description>
Sur le papier, le Lexar Play 2280 est un excellent SSD avec ses 2 To de stockage et son dissipateur thermique, mais il a &#233;t&#233; victime de la flamb&#233;e des prix et est vendu aux alentours de 200 euros. Un co&#251;t que Darty cherche &#224; att&#233;nuer en le proposant &#224; 164,99 euros.
</description>
    </item>
    <item>
      <title>How to watch Benfica vs. Real Madrid online for free</title>
      <link>https://mashable.com/article/benfica-real-madrid-2026-champions-league-live-stream-for-free</link>
      <pubDate>Tue, 17 Feb 2026 10:01:44 +0000</pubDate>
      <guid isPermaLink="false">02QWPFzeplVlN7nImfactOv</guid>
      <description>How to watch the Champions League for free. Watch Benfica vs. Real Madrid in the Champions League for free from anywhere in the world.</description>
    </item>
    <item>
      <title>The best noise-canceling headphones for 2026</title>
      <link>https://www.engadget.com/audio/headphones/best-noise-canceling-headphones-130029881.html?src=rss</link>
      <pubDate>Tue, 17 Feb 2026 10:01:27 +0000</pubDate>
      <guid isPermaLink="false">5de7a513-2989-4305-b9a9-0cf68ac17136</guid>
      <description>Noise is hard to escape, whether it&#8217;s the hum of traffic, the buzz of a busy office or the neighbor&#8217;s lawn mower starting up right when you need to focus. That&#8217;s where noise-canceling headphones earn their keep. A good pair doesn&#8217;t just quiet the world around you, it creates a pocket of calm so you can actually enjoy your music, podcasts or peace and quiet.Modern noise-canceling headphones have come a long way, combining powerful ANC with clearer sound, longer battery life and smarter features like adaptive modes and multipoint connectivity. Some emphasize comfort for long flights, while other...</description>
    </item>
    <item>
      <title>Because of AI, Western Digital Hard Drives Are Sold Out</title>
      <link>https://gizmodo.com/because-of-ai-western-digital-hard-drives-are-sold-out-2000722591</link>
      <pubDate>Tue, 17 Feb 2026 10:00:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000722591</guid>
      <description>Thanks to data center demands, Western Digital has committed all of its HDDs for at least the rest of the year.</description>
    </item>
    <item>
      <title>A Waymo vehicle hit a child. What can we learn from the incident?</title>
      <link>https://www.fastcompany.com/91491273/waymo-vehicle-hit-a-child-what-can-we-learn-from-the-incident</link>
      <pubDate>2026-02-17T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91491273/waymo-vehicle-hit-a-child-what-can-we-learn-from-the-incident</guid>
      <description>Accidents like this provide a lens through which to improve both human and robot driving&#8212;and even save lives.
On January 23rd, outside an elementary school in Santa Monica, California, a Waymo vehicle hit a child.</description>
    </item>
    <item>
      <title>Turn ideas into a book faster with Aivolut AI Book Creator for $118.99</title>
      <link>https://mashable.com/article/feb-17-aivolut-ai-book-creator-starter-plan-lifetime-subscription</link>
      <pubDate>Tue, 17 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01RL1YHjHtPBzrjr6ipx9Ew</guid>
      <description>Aivolut AI Book Creator lifetime Starter Plan is on sale for $118.99 and helps users plan, write, and prep books for Amazon KDP with AI-assisted long-form drafting.</description>
    </item>
    <item>
      <title>Get this rare $410 MacBook Pro deal while supplies last</title>
      <link>https://mashable.com/article/feb-17-apple-macbook-pro-i5-2ghz-2020-16gb-ram-512gb</link>
      <pubDate>Tue, 17 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00o8qzDlvdMx3sF0hRlGPT8</guid>
      <description>This powerful MacBook Pro can be yours for only $409.97 (reg. $1,580) now through Feb. 22.</description>
    </item>
    <item>
      <title>How to watch the 2026 winter sports ice hockey online for free</title>
      <link>https://mashable.com/article/ice-hockey-winter-sports-2026-live-stream-for-free</link>
      <pubDate>Tue, 17 Feb 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">04ZvvdyyYFyxIAfGHusCzEP</guid>
      <description>How to watch ice hockey for free. Live stream the 2026 winter sports ice hockey for free from anywhere in the world.</description>
    </item>
    <item>
      <title>Adopting AI is a major priority for businesses - but employees are falling behind on education</title>
      <link>https://www.techradar.com/pro/security/adopting-ai-is-a-major-priority-for-businesses-but-employees-are-falling-behind-on-education</link>
      <pubDate>Tue, 17 Feb 2026 09:59:53 +0000</pubDate>
      <guid isPermaLink="false">CRLGhbDs4ERAfpdyzLL9Fi</guid>
      <description>All worker types, including CEOs, are showing a lack of readiness when it comes to using AI in cybersecurity.</description>
    </item>
    <item>
      <title>AI models can&#8217;t fully understand security &#8211; and they never will</title>
      <link>https://www.techradar.com/pro/ai-models-cant-fully-understand-security-and-they-never-will</link>
      <pubDate>Tue, 17 Feb 2026 09:55:52 +0000</pubDate>
      <guid isPermaLink="false">QxzNo8L9NUofkcYSTWSnWg</guid>
      <description>Despite the hype around AI-assisted coding, research shows LLMs only choose secure code 55% of the time, proving there are fundamental limitations to their use.</description>
    </item>
    <item>
      <title>How to watch the Champions League online for free</title>
      <link>https://mashable.com/article/champions-league-live-stream-for-free</link>
      <pubDate>Tue, 17 Feb 2026 09:54:32 +0000</pubDate>
      <guid isPermaLink="false">06UZyU2WoL3hXgN8M6T7yLx</guid>
      <description>How to watch the Champions League for free. Live stream the 2025-26 Champions League for free from anywhere in the world.</description>
    </item>
    <item>
      <title>C&#226;bles sous-marins&#160;: avec 347 millions d&#8217;euros d&#8217;investissements, l&#8217;Europe peut-elle sortir la t&#234;te de l&#8217;eau&#160;?</title>
      <link>https://www.01net.com/actualites/cables-sous-marins-avec-347-millions-deuros-dinvestissements-leurope-peut-elle-sortir-la-tete-de-leau.html</link>
      <pubDate>Tue, 17 Feb 2026 09:46:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1326172</guid>
      <description>Apr&#232;s une s&#233;rie de sabotage notamment en mer Baltique, l'Union europ&#233;enne a annonc&#233; investir 347 millions d'euros qui seront fl&#233;ch&#233;s vers de nouveaux c&#226;bles jug&#233;s prioritaires, le renforcement de nos capacit&#233;s de r&#233;paration, et l'achat d'outils de surveillance des fonds marins. Ces mesures, attendues, seront-elles suffisantes face aux &#171;&#160;menaces &#187; qui p&#232;sent sur &#171; ces infrastructures critiques, essentielles &#224; notre souverainet&#233; technologique &#187; ?...</description>
    </item>
    <item>
      <title>Tesla Model Y : comment le SUV &#233;lectrique tombe sous les 30 000 &#8364; gr&#226;ce &#224; cette nouvelle offre</title>
      <link>https://www.frandroid.com/marques/tesla/2979513_tesla-model-y-comment-le-suv-electrique-tombe-sous-les-30-000-e-grace-a-cette-nouvelle-offre</link>
      <pubDate>Tue, 17 Feb 2026 09:43:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2979513_tesla-model-y-comment-le-suv-electrique-tombe-sous-les-30-000-e-grace-a-cette-nouvelle-offre</guid>
      <description>
Tesla veut relancer les ventes de sa Model Y et propose une offre tr&#232;s all&#233;chante. La voiture &#233;lectrique est d&#233;sormais accessible &#224; moins de 30 000 euros, gr&#226;ce &#224; une offre de reprise g&#233;n&#233;reuse.
</description>
    </item>
  </channel>
</rss>
