<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Mon, 05 Jan 2026 09:37:31 GMT</lastBuildDate>
    <item>
      <title>L&#8217;OLED RGB est la technologie &#224; surveiller sur les &#233;crans PC en 2026, mais &#231;a change quoi ?</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/ecran-pc/2927239_loled-rgb-est-la-technologie-a-surveiller-sur-les-ecrans-pc-en-2026-mais-ca-change-quoi</link>
      <pubDate>Mon, 05 Jan 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/ecran-pc/2927239_loled-rgb-est-la-technologie-a-surveiller-sur-les-ecrans-pc-en-2026-mais-ca-change-quoi</guid>
      <description>
Vous connaissez le probl&#232;me des &#233;crans OLED sur PC. C'est magnifique pour jouer, mais d&#232;s qu'il faut taper un mail, le texte bave et les contours sont flous. C'est fini. Au CES 2026, LG et Samsung basculent enfin vers l'OLED RGB. Asus d&#233;gaine le premier avec un &#233;cran qui promet de r&#233;concilier Excel et Cyberpunk.
</description>
    </item>
    <item>
      <title>Nouvelle fuite de donn&#233;es en France&#160;: Doctolib d&#233;ment &#234;tre responsable du vol de 150&#160;000 dossiers de patients</title>
      <link>https://www.01net.com/actualites/fuite-donnees-doctolib-informations-milliers-francais-compromises.html</link>
      <pubDate>Mon, 05 Jan 2026 09:29:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318023</guid>
      <description>Doctolib s'est retrouv&#233; au c&#339;ur d'une nouvelle fuite de donn&#233;es ce week-end. Plus de 150 000 fiches patients issues de l&#8217;H&#244;pital priv&#233; de la Miotte et d&#8217;un cabinet d&#8217;ophtalmologie de Sallanches circulent sur le dark web. Les deux &#233;tablissements passaient par Doctolib pour permettre aux patients de prendre rendez-vous. Interrog&#233; par 01net, Doctolib d&#233;ment fermement toute violation et pr&#233;cise que les donn&#233;es n'ont pas &#233;t&#233; vol&#233;es sur ses serveurs....</description>
    </item>
    <item>
      <title>Fini la corv&#233;e du rangement avant l&#8217;aspirateur&#160;? Narwal pr&#233;sente le Flow 2</title>
      <link>https://www.01net.com/actualites/fini-corvee-rangement-avant-aspirateur-narwal-presente-flow-2.html</link>
      <pubDate>Mon, 05 Jan 2026 09:27:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318047</guid>
      <description>Le Narwal Flow 2, fra&#238;chement d&#233;voil&#233; au CES 2026, entend r&#233;soudre l'un des d&#233;fauts r&#233;currents des robots : aspirer des petits objets ou des c&#226;bles, qui n&#233;cessitent souvent de voler &#224; leur secours.</description>
    </item>
    <item>
      <title>Pure Fibre de B&amp;YOU : tout ce qu&#8217;il faut savoir sur l&#8217;offre 8 Gb/s pas ch&#232;re de Bouygues Telecom</title>
      <link>https://www.frandroid.com/marques/bouygues-telecom/2546819_pure-fibre-de-byou-tout-ce-quil-faut-savoir-sur-loffre-8-gb-s-pas-chere-de-bouygues-telecom</link>
      <pubDate>Mon, 05 Jan 2026 09:26:36 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/bouygues-telecom/2546819_pure-fibre-de-byou-tout-ce-quil-faut-savoir-sur-loffre-8-gb-s-pas-chere-de-bouygues-telecom</guid>
      <description>
Malgr&#233; une l&#233;g&#232;re augmentation de son prix d&#233;but 2026, la Pure Fibre de B&amp;YOU reste l'un des forfaits internet les plus populaires du march&#233;. Une offre single-play avec un routeur premium (d&#233;bit 8 Gb/s, Wi-Fi 7 tri-bande...) pour un prix d'entr&#233;e de gamme. Voici tout ce qu'il faut savoir sur la Pure Fibre.
</description>
    </item>
    <item>
      <title>&#199;a y est, Tesla a commenc&#233; sa production de son nouveau Cybercab</title>
      <link>https://www.frandroid.com/marques/tesla/2927299_ca-y-est-tesla-a-commence-sa-production-de-son-nouveau-cybercab</link>
      <pubDate>Mon, 05 Jan 2026 09:17:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2927299_ca-y-est-tesla-a-commence-sa-production-de-son-nouveau-cybercab</guid>
      <description>
Le constructeur am&#233;ricain Tesla vient de d&#233;voiler sa vid&#233;o r&#233;capitulative de l&#8217;ann&#233;e 2025. Et la marque en profite pour confirmer le d&#233;marrage de la production de sa prochaine voiture &#233;lectrique : le Cybercab autonome.
</description>
    </item>
    <item>
      <title>Voici le Honor Magic 8 Lite&#160;: il mise tout sur la robustesse et l&#8217;autonomie</title>
      <link>https://www.01net.com/actualites/voici-le-honor-magic-8-lite-il-mise-tout-sur-la-robustesse-et-lautonomie.html</link>
      <pubDate>Mon, 05 Jan 2026 09:15:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317873</guid>
      <description>Honor annonce la sortie de son nouveau smartphone, le Magic 8 Lite. Gr&#226;ce &#224; lui, la marque souhaite proposer un smartphone plus r&#233;sistant et avec plus d'autonomie sur le segment du milieu de gamme &#224; l'aide d'une batterie en silicium-carbone, une certification IP69K et la promesse de mise &#224; jour logiciel pendant 6 ans.</description>
    </item>
    <item>
      <title>Prix des smartphones et des TV Samsung : une hausse &#171;&#160;in&#233;vitable&#160;&#187; confirm&#233;e par le patron</title>
      <link>https://www.frandroid.com/marques/samsung/2927417_prix-des-smartphones-samsung-une-hausse-inevitable-confirmee-par-le-patron</link>
      <pubDate>Mon, 05 Jan 2026 09:03:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2927417_prix-des-smartphones-samsung-une-hausse-inevitable-confirmee-par-le-patron</guid>
      <description>
Samsung a perdu sa couronne face &#224; Apple en 2025, et &#231;a ne leur pla&#238;t pas. La r&#233;ponse ? Une alliance massive avec Google pour propulser Gemini sur 800 millions d'appareils. Mais attendez avant de sortir la carte bleue. TM Roh pr&#233;vient : avec la p&#233;nurie de m&#233;moire qui frappe l'industrie, une hausse des prix est d&#233;sormais "in&#233;vitable".
</description>
    </item>
    <item>
      <title>Les Redmi Note 15 sont l&#224; : que valent les champions du rapport qualit&#233;-prix de Xiaomi en 2026&#160;?</title>
      <link>https://www.01net.com/actualites/les-redmi-note-15-sont-la-que-valent-les-champions-du-rapport-qualite-prix-de-xiaomi-en-2026.html</link>
      <pubDate>Mon, 05 Jan 2026 09:00:52 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317876</guid>
      <description>Xiaomi officialise une toute nouvelle g&#233;n&#233;ration de smartphones Redmi avec la gamme Redmi Note 15. Compos&#233;e de plusieurs mod&#232;les 4G et 5G, cette gamme, qui repr&#233;sente pr&#232;s de 50 % des ventes de la marque en France, entend poursuivre la recette qui a fait le succ&#232;s de Redmi, un excellent rapport qualit&#233;-prix.</description>
    </item>
    <item>
      <title>Prise en main du Xiaomi Redmi Note 15 5G&#160;: le futur best-seller de 2026 est (peut-&#234;tre) l&#224;</title>
      <link>https://www.01net.com/actualites/prise-en-main-du-xiaomi-redmi-note-15-5g-le-futur-best-seller-de-2026-est-peut-etre-la.html</link>
      <pubDate>Mon, 05 Jan 2026 09:00:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317966</guid>
      <description>Le nouveau Redmi Note 15 5G de Xiaomi mise sur la finesse, une robustesse &#171; Titan &#187; et l'IA pour s'imposer comme la r&#233;f&#233;rence de l'entr&#233;e de gamme en 2026.</description>
    </item>
    <item>
      <title>New BBC crime drama Lynley is 'completely different' to its predecessor &#8212; but don't rule out other detective crossovers</title>
      <link>https://www.techradar.com/streaming/entertainment/new-bbc-crime-drama-lynley-is-completely-different-to-its-predecessor-but-dont-rule-out-other-detective-crossovers</link>
      <pubDate>Mon, 05 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">SChpd86AeuwikDj8jTXhwg</guid>
      <description>If you remember The Inspector Lynley Mysteries from the early 2000s, the BBC's new adaptation is a world away. But that doesn't mean it can't have other detective crossovers.</description>
    </item>
    <item>
      <title>Prise en main du Redmi Note 15 5G : Xiaomi veut un smartphone durable et pas cher</title>
      <link>https://www.frandroid.com/marques/2918381_prise-en-main-du-redmi-note-15-5g-xiaomi-veut-un-smartphone-durable-et-pas-cher</link>
      <pubDate>Mon, 05 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2918381_prise-en-main-du-redmi-note-15-5g-xiaomi-veut-un-smartphone-durable-et-pas-cher</guid>
      <description>
Xiaomi renouvelle son milieu de gamme phare avec le Redmi Note 15 5G. Au programme : une batterie utilisant une technologie Silicon-Carbone pour allier finesse et endurance, un &#233;cran AMOLED tr&#232;s lumineux et une promesse de durabilit&#233; logicielle &#233;tendue.
</description>
    </item>
    <item>
      <title>Prise en main du Honor Magic 8 Lite : le smartphone increvable qui ne craint ni l&#8217;eau ni les chutes</title>
      <link>https://www.frandroid.com/marques/honor/2922339_prise-en-main-du-honor-magic-8-lite-le-smartphone-increvable-qui-ne-craint-ni-leau-ni-les-chutes</link>
      <pubDate>Mon, 05 Jan 2026 09:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/honor/2922339_prise-en-main-du-honor-magic-8-lite-le-smartphone-increvable-qui-ne-craint-ni-leau-ni-les-chutes</guid>
      <description>
Honor renforce son offre de milieu de gamme, avec ce Magic 8 Lite, qui est d&#233;sormais totalement &#233;tanche et - surtout -  s'annonce beaucoup plus endurant, gr&#226;ce &#224; une batterie de tr&#232;s grande capacit&#233;.
</description>
    </item>
    <item>
      <title>L&#8217;&#233;conomiseur d&#8217;&#233;cran ultime est arriv&#233; : il fait tourner DOOM tout seul pour sauver votre dalle OLED</title>
      <link>https://www.frandroid.com/marques/microsoft/2927419_leconomiseur-decran-ultime-est-arrive-il-fait-tourner-doom-tout-seul-pour-sauver-votre-dalle-oled</link>
      <pubDate>Mon, 05 Jan 2026 08:59:51 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2927419_leconomiseur-decran-ultime-est-arrive-il-fait-tourner-doom-tout-seul-pour-sauver-votre-dalle-oled</guid>
      <description>
Un d&#233;veloppeur a mis au point un &#233;conomiseur d&#8217;&#233;cran permettant de lancer DOOM avec une astuce pour &#233;viter de marquer durablement les &#233;crans OLED.
</description>
    </item>
    <item>
      <title>Flutterwave buys Nigeria&#8217;s Mono in rare African fintech exit</title>
      <link>https://techcrunch.com/2026/01/05/flutterwave-buys-nigerias-mono-in-rare-african-fintech-exit/</link>
      <pubDate>Mon, 05 Jan 2026 08:55:28 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3079500</guid>
      <description>Africa&#8217;s largest fintech company, Flutterwave, has acquired Nigerian open banking startup Mono in an all-stock deal valued between $25 million and $40 million, according to people familiar with the transaction. The acquisition brings together two of Africa&#8217;s leading fintech infrastructure companies. Flutterwave operates one of the continent&#8217;s widest payments networks, while Mono, often described as [&#8230;]...</description>
    </item>
    <item>
      <title>Plaud NotePin S : le dictaphone IA s&#8217;am&#233;liore avec un bouton physique, plus d&#8217;accessoires et une app Mac</title>
      <link>https://www.frandroid.com/produits-android/2927223_plaud-notepin-s-le-dictaphone-ia-sameliore-avec-un-bouton-physique-plus-daccessoires-et-une-app-mac</link>
      <pubDate>Mon, 05 Jan 2026 08:45:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/2927223_plaud-notepin-s-le-dictaphone-ia-sameliore-avec-un-bouton-physique-plus-daccessoires-et-une-app-mac</guid>
      <description>
La cat&#233;gorie des "AI Pins" a pris une sacr&#233;e claque apr&#232;s le fiasco d'Humane. Mais il y a une exception : Plaud. Pas de promesses d&#233;lirantes, juste un enregistreur qui transcrit bien. Ils reviennent au CES 2026 avec le NotePin S. La grande nouveaut&#233; ? Un bouton. Oui, un simple bouton. Et &#231;a change tout.
</description>
    </item>
    <item>
      <title>C&#8217;est officiel, BYD a d&#233;tr&#244;n&#233; Tesla au classement des meilleures ventes de voitures &#233;lectriques</title>
      <link>https://www.frandroid.com/marques/byd/2927287_cest-officiel-byd-a-detrone-tesla-au-classement-des-meilleures-ventes-de-voitures-electriques</link>
      <pubDate>Mon, 05 Jan 2026 08:44:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/byd/2927287_cest-officiel-byd-a-detrone-tesla-au-classement-des-meilleures-ventes-de-voitures-electriques</guid>
      <description>
Pour la 2&#232;me ann&#233;e cons&#233;cutive, Tesla confirme une baisse de ses ventes de voitures &#233;lectriques. La firme am&#233;ricaine se laisse m&#234;me d&#233;passer par BYD, qui confirme son statut de leader mondial.
</description>
    </item>
    <item>
      <title>What the post-quantum shift means for your security strategy</title>
      <link>https://www.techradar.com/pro/what-the-post-quantum-shift-means-for-your-security-strategy</link>
      <pubDate>Mon, 05 Jan 2026 08:43:21 +0000</pubDate>
      <guid isPermaLink="false">W4b5JCEfwyUuyqKApTwU3V</guid>
      <description>Quantum computing threatens today&#8217;s encryption. Why organizations must adopt hybrid, post-quantum TLS now.</description>
    </item>
    <item>
      <title>Samsung First Look: See the Galaxy Z TriFold up close in this CES 2026 video</title>
      <link>https://mashable.com/article/ces-2026-samsung-first-look-galaxy-z-trifold</link>
      <pubDate>Mon, 05 Jan 2026 08:32:29 +0000</pubDate>
      <guid isPermaLink="false">00yEasjCYRBMB9dmBxkUgg9</guid>
      <description>The Samsung Galaxy Z TriFold doesn't have a U.S. release date, but Mashable went hands-on with the device at CES 2026.</description>
    </item>
    <item>
      <title>Boulanger met en promo ce pack Arlo complet pour l&#8217;ext&#233;rieur (2 cam&#233;ras 2K + floodlight avec projecteur puissant)</title>
      <link>https://www.frandroid.com/bons-plans/2925383_boulanger-met-en-promo-ce-pack-arlo-complet-pour-lexterieur-2-cameras-2k-floodlight-avec-projecteur-puissant</link>
      <pubDate>Mon, 05 Jan 2026 08:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2925383_boulanger-met-en-promo-ce-pack-arlo-complet-pour-lexterieur-2-cameras-2k-floodlight-avec-projecteur-puissant</guid>
      <description>
Dans la gamme de cam&#233;ras de surveillance d'Arlo, on trouve notamment la Floodlight et l'Essential 3, deux mod&#232;les 2K &#233;quip&#233;s de projecteurs puissants. Actuellement, on les trouve dans un pack &#224; 319,99 euros au lieu de 399,99 euros chez Boulanger.
</description>
    </item>
    <item>
      <title>Test du Hisense M2 Pro : le projecteur lifestyle Ultra HD Dolby Vision qui en met plein les yeux</title>
      <link>https://www.frandroid.com/marques/hisense/2923347_test-du-hisense-m2-pro-le-projecteur-lifestyle-ultra-hd-dolby-vision-qui-en-met-plein-les-yeux</link>
      <pubDate>Mon, 05 Jan 2026 08:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/hisense/2923347_test-du-hisense-m2-pro-le-projecteur-lifestyle-ultra-hd-dolby-vision-qui-en-met-plein-les-yeux</guid>
      <description>
Le Hisense M2 Pro est un vid&#233;oprojecteur au format compact embarquant des technologies de pointe pour offrir une exp&#233;rience home cin&#233;ma des plus abouties jusqu&#8217;&#224; 200 pouces en diagonale. Nous avons tout pass&#233; en revue dans ce test aussi complet que possible pour vous permettre de vous faire votre propre avis.
</description>
    </item>
    <item>
      <title>Belkin a &#171; pli&#233; le game &#187; du MagSafe : une batterie sur laquelle on colle d&#8217;autres accessoires MagSafe</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2927393_belkin-a-plie-le-game-du-magsafe-une-batterie-sur-laquelle-on-colle-dautres-accessoires-magsafe</link>
      <pubDate>Mon, 05 Jan 2026 08:24:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2927393_belkin-a-plie-le-game-du-magsafe-une-batterie-sur-laquelle-on-colle-dautres-accessoires-magsafe</guid>
      <description>
Il fallait y penser. Belkin profite du CES 2026 pour pr&#233;senter une batterie externe MagSafe qui poss&#232;de... ses propres aimants MagSafe au dos. Le but ? Empiler votre porte-cartes ou votre support par-dessus la batterie pendant qu'elle charge votre iPhone. C'est de l'Inception d'accessoires. Et &#224; 100 dollars, c'est aussi un petit luxe.
</description>
    </item>
    <item>
      <title>Govee d&#233;voile 3 nouvelles lampes Matter au CES 2026, dont un &#171;&#160;puit de lumi&#232;re&#160;&#187; artificiel</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/2927355_govee-devoile-3-nouvelles-lampes-matter-au-ces-2026-dont-un-puit-de-lumiere-artificiel</link>
      <pubDate>Mon, 05 Jan 2026 08:18:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/2927355_govee-devoile-3-nouvelles-lampes-matter-au-ces-2026-dont-un-puit-de-lumiere-artificiel</guid>
      <description>
Vous trouviez qu'il manquait de l'intelligence artificielle dans votre plafonnier ? Non ? Govee l'a fait quand m&#234;me. Le fabricant chinois profite du CES pour d&#233;voiler sa nouvelle gamme, dont la Floor Lamp 3 et ses promesses colorim&#233;triques absurdes. Mais le produit qui nous pla&#238;t, c'est peut-&#234;tre ce faux puit de lumi&#232;re ultra-lumineux.
</description>
    </item>
    <item>
      <title>Clicks Power Keyboard : ce clavier MagSafe transforme n&#8217;importe quel smartphone en BlackBerry</title>
      <link>https://www.frandroid.com/produits-android/smartphone/2927327_clicks-power-keyboard-ce-clavier-magsafe-transforme-nimporte-quel-smartphone-en-blackberry</link>
      <pubDate>Mon, 05 Jan 2026 08:09:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/smartphone/2927327_clicks-power-keyboard-ce-clavier-magsafe-transforme-nimporte-quel-smartphone-en-blackberry</guid>
      <description>
Il y a deux ans, Clicks nous faisait sourire avec ses coques-claviers immenses. Aujourd'hui, la marque fond&#233;e par le youtubeur MrMobile passe aux choses s&#233;rieuses. Voici le Power Keyboard : un clavier physique r&#233;tro&#233;clair&#233; cach&#233; dans une batterie MagSafe. Compatible iPhone et Android.
</description>
    </item>
    <item>
      <title>Samsung &#233;toffe ses gammes de TV OLED avec les s&#233;ries S99H, S95H, S90H et S85H</title>
      <link>https://www.frandroid.com/marques/samsung/2927301_samsung-etoffe-ses-gammes-de-tv-oled-avec-les-series-s99h-s95h-s90h-et-s85h</link>
      <pubDate>Mon, 05 Jan 2026 08:03:34 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/samsung/2927301_samsung-etoffe-ses-gammes-de-tv-oled-avec-les-series-s99h-s95h-s90h-et-s85h</guid>
      <description>
Lors de son &#233;v&#232;nement First Look au CES 2026 &#224; Las Vegas, Samsung a enfin officialis&#233; les principales caract&#233;ristiques des nouvelles s&#233;ries de TV OLED et oh surprise, il y en a 4 dont une ayant pour vocation d&#8217;&#234;tre accroch&#233;e au mur.
</description>
    </item>
    <item>
      <title>Les v&#233;los &#233;lectriques vol&#233;s resteront marqu&#233;s &#224; jamais&#160;: la promesse du nouveau syst&#232;me antivol de Bosch</title>
      <link>https://www.01net.com/actualites/les-velos-electriques-voles-resteront-marques-a-jamais-la-promesse-du-nouveau-systeme-antivol-de-bosch.html</link>
      <pubDate>Mon, 05 Jan 2026 08:00:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1317960</guid>
      <description>Un marquage ind&#233;l&#233;bile qui signale un v&#233;lo vol&#233; ? Voici la derni&#232;re bonne id&#233;e de Bosch pour renforcer la s&#233;curit&#233; des v&#233;los &#233;lectriques r&#233;duire leurs vols.</description>
    </item>
  </channel>
</rss>
