<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 30 Jan 2026 07:45:40 GMT</lastBuildDate>
    <item>
      <title>La derni&#232;re IA de Google vous permet de cr&#233;er des copies de Zelda Breath of the Wild en plus moche, mais le potentiel est l&#224;</title>
      <link>https://www.frandroid.com/marques/google/2960841_la-derniere-ia-de-google-vous-permet-de-creer-des-copies-de-zelda-breath-of-the-wild-en-plus-moche-mais-le-potentiel-est-la</link>
      <pubDate>Fri, 30 Jan 2026 07:43:28 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2960841_la-derniere-ia-de-google-vous-permet-de-creer-des-copies-de-zelda-breath-of-the-wild-en-plus-moche-mais-le-potentiel-est-la</guid>
      <description>
D&#233;voil&#233;e l&#8217;ann&#233;e derni&#232;re, l&#8217;intelligence artificielle g&#233;n&#233;rative Genie de Google va &#234;tre mise &#224; disposition du grand public. Pour le moment, l&#8217;outil manque d&#8217;imagination et d&#8217;optimisation, mais les promesses techniques sont l&#224;.
</description>
    </item>
    <item>
      <title>Mini enceinte, mini prix : la JBL Go 4 chute sous les 40 &#8364; pendant les soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2960457_mini-enceinte-mini-prix-la-jbl-go-4-chute-sous-les-40-e-pendant-les-soldes-dhiver</link>
      <pubDate>Fri, 30 Jan 2026 07:36:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2960457_mini-enceinte-mini-prix-la-jbl-go-4-chute-sous-les-40-e-pendant-les-soldes-dhiver</guid>
      <description>
Compacte, solide, &#233;tanche et suffisamment performante, la JBL Go 4 est une enceinte Bluetooth id&#233;ale &#224; emporter partout. En cette fin de soldes d'hiver, Amazon et Boulanger la proposent &#224; 38 euros au lieu de 49,99 euros.
</description>
    </item>
    <item>
      <title>Anthropic vis&#233; par une nouvelle plainte &#224; 3 milliards de dollars pour violation du droit d&#8217;auteur</title>
      <link>https://www.01net.com/actualites/anthropic-vise-par-une-nouvelle-plainte-a-3-milliards-de-dollars-pour-violation-du-droit-dauteur.html</link>
      <pubDate>Fri, 30 Jan 2026 07:26:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323384</guid>
      <description>&#192; chaque jour (ou presque) sa plainte contre une entreprise de l'IA. Une coalition d'&#233;diteurs de musique poursuit Anthropic pour violation du droit d'auteur. Les plaignants r&#233;clament plus de 3 milliards de dollars de dommages pour l'exploitation sans autorisation de 20&#160;000 chansons.</description>
    </item>
    <item>
      <title>Votre Pixel Tablet vient de prendre de la valeur aujourd&#8217;hui, on vous explique pourquoi</title>
      <link>https://www.frandroid.com/marques/google/2960813_votre-pixel-tablet-vient-de-prendre-de-la-valeur-aujourdhui-on-vous-explique-pourquoi</link>
      <pubDate>Fri, 30 Jan 2026 07:19:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2960813_votre-pixel-tablet-vient-de-prendre-de-la-valeur-aujourdhui-on-vous-explique-pourquoi</guid>
      <description>
C'est une annonce que l'on n'attendait pas. Google a d&#233;cid&#233; de revoir sa politique de mise &#224; jour pour sa Pixel Tablet. L'appareil b&#233;n&#233;ficiera finalement d'un support &#233;tendu jusqu'en juin 2028.
</description>
    </item>
    <item>
      <title>&#171; Saisir et d&#233;truire les v&#233;los et kits de conversion non conformes &#187; : un important projet de loi autour des v&#233;los &#233;lectriques examin&#233; au Royaume-Uni</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2960809_saisir-et-detruire-les-velos-et-kits-de-conversion-non-conformes-un-important-projet-de-loi-autour-des-velos-electriques-examine-au-royaume-uni</link>
      <pubDate>Fri, 30 Jan 2026 07:10:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2960809_saisir-et-detruire-les-velos-et-kits-de-conversion-non-conformes-un-important-projet-de-loi-autour-des-velos-electriques-examine-au-royaume-uni</guid>
      <description>
D&#233;pos&#233; le 27 janvier 2026 au Parlement britannique, un projet de loi port&#233; par la d&#233;put&#233;e travailliste Julie Minns entend renforcer la lutte contre les v&#233;los &#233;lectriques ill&#233;gaux et les kits de conversion non conformes.
</description>
    </item>
    <item>
      <title>Apple et Samsung seuls au monde&#160;: ces 10 smartphones sont les plus vendus dans le monde en 2025</title>
      <link>https://www.01net.com/actualites/apple-et-samsung-seuls-au-monde-ces-10-smartphones-sont-les-plus-vendus-dans-le-monde-en-2025.html</link>
      <pubDate>Fri, 30 Jan 2026 07:00:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323379</guid>
      <description>On prend les m&#234;mes et on recommence. Apple et Samsung se sont partag&#233; le top 10 des plus fortes ventes de smartphones l'an dernier. Le constructeur am&#233;ricain s'est arrog&#233; la part du lion.</description>
    </item>
    <item>
      <title>UCI Cyclocross World Championships 2026 Free Streams: How to watch online from anywhere in the world</title>
      <link>https://www.techradar.com/how-to-watch/cycling/uci-cyclocross-world-championships-2026-free-streams-anywhere</link>
      <pubDate>Fri, 30 Jan 2026 07:00:00 +0000</pubDate>
      <guid isPermaLink="false">5dAwhLpXEh8u9CxJAQncff</guid>
      <description>With the Cyclocross World cup finished it's time for the main event, the World Championships which this year come to us from Hulst in the Netherlands.</description>
    </item>
    <item>
      <title>These three toxic power moves kill meetings</title>
      <link>https://www.fastcompany.com/91476500/these-three-toxic-power-moves-kill-meetings</link>
      <pubDate>2026-01-30T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91476500/these-three-toxic-power-moves-kill-meetings</guid>
      <description>In a new book, organizational behavior expert Rebecca Hinds lays out what they are and what you can do about them.
Meetings are breeding grounds for three highly toxic power moves:</description>
    </item>
    <item>
      <title>The surprising reason why women are using AI less often than men</title>
      <link>https://www.fastcompany.com/91482896/the-surprising-reason-women-are-snubbing-ai</link>
      <pubDate>2026-01-30T07:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91482896/the-surprising-reason-women-are-snubbing-ai</guid>
      <description>A growing body of research shows that women&#8217;s feelings about AI are more likely to affect their behavior than men&#8217;s, with one concern standing out in particular.
A decade ago, when Claire Burgi moved to New York City, she decided to cut meat out of her diet. The 33-year-old actor and audiobook narrator, who lives in Queens, grew up in California, where she&#8217;d seen the effects of climate change firsthand. She knew that meat consumption was a major driver of greenhouse gas emissions and that vegetarianism was a way to help conserve resources and reduce pollution....</description>
    </item>
    <item>
      <title>Face &#224; une crise historique, le plus grand salon v&#233;lo d&#8217;Europe pourrait retrouver deux alli&#233;s forts en 2027</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2960791_face-a-une-crise-historique-le-plus-grand-salon-velo-deurope-pourrait-retrouver-deux-allies-forts-en-2027</link>
      <pubDate>Fri, 30 Jan 2026 06:33:04 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2960791_face-a-une-crise-historique-le-plus-grand-salon-velo-deurope-pourrait-retrouver-deux-allies-forts-en-2027</guid>
      <description>
Eurobike, consid&#233;r&#233; comme le plus grand salon v&#233;lo d'Europe, traverse une crise in&#233;dite apr&#232;s le retrait de plusieurs acteurs cl&#233;s du secteur. Entre d&#233;saccords strat&#233;giques, annonces de d&#233;parts et tentatives de dialogue, l&#8217;&#233;dition 2026 s&#8217;annonce comme une &#233;tape de transition pour l&#8217;&#233;v&#233;nement... avant un potentiel retour de deux associations phares. 
...</description>
    </item>
    <item>
      <title>Piratage et arnaques en ligne : cette solution simple prot&#232;ge tous vos appareils [Sponso]</title>
      <link>https://www.frandroid.com/services/vpn/2949187_piratage-et-arnaques-en-ligne-cette-solution-simple-protege-tous-vos-appareils</link>
      <pubDate>Fri, 30 Jan 2026 06:31:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/vpn/2949187_piratage-et-arnaques-en-ligne-cette-solution-simple-protege-tous-vos-appareils</guid>
      <description>
Il existe un moyen simple de se prot&#233;ger contre le tracking et les cybermenaces qui ne co&#251;te pas une fortune. En ce moment, le VPN premium de CyberGhost profite en effet d'une belle remise de 82 %.
</description>
    </item>
    <item>
      <title>01net morning&#160;: aper&#231;u du vid&#233;oprojecteur Xgimi Titan Noir, le forfait 2&#8364; de Free s&#8217;am&#233;liore, l&#8217;amende sal&#233;e de France Travail</title>
      <link>https://www.01net.com/actualites/01net-morning-apercu-du-videoprojecteur-xgimi-titan-noir-le-forfait-2e-de-free-sameliore-lamende-salee-de-france-travail.html</link>
      <pubDate>Fri, 30 Jan 2026 06:30:30 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323386</guid>
      <description>Bonjour &#224; tous, voici la matinale de 01net ! Qu&#8217;avez-vous manqu&#233; hier ? Retrouvez toute l&#8217;actu &#224; connaitre pour d&#233;marrer la journ&#233;e du bon pied !</description>
    </item>
    <item>
      <title>Djokovic vs Sinner Free Streams: How to watch Australian Open 2026 semi-final from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/tennis/novak-djokovic-vs-jannik-sinner-australian-open-2026-semi-final-free</link>
      <pubDate>Fri, 30 Jan 2026 06:30:00 +0000</pubDate>
      <guid isPermaLink="false">tyQgG9iRomFBanfF2tv5CQ</guid>
      <description>Here's how to watch Djokovic vs Sinner in the Australian Open 2026 men's semi-final as the Italian bids for a third successive final.</description>
    </item>
    <item>
      <title>&#171;&#8201;La demande &#233;tait tout bonnement stup&#233;fiante&#8201;&#187;&#160;: comment les iPhone ont absolument domin&#233; le monde du mobile en 2025</title>
      <link>https://www.frandroid.com/marques/apple/2960793_la-demande-etait-tout-bonnement-stupefiante-les-iphone-ont-absolument-domine-le-monde-du-mobile-en-2025</link>
      <pubDate>Fri, 30 Jan 2026 06:28:02 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2960793_la-demande-etait-tout-bonnement-stupefiante-les-iphone-ont-absolument-domine-le-monde-du-mobile-en-2025</guid>
      <description>
Apple vient de d&#233;voiler ses r&#233;sultats trimestriels pour la fin d&#8217;ann&#233;e&#160;2025 et les nouvelles sont excellentes pour la firme. Les iPhone&#160;17 ont explos&#233; les records et des chiffres ind&#233;pendants montrent la domination d&#8217;Apple sur le march&#233;.
</description>
    </item>
    <item>
      <title>Voici l&#8217;astuce pour payer ce forfait 5G de 300 Go moins cher que les autres</title>
      <link>https://www.frandroid.com/services/2960493_voici-lastuce-pour-payer-ce-forfait-5g-de-300-go-moins-cher-que-les-autres</link>
      <pubDate>Fri, 30 Jan 2026 06:20:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/2960493_voici-lastuce-pour-payer-ce-forfait-5g-de-300-go-moins-cher-que-les-autres</guid>
      <description>
Syma Mobile adopte &#224; son tour la strat&#233;gie de l'offre dissimul&#233;e pour retenir les visiteurs ind&#233;cis. Une simple manipulation permet de faire chuter le prix du forfait 300 Go sous la barre des 10 euros.
</description>
    </item>
    <item>
      <title>SpaceX, Tesla et xAI : Elon Musk pr&#233;pare une fusion g&#233;ante de ses entreprises</title>
      <link>https://www.frandroid.com/marques/tesla/2960779_spacex-tesla-et-xai-elon-musk-prepare-une-fusion-geante-de-ses-entreprises</link>
      <pubDate>Fri, 30 Jan 2026 06:13:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/tesla/2960779_spacex-tesla-et-xai-elon-musk-prepare-une-fusion-geante-de-ses-entreprises</guid>
      <description>
Des documents d&#233;pos&#233;s au Nevada r&#233;v&#232;lent qu'Elon Musk pr&#233;pare le terrain pour fusionner ses joyaux : SpaceX, Tesla et l'IA xAI.
</description>
    </item>
    <item>
      <title>U.S. population growth is slowing because of declining immigration. What does it mean for the workforce?</title>
      <link>https://www.fastcompany.com/91483465/u-s-population-growth-is-slowing-because-of-declining-immigration-what-does-it-mean-for-the-workforce</link>
      <pubDate>2026-01-30T06:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91483465/u-s-population-growth-is-slowing-because-of-declining-immigration-what-does-it-mean-for-the-workforce</guid>
      <description>Experts say to expect to see impacts such as higher costs of labor and reduced productivity.
The U.S.&#8217;s population growth is slowing as immigration has declined amid President Donald Trump&#8217;s deportation push and stricter border policies.&#160;</description>
    </item>
    <item>
      <title>Apple ne conna&#238;t pas la crise : record historique, la demande pour l&#8217;iPhone 17 est sans pr&#233;c&#233;dent</title>
      <link>https://www.frandroid.com/marques/apple/2960767_apple-ne-connait-pas-la-crise-record-historique-la-demande-pour-liphone-17-est-sans-precedent</link>
      <pubDate>Fri, 30 Jan 2026 05:59:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/apple/2960767_apple-ne-connait-pas-la-crise-record-historique-la-demande-pour-liphone-17-est-sans-precedent</guid>
      <description>
Port&#233; par un iPhone 17 qui s'arrache comme jamais, Apple a balay&#233; toutes les attentes lors de son dernier trimestre. Entre une r&#233;surrection spectaculaire en Chine et une explosion confirm&#233;e en Inde, Tim Cook n'a pas seulement atteint ses objectifs : il a litt&#233;ralement braqu&#233; les compteurs mondiaux.
</description>
    </item>
  </channel>
</rss>
