<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 15 Feb 2026 19:30:19 GMT</lastBuildDate>
    <item>
      <title>Gettyimages.com Is the Best Website on the Internet Right Now</title>
      <link>https://gizmodo.com/gettyimages-com-is-the-best-website-on-the-internet-right-now-2000722378</link>
      <pubDate>Sun, 15 Feb 2026 19:12:54 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000722378</guid>
      <description>How to have the most fun you can possibly have while the Olympic figure skating events are going on.</description>
    </item>
    <item>
      <title>BenQ says its new monitors will transform work for Mac users - but will it be enough to tempt them away from Apple's own devices?</title>
      <link>https://www.techradar.com/pro/benq-says-its-new-monitors-will-transform-work-for-mac-users-but-will-it-be-enough-to-tempt-them-away-from-apples-own-devices</link>
      <pubDate>Sun, 15 Feb 2026 19:05:00 +0000</pubDate>
      <guid isPermaLink="false">Xvujr4L3UpF5wTkkviPuxg</guid>
      <description>BenQ&#8217;s MA Series monitors provide Mac users with high-resolution displays, Mac-tuned color, workflow tools, and a range of panel options for creative work.</description>
    </item>
    <item>
      <title>The calmest way to lose your mind &#8211; My week with Shapez</title>
      <link>https://www.techradar.com/computing/websites-apps/shapez</link>
      <pubDate>Sun, 15 Feb 2026 19:00:00 +0000</pubDate>
      <guid isPermaLink="false">wJhk48JiAR7Q8eKa6FYg8M</guid>
      <description>Homescreen Heroes: Shapez is a minimalist game where you build a factory to process geometric shapes</description>
    </item>
    <item>
      <title>Fatal Frame 2: Crimson Butterfly Remake&#8217;s directors say the game&#8217;s take on Japanese horror is &#8216;both beautiful and terrifying&#8217;</title>
      <link>https://www.techradar.com/gaming/fatal-frame-2-crimson-butterfly-remake-directors-interview</link>
      <pubDate>Sun, 15 Feb 2026 19:00:00 +0000</pubDate>
      <guid isPermaLink="false">GB6GTskwxGyFrxEKTXfVUV</guid>
      <description>&#8216;By minimizing jump scares and graphic depictions,&#8217; Fatal Frame 2: Crimson Butterfly Remake&#8217;s directors emphasize the game&#8217;s unique &#8216;expression of Japanese horror&#8217;.</description>
    </item>
    <item>
      <title>Comment choisir une imprimante 3D ? Nos conseils</title>
      <link>https://www.frandroid.com/dossiers/2976591_comment-choisir-une-imprimante-3d-nos-conseils</link>
      <pubDate>Sun, 15 Feb 2026 19:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/dossiers/2976591_comment-choisir-une-imprimante-3d-nos-conseils</guid>
      <description>
Vous avez envie d'acqu&#233;rir une imprimante 3D mais vous ne savez pas comment vous y prendre ? Voici une liste de conseils et de crit&#232;res pour savoir comment choisir une imprimante 3D.
</description>
    </item>
    <item>
      <title>La cam&#233;ra connect&#233;e Tapo C211 filme en 2K &#224; 360&#176;, suit chaque mouvement d&#233;tect&#233; et est aussi petite que son prix</title>
      <link>https://www.frandroid.com/marques/2975497_la-camera-connectee-tapo-c211-filme-en-2k-a-360-suit-chaque-mouvement-detecte-et-est-aussi-petite-que-son-prix</link>
      <pubDate>Sun, 15 Feb 2026 18:58:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/2975497_la-camera-connectee-tapo-c211-filme-en-2k-a-360-suit-chaque-mouvement-detecte-et-est-aussi-petite-que-son-prix</guid>
      <description>
Discr&#232;te, orientable et dot&#233;e d'une ribambelle de fonctionnalit&#233;s intelligentes, la Tapo C211 de TP-Link est une cam&#233;ra de surveillance connect&#233;e qui nous inspire confiance. Elle a en plus l'avantage d'&#234;tre tr&#232;s accessible : Amazon la propose &#224; 19,99 euros au lieu de 32,90 euros.
</description>
    </item>
    <item>
      <title>Amazon Echo, Google Nest, HomePod&#8230; quelles sont les meilleures enceintes connect&#233;es en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guide-audio/491262_google-home-et-ses-alternatives-quelles-sont-les-meilleures-enceintes-connectees-en-2018</link>
      <pubDate>Sun, 15 Feb 2026 18:02:11 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-audio/491262_google-home-et-ses-alternatives-quelles-sont-les-meilleures-enceintes-connectees-en-2018</guid>
      <description>
Vous avez d&#233;cid&#233; d'installer une ou plusieurs enceintes connect&#233;es chez vous ? Google Nest Mini, Amazon Echo, Apple HomePod&#8230; Il y a du choix ! On vous aide &#224; y voir plus clair dans cette s&#233;lection des meilleures enceintes connect&#233;es avec assistant personnel.
</description>
    </item>
    <item>
      <title>India has 100M weekly active ChatGPT users, Sam Altman says</title>
      <link>https://techcrunch.com/2026/02/15/india-has-100m-weekly-active-chatgpt-users-sam-altman-says/</link>
      <pubDate>Sun, 15 Feb 2026 18:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3093246</guid>
      <description>OpenAI CEO Sam Altman says India has the largest number of student users of ChatGPT worldwide.</description>
    </item>
    <item>
      <title>Tesla CarPlay is coming but it's reportedly being held back by low iOS 26 adoption numbers</title>
      <link>https://www.engadget.com/transportation/evs/tesla-carplay-is-coming-but-its-reportedly-being-held-back-by-low-ios-26-adoption-numbers-173812736.html?src=rss</link>
      <pubDate>Sun, 15 Feb 2026 17:38:12 +0000</pubDate>
      <guid isPermaLink="false">2266d567-7424-424c-b222-619b6a426086</guid>
      <description>We're still waiting for Apple CarPlay compatibility for Tesla EVs, but it's been pushed back thanks to a slight hitch with iOS 26, according to Bloomberg's Mark Gurman. In the latest Power On newsletter, Gurman said that Tesla's plans to adopt CarPlay have been delayed due to app compatibility issues as well as low adoption rates for iOS 26.
It's been a long wait for Tesla drivers who want CarPlay compatibility, especially since initial rumors indicated a late 2025 rollout and Bloomberg reported that Tesla was testing CarPlay in its vehicles in November. However, Gurman's latest newsletter rev...</description>
    </item>
  </channel>
</rss>
