<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sun, 08 Feb 2026 09:35:23 GMT</lastBuildDate>
    <item>
      <title>Kill Switch : c&#8217;est quoi cet outil VPN et pourquoi est-il vital de l&#8217;activer ?</title>
      <link>https://www.frandroid.com/services/vpn/2963505_kill-switch-cest-quoi-cet-outil-vpn-et-pourquoi-est-il-vital-de-lactiver</link>
      <pubDate>Sun, 08 Feb 2026 09:30:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/services/vpn/2963505_kill-switch-cest-quoi-cet-outil-vpn-et-pourquoi-est-il-vital-de-lactiver</guid>
      <description>
Le Kill Switch n'est pas un interrupteur pour faire exploser toutes les Nintendo Switch aux alentours mais bien une fonctionnalit&#233; propre aux VPN. Une technologie qui est une sorte de bouton d'arr&#234;t d'urgence et qui s'applique &#224; la connexion internet. Voici tout ce qu'il faut savoir &#224; son sujet.
</description>
    </item>
    <item>
      <title>Windows 11 dit adieu aux vieilles imprimantes en enterrant d&#8217;anciens pilotes</title>
      <link>https://www.01net.com/actualites/windows-11-dit-adieu-aux-vieilles-imprimantes-en-enterrant-danciens-pilotes.html</link>
      <pubDate>Sun, 08 Feb 2026 09:02:03 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1324702</guid>
      <description>On ne peut pas dire que Microsoft prend les utilisateurs de vieilles imprimantes en tra&#238;tre, puisque l'annonce du retrait des pilotes V3 et V4 remonte au mois de septembre 2023. Mais maintenant que Windows ne prend effectivement plus en charge ces pilotes, certains pourront avoir une mauvaise surprise.</description>
    </item>
    <item>
      <title>Are we living in a&#160;simulation?</title>
      <link>https://www.fastcompany.com/91485325/are-we-living-in-a-simulation</link>
      <pubDate>2026-02-08T09:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91485325/are-we-living-in-a-simulation</guid>
      <description>There are more fundamental ways in which our world resembles a simulation. 
Curious Kids is a series for children of all ages. If you have a question you&#8217;d like an expert to answer, send it to CuriousKidsUS@theconversation.com.</description>
    </item>
    <item>
      <title>Microsoft ne l&#226;che rien : Copilot s&#8217;invite d&#233;sormais dans l&#8217;endroit le plus improbable de Windows 11</title>
      <link>https://www.frandroid.com/marques/microsoft/2969851_microsoft-ne-lache-rien-copilot-sinvite-desormais-dans-lendroit-le-plus-improbable-de-windows-11</link>
      <pubDate>Sun, 08 Feb 2026 08:58:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/microsoft/2969851_microsoft-ne-lache-rien-copilot-sinvite-desormais-dans-lendroit-le-plus-improbable-de-windows-11</guid>
      <description>
Microsoft ne rel&#226;che pas la pression sur l'intelligence artificielle. Une nouvelle d&#233;couverte r&#233;v&#232;le que l'assistant Copilot pourrait bient&#244;t s'inviter dans une &#233;tape cruciale de la configuration de votre PC : l'&#233;cran d'installation des mises &#224; jour. 
</description>
    </item>
    <item>
      <title>&#201;cran 90 Hz et 7 ans de mises &#224; jour : la Samsung Galaxy Tab A11 version 128 Go ne d&#233;passe pas 180 &#8364;</title>
      <link>https://www.frandroid.com/bons-plans/2969029_ecran-90-hz-et-7-ans-de-mises-a-jour-la-samsung-galaxy-tab-a11-version-128-go-ne-depasse-pas-180-e</link>
      <pubDate>Sun, 08 Feb 2026 08:22:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2969029_ecran-90-hz-et-7-ans-de-mises-a-jour-la-samsung-galaxy-tab-a11-version-128-go-ne-depasse-pas-180-e</guid>
      <description>
Avec son &#233;cran bien fluide et son suivi logiciel rassurant, la Samsung Galaxy Tab A11 compte parmi les tablettes tactiles abordables les plus recommandables du moment. C'est d'autant plus le cas quand elle est propos&#233;e &#224; 179,90 euros au lieu de 229,90 euros dans sa version 128 Go, comme sur Amazon.
</description>
    </item>
    <item>
      <title>Android&#160;: ce malware espion vous pi&#232;ge avec une fausse conversation WhatsApp</title>
      <link>https://www.01net.com/actualites/android-ce-malware-espion-vous-piege-avec-une-fausse-conversation-whatsapp.html</link>
      <pubDate>Sun, 08 Feb 2026 08:01:16 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1323880</guid>
      <description>Une fausse appli de rencontre tente actuellement de pi&#233;ger certains utilisateurs Android. L'application sert de cheval de Troie pour installer GhostChat sur votre smartphone. Ce virus va piller toutes vos donn&#233;es, tandis qu'un pirate converse avec vous sur WhatsApp en se faisant passer pour une pr&#233;tendante. L'op&#233;ration s&#8217;inscrit dans une vaste campagne d&#8217;espionnage qui vise &#224; la fois les t&#233;l&#233;phones et les ordinateurs....</description>
    </item>
  </channel>
</rss>
