<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Sat, 17 Jan 2026 11:20:38 GMT</lastBuildDate>
    <item>
      <title>Gear News of the Week: Kia Shows off the EV2, and Fujifilm Debuts New Instax Cameras</title>
      <link>https://www.wired.com/story/gear-news-of-the-week-kia-shows-off-the-ev2-and-fujifilm-debuts-new-instax-cameras/</link>
      <pubDate>Sat, 17 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">696a4623f85864716b5ca612</guid>
      <description>Plus: Fender rebrands its PreSonus music production app, Ricoh unveils a monochrome camera, and Omega has a new Speedmaster.</description>
    </item>
    <item>
      <title>Test de la Huawei Watch Ultimate 2 : une montre de luxe qui cache un v&#233;ritable laboratoire de sant&#233;</title>
      <link>https://www.frandroid.com/marques/huawei/2931443_test-de-la-huawei-watch-ultimate-2-une-montre-de-luxe-qui-cache-un-veritable-laboratoire-de-sante</link>
      <pubDate>Sat, 17 Jan 2026 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/huawei/2931443_test-de-la-huawei-watch-ultimate-2-une-montre-de-luxe-qui-cache-un-veritable-laboratoire-de-sante</guid>
      <description>
Deux ans apr&#232;s sa premi&#232;re montre ultra haut de gamme, Huawei a lanc&#233; sa Huawei Watch Ultimate 2. Design massif et &#233;l&#233;gant, fonctions pouss&#233;es pour la sant&#233; et suivi sportif avanc&#233;, voici son test complet.
</description>
    </item>
    <item>
      <title>Publicit&#233; dans ChatGPT : OpenAI d&#233;voile son plan pour d&#233;mocratiser l&#8217;intelligence artificielle</title>
      <link>https://www.frandroid.com/marques/openai/2946445_publicite-dans-chatgpt-openai-devoile-son-plan-pour-democratiser-lintelligence-artificielle</link>
      <pubDate>Sat, 17 Jan 2026 10:42:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/openai/2946445_publicite-dans-chatgpt-openai-devoile-son-plan-pour-democratiser-lintelligence-artificielle</guid>
      <description>
OpenAI vient d&#8217;annoncer le d&#233;ploiement mondial de ChatGPT Go, une nouvelle formule d&#8217;abonnement &#224; petit prix, tout en confirmant l&#8217;arriv&#233;e prochaine de la publicit&#233; au sein de ses services gratuits et Go. Une strat&#233;gie qui vise &#224; financer l'acc&#232;s au nouveau mod&#232;le GPT-5.2 Instant pour le plus grand nombre.
</description>
    </item>
    <item>
      <title>The Best Mattress for Back Pain: 7 Top Options We Tested (2025)</title>
      <link>https://www.wired.com/gallery/the-best-mattresses-for-back-pain/</link>
      <pubDate>Sat, 17 Jan 2026 10:36:00 +0000</pubDate>
      <guid isPermaLink="false">667f1adbdfe783b1d2f69b10</guid>
      <description>Struggling with back pain while you sleep or when you wake up in the morning? These mattresses can help with that.</description>
    </item>
    <item>
      <title>Le Dyson Cyclone V10 ne laisse aucun coin de c&#244;t&#233; gr&#226;ce &#224; tous ses accessoires et aspire m&#234;me 150 &#8364; de son prix pour les soldes</title>
      <link>https://www.frandroid.com/bons-plans/2942381_le-dyson-cyclone-v10-ne-laisse-aucun-coin-de-cote-grace-a-tous-ses-accessoires-et-aspire-meme-150-e-de-son-prix-pour-les-soldes</link>
      <pubDate>Sat, 17 Jan 2026 10:25:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2942381_le-dyson-cyclone-v10-ne-laisse-aucun-coin-de-cote-grace-a-tous-ses-accessoires-et-aspire-meme-150-e-de-son-prix-pour-les-soldes</guid>
      <description>
Le Cyclone V10 Total Clean est fourni avec une large gamme d'accessoires pour pouvoir acc&#233;der &#224; tous les coins de votre domicile et ce, du sol au plafond. Sur le site de Dyson, vous pouvez b&#233;n&#233;ficier d'une remise de 150 euros &#224; l'occasion des soldes d'hiver et voir cet aspirateur tomber &#224; 329 euros.
</description>
    </item>
    <item>
      <title>PlayStation Portal Pro : Sony pr&#233;pare enfin la version OLED que tout le monde attendait</title>
      <link>https://www.frandroid.com/marques/sony/2946435_playstation-portal-pro-sony-prepare-enfin-la-version-oled-que-tout-le-monde-attendait</link>
      <pubDate>Sat, 17 Jan 2026 10:14:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/sony/2946435_playstation-portal-pro-sony-prepare-enfin-la-version-oled-que-tout-le-monde-attendait</guid>
      <description>
Selon le leaker Zuby_Tech, une version am&#233;lior&#233;e, potentiellement nomm&#233;e PlayStation Portal Pro, serait en pr&#233;paration avec deux arguments de poids : une dalle OLED et un taux de rafra&#238;chissement de 120 Hz.
</description>
    </item>
    <item>
      <title>Forget lasers and missiles, China wants to kill drones using a common tech households use everyday in kitchens all around the world &#8212; invisible microwave weapons can fry electronics but still require line-of-sight and proximity</title>
      <link>https://www.techradar.com/pro/forget-lasers-and-missiles-china-wants-to-kill-drones-using-a-common-tech-households-use-everyday-in-kitchens-all-around-the-world-invisible-microwave-weapons-can-fry-electronics-but-still-require-line-of-sight-and-proximity</link>
      <pubDate>Sat, 17 Jan 2026 10:05:00 +0000</pubDate>
      <guid isPermaLink="false">uH82KnbusVZavUoaLTHe6A</guid>
      <description>China wants to counter drone swarms using high power microwave weapons similar in principle to household ovens but scaled for military air defense roles.</description>
    </item>
    <item>
      <title>The 16 Best EVs Coming in 2026</title>
      <link>https://www.wired.com/story/the-16-best-evs-coming-in-2026/</link>
      <pubDate>Sat, 17 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">6966e42a7f908af75073dbce</guid>
      <description>We&#8217;re expecting fresh electrics from Rivian, Hyundai, Honda, BMW, and newcomer Slate, among others. Here are the EVs arriving this year that we&#8217;re most excited about.</description>
    </item>
    <item>
      <title>Can't wait for Celebrity Traitors UK season 2? The cast of Agatha Christie's Seven Dials on Netflix is '100%' game to compete &#8212; but think it would be 'the worst two weeks of our life'</title>
      <link>https://www.techradar.com/streaming/netflix/cant-wait-for-celebrity-traitors-uk-season-2-the-cast-of-agatha-christies-seven-dials-on-netflix-is-100-percent-game-to-compete-but-think-it-would-be-the-worst-two-weeks-of-our-life</link>
      <pubDate>Sat, 17 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">uz8RitnLEMSdTpcASE5vGe</guid>
      <description>We've got The Traitors UK season 4 and Agatha Christie's Seven Dials on the go at once this week &#8211; but two of the Netflix cast would 'love' to appear on Celebrity Traitors UK season 2.</description>
    </item>
    <item>
      <title>ICYMI: the week's 7 biggest tech stories like Apple losing to Google, and Meta giving up on VR</title>
      <link>https://www.techradar.com/tech/icymi-the-weeks-7-biggest-tech-stories-like-apple-losing-to-google-and-meta-giving-up-on-vr</link>
      <pubDate>Sat, 17 Jan 2026 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">dHuHKEBeKaSyZhzMDNLiSB</guid>
      <description>The biggest tech news stories from Meta, Amazon, Apple, and more for January 17, 2026.</description>
    </item>
    <item>
      <title>You probably shouldn&#8217;t click that email &#8216;unsubscribe&#8217; link. Here&#8217;s what to do instead</title>
      <link>https://www.fastcompany.com/91472824/dont-click-email-unsubscribe-link-do-this-instead-subscription-cancel-opt-out</link>
      <pubDate>2026-01-17T10:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91472824/dont-click-email-unsubscribe-link-do-this-instead-subscription-cancel-opt-out</guid>
      <description>It&#8217;s tempting to click on &#8220;unsubscribe&#8221; to defend yourself from spam emails. But that can sometimes make things worse. Here&#8217;s a safer way to take control.
There are few things in the digital world as annoying as spam emails. They flood our inbox after our email address is sold by a data broker, shared with third parties from a site we&#8217;ve willingly given it to, or obtained through a data breach. It&#8217;s natural to want to get off these lists as fast as possible, but if there&#8217;s one thing you should rarely ever do with one of these spammy emails, it&#8217;s click the &#8220;unsubscribe&#8221; link found in it. Here&#8217;s...</description>
    </item>
    <item>
      <title>Man United vs Man City Free Streams: How to Watch Manchester Derby online as Michael Carrick takes charge of his opening game</title>
      <link>https://www.techradar.com/how-to-watch/football/man-united-vs-man-city-manchester-derby-premier-league-2025-26-free</link>
      <pubDate>Sat, 17 Jan 2026 09:45:00 +0000</pubDate>
      <guid isPermaLink="false">YxFU4Lkrgh95HuxjPFtLEU</guid>
      <description>We'll show you how to watch Man United vs Man City live streams from anywhere as Michael Carrick takes charge for the first time since replacing Ruben Amorim.</description>
    </item>
    <item>
      <title>What we can learn about U.S. disaster response&#8212;a year after the LA wildfires</title>
      <link>https://www.fastcompany.com/91476156/what-we-can-learn-about-u-s-disaster-response-a-year-after-the-la-wildfires</link>
      <pubDate>2026-01-17T09:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91476156/what-we-can-learn-about-u-s-disaster-response-a-year-after-the-la-wildfires</guid>
      <description>Jacob Soboroff&#8217;s new book &#8216;Firestorm&#8217; looks at the systemic failures that helped cause the LA fires&#8212;and what we can learn from a year of recovery efforts.
One year on from the catastrophic LA wildfires, journalist, author, and MS NOW correspondent Jacob Soboroff examines what the fires reveal about America&#8217;s growing age of disaster. Drawing from his new book Firestorm, Soboroff shares hard lessons from the aftermath, exposing systemic failures, unlikely heroics, and what today&#8217;s recovery efforts tell us about how the U.S. will respond to the next crisis....</description>
    </item>
  </channel>
</rss>
