<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Tue, 25 Nov 2025 16:57:36 GMT</lastBuildDate>
    <item>
      <title>China&#8217;s Pony.ai plans to triple global robotaxi fleet by the end of 2026</title>
      <link>https://techcrunch.com/2025/11/25/chinas-pony-ai-plans-to-triple-global-robotaxi-fleet-by-the-end-of-2026/</link>
      <pubDate>Tue, 25 Nov 2025 16:54:57 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3070548</guid>
      <description>The Chinese autonomous vehicle company Pony.ai has global ambitions, and plans to build a 3,000-strong robotaxi fleet to meet them.</description>
    </item>
    <item>
      <title>Amazon brade un tas de produits Tech pour la Black Friday Week : les 22 offres &#224; retenir</title>
      <link>https://www.frandroid.com/bons-plans/2860071_amazon-se-montre-genereux-pour-la-black-friday-week-voici-les-20-offres-a-saisir-ce-week-end</link>
      <pubDate>Tue, 25 Nov 2025 16:51:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860071_amazon-se-montre-genereux-pour-la-black-friday-week-voici-les-20-offres-a-saisir-ce-week-end</guid>
      <description>
Amazon n&#8217;h&#233;site pas &#224; casser les prix de nombreuses r&#233;f&#233;rences sur son site lors de la Black Friday Week. Il y aura forc&#233;ment de quoi vous faire plaisir&#160;: retrouvez ici les meilleures offres qui valent le coup.
</description>
    </item>
    <item>
      <title>Le Samsung Galaxy S25 est &#224; moins de 500 &#8364; gr&#226;ce &#224; cette offre du Black Friday (-48 %)</title>
      <link>https://www.frandroid.com/bons-plans/2877735_le-samsung-galaxy-s25-est-a-moins-de-500-grace-a-cette-offre-du-black-friday</link>
      <pubDate>Tue, 25 Nov 2025 16:49:40 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2877735_le-samsung-galaxy-s25-est-a-moins-de-500-grace-a-cette-offre-du-black-friday</guid>
      <description>
Pour la Black Friday Week, Orange sort une offre immanquable sur le r&#233;cent Samsung Galaxy S25 avec un bonus de reprise qui le fait passer de 959 euros &#224; seulement 499 euros.
</description>
    </item>
    <item>
      <title>A 30% discount on the Xbox Elite Series 2 controller is one heck of a Black Friday deal</title>
      <link>https://www.techradar.com/gaming/a-30-percent-discount-on-the-xbox-elite-series-2-controller-is-one-heck-of-a-black-friday-deal</link>
      <pubDate>Tue, 25 Nov 2025 16:43:37 +0000</pubDate>
      <guid isPermaLink="false">5CfrnPFMfXnieHZ8GmjYZi</guid>
      <description>This Black Friday, the Xbox Elite Series 2 controller has finally come down to a price I can recommend it at - save up to 34%.</description>
    </item>
    <item>
      <title>Fnac et Darty font le plein de bonnes affaires lors de la Black Friday Week : voici les 16 meilleures offres</title>
      <link>https://www.frandroid.com/bons-plans/2869625_fnac-et-darty-donnent-tout-pour-le-week-end-de-la-black-friday-week-le-top-15-des-offres-du-moment</link>
      <pubDate>Tue, 25 Nov 2025 16:42:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2869625_fnac-et-darty-donnent-tout-pour-le-week-end-de-la-black-friday-week-le-top-15-des-offres-du-moment</guid>
      <description>
La Black Week bat son plein chez la Fnac et Darty. Les deux enseignes proposent en continu de nouvelles offres. Pour ne rien manquer et profiter d&#232;s maintenant des meilleures r&#233;ductions, d&#233;couvrez la s&#233;lection des offres incontournables &#224; saisir sans tarder, avant &#233;puisement des stocks et la fin de l&#8217;&#233;v&#233;nement.
</description>
    </item>
    <item>
      <title>Mission de sauvetage r&#233;ussie&#160;: la Chine livre une capsule de secours &#224; sa station spatiale Tiangong</title>
      <link>https://www.01net.com/actualites/mission-de-sauvetage-reussie-la-chine-livre-une-capsule-de-secours-a-sa-station-spatiale-tiangong.html</link>
      <pubDate>Tue, 25 Nov 2025 16:42:23 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311116</guid>
      <description>Frayeur et r&#233;activit&#233; dans l'espace. Apr&#232;s une collision avec un d&#233;bris orbital, la Chine a d&#251; lancer en urgence une mission non habit&#233;e pour s&#233;curiser le retour de ses astronautes. Le vaisseau Shenzhou-22 est bien arriv&#233; &#224; bon port ce 25 novembre.</description>
    </item>
    <item>
      <title>Test du Ugreen NASync DXP4800 Plus : Synology et QNAP ont clairement du souci &#224; se faire</title>
      <link>https://www.frandroid.com/produits-android/hardware/nas/2828651_test-du-ugreen-nasync-dxp4800-plus</link>
      <pubDate>Tue, 25 Nov 2025 16:42:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/nas/2828651_test-du-ugreen-nasync-dxp4800-plus</guid>
      <description>
J'ai pass&#233; deux mois avec le Ugreen DXP4800 Plus, un NAS &#224; 700 euros qui promet beaucoup sur le papier. Processeur Intel 12&#7497; g&#233;n&#233;ration, RAM DDR5, Ethernet 10 Gigabit : des caract&#233;ristiques qu'on trouve habituellement &#224; 1000 euros chez Synology ou QNAP.
</description>
    </item>
    <item>
      <title>This Black Friday PS5 deal proves that the console wars are truly over: a PS5 is only &#163;10 more than an Xbox Series S</title>
      <link>https://www.techradar.com/gaming/this-black-friday-ps5-deal-proves-that-the-console-wars-are-truly-over-a-ps5-is-only-gbp10-more-than-an-xbox-series-s</link>
      <pubDate>Tue, 25 Nov 2025 16:41:53 +0000</pubDate>
      <guid isPermaLink="false">Cjzkw5pGyLwD7vqNJsaNeT</guid>
      <description>There's only one console to buy this Black Friday, with a PS5 now costing only a tenner more than an Xbox Series S.</description>
    </item>
    <item>
      <title>You can pick up a PSVR 2 headset and one of its best games for a lowest-ever price in the UK and US for Black Friday</title>
      <link>https://www.techradar.com/gaming/you-can-pick-up-a-psvr-2-headset-and-one-of-its-best-games-for-a-lowest-ever-price-in-the-uk-and-us-for-black-friday</link>
      <pubDate>Tue, 25 Nov 2025 16:37:27 +0000</pubDate>
      <guid isPermaLink="false">MJRKV2ktGGuryKx7wn2nyT</guid>
      <description>The PSVR 2 is now at its lowest ever price in the US and the UK thanks to some excellent Black Friday deals. Here's the cheapest offers to pick up today.</description>
    </item>
    <item>
      <title>Boulanger fait sa grande braderie pendant la Black Friday Week : les 17 offres qui m&#233;ritent votre argent</title>
      <link>https://www.frandroid.com/bons-plans/2859523_boulanger-fait-son-destockage-durant-la-black-friday-week-les-17-deals-immanquables-du-week-end</link>
      <pubDate>Tue, 25 Nov 2025 16:33:26 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2859523_boulanger-fait-son-destockage-durant-la-black-friday-week-les-17-deals-immanquables-du-week-end</guid>
      <description>
Avec la Black Friday Week, une nouvelle vague de promotions a d&#233;ferl&#233; chez les grands sites de e-commerce. Pour l'occasion, Boulanger n&#8217;h&#233;site pas &#224; baisser les prix de nombreuses r&#233;f&#233;rences Tech. Voici les offres qui valent le coup. 
</description>
    </item>
    <item>
      <title>Talk about an upgrade - Amazon is spending $50 billion on new AI and HPC hardware for the US government</title>
      <link>https://www.techradar.com/pro/talk-about-an-upgrade-amazon-is-spending-usd50-billion-on-new-ai-and-hpc-hardware-for-the-us-government</link>
      <pubDate>Tue, 25 Nov 2025 16:33:00 +0000</pubDate>
      <guid isPermaLink="false">ENQ6qUDvJDvw6Bdgn2jBQU</guid>
      <description>Amazon&#8217;s $50 billion plan expands federal AI capacity, strengthens classified cloud regions, and accelerates scientific and security workflows.</description>
    </item>
    <item>
      <title>AirPods Pro 3 are $30 off for Black Friday &#8211;nab the world's most popular earbuds for less!</title>
      <link>https://www.techradar.com/audio/earbuds-airpods/airpods-pro-3-are-usd30-off-for-black-friday-nab-the-worlds-most-popular-earbuds-for-less</link>
      <pubDate>Tue, 25 Nov 2025 16:31:54 +0000</pubDate>
      <guid isPermaLink="false">VmnHCL6jQj2z7t9rK6FLdQ</guid>
      <description>I reviewed Apple's AirPods Pro 3 and I gotta tell you they're the real deal &#8211; which makes this saving all the more special!</description>
    </item>
    <item>
      <title>Arturia&#8217;s AstroLab 37 crams 44 synths into a tiny keyboard</title>
      <link>https://www.theverge.com/tech/828658/arturia-astrolab-37-synth-stage-keyboard</link>
      <pubDate>2025-11-25T11:31:08-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=828658</guid>
      <description>Last year, Arturia launched its first stage keyboard, AstroLab. Unlike a synthesizer, stage keyboards are more focused on delivering performance-ready presets than sound design. They're geared towards touring and performing musicians who need access to a range of sounds with minimal fuss, rather than bedroom tinkerers. But, while the first entries in the series were [&#8230;]...</description>
    </item>
    <item>
      <title>All of the best Amazon UK Black Friday deals &#8211; 60+ top offers on TVs, laptops, appliances, Kindles, and more</title>
      <link>https://www.techradar.com/live/news/amazon-uk-black-friday-live-25</link>
      <pubDate>Tue, 25 Nov 2025 16:31:07 +0000</pubDate>
      <guid isPermaLink="false">XAUi44PGbPENE3oJxSUAtZ</guid>
      <description>I've used my decade of experience covering the Black Friday sales to pick out over 60 of the best deals from the Amazon UK Black Friday sale.</description>
    </item>
    <item>
      <title>Xbox has teamed up with Crocs for a limited-edition collection inspired by the game maker's biggest hits</title>
      <link>https://www.techradar.com/gaming/xbox/xbox-has-teamed-up-with-crocs-for-a-limited-edition-collection-inspired-by-the-game-makers-biggest-hits</link>
      <pubDate>Tue, 25 Nov 2025 16:29:46 +0000</pubDate>
      <guid isPermaLink="false">cotYRHzYS7jSj5hUfdTkkN</guid>
      <description>Xbox and Crocs have announced a new collaboration that reimagines the console's iconic controller in an exclusive, limited-time collection.</description>
    </item>
    <item>
      <title>Go home everyone, the Black Friday OLED TVs deals war has just been won by LG</title>
      <link>https://www.techradar.com/televisions/go-home-everyone-the-black-friday-oled-tvs-deals-war-has-just-been-won-by-lg</link>
      <pubDate>Tue, 25 Nov 2025 16:22:22 +0000</pubDate>
      <guid isPermaLink="false">CY5TomPk4HUGBoNb5yp2Ad</guid>
      <description>The LG C5 is one of the headline TVs of Black Friday, and Crampton &amp; Moore just dropped the 55-inch model to its lowest price to date.</description>
    </item>
    <item>
      <title>Une semaine sans Facebook, et tout va mieux&#160;: l&#8217;&#233;tude interne g&#234;nante que Meta aurait pr&#233;f&#233;r&#233; oublier</title>
      <link>https://www.01net.com/actualites/une-semaine-sans-facebook-et-tout-va-mieux-letude-interne-genante-que-meta-aurait-prefere-oublier.html</link>
      <pubDate>Tue, 25 Nov 2025 16:22:13 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311134</guid>
      <description>Meta savait que couper Facebook faisait du bien &#224; ses utilisateurs. Le g&#233;ant des r&#233;seaux sociaux aurait pourtant choisi de taire une &#233;tude interne qui &#233;tablissait un lien clair entre son r&#233;seau social et des effets n&#233;fastes sur la sant&#233; mentale, selon une plainte d&#233;pos&#233;e aux &#201;tats-Unis.</description>
    </item>
    <item>
      <title>Moins de 100 &#8364; en poche lors du Black Friday ? Voici les 15 meilleurs deals sans se ruiner</title>
      <link>https://www.frandroid.com/bons-plans/2866283_la-black-friday-week-avec-100-euros-en-poche-voici-les-15-deals-pour-se-faire-plaisir-a-petit-prix</link>
      <pubDate>Tue, 25 Nov 2025 16:20:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2866283_la-black-friday-week-avec-100-euros-en-poche-voici-les-15-deals-pour-se-faire-plaisir-a-petit-prix</guid>
      <description>
La Black Friday Week a d&#233;j&#224; d&#233;but&#233; et parmi les nombreuses offres, il est possible de se faire plaisir m&#234;me avec un budget qui ne d&#233;passe pas les 100 euros. Avis aux petits budgets, voici les meilleures offres qui valent le coup.
</description>
    </item>
    <item>
      <title>ExpressVPN just knocked NordVPN's Black Friday discount out of the park</title>
      <link>https://www.techradar.com/vpn/vpn-services/expressvpn-just-knocked-nordvpns-black-friday-discount-out-of-the-park</link>
      <pubDate>Tue, 25 Nov 2025 16:19:50 +0000</pubDate>
      <guid isPermaLink="false">d7VkkNxbeMtmBETMn8S5dB</guid>
      <description>It's the lowest price it's ever been and by a big margin, too!</description>
    </item>
    <item>
      <title>Get six months of Apple TV at its 2022 price for Black Friday</title>
      <link>https://www.theverge.com/gadgets/828621/apple-tv-black-friday-discount-deal-sale</link>
      <pubDate>2025-11-25T11:16:34-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=828621</guid>
      <description>A month of Apple TV costs $12.99, which is a good value if you&#8217;re into its blend of sci-fi, sports, kids content, and a staggering number of shows and movies that start with &#8220;S.&#8221; It&#8217;s the only major streaming service that doesn&#8217;t have ads, and it&#8217;ll be the exclusive home to F1 starting in 2026. [&#8230;]</description>
    </item>
    <item>
      <title>75 Walmart Black Friday deals I'm adding to my cart &#8211; AirPods, Lego, cheap TVs, PS5, air fryers, and more</title>
      <link>https://www.techradar.com/seasonal-sales/75-walmart-black-friday-deals-im-adding-my-cart-airpods-lego-cheap-tvs-ps5-air-fryers-and-more</link>
      <pubDate>Tue, 25 Nov 2025 16:16:14 +0000</pubDate>
      <guid isPermaLink="false">ucfGSStYK6iFntA5uCZwAT</guid>
      <description>Walmart's official Black Friday sale is live, and I'm rounding up the best deals that are in my shopping cart, including AirPods, cheap TVs, Lego, toys, and more.</description>
    </item>
    <item>
      <title>Save $120 on the Apple Watch Series 10 in Amazon's Black Friday sale</title>
      <link>https://www.techradar.com/seasonal-sales/save-usd120-on-the-apple-watch-series-10-in-amazons-black-friday-sale</link>
      <pubDate>Tue, 25 Nov 2025 16:14:40 +0000</pubDate>
      <guid isPermaLink="false">BZcfzTZN4AuV4h4vU2mtZ3</guid>
      <description>Head to Amazon to get $120 off a brand new Apple Watch Series 10 this Black Friday.</description>
    </item>
    <item>
      <title>Fleet Space finds massive lithium deposit using AI and satellites</title>
      <link>https://techcrunch.com/2025/11/25/fleet-space-finds-massive-lithium-deposit-using-ai-and-satellites/</link>
      <pubDate>Tue, 25 Nov 2025 16:14:33 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3070555</guid>
      <description>The discovery suggests that a region in Quebec might hold even more lithium than originally suspected.</description>
    </item>
    <item>
      <title>I&#8217;ve tested the latest Switch 2 controllers, and this one is the best</title>
      <link>https://www.theverge.com/tech/791574/best-switch-2-controllers</link>
      <pubDate>2025-11-25T11:11:41-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=791574</guid>
      <description>Editor&#8217;s note:&#160;Black Friday doesn&#8217;t officially take place until Friday, November 28th; however, if you want to shop ahead of time, we&#8217;ve rounded up the&#160;best early Black Friday deals&#160;you can already get. If you choose to get an extra controller for your Nintendo Switch 2, you can spend a lot &#8212; and get a lot in [&#8230;]</description>
    </item>
    <item>
      <title>ROG Xbox Ally&amp;#8217;s new profiles optimize performance per game for more battery life</title>
      <link>https://www.theverge.com/news/828775/microsoft-rog-xbox-ally-default-game-profiles</link>
      <pubDate>2025-11-25T11:08:07-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=828775</guid>
      <description>Microsoft is previewing default game profiles on its ROG Xbox Ally gaming handheld. The new profiles will automatically optimize frame rates and power consumption for 40 games, including Fortnite, Gears of War: Reloaded, Hollow Knight: Silksong, Forza Horizon 5, Minecraft, and others, saving you from manually tweaking game settings. The ROG Xbox Ally will automatically [&#8230;]...</description>
    </item>
    <item>
      <title>Target Black Friday ad: The best deals you can buy online today</title>
      <link>https://mashable.com/article/target-black-friday-ad-2025-best-deals</link>
      <pubDate>Tue, 25 Nov 2025 16:05:25 +0000</pubDate>
      <guid isPermaLink="false">04PRaxNVXTbPDPwspTQ48IE</guid>
      <description>Target Black Friday Ad. Browse the best deals from Target's Black Friday sale in 2025.</description>
    </item>
    <item>
      <title>You&#8217;ll Be Able to Not Watch &#8216;Tron: Ares&#8217; From the Comfort of Your Own Home Next Week</title>
      <link>https://gizmodo.com/tron-ares-home-release-date-streaming-blu-ray-2000691451</link>
      <pubDate>Tue, 25 Nov 2025 16:00:26 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000691451</guid>
      <description>Disney figures that you'll be more inclined to watch the Jared Leto vehicle at home than you ever were in theaters.</description>
    </item>
    <item>
      <title>Stranger Things is ending, and so is Netflix&amp;#8217;s reliance on tentpole shows</title>
      <link>https://www.theverge.com/streaming/828254/stranger-things-season-5-netflix-tentpoles-future</link>
      <pubDate>2025-11-25T11:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=828254</guid>
      <description>When Stranger Things first premiered in 2016, Netflix was still courting new subscribers with splashy original projects that were meant to have broad audience appeal. The company had solidified itself as a major player in the streaming wars with massive hits like House of Cards, Orange Is the New Black, and a collection of live-action [&#8230;]</description>
    </item>
    <item>
      <title>Speechify adds voice typing and voice assistant to its Chrome extension</title>
      <link>https://techcrunch.com/2025/11/25/speechify-adds-voice-typing-and-voice-assistant-to-its-chrome-extension/</link>
      <pubDate>Tue, 25 Nov 2025 16:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3070532</guid>
      <description>In the last 12 months, there has been a proliferation of voice detection tools, thanks to overall quality improvement in speech recognition models. Speechify is hitching its wagon to this train and launching its own dictation tool with support for English.</description>
    </item>
    <item>
      <title>Les produits Xiaomi n&#8217;&#233;chappent pas aux offres de la Black Friday Week : les 18 deals &#224; ne pas louper</title>
      <link>https://www.frandroid.com/bons-plans/2858733_xiaomi-casse-encore-plus-les-prix-de-ses-produits-meme-recents-lors-de-la-black-friday-week</link>
      <pubDate>Tue, 25 Nov 2025 15:56:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2858733_xiaomi-casse-encore-plus-les-prix-de-ses-produits-meme-recents-lors-de-la-black-friday-week</guid>
      <description>
Xiaomi d&#233;marre fort la Black Friday Week avec une pluie de promotions sur ses produits phares&#8239;: smartphones, tablettes et bracelets connect&#233;s &#224; prix cass&#233;s. D&#233;couvrez les meilleures offres Tech &#224; saisir.
</description>
    </item>
    <item>
      <title>Solar-powered iLamp turns the humble lamppost into an AI hub</title>
      <link>https://www.techradar.com/ai-platforms-assistants/solar-powered-ilamp-turns-the-humble-lamppost-into-an-ai-hub</link>
      <pubDate>Tue, 25 Nov 2025 15:55:44 +0000</pubDate>
      <guid isPermaLink="false">9tpEyYWDPa8sZ5oeBiWpKW</guid>
      <description>A British firm&#8217;s solar-powered smart streetlight could help solve AI&#8217;s growing energy and emissions problem by turning lampposts into decentralized data centers.</description>
    </item>
    <item>
      <title>Streaming just got cheaper: Score Black Friday deals on HBO Max, Apple TV, Disney+, Hulu, and more</title>
      <link>https://mashable.com/article/best-early-black-friday-streaming-live-deals-2025</link>
      <pubDate>Tue, 25 Nov 2025 15:54:01 +0000</pubDate>
      <guid isPermaLink="false">02EBTBcWO1drFrJi3czfNA8</guid>
      <description>The best Black Friday streaming deals include free offers on Spotify, Apple TV, and Peacock, plus 75% discounts on HBO Max.</description>
    </item>
    <item>
      <title>What enterprises should know about The White House's new AI 'Manhattan Project' the Genesis Mission</title>
      <link>https://venturebeat.com/ai/what-enterprises-should-know-about-the-white-houses-new-ai-manhattan-project</link>
      <pubDate>Tue, 25 Nov 2025 15:52:00 GMT</pubDate>
      <guid isPermaLink="false">4QlhNfqcxB4KdqTFE36bj5</guid>
      <description>President Donald Trump&#8217;s new &#8220;Genesis Mission&#8221; unveiled Monday is billed as a generational leap in how the United States does science akin to the Manhattan Project that created the atomic bomb during World War II. The executive order directs the Department of Energy (DOE) to build a &#8220;closed-loop AI experimentation platform&#8221; that links the country&#8217;s 17 national laboratories, federal supercomputers, and decades of government scientific data into &#8220;one cooperative system for research.&#8221; The White House fact sheet casts the initiative as a way to &#8220;transform how scientific research is conducted&#8221; and ...</description>
    </item>
    <item>
      <title>This record-low Ninja Creami deal proves it's never too late to join the hype train</title>
      <link>https://www.techradar.com/home/small-appliances/this-record-low-ninja-creami-deal-proves-its-never-too-late-to-join-the-hype-train</link>
      <pubDate>Tue, 25 Nov 2025 15:51:28 +0000</pubDate>
      <guid isPermaLink="false">EReNynSX4JgjS83THtRdbJ</guid>
      <description>Quick, easy, and healthier ice cream at the push of a button? The Ninja Creami promises this and more, and right now it's at its lowest-ever price for Black Friday.</description>
    </item>
    <item>
      <title>Apple Watch SE 3 vs SE 2: This is the cheap Apple Watch you should buy this week</title>
      <link>https://www.techradar.com/health-fitness/smartwatches/apple-watch-se-3-vs-se-2-this-is-the-cheap-apple-watch-you-should-buy-this-week</link>
      <pubDate>Tue, 25 Nov 2025 15:50:13 +0000</pubDate>
      <guid isPermaLink="false">geaFRqniAC3xQjxmSjeHSg</guid>
      <description>Which should you get on Black Friday: the older Apple Watch SE 2 or the newer Apple Watch SE 3?</description>
    </item>
    <item>
      <title>Apple TV profite du Black Friday pour baisser son prix sur 6 mois, l&#8217;occasion parfaite si vous n&#8217;avez jamais vu Ted Lasso ou Pluribus</title>
      <link>https://www.frandroid.com/bons-plans/2884519_apple-tv-profite-du-black-friday-pour-baisser-son-prix-sur-6-mois-loccasion-parfaite-si-vous-navez-jamais-vu-ted-lasso-ou-pluribus</link>
      <pubDate>Tue, 25 Nov 2025 15:49:50 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2884519_apple-tv-profite-du-black-friday-pour-baisser-son-prix-sur-6-mois-loccasion-parfaite-si-vous-navez-jamais-vu-ted-lasso-ou-pluribus</guid>
      <description>
Vous avez d&#233;j&#224; &#233;cum&#233; Netflix, rinc&#233; Prime Video et pli&#233; Disney+ ? Peut-&#234;tre qu&#8217;il est temps de tenter la parenth&#232;se Apple TV. Ici, on mise sur moins de volume, mais beaucoup plus de finesse, avec des s&#233;ries et des films qui sentent la ma&#238;trise, la mise en sc&#232;ne millim&#233;tr&#233;e&#8230; et m&#234;me du foot. Oui, du vrai foot (enfin soccer). La plateforme diffuse la MLS, celui o&#249; Messi &#224; poser valise. Et pour la Black Friday Week, l&#8217;abonnement tombe &#224; 4,99 euros par mois pendant 6 mois.
...</description>
    </item>
    <item>
      <title>Black Friday 2025: Live updates on the latest deals from Amazon, Target, Walmart, and more</title>
      <link>https://mashable.com/live/black-friday-live-deals-2025</link>
      <pubDate>Tue, 25 Nov 2025 15:47:39 +0000</pubDate>
      <guid isPermaLink="false">03tp2JNOQKRcB69tUBVVrSJ</guid>
      <description>Get live updates on Black Friday sales. We found savings of $150 on Dyson Supersonic hair dryers and $300 on Samsung TVs.</description>
    </item>
    <item>
      <title>50+ Walmart Black Friday deals: Walmart has gone live with Lego, Dyson vacuums, AirPods at record-low prices</title>
      <link>https://mashable.com/article/best-black-friday-walmart-deals-2025-airpods-lego-dyson</link>
      <pubDate>Tue, 25 Nov 2025 15:45:52 +0000</pubDate>
      <guid isPermaLink="false">03vZnwi4svU4WZUrG0yO1J5</guid>
      <description>The best Walmart Black Friday deals include $69 AirPods 4, $15 Magic Bullets, and record-low prices on Lego Star Wars and Minecraft.</description>
    </item>
    <item>
      <title>Is Google The New Leader of the AI Race?</title>
      <link>https://gizmodo.com/google-leading-ai-race-gemini-3-nano-banana-2000691357</link>
      <pubDate>Tue, 25 Nov 2025 15:45:22 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000691357</guid>
      <description>OpenAI is wounded. Nvidia could be next.</description>
    </item>
    <item>
      <title>One of the best DACs for using high-end headphones on PS5 is 20% off this Black Friday</title>
      <link>https://www.techradar.com/audio/wireless-headphones/one-of-the-best-dacs-for-using-high-end-headphones-on-ps5-is-20-percent-off-this-black-friday</link>
      <pubDate>Tue, 25 Nov 2025 15:45:20 +0000</pubDate>
      <guid isPermaLink="false">NFAUUa6fGeDr8aBJ3xJmPi</guid>
      <description>I absolutely love this Fosi Audio K7 DAC, but I wish I had waited for these Black Friday sales instead of buying it last month.</description>
    </item>
    <item>
      <title>Gemini AI Pro vs ChatGPT Plus : le r&#233;sultat est clair, OpenAI est KO</title>
      <link>https://www.frandroid.com/versus/2885241_gemini-ai-pro-vs-chatgpt-plus-le-resultat-est-clair-openai-est-ko</link>
      <pubDate>Tue, 25 Nov 2025 15:44:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/versus/2885241_gemini-ai-pro-vs-chatgpt-plus-le-resultat-est-clair-openai-est-ko</guid>
      <description>
Avec le lancement de Gemini 3 Pro, Google propose d&#233;sormais le forfait IA le plus int&#233;ressant du march&#233;. Le constat est limpide.
</description>
    </item>
    <item>
      <title>85 Black Friday deals: We found record-low prices on AirPods, MacBooks, TCL TVs, Kindles, and Ninja</title>
      <link>https://mashable.com/article/best-early-black-friday-deals-macbooks-airpods-kindles-ninja-2025</link>
      <pubDate>Tue, 25 Nov 2025 15:44:04 +0000</pubDate>
      <guid isPermaLink="false">04ohZNnyLyLTHLkre7fGfm7</guid>
      <description>Get the latest Black Friday deals on Apple products, vacuums, headphones, power stations, and Legos. Save $250 on a new Apple laptop and 27% on a new Kindle.</description>
    </item>
    <item>
      <title>The best soundbars for all budgets, all tested by us</title>
      <link>https://www.techradar.com/televisions/soundbars/the-best-soundbars-for-all-budgets</link>
      <pubDate>Tue, 25 Nov 2025 15:43:30 +0000</pubDate>
      <guid isPermaLink="false">9oTTXg8tu7vFCvUH6rV5t4</guid>
      <description>From budget-friendly bars to Dolby Atmos wonders, the best soundbars make it easy to get a serious TV audio upgrade.</description>
    </item>
    <item>
      <title>The Kodak Snapic A1 is a $99 film camera that makes double exposures easy</title>
      <link>https://www.theverge.com/news/828648/reto-kodak-snapic-a1-35mm-film-camera-double-exposure</link>
      <pubDate>2025-11-25T10:40:04-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=828648</guid>
      <description>Reto, a Hong Kong-based camera maker that licenses the Kodak brand, has announced a new 35mm film camera called the Snapic A1 that ships next week. Although its design, with either a rhino gray or ivory white plastic housing, gives off disposable camera vibes, for $99 the Snapic A1 should be a capable shooter with [&#8230;]</description>
    </item>
    <item>
      <title>The Mega Charizard X ex Ultra Premium Collection has dropped to market value on Amazon</title>
      <link>https://mashable.com/article/black-friday-deal-2025-mega-charizard-x-ex-ultra-premium-collection</link>
      <pubDate>Tue, 25 Nov 2025 15:40:02 +0000</pubDate>
      <guid isPermaLink="false">02XaMt60xIgPXJU9e7jnHGr</guid>
      <description>As of Nov. 25, get Mega Charizard X ex Ultra Premium Collection for market value vs. TCGplayer, but a free Amazon $60 gift card and AMEX / Discover discounts could save you a lot more.</description>
    </item>
    <item>
      <title>There&#8217;s up to $158 off the Philips Hue Festavia string lights thanks to this glowing Black Friday deal</title>
      <link>https://www.techradar.com/home/smart-lights/theres-up-to-usd158-off-the-philips-hue-festavia-string-lights-thanks-to-this-glowing-black-friday-deal</link>
      <pubDate>Tue, 25 Nov 2025 15:33:25 +0000</pubDate>
      <guid isPermaLink="false">2HqKr5YSjj8VCMfYRVdJN</guid>
      <description>Give your tree the glow-up it deserves with 40% off the 100, 250, and 500 LED Festavia String Lights from Philips Hue.</description>
    </item>
    <item>
      <title>A Woman in Thailand Believed to Be Dead Woke up in Her Coffin</title>
      <link>https://gizmodo.com/a-woman-in-thailand-believed-to-be-dead-woke-up-in-her-coffin-2000691405</link>
      <pubDate>Tue, 25 Nov 2025 15:32:08 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000691405</guid>
      <description>A staff member at a Buddhist temple heard a knock while explaining to a relative how to get a death certificate.</description>
    </item>
    <item>
      <title>Blink security cameras are less than half price for Black Friday &#8211; save up to 73% right now</title>
      <link>https://www.techradar.com/home/home-security/black-friday-blink-camera-deals-2025</link>
      <pubDate>Tue, 25 Nov 2025 15:20:47 +0000</pubDate>
      <guid isPermaLink="false">ojBi93668YXpvnMtTT5chh</guid>
      <description>Black Friday is the perfect time to pick up your first home security camera, with heaps of Blink cams less than half price.</description>
    </item>
    <item>
      <title>Roborock Drops Major Black Friday Deal, Now Selling Latest Qrevo CurvX Robot Vacuum for 43% Off</title>
      <link>https://gizmodo.com/roborock-drops-major-black-friday-deal-now-selling-latest-qrevo-curvx-robot-vacuum-for-43-off-2000685748</link>
      <pubDate>Tue, 25 Nov 2025 15:18:41 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000685748</guid>
      <description>Roborock's offering one of their most intelligent and advanced floor cleaning machines for just $850 through Dec. 1, a huge $650 price drop.</description>
    </item>
    <item>
      <title>The $69 Apple AirPods come with all kinds of extra Apple perks at Walmart</title>
      <link>https://mashable.com/article/early-black-friday-deal-2025-apple-airpods-4</link>
      <pubDate>Tue, 25 Nov 2025 15:17:44 +0000</pubDate>
      <guid isPermaLink="false">0318xTlEtyqPtHcq4B1U6n1</guid>
      <description>The Apple AirPods 4 are on sale for $69 at Walmart, down from the normal price of $129.99. That's a 47% discount.</description>
    </item>
    <item>
      <title>Samsung : quand les promotions de la Black Friday Week cassent les prix des Galaxy Z Flip, Galaxy Book, The Frame</title>
      <link>https://www.frandroid.com/bons-plans/2852851_samsung-casse-les-prix-pendant-la-black-friday-week-galaxy-s25-z-flip-7-fe-the-frame-2025-ils-sont-tous-en-forte-promotion</link>
      <pubDate>Tue, 25 Nov 2025 15:16:21 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2852851_samsung-casse-les-prix-pendant-la-black-friday-week-galaxy-s25-z-flip-7-fe-the-frame-2025-ils-sont-tous-en-forte-promotion</guid>
      <description>
Le 28 novembre marquera le v&#233;ritable coup d&#8217;envoi du Black Friday. En attendant, Samsung propose d&#8217;importantes remises&#8239;sur ses Galaxy S, mais aussi de belles &#233;conomies sur ses t&#233;l&#233;viseurs OLED et QLED.
</description>
    </item>
    <item>
      <title>There&#8217;s a huge sale on Sonos speakers and soundbars at Currys for Black Friday</title>
      <link>https://www.techradar.com/audio/theres-a-huge-sale-on-sonos-speakers-and-soundbars-at-currys-for-black-friday</link>
      <pubDate>Tue, 25 Nov 2025 15:16:01 +0000</pubDate>
      <guid isPermaLink="false">AqxX5VJRv4hsCyuZsDjT5c</guid>
      <description>Sonos makes some of the best audio equipment you can buy. Right now, there's a huge Sonos sale at Currys. Here are the highlights.</description>
    </item>
    <item>
      <title>Spotify to raise US prices in first quarter of next year, report says</title>
      <link>https://techcrunch.com/2025/11/25/spotify-to-raise-us-prices-in-first-quarter-of-next-year-report-says/</link>
      <pubDate>Tue, 25 Nov 2025 15:15:49 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3070542</guid>
      <description>Major record labels have been urging Spotify and other music streaming platforms to raise subscription prices, arguing that fees have not kept pace with inflation and remain low when compared to services like Netflix.</description>
    </item>
    <item>
      <title>Ready to give your business a sharper edge this Black Friday? Update your branding with Vistaprint's mega sale</title>
      <link>https://www.techradar.com/pro/ready-to-give-your-business-a-sharper-edge-this-black-friday-update-your-branding-with-vistaprints-mega-sale</link>
      <pubDate>Tue, 25 Nov 2025 15:15:45 +0000</pubDate>
      <guid isPermaLink="false">dM2Viqc3dS5Gx3zhnjxZXC</guid>
      <description>Vistaprint&#8217;s latest sale makes branding and print upgrades more affordable than ever.</description>
    </item>
    <item>
      <title>The three speeds of zero trust</title>
      <link>https://www.techradar.com/pro/the-three-speeds-of-zero-trust</link>
      <pubDate>Tue, 25 Nov 2025 15:10:15 +0000</pubDate>
      <guid isPermaLink="false">ey2KuigCZnQRtxYns5RwFG</guid>
      <description>The successful implementation of a Zero Trust security strategy is determined by three factors: the speed of change, the speed of alignment, and the speed of response.</description>
    </item>
    <item>
      <title>Diversification can&#8217;t make a strategy problem disappear. It just creates a different problem</title>
      <link>https://www.fastcompany.com/91448140/diversification-cant-make-strategy-problem-disappear-just-creates-different-problem</link>
      <pubDate>2025-11-25T15:07:11</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91448140/diversification-cant-make-strategy-problem-disappear-just-creates-different-problem</guid>
      <description>Why successful acquisitions are harder than you think.
I keep coming up against a logical fallacy in strategy that I feel compelled to address. The logic holds that when a company has a shareholder-unfriendly component of its portfolio &#8211; e.g. the business in question is cyclical, or it is low-growth or low margin &#8211; the company should diversify to make that business less-shareholder unfriendly. I take on the fallacy in this Playing to Win/Practitioner Insights (PTW/PI) piece entitled Diversification Can&#8217;t Disappear a Strategy Problem: It Just Creates a Different Problem. And as always, you can ...</description>
    </item>
    <item>
      <title>Mint Mobile&#8217;s Black Friday Deal Makes Samsung, Google, and Apple Phones Practically Free With Its 50% Off Unlimited Plan</title>
      <link>https://gizmodo.com/mint-mobiles-black-friday-deal-makes-samsung-google-and-apple-phones-practically-free-with-its-50-off-unlimited-plan-2000686032</link>
      <pubDate>Tue, 25 Nov 2025 15:05:03 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000686032</guid>
      <description>Massive holiday savings are available on Samsung's flagship S25 phones, the Google Pixel 10 Pro XL, and Apple's iPhone 17 Pro and 17 Pro Max.</description>
    </item>
    <item>
      <title>The Nintendo Switch 2 Mario Kart World bundle has fallen to a new lowest-ever price in shock Black Friday discount</title>
      <link>https://www.techradar.com/gaming/the-nintendo-switch-2-mario-kart-world-bundle-has-fallen-to-a-new-lowest-ever-price-in-shock-black-friday-discount</link>
      <pubDate>Tue, 25 Nov 2025 15:04:32 +0000</pubDate>
      <guid isPermaLink="false">9QbrdmecCzJVv34cPdDiGV</guid>
      <description>The Nintendo Switch 2 Mario Kart World bundle has dropped to a new lowest-ever price at Amazon for Black Friday.</description>
    </item>
    <item>
      <title>Everything to know about Walmart Black Friday 2025: Early access, top deals, ad highlights</title>
      <link>https://mashable.com/article/walmart-black-friday-2025-everything-to-know</link>
      <pubDate>Tue, 25 Nov 2025 15:01:45 +0000</pubDate>
      <guid isPermaLink="false">03bXYaGk22Gkfpw0RbJiiuQ</guid>
      <description>Here's everything you need to know about Walmart's Black Friday sale, including when the sale starts and ends, what time stores open, and the best early deals to shop.</description>
    </item>
    <item>
      <title>L&#8217;ANFR oblige Apple &#224; corriger l&#8217;iPhone 16 et son contr&#244;le parental</title>
      <link>https://www.01net.com/actualites/lanfr-oblige-apple-a-corriger-liphone-16-et-son-controle-parental.html</link>
      <pubDate>Tue, 25 Nov 2025 15:01:19 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1311106</guid>
      <description>Oups. L&#8217;iPhone 16 n&#8217;&#233;tait pas totalement en r&#232;gle avec la loi  imposant l&#8217;activation du contr&#244;le parental d&#232;s la premi&#232;re configuration. Alert&#233;e par l&#8217;ANFR, Apple a d&#251; corriger le tir avec iOS 26.</description>
    </item>
    <item>
      <title>Why security is paramount for entrepreneurs in the vibe coding era</title>
      <link>https://www.techradar.com/pro/why-security-is-paramount-for-entrepreneurs-in-the-vibe-coding-era</link>
      <pubDate>Tue, 25 Nov 2025 15:01:15 +0000</pubDate>
      <guid isPermaLink="false">CXgD9ZoNQwQ5jsi6DdPGjZ</guid>
      <description>&#8203;Vibe coding is growing in popularity for startups, but most aren't fully aware of the risks.</description>
    </item>
    <item>
      <title>A Year&#8217;s Worth of &#8216;Doctor Who&#8217; Deleted Scenes Doesn&#8217;t Have the One You&#8217;d Actually Want</title>
      <link>https://gizmodo.com/a-years-worth-of-doctor-who-deleted-scenes-doesnt-have-the-one-youd-actually-want-2000691390</link>
      <pubDate>Tue, 25 Nov 2025 15:00:45 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000691390</guid>
      <description>To the surprise of no one, the BBC's compilation of deleted scenes from the latest season of 'Doctor Who' doesn't have the one scene that'd show just how much things changed in production.</description>
    </item>
    <item>
      <title>Our favorite ways to survive Thanksgiving</title>
      <link>https://www.theverge.com/gadgets/824092/thanksgiving-food-tech-help-favorite</link>
      <pubDate>2025-11-25T10:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=824092</guid>
      <description>Thanksgiving is an interesting holiday. Some celebrate it as an American tradition. Others look at it as simply an excuse to get together with family to watch some football. And still others just enjoy getting an extra day off from work or try to ignore it altogether. But however you regard it, there are often [&#8230;]</description>
    </item>
    <item>
      <title>Chelsea vs Barcelona free streams: How to watch UEFA Champions League online from anywhere</title>
      <link>https://www.techradar.com/how-to-watch/football/chelsea-vs-barcelona-uefa-champions-league-free</link>
      <pubDate>Tue, 25 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">98L6eGWRTyehDjZRLBK6aa</guid>
      <description>We'll show you all the ways you can watch Chelsea vs Barcelona in the Champions League this Tuesday from anywhere in the world.</description>
    </item>
    <item>
      <title>NYT Strands hints and answers for Wednesday, November 26 (game #633)</title>
      <link>https://www.techradar.com/computing/websites-apps/nyt-strands-today-answers-hints-26-november-2025</link>
      <pubDate>Tue, 25 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">pahWL5Z5AMT7xiTbogCWh5</guid>
      <description>Looking for NYT Strands answers and hints? Here's all you need to know to solve today's game, including the spangram.</description>
    </item>
    <item>
      <title>Quordle hints and answers for Wednesday, November 26 (game #1402)</title>
      <link>https://www.techradar.com/computing/websites-apps/quordle-today-answers-clues-26-november-2025</link>
      <pubDate>Tue, 25 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">L9JgTG37Kxs7Xpn5VxxQNE</guid>
      <description>Looking for Quordle clues? We can help. Plus get the answers to Quordle today and past solutions.</description>
    </item>
    <item>
      <title>NYT Connections hints and answers for Wednesday, November 26 (game #899)</title>
      <link>https://www.techradar.com/gaming/nyt-connections-today-answers-hints-26-november-2025</link>
      <pubDate>Tue, 25 Nov 2025 15:00:00 +0000</pubDate>
      <guid isPermaLink="false">fDtauJAS8UKHLp37pSNzHm</guid>
      <description>Looking for NYT Connections answers and hints? Here's all you need to know to solve today's game, plus my commentary on the puzzles.</description>
    </item>
    <item>
      <title>Walmart&#8217;s secret to retail domination? Becoming America&#8217;s grocery store</title>
      <link>https://www.fastcompany.com/91447006/walmart-secret-to-retail-domination-grocery-store</link>
      <pubDate>2025-11-25T15:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91447006/walmart-secret-to-retail-domination-grocery-store</guid>
      <description>Walmart&#8217;s grocery business is a Trojan horse, driving both low-income and affluent Americans into the store. 
You might think of Walmart as America&#8217;s quintessential big box store&#8212;the place you can get everything from Hanes T-shirts to large screen TVs to cleats for your kid&#8217;s soccer uniform.&#160;</description>
    </item>
  </channel>
</rss>
