<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Thu, 08 Jan 2026 13:44:49 GMT</lastBuildDate>
    <item>
      <title>ElevationLabs' 10-year extended battery case for AirTags is 30 percent off</title>
      <link>https://www.engadget.com/deals/elevationlabs-10-year-extended-battery-case-for-airtags-is-30-percent-off-162308110.html?src=rss</link>
      <pubDate>Thu, 08 Jan 2026 13:41:50 +0000</pubDate>
      <guid isPermaLink="false">12d3fe53-c0b1-4919-880c-16749c440b85</guid>
      <description>AirTags already have a decently long battery life, but you will end up needing to replace the coin cell every two years or so. If you don't even want to be bothered with that, ElevationLab made just the accessory for you: its AirTag battery case that can power the tracker for up to 10 years is on sale for 30 percent off. You can pick one up for only $16, and it's available in two- and four-packs as well at a discount.
The TimeCapsule case uses two AA batteries to offer up to 14 times the lifespan of the CR2032 battery that powers an AirTag. The company based those estimates on Energizer Ultima...</description>
    </item>
    <item>
      <title>The weirdest tech we've seen at CES 2026 so far</title>
      <link>https://www.engadget.com/the-weirdest-tech-weve-seen-at-ces-2026-so-far-134056504.html?src=rss</link>
      <pubDate>Thu, 08 Jan 2026 13:40:56 +0000</pubDate>
      <guid isPermaLink="false">0a400df8-3389-4aee-8595-d1a0f59b424f</guid>
      <description>CES is famous for ushering in big TVs, faster chips and serious upgrades to the tech we already use every day. It&#8217;s also where companies feel emboldened to ask some very strange questions, like whether your toilet should analyze your poop or your nails should change color on command. From experimental laptops to health tech that probably didn&#8217;t need a camera, these are the weirdest gadgets we spotted at CES 2026.Throne toilet computerThe Throne device perched on the side of a toilet.Daniel Cooper for EngadgetThrone is a toilet-mounted computer that uses cameras and microphones to analyze your ...</description>
    </item>
    <item>
      <title>Everything announced at CES 2026</title>
      <link>https://www.engadget.com/general/everything-announced-at-ces-2026-130124802.html?src=rss</link>
      <pubDate>Thu, 08 Jan 2026 13:34:00 +0000</pubDate>
      <guid isPermaLink="false">fd3b4bbf-1b78-4e34-9914-70a2e6f85389</guid>
      <description>It's the first week of a new year and there's no time for the tech world to slowly ease back into things following the holidays. That's because CES 2026 is in full swing, with all manner of companies descending on Las Vegas to reveal their latest innovations and what they're planning to bring your way in the near future.&#160;Many of the Engadget crew are on the ground to check out as much of the new tech as possible. Of course, we're keeping tabs on all of the major CES press conferences too. Samsung held its First Look presentation, which focuses on home products, while LG has shown off a wide ar...</description>
    </item>
    <item>
      <title>Shokz invente la r&#233;duction de bruit pour oreilles libres avec l&#8217;OpenFit Pro</title>
      <link>https://www.01net.com/actualites/shokz-invente-la-reduction-de-bruit-pour-oreilles-libres-avec-lopenfit-pro.html</link>
      <pubDate>Thu, 08 Jan 2026 13:32:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318838</guid>
      <description>C'est l'une des sensations audio du CES 2026. Shokz, sp&#233;cialiste de l'&#233;coute &#224; oreilles libres, lance l'OpenFit Pro. Leur promesse est de vous couper du vacarme du monde sans rien boucher de vos oreilles.</description>
    </item>
    <item>
      <title>Les robots humano&#239;des savent danser, mais l&#8217;industrie s&#8217;impatiente de les voir travailler</title>
      <link>https://www.lapresse.ca/affaires/techno/2026-01-08/les-robots-humanoides-savent-danser-mais-l-industrie-s-impatiente-de-les-voir-travailler.php?utm_source=rss&amp;utm_medium=fil&amp;utm_campaign=affaires&amp;utm_content=techno</link>
      <pubDate>Thu, 08 Jan 2026 08:28:44 -0500</pubDate>
      <guid isPermaLink="false">7902f1d809d530af961fc5968c5fd49c</guid>
      <description>Des robots humano&#239;des ont dans&#233;, fait des sauts p&#233;rilleux, distribu&#233; les cartes au blackjack et jou&#233; au ping-pong cette semaine au salon de la tech de Las&#160;Vegas, mais certains acteurs de l&#8217;industrie s&#8217;impatientent&#160;: ils veulent les voir devenir utiles, et ne plus &#234;tre seulement une promesse d&#8217;avenir.</description>
    </item>
    <item>
      <title>Use Classic Outlook? This Microsoft bug might stop you from opening encrypted emails</title>
      <link>https://www.techradar.com/pro/security/use-classic-outlook-this-microsoft-bug-might-stop-you-from-opening-encrypted-emails</link>
      <pubDate>Thu, 08 Jan 2026 13:27:46 +0000</pubDate>
      <guid isPermaLink="false">VgrfvyEj2xaRQ6Cj4tRn7o</guid>
      <description>There is no fix available, but you can always revert to an older version.</description>
    </item>
    <item>
      <title>More GameStop stores across the US are reportedly expected to shut down this month as part of cost-cutting efforts</title>
      <link>https://www.techradar.com/gaming/gaming-industry/more-gamestop-stores-across-the-us-are-reportedly-expected-to-shut-down-this-month-as-part-of-cost-cutting-efforts</link>
      <pubDate>Thu, 08 Jan 2026 13:27:45 +0000</pubDate>
      <guid isPermaLink="false">TwbLnqwkbsGA33y6Ei5Mbg</guid>
      <description>GameStop is reportedly planning to shutter multiple stores across the United States in January as part of the company's ongoing cost-cutting efforts.</description>
    </item>
    <item>
      <title>La course &#224; la batterie solide est d&#233;finitivement lanc&#233;e dans le v&#233;lo &#233;lectrique, avec des grosses r&#233;volutions en vue</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2934921_la-course-a-la-batterie-solide-est-definitivement-lancee-dans-le-velo-electrique-avec-des-grosses-revolutions-en-vue</link>
      <pubDate>Thu, 08 Jan 2026 13:25:41 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2934921_la-course-a-la-batterie-solide-est-definitivement-lancee-dans-le-velo-electrique-avec-des-grosses-revolutions-en-vue</guid>
      <description>
Le sp&#233;cialiste ta&#239;wanais ProLogium annonce une alliance avec trois autres soci&#233;t&#233;s pour la conception de batteries solides, dont certaines &#224; destination des v&#233;los cargos &#233;lectriques, au mieux &#224; partir de 2028.
</description>
    </item>
    <item>
      <title>Soldes d&#8217;hiver 2026 : les premi&#232;res offres sont en ligne, voici les meilleurs deals &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2931731_top-depart-soldes-dhiver-2026-les-meilleures-offres-en-direct</link>
      <pubDate>Thu, 08 Jan 2026 13:25:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2931731_top-depart-soldes-dhiver-2026-les-meilleures-offres-en-direct</guid>
      <description>
Apr&#232;s les f&#234;tes, la nouvelle ann&#233;e s'est install&#233;e en introduisant avec elle les soldes d'hiver ! Cette &#233;dition promet de belles affaires &#224; ne pas manquer pour s&#8217;&#233;quiper &#224; petit prix avant la hausse annonc&#233;e en 2026. Comptez sur Frandroid pour vous relayer uniquement les meilleures offres.
</description>
    </item>
    <item>
      <title>New Call of Duty x Fallout collab means free Warzone skins and loads of new content</title>
      <link>https://www.techradar.com/gaming/new-call-of-duty-x-fallout-collab-means-free-warzone-skins-and-loads-of-new-content</link>
      <pubDate>Thu, 08 Jan 2026 13:18:14 +0000</pubDate>
      <guid isPermaLink="false">xmXXgdoAcK6e2sy7KXij6M</guid>
      <description>The new Call of Duty x Fallout collab brings loads of free content to Black Ops 7 and Warzone.</description>
    </item>
    <item>
      <title>Samsung just won CES 2026 with its creaseless folding OLED &#8211; but I hope the iPhone Fold gets it first</title>
      <link>https://www.techradar.com/phones/samsung-galaxy-phones/samsung-just-won-ces-2026-with-its-creaseless-folding-oled-but-i-hope-the-iphone-fold-gets-it-first</link>
      <pubDate>Thu, 08 Jan 2026 13:05:32 +0000</pubDate>
      <guid isPermaLink="false">CCfYZ7zZeC23VxaVgcN2MR</guid>
      <description>Samsung&#8217;s creaseless folding display is an engineering wonder &#8211; and if the company has any sense, it&#8217;ll give it to Apple first.</description>
    </item>
    <item>
      <title>Quels sont les meilleurs &#233;couteurs sans fil en 2026 ?</title>
      <link>https://www.frandroid.com/guide-dachat/guide-audio/482350_quels-sont-les-meilleurs-ecouteurs-true-wireless-a-moins-de-200-euros-en-2018</link>
      <pubDate>Thu, 08 Jan 2026 13:00:31 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guide-audio/482350_quels-sont-les-meilleurs-ecouteurs-true-wireless-a-moins-de-200-euros-en-2018</guid>
      <description>
Les &#233;couteurs sans fil Bluetooth se sont impos&#233;s comme des accessoires essentiels au quotidien, tant pour la musique que pour les appels ou le sport. Nous avons s&#233;lectionn&#233; et test&#233; pour vous les meilleurs mod&#232;les d'&#233;couteurs sans fil les plus adapt&#233;s &#224; vos besoins et &#224; votre budget.
</description>
    </item>
    <item>
      <title>On Friday the 13th This Year, Even Your Podcasts Can Kill You</title>
      <link>https://gizmodo.com/undertone-movie-trailer-podcast-a24-2000707148</link>
      <pubDate>Thu, 08 Jan 2026 13:00:23 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000707148</guid>
      <description>That's the plot of 'undertone,' a new film from A24, which opens on Friday, March 13.</description>
    </item>
    <item>
      <title>Gmail&#160;: Google offre gratuitement ces trois nouveaut&#233;s normalement payantes</title>
      <link>https://www.01net.com/actualites/gmail-google-offre-gratuitement-ces-trois-nouveautes-normalement-payantes.html</link>
      <pubDate>Thu, 08 Jan 2026 13:00:15 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318793</guid>
      <description>La messagerie de Google va profiter d&#8217;un sacr&#233; coup de boost gr&#226;ce &#224; Gemini. Google rend gratuits plusieurs outils d&#8217;IA comme les r&#233;ponses sugg&#233;r&#233;es et les aper&#231;us IA pour tous les utilisateurs et inaugure de nouvelles fonctions avanc&#233;es pour les utilisateurs Premium.</description>
    </item>
    <item>
      <title>Volvo's EX60 electric crossover promises 400 miles of EPA range</title>
      <link>https://www.engadget.com/transportation/evs/volvos-ex60-electric-crossover-promises-400-miles-of-epa-range-130008964.html?src=rss</link>
      <pubDate>Thu, 08 Jan 2026 13:00:08 +0000</pubDate>
      <guid isPermaLink="false">bf1e86bc-89fe-4e8a-89b9-794696cd4a0c</guid>
      <description>Ahead of a launch later this month, Volvo has teased some impressive details about its upcoming electric crossover. The EX60, which slots between the EX40 and EX90, will offer an EPA range of 400 miles, beating all other Volvos and most EVs in general. It will also be the first Volvo car to use a megacasting process designed to reduce weight and boost manufacturing efficiency.&#160;
"With our new electric vehicle architecture, we directly address the main worries that customers have when considering a switch to a fully electric car," said Volvo CTO Anders Bell. "The result is class-leading range an...</description>
    </item>
    <item>
      <title>Google Is Adding an &#8216;AI Inbox&#8217; to Gmail That Summarizes Emails</title>
      <link>https://www.wired.com/story/google-ai-inbox-gmail/</link>
      <pubDate>Thu, 08 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">695eb3ebb7928968df924fdb</guid>
      <description>New Gmail features, powered by the Gemini model, are part of Google&#8217;s continued push for users to incorporate AI into their daily life and conversations.</description>
    </item>
    <item>
      <title>Google is taking over your Gmail inbox with AI</title>
      <link>https://www.theverge.com/news/857883/google-gmail-ai-inbox-overviews</link>
      <pubDate>2026-01-08T08:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=857883</guid>
      <description>Google is announcing a new AI Inbox view for Gmail that, instead of presenting your emails in a traditional list, uses AI to offer personalized to-dos and summaries of topics you might want to follow from your emails. It's a potentially huge shift in how you might navigate your Gmail, especially if you have a [&#8230;]</description>
    </item>
    <item>
      <title>Former Bolt CEO Maju Kuruvilla&#8217;s startup triples to $100M valuation</title>
      <link>https://techcrunch.com/2026/01/08/former-bolt-ceo-maju-kuruvillas-startup-triples-to-100m-valuation/</link>
      <pubDate>Thu, 08 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3080967</guid>
      <description>Spangle has raised $15 million in a Series A round to expand its AI-generated shopping experiences.</description>
    </item>
    <item>
      <title>Gmail is getting a whole host of AI updates to try and solve your most irritating workplace tasks</title>
      <link>https://www.techradar.com/pro/gmail-is-getting-a-whole-host-of-ai-updates-to-try-and-solve-your-most-irritating-workplace-tasks</link>
      <pubDate>Thu, 08 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">LBDSgwBtT3qWY2rAZhEJGe</guid>
      <description>From smarter replies to even more AI overviews, more AI is coming to Gmail.</description>
    </item>
    <item>
      <title>Gmail is getting a Gemini AI overhaul</title>
      <link>https://www.engadget.com/ai/gmail-is-getting-a-gemini-ai-overhaul-130000422.html?src=rss</link>
      <pubDate>Thu, 08 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">35334ee6-ec07-421d-8f19-ffc6d9b5d1f8</guid>
      <description>In a move that should surprise nobody, Google is stuffing more Gemini AI into Gmail. A host of new features, some of which are already familiar to Workspace users, are rolling out today for Gmail users in the US. Some are free, while others require a Google AI Pro or Ultra subscription.The first premium feature is AI Overviews, the same name as a similar feature in Google Search. Gmail&#8217;s version lets you ask questions about your messages in the search bar, using natural language. Google uses the example of, "Who was the plumber that gave me a quote for the bathroom renovation last year?" It&#8217;s ...</description>
    </item>
    <item>
      <title>The gaming monitors that caught our eye at CES 2026</title>
      <link>https://www.engadget.com/computing/accessories/the-gaming-monitors-that-caught-our-eye-at-ces-2026-130000433.html?src=rss</link>
      <pubDate>Thu, 08 Jan 2026 13:00:00 +0000</pubDate>
      <guid isPermaLink="false">956bf7a1-2d74-4ed3-9241-ef90d36cecbf</guid>
      <description>CES is about many things, but primarily it's about screens. TVs and laptops get the most attention, but you'll find all kinds of new PC monitors, too. At CES 2026, several companies are using the trade show as an opportunity to update their gaming monitor lineups. This year expanding what OLED panels can do in terms of refresh rates, brightness and color production is the big focus, but there's some more unusual options, too, like a glasses-free 3D monitor. The collection below are some of our favorite gaming monitors that have already been announced:&#160;LG UltraGear GX7LG's latest QHD OLED gamin...</description>
    </item>
    <item>
      <title>Le t&#233;lescope James-Webb surprend les astronomes : des &#233;toiles primitives formaient d&#233;j&#224; de la poussi&#232;re !</title>
      <link>https://www.futura-sciences.com/sciences/actualites/univers-telescope-james-webb-surprend-astronomes-etoiles-primitives-formaient-deja-poussiere-129898/#xtor%3DRSS-8</link>
      <pubDate>Thu, 08 Jan 2026 13:57:55 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/univers-telescope-james-webb-surprend-astronomes-etoiles-primitives-formaient-deja-poussiere-129898/#xtor%3DRSS-8</guid>
      <description>La galaxie Sextans A offre aux astronomes une opportunit&#233; unique de mieux comprendre ce qui se jouait dans les premi&#232;res galaxies de notre Univers. En l&#8217;observant &#224; l&#8217;aide du t&#233;lescope spatial James-Webb, ils viennent d&#8217;y faire une d&#233;couverte &#224; laquelle ils ne s&#8217;attendaient vraiment...</description>
    </item>
    <item>
      <title>L&#8217;IA clone la voix des commentateurs pour PSG-OM&#160;: une premi&#232;re mondiale ce soir</title>
      <link>https://www.01net.com/actualites/lia-clone-la-voix-des-commentateurs-pour-psg-om-une-premiere-mondiale-ce-soir.html</link>
      <pubDate>Thu, 08 Jan 2026 12:48:47 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318784</guid>
      <description>Grande premi&#232;re ce soir pour le Troph&#233;e des Champions &#224; Kowe&#239;t City. La LFP teste une IA capable de traduire les commentaires en italien tout en clonant la voix des journalistes fran&#231;ais.</description>
    </item>
    <item>
      <title>Boulanger solde &#224; -30 % ce TV Mini LED ultra lumineux (165 Hz) not&#233; 9/10 par nos soins</title>
      <link>https://www.frandroid.com/bons-plans/2934805_boulanger-solde-a-30-ce-tv-mini-led-ultra-lumineux-165-hz-note-9-10-par-nos-soins</link>
      <pubDate>Thu, 08 Jan 2026 12:46:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2934805_boulanger-solde-a-30-ce-tv-mini-led-ultra-lumineux-165-hz-note-9-10-par-nos-soins</guid>
      <description>
Le t&#233;l&#233;viseur Hisense 55U8Q est un mod&#232;le haut de gamme r&#233;put&#233; pour sa luminosit&#233; record avec ses Mini-LED, &#224; retrouver pour 699 euros au lieu de 999 euros sur Boulanger.
</description>
    </item>
    <item>
      <title>DJI Avata 360 leak shows versatile drone could beat Insta360 with one unique feature</title>
      <link>https://www.techradar.com/cameras/drones/dji-avata-360-leak-shows-versatile-drone-could-beat-insta360-with-one-unique-feature</link>
      <pubDate>Thu, 08 Jan 2026 12:41:54 +0000</pubDate>
      <guid isPermaLink="false">dPRvSJTQ2jGiF69h4n6f6U</guid>
      <description>We have more pictures of the DJI Avata 360, and it looks as though it's ready to take on the Antigravity A1.</description>
    </item>
    <item>
      <title>I love the new Philips Hue Essential smart bulbs, but how do the new Lifx Everyday lights compare?</title>
      <link>https://www.techradar.com/tech-events/i-love-the-new-philips-hue-essential-smart-bulbs-but-how-do-the-new-lifx-everyday-lights-compare</link>
      <pubDate>Thu, 08 Jan 2026 12:41:11 +0000</pubDate>
      <guid isPermaLink="false">hsD6nsjDmGHxwtT8JNohXh</guid>
      <description>Lifx has followed in Hue's footsteps with a new line of cheap and very cheerful bulbs, but which ones should be brightening your home?</description>
    </item>
    <item>
      <title>Sony unveiled a new 'HyperPop' accessory collection &#8212; but it's absolutely hideous</title>
      <link>https://www.techradar.com/gaming/playstation/sony-unveiled-a-new-hyperpop-accessory-collection-but-its-absolutely-hideous</link>
      <pubDate>Thu, 08 Jan 2026 12:39:00 +0000</pubDate>
      <guid isPermaLink="false">hbtwhaeNqSUaZ4TMcQ2GXi</guid>
      <description>Sony has just revealed some seriously ugly new DualSense Wireless Controllers and PS5 console covers.</description>
    </item>
    <item>
      <title>'Deliciously bonkers' or 'Too grim to be fun'? New Netflix show His &amp; Hers divides critics &#8212; but they all love its wild ending</title>
      <link>https://www.techradar.com/streaming/netflix/deliciously-bonkers-or-too-grim-to-be-fun-new-netflix-show-his-and-hers-divides-critics-but-they-all-love-its-wild-ending</link>
      <pubDate>Thu, 08 Jan 2026 12:36:25 +0000</pubDate>
      <guid isPermaLink="false">otpde6oZaKs5UjfnPWS3w</guid>
      <description>His &amp; Hers is a new Netflix murder-mystery show that's already drawing attention for its shocking ending.</description>
    </item>
    <item>
      <title>Google Messages : cette nouveaut&#233; va enfin soulager vos pouces</title>
      <link>https://www.frandroid.com/marques/google/2935039_google-messages-cette-nouveaute-va-enfin-soulager-vos-pouces</link>
      <pubDate>Thu, 08 Jan 2026 12:36:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/google/2935039_google-messages-cette-nouveaute-va-enfin-soulager-vos-pouces</guid>
      <description>
Les adeptes de grands &#233;crans vont bient&#244;t pouvoir reposer leurs mains. Google Messages simplifie son interface pour s&#8217;utiliser &#224; une main.
</description>
    </item>
    <item>
      <title>Creatine Supplements Are Everywhere. Do I Need Them? (2026)</title>
      <link>https://www.wired.com/story/should-you-be-taking-creatine-supplements/</link>
      <pubDate>Thu, 08 Jan 2026 12:30:00 +0000</pubDate>
      <guid isPermaLink="false">689160a414f0f4742efb6f62</guid>
      <description>It's the most studied supplement in sports medicine, but it's not just for athletes anymore.</description>
    </item>
    <item>
      <title>WhatsApp is getting one of its best upgrades in years &#8212; here are 3 new ways to supercharge your group chats</title>
      <link>https://www.techradar.com/phones/whatsapp-is-getting-one-of-its-best-upgrades-in-years-here-are-3-new-ways-to-supercharge-your-group-chats</link>
      <pubDate>Thu, 08 Jan 2026 12:28:25 +0000</pubDate>
      <guid isPermaLink="false">94uiKth9jwA77CtPzhwU8Z</guid>
      <description>These new WhatsApp tools are coming to group chats &#8212; and I can't wait to get my hands on the new text sticker feature.</description>
    </item>
    <item>
      <title>Grab the classic Kindle for its best price since Black Friday on Amazon</title>
      <link>https://www.techradar.com/tablets/ereaders/grab-the-classic-kindle-for-its-best-price-since-black-friday-on-amazon</link>
      <pubDate>Thu, 08 Jan 2026 12:26:09 +0000</pubDate>
      <guid isPermaLink="false">e4GFvxKW999ore9dyZJ8wk</guid>
      <description>Missed out on the deals over Black Friday? The Amazon Kindle is on sale again in the January sales at Amazon for a great low price.</description>
    </item>
    <item>
      <title>Anker is putting screens on its latest smart chargers &#8211; and the idea is dividing opinion</title>
      <link>https://www.techradar.com/phones/iphone/anker-is-putting-screens-on-its-latest-smart-chargers-and-the-idea-is-dividing-opinion</link>
      <pubDate>Thu, 08 Jan 2026 12:18:15 +0000</pubDate>
      <guid isPermaLink="false">GcLxe4tqdrfYCkrzvMU47k</guid>
      <description>The new Anker Nano Charger can recognize what it's plugged into, has a built-in screen, and delivers 45W of power.</description>
    </item>
    <item>
      <title>R&#233;p&#233;ter le m&#234;me mouvement des centaines de fois&#160;: en Chine, ces travailleurs &#171;&#160;forment&#160;&#187; les robots humano&#239;des</title>
      <link>https://www.01net.com/actualites/repeter-le-meme-mouvement-des-centaines-de-fois-en-chine-ces-travailleurs-forment-les-robots-humanoides.html</link>
      <pubDate>Thu, 08 Jan 2026 12:15:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1318774</guid>
      <description>Des centaines de &#171; cyber-travailleurs &#187; entra&#238;neraient, en Chine, des robots humano&#239;des &#224; ex&#233;cuter des gestes manuels. Dans le pays, 40 &#171;&#160;usines de donn&#233;es pour humano&#239;des &#187; ont &#233;t&#233; financ&#233;es par P&#233;kin.</description>
    </item>
    <item>
      <title>The Lego Disney and Pixar &#8216;Up&#8217; House has been marked down to under $40 at Amazon &#8212; save $22</title>
      <link>https://mashable.com/article/jan-8-lego-disney-pixar-up-house-deal</link>
      <pubDate>Thu, 08 Jan 2026 12:15:14 +0000</pubDate>
      <guid isPermaLink="false">04VBQjUmepLmJnTPZECGKqG</guid>
      <description>As of Jan. 8, the Lego Disney and Pixar &#8216;Up&#8217; House is on sale at Amazon for $37.99, a 37% discount from its list price of $59.99.</description>
    </item>
    <item>
      <title>Both Pok&#233;mon TCG: Mega Evolution Elite Trainer Boxes are now around market price at Amazon</title>
      <link>https://mashable.com/article/jan-8-pokemon-tcg-mega-evolution-elite-trainer-box-deal</link>
      <pubDate>Thu, 08 Jan 2026 12:08:14 +0000</pubDate>
      <guid isPermaLink="false">00230sIMKZAaHyUUtzGBq7x</guid>
      <description>Both Pok&#233;mon TCG: Mega Evolution Elite Trainer Boxes are now priced closer to market value at Amazon, with the Mega Gardevoir ETB dropping below $100.</description>
    </item>
    <item>
      <title>&#8216;Starfleet Academy&#8217; Is a Solid Successor to the &#8216;Star Trek&#8217; Legacy</title>
      <link>https://gizmodo.com/star-trek-starfleet-academy-review-parmount-plus-2000706983</link>
      <pubDate>Thu, 08 Jan 2026 12:00:34 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000706983</guid>
      <description>'Starfleet Academy' follows on in the style of 'Discovery,' for better and occasionally worse&#8212;but builds something interesting of its own out of inheriting the legacy of 'Star Trek.'</description>
    </item>
    <item>
      <title>Gizmodo&#8217;s Best of CES 2026 Awards: See the Winners</title>
      <link>https://gizmodo.com/gizmodo-best-of-ces-2026-awards-see-the-winners-2000697475</link>
      <pubDate>Thu, 08 Jan 2026 12:00:28 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000697475</guid>
      <description>Here's all the tech that most impressed us at the 2026 Consumer Electronics Show in Las Vegas.</description>
    </item>
    <item>
      <title>2026 Is the Year of the RGB LED TV</title>
      <link>https://www.wired.com/story/rgb-led-televisions-2026/</link>
      <pubDate>Thu, 08 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">695e92ea935a482826bd5f85</guid>
      <description>The crop of next-generation TVs arriving this year has more accurate colors than ever, thanks to a fancy new kind of backlighting.</description>
    </item>
    <item>
      <title>The gap between premium and budget&#160;TV&#160;brands is quickly closing</title>
      <link>https://www.theverge.com/tech/857325/the-gap-between-premium-and-budget-tv-brands-is-quickly-closing</link>
      <pubDate>2026-01-08T07:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=857325</guid>
      <description>For all the time that I've been covering technology, there's been a hierarchy when it comes to TV brands. The big three - Sony, Samsung, and LG - have been on top for a while. Pioneer and Panasonic were up there with plasma TVs, and Panasonic is getting back in the game in the States. [&#8230;]</description>
    </item>
    <item>
      <title>America&#8217;s new era of energy imperialism is about more than oil</title>
      <link>https://www.theverge.com/report/857978/trump-venezuela-greenland-oil-mineral-energy-imperialism</link>
      <pubDate>2026-01-08T07:00:00-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=857978</guid>
      <description>President Donald Trump has no shame in admitting what he wants to get out of attacking Venezuela and threatening other energy resource-rich nations. "We're gonna get the oil flowing the way it should be," he said January 3rd, soon after his administration stunned the world with what many policy experts and Democratic lawmakers are calling [&#8230;]</description>
    </item>
    <item>
      <title>Disney+ is launching vertical videos this year</title>
      <link>https://www.engadget.com/entertainment/streaming/disney-is-launching-vertical-videos-this-year-120000776.html?src=rss</link>
      <pubDate>Thu, 08 Jan 2026 12:00:00 +0000</pubDate>
      <guid isPermaLink="false">f606e980-7480-413e-895a-48454997721b</guid>
      <description>Disney+ will add vertical videos to its service in the US sometime this year, in hopes that they can entice viewers to engage with its app every day. The company has made the announcement at its Tech + Data Showcase event at CES 2026. Disney first dabbled in vertical content with Verts, which launched for the ESPN app in August 2025, giving it the insight it needed on how its users respond to the video format. Erin Teague, Disney Entertainment&#8217;s EVP of Product Management, told Deadline that the company will use the format for all kinds of content. The service isn&#8217;t just planning to use it as a...</description>
    </item>
    <item>
      <title>Fujifilm&#8217;s new Super 8-style video camera is the weirdest Instax ever &#8211; but it could also be the most fun</title>
      <link>https://www.techradar.com/cameras/instant-cameras/fujifilms-new-super-8-style-video-camera-is-the-weirdest-instax-ever-but-it-could-also-be-the-most-fun</link>
      <pubDate>Thu, 08 Jan 2026 11:58:21 +0000</pubDate>
      <guid isPermaLink="false">c5Rw6K3BoPiLbNHxpUDShd</guid>
      <description>The Fujifilm Instax Mini Evo Cinema is the oddest-looking Instax camera yet but it's likely to prove a huge hit with the younger, retro-loving generation</description>
    </item>
    <item>
      <title>Apple AirPods Pro 3 are down to under $200 at Amazon &#8212; act fast to save</title>
      <link>https://mashable.com/article/jan-8-apple-airpods-pro-3-deal</link>
      <pubDate>Thu, 08 Jan 2026 11:57:46 +0000</pubDate>
      <guid isPermaLink="false">02C8iRcB0EwVlZm7DVA9biG</guid>
      <description>As of Jan. 8, the AirPods Pro 3 are marked down to $199.99 at Amazon. This is 20% off their list price of $249.</description>
    </item>
    <item>
      <title>Ce puissant laptop HP de 16&#8243; avec un Ryzen 7 et une RTX 5070 perd 30% de son prix pendant les soldes d&#8217;hiver</title>
      <link>https://www.frandroid.com/bons-plans/2934603_ce-puissant-laptop-hp-de-16-avec-un-ryzen-7-et-une-rtx-5070-perd-30-de-son-prix-pendant-les-soldes-dhiver</link>
      <pubDate>Thu, 08 Jan 2026 11:54:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2934603_ce-puissant-laptop-hp-de-16-avec-un-ryzen-7-et-une-rtx-5070-perd-30-de-son-prix-pendant-les-soldes-dhiver</guid>
      <description>
Une configuration forte &#224; base de Ryzen AI 7, RTX 5070, 16 Go de RAM et 512 Go de stockage, le tout enferm&#233; dans un ch&#226;ssis 16 pouces. Voil&#224; le HP Omen 16-ap0038nf. Et pour les soldes d&#8217;hiver, la claque est aussi sur l&#8217;&#233;tiquette : de 1 703,99 &#8364; &#224; 1 192,79 &#8364;.
</description>
    </item>
    <item>
      <title>LEGO Smart Brick : tout savoir sur la brique connect&#233;e qui r&#233;volutionne la construction</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/2902811_lego-smart-brick-tout-savoir-sur-la-brique-connectee-qui-revolutionne-la-construction</link>
      <pubDate>Thu, 08 Jan 2026 11:48:33 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/2902811_lego-smart-brick-tout-savoir-sur-la-brique-connectee-qui-revolutionne-la-construction</guid>
      <description>
LEGO vient d'amorcer une v&#233;ritable r&#233;volution. Une brique intelligente, bard&#233;e de capteurs et rechargeable sans fil, s'appr&#234;te &#224; d&#233;barquer dans vos sets Star Wars et Pok&#233;mon. Sur le papier, c'est fascinant. Dans la r&#233;alit&#233; ? C'est complexe.
</description>
    </item>
  </channel>
</rss>
