<rss version="2.0">
  <channel>
    <title>RSS Aggregator Feed</title>
    <link>https://abdoullah-code.github.io/rss-aggregator/aggregated_feed.xml</link>
    <description>An aggregated feed of Technology-related news</description>
    <lastBuildDate>Fri, 14 Nov 2025 11:35:15 GMT</lastBuildDate>
    <item>
      <title>Black Friday sur les montres connect&#233;es : voici les meilleures offres sur les smartwatches Apple, Garmin, Xiaomi, Samsung&#8230;</title>
      <link>https://www.frandroid.com/bons-plans/2854639_top-offres-black-friday-montres-bracelets-connectes</link>
      <pubDate>Fri, 14 Nov 2025 11:34:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2854639_top-offres-black-friday-montres-bracelets-connectes</guid>
      <description>
Nous ne sommes que mi-novembre, mais les promotions d&#233;barquent avant l&#8217;heure. Ce pr&#233;-Black Friday met &#224; l&#8217;honneur les montres connect&#233;es et les bracelets, orient&#233;s sport ou lifestyle. Tour d&#8217;horizon des meilleures offres d&#233;j&#224; propos&#233;es par les e-commer&#231;ants pour s'offrir une smartwach &#224; prix cass&#233;.
</description>
    </item>
    <item>
      <title>Ce constructeur chinois a d&#233;truit un escalier historique en testant son SUV &#233;lectrique</title>
      <link>https://www.frandroid.com/survoltes/voitures-electriques/2869431_ce-constructeur-chinois-a-detruit-un-escalier-historique-en-testant-son-suv-electrique</link>
      <pubDate>Fri, 14 Nov 2025 11:30:49 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/voitures-electriques/2869431_ce-constructeur-chinois-a-detruit-un-escalier-historique-en-testant-son-suv-electrique</guid>
      <description>
Chery a voulu reproduire l'exploit viral de Range Rover sur l'escalier du Paradis chinois.
</description>
    </item>
    <item>
      <title>Amazon ne fait pas l&#8217;impasse sur le pr&#233;-Black Friday : voici les 17 offres &#224; saisir</title>
      <link>https://www.frandroid.com/bons-plans/2860071_amazon-brade-deja-un-tas-de-produits-tech-pour-le-pre-black-friday-les-14-offres-a-retenir</link>
      <pubDate>Fri, 14 Nov 2025 11:26:17 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2860071_amazon-brade-deja-un-tas-de-produits-tech-pour-le-pre-black-friday-les-14-offres-a-retenir</guid>
      <description>
Amazon lance d&#233;j&#224; ses premi&#232;res promotions avant le Black Friday et baisse fortement les prix sur de nombreux produits Tech. D&#233;couvrez d&#232;s maintenant les meilleures offres &#224; ne pas manquer.
</description>
    </item>
    <item>
      <title>ChatGPT&#160;: le chat en groupe arrive enfin, mais il y a un hic</title>
      <link>https://www.01net.com/actualites/chatgpt-le-chat-en-groupe-arrive-enfin-mais-il-y-a-un-hic.html</link>
      <pubDate>Fri, 14 Nov 2025 11:15:59 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308125</guid>
      <description>OpenAI d&#233;ploie enfin les discussions de groupe sur ChatGPT, permettant jusqu&#8217;&#224; vingt participants dans une m&#234;me conversation. Une avanc&#233;e taill&#233;e pour la collaboration, mais qui se fait encore attendre en France.</description>
    </item>
    <item>
      <title>Quelle voiture &#233;lectrique familiale choisir en 2025&#8201;?</title>
      <link>https://www.frandroid.com/guide-dachat/guides-dachat-survoltes/guides-dachat-voitures/916319_quelle-voiture-electrique-familiale-choisir-en-2021</link>
      <pubDate>Fri, 14 Nov 2025 11:12:08 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/guide-dachat/guides-dachat-survoltes/guides-dachat-voitures/916319_quelle-voiture-electrique-familiale-choisir-en-2021</guid>
      <description>
Le choix d'un v&#233;hicule &#233;lectrique est diff&#233;rent selon les usages, et c'est celui des familles qui nous int&#233;resse dans ce guide. Nous passons ici en revue l'offre actuelle des voitures &#233;lectriques familiales. Voici notre s&#233;lection des meilleurs mod&#232;les.
</description>
    </item>
    <item>
      <title>Web services giant Aruba spoofed in major phishing scam - here's what to look out for to stay safe</title>
      <link>https://www.techradar.com/pro/security/web-services-giant-aruba-spoofed-in-major-phishing-scam-heres-what-to-look-out-for-to-stay-safe</link>
      <pubDate>Fri, 14 Nov 2025 11:09:03 +0000</pubDate>
      <guid isPermaLink="false">8v2ddZkg3o9snff69mS4sW</guid>
      <description>Group-IB found a highly sophisticated phishing kit designed to mimic Aruba and its services.</description>
    </item>
    <item>
      <title>EE is giving away a free exclusive Black Ops 7 skin &#8211; here's how to get it</title>
      <link>https://www.techradar.com/gaming/ee-is-giving-away-a-free-exclusive-black-ops-7-skin-heres-how-to-get-it</link>
      <pubDate>Fri, 14 Nov 2025 11:06:14 +0000</pubDate>
      <guid isPermaLink="false">eB43a5akLhHceyfyA7Kz38</guid>
      <description>Call of Duty: Black Ops 7 players can grab a free skin with EE.</description>
    </item>
    <item>
      <title>I absolutely loved reviewing this Marshall Bluetooth speaker, and I'd buy it in a flash at this early Black Friday price</title>
      <link>https://www.techradar.com/audio/wireless-bluetooth-speakers/i-absolutely-loved-reviewing-this-marshall-bluetooth-speaker-and-id-buy-it-in-a-flash-at-this-early-black-friday-price</link>
      <pubDate>Fri, 14 Nov 2025 11:04:06 +0000</pubDate>
      <guid isPermaLink="false">feqMxzrwZ8xMnnMDqpe3c8</guid>
      <description>No need to wait for Black Friday &#8211; this is a really good deal on Marshall's pocket rocket</description>
    </item>
    <item>
      <title>The 31 Best Deals From REI&#8217;s 2025 Holiday Sale</title>
      <link>https://www.wired.com/story/rei-holiday-sale-nov-2025/</link>
      <pubDate>Fri, 14 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">69135bc29e6e0c240d2d720e</guid>
      <description>The company that wants you to #optoutside for Black Friday is having its sale early. Gear up for next year with these great deals on packs, sleeping bags, merino wool, and more.</description>
    </item>
    <item>
      <title>How to cancel PrivadoVPN and get a $20 refund</title>
      <link>https://www.techradar.com/vpn/vpn-services/how-to-cancel-privadovpn-and-get-a-usd20-refund</link>
      <pubDate>Fri, 14 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">iZrrfXkKLEgEpErTsHik2g</guid>
      <description>Cancelling PrivadoVPN's auto-renewal is simple - and don't forget your refund</description>
    </item>
    <item>
      <title>5 signs you&#8217;re working for a performative manager (and how to outsmart them)</title>
      <link>https://www.fastcompany.com/91437202/5-signs-youre-working-for-a-performative-manager-and-how-to-outsmart-them</link>
      <pubDate>2025-11-14T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91437202/5-signs-youre-working-for-a-performative-manager-and-how-to-outsmart-them</guid>
      <description>Their favorite project is themselves.
Every workplace seems to have one. A manager who goes silent for days, then suddenly reappears in the team chat the moment senior leadership checks in. They&#8217;ll swoop in to take credit for the work they hadn&#8217;t touched, and say, &#8220;Oh yes, we&#8217;ve been addressing that.&#8221;</description>
    </item>
    <item>
      <title>Is pet insurance worth it?</title>
      <link>https://www.fastcompany.com/91439699/is-pet-insurance-worth-it</link>
      <pubDate>2025-11-14T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91439699/is-pet-insurance-worth-it</guid>
      <description>Pet insurance&#8212;once the province of dusty brochures at the vet&#8217;s office&#8212;has gone mainstream. But do you really need it? 
If you&#8217;ve ever taken a sick pet to the vet&#8217;s office, you know the pain of seeing your four-footed family member hurting. Then, of course, comes the secondary anguish of figuring how to pay for their veterinary care, which may have you wishing you&#8217;d ponied up for pet insurance....</description>
    </item>
    <item>
      <title>This hotel suite is a perfect replica of the iconic &#8216;Goodnight Moon&#8217; room</title>
      <link>https://www.fastcompany.com/91441300/this-hotel-suite-is-a-perfect-replica-of-the-iconic-goodnight-moon-room</link>
      <pubDate>2025-11-14T11:00:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91441300/this-hotel-suite-is-a-perfect-replica-of-the-iconic-goodnight-moon-room</guid>
      <description>Good night room, good night moon, good night Sherton Hotels &amp; Resorts.
If you were one of the millions of children who grew up reading Goodnight Moon before bed, chances are its iconic green bedroom is permanently seared into your memory. Now, for the next four months, you have the opportunity to sleep in the Goodnight Moon room IRL.</description>
    </item>
    <item>
      <title>Lady Gaga Reveals Her Reaction to All the &#8216;Joker: Folie &#224; Deux&#8217; Hate</title>
      <link>https://gizmodo.com/lady-gaga-reveals-her-reaction-to-all-the-joker-folie-a-deux-hate-2000685557</link>
      <pubDate>Fri, 14 Nov 2025 11:00:00 +0000</pubDate>
      <guid isPermaLink="false">https://gizmodo.com/?p=2000685557</guid>
      <description>The actor and pop superstar bounced back after co-starring in the flop, but it was a notably painful experience.</description>
    </item>
    <item>
      <title>ChatGPT launches pilot group chats across Japan, New Zealand, South Korea, and Taiwan</title>
      <link>https://techcrunch.com/2025/11/14/chatgpt-launches-pilot-group-chats-across-japan-new-zealand-south-korea-and-taiwan/</link>
      <pubDate>Fri, 14 Nov 2025 10:58:08 +0000</pubDate>
      <guid isPermaLink="false">https://techcrunch.com/?p=3067884</guid>
      <description>OpenAI on Thursday unveiled a group chat feature for ChatGPT, currently in pilot across Japan, New Zealand, South Korea, and Taiwan, allowing users to collaborate directly within the app.</description>
    </item>
    <item>
      <title>Should I buy a Dyson V8 or a V11 in the early Black Friday sale? Here's what you need to know</title>
      <link>https://www.techradar.com/home/vacuums/should-i-buy-a-dyson-v8-or-a-v11-in-the-black-friday-sale</link>
      <pubDate>Fri, 14 Nov 2025 10:57:49 +0000</pubDate>
      <guid isPermaLink="false">D2p8feXXoSWEgvznTGZJiP</guid>
      <description>Here's exactly how the two vacuums compare, and which delivers best value for money right now.</description>
    </item>
    <item>
      <title>From age verification to weakening encryption: 2025 saw a decline in online anonymity everywhere</title>
      <link>https://www.techradar.com/vpn/vpn-privacy-security/from-age-verification-to-weakening-encryption-2025-saw-a-decline-in-online-anonymity-everywhere</link>
      <pubDate>Fri, 14 Nov 2025 10:56:16 +0000</pubDate>
      <guid isPermaLink="false">EDrT2TGvBvUR4v4F7DwUpd</guid>
      <description>Internet freedoms have worsened for the 15th consecutive year, according to Freedom House's new report. And VPNs are increasingly a target.</description>
    </item>
    <item>
      <title>Intel ouvre sa Frame Generation aux puces Meteor Lake, et c&#8217;est une excellente nouvelle</title>
      <link>https://www.frandroid.com/produits-android/ordinateurs/processeurs/2868897_intel-ouvre-sa-frame-generation-aux-puces-meteor-lake-et-cest-une-excellente-nouvelle</link>
      <pubDate>Fri, 14 Nov 2025 10:52:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/ordinateurs/processeurs/2868897_intel-ouvre-sa-frame-generation-aux-puces-meteor-lake-et-cest-une-excellente-nouvelle</guid>
      <description>
Intel accroit un peu plus encore l'ouverture de son bouquet de technologies XeSS 2. Apr&#232;s en avoir permis l'activation aux cartes graphiques tierces, le g&#233;ant am&#233;ricain en offre cette semaine l'usufruit &#224; ses anciennes puces Meteor Lake.
</description>
    </item>
    <item>
      <title>Fire TV Stick&#160;: Amazon va-t-il laisser tomber Android au profit de Vega OS&#160;?</title>
      <link>https://www.01net.com/actualites/fire-tv-stick-amazon-laisser-tomber-android-profit-vega-os.html</link>
      <pubDate>Fri, 14 Nov 2025 10:52:01 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308129</guid>
      <description>L&#8217;arriv&#233;e de Vega OS sur le nouveau Fire TV Stick soul&#232;ve une question que beaucoup d'utilisateurs se posent : Amazon va-t-il abandonner ses Fire TV Stick sous Android ?</description>
    </item>
    <item>
      <title>Pr&#233;-Black Friday : les 22 meilleurs deals Fnac et Darty &#224; ne pas manquer en novembre</title>
      <link>https://www.frandroid.com/bons-plans/2849237_top-promo-fnac-darty-la-selection-pre-black-friday</link>
      <pubDate>Fri, 14 Nov 2025 10:51:06 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2849237_top-promo-fnac-darty-la-selection-pre-black-friday</guid>
      <description>
Le pr&#233;-Black Friday bat son plein chez les diff&#233;rents e-commer&#231;ants fran&#231;ais. &#201;videmment, la Fnac et Darty sont de la partie pour vous faire de belles &#233;conomies. Voici les meilleurs produits Tech en promotion que l&#8217;on recommande &#224; cette occasion.
</description>
    </item>
    <item>
      <title>M&#234;me la Switch 2 n&#8217;&#233;chappe pas au Black Friday ! Voici les meilleurs deals sur les consoles, jeux, manettes et accessoires</title>
      <link>https://www.frandroid.com/bons-plans/2853043_meme-la-nintendo-switch-2-nechappe-pas-au-black-friday-voici-les-12-meilleurs-deals-sur-les-consoles-manettes-et-accessoires</link>
      <pubDate>Fri, 14 Nov 2025 10:50:20 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2853043_meme-la-nintendo-switch-2-nechappe-pas-au-black-friday-voici-les-12-meilleurs-deals-sur-les-consoles-manettes-et-accessoires</guid>
      <description>
L'ann&#233;e 2025 a &#233;t&#233; on ne peut plus riche pour le jeu vid&#233;o. Outre la sortie de nouveaux titres, la Nintendo Switch 2 a la part belle depuis plusieurs mois. D'autant plus qu'elle fait partie des meilleures offres dans cette s&#233;lection du pr&#233;-Black Friday, en pack avec Mario Kart World ou avec des accessoires suppl&#233;mentaires.
</description>
    </item>
    <item>
      <title>AMD am&#233;liore enfin le Ray Tracing sur ses GPU, mais seulement sur Call of Duty Black Ops 7</title>
      <link>https://www.frandroid.com/marques/amd/2869109_amd-ameliore-enfin-le-ray-tracing-sur-ses-gpu-mais-seulement-sur-call-of-duty-black-ops-7</link>
      <pubDate>Fri, 14 Nov 2025 10:49:43 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/amd/2869109_amd-ameliore-enfin-le-ray-tracing-sur-ses-gpu-mais-seulement-sur-call-of-duty-black-ops-7</guid>
      <description>
AMD profite de la sortie de Call of Duty : Black Ops 7 pour ajouter une nouvelle fonctionnalit&#233; tr&#232;s attendue &#224; sa suite de technologies&#160;FSR : la Ray Generation.
</description>
    </item>
    <item>
      <title>Fairphone 6 : ce r&#233;cent smartphone &#233;coresponsable baisse son prix &#224; l&#8217;occasion du pr&#233;-Black Friday</title>
      <link>https://www.frandroid.com/bons-plans/2787581_fairphone-6-ce-recent-smartphone-ecoresponsable-baisse-son-prix-a-loccasion-du-pre-black-friday</link>
      <pubDate>Fri, 14 Nov 2025 10:49:09 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/bons-plans/2787581_fairphone-6-ce-recent-smartphone-ecoresponsable-baisse-son-prix-a-loccasion-du-pre-black-friday</guid>
      <description>
Avec son Fairphone 6, la marque n&#233;erlandaise est enfin parvenue &#224; proposer un smartphone modulaire, r&#233;parable, mais aussi dot&#233; d&#8217;une fiche technique bien plus actuelle. M&#234;me s'il est sorti il y a peu de temps, ce nouveau smartphone &#233;thique peut actuellement vous revenir &#224; 549,99 euros au lieu de 599,99 euros.
</description>
    </item>
    <item>
      <title>The latest Nintendo Switch 2 update is good for eShop browsers, potentially horrible for third-party dock owners</title>
      <link>https://www.techradar.com/gaming/the-latest-nintendo-switch-2-update-is-good-for-eshop-browsers-potentially-horrible-for-third-party-dock-owners</link>
      <pubDate>Fri, 14 Nov 2025 10:46:49 +0000</pubDate>
      <guid isPermaLink="false">yPy2jw8iwA6eHC7TWoNUef</guid>
      <description>Nintendo may have quietly blocked third-party docks with its latest Switch 2 update.</description>
    </item>
    <item>
      <title>Software makers say piracy is becoming a bigger problem than ever before - so what can be done?</title>
      <link>https://www.techradar.com/pro/software-makers-say-piracy-is-becoming-a-bigger-problem-than-ever-before-so-what-can-be-done</link>
      <pubDate>Fri, 14 Nov 2025 10:44:03 +0000</pubDate>
      <guid isPermaLink="false">JWkyavj2sAzZF2xwawRkiT</guid>
      <description>Software makers are losing revenue because of growing piracy and license misuse.</description>
    </item>
    <item>
      <title>WhatsApp is launching third-party chat integration in Europe</title>
      <link>https://www.theverge.com/news/820858/whatsapp-third-party-messaging-date-eu-e2ee</link>
      <pubDate>2025-11-14T05:41:35-05:00</pubDate>
      <guid isPermaLink="false">https://www.theverge.com/?p=820858</guid>
      <description>Meta is on the cusp of launching third-party integration with WhatsApp in Europe &#8212; something that&#8217;s required by the Digital Markets Act (DMA). It&#8217;s rolling out &#8220;over the coming months&#8221; with WhatsApp&#8217;s level of end-to-end encryption (E2EE) maintained. Meta says that&#160;BirdyChat&#160;and&#160;Haiket&#160;will be the first third-party services to implement messaging interoperability with WhatsApp. No, we haven&#8217;t [&#8230;]...</description>
    </item>
    <item>
      <title>Relev&#233;s t&#233;l&#233;phoniques, donn&#233;es de connexion&#8230; France Travail bient&#244;t dot&#233;e de &#171;&#160;nouveaux moyens d&#8217;enqu&#234;te&#160;&#187;&#160;?</title>
      <link>https://www.01net.com/actualites/releves-telephoniques-donnees-de-connexion-france-travail-bientot-dotee-de-nouveaux-moyens-denquete.html</link>
      <pubDate>Fri, 14 Nov 2025 10:37:35 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308104</guid>
      <description>Le projet de loi visant &#224; lutter contre les fraudes sociales et fiscales pourrait donner &#224; France Travail davantage d'outils pour v&#233;rifier que les allocataires r&#233;sident bien en France : des instruments jug&#233;s attentatoires aux libert&#233;s par l'opposition.</description>
    </item>
    <item>
      <title>Les premi&#232;res batteries semi-solides arrivent sur les v&#233;los &#233;lectriques : tout ce que &#231;a va changer</title>
      <link>https://www.frandroid.com/survoltes/velo-electrique/2869217_les-premieres-batteries-semi-solides-arrivent-sur-les-velos-electriques-tout-ce-que-ca-va-changer</link>
      <pubDate>Fri, 14 Nov 2025 10:37:18 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/survoltes/velo-electrique/2869217_les-premieres-batteries-semi-solides-arrivent-sur-les-velos-electriques-tout-ce-que-ca-va-changer</guid>
      <description>
Les premi&#232;res batteries semi-solides destin&#233;es au v&#233;lo &#233;lectrique s&#8217;appr&#234;tent &#224; entrer en production, une &#233;tape encore in&#233;dite dans ce secteur. Rep&#233;r&#233;e &#224; l&#8217;EICMA et pr&#233;sent&#233;e par T&amp;D, cette technologie promet une densit&#233; &#233;nerg&#233;tique nettement revue &#224; la hausse et une s&#233;curit&#233; renforc&#233;e.
</description>
    </item>
    <item>
      <title>Man of Tomorrow will reportedly feature a classic Superman foe &#8211; now it's time for James Gunn to comment on the worst-kept secret in Hollywood</title>
      <link>https://www.techradar.com/streaming/entertainment/man-of-tomorrow-will-reportedly-feature-a-classic-superman-foe-now-its-time-for-james-gunn-to-comment-on-the-worst-kept-secret-in-hollywood</link>
      <pubDate>Fri, 14 Nov 2025 10:35:36 +0000</pubDate>
      <guid isPermaLink="false">HpbYH9wrRWP2eWkYd3z4PF</guid>
      <description>A new report has seemingly confirmed the identity of the villain who'll appear in James Gunn's Superman sequel.</description>
    </item>
    <item>
      <title>Jusqu&#8217;&#224; 600 &#8364; de remise imm&#233;diate sur ses PC et tablettes : Lenovo lance son Black Friday maintenant et vous rembourse si les prix baissent plus tard [Sponso]</title>
      <link>https://www.frandroid.com/marques/lenovo/2863963_jusqua-600-e-de-remise-immediate-sur-ses-pc-et-tablettes-lenovo-lance-son-black-friday-maintenant-et-vous-rembourse-si-les-prix-baissent-plus-tard</link>
      <pubDate>Fri, 14 Nov 2025 10:32:00 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/lenovo/2863963_jusqua-600-e-de-remise-immediate-sur-ses-pc-et-tablettes-lenovo-lance-son-black-friday-maintenant-et-vous-rembourse-si-les-prix-baissent-plus-tard</guid>
      <description>
Lenovo vient tout juste de d&#233;voiler ses offres du Black Friday. Voici les meilleures affaires &#224; r&#233;aliser sur ses PC portables et ses tablettes, avec des remises imm&#233;diates pouvant atteindre jusqu'&#224; 600 euros.
</description>
    </item>
    <item>
      <title>You Won&#8217;t Be Able to Offload Your Holiday Shopping to AI Agents Anytime Soon</title>
      <link>https://www.wired.com/story/inside-the-dealmaking-to-make-agentic-shopping-a-reality/</link>
      <pubDate>Fri, 14 Nov 2025 10:30:00 +0000</pubDate>
      <guid isPermaLink="false">69134ba99e6e0c240d2d720b</guid>
      <description>Chatbot developers and retail giants are battling over user data as they lay the foundation for a future in which AI agents can do all your online shopping for you.</description>
    </item>
    <item>
      <title>A new film reveals just how hard it was to make the &#8216;female Viagra&#8217;</title>
      <link>https://www.fastcompany.com/91439618/a-new-film-reveals-just-how-hard-it-was-to-make-the-female-viagra</link>
      <pubDate>2025-11-14T10:30:00</pubDate>
      <guid isPermaLink="false">https://www.fastcompany.com/91439618/a-new-film-reveals-just-how-hard-it-was-to-make-the-female-viagra</guid>
      <description>Period startup Knix financed &#8216;The Pink Pill&#8217; as part of its broader mission of funding documentaries by female filmmakers.
After Viagra came to market in 1998, women began clamoring for a drug of their own. But it has taken decades for the medical community to take women&#8217;s sexual health seriously&#8212;and even longer to develop and approve a drug that improves women&#8217;s libido....</description>
    </item>
    <item>
      <title>Non, la Steam Machine ne va ni tuer PlayStation ni tuer Nintendo</title>
      <link>https://www.frandroid.com/actualites-generales/2868949_non-la-steam-machine-ne-va-ni-tuer-playstation-ni-tuer-nintendo</link>
      <pubDate>Fri, 14 Nov 2025 10:18:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/actualites-generales/2868949_non-la-steam-machine-ne-va-ni-tuer-playstation-ni-tuer-nintendo</guid>
      <description>
Le g&#233;ant du PC est un nain pour le secteur des consoles de jeux.
</description>
    </item>
    <item>
      <title>The Arc Raiders devs are tweaking the community unlock event due to players being too generous with donations &#8211; &#8216;We had no idea all of you would be so altruistic for the Stella Montis cause&#8217;</title>
      <link>https://www.techradar.com/gaming/the-arc-raiders-devs-are-tweaking-the-community-unlock-event-due-to-players-being-too-generous-with-donations</link>
      <pubDate>Fri, 14 Nov 2025 10:14:50 +0000</pubDate>
      <guid isPermaLink="false">aLBkJ97B46JEUR2onCAEuG</guid>
      <description>Arc Raiders devs have been surprised by how quickly players are progressing through the community unlock event.</description>
    </item>
    <item>
      <title>Missed out on Netflix&#8217;s Stranger Things season 5 episode 1 screening? I asked lucky fans why we&#8217;re &#8216;not ready&#8217; to return to the Upside Down</title>
      <link>https://www.techradar.com/streaming/netflix/missed-out-on-netflixs-stranger-things-season-5-episode-1-screening-i-asked-lucky-fans-why-were-not-ready-to-return-to-the-upside-down</link>
      <pubDate>Fri, 14 Nov 2025 10:14:44 +0000</pubDate>
      <guid isPermaLink="false">zJZChW2cU6GDCh3Ubn37V8</guid>
      <description>Netflix has unveiled Stranger Things season 5 episode 1 to fans in a super secret screening &#8211; and according to them, we&#8217;ll be &#8216;surprised&#8217; by what&#8217;s in store.</description>
    </item>
    <item>
      <title>La &#171;&#160;recharge&#160;&#187; des voitures &#233;lectriques en 3 minutes prend d&#233;j&#224; l&#8217;eau en Europe avec cette d&#233;cision d&#8217;une marque chinoise</title>
      <link>https://www.frandroid.com/marques/nio/2868829_la-recharge-des-voitures-electriques-en-3-minutes-prend-deja-leau-en-europe-avec-cette-decision-dune-marque-chinoise</link>
      <pubDate>Fri, 14 Nov 2025 10:14:05 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/marques/nio/2868829_la-recharge-des-voitures-electriques-en-3-minutes-prend-deja-leau-en-europe-avec-cette-decision-dune-marque-chinoise</guid>
      <description>
Nio vient de fermer sa seule station d&#8217;&#233;change de batterie au Danemark. Si le constructeur chinois en poss&#232;de d&#8217;autres en Europe, &#231;a ne sent pas bon pour la recharge en 3 minutes de ses voitures &#233;lectriques.
</description>
    </item>
    <item>
      <title>N&#8217;utilisez plus ces produits Belkin : un risque d&#8217;incendie force le rappel de batteries externes et d&#8217;un chargeur</title>
      <link>https://www.frandroid.com/produits-android/hardware/batterie/2869013_nutilisez-plus-ces-produits-belkin-un-risque-dincendie-force-le-rappel-de-batteries-externes-et-dun-chargeur</link>
      <pubDate>Fri, 14 Nov 2025 10:13:14 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/hardware/batterie/2869013_nutilisez-plus-ces-produits-belkin-un-risque-dincendie-force-le-rappel-de-batteries-externes-et-dun-chargeur</guid>
      <description>
Si vous &#234;tes en possession d'un de ces trois accessoires Belkin, cessez de l'utiliser, il peut &#234;tre dangereux.
</description>
    </item>
    <item>
      <title>Ce cadre photo num&#233;rique g&#233;n&#232;re ses propres &#339;uvres d&#8217;art</title>
      <link>https://www.frandroid.com/produits-android/maison-connectee/2869099_ce-cadre-photo-numerique-genere-ses-propres-oeuvres-dart</link>
      <pubDate>Fri, 14 Nov 2025 10:12:12 +0000</pubDate>
      <guid isPermaLink="false">https://www.frandroid.com/produits-android/maison-connectee/2869099_ce-cadre-photo-numerique-genere-ses-propres-oeuvres-dart</guid>
      <description>
SwitchBot d&#233;barque avec un cadre photo num&#233;rique qui g&#233;n&#232;re ses propres &#339;uvres d'art gr&#226;ce &#224; l'IA. 
</description>
    </item>
    <item>
      <title>&#171;&#160;Faux pilote&#160;&#187; aux commandes d&#8217;Airbus&#160;: il aurait fait voler des avions dans plusieurs pays d&#8217;Europe</title>
      <link>https://www.01net.com/actualites/faux-pilote-aux-commandes-dairbus-il-aurait-fait-voler-des-avions-dans-plusieurs-pays-deurope.html</link>
      <pubDate>Fri, 14 Nov 2025 10:08:42 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308115</guid>
      <description>Un homme a menti sur ses dipl&#244;mes pour devenir commandant de bord. Il aurait vol&#233; tout l'&#233;t&#233; sur des Airbus A320 en Europe. Une enqu&#234;te est ouverte.</description>
    </item>
    <item>
      <title>The new age of layered security: from supply chains to endpoints</title>
      <link>https://www.techradar.com/pro/the-new-age-of-layered-security-from-supply-chains-to-endpoints</link>
      <pubDate>Fri, 14 Nov 2025 10:01:41 +0000</pubDate>
      <guid isPermaLink="false">ncPsNEPc7BdzxUYUmRMynG</guid>
      <description>As threats below the OS rise, organizations need a layered strategy for true resilience.</description>
    </item>
    <item>
      <title>Airports and Airlines Are Crawling Out of the Shutdown</title>
      <link>https://www.wired.com/story/airports-and-airlines-are-crawling-out-of-the-shutdown/</link>
      <pubDate>Fri, 14 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">6914dfb81fc5a76c0f4ed2cf</guid>
      <description>The US government shutdown may be over, but the flying troubles aren&#8217;t&#8212;especially heading into the holiday season.</description>
    </item>
    <item>
      <title>Scientists detect solar storm bursting from a nearby star</title>
      <link>https://mashable.com/article/coronal-mass-ejection-distant-star-solar-storm</link>
      <pubDate>Fri, 14 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01OzVUfkb2uC1n3RTOMxmeK</guid>
      <description>Astronomers have for the first time detected a coronal mass ejection from another star, shedding light on worlds orbiting red dwarfs.</description>
    </item>
    <item>
      <title>Get Microsoft Office for life at $60, so you don&#8217;t need Microsoft 365</title>
      <link>https://mashable.com/article/nov-14-microsoft-office-home-business-for-mac-2021</link>
      <pubDate>Fri, 14 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02wnORZP6C5dXm1n4yVzoJD</guid>
      <description>Skip Microsoft 365 fees. Get lifetime access to Word, Excel, PowerPoint, Outlook, and more with Office 2021 for Mac &#8212; just $59.97, no subscription.</description>
    </item>
    <item>
      <title>Apple&#8217;s M2 MacBook Air just hit the sweet spot at 40% off</title>
      <link>https://mashable.com/article/nov-14-apple-macbook-air-8gb-ram-256gb</link>
      <pubDate>Fri, 14 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00uMaelPMhlXUEFOYxWQk2V</guid>
      <description>Get a like-new Apple MacBook Air 15-inch (2023) with M2 chip for just $769.99 (reg. $1,299)&#8212;powerful, portable, and perfect for gifting.</description>
    </item>
    <item>
      <title>Arco review: If you love animation, you need to see this gorgeous climate change fable</title>
      <link>https://mashable.com/article/arco-review</link>
      <pubDate>Fri, 14 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">01mPYWZ7w8OJMgdJFK3KqOB</guid>
      <description>Ugo Bienvenu's "Arco," about a lost time traveler, is one of the best animated films of the year.</description>
    </item>
    <item>
      <title>The Running Man has an unexpected connection to Pennywise</title>
      <link>https://mashable.com/article/the-running-man-derry-connection-stephen-king</link>
      <pubDate>Fri, 14 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">031W92YZ7JQxzNObJT5H8mX</guid>
      <description>If you're watching "The Running Man," don't expect to outpace the Stephen King universe of it all.</description>
    </item>
    <item>
      <title>I ran the NYC Marathon wearing 7 fitness trackers and they all watched me throw up</title>
      <link>https://mashable.com/article/i-ran-nyc-marathon-wearing-7-fitness-trackers</link>
      <pubDate>Fri, 14 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">04D1ddzGXfAY8Bi6CjlN1jm</guid>
      <description>I ran the New York City Marathon wearing seven fitness trackers, and I don't even regret it. On my journey, two pieces of fitness tech really impressed me.</description>
    </item>
    <item>
      <title>The Running Man has a cheeky cameo. Sort of.</title>
      <link>https://mashable.com/article/the-running-man-arnold-schwarzenegger-cameo</link>
      <pubDate>Fri, 14 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">04hirDLvw62EVakIGLjSMEQ</guid>
      <description>Of course "The Running Man" was going to have some kind of Arnold Schwarzenegger cameo. But how does Edgar Wright's film pull it off?</description>
    </item>
    <item>
      <title>In Your Dreams review: Kids fight to save their parents marriage in thoughtful animated adventure</title>
      <link>https://mashable.com/article/in-your-dreams-review-netflix</link>
      <pubDate>Fri, 14 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">02ip4vGx9q5FqpNUg0v1Zwu</guid>
      <description>Director Alex Woo's feature debut "In Your Dreams" is a magical adventure about two kids trying to save their parents' marriage.</description>
    </item>
    <item>
      <title>Bunny review: Hilarious and heartfelt, this love letter to New York is a must-see</title>
      <link>https://mashable.com/article/bunny-review-mo-stark</link>
      <pubDate>Fri, 14 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">05NKz7LqT0HCkQXBsyKs9n6</guid>
      <description>Don't overlook the festival treasure now coming to theaters: "Bunny," a hilarious, heartfelt love letter to New York.</description>
    </item>
    <item>
      <title>Jay Kelly review: George Clooney charms in showbiz comedy about how stars arent just like us</title>
      <link>https://mashable.com/article/jay-kelly-review</link>
      <pubDate>Fri, 14 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">06X9qeDA3XcG0SGTN4aoxwb</guid>
      <description>Adam Sandler, Laura Dern, Billy Crudup and Emily Mortimer co-star in Noah Baumbach's latest movie.</description>
    </item>
    <item>
      <title>Nouvelle Vague review: Richard Linklaters tribute to Jean-Luc Godard and Breathless is good vibes only</title>
      <link>https://mashable.com/article/nouvelle-vague-review-richard-linklater</link>
      <pubDate>Fri, 14 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">022IWg3rSrvEtXBfMFyMOjH</guid>
      <description>Richard Linklater's love letter to Jean-Luc Godard's "Breathless" and the French New Wave is a chill tribute. Review.</description>
    </item>
    <item>
      <title>Eddington review: Ari Aster misfires as Pedro Pascal and Joaquin Phoenix face off</title>
      <link>https://mashable.com/article/eddington-joaquin-phoenix-review</link>
      <pubDate>Fri, 14 Nov 2025 10:00:00 +0000</pubDate>
      <guid isPermaLink="false">00olcfGXS0PzY8Qkbz1W6c9</guid>
      <description>Ari Aster's "Eddington" is a COVID-era comedy with a mean streak, starring Pedro Pascal and Joaquin Phoenix. Review.</description>
    </item>
    <item>
      <title>Phew, the 2025 MacBook Air M4 is back to its record-low price at Amazon &#8212; save over $200 ahead of Black Friday</title>
      <link>https://mashable.com/article/nov-14-apple-macbook-air-deal</link>
      <pubDate>Fri, 14 Nov 2025 09:59:43 +0000</pubDate>
      <guid isPermaLink="false">02qicSQra7qjuXvPzgF0WQ8</guid>
      <description>Find the best early Black Friday MacBook deal. The 2025 Apple MacBook Air M4 is on sale for $749.99 at Amazon.</description>
    </item>
    <item>
      <title>Red Dead Redemption se refait une beaut&#233; sur les consoles et arrive sur Android et iOS</title>
      <link>https://www.01net.com/actualites/red-dead-redemption-se-refait-une-beaute-sur-les-consoles-et-arrive-sur-android-et-ios.html</link>
      <pubDate>Fri, 14 Nov 2025 09:47:54 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308128</guid>
      <description>Le premier volet de la franchise de Rockstar Games, Red Dead Redemption va faire son grand retour sur la PS5, les Xbox series S et X, la Switch 2, et va faire son entr&#233;e sur iOS et Android.</description>
    </item>
    <item>
      <title>The iRobot Roomba Plus 405 is at its lowest-ever price at Amazon &#8212; save over $200 ahead of Black Friday</title>
      <link>https://mashable.com/article/nov-14-irobot-roomba-deal</link>
      <pubDate>Fri, 14 Nov 2025 09:47:22 +0000</pubDate>
      <guid isPermaLink="false">05nKYOCn8Cv5WsHG0FHYgai</guid>
      <description>Find the best early Black Friday robot vacuum deal. Save 36% on the iRobot Roomba Plus 405 at Amazon.</description>
    </item>
    <item>
      <title>La fus&#233;e de Jeff Bezos impressionne par cet exploit r&#233;ussi cette nuit : voici pourquoi la Nasa pourrait changer d&#8217;avis</title>
      <link>https://www.futura-sciences.com/sciences/actualites/acces-espace-fusee-jeff-bezos-impressionne-cet-exploit-reussi-cette-nuit-voici-nasa-pourrait-changer-avis-127505/#xtor%3DRSS-8</link>
      <pubDate>Fri, 14 Nov 2025 10:43:30 +0100</pubDate>
      <guid isPermaLink="false">https://www.futura-sciences.com/sciences/actualites/acces-espace-fusee-jeff-bezos-impressionne-cet-exploit-reussi-cette-nuit-voici-nasa-pourrait-changer-avis-127505/#xtor%3DRSS-8</guid>
      <description>Blue Origin, l&#8217;entreprise spatiale fond&#233;e par Jeff Bezos, a accompli un exploit technologique remarquable lors du deuxi&#232;me vol de qualification de son lanceur. La soci&#233;t&#233; a r&#233;ussi &#224; r&#233;cup&#233;rer l&#8217;&#233;tage principal de sa fus&#233;e, une capacit&#233; que ne poss&#232;de pas Ariane 6, tout en lan&#231;ant une mission...</description>
    </item>
    <item>
      <title>Call Recording is rolling out to some Google Pixel phones now &#8211; here&#8217;s how to use it</title>
      <link>https://www.techradar.com/phones/google-pixel-phones/call-recording-is-rolling-out-to-some-google-pixel-phones-now-heres-how-to-use-it</link>
      <pubDate>Fri, 14 Nov 2025 09:42:34 +0000</pubDate>
      <guid isPermaLink="false">qgtbbrEgxpWXU3v6Drqyxa</guid>
      <description>Call Recording is an alternative to Call Notes for Pixel models that lack the AI skills for the latter, and it's rolling out now.</description>
    </item>
    <item>
      <title>Google Home 4.3 est l&#224; : voici ce que vous allez remarquer en premier</title>
      <link>https://www.01net.com/actualites/google-home-4-3-ce-que-vous-allez-remarquer-premier.html</link>
      <pubDate>Fri, 14 Nov 2025 09:39:27 +0000</pubDate>
      <guid isPermaLink="false">https://www.01net.com/?p=1308098</guid>
      <description>Google Home re&#231;oit une mise &#224; jour assez fournie. Vous devriez remarquer que l&#8217;application va un peu plus vite et que certaines fonctions deviennent plus simples &#224; utiliser.</description>
    </item>
    <item>
      <title>Procurement in 2025: Building foundations for strategic supplier relationships in a changing world</title>
      <link>https://www.techradar.com/pro/procurement-in-2025-building-foundations-for-strategic-supplier-relationships-in-a-changing-world</link>
      <pubDate>Fri, 14 Nov 2025 09:37:06 +0000</pubDate>
      <guid isPermaLink="false">DoYAinEisMFD7tuobNQ32Q</guid>
      <description>Amy Worth, Director of Amazon Business UK and Public Sector Customers EU, shares her perspective on the challenges and opportunities shaping procurement in 2025</description>
    </item>
  </channel>
</rss>
